{
    "accessibility": "Open access",
    "additionDate": "2022-05-16T20:51:53.627399Z",
    "biotoolsCURIE": "biotools:stackdppiv",
    "biotoolsID": "stackdppiv",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong"
        },
        {
            "name": "Balachandran Manavalan"
        },
        {
            "name": "Phasit Charoenkwan"
        }
    ],
    "description": "A novel computational approach for accurate prediction of dipeptidyl peptidase IV (DPP-IV) inhibitory peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://pmlabstack.pythonanywhere.com/StackDPPIV",
    "lastUpdate": "2022-05-16T20:51:53.629959Z",
    "name": "StackDPPIV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2021.12.001",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.The development of efficient and effective bioinformatics tools and pipelines for identifying peptides with dipeptidyl peptidase IV (DPP-IV) inhibitory activities from large-scale protein datasets is of great importance for the discovery and development of potential and promising antidiabetic drugs. In this study, we present a novel stacking-based ensemble learning predictor (termed StackDPPIV) designed for identification of DPP-IV inhibitory peptides. Unlike the existing method, which is based on single-feature-based methods, we combined five popular machine learning algorithms in conjunction with ten different feature encodings from multiple perspectives to generate a pool of various baseline models. Subsequently, the probabilistic features derived from these baseline models were systematically integrated and deemed as new feature representations. Finally, in order to improve the predictive performance, the genetic algorithm based on the self-assessment-report was utilized to determine a set of informative probabilistic features and then used the optimal one for developing the final meta-predictor (StackDPPIV). Experiment results demonstrated that StackDPPIV could outperform its constituent baseline models on both the training and independent datasets. Furthermore, StackDPPIV achieved an accuracy of 0.891, MCC of 0.784 and AUC of 0.961, which were 9.4%, 19.0% and 11.4%, respectively, higher than that of the existing method on the independent test. Feature analysis demonstrated that our feature representations had more discriminative ability as compared to conventional feature descriptors, which highlights the combination of different features was essential for the performance improvement. In order to implement the proposed predictor, we had built a user-friendly online web server at http://pmlabstack.pythonanywhere.com/StackDPPIV.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Lio' P."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Moni M.A."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods",
                "title": "StackDPPIV: A novel computational approach for accurate prediction of dipeptidyl peptidase IV (DPP-IV) inhibitory peptides"
            },
            "pmid": "34883239"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
