{
    "additionDate": "2021-01-18T11:20:56Z",
    "biotoolsCURIE": "biotools:luminous",
    "biotoolsID": "luminous",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "maryse.fortin@concordia.ca",
            "name": "Maryse Fortin",
            "orcidid": "https://orcid.org/0000-0002-1189-3591",
            "typeEntity": "Person"
        }
    ],
    "description": "lumbar multifidus muscle segmentation from ultrasound images.\n\nLUMINOUS Database: Lumbar MUltifidus Muscle SegmentatIoN FrOm UltraSound.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://data.sonography.ai",
    "lastUpdate": "2021-02-19T08:09:52Z",
    "name": "LUMINOUS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12891-020-03679-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Among the paraspinal muscles, the structure and function of the lumbar multifidus (LM) has become of great interest to researchers and clinicians involved in lower back pain and muscle rehabilitation. Ultrasound (US) imaging of the LM muscle is a useful clinical tool which can be used in the assessment of muscle morphology and function. US is widely used due to its portability, cost-effectiveness, and ease-of-use. In order to assess muscle function, quantitative information of the LM must be extracted from the US image by means of manual segmentation. However, manual segmentation requires a higher level of training and experience and is characterized by a level of difficulty and subjectivity associated with image interpretation. Thus, the development of automated segmentation methods is warranted and would strongly benefit clinicians and researchers. The aim of this study is to provide a database which will contribute to the development of automated segmentation algorithms of the LM. Construction and content: This database provides the US ground truth of the left and right LM muscles at the L5 level (in prone and standing positions) of 109 young athletic adults involved in Concordia University’s varsity teams. The LUMINOUS database contains the US images with their corresponding manually segmented binary masks, serving as the ground truth. The purpose of the database is to enable development and validation of deep learning algorithms used for automatic segmentation tasks related to the assessment of the LM cross-sectional area (CSA) and echo intensity (EI). The LUMINOUS database is publicly available at http://data.sonography.ai. Conclusion: The development of automated segmentation algorithms based on this database will promote the standardization of LM measurements and facilitate comparison among studies. Moreover, it can accelerate the clinical implementation of quantitative muscle assessment in clinical and research settings.",
                "authors": [
                    {
                        "name": "Belasso C.J."
                    },
                    {
                        "name": "Behboodi B."
                    },
                    {
                        "name": "Benali H."
                    },
                    {
                        "name": "Boily M."
                    },
                    {
                        "name": "Rivaz H."
                    },
                    {
                        "name": "Fortin M."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Musculoskeletal Disorders",
                "title": "LUMINOUS database: lumbar multifidus muscle segmentation from ultrasound images"
            },
            "pmcid": "PMC7585198",
            "pmid": "33097024"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        }
    ]
}