{
    "additionDate": "2021-01-18T10:54:05Z",
    "biotoolsCURIE": "biotools:mutarget",
    "biotoolsID": "mutarget",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gyorffy.balazs@med.semmelweis-univ.hu",
            "name": "Balázs Győrffy",
            "typeEntity": "Person"
        }
    ],
    "description": "A platform linking gene expression changes and mutation status in solid tumors.\n\nconnect mutation status to gene expression changes in solid tumours.\n\nmuTarget is a cancer biomarker / target discovery tool with two major functions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://www.mutarget.com",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-02T08:27:54Z",
    "name": "muTarget",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/IJC.33283",
            "metadata": {
                "abstract": "© 2020 The Authors. International Journal of Cancer published by John Wiley & Sons Ltd on behalf of Union for International Cancer Control.Large oncology repositories have paired genomic and transcriptomic data for all patients. We used these data to perform two independent analyses: to identify gene expression changes related to a gene mutation and to identify mutations altering the expression of a selected gene. All data processing steps were performed in the R statistical environment. RNA-sequencing and mutation data were acquired from The Cancer Genome Atlas (TCGA). The DESeq2 algorithm was applied for RNA-seq normalization, and transcript variants were annotated with AnnotationDbi. MuTect2-identified somatic mutation data were utilized, and the MAFtools Bioconductor program was used to summarize the data. The Mann-Whitney U test was used for differential expression analysis. The established database contains 7876 solid tumors from 18 different tumor types with both somatic mutation and RNA-seq data. The utility of the approach is presented via three analyses in breast cancer: gene expression changes related to TP53 mutations, gene expression changes related to CDH1 mutations and mutations resulting in altered progesterone receptor (PGR) expression. The breast cancer database was split into equally sized training and test sets, and these data sets were analyzed independently. The highly significant overlap of the results (chi-square statistic = 16 719.7 and P <.00001) validates the presented pipeline. Finally, we set up a portal at http://www.mutarget.com enabling the rapid identification of novel mutational targets. By linking somatic mutations and gene expression, it is possible to identify biomarkers and potential therapeutic targets in different types of solid tumors. The registration-free online platform can increase the speed and reduce the development cost of novel personalized therapies.",
                "authors": [
                    {
                        "name": "Gyorffy B."
                    },
                    {
                        "name": "Nagy A."
                    }
                ],
                "citationCount": 5,
                "date": "2021-01-15T00:00:00Z",
                "journal": "International Journal of Cancer",
                "title": "muTarget: A platform linking gene expression changes and mutation status in solid tumors"
            },
            "pmid": "32875562"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
