{
    "additionDate": "2020-01-14T20:06:49Z",
    "biotoolsCURIE": "biotools:ClusPro2",
    "biotoolsID": "ClusPro2",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "z.hojati@sci.ui.ac.ir",
            "name": "Zohreh Hojati",
            "orcidid": "https://orcid.org/0000-0003-4831-0123",
            "typeEntity": "Person"
        }
    ],
    "description": "The Comparison Between the Mutated HuIFN-β 27-101 and the Wild Type Interferon β.\n\nClusPro should only be used for noncommercial purposes.\n\nUse the server without the benefits of your own account.\n\n||| NAME (ClusPro2) SIMILAR TO (PUB. DIFFERENT) bio.tools/cluspro (ClusPro).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'asaview', 'verify3D', 'HuIFN-b mHuIFN-b-27 mHuIFN-b-101', 'HuIFN-b mHuIFN-b-27 mHuIFN-b-101 mHuIFN-b-27-101'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual PCR",
                    "uri": "http://edamontology.org/operation_0307"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "https://cluspro.org",
    "lastUpdate": "2020-01-14T20:06:49Z",
    "name": "ClusPro2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.15171/APB.2019.074",
            "metadata": {
                "abstract": "© 2019 The Author (s).Purpose: Interferon beta (IFN-β) is used to combat multiple sclerosis (MS) disease. Creating R27T and V101F mutations (mHuIFN-β-27 and mHuIFN-β-101) is one of the tasks performed to improve human interferon beta (HuIFN-β) half-life, function and expression. In this work, the impact of R27T and V101F mutations in recombinant IFN-β on its binding to interferon receptors were studied by molecular docking. Methods: This work was performed through in silico study. The simulation of mutation was performed using the online Rosetta Backrub software and checked using server verify3D. Comparison of access to the solvent of the amino acids in the structures created was performed using the asaview online server. Also, the effect of mutations on the fold of the protein was reviewed by the online HOPE server. The molecular docking was performed between HuIFN-β and the external region of IFNAR receptor using the online ClusPro2 protein-protein docking server. Results: The comparison of the values of the negative binding energy (ΔGbind) obtained from protein-protein molecular docking between IFNAR receptor and HuIFN-β, mHuIFN-β-27, mHuIFN-β-101 and mHuIFN-β-27-101 ligands did not show a significant difference, and these differences do not see any meaningful relationship between them (P > 0.9999). Conclusion: Regarding these results, it can be concluded that these mutations do not have a negative effect on the composition of the complex rHuIFN-β/IFNAR. So, they do not interfere with the binding of the IFN-β to the receptor. It is concluded that the quality of the rHuIFN-β is improved by introducing these two mutations.",
                "authors": [
                    {
                        "name": "Balkhi S.S."
                    },
                    {
                        "name": "Hojati Z."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Advanced Pharmaceutical Bulletin",
                "title": "The comparison between the mutated HuIFN-β 27-101 and the wild type interferon β: The comprehensive in silico study to evaluate the effect of mutations on IFN-β"
            },
            "pmcid": "PMC6912172",
            "pmid": "31857969"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}