{
    "additionDate": "2017-12-18T00:14:46Z",
    "biotoolsCURIE": "biotools:edmr",
    "biotoolsID": "edmr",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.mdc-berlin.de/"
        }
    ],
    "description": "An R program for comprehensive DMR (differentially methylated regions) analysis based on bimodal normal distribution model and cost function for regional methylation analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://code.google.com/archive/p/edmr/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "https://code.google.com/p/edmr/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/edmr-0-5-1-r-program-for-empirical-dmr-analysis.html"
        }
    ],
    "name": "eDMR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-S5-S10",
            "metadata": {
                "abstract": "Background: DNA methylation profiling reveals important differentially methylated regions (DMRs) of the genome that are altered during development or that are perturbed by disease. To date, few programs exist for regional analysis of enriched or whole-genome bisulfate conversion sequencing data, even though such data are increasingly common. Here, we describe an open-source, optimized method for determining empirically based DMRs (eDMR) from high-throughput sequence data that is applicable to enriched whole-genome methylation profiling datasets, as well as other globally enriched epigenetic modification data.Results: Here we show that our bimodal distribution model and weighted cost function for optimized regional methylation analysis provides accurate boundaries of regions harboring significant epigenetic modifications. Our algorithm takes the spatial distribution of CpGs into account for the enrichment assay, allowing for optimization of the definition of empirical regions for differential methylation. Combined with the dependent adjustment for regional p-value combination and DMR annotation, we provide a method that may be applied to a variety of datasets for rapid DMR analysis. Our method classifies both the directionality of DMRs and their genome-wide distribution, and we have observed that shows clinical relevance through correct stratification of two Acute Myeloid Leukemia (AML) tumor sub-types.Conclusions: Our weighted optimization algorithm eDMR for calling DMRs extends an established DMR R pipeline (methylKit) and provides a needed resource in epigenomics. Our method enables an accurate and scalable way of finding DMRs in high-throughput methylation sequencing experiments. eDMR is available for download at http://code.google.com/p/edmr/. © 2013 Li et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Garrett-Bakelman F.E."
                    },
                    {
                        "name": "Akalin A."
                    },
                    {
                        "name": "Zumbo P."
                    },
                    {
                        "name": "Levine R."
                    },
                    {
                        "name": "To B.L."
                    },
                    {
                        "name": "Lewis I.D."
                    },
                    {
                        "name": "Brown A.L."
                    },
                    {
                        "name": "D'Andrea R.J."
                    },
                    {
                        "name": "Melnick A."
                    },
                    {
                        "name": "Mason C.E."
                    }
                ],
                "citationCount": 62,
                "date": "2013-04-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "An optimized algorithm for detecting and annotating regional differential methylation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1,
    "version": [
        "0.5.1"
    ]
}