{
    "accessibility": "Open access",
    "additionDate": "2021-11-24T15:06:10.635103Z",
    "biotoolsCURIE": "biotools:cubdl",
    "biotoolsID": "cubdl",
    "confidence_flag": "tool",
    "description": "Deep Learning for Ultrasound Image Formation. Ultrasound Beamforming with Deep Learning (CUBDL): Evaluation Framework and Open Datasets",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://cubdl.jhu.edu",
    "lastUpdate": "2021-11-24T15:06:10.637641Z",
    "name": "CUBDL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TUFFC.2021.3094849",
            "metadata": {
                "abstract": "CCBYDeep learning for ultrasound image formation is rapidly garnering research support and attention, quickly rising as the latest frontier in ultrasound image formation, with much promise to balance both image quality and display speed. Despite this promise, one challenge with identifying optimal solutions is the absence of unified evaluation methods and datasets that are not specific to a single research group. This paper introduces the largest known international database of ultrasound channel data and describes associated evaluation methods that were initially developed for the Challenge on Ultrasound Beamforming with Deep Learning (CUBDL), which was offered as a component of the 2020 IEEE International Ultrasonics Symposium. We summarize the challenge results and present qualitative and quantitative assessments using both the initially closed CUBDL evaluation test dataset (which was crowd-sourced from multiple groups around the world) and additional in vivo breast ultrasound data contributed after the challenge was completed. As an example quantitative assessment, single plane wave images from the CUBDL Task 1 dataset produced a mean generalized contrast-to-noise ratio (gCNR) of 0.67 and a mean lateral resolution of 0.42 mm when formed with delay-and-sum beamforming, compared to a mean gCNR as high as 0.81 and a mean lateral resolution as low as 0.32 mm when formed with networks submitted by the challenge winners. We also describe contributed CUBDL data that may be used for training of future networks. The compiled database includes a total of 576 image acquisition sequences. We additionally introduce a neural network-based global sound speed estimator implementation that was necessary to fairly evaluate results obtained with this international database. The integration of CUBDL evaluation methods, evaluation code, network weights from the challenge winners, and all datasets described herein are publicly available (visit https://cubdl.jhu.edu for details).",
                "authors": [
                    {
                        "name": "Asif A."
                    },
                    {
                        "name": "Eickel K."
                    },
                    {
                        "name": "Eldar Y.C."
                    },
                    {
                        "name": "Goudarzi S."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Hyun D."
                    },
                    {
                        "name": "Lediju Bell M.A."
                    },
                    {
                        "name": "Mischi M."
                    },
                    {
                        "name": "Rivaz H."
                    },
                    {
                        "name": "Rothlubbers S."
                    },
                    {
                        "name": "Sinden D."
                    },
                    {
                        "name": "Strohm H."
                    },
                    {
                        "name": "Van Sloun R.J."
                    },
                    {
                        "name": "Wiacek A."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control",
                "title": "Deep Learning for Ultrasound Image Formation: CUBDL Evaluation Framework &#x0026;amp; Open Datasets"
            },
            "pmid": "34224351"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        }
    ],
    "validated": 1
}
