{
    "accessibility": "Open access",
    "additionDate": "2024-05-24T10:30:05.570301Z",
    "biotoolsCURIE": "biotools:srnafrag",
    "biotoolsID": "srnafrag",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dengy@hawaii.edu",
            "name": "Youping Deng",
            "typeEntity": "Person"
        },
        {
            "name": "Ken Nakatsu",
            "typeEntity": "Person"
        }
    ],
    "description": "Pipeline and suite of tools to analyze fragmentation in small RNA sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kenminsoo/sRNAfrag",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-05-24T10:30:05.572720Z",
    "license": "MIT",
    "name": "sRNAfrag",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbad515",
            "metadata": {
                "abstract": "Fragments derived from small RNAs such as small nucleolar RNAs are biologically relevant but remain poorly understood. To address this gap, we developed sRNAfrag, a modular and interoperable tool designed to standardize the quantification and analysis of small RNA fragmentation across various biotypes. The tool outputs a set of tables forming a relational database, allowing for an in-depth exploration of biologically complex events such as multi-mapping and RNA fragment stability across different cell types. In a benchmark test, sRNAfrag was able to identify established loci of mature microRNAs solely based on sequencing data. Furthermore, the 5' seed sequence could be rediscovered by utilizing a visualization approach primarily applied in multi-sequence-alignments. Utilizing the relational database outputs, we detected 1411 snoRNA fragment conservation events between two out of four eukaryotic species, providing an opportunity to explore motifs through evolutionary time and conserved fragmentation patterns. Additionally, the tool's interoperability with other bioinformatics tools like ViennaRNA amplifies its utility for customized analyses. We also introduce a novel loci-level variance-score which provides insights into the noise around peaks and demonstrates biological relevance by distinctly separating breast cancer and neuroblastoma cell lines after dimension reduction when applied to small nucleolar RNAs. Overall, sRNAfrag serves as a versatile foundation for advancing our understanding of small RNA fragments and offers a functional foundation to further small RNA research. Availability: https://github.com/kenminsoo/sRNAfrag.",
                "authors": [
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Jijiwa M."
                    },
                    {
                        "name": "Khadka V."
                    },
                    {
                        "name": "Nakatsu K."
                    },
                    {
                        "name": "Nasu M."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "sRNAfrag: A pipeline and suite of tools to analyze fragmentation in small RNA sequencing data"
            },
            "pmcid": "PMC10796253",
            "pmid": "38243693"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
