{
    "accessibility": "Open access",
    "additionDate": "2022-06-17T13:14:02.346130Z",
    "biotoolsCURIE": "biotools:ktop",
    "biotoolsID": "ktop",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gregor.miller@tum.de",
            "name": "Gregor Miller"
        },
        {
            "name": "Volker Assfalg"
        }
    ],
    "description": "Kidney Transplantation Outcome Predictions (KTOP) allows the prediction of certain outcomes after kidney transplantations from brain-dead deceased donors.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://riskcalc.org/ktop/",
    "lastUpdate": "2022-06-17T13:14:02.348675Z",
    "license": "Not licensed",
    "name": "KTOP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.EURURO.2021.12.008",
            "metadata": {
                "abstract": "© 2021 European Association of UrologyBackground: European kidney donation shortages mandate efficient organ allocation by optimizing the prediction of success for individual recipients. Objective: To develop the first European online risk tool for kidney transplant outcomes on the basis of recipient-only and recipient plus donor characteristics. Design, setting, and participants: We used individual recipient and donor risk factors and three outcomes (death, death with functioning graft [DWFG], and graft loss) for 32 958 transplants within the Eurotransplant kidney allocation system and the Eurotransplant senior program between January 2006 and May 2018 in eight European countries to develop and validate a risk tool. Outcome measurements and statistical analysis: Cox proportional-hazards models were used to analyze the association of risk factors with overall patient mortality, and proportional subdistribution hazard regression models for their association with graft loss and DWFG. Prediction models were developed with recipient-only and recipient-donor risk factors. Sensitivity analyses based on time-specific area under the receiver operating characteristic curve (AUC) with leave-one-country-out validation were performed and calibration plots were generated. Results and limitations: The 10-yr cumulative incidence rate was 37% for mortality, 12% for DWFG, and 41% for graft loss. In recipient-donor models the leading risk factors for mortality were recipient diabetes (hazard ratio [HR] 10.73), retransplantation (HR 3.08 per transplant), and recipient age (HR 1.08). Effects were similar for DWFG. For graft loss, diabetes (subdistributional HR [SHR] 1.32), increased donor age (SHR 1.02), and prolonged cold ischemia time (SHR 1.02) had increased SHRs. All p values were <0.001. Conclusions: Previously identified risk factors for outcomes following kidney transplants allow for outcome prediction with 10-yr AUC values of up to 0.81. Patient summary: Using European data, we estimated individual risks to predict the success of kidney transplants and support physicians in decision-making. An online tool is now available (https://riskcalc.org/ktop/) for predicting kidney transplant outcomes both before and after a donor has been identified.",
                "authors": [
                    {
                        "name": "Ankerst D.P."
                    },
                    {
                        "name": "Assfalg V."
                    },
                    {
                        "name": "Heemann U."
                    },
                    {
                        "name": "Huser N."
                    },
                    {
                        "name": "Kattan M.W."
                    },
                    {
                        "name": "Miller G."
                    },
                    {
                        "name": "Tieken I."
                    },
                    {
                        "name": "Vogelaar S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "European Urology",
                "title": "Kidney Transplantation Outcome Predictions (KTOP): A Risk Prediction Tool for Kidney Transplants from Brain-dead Deceased Donors Based on a Large European Cohort"
            },
            "pmid": "35000822"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
