
{
    "credit": [
        {
            "email": "njyudj@njust.edu.cn",
            "name": "Dong-Jun",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.csbio.sjtu.edu.cn:8080/OSML/History.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/osml-predicting-protein-ligand-binding-sites.html"
        }
    ],
    "publication": [
        {
            "abstract": "We are facing an era with annotated biological data rapidly and continuously generated. How to effectively incorporate new annotated data into the learning step is crucial for enhancing the performance of a bioinformatics prediction model. Although machine-learning-based methods have been extensively used for dealing with various biological problems, existing approaches usually train static prediction models based on fixed training datasets. The static approaches are found having several disadvantages such as low scalability and impractical when training dataset is huge. In view of this, we propose a dynamic learning framework for constructing query-driven prediction models. The key difference between the proposed framework and the existing approaches is that the training set for the machine learning algorithm of the proposed framework is dynamically generated according to the query input, as opposed to training a general model regardless of queries in traditional static methods. Accordingly, a query-driven predictor based on the smaller set of data specifically selected from the entire annotated base dataset will be applied on the query. The new way for constructing the dynamic model enables us capable of updating the annotated base dataset flexibly and using the most relevant core subset as the training set makes the constructed model having better generalization ability on the query, showing \"part could be better than all\" phenomenon. According to the new framework, we have implemented a dynamic protein-ligand binding sites predictor called OSML (On-site model for ligand binding sites prediction). Computer experiments on 10 different ligand types of three hierarchically organized levels show that OSML outperforms most existing predictors. The results indicate that the current dynamic framework is a promising future direction for bridging the gap between the rapidly accumulated annotated biological data and the effective machine-learning-based predictors. OSML web server and datasets are freely available at: http://www.csbio.sjtu.edu.cn/bioinf/OSML/ for academic use.",
            "authors": [
                "Yu D.-J.",
                "Hu J.",
                "Li Q.-M.",
                "Tang Z.-M.",
                "Yang J.-Y.",
                "Shen H.-B."
            ],
            "cit_count": 5,
            "journal": "IEEE transactions on nanobioscience",
            "pmid": "25730499",
            "title": "Constructing query-driven dynamic machine learning model with application to protein-ligand binding sites prediction",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:osml",
        "biotoolsID": "osml",
        "description": "Query-driven dynamic machine learning model for predicting protein-ligand binding sites.",
        "homepage": "http://www.csbio.sjtu.edu.cn:8080/OSML/",
        "name": "OSML"
    }
}