{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://liulab.dfci.harvard.edu/"}],"function":[{"operation":[{"term":"Microarray data analysis","uri":"http://edamontology.org/operation_2495"}]},{"operation":[{"term":"Detection","uri":"http://edamontology.org/operation_2423"}]},{"operation":[{"term":"Quality control","uri":"http://edamontology.org/operation_2428"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Probes","uri":"http://edamontology.org/topic_0632"},{"term":"Microarrays","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mbr-20070206-microarray-blob-remover.html"}],"publication":[{"abstract":"Motivation: New generation Affymetrix oligonucleotide microarrays often have blob-like image defects that will require investigators to either repeat their hybridization assays or analyze their data with the defects left in place. We investigated the effect of analyzing a spike-in experiment on Affymetrix ENCODE tiling arrays in the presence of simulated blobs covering between 1 and 9% of the array area. Using two different ChIP-chip tiling array analysis programs (Affymetrix tiling array software, TAS, and model-based analysis of tiling arrays, MAT), we found that even the smallest blob defects significantly decreased the sensitivity and increased the false discovery rate (FDR) of the spike-in target prediction. Results: We introduced a new software tool, the microarray blob remover (MBR), which allows rapid visualization, detection and removal of various blob defects from the CEL files of different types of Affymetrix microarrays. It is shown that using MBR significantly improves the sensitivity and FDR of a tiling array analysis compared to leaving the affected probes in the analysis. © 2007 The Author(s).","authors":["Song J.S.","Maghsoudi K.","Li W.","Fox E.","Quackenbush J.","Liu X.S."],"cit_count":16,"doi":"10.1093/bioinformatics/btm043","journal":"Bioinformatics","title":"Microarray blob-defect removal improves array analysis","type":"Primary","year":"2007-04-15"}],"summary":{"biotoolsCURIE":"biotools:mbr","biotoolsID":"mbr","description":"Microarray Blob Remover is a microarray tool which allows rapid visualization, detection, and removalof blob-like defects as an initial quality control step. The software allows rapid visualization, detection, and removal of blob defects of a variety of sizes and shapes from different types of microarrays using their .CEL files. Removal of the affected probes in the blob-defects using MBR was shown to improve sensitivity and FDR compared to leaving the affected probes in the analysis.","homepage":"http://liulab.dfci.harvard.edu/Software/MBR/MBR.htm.html","name":"MBR","version":["20070206"]}}