{
    "additionDate": "2017-08-03T18:55:23Z",
    "biotoolsCURIE": "biotools:pedimpute",
    "biotoolsID": "pedimpute",
    "credit": [
        {
            "email": "ezequiel.nicolazzi@tecnoparco.org",
            "name": "E.L.Nicolazzi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fortran program for rapid haplotype construction and genotype imputation for whole genome SNP panels in general pedigrees dominated by medium to large half-sib families as in dairy cattle data.",
    "documentation": [
        {
            "type": "General",
            "url": "http://dekoppel.eu/pedimpute/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://dekoppel.eu/pedimpute/",
    "homepage_status": 1,
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pedimpute-rapid-haplotype-construction-and-genotype-imputation.html"
        }
    ],
    "name": "PedImpute",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Routine genomic evaluations frequently include a preliminary imputation step, requiring high accuracy and reduced computing time. A new algorithm, PedImpute (http://dekoppel.eu/pedimpute/), was developed and compared with findhap (http://aipl.arsusda.gov/software/findhap/) and BEAGLE (http://faculty.washington.edu/browning/beagle/beagle.html), using 19,904 Holstein genotypes from a 4-country international collaboration (United States, Canada, UK, and Italy). Different scenarios were evaluated on a sample subset that included only single nucleotide polymorphism from the Bovine low-density (LD) Illumina BeadChip (Illumina Inc., San Diego, CA). Comparative criteria were computing time, percentage of missing alleles, percentage of wrongly imputed alleles, and the allelic squared correlation. Imputation accuracy on ungenotyped animals was also analyzed. The algorithm PedImpute was slightly more accurate and faster than findhap and BEAGLE when sire, dam, and maternal grandsire were genotyped at high density. On the other hand, BEAGLE performed better than both PedImpute and findhap for animals with at least one close relative not genotyped or genotyped at low density. However, computing time and resources using BEAGLE were incompatible with routine genomic evaluations in Italy. Error rate and allelic squared correlation attained by PedImpute ranged from 0.2 to 1.1% and from 96.6 to 99.3%, respectively. When complete genomic information on sire, dam, and maternal grandsire are available, as expected to be the case in the close future in (at least) dairy cattle, and considering accuracies obtained and computation time required, PedImpute represents a valuable choice in routine evaluations among the algorithms tested. © 2013 American Dairy Science Association.",
                "authors": [
                    {
                        "name": "Nicolazzi E.L."
                    },
                    {
                        "name": "Biffani S."
                    },
                    {
                        "name": "Jansen G."
                    }
                ],
                "citationCount": 16,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Journal of Dairy Science",
                "title": "Short communication: Imputing genotypes using PedImpute fast algorithm combining pedigree and population information"
            },
            "pmid": "23462161"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}