{
    "additionDate": "2021-01-18T07:32:21Z",
    "biotoolsCURIE": "biotools:bicon",
    "biotoolsID": "bicon",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "olga.lazareva@tum.de",
            "name": "Olga Lazareva",
            "typeEntity": "Person"
        }
    ],
    "description": "Biclustering constrained by networks (BiCoN) is a powerful new systems medicine tool to stratify patients while elucidating disease mechanisms. BiCoN is a network-constrained biclustering approach which restricts biclusters to functionally related genes connected in molecular interaction networks and maximizes the expression difference between two groups of patients. To alleviate this, we developed the network-constrained biclustering approach BiCoN which (i) restricts biclusters to functionally related genes connected in molecular interaction networks and (ii) maximizes the expression difference between two subgroups of patients.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://exbio.wzw.tum.de/bicon/documentation/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://exbio.wzw.tum.de/bicon",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:45:56.233388Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/bicon"
        }
    ],
    "name": "BiCoN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa1076",
            "metadata": {
                "abstract": "Motivation: Unsupervised learning approaches are frequently used to stratify patients into clinically relevant subgroups and to identify biomarkers such as disease-associated genes. However, clustering and biclustering techniques are oblivious to the functional relationship of genes and are thus not ideally suited to pinpoint molecular mechanisms along with patient subgroups. Results: We developed the network-constrained biclustering approach Biclustering Constrained by Networks (BiCoN) which (i) restricts biclusters to functionally related genes connected in molecular interaction networks and (ii) maximizes the difference in gene expression between two subgroups of patients. This allows BiCoN to simultaneously pinpoint molecular mechanisms responsible for the patient grouping. Network-constrained clustering of genes makes BiCoN more robust to noise and batch effects than typical clustering and biclustering methods. BiCoN can faithfully reproduce known disease subtypes as well as novel, clinically relevant patient subgroups, as we could demonstrate using breast and lung cancer datasets. In summary, BiCoN is a novel systems medicine tool that combines several heuristic optimization strategies for robust disease mechanism extraction. BiCoN is well-documented and freely available as a python package or a web interface. Web interface: https://exbio.wzw.tum.de/bicon.",
                "authors": [
                    {
                        "name": "Baumbach J."
                    },
                    {
                        "name": "Blumenthal D.B."
                    },
                    {
                        "name": "Canzar S."
                    },
                    {
                        "name": "Kacprowski T."
                    },
                    {
                        "name": "Lazareva O."
                    },
                    {
                        "name": "List M."
                    },
                    {
                        "name": "Tieri P."
                    },
                    {
                        "name": "Yuan K."
                    }
                ],
                "citationCount": 17,
                "date": "2021-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BiCoN: Network-constrained biclustering of patients and omics data"
            },
            "pmid": "33367514",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/2020.01.31.926345",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
