{
    "additionDate": "2021-01-18T10:50:27Z",
    "biotoolsCURIE": "biotools:adpribodb",
    "biotoolsID": "adpribodb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anthony.leung@jhu.edu",
            "name": "Anthony K. L. Leung",
            "typeEntity": "Person"
        }
    ],
    "description": "ADPriboDB is a database to facilitate studies in uncovering insights into the mechanisms and biological significance of ADP-ribosylation. ADPriboDB 2.0 serves as a one-stop repository comprising 48 346 entries and 9097 ADP-ribosylated proteins, of which 6708 were newly identified since the original database release.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "http://adpribodb.leunglab.org",
    "lastUpdate": "2021-01-21T14:17:06Z",
    "name": "ADPriboDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.09.24.298851",
            "pmcid": "PMC7523110",
            "pmid": "32995784"
        },
        {
            "doi": "10.1093/NAR/GKAA941",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.ADP-ribosylation is a protein modification responsible for biological processes such as DNA repair, RNA regulation, cell cycle and biomolecular condensate formation. Dysregulation of ADP-ribosylation is implicated in cancer, neurodegeneration and viral infection. We developed ADPriboDB (adpribodb.leunglab.org) to facilitate studies in uncovering insights into the mechanisms and biological significance of ADP-ribosylation. ADPriboDB 2.0 serves as a one-stop repository comprising 48 346 entries and 9097 ADP-ribosylated proteins, of which 6708 were newly identified since the original database release. In this updated version, we provide information regarding the sites of ADP-ribosylation in 32 946 entries. The wealth of information allows us to interrogate existing databases or newly available data. For example, we found that ADP-ribosylated substrates are significantly associated with the recently identified human protein interaction networks associated with SARS-CoV-2, which encodes a conserved protein domain called macrodomain that binds and removes ADP-ribosylation. In addition, we create a new interactive tool to visualize the local context of ADP-ribosylation, such as structural and functional features as well as other post-translational modifications (e.g. phosphorylation, methylation and ubiquitination). This information provides opportunities to explore the biology of ADP-ribosylation and generate new hypotheses for experimental testing.",
                "authors": [
                    {
                        "name": "Ayyappan V."
                    },
                    {
                        "name": "Wat R."
                    },
                    {
                        "name": "Barber C."
                    },
                    {
                        "name": "Vivelo C.A."
                    },
                    {
                        "name": "Gauch K."
                    },
                    {
                        "name": "Visanpattanasin P."
                    },
                    {
                        "name": "Cook G."
                    },
                    {
                        "name": "Sazeides C."
                    },
                    {
                        "name": "Leung A.K.L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ADPriboDB 2.0: An updated database of ADP-ribosylated proteins"
            },
            "pmcid": "PMC7778992",
            "pmid": "33137182",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkw706",
            "metadata": {
                "abstract": "© 2016 The Author(s).ADP-ribosylation refers to the addition of one or more ADP-ribose units onto proteins post-translationally. This protein modification is often added by ADPribosyltransferases, commonly known as PARPs, but it can also be added by other enzymes, including sirtuins or bacterial toxins. While past literature has utilized a variety of methods to identify ADP-ribosylated proteins, recent proteomics studies bring the power of mass spectrometry to determine sites of the modification. To appreciate the diverse roles of ADPribosylation across the proteome, we have created ADPriboDB-a database of ADP-ribosylated proteins (http://ADPriboDB.leunglab.org). Each entry of ADPriboDB is annotated manually by at least two independent curators from the literature between January 1975 and July 2015. The current database includes over 12 400 protein entries from 459 publications, identifying 2389 unique proteins. Here, we describe the structure and the current state of ADPriboDB as well as the criteria for entry inclusion. Using this aggregate data, we identified a statistically significant enrichment of ADP-ribosylated proteins in non-membranous RNA granules. To our knowledge, ADPriboDB is the first publicly available database encapsulating ADP-ribosylated proteins identified from the past 40 years, with a hope to facilitate the research of both basic scientists and clinicians to better understand ADP-ribosylation at the molecular level.",
                "authors": [
                    {
                        "name": "Vivelo C.A."
                    },
                    {
                        "name": "Wat R."
                    },
                    {
                        "name": "Agrawal C."
                    },
                    {
                        "name": "Tee H.Y."
                    },
                    {
                        "name": "Leung A.K.L."
                    }
                ],
                "citationCount": 28,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ADPriboDB: The database of ADP-ribosylated proteins"
            },
            "pmcid": "PMC5210603",
            "pmid": "27507885"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}