{
    "additionDate": "2018-08-27T15:34:45Z",
    "biotoolsCURIE": "biotools:csccp",
    "biotoolsID": "csccp",
    "credit": [
        {
            "email": "yjtseng@csie.ntu.edu.tw",
            "name": "Yufeng J. Tseng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predicts individual component's chemical structure in a mixture, utilizing an iterative dynamic programming algorithm, and a database organized from a large collection of natural products.",
    "documentation": [
        {
            "type": "General",
            "url": "https://csccp.cmdm.tw/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "https://csccp.cmdm.tw/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "CSCCP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0244-9",
            "metadata": {
                "abstract": "© 2017 The Author(s). The identification of chemical structures in natural product mixtures is an important task in drug discovery but is still a challenging problem, as structural elucidation is a time-consuming process and is limited by the available mass spectra of known natural products. Computer-aided structure elucidation (CASE) strategies seek to automatically propose a list of possible chemical structures in mixtures by utilizing chromatographic and spectroscopic methods. However, current CASE tools still cannot automatically solve structures for experienced natural product chemists. Here, we formulated the structural elucidation of natural products in a mixture as a computational problem by extending a list of scaffolds using a weighted side chain list after analyzing a collection of 243,130 natural products and designed an efficient algorithm to precisely identify the chemical structures. The complexity of such a problem is NP-complete. A dynamic programming (DP) algorithm can solve this NP-complete problem in pseudo-polynomial time after converting floating point molecular weights into integers. However, the running time of the DP algorithm degrades exponentially as the precision of the mass spectrometry experiment grows. To ideally solve in polynomial time, we proposed a novel iterative DP algorithm that can quickly recognize the chemical structures of natural products. By utilizing this algorithm to elucidate the structures of four natural products that were experimentally and structurally determined, the algorithm can search the exact solutions, and the time performance was shown to be in polynomial time for average cases. The proposed method improved the speed of the structural elucidation of natural products and helped broaden the spectrum of available compounds that could be applied as new drug candidates. A web service built for structural elucidation studies is freely accessible via the following link (http://csccp.cmdm.tw/).",
                "authors": [
                    {
                        "name": "Su B.-H."
                    },
                    {
                        "name": "Shen M.-Y."
                    },
                    {
                        "name": "Harn Y.-C."
                    },
                    {
                        "name": "Wang S.-Y."
                    },
                    {
                        "name": "Schurz A."
                    },
                    {
                        "name": "Lin C."
                    },
                    {
                        "name": "Lin O.A."
                    },
                    {
                        "name": "Tseng Y.J."
                    }
                ],
                "date": "2017-11-15T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "An efficient computer-aided structural elucidation strategy for mixtures using an iterative dynamic programming algorithm"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Synthetic chemistry",
            "uri": "http://edamontology.org/topic_3371"
        }
    ],
    "validated": 1
}