{
    "additionDate": "2022-10-09T10:35:17.110368Z",
    "biotoolsCURIE": "biotools:biogeom",
    "biotoolsID": "biogeom",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Peijian Shi"
        },
        {
            "name": "Ülo Niinemets"
        }
    ],
    "description": "An R package for simulating and fitting natural shapes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cran/biogeom",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:29:02.314435Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/biogeom/index.html"
        }
    ],
    "name": "biogeom",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1111/nyas.14862",
            "metadata": {
                "abstract": "Many natural objects exhibit radial or axial symmetry in a single plane. However, a universal tool for simulating and fitting the shapes of such objects is lacking. Herein, we present an R package called ‘biogeom’ that simulates and fits many shapes found in nature. The package incorporates novel universal parametric equations that generate the profiles of bird eggs, flowers, linear and lanceolate leaves, seeds, starfish, and tree-rings, and three growth-rate equations that generate the profiles of ovate leaves and the ontogenetic growth curves of animals and plants. ‘biogeom’ includes several empirical datasets comprising the boundary coordinates of bird eggs, fruits, lanceolate and ovate leaves, tree rings, seeds, and sea stars. The package can also be applied to other kinds of natural shapes similar to those in the datasets. In addition, the package includes sigmoid curves derived from the three growth-rate equations, which can be used to model animal and plant growth trajectories and predict the times associated with maximum growth rate. ‘biogeom’ can quantify the intra- or interspecific similarity of natural outlines, and it provides quantitative information of shape and ontogenetic modification of shape with important ecological and evolutionary implications for the growth and form of the living world.",
                "authors": [
                    {
                        "name": "Gielis J."
                    },
                    {
                        "name": "Niinemets U."
                    },
                    {
                        "name": "Niklas K.J."
                    },
                    {
                        "name": "Quinn B.K."
                    },
                    {
                        "name": "Ratkowsky D.A."
                    },
                    {
                        "name": "Ruan H."
                    },
                    {
                        "name": "Schrader J."
                    },
                    {
                        "name": "Shi P."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 32,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Annals of the New York Academy of Sciences",
                "title": "‘biogeom’: An R package for simulating and fitting natural shapes"
            },
            "pmid": "35879250"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
