{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T07:46:17Z",
    "biotoolsCURIE": "biotools:deepmalaria",
    "biotoolsID": "deepmalaria",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jiann-Shiun.Yuan@ucf.edu",
            "name": "Jiann Shiun Yuan",
            "typeEntity": "Person"
        },
        {
            "email": "debopam.chakrabarti@ucf.edu",
            "name": "Debopam Chakrabarti",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepMalaria is a tool for Artificial Intelligence Driven Discovery of Potent Antiplasmodials. Code available upon request.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://transilico.com/",
    "lastUpdate": "2021-02-27T14:17:19Z",
    "name": "DeepMalaria",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FPHAR.2019.01526",
            "metadata": {
                "abstract": "Copyright © 2020 Keshavarzi Arshadi, Salem, Collins, Yuan and Chakrabarti. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.Antimalarial drugs are becoming less effective due to the emergence of drug resistance. Resistance has been reported for all available malaria drugs, including artemisinin, thus creating a perpetual need for alternative drug candidates. The traditional drug discovery approach of high throughput screening (HTS) of large compound libraries for identification of new drug leads is time-consuming and resource intensive. While virtual in silico screening is a solution to this problem, however, the generalization of the models is not ideal. Artificial intelligence (AI), utilizing either structure-based or ligand-based approaches, has demonstrated highly accurate performances in the field of chemical property prediction. Leveraging the existing data, AI would be a suitable alternative to blind-search HTS or fingerprint-based virtual screening. The AI model would learn patterns within the data and help to search for hit compounds efficiently. In this work, we introduce DeepMalaria, a deep-learning based process capable of predicting the anti-Plasmodium falciparum inhibitory properties of compounds using their SMILES. A graph-based model is trained on 13,446 publicly available antiplasmodial hit compounds from GlaxoSmithKline (GSK) dataset that are currently being used to find novel drug candidates for malaria. We validated this model by predicting hit compounds from a macrocyclic compound library and already approved drugs that are used for repurposing. We have chosen macrocyclic compounds as these ligand-binding structures are underexplored in malaria drug discovery. The in silico pipeline for this process also consists of additional validation of an in-house independent dataset consisting mostly of natural product compounds. Transfer learning from a large dataset was leveraged to improve the performance of the deep learning model. To validate the DeepMalaria generated hits, we used a commonly used SYBR Green I fluorescence assay based phenotypic screening. DeepMalaria was able to detect all the compounds with nanomolar activity and 87.5% of the compounds with greater than 50% inhibition. Further experiments to reveal the compounds’ mechanism of action have shown that not only does one of the hit compounds, DC-9237, inhibits all asexual stages of Plasmodium falciparum, but is a fast-acting compound which makes it a strong candidate for further optimization.",
                "authors": [
                    {
                        "name": "Arshadi A.K."
                    },
                    {
                        "name": "Salem M."
                    },
                    {
                        "name": "Collins J."
                    },
                    {
                        "name": "Yuan J.S."
                    },
                    {
                        "name": "Chakrabarti D."
                    }
                ],
                "citationCount": 9,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "Deepmalaria: Artificial intelligence driven discovery of potent antiplasmodials"
            },
            "pmcid": "PMC6974622",
            "pmid": "32009951"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        }
    ]
}