{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://mblab.wustl.edu/index.html"}],"function":[{"operation":[{"term":"Genome alignment","uri":"http://edamontology.org/operation_3182"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"cDNA","uri":"http://edamontology.org/topic_3512"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/pairagon-1-1-pair-hmm-based-cdna-to-genome-alignment.html"}],"publication":[{"abstract":"Motivation: The most accurate way to determine the intron-exon structures in a genome is to align spliced cDNA sequences to the genome. Thus, cDNA-to-genome alignment programs are a key component of most annotation pipelines. The scoring system used to choose the best alignment is a primary determinant of alignment accuracy, while heuristics that prevent consideration of certain alignments are a primary determinant of runtime and memory usage. Both accuracy and speed are important considerations in choosing an alignment algorithm, but scoring systems have received much less attention than heuristics. Results: We present Pairagon, a pair hidden Markov model based cDNA-to-genome alignment program, as the most accurate aligner for sequences with high- and low-identity levels. We conducted a series of experiments testing alignment accuracy with varying sequence identity. We first created 'perfect' simulated cDNA sequences by splicing the sequences of exons in the reference genome sequences of fly and human. The complete reference genome sequences were then mutated to various degrees using a realistic mutation simulator and the perfect cDNAs were aligned to them using Pairagon and 12 other aligners. To validate these results with natural sequences, we performed cross-species alignment using orthologous transcripts from human, mouse and rat. We found that aligner accuracy is heavily dependent on sequence identity. For sequences with 100% identity, Pairagon achieved accuracy levels of >99.6%, with one quarter of the errors of any other aligner. Furthermore, for human/mouse alignments, which are only 85% identical, Pairagon achieved 87% accuracy, higher than any other aligner. © The Author 2009. Published by Oxford University Press. All rights reserved.","authors":["Lu D.V.","Brown R.H.","Arumugam M.","Brent M.R."],"cit_count":6,"doi":"10.1093/bioinformatics/btp273","journal":"Bioinformatics","title":"Pairagon: A highly accurate, HMM-based cDNA-to-genome aligner","type":"Primary","year":"2009-06-29"}],"summary":{"biotoolsCURIE":"biotools:pairagon","biotoolsID":"pairagon","description":"Pairagon is a pair-HMM based cDNA-to-genome alignment program.","homepage":"http://mblab.wustl.edu/software.html#pairagonLink","name":"Pairagon","version":["1.1"]}}