
{
    "credit": [
        {
            "email": "ottjurg@psych.ac.cn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.jurgott.org/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.jurgott.org/linkage/PTest.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/ptest-15-testing-set-observed-small-p-values-gwas.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background/Aims: We consider the situation that multiple genetic variants are underlying a heritable trait and assume that each contributes to the trait only to a small degree. The aim is to develop a statistical test for disease association of these multiple variants. Methods: We expect that p values resulting from a genome-wide case-control association analysis will fall into two classes: those reflecting true association and those occurring randomly in the interval from 0 to 1. We develop a partition test to find the set of smallest p values deviating most from the number of p values expected under randomness. Results: Power calculations demonstrate the superiority of our partition test over conventional SNP-by-SNP analyses. Applications of the partition test to six published datasets show that our test is particularly suitable when multiple SNPs appear to contribute to a trait, and furnished more significant results than a well-known procedure to estimate the false discovery rate. Conclusions: Our partition test also furnishes an estimate of the number of functional SNPs underlying disease and can be highly significant, while single-locus tests may be far from significant. © 2012 S. Karger AG, Basel.",
            "authors": [
                "Ott J.",
                "Liu Z.",
                "Shen Y."
            ],
            "cit_count": 6,
            "journal": "Human Heredity",
            "pmid": "23154528",
            "title": "Challenging false discovery rate: A partition test based on p values in human case-control association studies",
            "year": "2012-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ptest",
        "biotoolsID": "ptest",
        "description": "Software for case-control genetic association studies in human gene mapping. The software is based on single-SNP p-values resulting from an association test, for example, the chi-square test comparing genotype or allele frequencies in cases and controls.",
        "homepage": "http://www.jurgott.org/linkage/PTest.html",
        "name": "PTest"
    }
}