{
    "additionDate": "2021-01-18T07:30:54Z",
    "biotoolsCURIE": "biotools:netgor",
    "biotoolsID": "netgor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dougnam@unist.ac.kr",
            "name": "Dougu Nam",
            "typeEntity": "Person"
        }
    ],
    "description": "R-Shiny package for network-integrated pathway enrichment analysis.\n\nnetGO is an R/Shiny package for network-integrated pathway enrichment analysis.\n\nnetGO provides user-interactive visualization of enrichment analysis results and related networks.\n\nand returns a data frame of gene-sets, their p-values, q-values derived from netGO+, Fisher’s exact test and netGO (optional) as well as the scores for the network interaction and overlap.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/unistbig/netGO",
    "language": [
        "R",
        "JavaScript"
    ],
    "lastUpdate": "2021-03-08T13:40:34Z",
    "license": "MIT",
    "name": "netGOR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA077",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.We present an R-Shiny package, netGO, for novel network-integrated pathway enrichment analysis. The conventional Fisher's exact test (FET) considers the extent of overlap between target genes and pathway gene-sets, while recent network-based analysis tools consider only network interactions between the two. netGO implements an intuitive framework to integrate both the overlap and networks into a single score, and adaptively resamples genes based on network degrees to assess the pathway enrichment. In benchmark tests for gene expression and genome-wide association study (GWAS) data, netGO captured the relevant gene-sets better than existing tools, especially when analyzing a small number of genes. Specifically, netGO provides user-interactive visualization of the target genes, enriched gene-set and their network interactions for both netGO and FET results for further analysis. For this visualization, we also developed a standalone R-Shiny package shinyCyJS to connect R-shiny and the JavaScript version of cytoscape.",
                "authors": [
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Yoon S."
                    },
                    {
                        "name": "Nam D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NetGO: R-Shiny package for network-integrated pathway enrichment analysis"
            },
            "pmid": "32083639"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}