{
    "additionDate": "2017-01-17T15:04:09Z",
    "biotoolsCURIE": "biotools:joda",
    "biotoolsID": "joda",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "szczurek@molgen.mpg.de",
            "name": "Ewa Szczurek",
            "orcidid": "http://orcid.org/0000-0002-1320-6695",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package implements three steps of an algorithm called JODA, which computes gene deregulation scores. For each gene, its deregulation score reflects how strongly an effect of a certain regulator's perturbation on this gene differs between two different cell populations. The algorithm utilizes regulator knockdown expression data as well as knowledge about signaling pathways in which the regulators are involved (formalized in a simple matrix model).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/joda.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/joda_1.22.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/joda.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-30T16:07:41Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.bioconductor.org"
        }
    ],
    "name": "joda",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-249",
            "metadata": {
                "abstract": "Background: Deregulation between two different cell populations manifests itself in changing gene expression patterns and changing regulatory interactions. Accumulating knowledge about biological networks creates an opportunity to study these changes in their cellular context.Results: We analyze re-wiring of regulatory networks based on cell population-specific perturbation data and knowledge about signaling pathways and their target genes. We quantify deregulation by merging regulatory signal from the two cell populations into one score. This joint approach, called JODA, proves advantageous over separate analysis of the cell populations and analysis without incorporation of knowledge. JODA is implemented and freely available in a Bioconductor package 'joda'.Conclusions: Using JODA, we show wide-spread re-wiring of gene regulatory networks upon neocarzinostatin-induced DNA damage in Human cells. We recover 645 deregulated genes in thirteen functional clusters performing the rich program of response to damage. We find that the clusters contain many previously characterized neocarzinostatin target genes. We investigate connectivity between those genes, explaining their cooperation in performing the common functions. We review genes with the most extreme deregulation scores, reporting their involvement in response to DNA damage. Finally, we investigate the indirect impact of the ATM pathway on the deregulated genes, and build a hypothetical hierarchy of direct regulation. These results prove that JODA is a step forward to a systems level, mechanistic understanding of changes in gene regulation between different cell populations. © 2011 Szczurek et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Biecek P."
                    },
                    {
                        "name": "Gat-Viks I."
                    },
                    {
                        "name": "Markowetz F."
                    },
                    {
                        "name": "Szczurek E."
                    },
                    {
                        "name": "Tiuryn J."
                    },
                    {
                        "name": "Vingron M."
                    }
                ],
                "citationCount": 1,
                "date": "2011-06-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Deregulation upon DNA damage revealed by joint analysis of context-specific perturbation data"
            },
            "pmcid": "PMC3236061",
            "pmid": "21693013",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1,
    "version": [
        "1.22.0"
    ]
}
