{
    "additionDate": "2017-02-10T14:15:25Z",
    "biotoolsCURIE": "biotools:indelscan",
    "biotoolsID": "indelscan",
    "description": "Tool for genome-wide identification of indels.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Reference identification",
                    "uri": "http://edamontology.org/operation_3703"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Format detection",
                    "uri": "http://edamontology.org/operation_3357"
                }
            ]
        }
    ],
    "homepage": "http://indelscan.genomics.sinica.edu.tw/IndelScan/",
    "lastUpdate": "2019-06-27T09:09:48Z",
    "name": "INDELSCAN",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Insertion and deletion (indel) events usually have dramatic effects on genome structure and gene function. Species-specific indels have been demonstrated to be associated with species-unique traits. Currently, indel identifications mainly rely on pairwise sequence alignments (the 'pair-wise indels'), which suffer lack of discrimination of species specificity and insertion versus deletion. Also, there is no freely accessible web server for genome-wide identification of indels. Therefore, we develop a web server-INDELSCAN-to identify four types of indels using multiple sequence alignments that include sequences from one target, one subject and ≥1 out-group species. The four types of indels identified encompass target species-specific, subject species-specific, non-species-specific and target-subject pair-wise indels. Insertions and deletions are discriminated with reference to out-group sequences. The genomic locations (50UTR, intron, CDS, 30UTR and intergenic region) of these indels are also provided for functional analysis. INDELSCAN provides genomic sequences and gene annotations from a wide spectrum of taxa for users to select from, including nine target species (human (Homo sapiens), mouse (Mus musculus), rat (Rattus norvegicus), dog (Canis familiaris), opossum (Monodelphis domestica), chicken (Gallus gallus), zebrafish (Danio rerio), fly (Drosophila melanogaster) and yeast (Saccharomyces cerevisiae) and 435 subject/out-group species, ranging from yeasts to mammals. The server also provides analytic figures and supports indel identification from user-uploaded alignments/annotations. INDELSCAN is freely accessible at http://indelscan. genomics.sinica.edu.tw/IndelScan/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Chen F.-C."
                    },
                    {
                        "name": "Chen C.-J."
                    },
                    {
                        "name": "Chuang T.-J."
                    }
                ],
                "citationCount": 4,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "INDELSCAN: A web server for comparative identification of species-specific and non-species-specific insertion/deletion events"
            },
            "pmid": "17517762"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}