{
    "additionDate": "2021-01-18T09:36:45Z",
    "biotoolsCURIE": "biotools:anticlust",
    "biotoolsID": "anticlust",
    "confidence_flag": "tool",
    "description": "Anticlustering partitions a pool of elements into subsets (i.e., anticlusters) in such a way that the subsets are as similar as possible. This is accomplished by maximizing instead of minimizing a clustering objective function, such as the intra-cluster variance (used in k-means clustering) or the sum of pairwise distances within clusters. Thus, anticlustering creates similar sets of elements by maximizing heterogeneity within anticlusters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://m-py.github.io/anticlust/",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2021-01-23T16:29:53Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=anticlust"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/m-Py/anticlust"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/m-Py/anticlust/issues"
        }
    ],
    "name": "anticlust",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1037/MET0000301",
            "metadata": {
                "abstract": "© 2020 American Psychological Association.Numerous applications in psychological research require that a pool of elements is partitioned into multiple parts. While many applications seek groups that are well-separated, that is, dissimilar from each other, others require the different groups to be as similar as possible. Examples include the assignment of students to parallel courses, assembling stimulus sets in experimental psychology, splitting achievement tests into parts of equal difficulty, and dividing a data set for cross-validation. We present anticlust, an easy-to-use and free software package for solving these problems fast and in an automated manner. The package anticlust is an open source extension to the R programming language and implements the methodology of anticlustering. Anticlustering divides elements into similar parts, ensuring similarity between groups by enforcing heterogeneity within groups. Thus, anticlustering is the direct reversal of cluster analysis that aims to maximize homogeneity within groups and dissimilarity between groups. Our package anticlust implements 2 anticlustering criteria, reversing the clustering methods k-means and cluster editing, respectively. In a simulation study, we show that anticlustering returns excellent results and outperforms alternative approaches like random assignment and matching. In 3 example applications, we illustrate how to apply anticlust on real data sets. We demonstrate how to assign experimental stimuli to equivalent sets based on norming data, how to divide a large data set for cross-validation, and how to split a test into parts of equal item difficulty and discrimination.",
                "authors": [
                    {
                        "name": "Papenberg M."
                    },
                    {
                        "name": "Klau G.W."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Psychological Methods",
                "title": "Using Anticlustering to Partition Data Sets Into Equivalent Parts"
            },
            "pmid": "32567870"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}