{
    "additionDate": "2022-08-15T11:00:14.333425Z",
    "biotoolsCURIE": "biotools:deemd",
    "biotoolsID": "deemd",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Ghassan Hamarneh"
        },
        {
            "name": "M Sadegh Saberian"
        }
    ],
    "description": "DEEMD: a computational pipeline using deep neural network models within a multiple instance learning framework, to identify putative treatments effective against SARS-CoV-2 based on morphological analysis of the publicly available RxRx19a dataset.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.github.com/Sadegh-Saberian/DEEMD",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:49:33.266909Z",
    "license": "Not licensed",
    "name": "DEEMD",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tmi.2022.3178523",
            "metadata": {
                "abstract": "Drug repurposing can accelerate the identification of effective compounds for clinical use against SARS-CoV-2, with the advantage of pre-existing clinical safety data and an established supply chain. RNA viruses such as SARS-CoV-2 manipulate cellular pathways and induce reorganization of subcellular structures to support their life cycle. These morphological changes can be quantified using bioimaging techniques. In this work, we developed DEEMD: a computational pipeline using deep neural network models within a multiple instance learning framework, to identify putative treatments effective against SARS-CoV-2 based on morphological analysis of the publicly available RxRx19a dataset. This dataset consists of fluorescence microscopy images of SARS-CoV-2 non-infected cells and infected cells, with and without drug treatment. DEEMD first extracts discriminative morphological features to generate cell morphological profiles from the non-infected and infected cells. These morphological profiles are then used in a statistical model to estimate the applied treatment efficacy on infected cells based on similarities to non-infected cells. DEEMD is capable of localizing infected cells via weak supervision without any expensive pixel-level annotations. DEEMD identifies known SARS-CoV-2 inhibitors, such as Remdesivir and Aloxistatin, supporting the validity of our approach. DEEMD can be explored for use on other emerging viruses and datasets to rapidly identify candidate antiviral treatments in the future. Our implementation is available online at https://www.github.com/Sadegh-Saberian/DEEMD.",
                "authors": [
                    {
                        "name": "Hallgrimson C."
                    },
                    {
                        "name": "Hamarneh G."
                    },
                    {
                        "name": "Jean F."
                    },
                    {
                        "name": "Libbrecht M.W."
                    },
                    {
                        "name": "Moriarty K.P."
                    },
                    {
                        "name": "Nabi I.R."
                    },
                    {
                        "name": "Olmstead A.D."
                    },
                    {
                        "name": "Saberian M.S."
                    }
                ],
                "citationCount": 5,
                "date": "2022-11-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "DEEMD: Drug Efficacy Estimation Against SARS-CoV-2 Based on Cell Morphology With Deep Multiple Instance Learning"
            },
            "pmid": "35622798"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Bioimaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
