{
    "additionDate": "2018-07-29T09:23:56Z",
    "biotoolsCURIE": "biotools:gcalignr",
    "biotoolsID": "gcalignr",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "meinolf.ottensmann@web.de",
            "name": "Meinolf Ottensmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simple peak alignment for gas-chromatography data in R.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5991698/bin/pone.0198311.s004.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mottensmann/GCalignR",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-03-26T08:16:56Z",
    "name": "GCalignR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0198311",
            "metadata": {
                "abstract": "© 2018 Ottensmann et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Chemical cues are arguably the most fundamental means of animal communication and play an important role in mate choice and kin recognition. Consequently, there is growing interest in the use of gas chromatography (GC) to investigate the chemical basis of eco-evo-lutionary interactions. Both GC-MS (mass spectrometry) and FID (flame ionization detection) are commonly used to characterise the chemical composition of biological samples such as skin swabs. The resulting chromatograms comprise peaks that are separated according to their retention times and which represent different substances. Across chromatograms of different samples, homologous substances are expected to elute at similar retention times. However, random and often unavoidable experimental variation introduces noise, making the alignment of homologous peaks challenging, particularly with GC-FID data where mass spectral data are lacking. Here we present GCalignR, a user-friendly R package for aligning GC-FID data based on retention times. The package was developed specifically for ecological and evolutionary studies that seek to investigate similarity patterns across multiple and often highly variable biological samples, for example representing different sexes, age classes or reproductive stages. The package also implements dynamic visualisations to facilitate inspection and fine-tuning of the resulting alignments and can be integrated within a broader workflow in R to facilitate downstream multivariate analyses. We demonstrate an example workflow using empirical data from Antarctic fur seals and explore the impact of user-defined parameter values by calculating alignment error rates for multiple datasets. The resulting alignments had low error rates for most of the explored parameter space and we could also show that GCalignR performed equally well or better than other available software. We hope that GCalignR will help to simplify the processing of chemical datasets and improve the standardization and reproducibility of chemical analyses in studies of animal chemical communication and related fields.",
                "authors": [
                    {
                        "name": "Hoffman J.I."
                    },
                    {
                        "name": "Nichols H.J."
                    },
                    {
                        "name": "Ottensmann M."
                    },
                    {
                        "name": "Stoffel M.A."
                    }
                ],
                "citationCount": 18,
                "date": "2018-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GCalignR: An R package for aligning gas-chromatography data for ecological and evolutionary studies"
            },
            "pmcid": "PMC5991698",
            "pmid": "29879149"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
