{"credit":[{"email":"schliep@cs.rutgers.edu","name":"Alexander Schliep","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatics.rutgers.edu/People/AlexanderSchliep/index.html"}],"documentation":[{"type":"GENERAL","url":"http://bioinformatics.rutgers.edu/Software/MCPD/"}],"function":[{"operation":[{"term":"Optimisation and refinement","uri":"http://edamontology.org/operation_2425"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Molecular genetics","uri":"http://edamontology.org/topic_3321"},{"term":"Molecular biology","uri":"http://edamontology.org/topic_3047"},{"term":"Clone library","uri":"http://edamontology.org/topic_3341"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mcpd-2-02-markov-chain-pooling-decoder.html"}],"publication":[{"abstract":"This paper describes an effective method for extracting as much information as possible from pooling experiments for library screening. Pools are collections of clones, and screening a pool with a probe determines whether any of these clones are positive for the probe. The results of the pool screenings are interpreted, or decoded, to infer which clones are candidates to be positive. These candidate positives are subjected to confirmatory testing. Decoding the pool screening results is complicated by the presence of errors, which typically lead to ambiguities in the inference of positive clones. However, in many applications there are reasonable models for the prior distributions for positives and for errors, and Bayes inference is the preferred method for ranking candidate positives. Because of the combinatoric complexity of the Bayes formulation, we implemented a decoding algorithm using a Markov chain Monte Carlo method. The algorithm was used in screening a library with 1298 clones using 47 pools. We corroborated the posterior probabilities for positives with results from confirmatory screening. We also simulated the screening of a 10-fold coverage library of 33,000 clones using 253 pools. The use of our algorithm, effective under conditions where combinatorial decoding techniques are imprudent, allows the use of fewer pools and also introduces needed robustness.","authors":["Knill E."],"cit_count":22,"journal":"Journal of Computational Biology","pmid":"8891957","title":"Interpretation of pooling experiments using the Markov chain Monte Carlo method","year":"1996-01-01"}],"summary":{"biotoolsCURIE":"biotools:mcpd","biotoolsID":"mcpd","description":"Used in the analysis of pooling experiments for library screening. Pools are collections of clones, and screening a pool with a probe is a group test, determining whether any of these clones are positive for the probe. The results of the pool screenings are interpreted, or decoded, to infer which clones are candidates to be positive using a Markov chain Monte Carlo approach.","homepage":"http://bioinformatics.rutgers.edu/Software/MCPD/","name":"MCPD"}}