{
    "additionDate": "2021-06-14T13:33:19Z",
    "biotoolsCURIE": "biotools:caltrack",
    "biotoolsID": "caltrack",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "christopher.toepfer@cardiov.ox.ac.uk",
            "name": "Christopher N. Toepfer",
            "orcidid": "https://orcid.org/0000-0003-4671-2030",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "cseidman@genetics.med.harvard.edu",
            "name": "Christine E. Seidman",
            "orcidid": "https://orcid.org/0000-0001-6380-1209",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CalTrack is a script for high-throughput automated calcium transient analysis in cardiomyocytes.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/ToepferLab/CalTrack",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:20:19.463239Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ToepferLab/CalTrack/issues"
        }
    ],
    "name": "CalTrack",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1161/circresaha.121.318868",
            "metadata": {
                "abstract": "Rationale: Calcium transient analysis is central to understanding inherited and acquired cardiac physiology and disease. Although the development of novel calcium reporters enables assays of CRISPR/Cas-9 genome-edited induced pluripotent stem cell-derived cardiomyocytes and primary adult cardiomyocytes, existing calcium-detection technologies are often proprietary and require specialist equipment, whereas open-source workflows necessitate considerable user expertise and manual input. Objective: We aimed to develop an easy to use open-source, adaptable, and automated analysis pipeline for measuring cellular calcium transients, from image stack to data output, inclusive of cellular identification, background subtraction, photobleaching correction, calcium transient averaging, calcium transient fitting, data collation, and aberrant behavior recognition. Methods and Results: We developed CalTrack, a MatLab-based algorithm, to monitor fluorescent calcium transients in living cardiomyocytes, including isolated single cells or those contained in 3-dimensional tissues or organoids, and to analyze data acquired using photomultiplier tubes or employing line scans. CalTrack uses masks to segment cells allowing multiple cardiomyocyte transients to be measured from a single field of view. After automatically correcting for photobleaching, CalTrack averages and fits a string of transients and provides parameters that measure time to peak, time of decay, tau, peak fluorescence/baseline fluorescence (Fmax/F0), and others. We demonstrate the utility of CalTrack in primary and induced pluripotent stem cell-derived cell lines in response to pharmacological compounds and in phenotyping cells carrying hypertrophic cardiomyopathy variants. Conclusions: CalTrack, an open-source tool that runs on a local computer, provides automated high-throughput analysis of calcium transients in response to development, genetic or pharmacological manipulations, and pathological conditions. We expect that CalTrack analyses will accelerate insights into physiological and abnormal calcium homeostasis that influence diverse aspects of cardiomyocyte biology.",
                "authors": [
                    {
                        "name": "Bueno-Orovio A."
                    },
                    {
                        "name": "Cicconet M."
                    },
                    {
                        "name": "Margara F."
                    },
                    {
                        "name": "Psaras Y."
                    },
                    {
                        "name": "Redwood C.S."
                    },
                    {
                        "name": "Repetti G.G."
                    },
                    {
                        "name": "Robinson P."
                    },
                    {
                        "name": "Rodriguez B."
                    },
                    {
                        "name": "Schmid M."
                    },
                    {
                        "name": "Seidman C.E."
                    },
                    {
                        "name": "Seidman J.G."
                    },
                    {
                        "name": "Sparrow A.J."
                    },
                    {
                        "name": "Steeples V."
                    },
                    {
                        "name": "Toepfer C.N."
                    },
                    {
                        "name": "Watkins H.C."
                    },
                    {
                        "name": "Wilcox J.A.L."
                    }
                ],
                "citationCount": 37,
                "date": "2021-07-09T00:00:00Z",
                "journal": "Circulation Research",
                "title": "CalTrack: High-Throughput Automated Calcium Transient Analysis in Cardiomyocytes"
            },
            "pmcid": "PMC8260473",
            "pmid": "34018815",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
