
{
    "credit": [
        {
            "email": "condon@cs.ubc.ca",
            "name": "Anne Condon",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "TERMS_OF_USE",
            "url": "http://www.rnasoft.ca/conditions_use.html"
        },
        {
            "type": "GENERAL",
            "url": "http://www.rnasoft.ca/rnasoft_about.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "DNA structure prediction",
                    "uri": "http://edamontology.org/operation_2442"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Protein secondary structure",
                "uri": "http://edamontology.org/topic_3542"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "publication": [
        {
            "abstract": "DNA and RNA strands are employed in novel ways in the construction of nanostructures, as molecular tags in libraries of polymers and in therapeutics. New software tools for prediction and design of molecular structure will be needed in these applications. The RNAsoft suite of programs provides tools for predicting the secondary structure of a pair of DNA or RNA molecules, testing that combinatorial tag sets of DNA and RNA molecules have no unwanted secondary structure and designing RNA strands that fold to a given input secondary structure. The tools are based on standard thermodynamic models of RNA secondary structure formation. RNAsoft can be found online at http://www.RNAsoft.ca.",
            "authors": [
                "Andronescu M.",
                "Aguirre-Hernandez R.",
                "Condon A.",
                "Hoos H.H."
            ],
            "cit_count": 84,
            "journal": "Nucleic Acids Research",
            "pmid": "12824338",
            "title": "RNAsoft: A suite of RNA secondary structure prediction and design software tools",
            "year": "2003-07-01"
        },
        {
            "abstract": "The function of many RNAs depends crucially on their structure. Therefore, the design of RNA molecules with specific structural properties has many potential applications, e.g. in the context of investigating the function of biological RNAs, of creating new ribozymes, or of designing artificial RNA nanostructures. Here, we present a new algorithm for solving the following RNA secondary structure design problem: given a secondary structure, find an RNA sequence (if any) that is predicted to fold to that structure. Unlike the (pseudoknot-free) secondary structure prediction problem, this problem appears to be hard computationally. Our new algorithm, \"RNA Secondary Structure Designer (RNA-SSD)\", is based on stochastic local search, a prominent general approach for solving hard combinatorial problems. A thorough empirical evaluation on computationally predicted structures of biological sequences and artificially generated RNA structures as well as on empirically modelled structures from the biological literature shows that RNA-SSD substantially outperforms the best known algorithm for this problem, RNAinverse from the Vienna RNA Package. In particular, the new algorithm is able to solve structures, consistently, for which RNAinverse is unable to find solutions. The RNA-SSD software is publically available under the name of RNA Designer at the RNASoft website (www.rnasoft.ca). © 2003 Elsevier Ltd. All rights reserved.",
            "authors": [
                "Andronescu M.",
                "Fejes A.P.",
                "Hutter F.",
                "Hoos H.H.",
                "Condon A."
            ],
            "cit_count": 96,
            "journal": "Journal of Molecular Biology",
            "pmid": "15095976",
            "title": "A New Algorithm for RNA Secondary Structure Design",
            "year": "2004-02-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnasoft",
        "biotoolsID": "rnasoft",
        "description": "Software for RNA/DNA secondary structure prediction and design.",
        "homepage": "http://www.rnasoft.ca/",
        "name": "RNAsoft"
    }
}