{
    "additionDate": "2020-01-09T18:23:29Z",
    "biotoolsCURIE": "biotools:MFPD",
    "biotoolsID": "MFPD",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "di.ge@univ-rennes1.fr",
            "name": "Di Ge",
            "typeEntity": "Person"
        }
    ],
    "description": "Robust, real-time generic detector based on a multi-feature probabilistic method.\n\nRobust, real-time event detection from physiological signals acquired during long-term ambulatory monitoring still represents a major challenge for highly-artifacted signals. In this paper, we propose an original and generic multi-feature probabilistic detector (MFPD) and apply it to real-time QRS complex detection under noisy conditions. The MFPD method calculates a binary Bayesian probability for each derived feature and makes a centralized fusion, using the Kullback-Leibler divergence. The method is evaluated on two ECG databases: 1) the MIT-BIH arrhythmia database from Physionet containing clean ECG signals, 2) a benchmark noisy database created by adding noise recordings of the MIT-BIH noise stress test database, also from Physionet, to the MIT-BIH arrhythmia database.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31661497",
    "lastUpdate": "2020-01-09T18:23:29Z",
    "name": "MFPD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223785",
            "metadata": {
                "abstract": "© 2019 Doyen et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Robust, real-time event detection from physiological signals acquired during long-term ambulatory monitoring still represents a major challenge for highly-artifacted signals. In this paper, we propose an original and generic multi-feature probabilistic detector (MFPD) and apply it to real-time QRS complex detection under noisy conditions. The MFPD method calculates a binary Bayesian probability for each derived feature and makes a centralized fusion, using the Kullback-Leibler divergence. The method is evaluated on two ECG databases: 1) the MIT-BIH arrhythmia database from Physionet containing clean ECG signals, 2) a benchmark noisy database created by adding noise recordings of the MIT-BIH noise stress test database, also from Physionet, to the MIT-BIH arrhythmia database. Results are compared with a well-known wavelet-based detector, and two recently published detectors: One based on spatiotemporal characteristic of the QRS complex and the second, as the MFDP, based on feature calculations from the University of New South Wales detector (UNSW). For both benchmark Physionet databases, the proposed MFPD method achieves the lowest standard deviation in sensitivity and positive predictivity (+P) despite its online algorithm architecture. While the statistics are comparable for low-to mildly artifactual ECG signals, the MFPD outperforms reference methods for artifacted ECG with low SNR levels reaching 87.48 ± 14.21% in sensitivity and 89.39 ± 14.67% in +P as compared to 88.30 ± 17.66% and 86.06 ± 19.67% respectively from UNSW, the best performing reference method. With demonstrations on the extensively studied QRS detection problem, we consider that the proposed generic structure of the multi-feature probabilistic detector should offer promising perspectives for long-term monitoring applications for highly-artifacted signals.",
                "authors": [
                    {
                        "name": "Doyen M."
                    },
                    {
                        "name": "Ge D."
                    },
                    {
                        "name": "Beuchee A."
                    },
                    {
                        "name": "Carrault G."
                    },
                    {
                        "name": "Hernandez A.I."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Robust, real-time generic detector based on a multi-feature probabilistic method"
            },
            "pmcid": "PMC6818956",
            "pmid": "31661497"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}