{
    "name": "BayesForest", 
    "description": "Algorithm for realistic modeling of morphological tree clones. Here the morphological clones are defined as trees similar (and not the same) at the tree-level structure with varying fine-scale structural detail.", 
    "homepage": "https://github.com/inuritdino/BayesForest/wiki", 
    "biotoolsID": "bayesforest", 
    "biotoolsCURIE": "biotools:bayesforest", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2426", 
                    "term": "Modelling and simulation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0610", 
            "term": "Ecology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0780", 
            "term": "Plant biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3810", 
            "term": "Agricultural science"
        }, 
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/inuritdino/BayesForest/wiki/Simple-examples", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/gigascience/gix079", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Bayes Forest: A data-intensive generator of morphological tree clones", 
                "abstract": "© The Author 2017. Detailed and realistic tree form generators have numerous applications in ecology and forestry. For example, the varying morphology of trees contributes differently to formation of landscapes, natural habitats of species, and eco-physiological characteristics of the biosphere. Here, we present an algorithm for generating morphological tree \"clones\" based on the detailed reconstruction of the laser scanning data, statistical measure of similarity, and a plant growth model with simple stochastic rules. The algorithm is designed to produce tree forms, i.e., morphological clones, similar (and not identical) in respect to tree-level structure, but varying in fine-scale structural detail. Although we opted for certain choices in our algorithm, individual parts may vary depending on the application, making it a general adaptable pipeline. Namely, we showed that a specific multipurpose procedural stochastic growth model can be algorithmically adjusted to produce the morphological clones replicated from the target experimentally measured tree. For this, we developed a statistical measure of similarity (structural distance) between any given pair of trees, which allows for the comprehensive comparing of the tree morphologies by means of empirical distributions describing the geometrical and topological features of a tree. Finally, we developed a programmable interface to manipulate data required by the algorithm. Our algorithm can be used in a variety of applications for exploration of the morphological potential of the growth models (both theoretical and experimental), arising in all sectors of plant science research.", 
                "date": "2017-01-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Potapov I."
                    }, 
                    {
                        "name": "Jarvenpaa M."
                    }, 
                    {
                        "name": "Akerblom M."
                    }, 
                    {
                        "name": "Raumonen P."
                    }, 
                    {
                        "name": "Kaasalainen M."
                    }
                ], 
                "journal": "GigaScience"
            }
        }
    ], 
    "credit": [
        {
            "name": "Ilya Potapov", 
            "email": "ilya.potapov@tut.fi", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-07-15T08:42:56Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}