{
    "additionDate": "2020-01-14T09:13:28Z",
    "biotoolsCURIE": "biotools:STRAIN",
    "biotoolsID": "STRAIN",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "alessandro.x.brozzi@gsk.com",
            "name": "Alessandro Brozzi",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for multi-locus sequence typing from whole genome sequencing data.\n\nBACKGROUND:Multi-locus sequence typing (MLST) is a standard typing technique used to associate a sequence type (ST) to a bacterial isolate. When the output of whole genome sequencing (WGS) of a sample is available the ST can be assigned directly processing the read-set. Current approaches employ reads mapping (SRST2) against the MLST loci, k-mer distribution (stringMLST), selective assembly (GRAbB) or whole genome assembly (BIGSdb) followed by BLASTn sequence query. Here we present STRAIN (ST Reduced Assembly IdentificatioN), an R package that implements a hybrid strategy between assembly and mapping of the reads to assign the ST to an isolate starting from its read-sets. RESULTS:Analysis of 540 publicly accessible Illumina read sets showed STRAIN to be more accurate at correct allele assignment and new alleles identification compared to SRTS2, stringMLST and GRAbB",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/DalsaMat/STRAIN",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:13:28Z",
    "name": "STRAIN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2887-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Multi-locus sequence typing (MLST) is a standard typing technique used to associate a sequence type (ST) to a bacterial isolate. When the output of whole genome sequencing (WGS) of a sample is available the ST can be assigned directly processing the read-set. Current approaches employ reads mapping (SRST2) against the MLST loci, k-mer distribution (stringMLST), selective assembly (GRAbB) or whole genome assembly (BIGSdb) followed by BLASTn sequence query. Here we present STRAIN (ST Reduced Assembly IdentificatioN), an R package that implements a hybrid strategy between assembly and mapping of the reads to assign the ST to an isolate starting from its read-sets. Results: Analysis of 540 publicly accessible Illumina read sets showed STRAIN to be more accurate at correct allele assignment and new alleles identification compared to SRTS2, stringMLST and GRAbB. STRAIN assigned correctly 3666 out of 3780 alleles (capability to identify correct alleles 97%) and, when presented with samples containing new alleles, identified them in 3730 out of 3780 STs (capability to identify new alleles 98.7%) of the cases. On the same dataset the other tested tools achieved lower capability to identify correct alleles (from 28.5 to 96.9%) and lower capability to identify new alleles (from 1.1 to 97.1%). Conclusions: STRAIN is a new accurate method to assign the alleles and ST to an isolate by processing the raw reads output of WGS. STRAIN is also able to retrieve new allele sequences if present. Capability to identify correct and new STs/alleles, evaluated on a benchmark dataset, are higher than other existing methods. STRAIN is designed for single allele typing as well as MLST. Its implementation in R makes allele and ST assignment simple, direct and prompt to be integrated in wider pipeline of downstream bioinformatics analyses.",
                "authors": [
                    {
                        "name": "Dalsass M."
                    },
                    {
                        "name": "Bodini M."
                    },
                    {
                        "name": "Lambert C."
                    },
                    {
                        "name": "Mortier M.-C."
                    },
                    {
                        "name": "Romanelli M."
                    },
                    {
                        "name": "Medini D."
                    },
                    {
                        "name": "Muzzi A."
                    },
                    {
                        "name": "Brozzi A."
                    }
                ],
                "date": "2019-11-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "STRAIN: An R package for multi-locus sequence typing from whole genome sequencing data"
            },
            "pmcid": "PMC6873635",
            "pmid": "31757201"
        }
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}