{
    "additionDate": "2019-11-14T20:09:59Z",
    "biotoolsCURIE": "biotools:atlases_rat",
    "biotoolsID": "atlases_rat",
    "confidence_flag": "tool",
    "description": "Construction of a rat spinal cord atlas of axon morphometry | Scripts to generate a microstructure atlas of the rat spinal cord | Pipeline for generating spinal cord atlas from electron microscopy | This pipeline is designed to generate an atlas of the spinal cord based on electron microscopy images. The output is a 4D nifti volume containing metrics obtained from scanning electron microscopy | One slice corresponds to one spinal level: C1, C2, ... C8, T1, ...T13, L1, ... L6, S1, ... S4",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/neuropoly/atlas-rat",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-03T11:41:28Z",
    "name": "atlas-rat",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2019.116156",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.Atlases of the central nervous system are essential for understanding the pathophysiology of neurological diseases, which remains one of the greatest challenges in neuroscience research today. These atlases provide insight into the underlying white matter microstructure and have been created from a variety of animal models, including rats. Although existing atlases of the rat spinal cord provide some details of axon microstructure, there is currently no histological dataset that quantifies axon morphometry exhaustively in the entire spinal cord. In this study, we created the first comprehensive rat spinal cord atlas of the white matter microstructure with quantifiable axon and myelin morphometrics. Using full-slice scanning electron microscopy images and state-of-the-art segmentation algorithms, we generated an atlas of microstructural metrics such as axon diameter, axonal density and g-ratio. After registering the Watson spinal cord white matter atlas to our template, we computed statistics across metrics, spinal levels and tracts. We notably found that g-ratio is relatively constant, whereas axon diameter showed the greatest variation. The atlas, data and full analysis code are freely available at: https://github.com/neuropoly/atlas-rat.",
                "authors": [
                    {
                        "name": "Saliani A."
                    },
                    {
                        "name": "Zaimi A."
                    },
                    {
                        "name": "Nami H."
                    },
                    {
                        "name": "Duval T."
                    },
                    {
                        "name": "Stikov N."
                    },
                    {
                        "name": "Cohen-Adad J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-15T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Construction of a rat spinal cord atlas of axon morphometry"
            },
            "pmid": "31491525"
        }
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}