{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T16:28:18.092645Z",
    "biotoolsCURIE": "biotools:rnacontacts",
    "biotoolsID": "rnacontacts",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "A pipeline for predicting contacts from RNA proximity ligation assays.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/smargasyuk/RNAcontacts",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:24:46.728286Z",
    "license": "GPL-3.0",
    "name": "RNAcontacts",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.32607/ACTANATURAE.11893",
            "metadata": {
                "abstract": "High-throughput RNA proximity ligation assays are molecular methods that are used to simultaneously analyze the spatial proximity of many RNAs in living cells. Their principle is based on cross-linking, fragmentation, and subsequent religation of RNAs, followed by high-throughput sequencing. The generated fragments have two different types of splits, one resulting from pre-mRNA splicing and the other formed by the ligation of spatially close RNA strands. Here, we present RNAcontacts, a universal pipeline for detecting RNA–RNA contacts in high-throughput RNA proximity ligation assays. RNAcontacts circumvents the inherent problem of mapping sequences with two distinct types of splits using a two-pass alignment, in which splice junctions are inferred from a control RNA-seq experiment on the first pass and then provided to the aligner as bona fide introns on the second pass. Compared to previously developed methods, our approach allows for a more sensitive detection of RNA contacts and has a higher specificity with respect to splice junctions that are present in the biological sample. RNAcontacts automatically extracts contacts, clusters their ligation points, computes the read support, and generates tracks for visualizing through the UCSC Genome Browser. The pipeline is implemented in Snakemake, a reproducible and scalable workflow management system for rapid and uniform processing of multiple datasets. RNAcontacts is a generic pipeline for the detection of RNA contacts that can be used with any proximity ligation method as long as one of the interacting partners is RNA. RNAcontacts is available via the GitHub repository https://github.com/smargasyuk/RNAcontacts/",
                "authors": [
                    {
                        "name": "Cao Ch."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Margasyuk S.D."
                    },
                    {
                        "name": "Pervouchine D.D."
                    },
                    {
                        "name": "Vlasenok M.A."
                    }
                ],
                "citationCount": 3,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Acta Naturae",
                "title": "RNAcontacts: A Pipeline for Predicting Contacts from RNA Proximity Ligation Assays"
            },
            "pmcid": "PMC10154773",
            "pmid": "37153509",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
