{
    "additionDate": "2021-11-29T10:31:42.544157Z",
    "biotoolsCURIE": "biotools:rhizovision-explorer",
    "biotoolsID": "rhizovision-explorer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lmyork@noble.org",
            "name": "Larry M. York",
            "orcidid": "https://orcid.org/0000-0002-1995-9479",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RhizoVision Explorer is free and open-source software developed for estimating root traits from images acquired from a flatbed scanner or camera. Root images are expected to have a high contrast of roots with the background, homogenous lighting, and minimal overlapping of roots.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/noble-research-institute/RhizoVisionExplorer",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:15:35.970671Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/rootphenomicslab/RhizoVisionExplorer/issues"
        }
    ],
    "name": "RhizoVision Explorer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/aobpla/plab056",
            "metadata": {
                "abstract": "Roots are central to the function of natural and agricultural ecosystems by driving plant acquisition of soil resources and influencing the carbon cycle. Root characteristics like length, diameter and volume are critical to measure to understand plant and soil functions. RhizoVision Explorer is an open-source software designed to enable researchers interested in roots by providing an easy-To-use interface, fast image processing and reliable measurements. The default broken roots mode is intended for roots sampled from pots and soil cores, washed and typically scanned on a flatbed scanner, and provides measurements like length, diameter and volume. The optional whole root mode for complete root systems or root crowns provides additional measurements such as angles, root depth and convex hull. Both modes support providing measurements grouped by defined diameter ranges, the inclusion of multiple regions of interest and batch analysis. RhizoVision Explorer was successfully validated against ground truth data using a new copper wire image set. In comparison, the current reference software, the commercial WinRhizo™, drastically underestimated volume when wires of different diameters were in the same image. Additionally, measurements were compared with WinRhizo™ and IJ_Rhizo using a simulated root image set, showing general agreement in software measurements, except for root volume. Finally, scanned root image sets acquired in different labs for the crop, herbaceous and tree species were used to compare results from RhizoVision Explorer with WinRhizo™. The two software showed general agreement, except that WinRhizo™ substantially underestimated root volume relative to RhizoVision Explorer. In the current context of rapidly growing interest in root science, RhizoVision Explorer intends to become a reference software, improve the overall accuracy and replicability of root trait measurements and provide a foundation for collaborative improvement and reliable access to all.",
                "authors": [
                    {
                        "name": "Dhakal K."
                    },
                    {
                        "name": "Freschet G.T."
                    },
                    {
                        "name": "Griffiths M."
                    },
                    {
                        "name": "Guo H."
                    },
                    {
                        "name": "Seethepalli A."
                    },
                    {
                        "name": "York L.M."
                    }
                ],
                "citationCount": 130,
                "date": "2021-12-01T00:00:00Z",
                "journal": "AoB PLANTS",
                "title": "RhizoVision Explorer: Open-source software for root image analysis and measurement standardization"
            },
            "pmcid": "PMC8598384",
            "pmid": "34804466",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
