{
    "additionDate": "2018-05-03T16:49:17Z",
    "biotoolsCURIE": "biotools:vaccimm",
    "biotoolsID": "vaccimm",
    "credit": [
        {
            "email": "joachim.eichborn@charite.de",
            "name": "Joachim von Eichborn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "robert.preissner@charite.de",
            "name": "Robert Preissner",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simulating peptide vaccination in cancer therapy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.charite.de/vaccimm/",
    "language": [
        "PHP",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "VaccImm",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-127",
            "metadata": {
                "abstract": "Background: Despite progress in conventional cancer therapies, cancer is still one of the leading causes of death in industrial nations. Therefore, an urgent need of progress in fighting cancer remains. A promising alternative to conventional methods is immune therapy. This relies on the fact that low-immunogenic tumours can be eradicated if an immune response against them is induced. Peptide vaccination is carried out by injecting tumour peptides into a patient to trigger a specific immune response against the tumour in its entirety. However, peptide vaccination is a highly complicated treatment and currently many factors like the optimal number of epitopes are not known precisely. Therefore, it is necessary to evaluate how certain parameters influence the therapy.Results: We present the VaccImm Server that allows users to simulate peptide vaccination in cancer therapy. It uses an agent-based model that simulates peptide vaccination by explicitly modelling the involved cells (immune system and cancer) as well as molecules (antibodies, antigens and semiochemicals). As a new feature, our model uses real amino acid sequences to represent molecular binding sites of relevant immune cells. The model is used to generate detailed statistics of the population sizes and states of the single cell types over time. This makes the VaccImm web server well suited to examine the parameter space of peptide vaccination in silico. VaccImm is publicly available without registration on the web at http://bioinformatics.charite.de/vaccimm; all major browsers are supported.Conclusions: The VaccImm Server provides a convenient way to analyze properties of peptide vaccination in cancer therapy. Using the server, we could gain interesting insights into peptide vaccination that reveal the complex and patient-specific nature of peptide vaccination. © 2013 von Eichborn et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "von Eichborn J."
                    },
                    {
                        "name": "Woelke A.L."
                    },
                    {
                        "name": "Castiglione F."
                    },
                    {
                        "name": "Preissner R."
                    }
                ],
                "citationCount": 8,
                "date": "2013-04-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VaccImm: Simulating peptide vaccination in cancer therapy"
            },
            "pmcid": "PMC3651379",
            "pmid": "23586423"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        }
    ],
    "validated": 1
}