{
    "additionDate": "2021-01-18T12:27:59Z",
    "biotoolsCURIE": "biotools:jcnet",
    "biotoolsID": "jcnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "corteseir@ninds.nih.gov",
            "name": "Irene Cortese",
            "typeEntity": "Person"
        }
    ],
    "description": "Progressive multifocal leukoencephalopathy lesion and brain parenchymal segmentation from MRI using serial deep convolutional neural networks.\n\nThis is a deep learning workflow for Progressive Multifocal Leukoencephalopathy (PML) lesion and brain segmentation from brain MRI using Python 3, Keras, and TensorFlow. The model generates segmentation masks of the brain parenchyma and lesions in PML patients.\n\nThis work was conducted at the Neuroimmunology Clinic (NIC) and Translation Neuroradiology Section (TNS) of the National Institute of Neurological Disorders and Stroke (NINDS), in collaboration with colleagues at the National Institute of Mental Health, and the Henry Jackson Foundation at the National Institutes of Health.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/omarallouz/JCnet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T11:02:03Z",
    "license": "GPL-3.0",
    "name": "JCnet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.NICL.2020.102499",
            "metadata": {
                "abstract": "© 2020Progressive multifocal leukoencephalopathy (PML) is a rare opportunistic brain infection caused by the JC virus and associated with substantial morbidity and mortality. Accurate MRI assessment of PML lesion burden and brain parenchymal atrophy is of decisive value in monitoring the disease course and response to therapy. However, there are currently no validated automatic methods for quantification of PML lesion burden or associated parenchymal volume loss. Furthermore, manual brain or lesion delineations can be tedious, require the use of valuable time resources by radiologists or trained experts, and are often subjective. In this work, we introduce JCnet (named after the causative viral agent), an end-to-end, fully automated method for brain parenchymal and lesion segmentation in PML using consecutive 3D patch-based convolutional neural networks. The network architecture consists of multi-view feature pyramid networks with hierarchical residual learning blocks containing embedded batch normalization and nonlinear activation functions. The feature maps across the bottom-up and top-down pathways of the feature pyramids are merged, and an output probability membership generated through convolutional pathways, thus rendering the method fully convolutional. Our results show that this approach outperforms and improves longitudinal consistency compared to conventional, state-of-the-art methods of healthy brain and multiple sclerosis lesion segmentation, utilized here as comparators given the lack of available methods validated for use in PML. The ability to produce robust and accurate automated measures of brain atrophy and lesion segmentation in PML is not only valuable clinically but holds promise toward including standardized quantitative MRI measures in clinical trials of targeted therapies. Code is available at: https://github.com/omarallouz/JCnet.",
                "authors": [
                    {
                        "name": "Al-Louzi O."
                    },
                    {
                        "name": "Roy S."
                    },
                    {
                        "name": "Osuorah I."
                    },
                    {
                        "name": "Parvathaneni P."
                    },
                    {
                        "name": "Smith B.R."
                    },
                    {
                        "name": "Ohayon J."
                    },
                    {
                        "name": "Sati P."
                    },
                    {
                        "name": "Pham D.L."
                    },
                    {
                        "name": "Jacobson S."
                    },
                    {
                        "name": "Nath A."
                    },
                    {
                        "name": "Reich D.S."
                    },
                    {
                        "name": "Cortese I."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "NeuroImage: Clinical",
                "title": "Progressive multifocal leukoencephalopathy lesion and brain parenchymal segmentation from MRI using serial deep convolutional neural networks"
            },
            "pmcid": "PMC7708929"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}