{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T08:11:32Z",
    "biotoolsCURIE": "biotools:ferrdb",
    "biotoolsID": "ferrdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "baojinku@scu.edu.cn",
            "name": "Jinku Bao",
            "typeEntity": "Person"
        }
    ],
    "description": "FerrDb is a manually curated resource for regulators and markers of ferroptosis and ferroptosis-disease associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "http://www.zhounan.org/ferrdb",
    "lastUpdate": "2021-03-10T21:40:18Z",
    "name": "FerrDb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA021",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Ferroptosis is a mode of regulated cell death that depends on iron. Cells die from the toxic accumulation of lipid reactive oxygen species. Ferroptosis is tightly linked to a variety of human diseases, such as cancers and degenerative diseases. The ferroptotic process is complicated and consists of a wide range of metabolites and biomolecules. Although great progress has been achieved, the mechanism of ferroptosis remains enigmatic. We have currently entered an era of extensive knowledge advancement, and thus, it is important to find ways to organize and utilize data efficiently. We have observed a high-quality knowledge base of ferroptosis research is lacking. In this study, we downloaded 784 ferroptosis articles from the PubMed database. Ferroptosis regulators and markers and associated diseases were extracted from these articles and annotated. In summary, 253 regulators (including 108 drivers, 69 suppressors, 35 inducers and 41 inhibitors), 111 markers and 95 ferroptosis-disease associations were found. We then developed FerrDb, the first manually curated database for regulators and markers of ferroptosis and ferroptosis-disease associations. The database has a user-friendly interface, and it will be updated every 6 months to offer long-term service. FerrDb is expected to help researchers acquire insights into ferroptosis. Database URL: http://www.zhounan.org/ferrdb",
                "authors": [
                    {
                        "name": "Bao J."
                    },
                    {
                        "name": "Zhou N."
                    }
                ],
                "citationCount": 27,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "FerrDb: A manually curated resource for regulators and markers of ferroptosis and ferroptosis-disease associations"
            },
            "pmcid": "PMC7100629",
            "pmid": "32219413"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
