{
    "additionDate": "2018-05-05T08:32:58Z",
    "biotoolsCURIE": "biotools:crispr-focus",
    "biotoolsID": "crispr-focus",
    "credit": [
        {
            "email": "xsliu@jimmy.harvard.edu",
            "name": "X. Shirley Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server for designing focused CRISPR screening experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cistrome.org/crispr-focus/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://cistrome.org/crispr-focus/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "CRISPR-FOCUS",
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0184281",
            "metadata": {
                "abstract": "© 2017 Cao et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The recently developed CRISPR screen technology, based on the CRISPR/Cas9 genome editing system, enables genome-wide interrogation of gene functions in an efficient and cost-effective manner. Although many computational algorithms and web servers have been developed to design single-guide RNAs (sgRNAs) with high specificity and efficiency, algorithms specifically designed for conducting CRISPR screens are still lacking. Here we present CRISPR-FOCUS, a web-based platform to search and prioritize sgRNAs for CRISPR screen experiments. With official gene symbols or RefSeq IDs as the only mandatory input, CRISPR-FOCUS filters and prioritizes sgRNAs based on multiple criteria, including efficiency, specificity, sequence conservation, isoform structure, as well as genomic variations including Single Nucleotide Polymorphisms and cancer somatic mutations. CRISPR-FOCUS also provides pre-defined positive and negative control sgRNAs, as well as other necessary sequences in the construct (e.g., U6 promoters to drive sgRNA transcription and RNA scaffolds of the CRISPR/Cas9). These features allow users to synthesize oligonucleotides directly based on the output of CRISPR-FOCUS. Overall, CRISPR-FOCUS provides a rational and high-throughput approach for sgRNA library design that enables users to efficiently conduct a focused screen experiment targeting up to thousands of genes.",
                "authors": [
                    {
                        "name": "Cao Q."
                    },
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Chen C.-H."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Liu X.S."
                    }
                ],
                "citationCount": 8,
                "date": "2017-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CRISPR-FOCUS: A web server for designing focused CRISPR screening experiments"
            },
            "pmcid": "PMC5584922",
            "pmid": "28873439"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}