
{
    "credit": [
        {
            "email": "mikolaj.feliks@gmail.com",
            "name": "Mikolaj Feliks",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/mfx9/pcetk/blob/master/doc/Pcetk_manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Protein properties",
                "uri": "http://edamontology.org/topic_0123"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 American Chemical Society.Pcetk (a pDynamo-based continuum electrostatic toolkit) is an open-source, object-oriented toolkit for the calculation of proton binding energetics in proteins. The toolkit is a module of the pDynamo software library, combining the versatility of the Python scripting language and the efficiency of the compiled languages, C and Cython. In the toolkit, we have connected pDynamo to the external Poisson-Boltzmann solver, extended-MEAD. Our goal was to provide a modern and extensible environment for the calculation of protonation states, electrostatic energies, titration curves, and other electrostatic-dependent properties of proteins. Pcetk is freely available under the CeCILL license, which is compatible with the GNU General Public License. The toolkit can be found on the Web at the address http://github.com/mfx9/pcetk. The calculation of protonation states in proteins requires a knowledge of pKa values of protonatable groups in aqueous solution. However, for some groups, such as protonatable ligands bound to protein, the pKaaq values are often difficult to obtain from experiment. As a complement to Pcetk, we revisit an earlier computational method for the estimation of pKaaq values that has an accuracy of ±0.5 pKa-units or better. Finally, we verify the Pcetk module and the method for estimating pKaaq values with different model cases.",
            "authors": [
                "Feliks M.",
                "Field M.J."
            ],
            "cit_count": 4,
            "doi": "10.1021/ACS.JCIM.5B00262",
            "journal": "Journal of Chemical Information and Modeling",
            "pmid": "26391627",
            "title": "Pcetk: A pDynamo-based Toolkit for Protonation State Calculations in Proteins",
            "year": "2015-10-26"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pcetk",
        "biotoolsID": "pcetk",
        "description": "A pDynamo-based Toolkit for Protonation State Calculations in Proteins",
        "homepage": "https://github.com/mfx9/pcetk",
        "name": "Pcetk"
    }
}