
{
    "credit": [
        {
            "email": "AQUINLAN@GENETICS.UTAH.EDU",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://poretools.readthedocs.io/en/latest/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/poretools-0-3-1-a-toolkit-for-analyzing-nanopore-sequence-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. Motivation: Nanopore sequencing may be the next disruptive technology in genomics, owing to its ability to detect single DNA molecules without prior amplification, lack of reliance on expensive optical components, and the ability to sequence long fragments. The MinION™ from Oxford Nanopore Technologies (ONT) is the first nanopore sequencer to be commercialized and is now available to early-access users. The MinION™ is a USB-connected, portable nanopore sequencer that permits real-time analysis of streaming event data. Currently, the research community lacks a standardized toolkit for the analysis of nanopore datasets. Results: We introduce poretools, a flexible toolkit for exploring datasets generated by nanopore sequencing devices from MinION™ for the purposes of quality control and downstream analysis. Poretools operates directly on the native FAST5 (an application of the HDF5 standard) file format produced by ONT and provides a wealth of format conversion utilities and data exploration and visualization tools.",
            "authors": [
                "Loman N.J.",
                "Quinlan A.R."
            ],
            "cit_count": 155,
            "journal": "Bioinformatics",
            "pmid": "25143291",
            "title": "Poretools: A toolkit for analyzing nanopore sequence data",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:poretools",
        "biotoolsID": "poretools",
        "description": "Flexible toolkit for exploring datasets generated by nanopore sequencing devices from MinION for the purposes of quality control and downstream analysis.",
        "homepage": "https://github.com/arq5x/poretools",
        "name": "Poretools"
    }
}