
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "melanie-support@isb-sib.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://world-2dpage.expasy.org/melanie/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "2D PAGE image",
                        "uri": "http://edamontology.org/data_0942"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Although two-dimensional electrophoresis (2-DE) computer analysis software packages have existed ever since 2-DE technology was developed, it is only now that the hardware and software technology allows large-scale studies to be performed on low-cost personal computers or workstations, and that setting up a 2-DE computer analysis system in a small laboratory is no longer considered a luxury. After a first attempt in the seventies and early eighties to develop 2-DE analysis software systems on hardware that had poor or even no graphical capabilities, followed in the late eighties by a wave of innovative software developments that were possible thanks to new graphical interface standards such as XWindows, a third generation of 2-DE analysis software packages has now come to maturity. It can be run on a variety of low-cost, general-purpose personal computers, thus making the purchase of a 2-DE analysis system easily attainable for even the smallest laboratory that is involved in proteome research. Melanie II 2-D PAGE, developed at the University Hospital of Geneva, is such a third-generation software system for 2-DE analysis. Based on unique image processing algorithms, this user-friendly object-oriented software package runs on multiple platforms, including Unix, MS-Windows 95 and NT, and Power Macintosh. It provides efficient spot detection and quantitation, state-of-the-art image comparison, statistical data analysis facilities, and is Internet-ready. Linked to proteome databases such as those available on the World Wide Web, it represents a valuable tool for the 'Virtual Lab' of the post-genome area.",
            "authors": [
                "Appel R.D.",
                "Palagi P.M.",
                "Walther D.",
                "Vargas J.R.",
                "Sanchez J.-C.",
                "Ravier F.",
                "Pasquali C.",
                "Hochstrasser D.F."
            ],
            "cit_count": 131,
            "doi": "10.1002/elps.1150181506",
            "journal": "Electrophoresis",
            "title": "Melanie II - A third-generation software package for analysis of two-dimensional electrophoresis images: I. Features and user interface",
            "type": "Primary",
            "year": "1997-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:melanie",
        "biotoolsID": "melanie",
        "description": "Offers a unique and flexible interface for the comprehensive visualization, exploration and analysis of 2D gel data. It provides powerful and innovative solutions to shorten the path from data acquisition to protein information, both for conventional 2-DE and DIGE (Fluorescence Difference Gel Electrophoresis) gels.",
        "homepage": "http://world-2dpage.expasy.org/melanie/",
        "name": "Melanie",
        "version": [
            "8"
        ]
    }
}