{
    "additionDate": "2017-01-17T15:01:42Z",
    "biotoolsCURIE": "biotools:tofsims",
    "biotoolsID": "tofsims",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "genfys@gmail.com",
            "name": "Lorenz Gerber",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This packages offers a pipeline for import, processing and analysis of ToF-SIMS 2D image data. Import of Iontof and Ulvac-Phi raw or preprocessed data is supported. For rawdata, mass calibration, peak picking and peak integration exist. General funcionality includes data binning, scaling, image subsetting and visualization. A range of multivariate tools common in the ToF-SIMS community are implemented (PCA, MCR, MAF, MNF).",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/tofsims.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/tofsims_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface analysis",
                    "uri": "http://edamontology.org/operation_3351"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/tofsims.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-3.0",
    "name": "tofsims",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1002/sia.5661",
            "metadata": {
                "abstract": "© 2014 The Authors. Surface and Interface Analysis published by John Wiley & Sons, Ltd. Here, we demonstrate the use of time-of-flight secondary ion mass spectrometry (ToF-SIMS) imaging data for estimation of cell wall thickness in wood samples. Current research in forest biotechnology focuses on transgenic trees with wood properties tailored to specific applications. Appropriate analytical methods to characterize the very heterogeneous wood material are constantly being developed and improved. Chemical imaging ofwood by ToF-SIMS represents an interesting tool for this purpose with many applications. In addition towood chemistry, the impact of specific geneticmodifications onwood anatomy needs to be assessed. Cell wall thickness is an important anatomical parameter that among others is used for assessing biomass accumulation. We developed a strategy to estimate cell wall thickness fromToF-SIMS images and implemented it in the open source programming language 'R'. In brief, randomlines are projected over the black and white mask of a ToF-SIMS image, and length values of all line sections that cut across a cell wall are collected. After enough iteration, the shortest values of the obtained count distribution represent the crossing sections normal to the cell walls, hence cell wall thickness. Compared with conventional light microscopy image analysis, TOF-SIMS data offers many advantages such as submicron resolution and additional spectral information for automated annotation of distinct anatomical features. This work underlines the importance of SIMS imaging for studies of wood chemistry and anatomy and provides a new approach to obtain an important wood anatomical parameter from ToF-SIMS data.",
                "authors": [
                    {
                        "name": "Gerber L."
                    },
                    {
                        "name": "Hoang V.M."
                    },
                    {
                        "name": "Tran L."
                    },
                    {
                        "name": "Kiet H.A.T."
                    },
                    {
                        "name": "Malmberg P."
                    },
                    {
                        "name": "Hanriederd J."
                    },
                    {
                        "name": "Ewing A."
                    }
                ],
                "citationCount": 3,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Surface and Interface Analysis",
                "title": "Using imaging ToF-SIMS data to determine the cell wall thickness of fibers in wood"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.0"
    ]
}