{
    "additionDate": "2018-08-27T15:24:43Z",
    "biotoolsCURIE": "biotools:modpep",
    "biotoolsID": "modpep",
    "credit": [
        {
            "email": "huangsy@hust.edu.cn",
            "name": "Sheng-You Huang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast ab initio structure prediction of protein-bound peptides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://huanglab.phys.hust.edu.cn/modpep/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://huanglab.phys.hust.edu.cn/modpep/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "MODPEP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0246-7",
            "metadata": {
                "abstract": "© 2017 The Author(s).Conformation generation of protein-bound peptides is critical for the determination of protein-peptide complex structures. Despite significant progress in conformer generation of small molecules, few methods have been developed for modeling protein-bound peptide conformations. Here, we have developed a fast de novo peptide modeling algorithm, referred to as MODPEP, for conformational sampling of protein-bound peptides. Given a sequence, MODPEP builds the peptide 3D structure from scratch by assembling amino acids or helix fragments based on constructed rotamer and helix libraries. The MODPEP algorithm was tested on a diverse set of 910 experimentally determined protein-bound peptides with 3-30 amino acids from the PDB and obtained an average accuracy of 1.90 Å when 200 conformations were sampled for each peptide. On average, MODPEP obtained a success rate of 74.3% for all the 910 peptides and ≥ 90% for short peptides with 3-10 amino acids in reproducing experimental protein-bound structures. Comparative evaluations of MODPEP with three other conformer generation methods, PEP-FOLD3, RDKit, and Balloon, have also been performed in both accuracy and success rate. MODPEP is fast and can generate 100 conformations for less than one second. The fast MODPEP will be beneficial for large-scale de novo modeling and docking of peptides. The MODPEP program and libraries are available for download at http://huanglab.phys.hust.edu.cn/.[Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Yan Y."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Huang S.-Y."
                    }
                ],
                "citationCount": 18,
                "date": "2017-11-22T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Efficient conformational ensemble generation of protein-bound peptides"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}