{"credit":[{"name":"Contact Form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.broadinstitute.org/contact"}],"documentation":[{"type":"GENERAL","url":"http://archive.broadinstitute.org/crd/wiki/index.php/Arachne_Main_Page"}],"function":[{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"We describe a new computer system, called ARACHNE, for assembling genome sequence using paired-end whole-genome shotgun reads. ARACHNE has several key features, including an efficient and sensitive procedure for finding read overlaps, a procedure for scoring overlaps that achieves high accuracy by correcting errors before assembly, read merger based on forward-reverse links, and detection of repeat contigs by forward-reverse link inconsistency. To test ARACHNE, we created simulated reads providing ∼10-fold coverage of the genomes of H. influenzae, S. cerevisiae, and D. melanogaster, as well as human chromosomes 21 and 22. The assemblies of these simulated reads yielded nearly complete coverage of the respective genomes, with a small number of contigs joined into a smaller number of supercontigs (or scaffolds). For example, analysis of the D. melanogaster genome yielded ∼98% coverage with an N50 contig length of 324 kb and an N50 supercontig length of 5143 kb. The assembly accuracy was high, although not perfect: small errors occurred at a frequency of roughly 1 per 1 Mb (typically, deletion of ∼1 kb in size), with a very small number of other misassemblies. The assembly was rapid: the Drosophila assembly required only 21 hours on a single 667 MHz processor and used 8.4 Gb of memory.","authors":["Batzoglou S.","Jaffe D.B.","Stanley K.","Butler J.","Gnerre S.","Mauceli E.","Berger B.","Mesirov J.P.","Lander E.S."],"cit_count":319,"journal":"Genome Research","pmid":"11779843","title":"ARACHNE: A whole-genome shotgun assembler","year":"2002-01-29"}],"summary":{"biotoolsCURIE":"biotools:arachne","biotoolsID":"arachne","description":"Program for assembling data from whole genome shotgun sequencing experiments.","homepage":"https://www.broadinstitute.org/computational-rd/computational-research-and-development","name":"Arachne"}}