{
    "additionDate": "2022-04-28T14:44:28.361328Z",
    "biotoolsCURIE": "biotools:optimusqual",
    "biotoolsID": "optimusqual",
    "collectionID": [
        "PerMedCoE"
    ],
    "description": "Boolean regulatory network reconstruction using literature based knowledge.",
    "documentation": [
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://ftp.vital-it.ch/tools/optimusqual/quick_start.pdf"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://ftp.vital-it.ch/tools/optimusqual/optimusqual-1.0.5-Linux-x86_64-g++4.4.7-libc2.12.tar.gz"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.vital-it.ch/software/optimusqual",
    "lastUpdate": "2022-12-14T10:52:55.216592Z",
    "name": "optimusQual",
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1287-z",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Prior knowledge networks (PKNs) provide a framework for the development of computational biological models, including Boolean models of regulatory networks which are the focus of this work. PKNs are created by a painstaking process of literature curation, and generally describe all relevant regulatory interactions identified using a variety of experimental conditions and systems, such as specific cell types or tissues. Certain of these regulatory interactions may not occur in all biological contexts of interest, and their presence may dramatically change the dynamical behaviour of the resulting computational model, hindering the elucidation of the underlying mechanisms and reducing the usefulness of model predictions. Methods are therefore required to generate optimized contextual network models from generic PKNs. Results: We developed a new approach to generate and optimize Boolean networks, based on a given PKN. Using a genetic algorithm, a model network is built as a sub-network of the PKN and trained against experimental data to reproduce the experimentally observed behaviour in terms of attractors and the transitions that occur between them under specific perturbations. The resulting model network is therefore contextualized to the experimental conditions and constitutes a dynamical Boolean model closer to the observed biological process used to train the model than the original PKN. Such a model can then be interrogated to simulate response under perturbation, to detect stable states and their properties, to get insights into the underlying mechanisms and to generate new testable hypotheses. Conclusions: Generic PKNs attempt to synthesize knowledge of all interactions occurring in a biological process of interest, irrespective of the specific biological context. This limits their usefulness as a basis for the development of context-specific, predictive dynamical Boolean models. The optimization method presented in this article produces specific, contextualized models from generic PKNs. These contextualized models have improved utility for hypothesis generation and experimental design. The general applicability of this methodological approach makes it suitable for a variety of biological systems and of general interest for biological and medical research. Our method was implemented in the software optimusqual, available online at http://www.vital-it.ch/software/optimusqual/.",
                "authors": [
                    {
                        "name": "Crespo I."
                    },
                    {
                        "name": "Dorier J."
                    },
                    {
                        "name": "Ebeling M."
                    },
                    {
                        "name": "Liechti R."
                    },
                    {
                        "name": "Niknejad A."
                    },
                    {
                        "name": "Xenarios I."
                    }
                ],
                "citationCount": 28,
                "date": "2016-10-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Boolean regulatory network reconstruction using literature based knowledge with a genetic algorithm optimization method"
            },
            "pmcid": "PMC5053080",
            "pmid": "27716031"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
