{
    "accessibility": "Open access",
    "additionDate": "2021-11-23T14:20:14.306227Z",
    "biotoolsCURIE": "biotools:crtpowerdist",
    "biotoolsID": "crtpowerdist",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "douyang@cheos.ubc.ca",
            "name": "Yongdong Ouyang"
        }
    ],
    "description": "An R package to calculate attained power and construct the power distribution for cross-sectional stepped-wedge and parallel cluster randomized trials.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/douyangyd/CRTpowerdist",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-23T14:20:14.309315Z",
    "license": "GPL-3.0",
    "name": "CRTpowerdist",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2021.106255",
            "metadata": {
                "abstract": "© 2021Background: The attained power, calculated conditional on the realized allocation, of a clinical trial may differ from the expected power, obtained pre-randomization through averaging over all potential allocations that could be generated by the randomization algorithm (RA). For example, a two-arm trial using a RA that is expected to allocate 20 participants to each arm will attain less than the expected power if by chance it allocates 25 and 15 participants to the arms. Cluster randomized trials with unequal cluster sizes have elevated risk of realizing an allocation that yields an attained power much lower than the expected power when modest numbers of clusters are randomized. Method: We developed the R package CRTpowerdist, which implements both simulations and approximate analytic formulae to calculate the attained powers associated with different realized allocations and constructs the pre-randomization power distribution associated with the RA to facilitate assessing the risk of obtaining inadequate power. The package covers unequal cluster-size, cross-sectional stepped-wedge and parallel cluster randomized trials, with or without stratification. Allowed outcome types are: continuous (Gaussian), binary (Binomial) and count (Poisson). The analytic formulae-based calculations are also implemented in a Shiny app. Results: The functionality of the CRTpowerdist is illustrated for each type of trial design. The examples show how to obtain the attained power, the power distribution, and the risk of low attained power, using both simulation and analytic formulae. Conclusion: For cluster randomized trials with unequal cluster sizes, the CRTpowerdist package can assist users in identifying an appropriate randomization algorithm by enabling the user to assess the risk that a randomization algorithm will lead to an allocation with inadequate attained power. The Shiny app makes these assessments accessible to researchers who are unable or do not wish to use the CRTpowerdist package.",
                "authors": [
                    {
                        "name": "Gustafson P."
                    },
                    {
                        "name": "Karim M.E."
                    },
                    {
                        "name": "Ouyang Y."
                    },
                    {
                        "name": "Wong H."
                    },
                    {
                        "name": "Xu L."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "CRTpowerdist: An R package to calculate attained power and construct the power distribution for cross-sectional stepped-wedge and parallel cluster randomized trials"
            },
            "pmid": "34260969"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
