{
    "additionDate": "2021-01-18T08:44:45Z",
    "biotoolsCURIE": "biotools:pptpp",
    "biotoolsID": "pptpp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person"
        }
    ],
    "description": "a novel therapeutic peptide prediction method using physicochemical property encoding and adaptive feature representation learning.\n\nCodes of A novel therapeutic peptide prediction method using physicochemical property encoding and feature representation learning.\n\nThis work is based on Anaconda3(py3.6), and therefore, we recommend using Anaconda for running these codes. The enviroment where PPTPP was built was exported as the file named PPTPPenvironment.yaml in the Zip file, please make sure you have the same environment to make everything works.\n\nMake sure JAVA, C++ complier have been properly installed on your machine to avoid the disappointment of getting errors.\n\nYour javac need to support the version 6, therefore, we recommend to use JDK 11 rather than 13.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YPZ858/PPTPP",
    "lastUpdate": "2021-01-27T16:26:21Z",
    "license": "Apache-2.0",
    "name": "PPTPP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA275",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Peptide is a promising candidate for therapeutic and diagnostic development due to its great physiological versatility and structural simplicity. Thus, identifying therapeutic peptides and investigating their properties are fundamentally important. As an inexpensive and fast approach, machine learning-based predictors have shown their strength in therapeutic peptide identification due to excellences in massive data processing. To date, no reported therapeutic peptide predictor can perform high-quality generic prediction and informative physicochemical properties (IPPs) identification simultaneously. Results: In this work, Physicochemical Property-based Therapeutic Peptide Predictor (PPTPP), a Random Forestbased prediction method was presented to address this issue. A novel feature encoding and learning scheme were initiated to produce and rank physicochemical property-related features. Besides being capable of predicting multiple therapeutics peptides with high comparability to established predictors, the presented method is also able to identify peptides' informative IPP. Results presented in this work not only illustrated the soundness of its working capacity but also demonstrated its potential for investigating other therapeutic peptides.",
                "authors": [
                    {
                        "name": "Zhang Y.P."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 11,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PPTPP: A novel therapeutic peptide prediction method using physicochemical property encoding and adaptive feature representation learning"
            },
            "pmid": "32348463"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
