{
    "additionDate": "2021-12-06T13:10:33.428489Z",
    "biotoolsCURIE": "biotools:stampr",
    "biotoolsID": "stampr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hullahalli@g.harvard.edu",
            "name": "Karthik Hullahalli",
            "orcidid": "https://orcid.org/0000-0003-3064-2090",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mwaldor@research.bwh.harvard.edu",
            "name": "Matthew K. Waldor",
            "orcidid": "https://orcid.org/0000-0003-1843-7000",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "STAMP (Sequence Tag-based Analysis of Microbial Populations) is a tool for the introduction of allelic diversity into otherwise identical bacteria using DNA barcodes enables sequencing-based measurements of these parameters. STAMPR is a successor to STAMP, which accounts for such population expansions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hullahalli/stampr_rtisan",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-06T13:14:13.150035Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hullahalli/stampr_rtisan/issues"
        }
    ],
    "name": "STAMPR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1128/msystems.00887-21",
            "metadata": {
                "abstract": "© 2021 Hullahalli et al.Pathogen population dynamics during infection are critical determinants of infection susceptibility and define patterns of dissemination. However, deciphering these dynamics, particularly founding population sizes in host organs and patterns of dissemination between organs, is difficult because measuring bacterial burden alone is insufficient to observe these patterns. Introduction of allelic diversity into otherwise identical bacteria using DNA barcodes enables sequencing-based measurements of these parameters, in a method known as STAMP (Sequence Tagbased Analysis of Microbial Populations). However, bacteria often undergo unequal expansion within host organs, resulting in marked differences in the frequencies of barcodes in input and output libraries. Here, we show that these differences confound STAMP-based analyses of founding population sizes and dissemination patterns. We present STAMPR, a successor to STAMP, which accounts for such population expansions. Using data from systemic infection of barcoded extraintestinal pathogenic E. coli, we show that this new framework, along with the metrics it yields, enhances the fidelity of measurements of bottlenecks and dissemination patterns. STAMPR was also validated on an independent barcoded Pseudomonas aeruginosa data set, uncovering new patterns of dissemination within the data. This framework (available at https://github.com/hullahalli/stampr_rtisan), when coupled with barcoded data sets, enables a more complete assessment of within-host bacterial population dynamics. IMPORTANCE Barcoded bacteria are often employed to monitor pathogen population dynamics during infection. The accuracy of these measurements is diminished by unequal bacterial expansion rates. Here, we develop computational tools to circumvent this limitation and establish additional metrics that collectively enhance the fidelity of measuring within-host pathogen founding population sizes and dissemination patterns. These new tools will benefit future studies of the dynamics of pathogens and symbionts within their respective hosts and may have additional barcode- based applications beyond host-microbe interactions.",
                "authors": [
                    {
                        "name": "Hullahalli K."
                    },
                    {
                        "name": "Pritchard J.R."
                    },
                    {
                        "name": "Waldor M.K."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-01T00:00:00Z",
                "journal": "mSystems",
                "title": "Refined quantification of infection bottlenecks and pathogen dissemination with STAMPR"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
