{
    "additionDate": "2021-01-18T07:34:14Z",
    "biotoolsCURIE": "biotools:dialib",
    "biotoolsID": "dialib",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "b.schulz@uq.edu.au",
            "name": "Benjamin L. Schulz",
            "typeEntity": "Person"
        }
    ],
    "description": "DIALib is an automated ion library generator for data independent acquisition mass spectrometry analysis of peptides and glycopeptides. DIALib will help enable DIA glycoproteomics as a complementary analytical approach to DDA glycoproteomics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bschulzlab/DIALib",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T08:28:49Z",
    "license": "MIT",
    "link": [
        {
            "note": "Backend and webGUI version",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bschulzlab/dialib_standalone"
        }
    ],
    "name": "DIALib",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1039/C9MO00125E",
            "metadata": {
                "abstract": "This journal is © The Royal Society of Chemistry.Data Independent Acquisition (DIA) Mass Spectrometry (MS) workflows allow unbiased measurement of all detectable peptides from complex proteomes, but require ion libraries for interrogation of peptides of interest. These DIA ion libraries can be theoretical or built from peptide identification data from Data Dependent Acquisition (DDA) MS workflows. However, DDA libraries derived from empirical data rely on confident peptide identification, which can be challenging for peptides carrying complex post-translational modifications. Here, we present DIALib, software to automate the construction of peptide and glycopeptide Data Independent Acquisition ion Libraries. We show that DIALib theoretical ion libraries can identify and measure diverse N- and O-glycopeptides from yeast and mammalian glycoproteins without prior knowledge of the glycan structures present. We present proof-of-principle data from a moderately complex yeast cell wall glycoproteome and a simple mixture of mammalian glycoproteins. We also show that DIALib libraries consisting only of glycan oxonium ions can quickly and easily provide a global compositional glycosylation profile of the detectable \"oxoniome\" of glycoproteomes. DIALib will help enable DIA glycoproteomics as a complementary analytical approach to DDA glycoproteomics.",
                "authors": [
                    {
                        "name": "Phung T.K."
                    },
                    {
                        "name": "Schulz B.L."
                    },
                    {
                        "name": "Zacchi L.F."
                    }
                ],
                "citationCount": 5,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Molecular Omics",
                "title": "DIALib: an automated ion library generator for data independent acquisition mass spectrometry analysis of peptides and glycopeptides"
            },
            "pmid": "32104808"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
