
{
    "credit": [
        {
            "email": "olivia.doppelt@pasteur.fr",
            "name": "Olivia Doppelt-Azeroual",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://regate.readthedocs.io/en/latest/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Loading",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Background: Bioinformaticians routinely use multiple software tools and data sources in their day-to-day work and have been guided in their choices by a number of cataloguing initiatives. The ELIXIR Tools and Data Services Registry (bio.tools) aims to provide a central information point, independent of any specific scientific scope within bioinformatics or technological implementation. Meanwhile, efforts to integrate bioinformatics software in workbench and workflow environments have accelerated to enable the design, automation, and reproducibility of bioinformatics experiments. One such popular environment is the Galaxy framework, with currently more than 80 publicly available Galaxy servers around the world. In the context of a generic registry for bioinformatics software, such as bio.tools, Galaxy instances constitute a major source of valuable content. Yet there has been, to date, no convenient mechanism to register such services en masse. Findings: We present ReGaTE (Registration of Galaxy Tools in Elixir), a software utility that automates the process of registering the services available in a Galaxy instance. This utility uses the BioBlend application program interface to extract service metadata from a Galaxy server, enhance the metadata with the scientific information required by bio.tools, and push it to the registry. Conclusions: ReGaTE provides a fast and convenient way to publish Galaxy services in bio.tools. By doing so, service providers may increase the visibility of their services while enriching the software discovery function that bio.tools provides for its users.",
            "authors": [
                "Doppelt-Azeroual O.",
                "Mareuil F.",
                "Deveaud E.",
                "Kalas M.",
                "Soranzo N.",
                "van den Beek M.",
                "Gruning B.",
                "Ison J.",
                "Menager H."
            ],
            "cit_count": 2,
            "doi": "10.1093/gigascience/gix022",
            "journal": "GigaScience",
            "title": "ReGaTE: Registration of galaxy tools in Elixir",
            "year": "2017-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:regate",
        "biotoolsID": "regate",
        "description": "Command line utility that automates the registration of the tools installed on any given Galaxy portal in ELIXIR bio.tools.",
        "homepage": "https://github.com/C3BI-pasteur-fr/ReGaTE",
        "name": "ReGaTE"
    }
}