{
    "additionDate": "2021-01-18T07:57:49Z",
    "biotoolsCURIE": "biotools:myosoft",
    "biotoolsID": "myosoft",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hchoo2@emory.edu",
            "name": "Hyojung Choo",
            "orcidid": "https://orcid.org/0000-0002-6280-0332",
            "typeEntity": "Person"
        }
    ],
    "description": "An automated muscle histology analysis tool using machine learning algorithm utilizing FIJI/ImageJ software.\n\nautomated muscle histology analysis using machine learning algorithm utilizing FIJI/Image J software.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Hyojung-Choo/Myosoft/tree/Myosoft-hub",
    "lastUpdate": "2021-03-08T08:26:33Z",
    "name": "Myosoft",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0229041",
            "metadata": {
                "abstract": "© 2020 Encarnacion-Rivera et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Skeletal muscle is comprised of a heterogeneous population of muscle fibers which can be classified by their metabolic and contractile properties (fiber \"types\"). Fiber type is a primary determinant of muscle function along with fiber size (cross-sectional area). The fiber type composition of a muscle responds to physiological changes like exercise and aging and is often altered in disease states. Thus, analysis of fiber size and type in histological muscle preparations is a useful method for quantifying key indicators of muscle function and for measuring responses to a variety of stimuli or stressors. These analyses are nearubiquitous in the fields of muscle physiology and myopathy, but are most commonly performed manually, which is highly labor- and time-intensive. To offset this obstacle, we developed Myosoft, a novel method to automate morphometric and fiber type analysis in muscle sections stained with fluorescent antibodies. Methods: Muscle sections were stained for cell boundary (laminin) and myofiber type (myosin heavy chain isoforms). Myosoft, running in the open access software platform FIJI (ImageJ), was used to analyze myofiber size and type in transverse sections of entire gastrocnemius/soleus muscles. Results: Myosoft provides an accurate analysis of hundreds to thousands of muscle fibers within 25 minutes, which is >10-times faster than manual analysis. We demonstrate that Myosoft is capable of handling high-content images even when image or staining quality is suboptimal, which is a marked improvement over currently available and comparable programs. Conclusions: Myosoft is a reliable, accurate, high-throughput, and convenient tool to analyze high-content muscle histology.",
                "authors": [
                    {
                        "name": "Encarnacion-Rivera L."
                    },
                    {
                        "name": "Foltz S."
                    },
                    {
                        "name": "Hartzell H.C."
                    },
                    {
                        "name": "Choo H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Myosoft: An automated muscle histology analysis tool using machine learning algorithm utilizing FIJI/ImageJ software"
            },
            "pmcid": "PMC7055860",
            "pmid": "32130242"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        }
    ]
}