{
    "additionDate": "2017-12-18T00:03:38Z",
    "biotoolsCURIE": "biotools:aptacluster",
    "biotoolsID": "aptacluster",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/CBBresearch/Przytycka/index.cgi#research"
        }
    ],
    "description": "Allows for an efficient clustering of whole HT-SELEX aptamer pools; a task that could not be accomplished with traditional clustering algorithms due to the enormous size of such datasets.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://www.ncbi.nlm.nih.gov/CBBresearch/Przytycka/index.cgi#aptaclustermanual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/CBBresearch/Przytycka/index.cgi#aptatools",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/aptacluster-aptagui-efficient-clustering-of-ht-selex-aptamer-pools.html"
        }
    ],
    "name": "AptaCluster",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1007/978-3-319-05269-4_9",
            "metadata": {
                "abstract": "Systematic Evolution of Ligands by EXponential Enrichment (SELEX) is a well established experimental procedure to identify aptamers - synthetic single-stranded (ribo)nucleic molecules that bind to a given molecular target. Recently, new sequencing technologies have revolutionized the SELEX protocol by allowing for deep sequencing of the selection pools after each cycle. The emergence of High Throughput SELEX (HT-SELEX) has opened the field to new computational opportunities and challenges that are yet to be addressed. To aid the analysis of the results of HT-SELEX and to advance the understanding of the selection process itself, we developed AptaCluster. This algorithm allows for an efficient clustering of whole HT-SELEX aptamer pools; a task that could not be accomplished with traditional clustering algorithms due to the enormous size of such datasets. We performed HT-SELEX with Interleukin 10 receptor alpha chain (IL-10RA) as the target molecule and used AptaCluster to analyze the resulting sequences. AptaCluster allowed for the first survey of the relationships between sequences in different selection rounds and revealed previously not appreciated properties of the SELEX protocol. As the first tool of this kind, AptaCluster enables novel ways to analyze and to optimize the HT-SELEX procedure. Our AptaCluster algorithm is available as a very fast multiprocessor implementation upon request. © 2014 Springer International Publishing Switzerland.",
                "authors": [
                    {
                        "name": "Hoinka J."
                    },
                    {
                        "name": "Berezhnoy A."
                    },
                    {
                        "name": "Sauna Z.E."
                    },
                    {
                        "name": "Gilboa E."
                    },
                    {
                        "name": "Przytycka T.M."
                    }
                ],
                "citationCount": 29,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "AptaCluster - A method to cluster HT-SELEX aptamer pools and lessons from its application"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}