{
    "additionDate": "2021-01-18T09:05:30Z",
    "biotoolsCURIE": "biotools:rnaposers",
    "biotoolsID": "rnaposers",
    "confidence_flag": "tool",
    "description": "Machine Learning Classifiers for Ribonucleic Acid-Ligand Poses.\n\nRNAPosers: Machine-Learning Pose Classifiers for RNA Containing Complexes.\n\nThis repo contains source code for RNAPosers' pose fingerprint and prediction (classification) modules. Pose fingerprint module is written in C++, and will generate executable bin/featurize once compiled. Prediction (classification) is done using Python script src/rna_poser.py and pre-trained classifiers with various parameter setting in classifier/ . All the classifiers were trained with Python 3.5.3 and sklearn v0.19.2, but should be compatible with both Python2 and Python 3 and any later version sklearn. The combined fingerprinting and classification process can be done by running src/run.sh.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                }
            ]
        }
    ],
    "homepage": "https://github.com/atfrank/RNAPosers",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-02-07T12:38:26Z",
    "name": "RNAPosers",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JPCB.0C02322",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Determining the three-dimensional (3D) structures of ribonucleic acid (RNA)-small molecule ligand complexes is critical to understanding molecular recognition in RNA. Computer docking can, in principle, be used to predict the 3D structure of RNA-small molecule complexes. Unfortunately, retrospective analysis has shown that the scoring functions that are typically used for pose prediction tend to misclassify non-native poses as native and vice versa. Here, we use machine learning to train a set of pose classifiers that estimate the relative \"nativeness\"of a set of RNA-ligand poses. At the heart of our approach is the use of a pose \"fingerprint\"(FP) that is a composite of a set of atomic FPs, which individually encode the local \"RNA environment\"around ligand atoms. We found that by ranking poses based on classification scores from our machine learning classifiers, we were able to recover native-like poses better than when we ranked poses based on their docking scores. With a leave-one-out training and testing approach, we found that one of our classifiers could recover poses that were within 2.5 Å of the native poses in ∼80% of the 80 cases we examined, and, on two separate validation sets, we could recover such poses in ∼60% of the cases. Our set of classifiers, which we refer to as RNAPosers, should find utility as a tool to aid in RNA-ligand pose prediction, and so we make RNAPosers open to the academic community via https://github.com/atfrank/RNAPosers.",
                "authors": [
                    {
                        "name": "Chhabra S."
                    },
                    {
                        "name": "Xie J."
                    },
                    {
                        "name": "Frank A.T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-04T00:00:00Z",
                "journal": "Journal of Physical Chemistry B",
                "title": "RNAPosers: Machine Learning Classifiers for Ribonucleic Acid-Ligand Poses"
            },
            "pmid": "32427491"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}