{
    "additionDate": "2024-01-29T10:57:44.182854Z",
    "biotoolsCURIE": "biotools:lora",
    "biotoolsID": "lora",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ondrej.kuda@fgu.cas.cz",
            "name": "Ondrej Kuda",
            "typeEntity": "Person"
        }
    ],
    "description": "Lipid over-representation analysis based on structural information.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://lora.metabolomics.fgu.cas.cz",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-01-29T10:57:44.185746Z",
    "name": "LORA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.3c02039",
            "metadata": {
                "abstract": "With the increasing number of lipidomic studies, there is a need for an efficient and automated analysis of lipidomic data. One of the challenges faced by most existing approaches to lipidomic data analysis is lipid nomenclature. The systematic nomenclature of lipids contains all available information about the molecule, including its hierarchical representation, which can be used for statistical evaluation. The Lipid Over-Representation Analysis (LORA) web application (https://lora.metabolomics.fgu.cas.cz) analyzes this information using the Java-based Goslin framework, which translates lipid names into a standardized nomenclature. Goslin provides the level of lipid hierarchy, including information on headgroups, acyl chains, and their modifications, up to the “complete structure” level. LORA allows the user to upload the experimental query and reference data sets, select a grammar for lipid name normalization, and then process the data. The user can then interactively explore the results and perform lipid over-representation analysis based on selected criteria. The results are graphically visualized according to the lipidome hierarchy. The lipids present in the most over-represented terms (lipids with the highest number of enriched shared structural features) are defined as Very Important Lipids (VILs). For example, the main result of a demo data set is the information that the query is significantly enriched with “glycerophospholipids” containing “acyl 20:4” at the “sn-2 position”. These terms define a set of VILs (e.g., PC 18:2/20:4;O and PE 16:0/20:4(5,8,10,14);OH). All results, graphs, and visualizations are summarized in a report. LORA is a tool focused on the smart mining of epilipidomics data sets to facilitate their interpretation at the molecular level.",
                "authors": [
                    {
                        "name": "Hoffmann N."
                    },
                    {
                        "name": "Kopczynski D."
                    },
                    {
                        "name": "Kuda O."
                    },
                    {
                        "name": "Vondrackova M."
                    }
                ],
                "date": "2023-08-29T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "LORA, Lipid Over-Representation Analysis Based on Structural Information"
            },
            "pmcid": "PMC10469370",
            "pmid": "37584663"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
