{"credit":[{"email":"rd@sanger.ac.uk","name":"Richard Durbin","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"SNP detection","uri":"http://edamontology.org/operation_0484"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"toolType":["Command-line tool"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"Reductions in the cost of sequencing have enabled whole-genome sequencing to identify sequence variants segregating in a population. An efficient approach is to sequence many samples at low coverage, then to combine data across samples to detect shared variants. Here, we present methods to discover and genotype single-nucleotide polymorphism (SNP) sites from low-coverage sequencing data, making use of shared haplotype (linkage disequilibrium) information. For each population, we first collect SNP candidates based on independent sequence calls per site. We then use MARGARITA with genotype or phased haplotype data from the same samples to collect 20 ancestral recombination graphs (ARGs). We refine the posterior probability of SNP candidates by considering possible mutations at internal branches of the 40 marginal ancestral trees inferred from the 20 ARGs at the left and right flanking genotype sites. Using a population genetic prior distribution on tree-branch length and Bayesian inference, we determine a posterior probability of the SNP being real and also the most probable phased genotype call for each individual. We present experiments on both simulation data and real data from the 1000 Genomes Project to prove the applicability of the methods. We also explore the relative tradeoff between sequencing depth and the number of sequenced samples. © 2011 by Cold Spring Harbor Laboratory Press.","authors":["Le S.Q.","Durbin R."],"cit_count":88,"doi":"10.1101/gr.113084.110","journal":"Genome Research","title":"SNP detection and genotyping from low-coverage sequencing data on multiple diploid samples","type":"Primary","year":"2011-06-01"}],"summary":{"biotoolsCURIE":"biotools:qcall","biotoolsID":"qcall","description":"SNP detection and genotyping from low-coverage sequencing data on multiple diploid samples.","homepage":"http://www.sanger.ac.uk/","name":"QCALL"}}