{
    "accessibility": "Open access",
    "additionDate": "2020-12-04T15:37:38Z",
    "biotoolsCURIE": "biotools:recombclust",
    "biotoolsID": "recombclust",
    "collectionID": [
        "RIS3CAT VEIS"
    ],
    "cost": "Free of charge",
    "description": "recombClust is a R package that groups chromosomes by their recombination history. Recombination history is based on a mixture model that, given a pair of SNP-blocks, separates chromosomes in two populations, one with high Linkage Disequilibrium (LD) and low recombination (linkage) and another with low LD and high recombination. The method use the classification of several SNP-block pairs in a region to group chromosomes in clusters with different recombination history. This package takes as input genotype phased data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/isglobal-brge/recombClust/blob/master/vignettes/Overview.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Spain"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/isglobal-brge/recombClust",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-11T10:35:10Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "recombClust",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "brgelab",
    "publication": [
        {
            "doi": "10.1101/792747"
        },
        {
            "doi": "10.1101/gr.258301.119",
            "metadata": {
                "abstract": "© 2020 Ruiz-Arenas et al. This article is distributed exclusively by Cold Spring Harbor Laboratory Press for the first six months after the full-issue publication date (see http://genome.cshlp.org/site/misc/terms.xhtml). After six months, it is available under a Creative Commons License (Attribution-NonCommercial 4.0 International), as described at http://creativecommons.org/licenses/bync/4.0/.Recombination is a main source of genetic variability. However, the potential role of the variation generated by recombination in phenotypic traits, including diseases, remains unexplored because there is currently no method to infer chromosomal subpopulations based on recombination pattern differences. We developed recombClust, a method that uses SNP-phased data to detect differences in historic recombination in a chromosome population. We validated our method by performing simulations and by using real data to accurately predict the alleles of well-known recombination modifiers, including common inversions in Drosophila melanogaster and human, and the chromosomes under selective pressure at the lactase locus in humans. We then applied recombClust to the complex human 1q21.1 region, where nonallelic homologous recombination produces deleterious phenotypes. We discovered and validated the presence of two different recombination histories in these regions that significantly associated with the differential expression of ANKRD35 in whole blood and that were in high linkage with variants previously associated with hypertension. By detecting differences in historic recombination, our method opens a way to assess the influence of recombination variation in phenotypic traits.",
                "authors": [
                    {
                        "name": "Caceres A."
                    },
                    {
                        "name": "Gonzalez J."
                    },
                    {
                        "name": "Gonzalez J.R."
                    },
                    {
                        "name": "Lopez M."
                    },
                    {
                        "name": "Pelegri-Siso D."
                    },
                    {
                        "name": "Ruiz-Arenas C."
                    }
                ],
                "date": "2020-11-17T00:00:00Z",
                "journal": "Genome Research",
                "title": "Identifying chromosomal subpopulations based on their recombination histories advances the study of the genetic basis of phenotypic traits"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        }
    ],
    "validated": 1,
    "version": [
        "v0.0.9",
        "v1.0.0"
    ]
}
