{"collectionID": [], "accessibility": [], "topic": [{"term": "Protein function prediction", "uri": "http://edamontology.org/topic_1775"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1471-2164-12-S4-S12", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Cutoff Scanning Matrix (CSM): Structural classification and function prediction by protein inter-residue distance patterns", "abstract": "Background: The unforgiving pace of growth of available biological data has increased the demand for efficient and scalable paradigms, models and methodologies for automatic annotation. In this paper, we present a novel structure-based protein function prediction and structural classification method: Cutoff Scanning Matrix (CSM). CSM generates feature vectors that represent distance patterns between protein residues. These feature vectors are then used as evidence for classification. Singular value decomposition is used as a preprocessing step to reduce dimensionality and noise. The aspect of protein function considered in the present work is enzyme activity. A series of experiments was performed on datasets based on Enzyme Commission (EC) numbers and mechanistically different enzyme superfamilies as well as other datasets derived from SCOP release 1.75.Results: CSM was able to achieve a precision of up to 99% after SVD preprocessing for a database derived from manually curated protein superfamilies and up to 95% for a dataset of the 950 most-populated EC numbers. Moreover, we conducted experiments to verify our ability to assign SCOP class, superfamily, family and fold to protein domains. An experiment using the whole set of domains found in last SCOP version yielded high levels of precision and recall (up to 95%). Finally, we compared our structural classification results with those in the literature to place this work into context. Our method was capable of significantly improving the recall of a previous study while preserving a compatible precision level.Conclusions: We showed that the patterns derived from CSMs could effectively be used to predict protein function and thus help with automatic function annotation. We also demonstrated that our method is effective in structural classification tasks. These facts reinforce the idea that the pattern of inter-residue distances is an important component of family structural signatures. Furthermore, singular value decomposition provided a consistent increase in precision and recall, which makes it an important preprocessing step when dealing with noisy data. © 2011 Pires et al; licensee BioMed Central Ltd.", "citationCount": 20, "authors": [{"name": "Pires D.E.V."}, {"name": "de Melo-Minardi R.C."}, {"name": "dos Santos M.A."}, {"name": "da Silveira C.H."}, {"name": "Santoro M.M."}, {"name": "Meira Jr. W."}], "date": "2011-12-22T00:00:00Z", "journal": "BMC Genomics"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://homepages.dcc.ufmg.br/~dpires/index.html", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:csm", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://homepages.dcc.ufmg.br/~dpires/csm/index.html", "function": [{"note": null, "input": [], "operation": [{"term": "Protein function prediction", "uri": "http://edamontology.org/operation_1777"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Recognition", "uri": "http://edamontology.org/operation_2423"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Prediction", "uri": "http://edamontology.org/operation_2423"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Protein sequence analysis", "uri": "http://edamontology.org/operation_2479"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Classification", "uri": "http://edamontology.org/operation_2990"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:57Z", "otherID": [], "description": "CSM (Cutoff Scanning Matrix) is a novel structure-based protein function prediction and structural classification method. CSM generates feature vectors that represent distance patterns between protein residues. These feature vectors are then used as evidence for classification.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Perl"], "link": [{"url": "http://www.mybiosoftware.com/csm-funciton-prediction-fold-recognition-protein-inter-residue-distance-patterns.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "csm", "additionDate": "2017-12-18T00:04:59Z", "name": "CSM", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}