{
    "accessibility": "Open access",
    "additionDate": "2019-07-16T10:03:39Z",
    "biotoolsCURIE": "biotools:DeepMito",
    "biotoolsID": "DeepMito",
    "collectionID": [
        "Bologna Biocomputing Group"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "castrense.savojardo2@unibo.it",
            "name": "Castrense Savojardo",
            "orcidid": "https://orcid.org/0000-0002-7359-0633",
            "url": "http://biocomp.unibo.it/savojard"
        },
        {
            "email": "pierluigi.martelli@unibo.it",
            "name": "Pier Luigi Martelli",
            "url": "http://biocomp.unibo.it"
        },
        {
            "name": "ELIXIR-ITA-BOLOGNA",
            "url": "http://biocomp.unibo.it"
        }
    ],
    "description": "Predictor of protein sub-mitochondrial localization based on deep learning",
    "documentation": [
        {
            "type": [
                "Command-line options"
            ],
            "url": "https://github.com/BolognaBiocomp/deepmito"
        }
    ],
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/bolognabiocomp/deepmito"
        },
        {
            "type": "Source code",
            "url": "https://github.com/BolognaBiocomp/deepmito"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-BOLOGNA",
            "savo"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence (raw)",
                        "uri": "http://edamontology.org/data_2974"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence report",
                        "uri": "http://edamontology.org/data_2955"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://busca.biocomp.unibo.it/deepmito",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:11:44.292554Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://busca.biocomp.unibo.it/deepmito"
        }
    ],
    "maturity": "Mature",
    "name": "DeepMito",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-BOLOGNA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz512",
            "metadata": {
                "abstract": "Motivation: The correct localization of proteins in cell compartments is a key issue for their function. Particularly, mitochondrial proteins are physiologically active in different compartments and their aberrant localization contributes to the pathogenesis of human mitochondrial pathologies. Many computational methods exist to assign protein sequences to subcellular compartments such as nucleus, cytoplasm and organelles. However, a substantial lack of experimental evidence in public sequence databases hampered so far a finer grain discrimination, including also intraorganelle compartments. Results: We describe DeepMito, a novel method for predicting protein sub-mitochondrial cellular localization. Taking advantage of powerful deep-learning approaches, such as convolutional neural networks, our method is able to achieve very high prediction performances when discriminating among four different mitochondrial compartments (matrix, outer, inner and intermembrane regions). The method is trained and tested in cross-validation on a newly generated, high-quality dataset comprising 424 mitochondrial proteins with experimental evidence for sub-organelle localizations. We benchmark DeepMito towards the only one recent approach developed for the same task. Results indicate that DeepMito performances are superior. Finally, genomic-scale prediction on a highly-curated dataset of human mitochondrial proteins further confirms the effectiveness of our approach and suggests that DeepMito is a good candidate for genome-scale annotation of mitochondrial protein subcellular localization. Availability and implementation: The DeepMito web server as well as all datasets used in this study are available at http://busca.biocomp.unibo.it/deepmito. A standalone version of DeepMito is available on DockerHub at https://hub.docker.com/r/bolognabiocomp/deepmito. DeepMito source code is available on GitHub at https://github.com/BolognaBiocomp/deepmito.",
                "authors": [
                    {
                        "name": "Bruciaferri N."
                    },
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Savojardo C."
                    },
                    {
                        "name": "Tartari G."
                    }
                ],
                "citationCount": 67,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepMito: Accurate prediction of protein sub-mitochondrial localization using convolutional neural networks"
            },
            "pmcid": "PMC6956790",
            "pmid": "31218353",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/s12859-020-03617-z",
            "metadata": {
                "abstract": "Background: The prediction of protein subcellular localization is a key step of the big effort towards protein functional annotation. Many computational methods exist to identify high-level protein subcellular compartments such as nucleus, cytoplasm or organelles. However, many organelles, like mitochondria, have their own internal compartmentalization. Knowing the precise location of a protein inside mitochondria is crucial for its accurate functional characterization. We recently developed DeepMito, a new method based on a 1-Dimensional Convolutional Neural Network (1D-CNN) architecture outperforming other similar approaches available in literature. Results: Here, we explore the adoption of DeepMito for the large-scale annotation of four sub-mitochondrial localizations on mitochondrial proteomes of five different species, including human, mouse, fly, yeast and Arabidopsis thaliana. A significant fraction of the proteins from these organisms lacked experimental information about sub-mitochondrial localization. We adopted DeepMito to fill the gap, providing complete characterization of protein localization at sub-mitochondrial level for each protein of the five proteomes. Moreover, we identified novel mitochondrial proteins fishing on the set of proteins lacking any subcellular localization annotation using available state-of-the-art subcellular localization predictors. We finally performed additional functional characterization of proteins predicted by DeepMito as localized into the four different sub-mitochondrial compartments using both available experimental and predicted GO terms. All data generated in this study were collected into a database called DeepMitoDB (available at http://busca.biocomp.unibo.it/deepmitodb), providing complete functional characterization of 4307 mitochondrial proteins from the five species. Conclusions: DeepMitoDB offers a comprehensive view of mitochondrial proteins, including experimental and predicted fine-grain sub-cellular localization and annotated and predicted functional annotations. The database complements other similar resources providing characterization of new proteins. Furthermore, it is also unique in including localization information at the sub-mitochondrial level. For this reason, we believe that DeepMitoDB can be a valuable resource for mitochondrial research.",
                "authors": [
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Savojardo C."
                    },
                    {
                        "name": "Tartari G."
                    }
                ],
                "citationCount": 6,
                "date": "2020-09-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Large-scale prediction and analysis of protein sub-mitochondrial localization with DeepMito"
            },
            "pmcid": "PMC7493403",
            "pmid": "32938368",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
