{
    "accessibility": "Open access",
    "additionDate": "2019-06-01T15:27:18Z",
    "biotoolsCURIE": "biotools:pwrEWAS",
    "biotoolsID": "pwrEWAS",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sgraw@kumc.edu",
            "name": "Stefan Graw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Computationally efficient tool to estimate power in EWAS as a function of sample and effect size for two-group comparisons of DNAm.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/stefangraw/pwrEWAS/blob/master/vignettes/vignette.pdf"
        }
    ],
    "download": [
        {
            "note": "R package for pwrEWAS",
            "type": "Source code",
            "url": "https://github.com/stefangraw/pwrEWAS"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "https://biostats-shinyr.kumc.edu/pwrEWAS/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/stefangraw/pwrEWAS/issues"
        }
    ],
    "maturity": "Mature",
    "name": "pwrEWAS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2804-7",
            "metadata": {
                "abstract": "© 2019 The Author(s). Background: When designing an epigenome-wide association study (EWAS) to investigate the relationship between DNA methylation (DNAm) and some exposure(s) or phenotype(s), it is critically important to assess the sample size needed to detect a hypothesized difference with adequate statistical power. However, the complex and nuanced nature of DNAm data makes direct assessment of statistical power challenging. To circumvent these challenges and to address the outstanding need for a user-friendly interface for EWAS power evaluation, we have developed pwrEWAS. Results: The current implementation of pwrEWAS accommodates power estimation for two-group comparisons of DNAm (e.g. case vs control, exposed vs non-exposed, etc.), where methylation assessment is carried out using the Illumina Human Methylation BeadChip technology. Power is calculated using a semi-parametric simulation-based approach in which DNAm data is randomly generated from beta-distributions using CpG-specific means and variances estimated from one of several different existing DNAm data sets, chosen to cover the most common tissue-types used in EWAS. In addition to specifying the tissue type to be used for DNAm profiling, users are required to specify the sample size, number of differentially methylated CpGs, effect size(s) (Δ β ), target false discovery rate (FDR) and the number of simulated data sets, and have the option of selecting from several different statistical methods to perform differential methylation analyses. pwrEWAS reports the marginal power, marginal type I error rate, marginal FDR, and false discovery cost (FDC). Here, we demonstrate how pwrEWAS can be applied in practice using a hypothetical EWAS. In addition, we report its computational efficiency across a variety of user settings. Conclusion: Both under- A nd overpowered studies unnecessarily deplete resources and even risk failure of a study. With pwrEWAS, we provide a user-friendly tool to help researchers circumvent these risks and to assist in the design and planning of EWAS. Availability: The web interface is written in the R statistical programming language using Shiny (RStudio Inc., 2016) and is available at https://biostats-shinyr.kumc.edu/pwrEWAS/. The R package for pwrEWAS is publicly available at GitHub (https://github.com/stefangraw/pwrEWAS).",
                "authors": [
                    {
                        "name": "Graw S."
                    },
                    {
                        "name": "Henn R."
                    },
                    {
                        "name": "Koestler D.C."
                    },
                    {
                        "name": "Thompson J.A."
                    }
                ],
                "citationCount": 17,
                "date": "2019-04-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PwrEWAS: A user-friendly tool for comprehensive power estimation for epigenome wide association studies (EWAS)"
            },
            "pmid": "31035919",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
