{
    "additionDate": "2019-11-14T19:47:16Z",
    "biotoolsCURIE": "biotools:SMARTp",
    "biotoolsID": "SMARTp",
    "confidence_flag": "tool",
    "description": "A SMART design for nonsurgical treatments of chronic periodontitis with spatially referenced and nonrandomly missing skewed outcomes | R codes for sample size calculation to detect dynamic treatment regime (DTR) effects based on changes in CAL outcomes from a non-surgical chronic periodontitis treatments study. The experiment is performed under a SMART design. The clustered tooth (sub-unit) level CAL outcomes are skewed, spatially-referenced, and non-randomly missing. The imple… | A SMART design for non-surgical treatments of chronic periodontitis with spatially-referenced and non-randomly missing skewed outcomes | devtools::install_github(\"bandyopd/SMARTp\") | # Install from CRAN (when available)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bandyopd/SMARTp",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-21T11:20:25Z",
    "name": "SMARTp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/BIMJ.201900027",
            "metadata": {
                "abstract": "© 2019 WILEY-VCH Verlag GmbH & Co. KGaA, WeinheimThis paper proposes dynamic treatment regimes (DTRs) as effective individualized treatment strategies for managing chronic periodontitis. The proposed DTRs are studied via SMARTp—a two-stage sequential multiple assignment randomized trial (SMART) design. For this design, we propose a statistical analysis plan and a novel cluster-level sample size calculation method that factors in typical features of periodontal responses such as non-Gaussianity, spatial clustering, and nonrandom missingness. Here, each patient is viewed as a cluster, and a tooth within a patient's mouth is viewed as an individual unit inside the cluster, with the tooth-level covariance structure described by a conditionally autoregressive structure. To accommodate possible skewness and tail behavior, the tooth-level clinical attachment level (CAL) response is assumed to be skew-t, with the nonrandomly missing structure captured via a shared parameter model corresponding to the missingness indicator. The proposed method considers mean comparison for the regimes with or without sharing an initial treatment, where the expected values and corresponding variances or covariance for the sample means of a pair of DTRs are derived by the inverse probability weighting and method of moments. Simulation studies are conducted to investigate the finite-sample performance of the proposed sample size formulas under a variety of outcome-generating scenarios. An R package SMARTp implementing our sample size formula is available at the Comprehensive R Archive Network for free download.",
                "authors": [
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Bandyopadhyay D."
                    },
                    {
                        "name": "Salehabadi S.M."
                    },
                    {
                        "name": "Michalowicz B."
                    },
                    {
                        "name": "Chakraborty B."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Biometrical Journal",
                "title": "SMARTp: A SMART design for nonsurgical treatments of chronic periodontitis with spatially referenced and nonrandomly missing skewed outcomes"
            },
            "pmid": "31531896"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ],
    "validated": 1
}