{
    "additionDate": "2017-08-20T15:57:47Z",
    "biotoolsCURIE": "biotools:linkage",
    "biotoolsID": "linkage",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "ott@rockefeller.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The core of this package is a series of programs for maximum likelihood estimation of recombination rates, calculation of lod score tables, and analysis of genetic risks. The analysis programs are divided into two groups. The first group can be used for general pedigrees with marker and disease loci. Programs in the second group are for three- generation families and codominant marker loci, and are primarily intended for the construction of genetic maps from data on reference families.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jurgott.org/linkage/LinkageUser.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://www.jurgott.org/linkage/LinkagePC.html",
    "language": [
        "Pascal"
    ],
    "lastUpdate": "2021-04-19T07:14:28.894761Z",
    "license": "Not licensed",
    "name": "LINKAGE",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_007042"
        },
        {
            "type": "rrid",
            "value": "RRID:SCR_007033"
        },
        {
            "type": "rrid",
            "value": "RRID:SCR_009162"
        }
    ],
    "owner": "admin",
    "publication": [
        {
            "metadata": {
                "abstract": "The increasing number of DNA polymorphisms characterized in humans will soon allow the construction of fine genetic maps of human chromosomes. This advance calls for a reexamination of current methodologies for linkage analysis by the family method. We have investigated the relative efficiency of two-point and three-point linkage tests for the detection of linkage and the estimation of recombination in a variety of situations. This led us to develop the computer program LINKAGE to perform multilocus linkage analysis. The investigation also enables us to propose a method of location scores for the efficient detection of linkage between a disease locus, or a new genetic marker, and a linkage group previously established from a reference panel of families. The method is illustrated by an application to simulated pedigree data in a situation akin to Duchenne muscular dystrophy. These results show that considerable economy and efficiency can be brought to the mapping endeavor by resorting to appropriate strategies of detecting linkage and by constructing the human genetic map on a common reference panel of families.",
                "authors": [
                    {
                        "name": "Lathrop G.M."
                    },
                    {
                        "name": "Lalouel J.M."
                    },
                    {
                        "name": "Julier C."
                    },
                    {
                        "name": "Ott J."
                    }
                ],
                "citationCount": 2167,
                "date": "1984-01-01T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Strategies for multilocus linkage analysis in humans"
            },
            "pmcid": "PMC345524",
            "pmid": "6587361",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}