{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-08-15T14:59:38Z",
    "biotoolsCURIE": "biotools:glactools",
    "biotoolsID": "glactools",
    "collectionID": [],
    "confidence_flag": null,
    "cost": "Free of charge",
    "credit": [],
    "description": "glactools: A set of programs for the management of allele counts and genotype likelihoods",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [],
    "homepage": "https://grenaud.github.io/glactools/",
    "homepage_status": 0,
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-08-15T15:00:41Z",
    "license": "GPL-3.0",
    "link": [],
    "maturity": "Mature",
    "name": "glactools",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "grenaud",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx749",
            "metadata": {
                "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved. Motivation Research projects involving population genomics routinely need to store genotyping information, population allele counts, combine files from different samples, query the data and export it to various formats. This is often done using bespoke in-house scripts, which cannot be easily adapted to new projects and seldom constitute reproducible workflows. Results We introduce glactools, a set of command-line utilities that can import data from genotypes or population-wide allele counts into an intermediate representation, compute various operations on it and export the data to several file formats used by population genetics software. This intermediate format can take two forms, one to store per-individual genotype likelihoods and a second for allele counts from one or more individuals. glactools allows users to perform operations such as intersecting datasets, merging individuals into populations, creating subsets, perform queries (e.g. return sites where a given population does not share an allele with a second one) and compute summary statistics to answer biologically relevant questions.",
                "authors": [
                    {
                        "name": "Renaud G."
                    }
                ],
                "citationCount": 1,
                "date": "2018-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Glactools: A command-line toolset for the management of genotype likelihoods and allele counts"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 0,
    "version": []
}