{
    "additionDate": "2019-12-23T01:10:30Z",
    "biotoolsCURIE": "biotools:OrthoMCL",
    "biotoolsID": "OrthoMCL",
    "description": "Orthologs are homologs seperated by speciation events. Paralogs are homologs separated by duplication events. Detection of orthologs is becoming much more important with the rapid progress in genome sequencing.",
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Tree dating",
                    "uri": "http://edamontology.org/operation_3942"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stajichlab/OrthoMCL",
    "lastUpdate": "2024-11-24T15:19:52.213989Z",
    "name": "OrthoMCL",
    "owner": "fruitshuang",
    "publication": [
        {
            "doi": "10.1002/0471250953.bi0612s35",
            "metadata": {
                "abstract": "OrthoMCL is an algorithm for grouping proteins into ortholog groups based on their sequence similarity. OrthoMCL-DB is a public database that allows users to browse and view ortholog groups that were pre-computed using the OrthoMCL algorithm. Version 4 of this database contained 116,536 ortholog groups clustered from 1,270,853 proteins obtained from 88 eukaryotic genomes, 16 archaean genomes, and 34 bacterial genomes. Future versions of OrthoMCL-DB will include more proteomes as more genomes are sequenced. Here, we describe how you can group your proteins of interest into ortholog clusters using two different means provided by the OrthoMCL system. The OrthoMCL-DB Web site has a tool for uploading and grouping a set of protein sequences, typically representing a proteome. This method maps the uploaded proteins to existing groups in OrthoMCL-DB. Alternatively, if you have proteins from a set of genomes that need to be grouped, you can download, install, and run the stand-alone OrthoMCL software. © 2011 by John Wiley & Sons, Inc.",
                "authors": [
                    {
                        "name": "Brunk B.P."
                    },
                    {
                        "name": "Chen F."
                    },
                    {
                        "name": "Fischer S."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Harb O.S."
                    },
                    {
                        "name": "Iodice J.B."
                    },
                    {
                        "name": "Roos D.S."
                    },
                    {
                        "name": "Shanmugam D."
                    },
                    {
                        "name": "Stoeckert Jr. C.J."
                    }
                ],
                "citationCount": 346,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Current Protocols in Bioinformatics",
                "title": "Using OrthoMCL to assign proteins to OrthoMCL-DB groups or to cluster proteomes into new ortholog groups"
            },
            "pmcid": "PMC3196566",
            "pmid": "21901743",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1101/gr.1224503",
            "metadata": {
                "abstract": "The identification of orthologous groups is useful for genome annotation, studies on gene/protein evolution, comparative genomics, and the identification of taxonomically restricted sequences. Methods successfully exploited for prokaryotic genome analysis have proved difficult to apply to eukaryotes, however, as larger genomes may contain multiple paralogous genes, and sequence information is often incomplete. OrthoMCL provides a scalable method for constructing orthologous groups across multiple eukaryotic taxa, using a Markov Cluster algorithm to group (putative) orthologs and paralogs. This method performs similarly to the INPARANOID algorithm when applied to two genomes, but can be extended to cluster orthologs from multiple species. OrthoMCL clusters are coherent with groups identified by EGO, but improved recognition of \"recent\" paralogs permits overlapping EGO groups representing the same gene to be merged. Comparison with previously assigned EC annotations suggests a high degree of reliability, implying utility for automated eukaryotic genome annotation. OrthoMCL has been applied to the proteome data set from seven publicly available genomes (human, fly, worm, yeast, Arabidopsis, the malaria parasite Plasmodium falciparum, and Escherichia coli). A Web interface allows queries based on individual genes or user-defined phylogenetic patterns (http://www.cbil.upenn.edu/gene-family). Analysis of clusters incorporating P. falciparum genes identifies numerous enzymes that were incompletely annotated in first-pass annotation of the parasite genome.",
                "authors": [
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Roos D.S."
                    },
                    {
                        "name": "Stoeckert Jr. C.J."
                    }
                ],
                "citationCount": 4572,
                "date": "2003-09-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "OrthoMCL: Identification of ortholog groups for eukaryotic genomes"
            },
            "pmcid": "PMC403725",
            "pmid": "12952885",
            "type": [
                "Primary"
            ]
        }
    ],
    "validated": 1
}
