{"credit":[],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Validation","uri":"http://edamontology.org/operation_2428"},{"term":"DNA profiling","uri":"http://edamontology.org/operation_3894"}]}],"labels":{"topic":[{"term":"Database management","uri":"http://edamontology.org/topic_3489"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"}]},"publication":[{"abstract":"© 2019 Elsevier B.V.This study provides 398 novel complete mitochondrial control region sequences that augment the still underrepresented data from Africa by three datasets: a mixed West African sample set deriving from 12 countries (n = 145) and datasets from Côte d'Ivoire (Ivory Coast) (n = 100) as well as Rwanda (n = 153). The analysis of mtDNA variation and genetic comparisons with published data revealed low random match probabilities in all three datasets and typical West African and East African diversity, respectively. Genetic parameters indicate that the presented mixed West African dataset may serve as first forensic mtDNA control region database for West Africa in general. In addition, a strategy for responsible forensic application of precious mtDNA population samples potentially containing close maternal relatives is outlined. The datasets will be uploaded to the forensic mtDNA database EMPOP (https://empop.online) upon publication.","authors":["Gobel T.M.K.","Bodner M.","Robino C.","Augustin C.","Huber G.E.","Marra M.","Mutesa L.","Pasino S.","Santovito A.","Zimmermann B.","Schneider P.M.","Parson W."],"cit_count":0,"doi":"10.1016/J.FSIGEN.2019.102202","journal":"Forensic Science International: Genetics","pmid":"31775077","title":"Mitochondrial DNA variation in Sub-Saharan Africa: Forensic data from a mixed West African sample, Côte d'Ivoire (Ivory Coast), and Rwanda","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:EMPOP","biotoolsID":"EMPOP","description":"Forensic data from a mixed West African sample, Côte d'Ivoire (Ivory Coast), and Rwanda.\n\nIn total, the EMPOP Release 13 holds 48,572 quality-controlled mitotypes with at least HVS-I variation (16024-16365). Thereof,.\n\nThe EMPOP project and database arose from collaborative studies that were established and discussed at scientific meetings. We continue this tradition to inspire and facilitate research","homepage":"https://empop.online","name":"EMPOP"}}