{
    "additionDate": "2019-11-14T20:00:21Z",
    "biotoolsCURIE": "biotools:MANTA_autogenerated",
    "biotoolsID": "MANTA_autogenerated",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > NAME (MANTA) SIMILAR TO (PUB. DIFFERENT) bio.tools/manta_sv (Manta), bio.tools/manta (manta) | > CORRECT NAME OF TOOL COULD ALSO BE 'Maastricht Antiarrhythmic Drug Evaluator', 'AADs' | A computational tool for better understanding of antiarrhythmic drugs | Cardiac arrhythmias are a global health burden, contributing significantly to morbidity and mortality worldwide. Despite technological advances in catheter ablation therapy, antiarrhythmic drugs (AADs) remain a cornerstone for the management of cardiac arrhythmias. Experimental and translational studies have shown that commonly used AADs exert multiple effects in the heart, the manifestation of which strongly depends on the exact experimental or clinical conditions. This diversity makes the optimal clinical application of AADs challenging",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31493513",
    "lastUpdate": "2019-11-14T20:00:21Z",
    "name": "MANTA_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.PHRS.2019.104444",
            "metadata": {
                "abstract": "© 2019 The AuthorsCardiac arrhythmias are a global health burden, contributing significantly to morbidity and mortality worldwide. Despite technological advances in catheter ablation therapy, antiarrhythmic drugs (AADs) remain a cornerstone for the management of cardiac arrhythmias. Experimental and translational studies have shown that commonly used AADs exert multiple effects in the heart, the manifestation of which strongly depends on the exact experimental or clinical conditions. This diversity makes the optimal clinical application of AADs challenging. Here, we present a novel computational tool designed to facilitate a better understanding of the complex mechanisms of action of AADs (the Maastricht Antiarrhythmic Drug Evaluator, MANTA). In this tool, we integrated published computational cardiomyocyte models from different species (mouse, guinea pig, rabbit, dog, and human), regions (atrial, ventricular, and Purkinje cells) and disease conditions (atrial fibrillation- and heart failure-related remodeling). Subsequently, we investigated the effects of clinically available AADs (Vaughan-Williams Classes I, III, IV and multi-channel blockers) on action potential (AP) properties and the occurrence of proarrhythmic effects such as early afterdepolarizations. Steady-state drug effects were simulated based on a newly compiled overview of published IC50 values for each cardiac ion channel and by integrating state-dependent block of the cardiac Na+-current by Class I AADs using a Markov-model approach. Using MANTA, we demonstrated and characterized important species-, rate-, cell-type-, and disease-state-specific AAD effects, including 1) a stronger effect of Class III AADs in large mammals than in rodents; 2) a rate-dependent decrease in upstroke velocity with Class I AADs and reverse rate-dependent effects of Class III AADs on action potential duration; 3) ventricular-predominant effects of pure IKr blockers; 4) preferential reduction in atrial AP upstroke velocity with vernakalant; and 5) excessive AP prolongation with Class III AADs other than amiodarone under heart failure conditions. In conclusion, the effects of AADs are highly complex and strongly dependent on the experimental or clinical conditions. MANTA is a powerful and freely available tool reproducing a wide range of AAD characteristics that enables analyses of the underlying ionic mechanisms. Use of MANTA is expected to improve our understanding of AAD effects on cellular electrophysiology under a wide range of conditions, which may provide clinically-relevant information on the safety and efficacy of AAD treatment.",
                "authors": [
                    {
                        "name": "Sutanto H."
                    },
                    {
                        "name": "Laudy L."
                    },
                    {
                        "name": "Clerx M."
                    },
                    {
                        "name": "Dobrev D."
                    },
                    {
                        "name": "Crijns H.J.G.M."
                    },
                    {
                        "name": "Heijman J."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Pharmacological Research",
                "title": "Maastricht antiarrhythmic drug evaluator (MANTA): A computational tool for better understanding of antiarrhythmic drugs"
            },
            "pmid": "31493513"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ]
}