{
    "additionDate": "2021-12-10T12:38:40.854138Z",
    "biotoolsCURIE": "biotools:alphatims",
    "biotoolsID": "alphatims",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mmann@biochem.mpg.de",
            "name": "Matthias Mann",
            "typeEntity": "Person"
        }
    ],
    "description": "Indexing Trapped Ion Mobility Spectrometry-TOF Data for Fast and Easy Accession and Visualization.\n\nHigh-resolution MS-based proteomics generates large amounts of data, even in the standard LC-tandem MS configuration. Adding an ion mobility dimension vastly increases the acquired data volume, challenging both analytical processing pipelines and especially data exploration by scientists. This has necessitated data aggregation, effectively discarding much of the information present in these rich datasets. Taking trapped ion mobility spectrometry (TIMS) on a quadrupole TOF (Q-TOF) platform as an example, we developed an efficient indexing scheme that represents all data points as detector arrival times on scales of minutes (LC), milliseconds (TIMS), and microseconds (TOF). In our open-source AlphaTims package, data are indexed, accessed, and visualized by a combination of tools of the scientific Python ecosystem",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MannLabs/alphatims",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-10T12:38:40.856817Z",
    "license": "Apache-2.0",
    "name": "AlphaTims",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.MCPRO.2021.100149",
            "metadata": {
                "abstract": "© 2021 THE AUTHORS.High-resolution MS-based proteomics generates large amounts of data, even in the standard LC-tandem MS configuration. Adding an ion mobility dimension vastly increases the acquired data volume, challenging both analytical processing pipelines and especially data exploration by scientists. This has necessitated data aggregation, effectively discarding much of the information present in these rich datasets. Taking trapped ion mobility spectrometry (TIMS) on a quadrupole TOF (Q-TOF) platform as an example, we developed an efficient indexing scheme that represents all data points as detector arrival times on scales of minutes (LC), milliseconds (TIMS), and microseconds (TOF). In our open-source AlphaTims package, data are indexed, accessed, and visualized by a combination of tools of the scientific Python ecosystem. We interpret unprocessed data as a sparse fourdimensional matrix and use just-in-time compilation to machine code with Numba, accelerating our computational procedures by several orders of magnitude while keeping to familiar indexing and slicing notations. For samples with more than six billion detector events, a modern laptop can load and index raw data in about a minute. Loading is even faster when AlphaTims has already saved indexed data in an HDF5 file, a portable scientific standard used in extremely large-scale data acquisition. Subsequently, data accession along any dimension and interactive visualization happens in milliseconds. We have found AlphaTims to be a key enabling tool to explore high-dimensional LC-TIMS-Q-TOF data and have made it freely available as an open-source Python package with a stand-alone graphical user interface at https://github.com/MannLabs/alphatims or as part of the AlphaPept 'ecosystem'.",
                "authors": [
                    {
                        "name": "Willems S."
                    },
                    {
                        "name": "Voytik E."
                    },
                    {
                        "name": "Skowronek P."
                    },
                    {
                        "name": "Strauss M.T."
                    },
                    {
                        "name": "Mann M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "AlphaTims: Indexing trapped ion mobility spectrometry-TOF data for fast and easy accession and visualization"
            },
            "pmcid": "PMC8526765",
            "pmid": "34543758"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}