{"credit":[{"email":"ron.wehrens@gmail.com","name":"Ron Wehrens","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/metaMS.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/metaMS_1.10.0.tar.gz"}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"}]},"publication":[{"abstract":"Untargeted metabolomics are rapidly becoming an important tool for studying complex biological samples. Gas chromatography-mass spectrometry (GC-MS) is the most widely used analytical technology for metabolomic analysis of compounds that are volatile or can be chemically derivatised into volatile compounds. Unfortunately, data processing and analysis are not straightforward and the field is dominated by vendor-supplied software that does not always allow easy integration for large laboratories with different instruments. This paper presents an open-source pipeline for high-throughput GC-MS data processing, written in the R language and available as package metaMS. It features rapid annotation using in-house databases, and also provides support for building and validating such databases. The results are presented in simple-to-use tables, summarising the relative concentrations of identified compounds and unknowns in all samples. The use of the pipeline is illustrated using three experimental data sets. © 2014 Elsevier B.V.","authors":["Wehrens R.","Weingart G.","Mattivi F."],"cit_count":28,"doi":"10.1016/j.jchromb.2014.02.051","journal":"Journal of Chromatography B: Analytical Technologies in the Biomedical and Life Sciences","pmid":"24656939","title":"MetaMS: An open-source pipeline for GC-MS-based untargeted metabolomics","type":"Primary","year":"2014-09-01"}],"summary":{"biotoolsCURIE":"biotools:metams","biotoolsID":"metams","description":"MS-based metabolomics data processing and compound annotation pipeline.","homepage":"http://bioconductor.org/packages/release/bioc/html/metaMS.html","name":"metaMS","version":["1.10.0"]}}