{
    "additionDate": "2020-01-14T09:44:24Z",
    "biotoolsCURIE": "biotools:TCMSP",
    "biotoolsID": "TCMSP",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "samshjx88@sina.com",
            "name": "Jinxiang Han",
            "orcidid": "https://orcid.org/0000-0002-0655-7921",
            "typeEntity": "Person"
        }
    ],
    "description": "A Network Pharmacology Approach for Uncovering the Osteogenic Mechanisms of Psoralea corylifolia Linn.\n\nBackground and Aim:Psoralea corylifolia Linn (PCL) is an herb that is commonly used for alleviating osteoporosis and vitiligo. Although accumulating evidence has demonstrated the antiosteoporotic effect of PCL, the identities of the osteogenic compounds in PCL and their functional targets remain elusive. To investigate the osteogenic ingredients in PCL and their functional mechanisms, network pharmacology analysis was performed on the targets of PCL and osteogenesis. Methods:The active components of PCL were screened by literature review.\n\n||| HOMEPAGE BROKEN!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'SwissTargetPrediction' (bio.tools/swisstargetprediction), 'STITCH' (bio.tools/stitch), 'PCL', 'PCL MC3T3-E1'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://5th.tcmspw.com/tcmsp.php",
    "lastUpdate": "2020-01-14T09:44:24Z",
    "name": "TCMSP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1155/2019/2160175",
            "metadata": {
                "abstract": "© 2019 Luna Ge et al.Background and Aim. Psoralea corylifolia Linn (PCL) is an herb that is commonly used for alleviating osteoporosis and vitiligo. Although accumulating evidence has demonstrated the antiosteoporotic effect of PCL, the identities of the osteogenic compounds in PCL and their functional targets remain elusive. To investigate the osteogenic ingredients in PCL and their functional mechanisms, network pharmacology analysis was performed on the targets of PCL and osteogenesis. Methods. The active components of PCL were screened by literature review. The potential protein targets of the active PCL components were predicted with the Traditional Chinese Medicine Systems Pharmacology Database and Analysis Platform (TCMSP), Search Tool for Interactions of Chemicals (STITCH), SwissTargetPrediction, and PubChem. The target networks related to PCL and osteogenic differentiation were constructed by using Cytoscape. MC3T3-E1 cells were used to verify the targets. Results. Twenty-three active components of PCL and 162 potential target proteins were identified. Further analysis reduced the number of potential target proteins to 71. Of the 23 components, bavachalcone, psoralen, bavachinin, neobavaisoflavone, methoxsalen, psoradin, bakuchiol, and angelicin may be the main active components of PCL that promote bone formation. PPARγ and aryl hydrocarbon receptor (AhR) were verified as targets of PCL in MC3T3-E1 cells, and the western blot and immunofluorescence staining results showed that compared to the control, PCL reduced the expression of these targets. Conclusions. The active components of PCL and the mechanisms by which they promoted osteogenic differentiation were successfully identified using network pharmacology.",
                "authors": [
                    {
                        "name": "Ge L."
                    },
                    {
                        "name": "Cheng K."
                    },
                    {
                        "name": "Han J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Evidence-based Complementary and Alternative Medicine",
                "title": "A Network Pharmacology Approach for Uncovering the Osteogenic Mechanisms of Psoralea corylifolia Linn"
            },
            "pmcid": "PMC6874874",
            "pmid": "31781261"
        }
    ],
    "topic": [
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        }
    ]
}