{
    "accessibility": "Open access",
    "additionDate": "2022-06-09T07:51:39.555185Z",
    "biotoolsCURIE": "biotools:awsnet",
    "biotoolsID": "awsnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nidong@szu.edu.cn",
            "name": "Kai-Ni Wang"
        },
        {
            "name": "Kai-Ni Wang"
        }
    ],
    "description": "An auto-weighted supervision attention network for myocardial scar and edema segmentation in multi-sequence cardiac magnetic resonance images.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/soleilssss/AWSnet/tree/master",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-09T07:51:39.557987Z",
    "name": "AWSnet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2022.102362",
            "metadata": {
                "abstract": "© 2022 Elsevier B.V.Multi-sequence cardiac magnetic resonance (CMR) provides essential pathology information (scar and edema) to diagnose myocardial infarction. However, automatic pathology segmentation can be challenging due to the difficulty of effectively exploring the underlying information from the multi-sequence CMR data. This paper aims to tackle the scar and edema segmentation from multi-sequence CMR with a novel auto-weighted supervision framework, where the interactions among different supervised layers are explored under a task-specific objective using reinforcement learning. Furthermore, we design a coarse-to-fine framework to boost the small myocardial pathology region segmentation with shape prior knowledge. The coarse segmentation model identifies the left ventricle myocardial structure as a shape prior, while the fine segmentation model integrates a pixel-wise attention strategy with an auto-weighted supervision model to learn and extract salient pathological structures from the multi-sequence CMR data. Extensive experimental results on a publicly available dataset from Myocardial pathology segmentation combining multi-sequence CMR (MyoPS 2020) demonstrate our method can achieve promising performance compared with other state-of-the-art methods. Our method is promising in advancing the myocardial pathology assessment on multi-sequence CMR data. To motivate the community, we have made our code publicly available via https://github.com/soleilssss/AWSnet/tree/master.",
                "authors": [
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Miao J."
                    },
                    {
                        "name": "Ni D."
                    },
                    {
                        "name": "Wang K.-N."
                    },
                    {
                        "name": "Xue W."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Yao J."
                    },
                    {
                        "name": "Zhou G.-Q."
                    },
                    {
                        "name": "Zhou P."
                    },
                    {
                        "name": "Zhuang X."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "AWSnet: An auto-weighted supervision attention network for myocardial scar and edema segmentation in multi-sequence cardiac magnetic resonance images"
            },
            "pmid": "35091277"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
