
{
    "credit": [
        {
            "email": "Admin@igmm.ed.ac.uk",
            "name": "IGMM Admin Hub",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.ed.ac.uk/centre-genomic-medicine/about"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Regions of interest identified through genetic linkage studies regularly exceed 30 centimorgans in size and can contain hundreds of genes. Traditionally this number is reduced by matching functional annotation to knowledge of the disease or phenotype in question. However, here we show that disease genes share patterns of sequence-based features that can provide a good basis for automatic prioritization of candidates by machine learning. Results: We examined a variety of sequence-based features and found that for many of them there are significant differences between the sets of genes known to be involved in human hereditary disease and those not known to be involved in disease. We have created an automatic classifier called PROSPECTR based on those features using the alternating decision tree algorithm which ranks genes in the order of likelihood of involvement in disease. On average, PROSPECTR enriches lists for disease genes two-fold 77% of the time, five-fold 37% of the time and twenty-fold 11% of the time. Conclusion: PROSPECTR is a simple and effective way to identify genes involved in Mendelian and oligogenic disorders. It performs markedly better than the single existing sequence-based classifier on novel data. PROSPECTR could save investigators looking at large regions of interest time and effort by prioritizing positional candidate genes for mutation detection and case-control association studies. © 2005 Adie et al; licensee BioMed Central Ltd.",
            "authors": [
                "Adie E.A.",
                "Adams R.R.",
                "Evans K.L.",
                "Porteous D.J.",
                "Pickard B.S."
            ],
            "cit_count": 190,
            "journal": "BMC Bioinformatics",
            "pmid": "15766383",
            "title": "Speeding disease gene discovery by sequence based candidate prioritization",
            "year": "2005-03-14"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:prospectr",
        "biotoolsID": "prospectr",
        "description": "This tool can be used to enrich lists of genes found at a suspected disease locus. Given a list of genes, it will return a ranked list ordered by the likelihood of involvement in disease.",
        "homepage": "http://www.genetics.med.ed.ac.uk/prospectr/",
        "name": "Prospectr"
    }
}