
{
    "credit": [
        {
            "email": "mpertea@jhu.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://ccb.jhu.edu/software/stringtie/index.shtml?t=manual"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "C++",
            "C"
        ],
        "license": "Artistic-2.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/gpertea/stringtie"
        },
        {
            "type": "Issue tracker",
            "url": "https://github.com/gpertea/stringtie/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Nature America, Inc. All rights reserved. Methods used to sequence the transcriptome often produce more than 200 million short sequences. We introduce StringTie, a computational method that applies a network flow algorithm originally developed in optimization theory, together with optional de novo assembly, to assemble these complex data sets into transcripts. When used to analyze both simulated and real data sets, StringTie produces more complete and accurate reconstructions of genes and better estimates of expression levels, compared with other leading transcript assembly programs including Cufflinks, IsoLasso, Scripture and Traph. For example, on 90 million reads from human blood, StringTie correctly assembled 10,990 transcripts, whereas the next best assembly was of 7,187 transcripts by Cufflinks, which is a 53% increase in transcripts assembled. On a simulated data set, StringTie correctly assembled 7,559 transcripts, which is 20% more than the 6,310 assembled by Cufflinks. As well as producing a more complete transcriptome assembly, StringTie runs faster on all data sets tested to date compared with other assembly software, including Cufflinks.",
            "authors": [
                "Pertea M.",
                "Pertea G.M.",
                "Antonescu C.M.",
                "Chang T.-C.",
                "Mendell J.T.",
                "Salzberg S.L."
            ],
            "cit_count": 456,
            "doi": "10.1038/nbt.3122",
            "journal": "Nature Biotechnology",
            "title": "StringTie enables improved reconstruction of a transcriptome from RNA-seq reads",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:stringtie",
        "biotoolsID": "stringtie",
        "description": "Fast and highly efficient assembler of RNA-Seq alignments into potential transcripts. It uses a novel network flow algorithm as well as an optional de novo assembly step to assemble and quantitate full-length transcripts representing multiple splice variants for each gene locus.",
        "homepage": "https://ccb.jhu.edu/software/stringtie/",
        "name": "StringTie"
    }
}