{
    "additionDate": "2018-07-28T13:47:50Z",
    "biotoolsCURIE": "biotools:joinerml",
    "biotoolsID": "joinerml",
    "credit": [
        {
            "email": "pete.philipson@northumbria.ac.uk",
            "name": "Pete Philipson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Joint Modelling of Multivariate Longitudinal Data and Time-to-Event Outcomes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/joineRML/joineRML.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/joineRML/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "joineRML",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12874-018-0502-1",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Joint modelling of longitudinal and time-to-event outcomes has received considerable attention over recent years. Commensurate with this has been a rise in statistical software options for fitting these models. However, these tools have generally been limited to a single longitudinal outcome. Here, we describe the classical joint model to the case of multiple longitudinal outcomes, propose a practical algorithm for fitting the models, and demonstrate how to fit the models using a new package for the statistical software platform R, joineRML. Results: A multivariate linear mixed sub-model is specified for the longitudinal outcomes, and a Cox proportional hazards regression model with time-varying covariates is specified for the event time sub-model. The association between models is captured through a zero-mean multivariate latent Gaussian process. The models are fitted using a Monte Carlo Expectation-Maximisation algorithm, and inferences are based on approximate standard errors from the empirical profile information matrix, which are contrasted to an alternative bootstrap estimation approach. We illustrate the model and software on a real data example for patients with primary biliary cirrhosis with three repeatedly measured biomarkers. Conclusions: An open-source software package capable of fitting multivariate joint models is available. The underlying algorithm and source code makes use of several methods to increase computational speed.",
                "authors": [
                    {
                        "name": "Hickey G.L."
                    },
                    {
                        "name": "Philipson P."
                    },
                    {
                        "name": "Jorgensen A."
                    },
                    {
                        "name": "Kolamunnage-Dona R."
                    }
                ],
                "citationCount": 13,
                "date": "2018-06-07T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "JoineRML: A joint model and software package for time-to-event and multivariate longitudinal outcomes"
            },
            "pmcid": "PMC6047371",
            "pmid": "9879902"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}