{"credit":[{"email":"krejciadam@gmail.com","name":"Adam Krejci","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.recamo.cz/en/"}],"documentation":[{"url":"http://www.recamo.cz/userfiles/file/Software/Hammock/Hammock-manual.pdf"}],"function":[{"operation":[{"term":"Sequence clustering","uri":"http://edamontology.org/operation_0291"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/hammock-hidden-markov-model-based-peptide-clustering-algorithm.html"}],"publication":[{"abstract":"© 2015 The Author 2015. Published by Oxford University Press. Motivation: Proteins often recognize their interaction partners on the basis of short linear motifs located in disordered regions on proteins' surface. Experimental techniques that study such motifs use short peptides to mimic the structural properties of interacting proteins. Continued development of these methods allows for large-scale screening, resulting in vast amounts of peptide sequences, potentially containing information on multiple protein-protein interactions. Processing of such datasets is a complex but essential task for large-scale studies investigating protein-protein interactions. Results: The software tool presented in this article is able to rapidly identify multiple clusters of sequences carrying shared specificity motifs in massive datasets from various sources and generate multiple sequence alignments of identified clusters. The method was applied on a previously published smaller dataset containing distinct classes of ligands for SH3 domains, as well as on a new, an order of magnitude larger dataset containing epitopes for several monoclonal antibodies. The software successfully identified clusters of sequences mimicking epitopes of antibody targets, as well as secondary clusters revealing that the antibodies accept some deviations from original epitope sequences. Another test indicates that processing of even much larger datasets is computationally feasible. Availability and implementation: Hammock is published under GNU GPL v. 3 license and is freely available as a standalone program (from http://www.recamo.cz/en/software/hammock-cluster-peptides/) or as a tool for the Galaxy toolbox (from https://toolshed.g2.bx.psu.edu/view/hammock/hammock). The source code can be downloaded from https://github.com/hammock-dev/hammock/releases.","authors":["Krejci A.","Hupp T.R.","Lexa M.","Vojtesek B.","Muller P."],"cit_count":3,"journal":"Bioinformatics","pmid":"26342231","title":"Hammock: A hidden Markov model-based peptide clustering algorithm to identify protein-interaction consensus motifs in large datasets","year":"2015-07-01"}],"summary":{"biotoolsCURIE":"biotools:hammock","biotoolsID":"hammock","description":"Tool for peptide sequence clustering. It is able to cluster extremely large amounts of short peptide sequences into groups sharing sequence motifs.","homepage":"http://www.recamo.cz/en/software/hammock-cluster-peptides/","name":"Hammock"}}