{
    "additionDate": "2021-01-18T11:13:33Z",
    "biotoolsCURIE": "biotools:masi",
    "biotoolsID": "masi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dianwenju@fudan.edu.cn",
            "name": "Dianwen Ju",
            "typeEntity": "Person"
        },
        {
            "email": "iaochen@163.com",
            "name": "Weiping Chen",
            "typeEntity": "Person"
        },
        {
            "email": "phacyz@nus.edu.sg",
            "name": "Yu Zong Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Microbiota-active substance interactions database.\nActive Substance Interaction database.\nTry Examples: Bifidobacterium adolescentis, Enterococcus faecalis, Acarbose, Caffeic acid, Oxaprozin, Obesity, Colorectal cancer.\n\nA centralized and standardized database to catalog Microbiota-Active Substance Interaction (MASI) will be very useful for related research fields, including microbiota-related precision medicine, pharmaceutical research, food and nutrition research, clinical pharmacy, health management studies.\n\nAccumulating evidence about the interaction between human microbiota and active substances, especially for those therapeutically-relevant substances such as clinical used drugs and traditional medicines/herbs, is deepenning our understanding in the role of \"our second genome\" in human health and diseases, and opens new avenue for managing/treating human healthy problems/diseases by manipulating microbiota-human interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "http://www.aiddlab.com/MASI",
    "lastUpdate": "2024-11-24T20:42:33.980918Z",
    "name": "MASI",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa924",
            "metadata": {
                "abstract": "Xenobiotic and host active substances interact with gut microbiota to influence human health and therapeutics. Dietary, pharmaceutical, herbal and environmental substances are modified by microbiota with altered bioavailabilities, bioactivities and toxic effects. Xenobiotics also affect microbiota with health implications. Knowledge of these microbiota and active substance interactions is important for understanding microbiota-regulated functions and therapeutics. Established microbiota databases provide useful information about the microbiota-disease associations, diet and drug interventions, and microbiota modulation of drugs. However, there is insufficient information on the active substances modified by microbiota and the abundance of gut bacteria in humans. Only ∼7% drugs are covered by the established databases. To complement these databases, we developed MASI, Microbiota-Active Substance Interactions database, for providing the information about the microbiota alteration of various substances, substance alteration of microbiota, and the abundance of gut bacteria in humans. These include 1,051 pharmaceutical, 103 dietary, 119 herbal, 46 probiotic, 142 environmental substances interacting with 806 microbiota species linked to 56 diseases and 784 microbiota-disease associations. MASI covers 11 215 bacteria-pharmaceutical, 914 bacteria-herbal, 309 bacteria-dietary, 753 bacteria-environmental substance interactions and the abundance profiles of 259 bacteria species in 3465 patients and 5334 healthy individuals. MASI is freely accessible at http://www.aiddlab.com/MASI.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Chen Y.Z."
                    },
                    {
                        "name": "Fan J."
                    },
                    {
                        "name": "Ju D."
                    },
                    {
                        "name": "Ju L."
                    },
                    {
                        "name": "Shen W."
                    },
                    {
                        "name": "Tan Y."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zeng X."
                    }
                ],
                "citationCount": 33,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MASI: Microbiota-active substance interactions database"
            },
            "pmcid": "PMC7779062",
            "pmid": "33125077"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
