{"credit":[{"email":"gwu827@gmail.com","name":"Dr. Wu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://mflux.org/"},{"email":"forrest.bao@gmail.com","name":"Dr. Bao","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"yinjie.tang@seas.wustl.edu","name":"Dr. Tang","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://mflux.org/"}],"function":[{"operation":[{"term":"Metabolic network modelling","uri":"http://edamontology.org/operation_3660"},{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mflux-rapid-prediction-of-bacterial-heterotrophic-fluxomics.html"}],"publication":[{"abstract":"© 2016 Wu et al. 13 C metabolic flux analysis ( 13 C-MFA) has been widely used to measure in vivo enzyme reaction rates (i.e., metabolic flux) in microorganisms. Mining the relationship between environmental and genetic factors and metabolic fluxes hidden in existing fluxomic data will lead to predictive models that can significantly accelerate flux quantification. In this paper, we present a web-based platform MFlux (http://mflux.org) that predicts the bacterial central metabolism via machine learning, leveraging data from approximately 100 13 C-MFA papers on heterotrophic bacterial metabolisms. Three machine learning methods, namely Support Vector Machine (SVM), k-Nearest Neighbors (k-NN), and Decision Tree, were employed to study the sophisticated relationship between influential factors and metabolic fluxes. We performed a grid search of the best parameter set for each algorithm and verified their performance through 10-fold cross validations. SVM yields the highest accuracy among all three algorithms. Further, we employed quadratic programming to adjust flux profiles to satisfy stoichiometric constraints. Multiple case studies have shown that MFlux can reasonably predict fluxomes as a function of bacterial species, substrate types, growth rate, oxygen conditions, and cultivation methods. Due to the interest of studying model organism under particular carbon sources, bias of fluxome in the dataset may limit the applicability of machine learning models. This problem can be resolved after more papers on 13 C-MFA are published for non-model species.","authors":["Wu S.G.","Wang Y.","Jiang W.","Oyetunde T.","Yao R.","Zhang X.","Shimizu K.","Tang Y.J.","Bao F.S."],"cit_count":10,"journal":"PLoS Computational Biology","pmid":"27092947","title":"Rapid Prediction of Bacterial Heterotrophic Fluxomics Using Machine Learning and Constraint Programming","year":"2016-04-01"}],"summary":{"biotoolsCURIE":"biotools:mflux","biotoolsID":"mflux","description":"Web-based platform that predicts the bacterial central metabolism via machine learning, leveraging data from approximately 100 13C-MFA papers on heterotrophic bacterial metabolisms.","homepage":"http://mflux.org/","name":"MFlux"}}