{
    "additionDate": "2015-01-21T15:12:26Z",
    "biotoolsCURIE": "biotools:dgd",
    "biotoolsID": "dgd",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "support@genouest.org",
            "name": "GenOuest platform",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "GenOuest",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Provides a list of groups of co-located and duplicated genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dgd.genouest.org/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence coordinates",
                        "uri": "http://edamontology.org/data_2012"
                    }
                }
            ],
            "note": "Provides a list of groups of co-located and duplicated genes.",
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Annotation track",
                        "uri": "http://edamontology.org/data_3002"
                    }
                }
            ]
        }
    ],
    "homepage": "http://dgd.genouest.org/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "maturity": "Mature",
    "name": "DGD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "GenOuest",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0050653",
            "metadata": {
                "abstract": "Background: There has been a surge in studies linking genome structure and gene expression, with special focus on duplicated genes. Although initially duplicated from the same sequence, duplicated genes can diverge strongly over evolution and take on different functions or regulated expression. However, information on the function and expression of duplicated genes remains sparse. Identifying groups of duplicated genes in different genomes and characterizing their expression and function would therefore be of great interest to the research community. The 'Duplicated Genes Database' (DGD) was developed for this purpose. Methodology: Nine species were included in the DGD. For each species, BLAST analyses were conducted on peptide sequences corresponding to the genes mapped on a same chromosome. Groups of duplicated genes were defined based on these pairwise BLAST comparisons and the genomic location of the genes. For each group, Pearson correlations between gene expression data and semantic similarities between functional GO annotations were also computed when the relevant information was available. Conclusions: The Duplicated Gene Database provides a list of co-localised and duplicated genes for several species with the available gene co-expression level and semantic similarity value of functional annotation. Adding these data to the groups of duplicated genes provides biological information that can prove useful to gene expression analyses. The Duplicated Gene Database can be freely accessed through the DGD website at http://dgd.genouest.org. © 2012 Ouedraogo et al.",
                "authors": [
                    {
                        "name": "Bettembourg C."
                    },
                    {
                        "name": "Bretaudeau A."
                    },
                    {
                        "name": "Demeure O."
                    },
                    {
                        "name": "Diot C."
                    },
                    {
                        "name": "Lecerf F."
                    },
                    {
                        "name": "Ouedraogo M."
                    },
                    {
                        "name": "Sallou O."
                    }
                ],
                "citationCount": 38,
                "date": "2012-11-28T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "The Duplicated Genes Database: Identification and Functional Annotation of Co-Localised Duplicated Genes across Genomes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
