{
    "additionDate": "2021-01-18T10:38:18Z",
    "biotoolsCURIE": "biotools:mrpixel",
    "biotoolsID": "mrpixel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "s.parsons@ed.ac.uk",
            "name": "Simon Parsons",
            "orcidid": "https://orcid.org/0000-0002-7708-5597",
            "typeEntity": "Person"
        },
        {
            "email": "wood@ccdc.cam.ac.uk",
            "name": "Peter A. Wood",
            "orcidid": "https://orcid.org/0000-0002-5239-2160",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated execution of Pixel calculations via the Mercury interface.\n\nMrPIXEL is a program that enables the energetics of crystal packing to be analysed quickly and easy through a user interface, using PIXEL, Python scripts and the widely known visualiser, Mercury.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "homepage": "http://www.crystal.chem.ed.ac.uk/software/mrpixel",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:41:19Z",
    "name": "MrPIXEL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1107/S1600576720008444",
            "metadata": {
                "abstract": "© 2020.The interpretation of crystal structures in terms of intermolecular interaction energies enables phase stability and polymorphism to be rationalized in terms of quantitative thermodynamic models, while also providing insight into the origin of physical and chemical properties including solubility, compressibility and host-guest formation. The Pixel method is a semi-empirical procedure for the calculation of intermolecular interactions and lattice energies based only on crystal structure information. Molecules are represented as blocks of undistorted ab initio molecular electron and nuclear densities subdivided into small volume elements called pixels. Electrostatic, polarization, dispersion and Pauli repulsion terms are calculated between pairs of pixels and nuclei in different molecules, with the accumulated sum equating to the intermolecular interaction energy, which is broken down into physically meaningful component terms. The MrPIXEL procedure enables Pixel calculations to be carried out with minimal user intervention from the graphical interface of Mercury, which is part of the software distributed with the Cambridge Structural Database (CSD). Following initial setup of a crystallographic model, one module assigns atom types and writes necessary input files. A second module then submits the required electron-density calculation either locally or to a remote server, downloads the results, and submits the Pixel calculation itself. Full lattice energy calculations can be performed for structures with up to two molecules in the crystallographic asymmetric unit. For more complex cases, only molecule-molecule energies are calculated. The program makes use of the CSD Python API, which is also distributed with the CSD.",
                "authors": [
                    {
                        "name": "Parsons S."
                    },
                    {
                        "name": "Reeves M.G."
                    },
                    {
                        "name": "Wood P.A."
                    }
                ],
                "citationCount": 6,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "MrPIXEL: Automated execution of Pixel calculations via the Mercury interface"
            },
            "pmcid": "PMC7401789",
            "pmid": "32788907"
        }
    ],
    "toolType": [
        "Desktop application",
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Neutron diffraction",
            "uri": "http://edamontology.org/topic_3448"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
