{
    "additionDate": "2019-11-14T19:44:08Z",
    "biotoolsCURIE": "biotools:csDMA",
    "biotoolsID": "csDMA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dongw@nwafu.edu.cn",
            "name": "Wei Dong",
            "typeEntity": "Person"
        }
    ],
    "description": "Aan improved bioinformatics tool for identifying DNA 6 mA modifications via Chou's 5-step rule | An improved machine-learning based prediction tool for identifying DNA 6mA modifications | csDMA was implemented in python 2.7",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/liuze-nwafu/csDMA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T09:55:54Z",
    "name": "csDMA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-49430-4",
            "metadata": {
                "abstract": "© 2019, The Author(s).DNA N6-methyldeoxyadenosine (6 mA) modifications were first found more than 60 years ago but were thought to be only widespread in prokaryotes and unicellular eukaryotes. With the development of high-throughput sequencing technology, 6 mA modifications were found in different multicellular eukaryotes by using experimental methods. However, the experimental methods were time-consuming and costly, which makes it is very necessary to develop computational methods instead. In this study, a machine learning-based prediction tool, named csDMA, was developed for predicting 6 mA modifications. Firstly, three feature encoding schemes, Motif, Kmer, and Binary, were used to generate the feature matrix. Secondly, different algorithms were selected into the prediction model and the ExtraTrees model received the best AUC of 0.878 by using 5-fold cross-validation on the training dataset. Besides, the ExtraTrees model also received the best AUC of 0.893 on the independent testing dataset. Finally, we compared our method with state-of-the-art predictors and the results shown that our model achieved better performance than existing tools.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Dong W."
                    },
                    {
                        "name": "Jiang W."
                    },
                    {
                        "name": "He Z."
                    }
                ],
                "citationCount": 14,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "csDMA: an improved bioinformatics tool for identifying DNA 6 mA modifications via Chou’s 5-step rule"
            },
            "pmcid": "PMC6739324",
            "pmid": "31511570"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}