{"credit":[],"labels":{"language":["MATLAB"],"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Drug development","uri":"http://edamontology.org/topic_3373"}]},"publication":[{"abstract":"© 2019 Elsevier B.V.Discovering and accurately locating drug targets is of great significance for the research and development of new drugs. As a different approach to traditional drug development, the machine learning algorithm is used to predict the drug target by mining the data. Because of its advantages of short time and low cost, it has received more and more attention in recent years. In this paper, we propose a novel method for predicting druggable proteins. Firstly, the features of the protein sequence are extracted by combining Chou's pseudo amino acid composition (PseAAC), dipeptide composition (DPC) and reduced sequence (RS), getting the 591 dimension of drug target dataset. Then, the feature information of druggable proteins dataset is selected by genetic algorithm (GA). Finally, we use Bagging ensemble learning to improve SVM classifier to get the final prediction model. The predictive accuracy rate reaches 93.78% by using 5-fold cross-validation and compared with other state-of-the-art predictive methods. The results indicate that the method proposed in this paper has a high reference value for the prediction of potential drug targets, which will successfully play a key role in the drug research and development. The source code and all datasets are available at https://github.com/QUST-AIBBDRC/GA-Bagging-SVM.","authors":["Lin J.","Chen H.","Li S.","Liu Y.","Li X.","Yu B."],"cit_count":1,"doi":"10.1016/J.ARTMED.2019.07.005","journal":"Artificial Intelligence in Medicine","pmid":"31521251","title":"Accurate prediction of potential druggable proteins based on genetic algorithm and Bagging-SVM ensemble classifier","year":"2019-07-01"}],"summary":{"biotoolsCURIE":"biotools:Bagging-SVM","biotoolsID":"Bagging-SVM","description":"> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'genetic algorithm Bagging-SVM', 'druggable', '93.78' | Accurate prediction of potential druggable proteins based on genetic algorithm and Bagging-SVM ensemble classifier | Discovering and accurately locating drug targets is of great significance for the research and development of new drugs. As a different approach to traditional drug development, the machine learning algorithm is used to predict the drug target by mining the data. Because of its advantages of short time and low cost, it has received more and more attention in recent years. In this paper, we propose a novel method for predicting druggable proteins. Firstly, the features of the protein sequence are extracted by combining Chou's pseudo amino acid composition (PseAAC), dipeptide composition (DPC) and reduced sequence (RS), getting the 591 dimension of drug target dataset","homepage":"https://github.com/QUST-AIBBDRC/GA-Bagging-SVM","name":"Bagging-SVM"}}