
{
    "credit": [
        {
            "email": "lwaldron.research@gmail.com",
            "name": "Levi Waldron",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/doppelgangR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/doppelgangR_1.2.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "https://github.com/lwaldron/doppelgangR"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2016. Published by Oxford University Press. All rights reserved.Whole-genome analysis of cancer specimens is commonplace, and investigators frequently share or re-use specimens in later studies. Duplicate expression profiles in public databases will impact re-analysis if left undetected, a so-called \"doppelg anger\" effect.We propose a method that should be routine practice to accurately match duplicate cancer transcriptomes when nucleotide-level sequence data are unavailable, even for samples profiled by different microarray technologies or by both microarray and RNA sequencing. We demonstrate the effectiveness of the method in databases containing dozens of datasets and thousands of ovarian, breast, bladder, and colorectal cancer microarray profiles and of matching microarray and RNA sequencing expression profiles from The Cancer Genome Atlas (TCGA). We identified probable duplicates among more than 50% of studies, originating in different continents, using different technologies, published years apart, and even within the TCGA itself. Finally, we provide the doppelgangR Bioconductor package for screening transcriptome databases for duplicates. Given the potential for unrecognized duplication to falsely inflate prediction accuracy and confidence in differential expression, doppelganger-checking should be a part of standard procedure for combining multiple genomic datasets.",
            "authors": [
                "Waldron L.",
                "Riester M.",
                "Ramos M.",
                "Parmigiani G.",
                "Birrer M."
            ],
            "cit_count": 4,
            "doi": "10.1093/jnci/djw146",
            "journal": "Journal of the National Cancer Institute",
            "title": "The doppelganger effect: Hidden duplicates in databases of transcriptome profiles",
            "type": "Primary",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:doppelgangr",
        "biotoolsID": "doppelgangr",
        "description": "Its main function takes as minimal input a list of ExpressionSet object, and searches all list pairs for duplicated samples. The search is based on the genomic data, phenotype/clinical data, and \"smoking guns\" - supposedly unique identifiers found in pData(eset).",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/doppelgangR.html",
        "name": "doppelgangR",
        "version": [
            "1.2.0"
        ]
    }
}