{"collectionID": [], "accessibility": [], "topic": [{"term": "Imaging", "uri": "http://edamontology.org/topic_3382"}], "owner": "migle_sur", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1371/journal.pone.0193267", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Fast and simple tool for the quantification of biofilm-embedded cells sub-populations from fluorescent microscopic images", "abstract": "© 2018 Bogachev et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Fluorescent staining is a common tool for both quantitative and qualitative assessment of pro- and eukaryotic cells sub-population fractions by using microscopy and flow cytometry. However, direct cell counting by flow cytometry is often limited, for example when working with cells rigidly adhered either to each other or to external surfaces like bacterial biofilms or adherent cell lines and tissue samples. An alternative approach is provided by using fluorescent microscopy and confocal laser scanning microscopy (CLSM), which enables the evaluation of fractions of cells subpopulations in a given sample. For the quantitative assessment of cell fractions in microphotographs, we suggest a simple two-step algorithm that combines single cells selection and the statistical analysis. To facilitate the first step, we suggest a simple procedure that supports finding the balance between the detection threshold and the typical size of single cells based on objective cell size distribution analysis. Based on a series of experimental measurements performed on bacterial and eukaryotic cells under various conditions, we show explicitly that the suggested approach effectively accounts for the fractions of different cell sub-populations (like the live/dead staining in our samples) in all studied cases that are in good agreement with manual cell counting on microphotographs and flow cytometry data. This algorithm is implemented as a simple software tool that includes an intuitive and user-friendly graphical interface for the initial adjustment of algorithm parameters to the microphotographs analysis as well as for the sequential analysis of homogeneous series of similar microscopic images without further user intervention. The software tool entitled BioFilmAnalyzer is freely available online at https://bitbucket.org/rogex/biofilmanalyzer/downloads/.", "citationCount": 1, "authors": [{"name": "Bogachev M.I."}, {"name": "Volkov V.Y."}, {"name": "Markelov O.A."}, {"name": "Trizna E.Y."}, {"name": "Baydamshina D.R."}, {"name": "Melnikov V."}, {"name": "Murtazina R.R."}, {"name": "Zelenikhin P.V."}, {"name": "Sharafutdinov I.S."}, {"name": "Kayumov A.R."}], "date": "2018-05-01T00:00:00Z", "journal": "PLoS ONE"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Airat R. Kayumov", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "kairatr@yandex.ru"}], "biotoolsCURIE": "biotools:biofilmanalyzer", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://bitbucket.org/rogex/biofilmanalyzer", "function": [{"note": null, "input": [], "operation": [{"term": "Image analysis", "uri": "http://edamontology.org/operation_3443"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:59Z", "otherID": [], "description": "Tool for the quantification of biofilm-embedded cells sub-populations from fluorescent microscopic images.", "toolType": ["Desktop application"], "editPermission": {"type": "private", "authors": []}, "language": ["C"], "link": [], "biotoolsID": "biofilmanalyzer", "additionDate": "2018-06-12T17:03:42Z", "name": "BioFilmAnalyzer", "license": null, "documentation": [{"url": "https://bitbucket.org/rogex/biofilmanalyzer/downloads/BioFilmAnalyzer_User_Manual.pdf", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Windows"]}