{
    "additionDate": "2017-08-03T18:48:56Z",
    "biotoolsCURIE": "biotools:masttreedist",
    "biotoolsID": "masttreedist",
    "credit": [
        {
            "email": "dragonlyj@gmail.com",
            "name": "Yongji Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "honghuang@usf.edu",
            "name": "Hong Huang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software for phylogenetic tree-to-tree distance comparison by calculating these trees’ “Maximum Agreemen SubTrees” in order to improve the visualization of tree “landscape”",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.rc.usf.edu/MASTtree/MAST/User_manual_MAST_070412.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                }
            ]
        }
    ],
    "homepage": "http://www.rc.usf.edu/MASTtree/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/masttreedist-1-0-visualization-tree-space-based-maximum-agreement-subtree.html"
        }
    ],
    "name": "MASTtreedist",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Phylogenetic tree construction process might produce many candidate trees as the \"best estimates.\" As the number of constructed phylogenetic trees grows, the need to efficiently compare their topological or physical structures arises. One of the tree comparison's software tools, the Mesquite's Tree Set Viz module, allows the rapid and efficient visualization of the tree comparison distances using multidimensional scaling (MDS). Tree-distance measures, such as Robinson-Foulds (RF), for the topological distance among different trees have been implemented in Tree Set Viz. New and sophisticated measures such as Maximum Agreement Subtree (MAST) can be continuously built upon Tree Set Viz. MAST can detect the common substructures among trees and provide more precise information on the similarity of the trees, but it is NP-hard and difficult to implement. In this article, we present a practical tree-distance metric: MASTtreedist, a MAST-based comparison metric in Mesquite's Tree Set Viz module. In this metric, the efficient optimizations for the maximum weight clique problem are applied. The results suggest that the proposed method can efficiently compute the MAST distances among trees, and such tree topological differences can be translated as a scatter of points in two-dimensional (2D) space. We also provide statistical evaluation of provided measures with respect to RF-using experimental data sets. This new comparison module provides a new tree-tree pairwise comparison metric based on the differences of the number of MAST leaves among constructed phylogenetic trees. Such a new phylogenetic tree comparison metric improves the visualization of taxa differences by discriminating small divergences of subtree structures for phylogenetic tree reconstruction. © 2013 Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Li Y."
                    }
                ],
                "citationCount": 2,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "MASTtreedist: Visualization of tree space based on maximum agreement subtree"
            },
            "pmid": "23294272"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}
