{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:47:37Z",
    "biotoolsCURIE": "biotools:metaheuristic-reactive-model",
    "biotoolsID": "metaheuristic-reactive-model",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Erik",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/2841735-erik"
        }
    ],
    "description": "A metaheuristic method based on the reactive model of neighborhood consensus for continuous optimization.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/1466c017-6ad6-423b-88dc-cf34d3030e51/02efaa92-37f2-4869-a0a0-d1da8504adba/images/screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/70482-a-metaheuristic-method-based-on-the-reactive-model",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-07T14:04:49Z",
    "name": "Metaheuristic reactive model-based on neighborhood consensus for continuous optimization",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.eswa.2018.12.018",
            "metadata": {
                "abstract": "© 2018Evolutionary Computation (EC) algorithms have been proposed as stochastic methods to solve complex optimization problems. The design of EC methods typically involves the construction of empirical operators based on abstractions of animal behaviors or physical and biological phenomena. Through its operators, every EC approach proposes a particular solution to the exploration-exploitation balance which is currently considered an unsolved problem within EC literature. On the other hand, multi-agent systems have been utilized as intelligent, cooperative and self-organized structures where the synergy of simple rules creates complex interactions among agents. In this paper, a novel EC algorithm called Neighborhood-based Consensus for Continuous Optimization (NCCO) is presented. NCCO is based on typical processes present in multi-agent systems, such as local consensus formulations and reactive responses. These operations are conducted by using appropriate operators that are applied in each evolutionary stage. A traditional EC algorithm considers in its operation the application of every operator without examining its final impact in the searching process. In contrast to other EC techniques, the proposed method uses additional operators to avoid the undesirable effects produced by the over-exploitation or suboptimal exploration of conventional operations. In order to illustrate the performance and accuracy of the proposed NCCO approach, it is compared to several well-known, state-of-the-art algorithms over a set of benchmark functions and real-world design applications. The experimental results demonstrate that NCCO's performance is superior to the test algorithms.",
                "authors": [
                    {
                        "name": "Avalos O."
                    },
                    {
                        "name": "Cuevas E."
                    },
                    {
                        "name": "Galvez J."
                    },
                    {
                        "name": "Hinojosa S."
                    },
                    {
                        "name": "Perez-Cisneros M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-05-01T00:00:00Z",
                "journal": "Expert Systems with Applications",
                "title": "A reactive model based on neighborhood consensus for continuous optimization"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "version": [
        "1.0.0"
    ]
}
