{
    "accessibility": "Open access",
    "additionDate": "2021-05-28T07:25:14Z",
    "biotoolsCURIE": "biotools:proteaseguru",
    "biotoolsID": "proteaseguru",
    "cost": "Free of charge",
    "description": "A Tool for Protease Selection in Bottom-Up Proteomics",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                }
            ]
        }
    ],
    "homepage": "https://github.com/smith-chem-wisc/ProteaseGuru",
    "lastUpdate": "2021-05-28T07:25:14Z",
    "name": "ProteaseGuru",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00954",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Bottom-up proteomics is currently the dominant strategy for proteome analysis. It relies critically upon the use of a protease to digest proteins into peptides, which are then identified by liquid chromatography-mass spectrometry (LC-MS). The choice of protease(s) has a substantial impact upon the utility of the bottom-up results obtained. Protease selection determines the nature of the peptides produced, which in turn affects the ability to infer the presence and quantities of the parent proteins and post-translational modifications in the sample. We present here the software tool ProteaseGuru, which provides in silico digestions by candidate proteases, allowing evaluation of their utility for bottom-up proteomic experiments. This information is useful for both studies focused on a single or small number of proteins, and for analysis of entire complex proteomes. ProteaseGuru provides a convenient user interface, valuable peptide information, and data visualizations enabling the comparison of digestion results of different proteases. The information provided includes data tables of theoretical peptide sequences and their biophysical properties, results summaries outlining the numbers of shared and unique peptides per protease, histograms facilitating the comparison of proteome-wide proteolytic data, protein-specific summaries, and sequence coverage maps. Examples are provided of its use to inform analysis of variant-containing proteins in the human proteome, as well as for studies requiring the use of multiple proteomic databases such as a human:mouse xenograft model, and microbiome metaproteomics.",
                "authors": [
                    {
                        "name": "Ibrahim K."
                    },
                    {
                        "name": "Miller R.M."
                    },
                    {
                        "name": "Smith L.M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "ProteaseGuru: A Tool for Protease Selection in Bottom-Up Proteomics"
            },
            "pmid": "33661641"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
