
{
    "credit": [
        {
            "email": "wenchilab@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://plantpan2.itps.ncku.edu.tw/index.html#guide"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/plantpan-1-0-identifying-combinatorial-cis-regulatory-elements-distance-constraint-plant-gene-groups.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2015.Transcription factors (TFs) are sequence-specific DNA-binding proteins acting as critical regulators of gene expression. The Plant Promoter Analysis Navigator (PlantPAN; http://PlantPAN2.itps. ncku.edu.tw) provides an informative resource for detecting transcription factor binding sites (TFBSs), corresponding TFs, and other important regulatory elements (CpG islands and tandem repeats) in a promoter or a set of plant promoters. Additionally, TFBSs, CpG islands, and tandem repeats in the conserve regions between similar gene promoters are also identified. The current PlantPANrelease (version 2.0) contains 16 960 TFs and 1143 TF binding site matrices among 76 plant species. In addition to updating of the annotation information, adding experimentally verified TF matrices, and making improvements in the visualization of transcriptional regulatory networks, several new features and functions are incorporated. These features include: (i) comprehensive curation of TF information (response conditions, target genes, and sequence logos of binding motifs, etc.), (ii) co-expression profiles of TFs and their target genes under various conditions, (iii) protein-protein interactions among TFs and their co-factors, (iv) TFtarget networks, and (v) downstream promoter elements. Furthermore, a dynamic transcriptional regulatory network under various conditions is provided in PlantPAN 2.0. The PlantPAN 2.0 is a systematic platform for plant promoter analysis and reconstructing transcriptional regulatory networks.",
            "authors": [
                "Chow C.-N.",
                "Zheng H.-Q.",
                "Wu N.-Y.",
                "Chien C.-H.",
                "Huang H.-D.",
                "Lee T.-Y.",
                "Chiang-Hsieh Y.-F.",
                "Hou P.-F.",
                "Yang T.-Y.",
                "Chang W.-C."
            ],
            "cit_count": 127,
            "journal": "Nucleic Acids Research",
            "pmid": "26476450",
            "title": "PlantPAN 2.0: An update of Plant Promoter Analysis Navigator for reconstructing transcriptional regulatory networks in plants",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:plantpan",
        "biotoolsID": "plantpan",
        "description": "Database-assisted system for recognizing combinatorial cis-regulatory elements with distance constraint in plant co-expressed genes.",
        "homepage": "http://plantpan2.itps.ncku.edu.tw/",
        "name": "PlantPAN"
    }
}