{
    "additionDate": "2017-03-24T09:34:01Z",
    "biotoolsCURIE": "biotools:pipmaker",
    "biotoolsID": "pipmaker",
    "credit": [
        {
            "email": "pipmaster@bio.cse.psu.edu",
            "name": "PipMaker team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Compute alignments of similar regions in two DNA sequences.  MultiPipMaker allows the user to see relationships among more than two sequences.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.bx.psu.edu/miller_lab/docs/galaxy_phen_assoc/tutorial/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                }
            ]
        }
    ],
    "homepage": "http://bio.cse.psu.edu/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "PipMaker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "PipMaker (http://bio.cse.psu.edu) is a World-Wide Web site for comparing two long DNA sequences to identify conserved segments and for producing informative, high-resolution displays of the resulting alignments. One display is a percent identity plot (pip), which shows both the position in one sequence and the degree of similarity for each aligning segment between the two sequences in a compact and easily understandable form. Positions along the horizontal axis can be labeled with features such as exons of genes and repetitive elements, and colors can be used to clarify and enhance the display. The web site also provides a plot of the locations of those segments in both species (similar to a dot plot). PipMaker is appropriate for comparing genomic sequences from any two related species, although the types of information that can be inferred (e.g., protein-coding regions and cis-regulatory elements) depend on the level of conservation and the time and divergence rate since the separation of the species. Gene regulatory elements are often detectable as similar, noncoding sequences in species that diverged as much as 100- 300 million years ago, such as humans and mice, Caenorhabditis elegans and C. briggsae, or Escherichia coli and Salmonella spp. PipMaker supports analysis of unfinished or ″working draft″ sequences by permitting one of the two sequences to be in unoriented and unordered contigs.",
                "authors": [
                    {
                        "name": "Schwartz S."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Frazer K.A."
                    },
                    {
                        "name": "Smit A."
                    },
                    {
                        "name": "Riemer C."
                    },
                    {
                        "name": "Bouck J."
                    },
                    {
                        "name": "Gibbs R."
                    },
                    {
                        "name": "Hardison R."
                    },
                    {
                        "name": "Miller W."
                    }
                ],
                "citationCount": 960,
                "date": "2000-04-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "PipMaker - A web server for aligning two genomic DNA sequences"
            },
            "pmid": "10779500"
        },
        {
            "metadata": {
                "abstract": "Analysis of multiple sequence alignments can generate important, testable hypotheses about the phylogenetic history and cellular function of genomic sequences. We describe the MultiPipMaker server, which aligns multiple, long genomic DNA sequences quickly and with good sensitivity (available at http://bio.cse.psu.edu/ since May 2001). Alignments are computed between a contiguous reference sequence and one or more secondary sequences, which can be finished or draft sequence. The outputs include a stacked set of percent identity plots, called a MultiPip, comparing the reference sequence with subsequent sequences, and a nucleotide-level multiple alignment. New tools are provided to search MultiPipMaker output for conserved matches to a user-specified pattern and for conserved matches to position weight matrices that describe transcription factor binding sites (singly and in clusters). We illustrate the use of MultiPipMaker to identify candidate regulatory regions in WNT2 and then demonstrate by transfection assays that they are functional. Analysis of the alignments also confirms the phylogenetic inference that horses are more closely related to cats than to cows.",
                "authors": [
                    {
                        "name": "Schwartz S."
                    },
                    {
                        "name": "Elnitski L."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Weirauch M."
                    },
                    {
                        "name": "Riemer C."
                    },
                    {
                        "name": "Smit A."
                    },
                    {
                        "name": "Thomas J."
                    },
                    {
                        "name": "Touchman J."
                    },
                    {
                        "name": "Blakesley B."
                    },
                    {
                        "name": "Bouffard G."
                    },
                    {
                        "name": "Beckstrom-Sternberg S."
                    },
                    {
                        "name": "Thomas P."
                    },
                    {
                        "name": "McDowell J."
                    },
                    {
                        "name": "Maskeri B."
                    },
                    {
                        "name": "Hansen N."
                    },
                    {
                        "name": "Margulies E."
                    },
                    {
                        "name": "Green E.D."
                    },
                    {
                        "name": "Hardison R.C."
                    },
                    {
                        "name": "Miller W."
                    }
                ],
                "citationCount": 177,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MultiPipMaker and supporting tools: Alignments and analysis of multiple genomic DNA sequences"
            },
            "pmid": "12824357"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1
}