{
    "name": "SPCI", 
    "description": "Structural and physico-chemical interpretation of QSAR models", 
    "homepage": "http://qsar4u.com/pages/sirms_qsar.php", 
    "biotoolsID": "SPCI", 
    "biotoolsCURIE": "biotools:SPCI", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2428", 
                    "term": "Validation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2426", 
                    "term": "Modelling and simulation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2851", 
                        "term": "Drug structure"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3814", 
                            "term": "SDF"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_1696", 
                        "term": "Drug report"
                    }, 
                    "format": []
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3314", 
            "term": "Chemistry"
        }, 
        {
            "uri": "http://edamontology.org/topic_0154", 
            "term": "Small molecules"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [
        "R", 
        "Python"
    ], 
    "license": null, 
    "collectionID": [
        "Czech Republic", 
        "Palacky University", 
        "Ukraine"
    ], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [
        "Tools"
    ], 
    "elixirNode": [
        "Czech Republic"
    ], 
    "link": [
        {
            "url": "https://github.com/DrrDom/spci", 
            "type": "Repository", 
            "note": "main module with GUI and all features written in Python"
        }, 
        {
            "url": "https://github.com/DrrDom/spci-ext", 
            "type": "Repository", 
            "note": "Python scripts to carry out fragmentation of compounds to further calculate descriptors and make prediction by external software tool and then calculate fragment contributions"
        }, 
        {
            "url": "https://github.com/DrrDom/rspci", 
            "type": "Repository", 
            "note": "R package for flexible post-processing and visualization of fragment contributions"
        }
    ], 
    "download": [
        {
            "url": "http://qsar4u.com/pages/sirms_qsar.php", 
            "type": "Downloads page", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "https://github.com/DrrDom/spci/blob/master/manual/spci-manual.pdf", 
            "type": "Manual", 
            "note": null
        }, 
        {
            "url": "https://github.com/DrrDom/spci/blob/master/manual/spci-manual.pdf", 
            "type": "Installation instructions", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1002/minf.201300029", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Universal approach for structural interpretation of qsar/ qspr models", 
                "abstract": "In this paper we offer a novel approach for the structural interpretation of QSAR models. The major advantage of our developed methodology is its universality, i.e., it can be applied to any QSAR/QSPR model irrespective of chemical descriptors and machine learning methods applied. This universality was achieved by using only the information obtained from substructures of the compounds of interest to interpret model outcomes. Reliability of the offered approach was confirmed by the results of three case studies, including end-points of different types (continuous and binary classification) and nature (solubility, mutagenicity, and inhibition of Transglutaminase 2), various fragment and whole-molecule descriptors (Simplex and Dragon), and multiple modeling techniques (partial least squares, random forest, and support vector machines). We compared the global contributions of molecular fragments obtained using our methodology with known SAR rules derived experimentally. In all cases high concordance between our interpretation and results published by others was observed. Although the proposed interpretation approach could be easily extended to any type of descriptors, we would recommend using Simplex descriptors to achieve a larger variety of investigated molecular fragments. The developed approach is a good tool for interpretation of such \"black box\" models like random forest, neural networks, etc. Analysis of fragment global contributions and their deviation across a dataset could be useful for the identification of key fragments and structural alerts. This information could be helpful to maximize the positive influence of structural surroundings on the given fragment and to decrease the negative effects. © 2013 Wiley-VCH Verlag GmbH and Co.", 
                "date": "2013-01-01T00:00:00Z", 
                "citationCount": 26, 
                "authors": [
                    {
                        "name": "Polishchuk P.G."
                    }, 
                    {
                        "name": "Kuzmin V.E."
                    }, 
                    {
                        "name": "Artemenko A.G."
                    }, 
                    {
                        "name": "Muratov E.N."
                    }
                ], 
                "journal": "Molecular Informatics"
            }
        }, 
        {
            "doi": "10.1021/acs.jcim.6b00371", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Structural and Physico-Chemical Interpretation (SPCI) of QSAR Models and Its Comparison with Matched Molecular Pair Analysis", 
                "abstract": "© 2016 American Chemical Society.This paper describes the Structural and Physico-Chemical Interpretation (SPCI) approach, which is an extension of a recently reported method for interpretation of quantitative structure-activity relationship (QSAR) models. This approach can efficiently be used to reveal structural motifs and the major physicochemical factors affecting the investigated properties. Its efficacy was demonstrated both on the classical Free-Wilson data set and on several data sets with different end points (permeability of the blood-brain barrier, fibrinogen receptor antagonists, acute oral toxicity). Structure-activity patterns extracted from QSAR models with SPCI were in good correspondence with experimentally observed relationships and molecular docking, regardless of the machine learning method used. Comparison of SPCI with the matched molecular pair (MMP) method clearly shows an advantage of our approach over MMP, especially for small or structurally diverse data sets. The developed approach has been implemented in the SPCI software tool with a graphical user interface, which is publicly available at http://qsar4u.com/pages/sirms-qsar.php.", 
                "date": "2016-08-22T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Polishchuk P."
                    }, 
                    {
                        "name": "Tinkov O."
                    }, 
                    {
                        "name": "Khristova T."
                    }, 
                    {
                        "name": "Ognichenko L."
                    }, 
                    {
                        "name": "Kosinskaya A."
                    }, 
                    {
                        "name": "Varnek A."
                    }, 
                    {
                        "name": "Kuz'Min V."
                    }
                ], 
                "journal": "Journal of Chemical Information and Modeling"
            }
        }
    ], 
    "credit": [
        {
            "name": "Pavel Polishchuk", 
            "email": "pavel.polishchuk@upol.cz", 
            "url": "https://www.imtm.cz/users/pavlo-polishchuk", 
            "orcidid": "https://orcid.org/0000-0001-5088-8149", 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-CZ", 
    "additionDate": "2019-10-07T14:28:24Z", 
    "lastUpdate": "2019-10-07T14:28:24Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}