{
    "additionDate": "2019-11-14T18:28:02Z",
    "biotoolsCURIE": "biotools:Yanagi",
    "biotoolsID": "Yanagi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hcorrada@umiacs.umd.edu",
            "name": "Héctor Corrada Bravo",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast and interpretable segment-based alternative splicing and gene expression analysis | Transcript Segment Library Construction for RNA-Seq Quantification | Analysis of differential alternative splicing from RNA-seq data is complicated by the fact that many RNA-seq reads map to multiple transcripts, and that annotated transcripts from a given gene are often a small subset of many possible complete transcripts for that gene",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HCBravoLab/yanagi",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2021-01-07T18:06:13.444869Z",
    "name": "Yanagi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2947-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Ultra-fast pseudo-alignment approaches are the tool of choice in transcript-level RNA sequencing (RNA-seq) analyses. Unfortunately, these methods couple the tasks of pseudo-alignment and transcript quantification. This coupling precludes the direct usage of pseudo-alignment to other expression analyses, including alternative splicing or differential gene expression analysis, without including a non-essential transcript quantification step. Results: In this paper, we introduce a transcriptome segmentation approach to decouple these two tasks. We propose an efficient algorithm to generate maximal disjoint segments given a transcriptome reference library on which ultra-fast pseudo-alignment can be used to produce per-sample segment counts. We show how to apply these maximally unambiguous count statistics in two specific expression analyses - alternative splicing and gene differential expression - without the need of a transcript quantification step. Our experiments based on simulated and experimental data showed that the use of segment counts, like other methods that rely on local coverage statistics, provides an advantage over approaches that rely on transcript quantification in detecting and correctly estimating local splicing in the case of incomplete transcript annotations. Conclusions: The transcriptome segmentation approach implemented in Yanagi exploits the computational and space efficiency of pseudo-alignment approaches. It significantly expands their applicability and interpretability in a variety of RNA-seq analyses by providing the means to model and capture local coverage variation in these analyses.",
                "authors": [
                    {
                        "name": "Gunady M.K."
                    },
                    {
                        "name": "Mount S.M."
                    },
                    {
                        "name": "Corrada Bravo H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Yanagi: Fast and interpretable segment-based alternative splicing and gene expression analysis"
            },
            "pmcid": "PMC6693274",
            "pmid": "31409274"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}