{
    "additionDate": "2018-07-30T12:23:14Z",
    "biotoolsCURIE": "biotools:musica",
    "biotoolsID": "musica",
    "credit": [
        {
            "email": "sbel@clinic.cat",
            "name": "Sergi Castellví-Bel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mutational Signatures in Cancer is a shiny-based web application aimed to visualize the somatic mutational profile of a series of provided samples (different formats are allowed) and to extract the contribution of the reported mutational signatures on their variation profile. It is mainly based on the MutationalPatterns R package.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/marcos-diazg/musica/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.ciberehd.org/GPtoCRC/en/tools.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/marcos-diazg/musica"
        }
    ],
    "name": "MuSiCa",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2234-y",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Mutational signatures have been proved as a valuable pattern in somatic genomics, mainly regarding cancer, with a potential application as a biomarker in clinical practice. Up to now, several bioinformatic packages to address this topic have been developed in different languages/platforms. MutationalPatterns has arisen as the most efficient tool for the comparison with the signatures currently reported in the Catalogue of Somatic Mutations in Cancer (COSMIC) database. However, the analysis of mutational signatures is nowadays restricted to a small community of bioinformatic experts. Results: In this work we present Mutational Signatures in Cancer (MuSiCa), a new web tool based on MutationalPatterns and built using the Shiny framework in R language. By means of a simple interface suited to non-specialized researchers, it provides a comprehensive analysis of the somatic mutational status of the supplied cancer samples. It permits characterizing the profile and burden of mutations, as well as quantifying COSMIC-reported mutational signatures. It also allows classifying samples according to the above signature contributions. Conclusions: MuSiCa is a helpful web application to characterize mutational signatures in cancer samples. It is accessible online at http://bioinfo.ciberehd.org/GPtoCRC/en/tools.htmland source code is freely available at https://github.com/marcos-diazg/musica.",
                "authors": [
                    {
                        "name": "Diaz-Gay M."
                    },
                    {
                        "name": "Vila-Casadesus M."
                    },
                    {
                        "name": "Franch-Exposito S."
                    },
                    {
                        "name": "Hernandez-Illan E."
                    },
                    {
                        "name": "Lozano J.J."
                    },
                    {
                        "name": "Castellvi-Bel S."
                    }
                ],
                "citationCount": 31,
                "date": "2018-06-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Mutational Signatures in Cancer (MuSiCa): A web application to implement mutational signatures analysis in cancer samples"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Cancer",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}