{
    "accessibility": "Open access",
    "additionDate": "2021-11-08T19:24:13.647453Z",
    "biotoolsCURIE": "biotools:grmt",
    "biotoolsID": "grmt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhyu@nxu.edu.cn",
            "name": "Zhenhua Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "GRMT (Generative Reconstruction of Mutation Tree from scratch) is a tool for tumor mutation tree inference from single-cell DNA sequencing data. GRMT is able to efficiently recover the chronological order of mutations and scale well to large datasets. It exploits BayesOpt to estimate error rates in mutation data based on the Bayesian optimization algorithm.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Phylogenetic inference (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Phylogenetic inference (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qasimyu/grmt",
    "language": [
        "C",
        "C++",
        "Shell"
    ],
    "lastUpdate": "2021-11-08T19:24:13.649994Z",
    "license": "GPL-3.0",
    "name": "GRMT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.692964",
            "metadata": {
                "abstract": "© Copyright © 2021 Yu, Liu, Du and Tang.Single-cell sequencing (SCS) now promises the landscape of genetic diversity at single cell level, and is particularly useful to reconstruct the evolutionary history of tumor. There are multiple types of noise that make the SCS data notoriously error-prone, and significantly complicate tumor tree reconstruction. Existing methods for tumor phylogeny estimation suffer from either high computational intensity or low-resolution indication of clonal architecture, giving a necessity of developing new methods for efficient and accurate reconstruction of tumor trees. We introduce GRMT (Generative Reconstruction of Mutation Tree from scratch), a method for inferring tumor mutation tree from SCS data. GRMT exploits the k-Dollo parsimony model to allow each mutation to be gained once and lost at most k times. Under this constraint on mutation evolution, GRMT searches for mutation tree structures from a perspective of tree generation from scratch, and implements it to an iterative process that gradually increases the tree size by introducing a new mutation per time until a complete tree structure that contains all mutations is obtained. This enables GRMT to efficiently recover the chronological order of mutations and scale well to large datasets. Extensive evaluations on simulated and real datasets suggest GRMT outperforms the state-of-the-arts in multiple performance metrics. The GRMT software is freely available at https://github.com/qasimyu/grmt.",
                "authors": [
                    {
                        "name": "Du F."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Tang X."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "citationCount": 2,
                "date": "2021-06-04T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "GRMT: Generative Reconstruction of Mutation Tree From Scratch Using Single-Cell Sequencing Data"
            },
            "pmcid": "PMC8212059",
            "pmid": "34149820"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
