{
    "additionDate": "2019-12-20T10:37:20Z",
    "biotoolsCURIE": "biotools:IMGT_Allele-Align",
    "biotoolsID": "IMGT_Allele-Align",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "patrice.duroux@igh.cnrs.fr",
            "name": "Patrice Duroux"
        }
    ],
    "description": "IMGT/Allele-Align is the IMGT® tool for the comparison of two alleles highlighting the nucleotide and amino acid differences.",
    "editPermission": {
        "authors": [
            "geraldine.folch",
            "vgiudicelli",
            "skossida",
            "pduroux",
            "Joumana"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.imgt.org/Allele-Align/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-01-24T23:56:07Z",
    "maturity": "Mature",
    "name": "IMGT Allele-Align",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Joumana",
    "publication": [
        {
            "metadata": {
                "abstract": "IMGT, the international ImMunoGeneTics information system® (http://imgt.cines.fr), is a high quality integrated knowledge resource specialized in immunoglobulins (IG), T cell receptors (TR), major histocompatibility complex (MHC) and related proteins of the immune system (RPI) of human and other vertebrates, created in 1989, by the Laboratoire d'ImmunoGénétique Moléculaire LIGM. IMGT provides a common access to standardized data which include nucleotide and protein sequences, oligonucleotide primers, gene maps, genetic polymorphisms, specificities, 2D and 3D structures. IMGT consists of several sequence databases (IMGT/LIGM-DB, IMGT/MHC-DB, IMGT/PRIMER-DB), one genome database (IMGT/GENE-DB) and one three-dimensional structure database (IMGT/3Dstructure-DB), interactive tools for sequence analysis (IMGT/V-QUEST, IMGT/JunctionAnalysis, IMGT/PhyloGene, IMGT/Allele-Align), for genome analysis (IMGT/GeneSearch, IMGT/GeneView, IMGT/LocusView) and for 3D structure analysis (IMGT/StructuralQuery), and Web resources (\"IMGT Marie-Paule page\") comprising 8000 HTML pages. IMGT other accesses include SRS, FTP, search by BLAST, etc. By its high quality and its easy data distribution, IMGT has important implications in medical research (repertoire in autoimmune diseases, AIDS, leukemias, lymphomas, myelomas), veterinary research, genome diversity and genome evolution studies of the adaptive immune responses, biotechnology related to antibody engineering (scFv, phage displays, combinatorial libraries) and therapeutical approaches (grafts, immunotherapy). IMGT is freely available at http://imgt.cines.fr. © 2004 - IOS Press, Bioinformation Systems e.V. and the authors. All rights reserved.",
                "authors": [
                    {
                        "name": "Lefranc M.-P."
                    },
                    {
                        "name": "Giudicelli V."
                    },
                    {
                        "name": "Ginestoux C."
                    },
                    {
                        "name": "Bosc N."
                    },
                    {
                        "name": "Folch G."
                    },
                    {
                        "name": "Guiraudou D."
                    },
                    {
                        "name": "Jabado-Michaloud J."
                    },
                    {
                        "name": "Magris S."
                    },
                    {
                        "name": "Scaviner D."
                    },
                    {
                        "name": "Thouvenin V."
                    },
                    {
                        "name": "Combres K."
                    },
                    {
                        "name": "Girod D."
                    },
                    {
                        "name": "Jeanjean S."
                    },
                    {
                        "name": "Protat C."
                    },
                    {
                        "name": "Monod M.Y."
                    },
                    {
                        "name": "Duprat E."
                    },
                    {
                        "name": "Kaas Q."
                    },
                    {
                        "name": "Pommie C."
                    },
                    {
                        "name": "Chaume D."
                    },
                    {
                        "name": "Lefranc G."
                    }
                ],
                "citationCount": 76,
                "date": "2004-06-14T00:00:00Z",
                "journal": "In Silico Biology",
                "title": "IMGT-ontology for immunogenetics and immunoinformatics"
            },
            "pmid": "15089751"
        },
        {
            "metadata": {
                "abstract": "IMGT, the international ImMunoGeneTics information system® (http://imgt.cines.fr), was created in 1989 at Montpellier, France. IMGT is a high quality integrated knowledge resource specialized in immunoglobulins (IG), T cell receptors (TR), major histocompatibility complex (MHC) of human and other vertebrates, and related proteins of the immune system (RPI) which belong to the immunoglobulin superfamily (IgSF) and MHC superfamily (MhcSF). IMGT provides a common access to standardized data from genome, proteome, genetics and three-dimensional structures. The accuracy and the consistency of IMGT data are based on IMGT-ONTOLOGY, a semantic specification of terms to be used in immunogenetics and immunoinformatics. IMGT-ONTOLOGY has been formalized using XML Schema (IMGT-ML) for interoperability with other information systems. We are developing Web services to automatically query IMGT databases and tools. This is the first step towards IMGT-Choreography which will trigger and coordinate dynamic interactions between IMGT Web services to process complex significant biological and clinical requests. IMGT-Choreography will further increase the IMGT leadership in immunogenetics and immunoinformatics for medical research (repertoire analysis of the IG antibody recognition sites and of the TR recognition sites in autoimmune and infectious diseases, AIDS, leukemias, lymphomas, myelomas), veterinary research (IG and TR repertoires in farm and wild life species), genome diversity and genome evolution studies of the adaptive immune responses, biotechnology related to antibody engineering (single chain Fragment variable (scFv), phage displays, combinatorial libraries, chimeric, humanized and human antibodies), diagnostics (detection and follow-up of residual diseases) and therapeutical approaches (grafts, immunotherapy, vaccinology). IMGT is freely available at http://imgt.cines.fr. © 2005 IOS Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lefranc M.-P."
                    },
                    {
                        "name": "Clement O."
                    },
                    {
                        "name": "Kaas Q."
                    },
                    {
                        "name": "Duprat E."
                    },
                    {
                        "name": "Chastellan P."
                    },
                    {
                        "name": "Coelho I."
                    },
                    {
                        "name": "Combres K."
                    },
                    {
                        "name": "Ginestoux C."
                    },
                    {
                        "name": "Giudicelli V."
                    },
                    {
                        "name": "Chaume D."
                    },
                    {
                        "name": "Lefranc G."
                    }
                ],
                "citationCount": 68,
                "date": "2005-06-13T00:00:00Z",
                "journal": "In Silico Biology",
                "title": "IMGT-Choreography for immunogenetics and immunoinformatics"
            },
            "pmid": "15972004"
        },
        {
            "metadata": {
                "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.IMGT, the international ImMunoGeneTics information system (http://www.imgt.org) is the global reference in immunogenetics and immunoinformatics. By its creation in 1989 by Marie-Paule Lefranc (Université de Montpellier and CNRS), IMGT marked the advent of immunoinformatics, which emerged at the interface between immunogenetics and bioinformatics. IMGT is specialized in the immunoglobulins (IG) or antibodies, T cell receptors (TR), major histocompatibility (MH) and proteins of the IgSF and MhSF superfamilies. IMGT is built on the IMGTONTOLOGY axioms and concepts, which bridged the gap between genes, sequences and 3D structures. The concepts include the IMGTR standardized keywords (identification), IMGTR standardized labels (description), IMGTR standardized nomenclature (classification), IMGT unique numbering and IMGT Colliers de Perles (numerotation). IMGTR comprises 7 databases, 17 online tools and 15 000 pages of web resources, and provides a high-quality and integrated system for analysis of the genomic and expressed IG and TR repertoire of the adaptive immune responses, including NGS high-throughput data. Tools and databases are used in basic, veterinary and medical research, in clinical applications (mutation analysis in leukemia and lymphoma) and in antibody engineering and humanization. The IMGT/mAb-DB interface was developed for therapeutic antibodies and fusion proteins for immunological applications (FPIA). IMGTR is freely available at http://www.imgt.org.",
                "authors": [
                    {
                        "name": "Lefranc M.-P."
                    },
                    {
                        "name": "Giudicelli V."
                    },
                    {
                        "name": "Duroux P."
                    },
                    {
                        "name": "Jabado-Michaloud J."
                    },
                    {
                        "name": "Folch G."
                    },
                    {
                        "name": "Aouinti S."
                    },
                    {
                        "name": "Carillon E."
                    },
                    {
                        "name": "Duvergey H."
                    },
                    {
                        "name": "Houles A."
                    },
                    {
                        "name": "Paysan-Lafosse T."
                    },
                    {
                        "name": "Hadi-Saljoqi S."
                    },
                    {
                        "name": "Sasorith S."
                    },
                    {
                        "name": "Lefranc G."
                    },
                    {
                        "name": "Kossida S."
                    }
                ],
                "citationCount": 149,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IMGT R, the international ImMunoGeneTics information system R 25 years on"
            },
            "pmid": "25378316"
        }
    ],
    "relation": [
        {
            "biotoolsID": "imgt",
            "type": "includedIn"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}