{
    "accessibility": "Open access",
    "additionDate": "2022-07-17T11:41:48.214759Z",
    "biotoolsCURIE": "biotools:bscm2tdb",
    "biotoolsID": "bscm2tdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dinesh.kumar@icar.gov.in",
            "name": "Dinesh Kumar",
            "typeEntity": "Person"
        },
        {
            "name": "Varij Nayan"
        }
    ],
    "description": "Buffalo Subclinical Mastitis Methylome–Transcriptome database (BSCM2TDb) is a three-tier architecture-based relational database in Water Buffalo.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DMR identification",
                    "uri": "http://edamontology.org/operation_3809"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://webtom.cabgrid.res.in/BSCM2TDb",
    "lastUpdate": "2024-11-24T15:54:35.056695Z",
    "license": "Apache-2.0",
    "name": "BSCM2TDb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fgene.2022.828292",
            "metadata": {
                "abstract": "Subclinical mastitis (SCM) in buffalo is one of the most challenging paradoxes for the dairy sector with very significant milk production losses and poses an imminent danger to milch animal’s milk-producing ability. We present here the genome-wide methylation specific to SCM in water buffalo and its consequential effect on the gene expression landscape for the first time. Whole-genome DNA methylation profiles from peripheral blood lymphocytes and gene expression profiles from milk somatic cells of healthy and SCM cases were catalogued from the MeDIP-Seq and RNA-Seq data. The average methylation in healthy buffaloes was found to be higher than that in the SCM-infected buffaloes. DNA methylation was abundant in the intergenic region followed by the intronic region in both healthy control and SCM groups. A total of 3,950 differentially methylated regions (DMRs) were identified and annotated to 370 differentially methylated genes (DMGs), most of which were enriched in the promoter region. Several important pathways were activated due to hypomethylation and belonged to the Staphylococcus aureus infection, Th17 cell differentiation, and antigen processing and presentation pathways along with others of defense responses. DNA methylome was compared with transcriptome to understand the regulatory role of DNA methylation on gene expression specific to SCM in buffaloes. A total of 4,778 significant differentially expressed genes (DEGs) were extracted in response to SCM, out of which 67 DMGs were also found to be differentially expressed, suggesting that during SCM, DNA methylation could be one of the epigenetic regulatory mechanisms of gene expression. Genes like CSF2RB, LOC102408349, C3 and PZP like, and CPAMD8 were found to be downregulated in our study, which are known to be involved in the immune response to SCM. Association of DNA methylation with transposable elements, miRNAs, and lncRNAs was also studied. The present study reports a buffalo SCM web resource (BSCM2TDb) available at http://webtom.cabgrid.res.in/BSCM2TDb that catalogues all the mastitis-related information of the analyses results of this study in a single place. This will be of immense use to buffalo researchers to understand the host–pathogen interaction involving SCM, which is required in endeavors of mastitis control and management.",
                "authors": [
                    {
                        "name": "Bharadwaj A."
                    },
                    {
                        "name": "Bhardwaj A."
                    },
                    {
                        "name": "Bhatia T."
                    },
                    {
                        "name": "Datta T.K."
                    },
                    {
                        "name": "Iquebal M.A."
                    },
                    {
                        "name": "Jaiswal S."
                    },
                    {
                        "name": "Kumar D."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nayan V."
                    },
                    {
                        "name": "Phulia S.K."
                    },
                    {
                        "name": "Rai A."
                    },
                    {
                        "name": "Singh C."
                    },
                    {
                        "name": "Singh K."
                    },
                    {
                        "name": "Singh R."
                    },
                    {
                        "name": "Swaroop M.N."
                    }
                ],
                "citationCount": 6,
                "date": "2022-03-15T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Genome-Wide DNA Methylation and Its Effect on Gene Expression During Subclinical Mastitis in Water Buffalo"
            },
            "pmcid": "PMC8965078",
            "pmid": "35368672"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        }
    ],
    "validated": 1
}
