{
    "accessibility": "Open access",
    "additionDate": "2022-06-22T07:35:55.134771Z",
    "biotoolsCURIE": "biotools:cerealestdb",
    "biotoolsID": "cerealestdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sanjeevbunty@gmail.com",
            "name": "Sanjeev Kumar",
            "typeEntity": "Person"
        }
    ],
    "description": "The CerealESTdb, a user-friendly, searchable, and interactive database has been developed with a primary goal to provide information on assembled and annotated ESTs from four major crop plants, namely wheat, rice, maize, and sorghum under multiple environmental stresses including cold, heat, drought, and salt stress as well as on the application of ABA.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "EST assembly",
                    "uri": "http://edamontology.org/operation_0526"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ]
        }
    ],
    "homepage": "http://cabgrid.res.in/CerealESTDb",
    "lastUpdate": "2022-06-22T07:35:55.137574Z",
    "license": "Not licensed",
    "name": "CerealESTdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.842868",
            "metadata": {
                "abstract": "Copyright © 2022 Kumar, Bhati, Saha, Lal, Pandey, Mishra, Farooqi, Kumar, Chaturvedi and Rai.Cereals are the most important food crops and are considered key contributors to global food security. Loss due to abiotic stresses in cereal crops is limiting potential productivity in a significant manner. The primary reasons for abiotic stresses are abrupt temperature, variable rainfall, and declining nutrient status of the soil. Varietal development is the key to sustaining productivity under influence of multiple abiotic stresses and must be studied in context with genomics and molecular breeding. Recently, advances in a plethora of Next Generation Sequencing (NGS) based methods have accelerated the enormous genomic data generation associated with stress-induced transcripts such as microarray, RNAseq, Expressed Sequenced Tag (ESTs), etc. Many databases related to microarray and RNA-seq based transcripts have been developed and profusely utilized. However, an abundant amount of transcripts related to abiotic stresses in various cereal crops arising from EST technology are available but still remain underutilized in absence of a consolidated database. In this study, an attempt has been made with a primary goal to integrate, analyse, and characterise the available resources of ESTs responsive to abiotic stresses in major cereals. The developed CerealESTdb presents a customisable search in two different ways in the form of searchable content for easy access and potential use. This database comprises ESTs from four major cereal crops, namely rice (Oryza sativa L.), wheat (Triticum aestivum L.), sorghum (Sorghum bicolour L.), and maize (Zea mays L.), under a set of abiotic stresses. The current statistics of this cohesive database consists of 55,826 assembled EST sequences, 51,791 predicted genes models, and their 254,609 gene ontology terms including extensive information on 1,746 associated metabolic pathways. We anticipate that developed CerealESTdb will be helpful in deciphering the knowledge of complex biological phenomena under abiotic stresses to accelerate the molecular breeding programs towards the development of crop cultivars resilient to abiotic stresses. The CerealESTdb is publically available with the URL http://cabgrid.res.in/CerealESTDb.",
                "authors": [
                    {
                        "name": "Bhati J."
                    },
                    {
                        "name": "Chaturvedi K.K."
                    },
                    {
                        "name": "Farooqi M.S."
                    },
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Lal S.B."
                    },
                    {
                        "name": "Mishra D.C."
                    },
                    {
                        "name": "Pandey P.K."
                    },
                    {
                        "name": "Rai A."
                    },
                    {
                        "name": "Saha A."
                    }
                ],
                "date": "2022-02-24T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "CerealESTDb: A Comprehensive Resource for Abiotic Stress-Responsive Annotated ESTs With Predicted Genes, Gene Ontology, and Metabolic Pathways in Major Cereal Crops"
            },
            "pmcid": "PMC8907976",
            "pmid": "35281847"
        }
    ],
    "toolType": [
        "Database portal",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
