{
    "accessibility": "Open access",
    "additionDate": "2022-11-05T19:39:33.312607Z",
    "biotoolsCURIE": "biotools:pilsl",
    "biotoolsID": "pilsl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhengjie@shanghaitech.edu.cn",
            "name": "Jie Zheng",
            "orcidid": "https://orcid.org/0000-0001-6774-9786",
            "typeEntity": "Person"
        },
        {
            "name": "Jiale Yu"
        },
        {
            "name": "Siyu Tao"
        },
        {
            "name": "Xin Liu"
        }
    ],
    "description": "Pairwise interaction learning-based graph neural network for synthetic lethality prediction in human cancers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JieZheng-ShanghaiTech/PiLSL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-11-05T19:39:33.315584Z",
    "license": "MIT",
    "name": "PiLSL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC476",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Synthetic lethality (SL) is a type of genetic interaction in which the simultaneous inactivation of two genes leads to cell death, while the inactivation of a single gene does not affect the cell viability. It can effectively expand the range of anti-cancer therapeutic targets. SL interactions are identified mainly by experimental screening and computational prediction. Recent machine-learning methods mostly learn the representation of each gene individually, ignoring the representation of the pairwise interaction between two genes. In addition, the mechanisms of SL, the key to translating SL into cancer therapeutics, are often unclear. RESULTS: To fill the gaps, we propose a pairwise interaction learning-based graph neural network (GNN) named PiLSL to learn the representation of pairwise interaction between two genes for SL prediction. First, we construct an enclosing graph for each pair of genes from a knowledge graph. Secondly, we design an attentive embedding propagation layer in a GNN to discriminate the importance among the edges in the enclosing graph and to learn the latent features of the pairwise interaction from the weighted enclosing graph. Finally, we further fuse the latent features with explicit features extracted from multi-omics data to obtain powerful gene representations for SL prediction. Extensive experimental results demonstrate that PiLSL outperforms the best baseline by a large margin and generalizes well under three realistic scenarios. Besides, PiLSL provides an explanation of SL mechanisms via the weighted paths in the enclosing graphs by attention mechanism. AVAILABILITY AND IMPLEMENTATION: Our source code is available at https://github.com/JieZheng-ShanghaiTech/PiLSL.",
                "authors": [
                    {
                        "name": "Bai F."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Tao S."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "date": "2022-09-16T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "PiLSL: pairwise interaction learning-based graph neural network for synthetic lethality prediction in human cancers"
            },
            "pmid": "36124788"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
