{
    "additionDate": "2022-09-29T05:44:08.987533Z",
    "biotoolsCURIE": "biotools:apocand",
    "biotoolsID": "apocand",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/apocand/index.php"
        }
    ],
    "description": "ApoCanD: Database of Human Apoptotic Proteins in the context of cancer",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/apocand/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/apocand/index.php",
    "lastUpdate": "2022-09-29T05:45:10.310338Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/apocand/index.php"
        }
    ],
    "name": "apocand",
    "owner": "raghavagps",
    "publication": [
        {
            "metadata": {
                "abstract": "In the past decade, apoptosis pathway has gained a serious consideration being a critical cellular process in determining the cancer progression. Inverse relationship between cancer progression and apoptosis rate has been well established in the literature. It causes apoptosis proteins under the investigative scanner for developing anticancer therapies, which certainly got a success in the case of few apoptosis proteins as drug targets. In the present study, we have developed a dedicated database of 82 apoptosis proteins called ApoCanD. This database comprises of crucial information of apoptosis proteins in the context of cancer. Genomic status of proteins in the form of mutation, copy number variation and expression in thousands of tumour samples and cancer cell lines are the major bricks of this database. In analysis, we have found that TP53 and MYD88 are the two most frequently mutated proteins in cancer. Availability of other information e.g. gene essentiality data, tertiary structure, sequence alignments, sequences profiles, post-translational modifications makes it even more useful for the researchers. A user-friendly web interface is provided to ameliorate the use of ApoCanD. We anticipate that, this database will facilitate the research community working in the field of apoptosis and cancer. The database can be accessed at: http://crdd.osdd.net/raghava/apocand.",
                "authors": [
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 7,
                "date": "2016-02-10T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "ApoCanD: Database of human apoptotic proteins in the context of cancer"
            },
            "pmid": "26861916"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
