{
    "additionDate": "2021-01-18T08:59:55Z",
    "biotoolsCURIE": "biotools:procleave",
    "biotoolsID": "procleave",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tmarquezlago@uabmc.edu",
            "name": "Tatiana Marquez-Lago",
            "typeEntity": "Person"
        },
        {
            "email": "Jian.Li@monash.edu",
            "name": "Jian Li",
            "typeEntity": "Person"
        },
        {
            "email": "Jiangning.Song@monash.edu",
            "name": "Jiangning Song",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting Protease-specific Substrate Cleavage Sites by Combining Sequence and Structural Information.\n\nin silico identification of protease substrate cleavage sites.\n\na conditional random field approach that combines sequence and structural information.\n\nProcleave is developed to improve the performance of protease substrate cleavage site prediction by incorporating the real 3D structural features of substrates.\n\nsignificantly improves the prediction of protease substrate cleavage sites.\n\nWe have mapped the substrates deposited in MEROPS onto the structural database PDB and obtained a subset of protein substrates with experimentally solved 3D structures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein cleavage site prediction",
                    "uri": "http://edamontology.org/operation_0422"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                }
            ]
        }
    ],
    "homepage": "http://procleave.erc.monash.edu/",
    "lastUpdate": "2021-01-27T17:32:14Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://procleave.erc.monash.edu/gallery.html"
        }
    ],
    "name": "Procleave",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.GPB.2019.08.002",
            "metadata": {
                "abstract": "© 2020 The AuthorsProteases are enzymes that cleave and hydrolyse the peptide bonds between two specific amino acid residues of target substrate proteins. Protease-controlled proteolysis plays a key role in the degradation and recycling of proteins, which is essential for various physiological processes. Thus, solving the substrate identification problem will have important implications for the precise understanding of functions and physiological roles of proteases, as well as for therapeutic target identification and pharmaceutical applicability. Consequently, there is a great demand for bioinformatics methods that can predict novel substrate cleavage events with high accuracy by utilizing both sequence and structural information. In this study, we present Procleave, a novel bioinformatics approach for predicting protease-specific substrates and specific cleavage sites by taking into account both their sequence and 3D structural information. Structural features of known cleavage sites were represented by discrete values using a LOWESS data-smoothing optimization method, which turned out to be critical for the performance of Procleave. The optimal approximations of all structural parameter values were encoded in a conditional random field (CRF) computational framework, alongside sequence and chemical group-based features. Here, we demonstrate the outstanding performance of Procleave through extensive benchmarking and independent tests. Procleave is capable of correctly identifying most cleavage sites in the case study. Importantly, when applied to the human structural proteome encompassing 17,628 protein structures, Procleave suggests a number of potential novel target substrates and their corresponding cleavage sites of different proteases. Procleave is implemented as a webserver and is freely accessible at http://procleave.erc.monash.edu/.",
                "authors": [
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Leier A."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xiang D."
                    },
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Webb G.I."
                    },
                    {
                        "name": "Smith A.I."
                    },
                    {
                        "name": "Marquez-Lago T."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Song J."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "Procleave: Predicting Protease-specific Substrate Cleavage Sites by Combining Sequence and Structural Information"
            },
            "pmcid": "PMC7393547",
            "pmid": "32413515"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ]
}