{
    "name": "SOMPNN", 
    "description": "A novel model for prediction of TMH that features by minimal parameter assumptions requirement and high computational efficiency. In this model, a self-organizing map (SOM) is used to adaptively learn the helices distribution knowledge hidden in the training data, and then a probabilistic neural network (PNN) is adopted to predict TMH segments based on the knowledge learned by SOM.", 
    "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/SOMPNN/", 
    "biotoolsID": "SOMPNN", 
    "biotoolsCURIE": "biotools:SOMPNN", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0269", 
                    "term": "Transmembrane protein prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0820", 
            "term": "Membrane and lipoproteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_2814", 
            "term": "Protein structure analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3474", 
            "term": "Machine learning"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/sompnn-an-efficient-non-parametric-model-for-predicting-transmembrane-helices.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/SOMPNN/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21695537", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "SOMPNN: An efficient non-parametric model for predicting transmembrane helices", 
                "abstract": "Accurately predicting the transmembrane helices (TMH) in a helical membrane protein is an important but challenging task. Recent researches have demonstrated that statistics-based methods are promising routes to improve the TMH prediction accuracy. However, most of existing TMH predictors are parametric models and they have to make assumptions of several or even hundreds of adjustable parameters based on the underlying probability distribution, which is difficult when no a priori knowledge is available. Besides the performances of these parametric predictors significantly depend on the estimated parameters, some of them need to exploit the entire training dataset in the prediction stage, which will lead to low prediction efficiency and this problem will become even worse when dealing with large-scale dataset. In this paper, we propose a novel SOMPNN model for prediction of TMH that features by minimal parameter assumptions requirement and high computational efficiency. In the SOMPNN model, a self-organizing map (SOM) is used to adaptively learn the helices distribution knowledge hidden in the training data, and then a probabilistic neural network (PNN) is adopted to predict TMH segments based on the knowledge learned by SOM. Experimental results on two benchmark datasets show that the proposed SOMPNN outperforms most existing popular TMH predictors and is promising to be extended to deal with other complicated biological problems. The datasets and the source codes of SOMPNN are available at http://www.csbio.sjtu.edu.cn/bioinf/SOMPNN/ . © 2011 Springer-Verlag.", 
                "date": "2012-06-01T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Yu D.-J."
                    }, 
                    {
                        "name": "Shen H.-B."
                    }, 
                    {
                        "name": "Yang J.-Y."
                    }
                ], 
                "journal": "Amino Acids"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.csbio.sjtu.edu.cn/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:00:16Z", 
    "lastUpdate": "2018-12-10T12:58:45Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}