{
    "accessibility": "Open access",
    "additionDate": "2023-02-27T20:55:30.101433Z",
    "biotoolsCURIE": "biotools:nrn-ez",
    "biotoolsID": "nrn-ez",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ascimemi@albany.edu",
            "name": "Annalisa Scimemi",
            "orcidid": "http://orcid.org/0000-0003-4975-093X",
            "typeEntity": "Person"
        },
        {
            "name": "Evan A. Cobb"
        },
        {
            "name": "Maurice A. Petroccione"
        }
    ],
    "description": "An application to streamline biophysical modeling of synaptic integration using NEURON.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/scimemia/NRN-EZ",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-27T20:55:30.104132Z",
    "license": "GPL-3.0",
    "name": "NRN-EZ",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/s41598-022-27302-8",
            "metadata": {
                "abstract": "© 2023, The Author(s).One of the fundamental goals in neuroscience is to determine how the brain processes information and ultimately controls the execution of complex behaviors. Over the past four decades, there has been a steady growth in our knowledge of the morphological and functional diversity of neurons, the building blocks of the brain. These cells clearly differ not only for their anatomy and ion channel distribution, but also for the type, strength, location, and temporal pattern of activity of the many synaptic inputs they receive. Compartmental modeling programs like NEURON have become widely used in the neuroscience community to address a broad range of research questions, including how neurons integrate synaptic inputs and propagate information through complex neural networks. One of the main strengths of NEURON is its ability to incorporate user-defined information about the realistic morphology and biophysical properties of different cell types. Although the graphical user interface of the program can be used to run initial exploratory simulations, introducing a stochastic representation of synaptic weights, locations and activation times typically requires users to develop their own codes, a task that can be overwhelming for some beginner users. Here we describe NRN-EZ, an interactive application that allows users to specify complex patterns of synaptic input activity that can be integrated as part of NEURON simulations. Through its graphical user interface, NRN-EZ aims to ease the learning curve to run computational models in NEURON, for users that do not necessarily have a computer science background.",
                "authors": [
                    {
                        "name": "Cobb E.A.W."
                    },
                    {
                        "name": "Petroccione M.A."
                    },
                    {
                        "name": "Scimemi A."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "NRN-EZ: an application to streamline biophysical modeling of synaptic integration using NEURON"
            },
            "pmcid": "PMC9832141",
            "pmid": "36627356"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
