{
    "additionDate": "2017-08-03T18:52:36Z",
    "biotoolsCURIE": "biotools:nanomark",
    "biotoolsID": "nanomark",
    "credit": [
        {
            "email": "contact@sovic.org",
            "name": "Ivan Sović",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sovic.org/"
        }
    ],
    "description": "System for benchmarking DNA assembly tools, based on 3rd generation sequencers.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/kkrizanovic/NanoMark/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kkrizanovic/NanoMark",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/nanomark-dna-assembly-benchmark-for-nanopore-long-reads.html"
        }
    ],
    "name": "NanoMark",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved.Motivation: Recent emergence of nanopore sequencing technology set a challenge for established assembly methods. In this work, we assessed how existing hybrid and non-hybrid de novo assembly methods perform on long and error prone nanopore reads. Results: We benchmarked five non-hybrid (in terms of both error correction and scaffolding) assembly pipelines as well as two hybrid assemblers which use third generation sequencing data to scaffold Illumina assemblies. Tests were performed on several publicly available MinION and Illumina datasets of Escherichia coli K-12, using several sequencing coverages of nanopore data (20×, 30×, 40× and 50×). We attempted to assess the assembly quality at each of these coverages, in order to estimate the requirements for closed bacterial genome assembly. For the purpose of the benchmark, an extensible genome assembly benchmarking framework was developed. Results show that hybrid methods are highly dependent on the quality of NGS data, but much less on the quality and coverage of nanopore data and perform relatively well on lower nanopore coverages. All non-hybrid methods correctly assemble the E. coli genome when coverage is above 40×, even the non-hybrid method tailored for Pacific Biosciences reads. While it requires higher coverage compared to a method designed particularly for nanopore reads, its running time is significantly lower. Availability and Implementation: https://github.com/kkrizanovic/NanoMark",
                "authors": [
                    {
                        "name": "Sovic I."
                    },
                    {
                        "name": "Krizanovic K."
                    },
                    {
                        "name": "Skala K."
                    },
                    {
                        "name": "Sikic M."
                    }
                ],
                "citationCount": 17,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Evaluation of hybrid and non-hybrid methods for de novo assembly of nanopore reads"
            },
            "pmid": "27162186"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}