
{
    "credit": [
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://lin.uestc.edu.cn/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://lin.uestc.edu.cn/server/iNucPseKNC/readme"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleosome formation or exclusion sequence prediction",
                    "uri": "http://edamontology.org/operation_0432"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "DNA packaging",
                "uri": "http://edamontology.org/topic_3176"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/inuc-pseknc-predicting-nucleosomes-with-pseudo-k-tuple-nucleotide-composition.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Nucleosome positioning participates in many cellular activities and plays significant roles in regulating cellular processes. With the avalanche of genome sequences generated in the post-genomic age, it is highly desired to develop automated methods for rapidly and effectively identifying nucleosome positioning. Although some computational methods were proposed, most of them were species specific and neglected the intrinsic local structural properties that might play important roles in determining the nucleosome positioning on a DNA sequence. Results: Here a predictor called 'iNuc-PseKNC' was developed for predicting nucleosome positioning in Homo sapiens, Caenorhabditis elegans and Drosophila melanogaster genomes, respectively. In the new predictor, the samples of DNA sequences were formulated by a novel feature-vector called 'pseudo k-tuple nucleotide composition', into which six DNA local structural properties were incorporated. It was observed by the rigorous cross-validation tests on the three stringent benchmark datasets that the overall success rates achieved by iNuc-PseKNC in predicting the nucleosome positioning of the aforementioned three genomes were 86.27%, 86.90% and 79.97%, respectively. Meanwhile, the results obtained by iNuc-PseKNC on various benchmark datasets used by the previous investigators for different genomes also indicated that the current predictor remarkably outperformed its counterparts. © 2014 The Author 2014.",
            "authors": [
                "Guo S.-H.",
                "Deng E.-Z.",
                "Xu L.-Q.",
                "Ding H.",
                "Lin H.",
                "Chen W.",
                "Chou K.-C."
            ],
            "cit_count": 254,
            "journal": "Bioinformatics",
            "pmid": "24504871",
            "title": "INuc-PseKNC: A sequence-based predictor for predicting nucleosome positioning in genomes with pseudo k-tuple nucleotide composition",
            "year": "2014-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:inuc-pseknc",
        "biotoolsID": "inuc-pseknc",
        "description": "This web-server was developed to predict nucleosome occupancy of H. sapiens, C. elegan and D. melanogaster.",
        "homepage": "http://lin.uestc.edu.cn/server/iNuc-PseKNC",
        "name": "iNuc-PseKNC"
    }
}