{"collectionID": [], "accessibility": [], "topic": [{"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "PSB", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1105/tpc.112.104513", "note": null, "version": null, "pmid": "23204403", "type": "Primary", "pmcid": null, "metadata": {"title": "The MORPH algorithm: Ranking candidate genes for membership in arabidopsis and tomato pathwaysC W", "abstract": "Closing gaps in our current knowledge about biological pathways is a fundamental challenge. The development of novel computational methods along with high-throughput experimental data carries the promise to help in the challenge. We present an algorithm called MORPH (for module-guided ranking of candidate pathway genes) for revealing unknown genes in biological pathways. The method receives as input a set of known genes from the target pathway, a collection of expression profiles, and interaction and metabolic networks. Using machine learning techniques, MORPH selects the best combination of data and analysis method and outputs a ranking of candidate genes predicted to belong to the target pathway. We tested MORPH on 230 known pathways in Arabidopsis thaliana and 93 known pathways in tomato (Solanum lycopersicum) and obtained high-quality cross-validation results. In the photosynthesis light reactions, homogalacturonan biosynthesis, and chlorophyll biosynthetic pathways of Arabidopsis, genes ranked highly by MORPH were recently verified to be associated with these pathways. MORPH candidates ranked for the carotenoid pathway from Arabidopsis and tomato are derived from pathways that compete for common precursors or from pathways that are coregulated with or regulate the carotenoid biosynthetic pathway. © 2012 American Society of Plant Biologists.", "citationCount": 16, "authors": [{"name": "Tzfadia O."}, {"name": "Amar D."}, {"name": "Bradbury L.M.T."}, {"name": "Wurtzel E.T."}, {"name": "Shamir R."}], "date": "2012-11-01T00:00:00Z", "journal": "Plant Cell"}}], "homepage_status": 0, "credit": [{"typeRole": ["Contributor"], "name": "Oren Tzfadia", "url": null, "gridid": null, "note": null, "orcidid": "http://orcid.org/0000-0002-7096-8063", "typeEntity": "Person", "email": "oren.tzfadia@psb.vib-ugent.be"}], "biotoolsCURIE": "biotools:morph", "elixirPlatform": [], "elixirNode": [], "version": ["1"], "elixir_badge": 0, "homepage": "http://bioinformatics.psb.ugent.be/webtools/morph/", "function": [{"note": null, "input": [], "operation": [{"term": "Pathway or network analysis", "uri": "http://edamontology.org/operation_2497"}], "cmd": null, "output": []}], "lastUpdate": "2019-01-09T16:17:05Z", "otherID": [], "description": "Algorithm to associate candidate genes with a given target pathway. Unlike any other algorithm in plant sciences, this algorithm tests multiple combinations by learning how to choose among various forms of evidence (large scale data sets) to link genes to a specific target pathway.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "morph", "additionDate": "2016-06-21T12:25:33Z", "name": "MORPH", "license": null, "documentation": [], "maturity": "Mature", "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}