{
    "additionDate": "2019-11-14T19:53:12Z",
    "biotoolsCURIE": "biotools:partition_r",
    "biotoolsID": "partition_r",
    "confidence_flag": "tool",
    "description": "A surjective mapping approach for dimensionality reduction | Agglomerative Partitioning Framework for Dimension Reduction | A fast and flexible framework for agglomerative partitioning. 'partition' uses an approach called Direct-Measure-Reduce to create new variables that maintain the user-specified minimum level of information. Each reduced variable is also interpretable: the original variables map to one and only one variable in the reduced data set. 'partition' is flexible, as well: how variables are selected to reduce, how information loss is measured, and the way data is reduced can all be customized",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://cran.r-project.org/package=partition",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-05T09:21:53Z",
    "license": "MIT",
    "name": "Partition_R",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ661",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Large amounts of information generated by genomic technologies are accompanied by statistical and computational challenges due to redundancy, badly behaved data and noise. Dimensionality reduction (DR) methods have been developed to mitigate these challenges. However, many approaches are not scalable to large dimensions or result in excessive information loss. Results: The proposed approach partitions data into subsets of related features and summarizes each into one and only one new feature, thus defining a surjective mapping. A constraint on information loss determines the size of the reduced dataset. Simulation studies demonstrate that when multiple related features are associated with a response, this approach can substantially increase the number of true associations detected as compared to principal components analysis, non-negative matrix factorization or no DR. This increase in true discoveries is explained both by a reduced multiple-testing challenge and a reduction in extraneous noise. In an application to real data collected from metastatic colorectal cancer tumors, more associations between gene expression features and progression free survival and response to treatment were detected in the reduced than in the full untransformed dataset.",
                "authors": [
                    {
                        "name": "Millstein J."
                    },
                    {
                        "name": "Battaglin F."
                    },
                    {
                        "name": "Barrett M."
                    },
                    {
                        "name": "Cao S."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Stintzing S."
                    },
                    {
                        "name": "Heinemann V."
                    },
                    {
                        "name": "Lenz H.-J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Partition: A surjective mapping approach for dimensionality reduction"
            },
            "pmid": "31504178"
        }
    ],
    "toolType": [
        "Library"
    ],
    "validated": 1
}