{
    "accessibility": "Open access",
    "additionDate": "2024-03-07T16:05:39.448769Z",
    "biotoolsCURIE": "biotools:crost",
    "biotoolsID": "crost",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fangxd@big.ac.cn",
            "name": "Xiangdong Fang",
            "orcidid": "https://orcid.org/0000-0002-1335-3708",
            "typeEntity": "Person"
        },
        {
            "email": "baoym@big.ac.cn",
            "name": "Yiming Bao",
            "typeEntity": "Person"
        },
        {
            "email": "quhongzhu@big.ac.cn",
            "name": "Hongzhu Qu",
            "typeEntity": "Person"
        }
    ],
    "description": "Repository of spatial transcriptomics. CROST encompasses high-quality samples and houses 182 spatial transcriptomic datasets from diverse species, organs, and diseases, comprising 1033 sub-datasets and 48 043 tumor-related spatially variable genes (SVGs). Additionally, it encompasses a standardized spatial transcriptome data processing pipeline, integrates single-cell RNA sequencing deconvolution spatial transcriptomics data, and evaluates correlation, colocalization, intercellular communication, and biological function annotation analyses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://ngdc.cncb.ac.cn/crost",
    "lastUpdate": "2024-03-07T16:05:39.451275Z",
    "name": "CROST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAD782",
            "metadata": {
                "abstract": "The de v elopment of spatial transcriptome sequencing technology has re v olutioniz ed our comprehension of complex tissues and propelled life and health sciences into an era of spatial omics. Ho w e v er, the current a v ailability of databases for accessing and analyzing spatial transcriptomic data is limited. In response, w e ha v e established CR OS T ( https:// ngdc.cncb.ac.cn/ crost ), a comprehensive repository of spatial transcriptomics. CR OS T encompasses high-quality samples and houses 182 spatial transcriptomic datasets from diverse species, organs, and diseases, compris- ing 1033 sub-datasets and 48 043 tumor-related spatially variable genes (SVGs). Additionally, it encompasses a standardized spatial transcriptome data processing pipeline, integrates single-cell RNA sequencing decon v olution spatial transcriptomics data, and e v aluates correlation, colocal- ization, intercellular communication, and biological function annotation analy ses. Moreo v er, CR OS T integrates the transcriptome, epigenome, and genome to explore tumor-associated SVGs and provides a comprehensive understanding of their roles in cancer progression and prognosis. Furthermore, CR OS T pro vides tw o online tools, single-sample gene set enrichment analy sis and SpatialAP, f or users to annotate and analyze the uploaded spatial transcriptomics data. The user-friendly interface of CROST facilit ates browsing , searching , analyzing , visualizing , and download- ing desired inf ormation. Collectiv ely, CR OS T offers fresh and comprehensiv e insights into tissue str uct ure and a f oundation f or understanding multiple biological mechanisms in diseases, particularly in tumor tissues.",
                "authors": [
                    {
                        "name": "Bao Y."
                    },
                    {
                        "name": "Fang X."
                    },
                    {
                        "name": "Qu H."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Xiong Z."
                    }
                ],
                "citationCount": 4,
                "date": "2024-01-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CROST: a comprehensiv e reposit ory of spatial tr anscript omics"
            },
            "pmcid": "PMC10773281",
            "pmid": "37791883"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
