{
    "additionDate": "2019-11-14T18:13:31Z",
    "biotoolsCURIE": "biotools:PriorCD",
    "biotoolsID": "PriorCD",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hanjunwei1981@163.com",
            "name": "Junwei Han",
            "orcidid": "https://orcid.org/0000-0002-3276-0819",
            "typeEntity": "Person"
        },
        {
            "email": "liangcheng@hrbmu.edu.cn",
            "name": "Liang Cheng",
            "typeEntity": "Person"
        },
        {
            "email": "zyp19871208@126.com",
            "name": "Yunpeng Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Prioritization of candidate cancer drugs based on a drug functional similarity network constructed by integrating pathway activities and drug activities | Prioritizing Cancer Drugs for Interested Cancer | Prioritize candidate cancer drugs for drug repositioning based on the random walk with restart algorithm in a drug-drug functional similarity network. 1) We firstly constructed a drug-drug functional similarity network by integrating pathway activity and drug activity derived from the NCI-60 cancer cell lines. 2) Secondly, we calculated drug repurposing score according to a set of approved therapeutic drugs of interested cancer based on the random walk with restart algorithm in the drug-drug functional similarity network. 3) Finally, the permutation test was used to calculate the statistical significance level for the drug repurposing score",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/PriorCD",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-06T10:33:26Z",
    "license": "GPL-2.0",
    "name": "PriorCD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/1878-0261.12564",
            "metadata": {
                "abstract": "© 2019 The Authors. Published by FEBS Press and John Wiley & Sons Ltd.Due to the speed, efficiency, relative risk, and lower costs compared to traditional drug discovery, the prioritization of candidate drugs for repurposing against cancers of interest has attracted the attention of experts in recent years. Herein, we present a powerful computational approach, termed prioritization of candidate drugs (PriorCD), for the prioritization of candidate cancer drugs based on a global network propagation algorithm and a drug–drug functional similarity network constructed by integrating pathway activity profiles and drug activity profiles. This provides a new approach to drug repurposing by first considering the drug functional similarities at the pathway level. The performance of PriorCD in drug repurposing was evaluated by using drug datasets of breast cancer and ovarian cancer. Cross-validation tests on the drugs approved for the treatment of these cancers indicated that our approach can achieve area under receiver-operating characteristic curve (AUROC) values greater than 0.82. Furthermore, literature searches validated our results, and comparison with other classical gene-based repurposing methods indicated that our pathway-level PriorCD is comparatively more effective at prioritizing candidate drugs with similar therapeutic effects. We hope that our study will be of benefit to the field of drug discovery. In order to expand the usage of PriorCD, a freely available R-based package, PriorCD, has been developed to prioritize candidate anticancer drugs for drug repurposing.",
                "authors": [
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Di J."
                    },
                    {
                        "name": "Han J."
                    },
                    {
                        "name": "Han X."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Kong Q."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Sheng Y."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zheng B."
                    }
                ],
                "citationCount": 5,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Molecular Oncology",
                "title": "Prioritization of candidate cancer drugs based on a drug functional similarity network constructed by integrating pathway activities and drug activities"
            },
            "pmcid": "PMC6763777",
            "pmid": "31408580"
        }
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
