
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.sidowlab.org/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mendel.stanford.edu/SidowLab/downloads/MAPP/MAPP_Readme.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Protein variants",
                "uri": "http://edamontology.org/topic_3120"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We find that the degree of impairment of protein function by missense variants is predictable by comparative sequence analysis alone. The applicable range of impairment is not confined to binary predictions that distinguish normal from deleterious variants, but extends continuously from mild to severe effects. The accuracy of predictions is strongly dependent on sequence variation and is highest when diverse orthologs are available. High predictive accuracy is achieved by quantification of the physicochemical characteristics in each position of the protein, based on observed evolutionary variation. The strong relationship between physicochemical characteristics of a missense variant and impairment of protein function extends to human disease. By using four diverse proteins for which sufficient comparative sequence data are available, we show that grades of disease, or likelihood of developing cancer, correlate strongly with physicochemical constraint violation by causative amino acid variants. ©2005 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Stone E.A.",
                "Sidow A."
            ],
            "cit_count": 192,
            "doi": "10.1101/gr.3804205",
            "journal": "Genome Research",
            "title": "Physicochemical constraint violation by missense substitutions mediates impairment of protein function and disease severity",
            "type": "Primary",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mapp",
        "biotoolsID": "mapp",
        "description": "Considers the physicochemical variation present in a column of a protein sequence alignment and, on the basis of this variation, predicts the impact of all possible amino acid substitutions on the function of the protein.",
        "homepage": "http://mendel.stanford.edu/SidowLab/downloads/MAPP/index.html",
        "name": "MAPP"
    }
}