{
    "additionDate": "2024-01-23T10:11:01.935040Z",
    "biotoolsCURIE": "biotools:phavip",
    "biotoolsID": "phavip",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yannisun@cityu.edu.hk",
            "name": "Yanni Sun",
            "orcidid": "https://orcid.org/0000-0003-1373-8023",
            "typeEntity": "Person"
        }
    ],
    "description": "Phage virion protein classification based on chaos game representation and vision transformer.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://phage.ee.cityu.edu.hk/phavip/download"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://phage.ee.cityu.edu.hk/phavip",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-23T10:11:01.937918Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/KennthShang/PhaVIP"
        }
    ],
    "name": "PhaVIP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD229",
            "metadata": {
                "abstract": "Motivation: As viruses that mainly infect bacteria, phages are key players across a wide range of ecosystems. Analyzing phage proteins is indispensable for understanding phages' functions and roles in microbiomes. High-throughput sequencing enables us to obtain phages in different microbiomes with low cost. However, compared to the fast accumulation of newly identified phages, phage protein classification remains difficult. In particular, a fundamental need is to annotate virion proteins, the structural proteins, such as major tail, baseplate, etc. Although there are experimental methods for virion protein identification, they are too expensive or time-consuming, leaving a large number of proteins unclassified. Thus, there is a great demand to develop a computational method for fast and accurate phage virion protein (PVP) classification. Results: In this work, we adapted the state-of-the-art image classification model, Vision Transformer, to conduct virion protein classification. By encoding protein sequences into unique images using chaos game representation, we can leverage Vision Transformer to learn both local and global features from sequence \"images\". Our method, PhaVIP, has two main functions: classifying PVP and non-PVP sequences and annotating the types of PVP, such as capsid and tail. We tested PhaVIP on several datasets with increasing difficulty and benchmarked it against alternative tools. The experimental results show that PhaVIP has superior performance. After validating the performance of PhaVIP, we investigated two applications that can use the output of PhaVIP: phage taxonomy classification and phage host prediction. The results showed the benefit of using classified proteins over all proteins.",
                "authors": [
                    {
                        "name": "Peng C."
                    },
                    {
                        "name": "Shang J."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Tang X."
                    }
                ],
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PhaVIP: Phage VIrion Protein classification based on chaos game representation and Vision Transformer"
            },
            "pmcid": "PMC10311294",
            "pmid": "37387136",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
