{
    "accessibility": "Open access",
    "additionDate": "2022-04-24T21:29:41.907139Z",
    "biotoolsCURIE": "biotools:menotr",
    "biotoolsID": "menotr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "allucius@uab.edu",
            "name": "Aaron L. Lucius",
            "typeEntity": "Person"
        },
        {
            "name": "David S.Schneider"
        },
        {
            "name": "Nathaniel W.Scull"
        },
        {
            "name": "Zachariah M. Ingram"
        },
        {
            "name": "Zachariah M. Ingram"
        }
    ],
    "description": "Multi-start Evolutionary Nonlinear OpTimizeR (MENOTR).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ZachIngram/2021-MENOTR",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-04-24T21:29:41.909721Z",
    "license": "Not licensed",
    "name": "MENOTR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.BPC.2021.106682",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Parameter optimization or “data fitting” is a computational process that identifies a set of parameter values that best describe an experimental data set. Parameter optimization is commonly carried out using a computer program utilizing a non-linear least squares (NLLS) algorithm. These algorithms work by continuously refining a user supplied initial guess resulting in a systematic increase in the goodness of fit. A well-understood problem with this class of algorithms is that in the case of models with correlated parameters the optimized output parameters are initial guess dependent. This dependency can potentially introduce user bias into the resultant analysis. While many optimization programs exist, few address this dilemma. Here we present a data analysis tool, MENOTR, that is capable of overcoming the initial guess dependence in parameter optimization. Several case studies with published experimental data are presented to demonstrate the capabilities of this tool. The results presented here demonstrate how to effectively overcome the initial guess dependence of NLLS leading to greater confidence that the resultant optimized parameters are the best possible set of parameters to describe an experimental data set. While the optimization strategies implemented within MENOTR are not entirely novel, the application of these strategies to optimize parameters in kinetic and thermodynamic biochemical models is uncommon. MENOTR was designed to require minimal modification to accommodate a new model making it immediately accessible to researchers with a limited programming background. We anticipate that this toolbox can be used in a wide variety of data analysis applications. Prototype versions of this toolbox have been used in a number of published investigations already, as well as ongoing work with chemical-quenched flow, stopped-flow, and molecular tweezers data sets. Statement of significance: Non-linear least squares (NLLS) is a common form of parameter optimization in biochemistry kinetic and thermodynamic investigations These algorithms are used to fit experimental data sets and report corresponding parameter values. The algorithms are fast and able to provide good quality solutions for models involving few parameters. However, initial guess dependence is a well-known drawback of this optimization strategy that can introduce user bias. An alternative method of parameter optimization are genetic algorithms (GA). Genetic algorithms do not have an initial guess dependence but are slow at arriving at the best set of fit parameters. Here, we present MENOTR, a parameter optimization toolbox utilizing a hybrid GA/NLLS algorithm. The toolbox maximizes the strength of each strategy while minimizing the inherent drawbacks.",
                "authors": [
                    {
                        "name": "Ingram Z.M."
                    },
                    {
                        "name": "Lucius A.L."
                    },
                    {
                        "name": "Schneider D.S."
                    },
                    {
                        "name": "Scull N.W."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Biophysical Chemistry",
                "title": "Multi-start Evolutionary Nonlinear OpTimizeR (MENOTR): A hybrid parameter optimization toolbox"
            },
            "pmcid": "PMC8711798",
            "pmid": "34634538"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ]
}
