{
    "accessibility": "Open access",
    "additionDate": "2024-03-19T18:55:01.232966Z",
    "biotoolsCURIE": "biotools:plotnineseqsuite",
    "biotoolsID": "plotnineseqsuite",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "anshuili@usx.edu.cn",
            "name": "Anshui Li",
            "typeEntity": "Person"
        },
        {
            "email": "yxhuang@hznu.edu.cn",
            "name": "Yuexia Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "Python package for visualizing sequence data using ggplot2.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://caotianze.github.io/plotnineseqsuite/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-03-19T18:55:01.235566Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/caotianze/plotnineseqsuite"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/plotnineseqsuite"
        }
    ],
    "name": "plotnineSeqSuite",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-023-09677-8",
            "metadata": {
                "abstract": "Background: The visual sequence logo has been a hot area in the development of bioinformatics tools. ggseqlogo written in R language has been the most popular API since it was published. With the popularity of artificial intelligence and deep learning, Python is currently the most popular programming language. The programming language used by bioinformaticians began to shift to Python. Providing APIs in Python that are similar to those in R can reduce the learning cost of relearning a programming language. And compared to ggplot2 in R, drawing framework is not as easy to use in Python. The appearance of plotnine (ggplot2 in Python version) makes it possible to unify the programming methods of bioinformatics visualization tools between R and Python. Results: Here, we introduce plotnineSeqSuite, a new plotnine-based Python package provides a ggseqlogo-like API for programmatic drawing of sequence logos, sequence alignment diagrams and sequence histograms. To be more precise, it supports custom letters, color themes, and fonts. Moreover, the class for drawing layers is based on object-oriented design so that users can easily encapsulate and extend it. Conclusions: plotnineSeqSuite is the first ggplot2-style package to implement visualization of sequence -related graphs in Python. It enhances the uniformity of programmatic plotting between R and Python. Compared with tools appeared already, the categories supported by plotnineSeqSuite are much more complete. The source code of plotnineSeqSuite can be obtained on GitHub (https://github.com/caotianze/plotnineseqsuite) and PyPI (https://pypi.org/project/plotnineseqsuite), and the documentation homepage is freely available on GitHub at (https://caotianze.github.io/plotnineseqsuite/).",
                "authors": [
                    {
                        "name": "Cao T."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Li Q."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "plotnineSeqSuite: a Python package for visualizing sequence data using ggplot2 style"
            },
            "pmcid": "PMC10546746",
            "pmid": "37789265"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
