{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T22:34:18.581467Z",
    "biotoolsCURIE": "biotools:recsai",
    "biotoolsID": "recsai",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Philip.Kollmannsberger@uni-wuerzburg.de",
            "name": "Philip Kollmannsberger",
            "typeEntity": "Person"
        },
        {
            "name": "Dominic A. Helmerich"
        },
        {
            "name": "Dominik Boras"
        },
        {
            "name": "Markus Sauer"
        },
        {
            "name": "Sebastian Reinhard"
        }
    ],
    "description": "Recursive compressed sensing artificial intelligence for confocal lifetime localization microscopy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/super-resolution/ReCSAI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-13T22:34:18.583888Z",
    "license": "MIT",
    "name": "ReCSAI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05071-5",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Localization-based super-resolution microscopy resolves macromolecular structures down to a few nanometers by computationally reconstructing fluorescent emitter coordinates from diffraction-limited spots. The most commonly used algorithms are based on fitting parametric models of the point spread function (PSF) to a measured photon distribution. These algorithms make assumptions about the symmetry of the PSF and thus, do not work well with irregular, non-linear PSFs that occur for example in confocal lifetime imaging, where a laser is scanned across the sample. An alternative method for reconstructing sparse emitter sets from noisy, diffraction-limited images is compressed sensing, but due to its high computational cost it has not yet been widely adopted. Deep neural network fitters have recently emerged as a new competitive method for localization microscopy. They can learn to fit arbitrary PSFs, but require extensive simulated training data and do not generalize well. A method to efficiently fit the irregular PSFs from confocal lifetime localization microscopy combining the advantages of deep learning and compressed sensing would greatly improve the acquisition speed and throughput of this method. Results: Here we introduce ReCSAI, a compressed sensing neural network to reconstruct localizations for confocal dSTORM, together with a simulation tool to generate training data. We implemented and compared different artificial network architectures, aiming to combine the advantages of compressed sensing and deep learning. We found that a U-Net with a recursive structure inspired by iterative compressed sensing showed the best results on realistic simulated datasets with noise, as well as on real experimentally measured confocal lifetime scanning data. Adding a trainable wavelet denoising layer as prior step further improved the reconstruction quality. Conclusions: Our deep learning approach can reach a similar reconstruction accuracy for confocal dSTORM as frame binning with traditional fitting without requiring the acquisition of multiple frames. In addition, our work offers generic insights on the reconstruction of sparse measurements from noisy experimental data by combining compressed sensing and deep learning. We provide the trained networks, the code for network training and inference as well as the simulation tool as python code and Jupyter notebooks for easy reproducibility.",
                "authors": [
                    {
                        "name": "Boras D."
                    },
                    {
                        "name": "Helmerich D.A."
                    },
                    {
                        "name": "Kollmannsberger P."
                    },
                    {
                        "name": "Reinhard S."
                    },
                    {
                        "name": "Sauer M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ReCSAI: recursive compressed sensing artificial intelligence for confocal lifetime localization microscopy"
            },
            "pmcid": "PMC9732995",
            "pmid": "36482307"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
