{"credit":[{"email":"Arnaud.Becheler@egce.cnrs-gif.fr","name":"Arnaud Becheler","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/Becheler/quetzal/blob/master/README.md"}],"download":[{"type":"Source code","url":"https://github.com/Becheler/quetzal/releases"}],"labels":{"accessibility":["Restricted access"],"cost":"Free of charge","language":["C++"],"license":"GPL-3.0","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Ecology","uri":"http://edamontology.org/topic_0610"},{"term":"Environmental science","uri":"http://edamontology.org/topic_3855"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/Becheler/quetzal"},{"type":"ISSUE_TRACKER","url":"https://github.com/Becheler/quetzal/issues"}],"publication":[{"abstract":"© 2019 John Wiley & Sons LtdGenetic samples can be used to understand and predict the behaviour of species living in a fragmented and temporally changing environment. In this regard, models of coalescence conditioned to an environment through an explicit modelling of population growth and migration have been developed in recent years, and simulators implementing these models have been developed, enabling biologists to estimate parameters of interest with Approximate Bayesian Computation techniques. However, model choice remains limited, and developing new coalescence simulators is extremely time consuming because code re-use is limited. We present Quetzal, a C++ library composed of re-usable components, which is sufficiently general to efficiently implement a wide range of spatially explicit coalescence-based environmental models of population genetics and to embed the simulation in an Approximate Bayesian Computation framework. Quetzal is not a simulation program, but a toolbox for programming simulators aimed at the community of scientific coders and research software engineers in molecular ecology and phylogeography. This new code resource is open-source and available at https://becheler.github.io/pages/quetzal.html along with other documentation resources.","authors":["Becheler A.","Coron C.","Dupas S."],"cit_count":0,"doi":"10.1111/1755-0998.12992","journal":"Molecular Ecology Resources","pmid":"30637945","title":"The Quetzal Coalescence template library: A C++ programmers resource for integrating distributional, demographic and coalescent models","type":"Primary","year":"2019-05-01"}],"summary":{"biotoolsCURIE":"biotools:Quetzal","biotoolsID":"Quetzal","description":"Collection of C++ code snippets, that can be picked and combined to build complex, spatially explicit population genetics simulators and inference frameworks.","homepage":"https://becheler.github.io/pages/quetzal.html","name":"Quetzal"}}