{
    "additionDate": "2018-07-30T11:40:15Z",
    "biotoolsCURIE": "biotools:aptablocks",
    "biotoolsID": "aptablocks",
    "credit": [
        {
            "email": "przytyck@ncbi.nlm.nih.gov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Design RNA complexes that hybridize via sticky bridges.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wyjhxq/AptaBlocks",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "AptaBlocks",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/NAR/GKY577",
            "metadata": {
                "abstract": "RNA-based therapeutics, i.e. the utilization of synthetic RNA molecules to alter cellular functions, have the potential to address targets which are currently out of scope for traditional drug design pipelines. This potential however hinges on the ability to selectively deliver and internalize therapeutic RNAs into cells of interest. Cell internalizing RNA aptamers selected against surface receptors and discriminatively expressed on target cells hold particular promise as suitable candidates for such delivery agents. Specifically, these aptamers can be combined with a therapeutic cargo and facilitate internalization of the cargo into the cell of interest. A recently proposed method to obtain such aptamer-cargo constructs employs a double-stranded “sticky bridge\" where the complementary strands constituting the bridge are conjugated with the aptamer and the cargo respectively. The design of appropriate sticky bridge sequences however has proven highly challenging given the structural and functional constraints imposed on them during synthesis and administration. These include, but are not limited to, guaranteed formation and stability of the complex, non-interference with the aptamer or the cargo, as well as the prevention of spurious aggregation of the molecules during incubation. In order to address these issues, we have developed AptaBlocks - a computational method to design RNA complexes that hybridize via sticky bridges. The effectiveness of our approach has been verified computationally, and experimentally in the context of drug delivery to pancreatic cancer cells. Importantly, AptaBlocks is a general method for the assembly of nucleic acid systems that, in addition to designing of RNA-based drug delivery systems, can be used in other applications of RNA nanotechnology. AptaBlocks is available at https://github.com/wyjhxq/AptaBlocks.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Hoinka J."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Adamus T."
                    },
                    {
                        "name": "Swiderski P."
                    },
                    {
                        "name": "Przytycka T.M."
                    }
                ],
                "citationCount": 3,
                "date": "2018-09-19T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Aptablocks: Designing RNA complexes and accelerating RNA-based drug delivery systems"
            },
            "pmid": "29986050"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}