{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T23:04:07.885124Z",
    "biotoolsCURIE": "biotools:neuroppred-svm",
    "biotoolsID": "neuroppred-svm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Shuyu Wang"
        },
        {
            "name": "Xiang Li"
        },
        {
            "name": "Yinbo Liu"
        },
        {
            "name": "Yufeng Liu"
        },
        {
            "name": "Xiaolei Zhu",
            "orcidid": "https://orcid.org/0000-0002-1967-2806"
        }
    ],
    "description": "A New Model for Predicting Neuropeptides Based on Embeddings of BERT.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/liuyf-a/NeuroPpred-SVM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:53:32.797825Z",
    "license": "Not licensed",
    "name": "NeuroPpred-SVM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.2c00363",
            "metadata": {
                "abstract": "Neuropeptides play pivotal roles in different physiological processes and are related to different kinds of diseases. Identification of neuropeptides is of great benefit for studying the mechanism of these physiological processes and the treatment of neurological disorders. Several state-of-the-art neuropeptide predictors have been developed by using a two-layer stacking ensemble algorithm. Although the two-layer stacking ensemble algorithm can improve the feature representability, these models are complex, which are not as efficient as the models based on one classifier. In this study, we proposed a new model, NeuroPpred-SVM, to predict neuropeptides based on the embeddings of Bidirectional Encoder Representations from Transformers and other sequential features by using a support vector machine (SVM). The experimental results indicate that our model achieved a cross-validation area under the receiver operating characteristic (AUROC) curve of 0.969 on the training data set and an AUROC of 0.966 on the independent test set. By comparing our model with the other four state-of-the-art models including NeuroPIpred, PredNeuroP, NeuroPpred-Fuse, and NeuroPpred-FRL on the independent test set, our model achieved the highest AUROC, Matthews correlation coefficient, accuracy, and specificity, which indicate that our model outperforms the existing models. We believed that NeuroPpred-SVM could be a useful tool for identifying neuropeptides with high accuracy and low cost. The data sets and Python code are available at https://github.com/liuyf-a/NeuroPpred-SVM.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "citationCount": 6,
                "date": "2023-03-03T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "NeuroPpred-SVM: A New Model for Predicting Neuropeptides Based on Embeddings of BERT"
            },
            "pmid": "36749151"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
