{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T13:59:13Z",
    "biotoolsCURIE": "biotools:DNAscan",
    "biotoolsID": "DNAscan",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "comp-bio@kcl.ac.uk",
            "name": "KCL IoPPN: NIHR BRC-MH Bioinformatics Group",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://core.brc.iop.kcl.ac.uk/"
        },
        {
            "name": "Dr Alfredo Iacoangeli",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Dr Stephen J Newhouse",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Personal computer compatible NGS analysis, annotation and visualisation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/KHP-Informatics/DNAscan/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KHP-Informatics/DNAscan",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/KHP-Informatics/DNAscan/issues"
        }
    ],
    "maturity": "Mature",
    "name": "DNAscan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2791-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Next Generation Sequencing (NGS) is a commonly used technology for studying the genetic basis of biological processes and it underpins the aspirations of precision medicine. However, there are significant challenges when dealing with NGS data. Firstly, a huge number of bioinformatics tools for a wide range of uses exist, therefore it is challenging to design an analysis pipeline. Secondly, NGS analysis is computationally intensive, requiring expensive infrastructure, and many medical and research centres do not have adequate high performance computing facilities and cloud computing is not always an option due to privacy and ownership issues. Finally, the interpretation of the results is not trivial and most available pipelines lack the utilities to favour this crucial step. Results: We have therefore developed a fast and efficient bioinformatics pipeline that allows for the analysis of DNA sequencing data, while requiring little computational effort and memory usage. DNAscan can analyse a whole exome sequencing sample in 1 h and a 40x whole genome sequencing sample in 13 h, on a midrange computer. The pipeline can look for single nucleotide variants, small indels, structural variants, repeat expansions and viral genetic material (or any other organism). Its results are annotated using a customisable variety of databases and are available for an on-the-fly visualisation with a local deployment of the gene.iobio platform. DNAscan is implemented in Python. Its code and documentation are available on GitHub: https://github.com/KHP-Informatics/DNAscan. Instructions for an easy and fast deployment with Docker and Singularity are also provided on GitHub. Conclusions: DNAscan is an extremely fast and computationally efficient pipeline for analysis, visualization and interpretation of NGS data. It is designed to provide a powerful and easy-to-use tool for applications in biomedical research and diagnostic medicine, at minimal computational cost. Its comprehensive approach will maximise the potential audience of users, bringing such analyses within the reach of non-specialist laboratories, and those from centres with limited funding available.",
                "authors": [
                    {
                        "name": "Al Khleifat A."
                    },
                    {
                        "name": "Al-Chalabi A."
                    },
                    {
                        "name": "Dobson R.J."
                    },
                    {
                        "name": "Iacoangeli A."
                    },
                    {
                        "name": "Jones A.R."
                    },
                    {
                        "name": "Morgan S.L."
                    },
                    {
                        "name": "Newhouse S.J."
                    },
                    {
                        "name": "Pittman A."
                    },
                    {
                        "name": "Shatunov A."
                    },
                    {
                        "name": "Sproviero W."
                    }
                ],
                "citationCount": 4,
                "date": "2019-04-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DNAscan: Personal computer compatible NGS analysis, annotation and visualisation"
            },
            "pmcid": "PMC6487045",
            "pmid": "31029080",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
