
{
    "credit": [
        {
            "email": "avi.maayan@mssm.edu",
            "name": "Avi Ma’ayan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://icahn.mssm.edu/research/labs/maayan-laboratory"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.maayanlab.net/N2C/#.We7nBBO0Nol"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/network2canvas-network-visualization-on-a-canvas-with-enrichment-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Networks are vital to computational systems biology research, but visualizing them is a challenge. For networks larger than ∼100 nodes and ∼200 links, ball-and-stick diagrams fail to convey much information. To address this, we developed Network2Canvas (N2C), a web application that provides an alternative way to view networks. N2C visualizes networks by placing nodes on a square toroidal canvas. The network nodes are clustered on the canvas using simulated annealing to maximize local connections where a node's brightness is made proportional to its local fitness. The interactive canvas is implemented in HyperText Markup Language (HTML)5 with the JavaScript library Data-Driven Documents (D3). We applied N2C to visualize 30 canvases made from human and mouse gene-set libraries and 6 canvases made from the Food and Drug Administration (FDA)-approved drug-set libraries. Given lists of genes or drugs, enriched terms are highlighted on the canvases, and their degree of clustering is computed. Because N2C produces visual patterns of enriched terms on canvases, a trained eye can detect signatures instantly. In summary, N2C provides a new flexible method to visualize large networks and can be used to perform and visualize gene-set and drug-set enrichment analyses.Availability: N2C is freely available at http://www.maayanlab.net/N2C and is open source.Contact: Supplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com.",
            "authors": [
                "Tan C.M.",
                "Chen E.Y.",
                "Dannenfelser R.",
                "Clark N.R.",
                "Ma'Ayan A."
            ],
            "cit_count": 24,
            "journal": "Bioinformatics",
            "pmid": "23749960",
            "title": "Network2Canvas: Network visualization on a canvas with enrichment analysis",
            "year": "2013-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:network2canvas",
        "biotoolsID": "network2canvas",
        "description": "Web application that provides an alternative way to view networks. N2C visualizes networks by placing nodes on a square toroidal canvas.",
        "homepage": "http://www.maayanlab.net/N2C",
        "name": "Network2Canvas"
    }
}