{
    "additionDate": "2021-01-18T10:25:09Z",
    "biotoolsCURIE": "biotools:deeptl-ubi",
    "biotoolsID": "deeptl-ubi",
    "confidence_flag": "tool",
    "description": "DeepTL-Ubi is a novel deep transfer learning method for effectively predicting ubiquitination sites of multiple species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "https://github.com/USTC-HIlab/DeepTL-Ubi",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T15:31:03Z",
    "name": "DeepTL-Ubi",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2020.08.003",
            "metadata": {
                "abstract": "© 2020Ubiquitination is one of the most important post-translational modifications which involves in many biological processes. Because mass spectrometry-based ubiquitination site identification methods are costly and time consuming, computational approaches provide alternative ways to the determination of ubiquitination sites. Although machine learning based methods can effectively predict ubiquitination sites, most of them rely on feature engineering, which may lead to bias or incomplete feature. Recently, deep learning has achieved great success in prediction of post-translational modification sites. However, deep learning method has not been explored in the prediction of species-specific ubiquitination sites. In this paper, we propose a novel transfer deep learning method, named DeepTL-Ubi, for predicting ubiquitination sites of multiple species. DeepTL-Ubi enhances the performance of species-specific ubiquitination site prediction by transferring common knowledge from the large amount of human data to other species, which effectively solves the problem of insufficient training data for other species. Besides, we train and test our model by collecting ubiquitination sites for multiple species from several sources. Experiment results show that our transfer learning technique can effectively improve the predictive performance of species with small sample size, and DeepTL-Ubi is superior to existing tools in many species. The source code and training data of DeepTL-Ubi are publicly deposited at https://github.com/USTC-HIlab/DeepTL-Ubi.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Zhao X.-M."
                    },
                    {
                        "name": "Wang M."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods",
                "title": "DeepTL-Ubi: A novel deep transfer learning method for effectively predicting ubiquitination sites of multiple species"
            },
            "pmid": "32791338"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}