{
    "additionDate": "2017-01-13T13:13:36Z",
    "biotoolsCURIE": "biotools:atlas_suite",
    "biotoolsID": "atlas_suite",
    "credit": [
        {
            "email": "fyu@bcm.edu",
            "name": "Fuli Yu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Suite of variant analysis tools specializing in the separation of true SNPs and insertions and deletions (indels) from sequencing and mapping errors in Whole Exome Capture Sequecing (WECS) data. SNPs may be called using the Atlas-SNP2 application and indels may be called using the Atlas-Indel2 application.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.hgsc.bcm.edu/software/atlas-2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://www.hgsc.bcm.edu/software/atlas-2",
    "language": [
        "Ruby",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "Atlas Suite",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Whole exome capture sequencing allows researchers to cost-effectively sequence the coding regions of the genome. Although the exome capture sequencing methods have become routine and well established, there is currently a lack of tools specialized for variant calling in this type of data.Results: Using statistical models trained on validated whole-exome capture sequencing data, the Atlas2 Suite is an integrative variant analysis pipeline optimized for variant discovery on all three of the widely used next generation sequencing platforms (SOLiD, Illumina, and Roche 454). The suite employs logistic regression models in conjunction with user-adjustable cutoffs to accurately separate true SNPs and INDELs from sequencing and mapping errors with high sensitivity (96.7%).Conclusion: We have implemented the Atlas2 Suite and applied it to 92 whole exome samples from the 1000 Genomes Project. The Atlas2 Suite is available for download at http://sourceforge.net/projects/atlas2/. In addition to a command line version, the suite has been integrated into the Genboree Workbench, allowing biomedical scientists with minimal informatics expertise to remotely call, view, and further analyze variants through a simple web interface. The existing genomic databases displayed via the Genboree browser also streamline the process from variant discovery to functional genomics analysis, resulting in an off-the-shelf toolkit for the broader community. © 2012 Challis et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Challis D."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Evani U.S."
                    },
                    {
                        "name": "Jackson A.R."
                    },
                    {
                        "name": "Paithankar S."
                    },
                    {
                        "name": "Coarfa C."
                    },
                    {
                        "name": "Milosavljevic A."
                    },
                    {
                        "name": "Gibbs R.A."
                    },
                    {
                        "name": "Yu F."
                    }
                ],
                "citationCount": 152,
                "date": "2012-01-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "An integrative variant analysis suite for whole exome next-generation sequencing data"
            },
            "pmid": "22239737"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}