{
    "additionDate": "2021-03-19T08:33:51Z",
    "biotoolsCURIE": "biotools:openep",
    "biotoolsID": "openep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "emocskos@dc.uba.ar",
            "name": "Esteban Mocskos",
            "typeEntity": "Person"
        },
        {
            "email": "marshalg@retina.ar",
            "name": "Guillermo Marshall",
            "typeEntity": "Person"
        }
    ],
    "description": "OpenEP is an open-source simulator for electroporation-based tumor treatments.\n\nThe application of short electric pulses to biological tissues have spread across several scientific and industrial sectors, such as medical, food processing, biotechnology, and environmental science.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LSC-UBA/OpenEP",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-26T12:43:08Z",
    "name": "OpenEP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-79858-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Electroporation (EP), the increase of cell membrane permeability due to the application of electric pulses, is a universal phenomenon with a broad range of applications. In medicine, some of the foremost EP-based tumor treatments are electrochemotherapy (ECT), irreversible electroporation, and gene electrotransfer (GET). The electroporation phenomenon is explained as the formation of cell membrane pores when a transmembrane cell voltage reaches a threshold value. Predicting the outcome of an EP-based tumor treatment consists of finding the electric field distribution with an electric threshold value covering the tumor (electroporated tissue). Threshold and electroporated tissue are also a function of the number of pulses, constituting a complex phenomenon requiring mathematical modeling. We present OpenEP, an open-source specific purpose simulator for EP-based tumor treatments, modeling among other variables, threshold, and electroporated tissue variations in time. Distributed under a free/libre user license, OpenEP allows the customization of tissue type; electrode geometry and material; pulse type, intensity, length, and frequency. OpenEP facilitates the prediction of an optimal EP-based protocol, such as ECT or GET, defined as the critical pulse dosage yielding maximum electroporated tissue with minimal damage. OpenEP displays a highly efficient shared memory implementation by taking advantage of parallel resources; this permits a rapid prediction of optimal EP-based treatment efficiency by pulse number tuning.",
                "authors": [
                    {
                        "name": "Marino M."
                    },
                    {
                        "name": "Lujan E."
                    },
                    {
                        "name": "Mocskos E."
                    },
                    {
                        "name": "Marshall G."
                    }
                ],
                "citationCount": 3,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "OpenEP: an open-source simulator for electroporation-based tumor treatments"
            },
            "pmcid": "PMC7809294",
            "pmid": "33446750"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        }
    ]
}