{
    "additionDate": "2019-11-14T19:43:45Z",
    "biotoolsCURIE": "biotools:M-GCTA",
    "biotoolsID": "M-GCTA",
    "confidence_flag": "tool",
    "description": "Introducing M-GCTA a Software Package to Estimate Maternal (or Paternal) Genetic Effects on Offspring Phenotypes | *This document is under developement. Your ideas and suggestions are always welcome! | M-GCTA is an user-friendly software package, which can be used to estimate the proportion of phenotypic variance due to tagged maternal (or paternal) and offspring genetic effects on offspring phenotypes using large studies where genome-wide genotype data are available on mother- (or father-) offspring pairs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/uqzqiao/M-GCTA",
    "lastUpdate": "2020-12-22T13:41:38Z",
    "name": "M-GCTA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S10519-019-09969-4",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.There is increasing interest within the genetics community in estimating the relative contribution of parental genetic effects on offspring phenotypes. Here we describe the user-friendly M-GCTA software package used to estimate the proportion of phenotypic variance explained by maternal (or alternatively paternal) and offspring genotypes on offspring phenotypes. The tool requires large studies where genome-wide genotype data are available on mother- (or alternatively father-) offspring pairs. The software includes several options for data cleaning and quality control, including the ability to detect and automatically remove cryptically related pairs of individuals. It also allows users to construct genetic relationship matrices indexing genetic similarity across the genome between parents and offspring, enabling the estimation of variance explained by maternal (or alternatively paternal) and offspring genetic effects. We evaluated the performance of the software using a range of data simulations and estimated the computing time and memory requirements. We demonstrate the use of M-GCTA on previously analyzed birth weight data from two large population based birth cohorts, the Avon Longitudinal Study of Parents and Children (ALSPAC) and the Norwegian Mother and Child Cohort Study (MoBa). We show how genetic variation in birth weight is predominantly explained by fetal genetic rather than maternal genetic sources of variation.",
                "authors": [
                    {
                        "name": "Qiao Z."
                    },
                    {
                        "name": "Zheng J."
                    },
                    {
                        "name": "Helgeland O."
                    },
                    {
                        "name": "Vaudel M."
                    },
                    {
                        "name": "Johansson S."
                    },
                    {
                        "name": "Njolstad P.R."
                    },
                    {
                        "name": "Smith G.D."
                    },
                    {
                        "name": "Warrington N.M."
                    },
                    {
                        "name": "Evans D.M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Behavior Genetics",
                "title": "Introducing M-GCTA a Software Package to Estimate Maternal (or Paternal) Genetic Effects on Offspring Phenotypes"
            },
            "pmid": "31493278"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}