{
    "additionDate": "2017-03-25T13:09:35Z",
    "biotoolsCURIE": "biotools:genemania",
    "biotoolsID": "genemania",
    "credit": [
        {
            "email": "genemania-discuss@googlegroups.com",
            "name": "GeneMANIA team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web interface for generating hypotheses about gene function, analyzing gene lists and prioritizing genes for functional assays. Users input a query list for extension and weighting with functionally similar genes. Six organisms are supported.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pages.genemania.org/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.genemania.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-11T19:17:50Z",
    "name": "GeneMANIA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "GeneMANIA (http://www.genemania.org) is a flexible, user-friendly web interface for generating hypotheses about gene function, analyzing gene lists and prioritizing genes for functional assays. Given a query list, GeneMANIA extends the list with functionally similar genes that it identifies using available genomics and proteomics data. GeneMANIA also reports weights that indicate the predictive value of each selected data set for the query. Six organisms are currently supported (Arabidopsis thaliana, Caenorhabditis elegans, Drosophila melanogaster, Mus musculus, Homo sapiens and Saccharomyces cerevisiae) and hundreds of data sets have been collected from GEO, BioGRID, Pathway Commons and I2D, as well as organism-specific functional genomics data sets. Users can select arbitrary subsets of the data sets associated with an organism to perform their analyses and can upload their own data sets to analyze. The GeneMANIA algorithm performs as well or better than other gene function prediction methods on yeast and mouse benchmarks. The high accuracy of the GeneMANIA prediction algorithm, an intuitive user interface and large database make GeneMANIA a useful tool for any biologist. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Warde-Farley D."
                    },
                    {
                        "name": "Donaldson S.L."
                    },
                    {
                        "name": "Comes O."
                    },
                    {
                        "name": "Zuberi K."
                    },
                    {
                        "name": "Badrawi R."
                    },
                    {
                        "name": "Chao P."
                    },
                    {
                        "name": "Franz M."
                    },
                    {
                        "name": "Grouios C."
                    },
                    {
                        "name": "Kazi F."
                    },
                    {
                        "name": "Lopes C.T."
                    },
                    {
                        "name": "Maitland A."
                    },
                    {
                        "name": "Mostafavi S."
                    },
                    {
                        "name": "Montojo J."
                    },
                    {
                        "name": "Shao Q."
                    },
                    {
                        "name": "Wright G."
                    },
                    {
                        "name": "Bader G.D."
                    },
                    {
                        "name": "Morris Q."
                    }
                ],
                "citationCount": 940,
                "date": "2010-06-21T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The GeneMANIA prediction server: Biological network integration for gene prioritization and predicting gene function"
            },
            "pmid": "20576703"
        },
        {
            "metadata": {
                "abstract": "Summary: The GeneMANIA Cytoscape plugin brings fast gene function prediction capabilities to the desktop. GeneMANIA identifies the most related genes to a query gene set using a guilt-by-association approach. The plugin uses over 800 networks from six organisms and each related gene is traceable to the source network used to make the prediction. Users may add their own interaction networks and expression profile data to complement or override the default data. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Montojo J."
                    },
                    {
                        "name": "Zuberi K."
                    },
                    {
                        "name": "Rodriguez H."
                    },
                    {
                        "name": "Kazi F."
                    },
                    {
                        "name": "Wright G."
                    },
                    {
                        "name": "Donaldson S.L."
                    },
                    {
                        "name": "Morris Q."
                    },
                    {
                        "name": "Bader G.D."
                    }
                ],
                "citationCount": 243,
                "date": "2010-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GeneMANIA cytoscape plugin: Fast gene function predictions on the desktop"
            },
            "pmid": "20926419"
        },
        {
            "metadata": {
                "abstract": "GeneMANIA (http://www.genemania.org) is a flexible user-friendly web interface for generating hypotheses about gene function, analyzing gene lists and prioritizing genes for functional assays. Given a query gene list, GeneMANIA extends the list with functionally similar genes that it identifies using available genomics and proteomics data. GeneMANIA also reports weights that indicate the predictive value of each selected data set for the query. GeneMANIA can also be used in a function prediction setting: given a query gene, GeneMANIA finds a small set of genes that are most likely to share function with that gene based on their interactions with it. Enriched Gene Ontology categories among this set can sometimes point to the function of the gene. Seven organisms are currently supported (Arabidopsis thaliana, Caenorhabditis elegans, Drosophila melanogaster, Mus musculus, Homo sapiens, Rattus norvegicus and Saccharomyces cerevisiae), and hundreds of data sets have been collected from GEO, BioGRID, IRefIndex and I2D, as well as organism-specific functional genomics data sets. Users can customize their search by selecting specific data sets to query and by uploading their own data sets to analyze.",
                "authors": [
                    {
                        "name": "Zuberi K."
                    },
                    {
                        "name": "Franz M."
                    },
                    {
                        "name": "Rodriguez H."
                    },
                    {
                        "name": "Montojo J."
                    },
                    {
                        "name": "Lopes C.T."
                    },
                    {
                        "name": "Bader G.D."
                    },
                    {
                        "name": "Morris Q."
                    }
                ],
                "citationCount": 184,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "GeneMANIA prediction server 2013 update."
            },
            "pmid": "23794635"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}