{
    "accessibility": "Open access",
    "additionDate": "2017-08-02T10:04:58Z",
    "biotoolsCURIE": "biotools:progenomes",
    "biotoolsID": "progenomes",
    "collectionID": [
        "de.NBI"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "European Molecular Biology Laboratory (EMBL)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.embl.de/"
        },
        {
            "name": "HD-HuB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.hd-hub.de/"
        },
        {
            "email": "zeller@embl.de",
            "name": "Georg Zeller",
            "orcidid": "https://orcid.org/0000-0003-1429-7485",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "danielrmende@gmail.com",
            "name": "Daniel Mende",
            "orcidid": "http://orcid.org/0000-0001-6831-4557",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "proGenomes is a database providing consistent taxonomic and functional annotations for 87,920 bacterial and archaeal genomes belonging to over 12,000 species. These can be interactively explored and downloaded, whereby subsets can be customized, e.g. taxonomic clades, representatives of each species or habitat-specific organisms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://progenomes.embl.de/other.cgi"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://progenomes.embl.de/",
    "lastUpdate": "2020-10-07T22:49:29Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "proGenomes",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hdhub",
    "publication": [
        {
            "doi": "10.1093/nar/gkw989",
            "metadata": {
                "abstract": "© 2016 The Author(s).The availability of microbial genomes has opened many new avenues of research within microbiology. This has been driven primarily by comparative genomics approaches, which rely on accurate and consistent characterization of genomic sequences. It is nevertheless difficult to obtain consistent taxonomic and integrated functional annotations for defined prokaryotic clades. Thus, we developed proGenomes, a resource that provides user-friendly access to currently 25 038 high-quality genomes whose sequences and consistent annotations can be retrieved individually or by taxonomic clade. These genomes are assigned to 5306 consistent and accurate taxonomic species clusters based on previously established methodology. proGenomes also contains functional information for almost 80 million protein-coding genes, including a comprehensive set of general annotations and more focused annotations for carbohydrate-active enzymes and antibiotic resistance genes. Additionally, broad habitat information is provided for many genomes. All genomes and associated information can be downloaded by user-selected clade or multiple habitat-specific sets of representative genomes. We expect that the availability of high-quality genomes with comprehensive functional annotations will promote advances in clinical microbial genomics, functional evolution and other subfields of microbiology. proGenomes is available at http://progenomes.embl.de.",
                "authors": [
                    {
                        "name": "Mende D.R."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Li S.S."
                    },
                    {
                        "name": "Forslund K."
                    },
                    {
                        "name": "Sunagawa S."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 38,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProGenomes: A resource for consistent functional and taxonomic annotations of prokaryotic genomes"
            },
            "pmcid": "PMC5210662",
            "pmid": "28053165"
        },
        {
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Microbiology depends on the availability of annotated microbial genomes for many applications. Comparative genomics approaches have been a major advance, but consistent and accurate annotations of genomes can be hard to obtain. In addition, newer concepts such as the pan-genome concept are still being implemented to help answer biological questions. Hence, we present proGenomes2, which provides 87 920 high-quality genomes in a user-friendly and interactive manner. Genome sequences and annotations can be retrieved individually or by taxonomic clade. Every genome in the database has been assigned to a species cluster and most genomes could be accurately assigned to one or multiple habitats. In addition, general functional annotations and specific annotations of antibiotic resistance genes and single nucleotide variants are provided. In short, proGenomes2 provides threefold more genomes, enhanced habitat annotations, updated taxonomic and functional annotation and improved linkage to the NCBI BioSample database. The database is available at http://progenomes.embl.de/.",
                "authors": [
                    {
                        "name": "Mende D.R."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Maistrenko O.M."
                    },
                    {
                        "name": "Schmidt T.S.B."
                    },
                    {
                        "name": "Milanese A."
                    },
                    {
                        "name": "Paoli L."
                    },
                    {
                        "name": "Hernandez-Plaza A."
                    },
                    {
                        "name": "Orakov A.N."
                    },
                    {
                        "name": "Forslund S.K."
                    },
                    {
                        "name": "Sunagawa S."
                    },
                    {
                        "name": "Zeller G."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Coelho L.P."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProGenomes2: An improved database for accurate and consistent habitat, taxonomic and functional annotations of prokaryotic genomes"
            },
            "pmid": "31647096",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}