{
    "additionDate": "2021-01-18T09:15:48Z",
    "biotoolsCURIE": "biotools:isom-gsn",
    "biotoolsID": "isom-gsn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lrueda@uwindsor.ca",
            "name": "Luis Rueda",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrative approach for transforming multi-omic data into gene similarity networks via self-organizing maps.\n\nTo replicate the algorithm use the following steps:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NaziaFatima/iSOM_GSN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T10:33:37Z",
    "name": "iSOM-GSN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA500",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: One of the main challenges in applying graph convolutional neural networks (CNNs) on gene-interaction data is the lack of understanding of the vector space to which they belong, and also the inherent difficulties involved in representing those interactions on a significantly lower dimension, viz Euclidean spaces. The challenge becomes more prevalent when dealing with various types of heterogeneous data. We introduce a systematic, generalized method, called iSOM-GSN, used to transform 'multi-omic' data with higher dimensions onto a 2D grid. Afterwards, we apply a CNN to predict disease states of various types. Based on the idea of Kohonen's self-organizing map, we generate a 2D grid for each sample for a given set of genes that represent a gene similarity network. Results: We have tested the model to predict breast and prostate cancer using gene expression, DNA methylation and copy number alteration. Prediction accuracies in the 94-98% range were obtained for tumor stages of breast cancer and calculated Gleason scores of prostate cancer with just 14 input genes for both cases. The scheme not only outputs nearly perfect classification accuracy, but also provides an enhanced scheme for representation learning, visualization, dimensionality reduction and interpretation of multi-omic data. Availability and implementation: The source code and sample data are available via a Github project at https://github.com/NaziaFatima/iSOM_GSN.",
                "authors": [
                    {
                        "name": "Fatima N."
                    },
                    {
                        "name": "Rueda L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "iSOM-GSN: An integrative approach for transforming multi-omic data into gene similarity networks via self-organizing maps"
            },
            "pmid": "32407457"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}