{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"email":"support@genouest.org","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://webservices.genouest.org/opal2/dashboard?command=docs"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"}]}],"labels":{"collectionID":["GenOuest"],"toolType":["Web service"],"topic":[{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/2731"}],"publication":[{"abstract":"HMMER is a software suite for protein sequence similarity searches using probabilistic methods. Previously, HMMER has mainly been available only as a computationally intensive UNIX command-line tool, restricting its use. Recent advances in the software, HMMER3, have resulted in a 100-fold speed gain relative to previous versions. It is now feasible to make efficient profile hidden Markov model (profile HMM) searches via the web. A HMMER web server (http://hmmer.janelia.org) has been designed and implemented such that most protein database searches return within a few seconds. Methods are available for searching either a single protein sequence, multiple protein sequence alignment or profile HMM against a target sequence database, and for searching a protein sequence against Pfam. The web server is designed to cater to a range of different user expertise and accepts batch uploading of multiple queries at once. All search methods are also available as RESTful web services, thereby allowing them to be readily integrated as remotely executed tasks in locally scripted workflows. We have focused on minimizing search times and the ability to rapidly display tabular results, regardless of the number of matches found, developing graphical summaries of the search results to provide quick, intuitive appraisement of them. © 2011 The Author(s).","authors":["Finn R.D.","Clements J.","Eddy S.R."],"cit_count":1670,"doi":"10.1093/nar/gkr367","journal":"Nucleic Acids Research","title":"HMMER web server: Interactive sequence similarity searching","type":"Primary","year":"2011-07-01"}],"summary":{"biotoolsCURIE":"biotools:hmmfetch_genouest","biotoolsID":"hmmfetch_genouest","description":"Retrieve profile HMM(s) from a file.","homepage":"http://webservices.genouest.org/opal2/dashboard?command=docs","name":"hmmfetch (genouest)","version":["1"]}}