{
    "additionDate": "2017-03-27T07:56:33Z",
    "biotoolsCURIE": "biotools:hrtbldb",
    "biotoolsID": "hrtbldb",
    "credit": [
        {
            "email": "jinv@uthscsa.edu",
            "name": "Victor Jin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Hormone Receptor Target Binding Loci, HRTBLDb database contains hormone receptor binding regions (binding loci) from in vivo ChIP-based high-throughput experiments as well as in silico, computationally predicted, binding motifs and cis-regulatory modules for the co-occurring transcription factor binding motifs, which are within a binding locus. It also contains individual binding sites whose regulatory action has been verified by in vitro experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://compbio.uthscsa.edu/hrtbldb/about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://compbio.uthscsa.edu/hrtbldb/",
    "language": [
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "HRTBLDb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Three hormone receptors, the estrogen receptor (ER), the androgen receptor (AR) and glucocorticoid receptor (GR) play an important role in regulating the cellular differentiation tissue development of skin, bone, the brain and the endocrine system; therefore, there is a strong scientific need to identify and characterize hormone receptor transcriptional regulation. Given that the vast amount of regulatory data for hormone being produced by ChIP-based high-throughput experiments is widely scattered in disparate, poorly cross-indexed data stores, a flexible platform for organizing and relating these data would provide significant value. We created a data management system called the Hormone Receptor Target Binding Loci, HRTBLDb (http://motif.bmi.ohio-state.edu/hrtbldb), to address this problem. This database contains hormone receptor binding regions (binding loci) from in vivo ChIP-based high-throughput experiments as well as in silico, computationally predicted, binding motifs and cis-regulatory modules for the co-occurring transcription factor binding motifs, which are within a binding locus. It also contains individual binding sites whose regulatory action has been verified by in vitro experiments. The current version contains 44 673 binding elements with 114 hormone response elements which are verified by in vitro experiments; 75 binding motifs which occur with a hormone response element and whose co-regulatory action is verified by in vitro experiments; 18 472 binding loci from in vivo experiments; and 26 012 computationally predicted binding motifs. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Gao W."
                    },
                    {
                        "name": "Huang T.H."
                    },
                    {
                        "name": "Jin V.X."
                    },
                    {
                        "name": "Kennedy B.A."
                    }
                ],
                "citationCount": 8,
                "date": "2009-09-22T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HRTBLDb: An informative data resource for hormone receptors target binding loci"
            },
            "pmid": "19773424"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
