{
    "accessibility": "Open access",
    "additionDate": "2023-12-11T19:52:59.534322Z",
    "biotoolsCURIE": "biotools:gmak",
    "biotoolsID": "gmak",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bruno A C Horta",
            "typeEntity": "Person"
        },
        {
            "name": "Yan M H Gonçalves",
            "typeEntity": "Person"
        }
    ],
    "description": "A parameter-space mapping strategy for force-field calibration.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://github.com/mssm-labmmol/gmak",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:28:43.353425Z",
    "name": "gmak",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jctc.2c00955",
            "metadata": {
                "abstract": "In the context of classical molecular simulations, the accuracy of a force field is highly influenced by the values of the relevant simulation parameters. In this work, a parameter-space mapping (PSM) workflow is proposed to aid in the calibration of force-field parameters, based mainly on the following features: (i) regular-grid discretization of the search space; (ii) partial sampling of the search-space grid; (iii) training of surrogate models to predict the estimates of the target properties for nonsampled parameter sets; (iv) post hoc interpretation of the results in terms of multiobjective optimization concepts; (v) attenuation of statistical errors achieved via empiric extension of the duration of the simulations; (vi) iterative search-space translation according to a user-defined scalar objective function that measures the accuracy of the force field (e.g., the weighted root-mean-square deviation of the target properties relative to the reference data). This combination of features results in a hybrid of a single- and a multiobjective optimization strategy, allowing for the approximate determination of both a local minimum of the chosen objective function and its neighboring Pareto efficient points. The PSM workflow is implemented in the extensible Python program gmak, which is made available in the Git repository at http://github.com/mssm-labmmol/gmak. Using this implementation, the PSM workflow was tested in a proof-of-concept fashion in the recalibration of the Lennard-Jones parameters of the 3-point Optimal Point Charge (OPC3) water model for compatibility with the GROMOS treatment of nonbonded interactions. The recalibrated model reproduces typical pure-liquid properties with an accuracy similar to the original OPC3 model and represents a significant improvement relative to the Simple Point Charge (SPC) model, which is the official recommendation for simulations using GROMOS force fields.",
                "authors": [
                    {
                        "name": "Goncalves Y.M.H."
                    },
                    {
                        "name": "Horta B.A.C."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-24T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "gmak: A Parameter-Space Mapping Strategy for Force-Field Calibration"
            },
            "pmid": "36634285"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
