{
    "additionDate": "2021-01-18T12:06:31Z",
    "biotoolsCURIE": "biotools:brainwiki",
    "biotoolsID": "brainwiki",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "linda.forsell@stud.ki.se",
            "name": "Linda Forsell",
            "typeEntity": "Person"
        },
        {
            "email": "sah2149@columbia.edu",
            "name": "S. Abid Hussaini",
            "typeEntity": "Person"
        }
    ],
    "description": "BrainWiki is a Wiki-Style, User Driven, Comparative Brain Anatomy Tool.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://Brainwiki.org",
    "lastUpdate": "2021-02-06T16:50:13Z",
    "name": "BrainWiki",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FNANA.2020.548172",
            "metadata": {
                "abstract": "© Copyright © 2020 Forsell, Vos, Jayaraman, Edman and Hussaini.The mouse is the most important animal model within neuroscientific research, a position strengthened by the wide-spread use of transgenic mouse models. Discoveries in animals are followed by corroboration in humans, and the interchange between these fields of research is essential to our understanding of the human brain. With the advent of advanced technologies such as single-cell transcriptomics, epigenetic profiling and diffusion MRI, many prominent research institutes and collaborations have emerged, aiming to construct complete human or mouse brain atlases with data on gene expression, connectivity and cell types. These initiatives are indispensable resources, but frequently require extensive, time-consuming development, and rely on updates by the provider. They often come in the shape of applications which require practice or prior technical know-how. Importantly, none of them place the human and the mouse brain next to each other to allow for immediate comparison. We present BrainWiki, a user-friendly, web-based atlas that links the human and the mouse brain together, side-by-side. The platform gives the user a simple overview of brain anatomy along with published articles relating to each brain region that allows the user to delve deeper into the current state of research concerning circuitry, brain functions and pathology. The website relies on interactivity and supports user contributions resulting in a dynamic website that evolves at the pace of neuroscience. It is designed to allow for constant updates and new features in the future which will contain data such as gene expression and neuronal cell types.",
                "authors": [
                    {
                        "name": "Edman A."
                    },
                    {
                        "name": "Forsell L."
                    },
                    {
                        "name": "Hussaini S.A."
                    },
                    {
                        "name": "Jayaraman K."
                    },
                    {
                        "name": "Vos E.N."
                    }
                ],
                "date": "2020-10-19T00:00:00Z",
                "journal": "Frontiers in Neuroanatomy",
                "title": "BrainWiki—A Wiki-Style, User Driven, Comparative Brain Anatomy Tool"
            },
            "pmcid": "PMC7604473",
            "pmid": "33192339"
        }
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
