{
    "additionDate": "2021-01-18T10:49:19Z",
    "biotoolsCURIE": "biotools:ioncram",
    "biotoolsID": "ioncram",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mabouelhoda@yahoo.com",
            "name": "Mohamed Abouelhoda",
            "orcidid": "https://orcid.org/0000-0002-3483-2644",
            "typeEntity": "Person"
        }
    ],
    "description": "A reference-based compression tool for ion torrent sequence files.\n\nIonCram is the first compression tool that efficiently compresses the Ion Torrent BAM files. IonCram extends the popular CRAM program by improving the compression of the flow signals. IonCram could improve the compression of CRAM by 13% achieving an overall space saving of about 45%.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ionCRAM/ionCRAM",
    "language": [
        "C",
        "Shell"
    ],
    "lastUpdate": "2021-02-05T07:45:47Z",
    "name": "IonCRAM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03726-9",
            "metadata": {
                "abstract": "© The Author(s).Background: Ion Torrent is one of the major next generation sequencing (NGS) technologies and it is frequently used in medical research and diagnosis. The built-in software for the Ion Torrent sequencing machines delivers the sequencing results in the BAM format. In addition to the usual SAM/BAM fields, the Ion Torrent BAM file includes technology-specific flow signal data. The flow signals occupy a big portion of the BAM file (about 75% for the human genome). Compressing SAM/BAM into CRAM format significantly reduces the space needed to store the NGS results. However, the tools for generating the CRAM formats are not designed to handle the flow signals. This missing feature has motivated us to develop a new program to improve the compression of the Ion Torrent files for long term archiving. Results: In this paper, we present IonCRAM, the first reference-based compression tool to compress Ion Torrent BAM files for long term archiving. For the BAM files, IonCRAM could achieve a space saving of about 43%. This space saving is superior to what achieved with the CRAM format by about 8–9%. Conclusions: Reducing the space consumption of NGS data reduces the cost of storage and data transfer. Therefore, developing efficient compression software for clinical NGS data goes beyond the computational interest; as it ultimately contributes to the overall cost reduction of the clinical test. The space saving achieved by our tool is a practical step in this direction. The tool is open source and available at Code Ocean, github, and http://ioncram.saudigenomeproject.com.",
                "authors": [
                    {
                        "name": "Abouelhoda M."
                    },
                    {
                        "name": "Shokrof M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IonCRAM: A reference-based compression tool for ion torrent sequence files"
            },
            "pmcid": "PMC7487613",
            "pmid": "32907531"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
