
{
    "credit": [
        {
            "email": "peter.humburg@gmail.com",
            "name": "Peter Humburg",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "julian@well.ox.ac.uk",
            "name": "Julian C Knight",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/jknightlab/AltHapAlignR"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s).Motivation: Reliance on mapping to a single reference haplotype currently limits accurate estimation of allele or haplotype-specific expression using RNA-sequencing, notably in highly polymorphic regions such as the major histocompatibility complex. Results: We present AltHapAlignR, a method incorporating alternate reference haplotypes to generate gene-and haplotype-level estimates of transcript abundance for any genomic region where such information is available. We validate using simulated and experimental data to quantify input allelic ratios for major histocompatibility complex haplotypes, demonstrating significantly improved correlation with ground truth estimates of gene counts compared to standard single reference mapping. We apply AltHapAlignR to RNA-seq data from 462 individuals, showing how significant underestimation of expression of the majority of classical human leukocyte antigen genes using conventional mapping can be corrected using AltHapAlignR to allow more accurate quantification of gene expression for individual alleles and haplotypes. Availability and implementation: Source code freely available at https://github.com/jknightlab/AltHapAlignR.",
            "authors": [
                "Lee W.",
                "Plant K.",
                "Humburg P.",
                "Knight J.C."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty125",
            "journal": "Bioinformatics",
            "title": "AltHapAlignR: Improved accuracy of RNA-seq analyses through the use of alternative haplotypes",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:althapalignr",
        "biotoolsID": "althapalignr",
        "description": "Method incorporating alternate reference haplotypes to generate gene- and haplotype-level estimates of transcript abundance for any genomic region where such information is available.",
        "homepage": "https://github.com/jknightlab/AltHapAlignR",
        "name": "AltHapAlignR"
    }
}