{
    "additionDate": "2020-01-14T19:33:08Z",
    "biotoolsCURIE": "biotools:CMVdb",
    "biotoolsID": "CMVdb",
    "confidence_flag": "tool",
    "description": "A Public Omics Database for Systematic and Comparable Information of CMV.\n\nCytomegalovirus is a double-stranded DNA virus in the same family as herpesvirus found every where,infect people of all ages.\n\nCytomegalovirus Treatment & Management Kauser Akhter, MD Assistant Professor, Department of Internal Medicine, Florida State University College of Medicine; Associate Program Director, Infectious Diseases Fellowship Program, Orlando Health; Updated: Jan 05, 2017",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://shaktisahislab.com/include/CMV/",
    "lastUpdate": "2020-12-16T15:49:53.643073Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://weislab.com/WeiDOCK/include/content/CMV/"
        }
    ],
    "name": "CytoMegaloVirus DataBase (CMVdb)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S12539-019-00350-X",
            "metadata": {
                "abstract": "© 2019, International Association of Scientists in the Interdisciplinary Areas.CytoMegaloVirus (CMV) is known to cause infection in humans and may remain dormant throughout the life span of an individual. CMV infection has been reported to be fatal in patients with weak immunity. It is transmitted through blood, saliva, urine, semen and breast milk. Although medications are available to treat the infected patients, there is no cure for CMV. This concern prompted us to construct a comprehensive database having exhaustive information regarding CMV, its infections and therapies to be available on a single platform. Thus, we propose a newly designed database that includes all the information from various public resources such as biological databases, virus taxonomy databanks, viral databases, and drug bank, integrated into this database, named as cytomegalovirus database (CMVdb). It features all the relevant data regarding the strains of CMV, genes, expressed proteins, the genomic sequence of CMV and drugs used in the treatment of cytomegalovirus infection. CMVdb has a unique feature of in-house data analysis, so all the data obtained from various resources are processed within the system. The user interface is more responsive because of the integrated platform that will highly facilitate the researchers. Based on CMVdb functionality and quality of the data, it will accelerate the research and development in the field of infectious diseases and immunology with a special focus on CMV. The obtained data would be useful in designing better therapeutic strategies and agents for the treatment of CMV infections. The proposed database (CMVdb) is freely accessible at http://shaktisahislab.com/include/CMV/ or http://weislab.com/WeiDOCK/include/content/CMV/.",
                "authors": [
                    {
                        "name": "Kaushik A.C."
                    },
                    {
                        "name": "Mehmood A."
                    },
                    {
                        "name": "Upadhyay A.K."
                    },
                    {
                        "name": "Paul S."
                    },
                    {
                        "name": "Srivastava S."
                    },
                    {
                        "name": "Mali P."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Dai X."
                    },
                    {
                        "name": "Wei D.-Q."
                    },
                    {
                        "name": "Sahi S."
                    }
                ],
                "citationCount": 5,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "CytoMegaloVirus Infection Database: A Public Omics Database for Systematic and Comparable Information of CMV"
            },
            "pmid": "31813095"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ]
}