{"credit":[{"email":"hchiu@mail.ncku.edu.tw","name":"Hsien-Tai Chiu","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"cllu@cs.nthu.edu.tw","name":"Chin Lung Lu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/ablab-nthu/CSAR"}],"function":[{"operation":[{"term":"Scaffolding","uri":"http://edamontology.org/operation_3216"}]}],"labels":{"language":["PHP"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA binding sites","uri":"http://edamontology.org/topic_3125"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"NGS","uri":"http://edamontology.org/topic_3168"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"© 2017 The Author. Advances in next generation sequencing have generated massive amounts of short reads. However, assembling genome sequences from short reads still remains a challenging task. Due to errors in reads and large repeats in the genome, many of current assembly tools usually produce just collections of contigs whose relative positions and orientations along the genome being sequenced are still unknown. To address this issue, a scaffolding process to order and orient the contigs of a draft genome is needed for completing the genome sequence. In this work, we propose a new scaffolding tool called CSAR that can efficiently and more accurately order and orient the contigs of a given draft genome based on a reference genome of a related organism. In particular, the reference genome required by CSAR is not necessary to be complete in sequence. Our experimental results on real datasets have shown that CSAR outperforms other similar tools such as Projector2, OSLay and Mauve Aligner in terms of average sensitivity, precision, F-score, genome coverage, NGA50 and running time.","authors":["Chen K.-T.","Liu C.-L.","Huang S.-H.","Shen H.-T.","Shieh Y.-K.","Chiu H.-T.","Lu C.L."],"cit_count":3,"doi":"10.1093/bioinformatics/btx543","journal":"Bioinformatics","title":"CSAR: A contig scaffolding tool using algebraic rearrangements","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:csar_scaffolding","biotoolsID":"csar_scaffolding","description":"A contig scaffolding tool using algebraic rearrangements.","homepage":"https://github.com/ablab-nthu/CSAR","name":"CSAR"}}