{
    "additionDate": "2021-03-19T09:19:58Z",
    "biotoolsCURIE": "biotools:netquilt",
    "biotoolsID": "netquilt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mmb557@nyu.edu",
            "name": "Meet Barot",
            "typeEntity": "Person"
        },
        {
            "email": "rb133@nyu.edu",
            "name": "Richard Bonneau",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep Multispecies Network-based Protein Function Prediction using Homology-informed Network Similarity.\n\nThis is the repository for NetQuilt, a multispecies network-based protein function prediction method incorporating homology information with IsoRank.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nowittynamesleft/NetQuilt",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:36:59.788447Z",
    "license": "GPL-3.0",
    "name": "NetQuilt",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab098",
            "metadata": {
                "abstract": "Motivation: Transferring knowledge between species is challenging: different species contain distinct proteomes and cellular architectures, which cause their proteins to carry out different functions via different interaction networks. Many approaches to protein functional annotation use sequence similarity to transfer knowledge between species. These approaches cannot produce accurate predictions for proteins without homologues of known function, as many functions require cellular context for meaningful prediction. To supply this context, network-based methods use protein-protein interaction (PPI) networks as a source of information for inferring protein function and have demonstrated promising results in function prediction. However, most of these methods are tied to a network for a single species, and many species lack biological networks. Results: In this work, we integrate sequence and network information across multiple species by computing IsoRank similarity scores to create a meta-network profile of the proteins of multiple species. We use this integrated multispecies meta-network as input to train a maxout neural network with Gene Ontology terms as target labels. Our multispecies approach takes advantage of more training examples, and consequently leads to significant improvements in function prediction performance compared to two network-based methods, a deep learning sequence-based method and the BLAST annotation method used in the Critial Assessment of Functional Annotation. We are able to demonstrate that our approach performs well even in cases where a species has no network information available: when an organism's PPI network is left out we can use our multi-species method to make predictions for the left-out organism with good performance.",
                "authors": [
                    {
                        "name": "Barot M."
                    },
                    {
                        "name": "Bonneau R."
                    },
                    {
                        "name": "Cho K."
                    },
                    {
                        "name": "Gligorijevic V."
                    }
                ],
                "citationCount": 11,
                "date": "2021-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NetQuilt: Deep multispecies network-based protein function prediction using homology-informed network similarity"
            },
            "pmcid": "PMC8388039",
            "pmid": "33576802"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
