
{
    "credit": [
        {
            "email": "fuguhelp@imcb.a-star.edu.sg",
            "name": "Fugu Genome Project Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            }
        ]
    },
    "publication": [
        {
            "abstract": "At 400 Mb, the Japanese pufferfish, Fugu rubripes, has the smallest vertebrate genome but has a similar gene repertoire to other vertebrates. Its genes are densely packed with short intergenic and intronic sequences devoid of repetitive elements. It likely has a mutational bias towards DNA elimination and is probably close to a 'minimal' vertebrate genome. As such it is a useful reference genome for gene discovery and gene validation in other vertebrates. Its usefulness in the discovery of conserved regulatory elements has already been demonstrated. The Fugu genome sequence is a good complement to genetic studies in other vertebrates. © 2000 Federation of European Biochemical Societies.",
            "authors": [
                "Venkatesh B.",
                "Gilligan P.",
                "Brenner S."
            ],
            "cit_count": 105,
            "journal": "FEBS Letters",
            "pmid": "10878239",
            "title": "Fugu: A compact vertebrate reference genome",
            "year": "2000-06-30"
        },
        {
            "abstract": "CLONING and sequencing techniques now allow us to characterize genes directly instead of having to deduce their properties from their effects. This new genetics reaches its apotheosis in the plan to obtain the complete DNA sequence of the human genome, but this is far beyond the capacity of present sequencing methods. Small 'model' genomes, such as those of Escherichia coli (4.7 megabases (Mb)1 and yeast (14 Mb)2, or even those of Caenorhabditis elegans (100 Mb) and Drosophila(165 Mb), are better scaled to existing technology. The yeast genome will contain genes with functions common to all eukaryotic cells, and those of simple multi-cellular organisms may throw light on the genetic specification of more complex functions. However, vertebrates differ in their morphology and development, so the ideal model would be a vertebrate genome of minimum size and complexity but with maximum homology to the human genome. Here we report the characterization of the small genome (400 Mb) of the tetraodontoid fish, Fugu rubripes5. A random sequencing approach supported by gene probing shows that the haploid genome contains 400 Mb of DNA, of which more that 90% is unique. This genome is 7.5 times smaller than the human genome and because it has a similar gene repertoire it is the best model genome for the discovery of human genes. © 1993 Nature Publishing Group.",
            "authors": [
                "Brenner S.",
                "Elgar G.",
                "Sanford R.",
                "Macrae A.",
                "Venkatesh B.",
                "Aparicio S."
            ],
            "cit_count": 457,
            "journal": "Nature",
            "pmid": "8232585",
            "title": "Characterization of the pufferfish (Fugu) genome as a compact model vertebrate genome",
            "year": "1993-01-01"
        },
        {
            "abstract": "We have generated and analyzed > 50,000 shotgun clones from 1059 Fugu cosmid clones. All sequences have been minimally edited and searched against protein and DNA databases. These data are all displayed on a searchable, publicly available web site at http://fugu.hgmp.mrc.ac.uk/. With an average of 50 reads per cosmid, this is virtually nonredundant sequence skimming, covering 30%-50% of each clone. This essentially tandem data set covers nearly 25 Mb (> 6%) of the Fugu genome and forms the basis of a series of whole genome analyses which address questions regarding gene density and distribution in the Fugu genome and the similarity between Fugu and mammalian genes. The Fugu genome, with eight times less DNA but a similar gene repertoire, is ideally suited to this type of study because most cosmids contain more than one identifiable gene. General features of the genome are also discussed. We have made some estimation of the syntenic relationship between mammals and Fugu and looked at the efficacy of ORF prediction from short, unedited Fugu genomic sequences. Comparative DNA sequence analyses are an essential tool in the functional interpretation of complex vertebrate genomes. This project highlights the utility of using the Fugu genome in this kind of study.",
            "authors": [
                "Elgar G.",
                "Clark M.S.",
                "Meek S.",
                "Smith S.",
                "Warner S.",
                "Edwards Y.J.K.",
                "Bouchireb N.",
                "Cottage A.",
                "Yeo G.S.H.",
                "Umrania Y.",
                "Williams G.",
                "Brenner S."
            ],
            "cit_count": 73,
            "journal": "Genome Research",
            "pmid": "10523524",
            "title": "Generation and analysis of 25 mb of genomic DNA from the pufferfish Fugu rubripes by sequence scanning",
            "year": "1999-01-01"
        },
        {
            "abstract": "The compact genome of Fugu rubripes has been sequenced to over 95% coverage, and more than 80% of the assembly is in multigene-sized scaffolds. In this 365-megabase vertebrate genome, repetitive DNA accounts for less than one-sixth of the sequence, and gene loci occupy about one-third of the genome. As with the human genome, gene loci are not evenly distributed, but are clustered into sparse and dense regions. Some \"giant\" genes were observed that had average coding sequence sizes but were spread over genomic lengths significantly larger than those of their human orthologs. Although three-quarters of predicted human proteins have a strong match to Fugu, approximately a quarter of the human proteins had highly diverged from or had no pufferfish homologs, highlighting the extent of protein evolution in the 450 million years since teleosts and mammals diverged. Conserved linkages between Fugu and human genes indicate the preservation of chromosomal segments from the common vertebrate ancestor, but with considerable scrambling of gene order.",
            "authors": [
                "Aparicio S.",
                "Chapman J.",
                "Stupka E.",
                "Putnam N.",
                "Chia J.-M.",
                "Dehal P.",
                "Christoffels A.",
                "Rash S.",
                "Hoon S.",
                "Smit A.",
                "Sollewijn Gelpke M.D.",
                "Roach J.",
                "Oh T.",
                "Ho I.Y.",
                "Wong M.",
                "Detter C.",
                "Verhoef F.",
                "Predki P.",
                "Tay A.",
                "Lucas S.",
                "Richardson P.",
                "Smith S.F.",
                "Clark M.S.",
                "Edwards Y.J.K.",
                "Doggett N.",
                "Zharkikh A.",
                "Tavtigian S.V.",
                "Pruss D.",
                "Barnstead M.",
                "Evans C.",
                "Baden H.",
                "Powell J.",
                "Glusman G.",
                "Rowen L.",
                "Hood L.",
                "Tan Y.H.",
                "Elgar G.",
                "Hawkins T.",
                "Venkatesh B.",
                "Rokhsar D.",
                "Brenner S."
            ],
            "cit_count": 1105,
            "journal": "Science",
            "pmid": "12142439",
            "title": "Whole-genome shotgun assembly and analysis of the genome of Fugu rubripes",
            "year": "2002-08-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fugu-sg",
        "biotoolsID": "fugu-sg",
        "description": "Lots of information on fugu including complete draft sequence, annotations, comparative vertebrate genomics, phylogenies, publications, and information about the fugu genome project; has some very useful tools including annotation tools, an Ensembl mirror, and BLAST.",
        "homepage": "http://www.fugu-sg.org/",
        "name": "IMCB - Fugu Genome Project"
    }
}