{
    "additionDate": "2018-07-28T13:32:27Z",
    "biotoolsCURIE": "biotools:sdmtoolbox",
    "biotoolsID": "sdmtoolbox",
    "credit": [
        {
            "email": "SDMtoolbox.help@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Next generation Python-based GIS toolkit for landscape genetic, biogeographic and species distribution model analyses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sdmtoolbox.org/technical-info"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://sdmtoolbox.org/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "SDMtoolbox",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.7717/peerj.4095",
            "metadata": {
                "abstract": "© 2017 Brown et al.SDMtoolbox 2.0 is a software package for spatial studies of ecology, evolution, and genetics. The release of SDMtoolbox 2.0 allows researchers to use the most current ArcGIS software and MaxEnt software, and reduces the amount of time that would be spent developing common solutions. The central aim of this software is to automate complicated and repetitive spatial analyses in an intuitive graphical user interface. One core tenant facilitates careful parameterization of species distribution models (SDMs) to maximize each model's discriminatory ability and minimize overfitting. This includes carefully processing of occurrence data, environmental data, and model parameterization. This program directly interfaces with MaxEnt, one of the most powerful and widely used species distribution modeling software programs, although SDMtoolbox 2.0 is not limited to species distribution modeling or restricted to modeling in MaxEnt. Many of the SDM pre- and post-processing tools have `universal' analogs for use with any modeling software. The current version contains a total of 79 scripts that harness the power of ArcGIS for macroecology, landscape genetics, and evolutionary studies. For example, these tools allow for biodiversity quantification (such as species richness or corrected weighted endemism), generation of least-cost paths and corridors among shared haplotypes, assessment of the significance of spatial randomizations, and enforcement of dispersal limitations ofSDMsprojected into future climates-to only name a few functions contained in SDMtoolbox 2.0. Lastly, dozens of generalized tools exists for batch processing and conversion of GIS data types or formats, which are broadly useful to any ArcMap user.",
                "authors": [
                    {
                        "name": "Brown J.L."
                    },
                    {
                        "name": "Bennett J.R."
                    },
                    {
                        "name": "French C.M."
                    }
                ],
                "citationCount": 105,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "SDMtoolbox 2.0: The next generation Python-based GIS toolkit for landscape genetic, biogeographic and species distribution model analyses"
            },
            "pmcid": "PMC5721907",
            "pmid": "29230356"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}