{"collectionID": [], "accessibility": [], "topic": [{"term": "Biology", "uri": "http://edamontology.org/topic_3070"}, {"term": "Sequence assembly", "uri": "http://edamontology.org/topic_0196"}, {"term": "Genomics", "uri": "http://edamontology.org/topic_0622"}], "owner": "migle_sur", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1371/journal.pone.0177234", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Genome Partitioner: A web tool for multi-level partitioning of large-scale DNA constructs for synthetic biology applications", "abstract": "©2017 Christen et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Recent advances in lower-cost DNA synthesis techniques have enabled new innovations in the field of synthetic biology. Still, efficient design and higher-order assembly of genomescale DNA constructs remains a labor-intensive process. Given the complexity, computer assisted design tools that fragment large DNA sequences into fabricable DNA blocks are needed to pave the way towards streamlined assembly of biological systems. Here, we present the Genome Partitioner software implemented as a web-based interface that permits multi-level partitioning of genome-scale DNA designs. Without the need for specialized computing skills, biologists can submit their DNA designs to a fully automated pipeline that generates the optimal retrosynthetic route for higher-order DNA assembly. To test the algorithm, we partitioned a 783 kb Caulobacter crescentus genome design. We validated the partitioning strategy by assembling a 20 kb test segment encompassing a difficult to synthesize DNA sequence. Successful assembly from 1 kb subblocks into the 20 kb segment highlights the effectiveness of the Genome Partitioner for reducing synthesis costs and timelines for higher-order DNA assembly. The Genome Partitioner is broadly applicable to translate DNA designs into ready to order sequences that can be assembled with standardized protocols, thus offering new opportunities to harness the diversity of microbial genomes for synthetic biology applications.", "citationCount": 0, "authors": [{"name": "Christen M."}, {"name": "Del Medico L."}, {"name": "Christen H."}, {"name": "Christen B."}], "date": "2017-05-01T00:00:00Z", "journal": "PLoS ONE"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Beat Christen", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "beat.christen@imsb.biol.ethz.ch"}, {"typeRole": ["Primary contact"], "name": "Matthias Christen", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "matthias.christen@imsb.biol.ethz.ch"}], "biotoolsCURIE": "biotools:genomepartitioner", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://christenlab.ethz.ch/GenomePartitioner/upload_form_v6.php", "function": [{"note": null, "input": [], "operation": [{"term": "Nucleic acid sequence analysis", "uri": "http://edamontology.org/operation_2478"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:59Z", "otherID": [], "description": "Tool that permits multi-level partitioning of large scale DNA constructs for synthetic biology applications. The partitioning algorithm fragments large DNA sequences into smaller, fabricable DNA blocks sharing flanking homologies for in vitro and in vivo DNA assembly. Overlapping homology regions between adjacent DNA blocks are optimized to remove hairpin, sequence repeats and any pattern that interferes with the DNA assembly process. Segments, blocks and sub-blocks that build the blueprint for hierarchical DNA assembly are listed in a GenBank output file.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": ["PHP"], "link": [], "biotoolsID": "genomepartitioner", "additionDate": "2018-06-19T19:17:05Z", "name": "GenomePartitioner", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}