{
    "accessibility": "Open access",
    "additionDate": "2023-08-11T05:47:31.013549Z",
    "biotoolsCURIE": "biotools:insnet",
    "biotoolsID": "insnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "luojunwei@hpu.edu.cn",
            "name": "Junwei Luo",
            "typeEntity": "Person"
        },
        {
            "name": "Haixia Zhai",
            "typeEntity": "Person"
        },
        {
            "name": "Hongyu Ding",
            "typeEntity": "Person"
        },
        {
            "name": "Runtian Gao",
            "typeEntity": "Person"
        }
    ],
    "description": "Method for detecting insertions based on deep learning network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eioyuou/INSnet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:44:10.063545Z",
    "name": "INSnet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05216-0",
            "metadata": {
                "abstract": "Background: Many studies have shown that structural variations (SVs) strongly impact human disease. As a common type of SV, insertions are usually associated with genetic diseases. Therefore, accurately detecting insertions is of great significance. Although many methods for detecting insertions have been proposed, these methods often generate some errors and miss some variants. Hence, accurately detecting insertions remains a challenging task. Results: In this paper, we propose a method named INSnet to detect insertions using a deep learning network. First, INSnet divides the reference genome into continuous sub-regions and takes five features for each locus through alignments between long reads and the reference genome. Next, INSnet uses a depthwise separable convolutional network. The convolution operation extracts informative features through spatial information and channel information. INSnet uses two attention mechanisms, the convolutional block attention module (CBAM) and efficient channel attention (ECA) to extract key alignment features in each sub-region. In order to capture the relationship between adjacent subregions, INSnet uses a gated recurrent unit (GRU) network to further extract more important SV signatures. After predicting whether a sub-region contains an insertion through the previous steps, INSnet determines the precise site and length of the insertion. The source code is available from GitHub at https://github.com/eioyuou/INSnet. Conclusion: Experimental results show that INSnet can achieve better performance than other methods in terms of F1 score on real datasets.",
                "authors": [
                    {
                        "name": "Ding H."
                    },
                    {
                        "name": "Gao R."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Zhai H."
                    }
                ],
                "citationCount": 4,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "INSnet: a method for detecting insertions based on deep learning network"
            },
            "pmcid": "PMC9990265",
            "pmid": "36879189"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ]
}
