{
    "additionDate": "2017-02-14T09:35:05Z",
    "biotoolsCURIE": "biotools:asidesigner",
    "biotoolsID": "asidesigner",
    "description": "Design software system for siRNA design, that takes into account alternative splicing for mRNA level gene silencing. The software also has the capacity to design siRNAs for silencing of multiple mRNAs simultaneously, to score the performance of designed siRNAs, to search for off-targets with BLAST and FASTA algorithms, and to check for secondary structure energy of siRNAs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "siRNA duplex prediction",
                    "uri": "http://edamontology.org/operation_2008"
                },
                {
                    "term": "siRNA binding specificity prediction",
                    "uri": "http://edamontology.org/operation_0465"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://sysbio.kribb.re.kr/AsiDesigner/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "AsiDesigner",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "RNA interference (RNAi) with small interfering RNA (siRNA) has become a powerful tool in functional and medical genomic research through directed post-transcriptional gene silencing. In order to apply RNAi technique for eukaryotic organisms, where frequent alternative splicing results in diversification of mRNAs and finally of proteins, we need spliced mRNA isoform silencing to study the function of individual proteins. AsiDesigner is a web-based siRNA design software system, which provides siRNA design capability to account for alternative splicing for mRNA level gene silencing. It provides numerous novel functions including the designing of common siRNAs for the silencing of more than two mRNAs simultaneously, a scoring scheme to evaluate the performance of designed siRNAs by adopting currently known key design factors, a stepwise off-target searching with BLAST and FASTA algorithms and checking the folding secondary structure energy of siRNAs. To do this, we developed a novel algorithm to evaluate the common target region, where siRNAs can be designed to knockdown a specific mRNA isoform or more than two mRNA isoforms from a target gene simultaneously. The developed algorithm and the AsiDesigner were tested and validated as very effective throughout widely performed gene silencing experiments. It is expected that AsiDesigner will play an important role in functional genomics, drug discovery and other molecular biological research. AsiDesigner is freely accessible at http://sysbio.kribb.re.kr/AsiDesigner/.",
                "authors": [
                    {
                        "name": "Park Y.K."
                    },
                    {
                        "name": "Park S.M."
                    },
                    {
                        "name": "Choi Y.C."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Won M."
                    },
                    {
                        "name": "Kim Y.J."
                    }
                ],
                "citationCount": 31,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "AsiDesigner: exon-based siRNA design server considering alternative splicing."
            },
            "pmid": "18480122"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}