{
    "accessibility": "Open access",
    "additionDate": "2018-04-26T08:44:02Z",
    "biotoolsCURIE": "biotools:omim_explorer",
    "biotoolsID": "omim_explorer",
    "collectionID": [
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cashaw@bcm.edu",
            "name": "Chad A. Shaw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for linking patient information based on The Human Phenotype Ontology (HPO) with OMIM disease catalog. The tool performs semantic similarity analysis, visualizes the results in an interactive user interface and enables users to manually correct the results if needed.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://www.omimexplorer.com/",
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "OMIM explorer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1186/s13073-016-0261-8",
            "metadata": {
                "abstract": "© 2016 James et al.Background: Genome-wide data are increasingly important in the clinical evaluation of human disease. However, the large number of variants observed in individual patients challenges the efficiency and accuracy of diagnostic review. Recent work has shown that systematic integration of clinical phenotype data with genotype information can improve diagnostic workflows and prioritization of filtered rare variants. We have developed visually interactive, analytically transparent analysis software that leverages existing disease catalogs, such as the Online Mendelian Inheritance in Man database (OMIM) and the Human Phenotype Ontology (HPO), to integrate patient phenotype and variant data into ranked diagnostic alternatives. Methods: Our tool, \"OMIM Explorer\" ( http://www.omimexplorer.com ), extends the biomedical application of semantic similarity methods beyond those reported in previous studies. The tool also provides a simple interface for translating free-text clinical notes into HPO terms, enabling clinical providers and geneticists to contribute phenotypes to the diagnostic process. The visual approach uses semantic similarity with multidimensional scaling to collapse high-dimensional phenotype and genotype data from an individual into a graphical format that contextualizes the patient within a low-dimensional disease map. The map proposes a differential diagnosis and algorithmically suggests potential alternatives for phenotype queries-in essence, generating a computationally assisted differential diagnosis informed by the individual's personal genome. Visual interactivity allows the user to filter and update variant rankings by interacting with intermediate results. The tool also implements an adaptive approach for disease gene discovery based on patient phenotypes. Results: We retrospectively analyzed pilot cohort data from the Baylor Miraca Genetics Laboratory, demonstrating performance of the tool and workflow in the re-analysis of clinical exomes. Our tool assigned to clinically reported variants a median rank of 2, placing causal variants in the top 1 % of filtered candidates across the 47 cohort cases with reported molecular diagnoses of exome variants in OMIM Morbidmap genes. Our tool outperformed Phen-Gen, eXtasy, PhenIX, PHIVE, and hiPHIVE in the prioritization of these clinically reported variants. Conclusions: Our integrative paradigm can improve efficiency and, potentially, the quality of genomic medicine by more effectively utilizing available phenotype information, catalog data, and genomic knowledge.",
                "authors": [
                    {
                        "name": "James R.A."
                    },
                    {
                        "name": "Campbell I.M."
                    },
                    {
                        "name": "Chen E.S."
                    },
                    {
                        "name": "Boone P.M."
                    },
                    {
                        "name": "Rao M.A."
                    },
                    {
                        "name": "Bainbridge M.N."
                    },
                    {
                        "name": "Lupski J.R."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Eng C.M."
                    },
                    {
                        "name": "Posey J.E."
                    },
                    {
                        "name": "Shaw C.A."
                    }
                ],
                "citationCount": 22,
                "date": "2016-02-02T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "A visual and curatorial approach to clinical variant prioritization and disease gene discovery in genome-wide diagnostics"
            },
            "pmcid": "PMC4736244",
            "pmid": "26838676"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}