{
    "additionDate": "2020-01-14T19:47:42Z",
    "biotoolsCURIE": "biotools:CBNA",
    "biotoolsID": "CBNA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jiuyong.Li@unisa.edu.au",
            "name": "Jiuyong Li",
            "orcidid": "https://orcid.org/0000-0002-9023-1878",
            "typeEntity": "Person"
        },
        {
            "email": "Thuc.Le@unisa.edu.au",
            "name": "Thuc D. Le",
            "orcidid": "https://orcid.org/0000-0002-9732-4313",
            "typeEntity": "Person"
        }
    ],
    "description": "Controllability based Biological Network Analysis (CBNA) is a tool to uncover coding and non-coding cancer drivers (i.e. miRNA cancer drivers).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pvvhoang/CancerDriver",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T18:19:57Z",
    "name": "CBNA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007538",
            "metadata": {
                "abstract": "© 2019 Pham et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.A key task in cancer genomics research is to identify cancer driver genes. As these genes initialise and progress cancer, understanding them is critical in designing effective cancer interventions. Although there are several methods developed to discover cancer drivers, most of them only identify coding drivers. However, non-coding RNAs can regulate driver mutations to develop cancer. Hence, novel methods are required to reveal both coding and non-coding cancer drivers. In this paper, we develop a novel framework named Controllability based Biological Network Analysis (CBNA) to uncover coding and non-coding cancer drivers (i.e. miRNA cancer drivers). CBNA integrates different genomic data types, including gene expression, gene network, mutation data, and contains a two-stage process: (1) Building a network for a condition (e.g. cancer condition) and (2) Identifying drivers. The application of CBNA to the BRCA dataset demonstrates that it is more effective than the existing methods in detecting coding cancer drivers. In addition, CBNA also predicts 17 miRNA drivers for breast cancer. Some of these predicted miRNA drivers have been validated by literature and the rest can be good candidates for wet-lab validation. We further use CBNA to detect subtype-specific cancer drivers and several predicted drivers have been confirmed to be related to breast cancer subtypes. Another application of CBNA is to discover epithelial-mesenchymal transition (EMT) drivers. Of the predicted EMT drivers, 7 coding and 6 miRNA drivers are in the known EMT gene lists.",
                "authors": [
                    {
                        "name": "Bracken C.P."
                    },
                    {
                        "name": "Goodall G.J."
                    },
                    {
                        "name": "Le T.D."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Long Q."
                    },
                    {
                        "name": "Pham V.V.H."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CBNA: A control theory based method for identifying coding and non-coding cancer drivers"
            },
            "pmcid": "PMC6907873",
            "pmid": "31790386"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
