{"collectionID": ["Animal and Crop Genomics"], "accessibility": [], "topic": [{"term": "Population genetics", "uri": "http://edamontology.org/topic_3056"}], "owner": "admin", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "19134071", "type": "Other", "pmcid": null, "metadata": {"title": "Reliable computing in estimation of variance components", "abstract": "The purpose of this study is to present guidelines in selection of statistical and computing algorithms for variance components estimation when computing involves software packages. For this purpose two major methods are to be considered: residual maximal likelihood (REML) and Bayesian via Gibbs sampling. Expectation-Maximization (EM) REML is regarded as a very stable algorithm that is able to converge when covariance matrices are close to singular, however it is slow. However, convergence problems can occur with random regression models, especially if the starting values are much lower than those at convergence. Average Information (AI) REML is much faster for common problems but it relies on heuristics for convergence, and it may be very slow or even diverge for complex models. REML algorithms for general models become unstable with larger number of traits. REML by canonical transformation is stable in such cases but can support only a limited class of models. In general, REML algorithms are difficult to program. Bayesian methods via Gibbs sampling are much easier to program than REML, especially for complex models, and they can support much larger datasets; however, the termination criterion can be hard to determine, and the quality of estimates depends on a number of details. Computing speed varies with computing optimizations, with which some large data sets and complex models can be supported in a reasonable time; however, optimizations increase complexity of programming and restrict the types of models applicable. Several examples from past research are discussed to illustrate the fact that different problems required different methods. © 2008 The Author.", "citationCount": 67, "authors": [{"name": "Misztal I."}], "date": "2008-12-01T00:00:00Z", "journal": "Journal of Animal Breeding and Genetics"}}, {"doi": "10.1016/j.livsci.2014.04.029", "note": null, "version": null, "pmid": null, "type": "Other", "pmcid": null, "metadata": {"title": "Single Step, a general approach for genomic selection", "abstract": "Genomic evaluation methods assume that the reference population is genotyped and phenotyped. This is most often false and the generation of pseudo-phenotypes is uncertain and inaccurate. However, markers obey transmission rules and therefore the covariances of marker genotypes across individuals can be modelled using pedigree relationships. Based on this, an extension of the genomic relationship matrix can be constructed in which genomic relationships are propagated to all individuals, resulting in a combined relationship matrix, which can be used in a BLUP procedure called the Single Step Genomic BLUP. This procedure provides so far the most comprehensive option for genomic evaluation. Several extensions, options and details are described: compatibility of genomic and pedigree relationships, Bayesian regressions, multiple trait models, computational aspects, etc. Many details scattered through a series of papers are put together into this paper. © 2014 Elsevier B.V.", "citationCount": 68, "authors": [{"name": "Legarra A."}, {"name": "Christensen O.F."}, {"name": "Aguilar I."}, {"name": "Misztal I."}], "date": "2014-01-01T00:00:00Z", "journal": "Livestock Science"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "ignacy@uga.edu"}, {"typeRole": ["Primary contact"], "name": null, "url": "https://groups.yahoo.com/neo/groups/blupf90/info", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:blupf90", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://nce.ads.uga.edu/html/projects/programs/", "function": [{"note": null, "input": [], "operation": [{"term": "Analysis", "uri": "http://edamontology.org/operation_2945"}], "cmd": null, "output": []}], "lastUpdate": "2020-01-19T17:47:47Z", "otherID": [], "description": "BLUPF90 family of programs is a collection of software in Fortran 90/95 for mixed model computations in animal breeding.", "toolType": ["Command-line tool"], "editPermission": {"type": "group", "authors": ["animalandcropgenomics"]}, "language": ["Fortran"], "link": [], "biotoolsID": "blupf90", "additionDate": "2017-08-20T15:17:05Z", "name": "BLUPF90", "license": "Not licensed", "documentation": [{"url": "http://nce.ads.uga.edu/wiki/doku.php", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}