{
    "additionDate": "2020-01-14T19:33:27Z",
    "biotoolsCURIE": "biotools:Broccoli",
    "biotoolsID": "Broccoli",
    "confidence_flag": "tool",
    "description": "combining phylogenetic and network analyses for orthology assignment.\n\northology assignment using phylogenetic and network analyses.\n\nBroccoli, a user-friendly pipeline designed to infer with high precision orthologous groups and pairs of proteins using a phylogeny-based approach. Briefly, Broccoli performs ultra-fast phylogenetic analyses on most proteins and builds a network of orthologous relationships. Orthologous groups are then identified from the network using a parameter-free machine learning algorithm (label propagation). Broccoli is also able to detect chimeric proteins resulting from gene-fusion events and to assign these proteins to the corresponding orthologous groups",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rderelle/Broccoli",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-09T15:28:56.653364Z",
    "license": "GPL-3.0",
    "name": "Broccoli",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/2019.12.13.875831"
        },
        {
            "doi": "10.1093/molbev/msaa159",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.Orthology assignment is a key step of comparative genomic studies, for which many bioinformatic tools have been developed. However, all gene clustering pipelines are based on the analysis of protein distances, which are subject to many artifacts. In this article, we introduce Broccoli, a user-friendly pipeline designed to infer, with high precision, orthologous groups, and pairs of proteins using a phylogeny-based approach. Briefly, Broccoli performs ultrafast phylogenetic analyses on most proteins and builds a network of orthologous relationships. Orthologous groups are then identified from the network using a parameter-free machine learning algorithm. Broccoli is also able to detect chimeric proteins resulting from gene-fusion events and to assign these proteins to the corresponding orthologous groups. Tested on two benchmark data sets, Broccoli outperforms current orthology pipelines. In addition, Broccoli is scalable, with runtimes similar to those of recent distance-based pipelines. Given its high level of performance and efficiency, this new pipeline represents a suitable choice for comparative genomic studies. Broccoli is freely available at https://github.com/rderelle/Broccoli.",
                "authors": [
                    {
                        "name": "Derelle R."
                    },
                    {
                        "name": "Philippe H."
                    },
                    {
                        "name": "Colbourne J.K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Molecular biology and evolution",
                "title": "Broccoli: Combining Phylogenetic and Network Analyses for Orthology Assignment"
            },
            "pmid": "32602888"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}