{"collectionID": ["de.NBI", "BioInfra.Prot"], "accessibility": [], "topic": [{"term": "Lipids", "uri": "http://edamontology.org/topic_0153"}], "owner": "BioInfra.Prot", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1371/journal.pcbi.1004511", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "The LUX Score: A Metric for Lipidome Homology", "abstract": "© 2015 Marella et al. A lipidome is the set of lipids in a given organism, cell or cell compartment and this set reflects the organism’s synthetic pathways and interactions with its environment. Recently, lipidomes of biological model organisms and cell lines were published and the number of functional studies of lipids is increasing. In this study we propose a homology metric that can quantify systematic differences in the composition of a lipidome. Algorithms were developed to 1. consistently convert lipids structure into SMILES, 2. determine structural similarity between molecular species and 3. describe a lipidome in a chemical space model. We tested lipid structure conversion and structure similarity metrics, in detail, using sets of isomeric ceramide molecules and chemically related phosphatidylinositols. Template-based SMILES showed the best properties for representing lipid-specific structural diversity. We also show that sequence analysis algorithms are best suited to calculate distances between such template-based SMILES and we adjudged the Levenshtein distance as best choice for quantifying structural changes. When all lipid molecules of the LIPIDMAPS structure database were mapped in chemical space, they automatically formed clusters corresponding to conventional chemical families. Accordingly, we mapped a pair of lipidomes into the same chemical space and determined the degree of overlap by calculating the Hausdorff distance. We named this metric the ‘Lipidome jUXtaposition (LUX) score’. First, we tested this approach for estimating the lipidome similarity on four yeast strains with known genetic alteration in fatty acid synthesis. We show that the LUX score reflects the genetic relationship and growth temperature better than conventional methods although the score is based solely on lipid structures. Next, we applied this metric to high-throughput data of larval tissue lipidomes of Drosophila. This showed that the LUX score is sufficient to cluster tissues and determine the impact of nutritional changes in an unbiased manner, despite the limited information on the underlying structural diversity of each lipidome. This study is the first effort to define a lipidome homology metric based on structures that will enrich functional association of lipids in a similar manner to measures used in genetics. Finally, we discuss the significance of the LUX score to perform comparative lipidome studies across species borders.", "citationCount": 2, "authors": [{"name": "Marella C."}, {"name": "Torda A.E."}, {"name": "Schwudke D."}], "date": "2015-01-01T00:00:00Z", "journal": "PLoS Computational Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://lifs.isas.de", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "dschwudke@fz-borstel.de"}], "biotoolsCURIE": "biotools:lux_score", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://lifs.isas.de/index.php/lux-score", "function": [{"note": "Hierarchical clustering of whole lipidomes.", "input": [{"data": {"term": "Lipid accession", "uri": "http://edamontology.org/data_2905"}, "format": [{"term": "CSV", "uri": "http://edamontology.org/format_3752"}]}], "operation": [{"term": "Clustering", "uri": "http://edamontology.org/operation_3432"}], "cmd": null, "output": [{"data": {"term": "Identifier", "uri": "http://edamontology.org/data_0842"}, "format": []}]}], "lastUpdate": "2018-12-10T12:58:52Z", "otherID": [], "description": "The first method offering a metric to compare pairwise distances between complete lipidomics. We will offer LUXScore, as a standalone tool as well as a Knime node.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "lux_score", "additionDate": "2017-02-21T06:25:57Z", "name": "LUX Score", "license": null, "documentation": [{"url": "https://lifs.isas.de/index.php/lux-score", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}