{
    "accessibility": "Restricted access",
    "additionDate": "2022-12-05T23:24:20.450420Z",
    "biotoolsCURIE": "biotools:umabs-db",
    "biotoolsID": "umabs-db",
    "confidence_flag": "tool",
    "cost": "Commercial",
    "credit": [
        {
            "email": "bo.liu@umabstx.com",
            "name": "Bo Liu",
            "typeEntity": "Person"
        },
        {
            "email": "hongyu.zhang@umabstx.com",
            "name": "Hongyu Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Qichao Zhao"
        },
        {
            "name": "Xiaochen Lyu"
        }
    ],
    "description": "UmabsDB is a comprehensive antibody therapeutics database serving the industry and academic community. It covers information on sequence, indication, target patent and clinical trial of antibody therapies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "https://umabs.com",
    "lastUpdate": "2024-11-24T15:18:48.506409Z",
    "name": "Umabs-DB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/abt/tbac021",
            "metadata": {
                "abstract": "Antibody therapies have become an important class of therapeutics in recent years as they have exhibited outstanding efficacy and safety in the treatment of several major diseases including cancers, immune-related diseases, infectious disease and hematological disease. There has been significant progress in the global research and development landscape of antibody therapies in the past decade. In this review, we have collected available data from the Umabs Antibody Therapies Database (Umabs-DB, https://umabs.com) as of 30 June 2022. The Umabs-DB shows that 162 antibody therapies have been approved by at least one regulatory agency in the world, including 122 approvals in the US, followed by 114 in Europe, 82 in Japan and 73 in China, whereas biosimilar, diagnostic and veterinary antibodies are not included in our statistics. Although the US and Europe have been at the leading position for decades, rapid advancement has been witnessed in Japan and China in the past decade. The approved antibody therapies include 115 canonical antibodies, 14 antibody-drug conjugates, 7 bispecific antibodies, 8 antibody fragments, 3 radiolabeled antibodies, 1 antibody-conjugate immunotoxin, 2 immunoconjugates and 12 Fc-Fusion proteins. They have been developed against 91 drug targets, of which PD-1 is the most popular, with 14 approved antibody-based blockades for cancer treatment in the world. This review outlined the global landscape of the approved antibody therapies with respect to the regulation agencies, therapeutic targets and indications, aiming to provide an insight into the trends of the global development of antibody therapies.",
                "authors": [
                    {
                        "name": "Dalby P.A."
                    },
                    {
                        "name": "Hui J."
                    },
                    {
                        "name": "Lin M."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Lyu X."
                    },
                    {
                        "name": "Shentu J."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhao Q."
                    }
                ],
                "citationCount": 69,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Antibody Therapeutics",
                "title": "The global landscape of approved antibody therapies"
            },
            "pmcid": "PMC9535261",
            "pmid": "36213257"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
