{
    "additionDate": "2018-08-24T14:21:04Z",
    "biotoolsCURIE": "biotools:hamdb",
    "biotoolsID": "hamdb",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://hamdb.scbdd.com/home/contact/"
        }
    ],
    "description": "Database of human autophagy modulators with specific pathway and disease information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hamdb.scbdd.com/home/index/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://hamdb.scbdd.com/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "CC-BY-4.0",
    "name": "HAMdb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-018-0289-4",
            "metadata": {
                "abstract": "© 2018, The Author(s).Autophagy is an important homeostatic cellular recycling mechanism responsible for degrading unnecessary or dysfunctional cellular organelles and proteins in all living cells. In addition to its vital homeostatic role, this degradation pathway also involves in various human disorders, including metabolic conditions, neurodegenerative diseases, cancers and infectious diseases. Therefore, the comprehensive understanding of autophagy process, autophagy-related modulators and corresponding pathway and disease information will be of great help for identifying the new autophagy modulators, potential drug candidates, new diagnostic and therapeutic targets. In recent years, some autophagy databases providing structural and functional information were developed, but the specific databases covering autophagy modulator (proteins, chemicals and microRNAs)-related target, pathway and disease information do not exist. Hence, we developed an online resource, Human Autophagy Modulator Database (HAMdb, http://hamdb.scbdd.com), to provide researchers related pathway and disease information as many as possible. HAMdb contains 796 proteins, 841 chemicals and 132 microRNAs. Their specific effects on autophagy, physicochemical information, biological information and disease information were manually collected and compiled. Additionally, lots of external links were available for more information covering extensive biomedical knowledge. HAMdb provides a user-friendly interface to query, search, browse autophagy modulators and their comprehensive related information. HAMdb will help researchers understand the whole autophagy process and provide detailed information about related diseases. Furthermore, it can give hints for the identification of new diagnostic and therapeutic targets and the discovery of new autophagy modulators. In a word, we hope that HAMdb has the potential to promote the autophagy research in pharmacological and pathophysiological area.",
                "authors": [
                    {
                        "name": "Wang N.-N."
                    },
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Ouyang D."
                    },
                    {
                        "name": "Cheng Y."
                    },
                    {
                        "name": "Chen A.F."
                    },
                    {
                        "name": "Lu A.-P."
                    },
                    {
                        "name": "Cao D.-S."
                    }
                ],
                "citationCount": 7,
                "date": "2018-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "HAMdb: a database of human autophagy modulators with specific pathway and disease information"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}