{
    "additionDate": "2021-01-18T10:52:05Z",
    "biotoolsCURIE": "biotools:niid-net",
    "biotoolsID": "niid-net",
    "confidence_flag": "tool",
    "description": "Adapting Surface Normal Knowledge for Intrinsic Image Decomposition in Indoor Scenes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zju3dv/NIID-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T14:04:11Z",
    "name": "NIID-Net",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TVCG.2020.3023565",
            "metadata": {
                "abstract": "© 1995-2012 IEEE.Intrinsic image decomposition, i.e., decomposing a natural image into a reflectance image and a shading image, is used in many augmented reality applications for achieving better visual coherence between virtual contents and real scenes. The main challenge is that the decomposition is ill-posed, especially in indoor scenes where lighting conditions are complicated, while real training data is inadequate. To solve this challenge, we propose NIID-Net, a novel learning-based framework that adapts surface normal knowledge for improving the decomposition. The knowledge learned from relatively more abundant data for surface normal estimation is integrated into intrinsic image decomposition in two novel ways. First, normal feature adapters are proposed to incorporate scene geometry features when decomposing the image. Secondly, a map of integrated lighting is proposed for propagating object contour and planarity information during shading rendering. Furthermore, this map is capable of representing spatially-varying lighting conditions indoors. Experiments show that NIID-Net achieves competitive performance in reflectance estimation and outperforms all previous methods in shading estimation quantitatively and qualitatively. The source code of our implementation is released at https://github.com/zju3dv/NIID-Net.",
                "authors": [
                    {
                        "name": "Bao H."
                    },
                    {
                        "name": "Huang Z."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "NIID-Net: Adapting Surface Normal Knowledge for Intrinsic Image Decomposition in Indoor Scenes"
            },
            "pmid": "32941141"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
