
{
    "credit": [
        {
            "email": "mja18@psu.edu",
            "name": "Mike Axtell",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://psu.app.box.com/v/axtelldata/file/99708412059"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "publication": [
        {
            "abstract": "MicroRNAs (miRNAs) are ∼20- to 22-nt long endogenous RNA sequences that play a critical role in the regulation of gene expression in eukaryotic genomes. Confident identification of miRNA targets is vital to understand their functions. Currently available computational algorithms for miRNA target prediction have diverse degrees of sensitivity and specificity and as a consequence each predicted target generally requires experimental confirmation. miRNAs and other small RNAs that direct endonucleolytic cleavage of target mRNAs produce diagnostic uncapped, polyadenylated mRNA fragments. Degradome sequencing [also known as PARE (parallel analysis of RNA ends) and GMUCT (genome-wide mapping of uncapped transcripts)] samples the 5′-ends of uncapped mRNAs and can be used to discover in vivo miRNA targets independent of computational predictions. Here, we describe a generalizable computational pipeline, CleaveLand, for the detection of cleaved miRNA targets from degradome data. CleaveLand takes as input degradome sequences, small RNAs and an mRNA database and outputs small RNA targets. CleaveLand can thus be applied to degradome data from any species provided a set of mRNA transcripts and a set of query miRNAs or other small RNAs are available. © The Author 2008. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Addo-Quaye C.",
                "Miller W.",
                "Axtell M.J."
            ],
            "cit_count": 237,
            "journal": "Bioinformatics",
            "pmid": "19017659",
            "title": "CleaveLand: A pipeline for using degradome data to find cleaved small RNA targets",
            "year": "2009-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cleaveland4",
        "biotoolsID": "cleaveland4",
        "description": "A pipeline for using degradome data to find cleaved small RNA targets.",
        "homepage": "http://sites.psu.edu/axtell/software/cleaveland4/",
        "name": "CleaveLand4"
    }
}