{
    "additionDate": "2020-01-09T18:29:26Z",
    "biotoolsCURIE": "biotools:FPGA",
    "biotoolsID": "FPGA",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "wuyanxia@hrbeu.edu.cn",
            "name": "Yanxia Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Research on OpenCL optimization for FPGA deep learning application.\n\nOptimize the code provided by Xilinx, and the experiment proves that the optimized performance is 8-40 times optimized by Xilinx.The code URL provided by Xilinx is: https://github.com/Xilinx/SDAccel_Examples/tree/master/getting_started/clk_freq/large_loop_ocl Eight kinds Of convolution layer programs are set up by us according to the ascending order.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'OpenCL'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/PoetryAndWine/FPGA_CNN_Acceleration",
    "language": [
        "C"
    ],
    "lastUpdate": "2020-01-09T18:29:26Z",
    "name": "FPGA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0222984",
            "metadata": {
                "abstract": "© 2019 Zhang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In recent years, with the development of computer science, deep learning is held as competent enough to solve the problem of inference and learning in high dimensional space. Therefore, it has received unprecedented attention from both the academia and the business community. Compared with CPU/GPU, FPGA has attracted much attention for its high-energy efficiency, short development cycle and reconfigurability in the aspect of deep learning algorithm. However, because of the limited research on OpenCL optimization on FPGA of deep learning algorithms, OpenCL tools and models applied to CPU/GPU cannot be directly used on FPGA. This makes it difficult for software programmers to use FPGA when implementing deep learning algorithms for a rewarding performance. To solve this problem, this paper proposed an OpenCL computational model based on FPGA template architecture to optimize the time-consuming convolution layer in deep learning. The comparison between the program applying the computational model and the corresponding optimization program provided by Xilinx indicates that the former is 8-40 times higher than the latter in terms of performance.",
                "authors": [
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Men C."
                    },
                    {
                        "name": "He H."
                    },
                    {
                        "name": "Liang K."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Research on OpenCL optimization for FPGA deep learning application"
            },
            "pmcid": "PMC6786543",
            "pmid": "31600218"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ]
}