{
    "additionDate": "2021-01-20T10:57:16Z",
    "biotoolsCURIE": "biotools:wto",
    "biotoolsID": "wto",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andre.voigt@ntnu.no",
            "name": "André Voigt",
            "orcidid": "https://orcid.org/0000-0002-3006-6970",
            "typeEntity": "Person"
        }
    ],
    "description": "Assessment of weighted topological overlap (wTO) to improve fidelity of gene co-expression networks.\n\nFor more than a decade, gene expression data sets have been used as basis for the construction of co-expression networks used in systems biology investigations, leading to many important discoveries in a wide range of subjects spanning human disease to evolution and the development of organisms. A commonly encountered challenge in such investigations is first that of detecting, then subsequently removing, spurious correlations (i.e. links) in these networks. While access to a large number of measurements per gene would reduce this problem, often only a small number of measurements are available. The weighted Topological Overlap (wTO) measure, which incorporates information from the shared network-neighborhood of a given gene-pair into a single score, is a metric that is frequently used with the implicit expectation of producing higher-quality networks",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                }
            ]
        }
    ],
    "homepage": "https://github.com/andrevo/DiffCoEx-WTO",
    "language": [
        "Python",
        "C++"
    ],
    "lastUpdate": "2021-05-21T06:52:38.001238Z",
    "name": "wTO",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2596-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: For more than a decade, gene expression data sets have been used as basis for the construction of co-expression networks used in systems biology investigations, leading to many important discoveries in a wide range of subjects spanning human disease to evolution and the development of organisms. A commonly encountered challenge in such investigations is first that of detecting, then subsequently removing, spurious correlations (i.e. links) in these networks. While access to a large number of measurements per gene would reduce this problem, often only a small number of measurements are available. The weighted Topological Overlap (wTO) measure, which incorporates information from the shared network-neighborhood of a given gene-pair into a single score, is a metric that is frequently used with the implicit expectation of producing higher-quality networks. However, the actual extent to which wTO improves on the accuracy of a co-expression analysis has not been quantified. Results: Here, we used a large-sample biological data set containing 338 gene-expression measurements per gene as a reference system. From these data, we generated ensembles consisting of 10, 20 and 50 randomly selected measurements to emulate low-quality data sets, finding that the wTO measure consistently generates more robust scores than what results from simple correlation calculations. Furthermore, for the data sets consisting of only 10 and 20 samples per gene, we find that wTO serves as a better predictor of the correlation scores generated from the full data set. However, we find that using wTO as a score for network building substantially alters several topographical aspects of the resulting networks, with no conclusive evidence that the resulting structure is more accurate. Importantly, we find that the much used approach of applying a soft-threshold modifier to link weights prior to computing the wTO substantially decreases the robustness of the resulting wTO network, but increases the predictive power of wTO networks with regards to the reference correlation (soft threshold) network, particularly as the size of the data sets increases. Conclusion: Our analysis demonstrates that, in agreement with previous assumptions, the wTO approach is capable of significantly improving the fidelity of co-expression networks, and that this effect is especially evident for cases of low-sample number gene-expression data sets.",
                "authors": [
                    {
                        "name": "Voigt A."
                    },
                    {
                        "name": "Almaas E."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Assessment of weighted topological overlap (wTO) to improve fidelity of gene co-expression networks"
            },
            "pmcid": "PMC6350380",
            "pmid": "30691386"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}