{"credit":[{"email":"liugeng@genomics.cn","name":"Geng Liu","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"lidongli@genomics.cn","name":"Dongli Li","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/BGI2016/PSSMHCpan"}],"function":[{"operation":[{"term":"Protein property calculation","uri":"http://edamontology.org/operation_0250"}]}],"labels":{"language":["Perl"],"license":"MIT","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Protein binding sites","uri":"http://edamontology.org/topic_3534"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"© The Author 2017. Predicting peptide binding affinity with human leukocyte antigen (HLA) is a crucial step in developing powerful antitumor vaccine for cancer immunotherapy. Currently available methods work quite well in predicting peptide binding affinity with HLA alleles such as HLA-A*0201, HLA-A*0101, and HLA-B*0702 in terms of sensitivity and specificity. However, quite a few types of HLA alleles that are present in the majority of human populations including HLA-A*0202, HLA-A*0203, HLA-A*6802, HLA-B*5101, HLA-B*5301, HLA-B*5401, and HLA-B*5701 still cannot be predicted with satisfactory accuracy using currently available methods. Furthermore, currently the most popularly used methods for predicting peptide binding affinity are inefficient in identifying neoantigens from a large quantity of whole genome and transcriptome sequencing data. Here we present a Position Specific Scoring Matrix (PSSM)-based software called PSSMHCpan to accurately and efficiently predict peptide binding affinity with a broad coverage of HLA class I alleles. We evaluated the performance of PSSMHCpan by analyzing 10-fold cross-validation on a training database containing 87 HLA alleles and obtained an average area under receiver operating characteristic curve (AUC) of 0.94 and accuracy (ACC) of 0.85. In an independent dataset (Peptide Database of Cancer Immunity) evaluation, PSSMHCpan is substantially better than the popularly used NetMHC-4.0, NetMHCpan-3.0, PickPocket, Nebula, and SMM with a sensitivity of 0.90, as compared to 0.74, 0.81, 0.77, 0.24, and 0.79. In addition, PSSMHCpan is more than 197 times faster than NetMHC-4.0, NetMHCpan-3.0, PickPocket, sNebula, and SMM when predicting neoantigens from 661 263 peptides from a breast tumor sample. Finally, we built a neoantigen prediction pipeline and identified 117 017 neoantigens from 467 cancer samples of various cancers from TCGA. PSSMHCpan is superior to the currently available methods in predicting peptide binding affinity with a broad coverage of HLA class I alleles.","authors":["Liu G.","Li D.","Li Z.","Qiu S.","Li W.","Chao C.-C.","Yang N.","Li H.","Cheng Z.","Song X.","Cheng L.","Zhang X.","Wang J.","Yang H.","Ma K.","Hou Y.","Li B."],"cit_count":4,"doi":"10.1093/gigascience/gix017","journal":"GigaScience","title":"PSSMHCpan: A novel PSSM-based software for predicting class I peptide-HLA binding affinity","year":"2017-01-01"}],"summary":{"biotoolsCURIE":"biotools:pssmhcpan","biotoolsID":"pssmhcpan","description":"A novel PSSM based software for predicting class I peptide-HLA binding affinity.","homepage":"https://github.com/BGI2016/PSSMHCpan","name":"PSSMHCpan"}}