{
    "additionDate": "2018-05-05T10:02:13Z",
    "biotoolsCURIE": "biotools:clustom-cloud",
    "biotoolsID": "clustom-cloud",
    "credit": [
        {
            "email": "kmkim@kopri.re.kr",
            "name": "Kyung Mo Kim",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "ofang@nnibr.re.kr",
            "name": "Jeongsu Oh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "rbdls77@kopri.re.kr",
            "name": "Kyuin Hwang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "In-Memory Data Grid-Based Software for Clustering 16S rRNA Sequence Data in the Cloud Environment.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://clustomcloud.kopri.re.kr/docs/manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "homepage": "http://clustomcloud.kopri.re.kr/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "CLUSTOM-CLOUD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0151064",
            "metadata": {
                "abstract": "© 2016 Oh et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.High-throughput sequencing can produce hundreds of thousands of 16S rRNA sequence reads corresponding to different organisms present in the environmental samples. Typically, analysis of microbial diversity in bioinformatics starts from pre-processing followed by clustering 16S rRNA reads into relatively fewer operational taxonomic units (OTUs). The OTUs are reliable indicators of microbial diversity and greatly accelerate the downstream analysis time. However, existing hierarchical clustering algorithms that are generally more accurate than greedy heuristic algorithms struggle with large sequence datasets. To keep pace with the rapid rise in sequencing data, we present CLUSTOM-CLOUD, which is the first distributed sequence clustering program based on In-Memory Data Grid (IMDG) technology-a distributed data structure to store all data in the main memory of multiple computing nodes. The IMDG technology helps CLUSTOM-CLOUD to enhance both its capability of handling larger datasets and its computational scalability better than its ancestor, CLUS-TOM, while maintaining high accuracy. Clustering speed of CLUSTOM-CLOUD was evaluated on published 16S rRNA human microbiome sequence datasets using the small laboratory cluster (10 nodes) and under the Amazon EC2 cloud-computing environments. Under the laboratory environment, it required only ∼3 hours to process dataset of size 200 K reads regardless of the complexity of the human microbiome data. In turn, one million reads were processed in approximately 20, 14, and 11 hours when utilizing 20, 30, and 40 nodes on the Amazon EC2 cloud-computing environment. The running time evaluation indicates that CLUSTOM-CLOUD can handle much larger sequence datasets than CLUSTOM and is also a scalable distributed processing system. The comparative accuracy test using 16S rRNA pyrosequences of a mock community shows that CLUSTOM-CLOUD achieves higher accuracy than DOTUR, mothur, ESPRIT-Tree, UCLUST and Swarm. CLUSTOM-CLOUD is written in Java and is freely available at http://clustomcloud.kopri.re.kr.",
                "authors": [
                    {
                        "name": "Cho W.-S."
                    },
                    {
                        "name": "Choi C.-H."
                    },
                    {
                        "name": "Hong S.G."
                    },
                    {
                        "name": "Hwang K."
                    },
                    {
                        "name": "Kim B.K."
                    },
                    {
                        "name": "Kim K.M."
                    },
                    {
                        "name": "Lee S.-H."
                    },
                    {
                        "name": "Nasir A."
                    },
                    {
                        "name": "Oh J."
                    },
                    {
                        "name": "Park M.-K."
                    }
                ],
                "citationCount": 9,
                "date": "2016-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Clustom-Cloud: In-Memory data grid-based software for clustering 16S rRNA sequence data in the cloud environment"
            },
            "pmcid": "PMC4783016",
            "pmid": "26954507"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
