{
    "accessibility": "Open access",
    "additionDate": "2022-05-16T13:35:33.186041Z",
    "biotoolsCURIE": "biotools:xdeathdb",
    "biotoolsID": "xdeathdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lijun.cheng@osumc.edu",
            "name": "Lijun Cheng",
            "orcidid": "https://orcid.org/0000-0002-6336-5416",
            "typeEntity": "Person"
        },
        {
            "name": "Hangil Kim"
        },
        {
            "name": "Tao Han"
        },
        {
            "name": "Venkat Sundar Gadepalli"
        },
        {
            "name": "Yueze Liu"
        }
    ],
    "description": "A visualization platform for cell death molecular interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Pathway visualisation",
                    "uri": "http://edamontology.org/operation_3926"
                }
            ]
        }
    ],
    "homepage": "https://pcm2019.shinyapps.io/XDeathDB/",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2022-05-16T13:35:33.189125Z",
    "name": "XDeathDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/S41419-021-04397-X",
            "metadata": {
                "abstract": "© 2021, The Author(s).Lots of cell death initiator and effector molecules, signalling pathways and subcellular sites have been identified as key mediators in both cell death processes in cancer. The XDeathDB visualization platform provides a comprehensive cell death and their crosstalk resource for deciphering the signaling network organization of interactions among different cell death modes associated with 1461 cancer types and COVID-19, with an aim to understand the molecular mechanisms of physiological cell death in disease and facilitate systems-oriented novel drug discovery in inducing cell deaths properly. Apoptosis, autosis, efferocytosis, ferroptosis, immunogenic cell death, intrinsic apoptosis, lysosomal cell death, mitotic cell death, mitochondrial permeability transition, necroptosis, parthanatos, and pyroptosis related to 12 cell deaths and their crosstalk can be observed systematically by the platform. Big data for cell death gene-disease associations, gene-cell death pathway associations, pathway-cell death mode associations, and cell death-cell death associations is collected by literature review articles and public database from iRefIndex, STRING, BioGRID, Reactom, Pathway’s commons, DisGeNET, DrugBank, and Therapeutic Target Database (TTD). An interactive webtool, XDeathDB, is built by web applications with R-Shiny, JavaScript (JS) and Shiny Server Iso. With this platform, users can search specific interactions from vast interdependent networks that occur in the realm of cell death. A multilayer spectral graph clustering method that performs convex layer aggregation to identify crosstalk function among cell death modes for a specific cancer. 147 hallmark genes of cell death could be observed in detail in these networks. These potential druggable targets are displayed systematically and tailoring networks to visualize specified relations is available to fulfil user-specific needs. Users can access XDeathDB for free at https://pcm2019.shinyapps.io/XDeathDB/.",
                "authors": [
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Gadepalli V.S."
                    },
                    {
                        "name": "Han T."
                    },
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Liu Y."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Cell Death and Disease",
                "title": "XDeathDB: a visualization platform for cell death molecular interactions"
            },
            "pmcid": "PMC8669630",
            "pmid": "34907160"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
