{
    "additionDate": "2021-01-18T09:30:08Z",
    "biotoolsCURIE": "biotools:xdream",
    "biotoolsID": "xdream",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiaow@fas.harvard.edu",
            "name": "Will Xiao",
            "orcidid": "https://orcid.org/0000-0001-5555-3217",
            "typeEntity": "Person"
        }
    ],
    "description": "Finding preferred stimuli for visual neurons using generative networks and gradient-free optimization.\n\n\nXDream (Extending DeepDream with real-time evolution for activity maximization in real neurons) is a package for visualizing the preferred input of units in non-differentiable visual systems—such as the visual cortex—through activation maximization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "https://github.com/willwx/XDream/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-18T10:43:06Z",
    "license": "MIT",
    "name": "XDream",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007973",
            "metadata": {
                "abstract": "© 2020 Xiao, Kreiman.A longstanding question in sensory neuroscience is what types of stimuli drive neurons to fire. The characterization of effective stimuli has traditionally been based on a combination of intuition, insights from previous studies, and luck. A new method termed XDream (EXtending DeepDream with real-time evolution for activation maximization) combined a generative neural network and a genetic algorithm in a closed loop to create strong stimuli for neurons in the macaque visual cortex. Here we extensively and systematically evaluate the performance of XDream. We use ConvNet units as in silico models of neurons, enabling experiments that would be prohibitive with biological neurons. We evaluated how the method compares to brute-force search, and how well the method generalizes to different neurons and processing stages. We also explored design and parameter choices. XDream can efficiently find preferred features for visual units without any prior knowledge about them. XDream extrapolates to different layers, architectures, and developmental regimes, performing better than brute-force search, and often better than exhaustive sampling of >1 million images. Furthermore, XDream is robust to choices of multiple image generators, optimization algorithms, and hyperparameters, suggesting that its performance is locally near-optimal. Lastly, we found no significant advantage to problem-specific parameter tuning. These results establish expectations and provide practical recommendations for using XDream to investigate neural coding in biological preparations. Overall, XDream is an efficient, general, and robust algorithm for uncovering neuronal tuning preferences using a vast and diverse stimulus space. XDream is implemented in Python, released under the MIT License, and works on Linux, Windows, and MacOS.",
                "authors": [
                    {
                        "name": "Xiao W."
                    },
                    {
                        "name": "Kreiman G."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "XDream: Finding preferred stimuli for visual neurons using generative networks and gradient-free optimization"
            },
            "pmcid": "PMC7316361",
            "pmid": "32542056"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}