{"credit":[{"email":"us-support@exiqon.com","name":"Support in the US","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"DK-Techsupport-office@exiqon.com","name":"Support in other countries","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.exiqon.com/oligo-tools"}],"function":[{"operation":[{"term":"Primer and probe design","uri":"http://edamontology.org/operation_2419"},{"term":"Nucleic acid design","uri":"http://edamontology.org/operation_3095"},{"term":"Nucleic acid structure prediction","uri":"http://edamontology.org/operation_0475"},{"term":"Microarray probe design","uri":"http://edamontology.org/operation_0309"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"language":["Perl","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"publication":[{"abstract":"We report the development of new software, OligoDesign, which provides optimal design of LNA (locked nucleic acid) substituted oligonucleotides for functional genomics applications. LNAs constitute a novel class of bicyclic RNA analogs having an exceptionally high affinity and specificity toward their complementary DNA and RNA target molecules. The OligoDesign software features recognition and filtering of the target sequence by genome-wide BLAST analysis in order to minimize cross-hybridization with non-target sequences. Furthermore it includes routines for prediction of melting temperature, self-annealing and secondary structure for LNA substituted oligonucleotides, as well as secondary structure prediction of the target nucleotide sequence. Individual scores for all these properties are calculated for each possible LNA oligonucleotide in the query gene and the OligoDesign program ranks the LNA capture probes according to a combined fuzzy logic score and finally returns the top scoring probes to the user in the output. We have successfully used the OligoDesign tool to design a Caenorhabditis elegans LNA oligonucleotide micro-array, which allows monitoring of the expression of a set of 120 potential marker genes for a variety of stress and toxicological processes and toxicologically relevant pathways. The OligoDesign program is freely accessible at http://Inatools.com/. © Oxford University Press 2001.","authors":["Tolstrup N.","Nielsen P.S.","Kolberg J.G.","Frankel A.M.","Vissing H.","Kauppinen S."],"cit_count":84,"journal":"Nucleic Acids Research","pmid":"12824412","title":"OligoDesign: Optimal design of LNA (locked nucleic acid) oligonucleotide capture probes for gene expression profiling","year":"2003-07-01"}],"summary":{"biotoolsCURIE":"biotools:lnatools","biotoolsID":"lnatools","description":"Collection of tools for the design of LNA (locked nucleic acid) substituted oligonucleotides including: melting temperature (Tm) analysis, secondary structure prediction, and probe design for expression arrays, real time PCR, and SNP genotyping.","homepage":"http://www.exiqon.com/oligo-tools","name":"LNAtools"}}