{
    "additionDate": "2020-01-09T17:38:32Z",
    "biotoolsCURIE": "biotools:Domainoid",
    "biotoolsID": "Domainoid",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "erik.sonnhammer@scilifelab.se",
            "name": "Erik L. L. Sonnhammer",
            "typeEntity": "Person"
        }
    ],
    "description": "domain-oriented orthology inference.\n\nBACKGROUND:Orthology inference is normally based on full-length protein sequences. However, most proteins contain independently folding and recurring regions, domains. The domain architecture of a protein is vital for its function, and recombination events mean individual domains can have different evolutionary histories. It has previously been shown that orthologous proteins may differ in domain architecture, creating challenges for orthology inference methods operating on full-length sequences. We have developed Domainoid, a new tool aiming to overcome these challenges faced by full-length orthology methods by inferring orthology on the domain level. It employs the InParanoid algorithm on single domains separately, to infer groups of orthologous domains. RESULTS:This domain-oriented approach allows detection of discordant domain orthologs, cases where different domains on the same protein have different evolutionary histories",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/sonnhammergroup/domainoid/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-22T10:21:15Z",
    "name": "Domainoid",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3137-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Orthology inference is normally based on full-length protein sequences. However, most proteins contain independently folding and recurring regions, domains. The domain architecture of a protein is vital for its function, and recombination events mean individual domains can have different evolutionary histories. It has previously been shown that orthologous proteins may differ in domain architecture, creating challenges for orthology inference methods operating on full-length sequences. We have developed Domainoid, a new tool aiming to overcome these challenges faced by full-length orthology methods by inferring orthology on the domain level. It employs the InParanoid algorithm on single domains separately, to infer groups of orthologous domains. Results: This domain-oriented approach allows detection of discordant domain orthologs, cases where different domains on the same protein have different evolutionary histories. In addition to domain level analysis, protein level orthology based on the fraction of domains that are orthologous can be inferred. Domainoid orthology assignments were compared to those yielded by the conventional full-length approach InParanoid, and were validated in a standard benchmark. Conclusions: Our results show that domain-based orthology inference can reveal many orthologous relationships that are not found by full-length sequence approaches. Availability: https://bitbucket.org/sonnhammergroup/domainoid/",
                "authors": [
                    {
                        "name": "Forslund S.K."
                    },
                    {
                        "name": "Kaduk M."
                    },
                    {
                        "name": "Persson E."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Domainoid: Domain-oriented orthology inference"
            },
            "pmcid": "PMC6816169",
            "pmid": "31660857"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
