{
    "accessibility": "Open access",
    "additionDate": "2017-02-14T09:36:34Z",
    "biotoolsCURIE": "biotools:mobilomefinder",
    "biotoolsID": "mobilomefinder",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hyou@sjtu.edu.cn",
            "name": "Hong-Yu Ou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "kr46@le.ac.uk",
            "name": "Kumar Rajakumar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zxdeng@sjtu.edu.cn",
            "name": "Zixin Deng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for high-throughput genomic island discovery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                },
                {
                    "term": "Structural variation discovery",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "http://db-mml.sjtu.edu.cn/MobilomeFINDER/",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "MobilomeFINDER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "ArrayOme is a new program that calculates the size of genomes represented by microarray-based probes and facilitates recognition of key bacterial strains carrying large numbers of novel genes. Protein-coding sequences (CDS) that are contiguous on annotated reference templates and classified as 'Present' in the test strain by hybridization to microarrays are merged into ICs (ICs). These ICs are then extended to account for flanking intergenic sequences. Finally, the lengths of all extended ICs are summated to yield the 'microarray-visualized genome (MVG)' size. We tested and validated ArrayOme using both experimental and in silico-generated genomic hybridization data. MVG sizing of five sequenced Escherichia coli and Shigella strains resulted in an accuracy of 97-99%, as compared to true genome sizes, when the comprehensive ShE.coli meta-array gene sequences (6239 CDS) were used for in silico hybridization analysis. However, the E.coli CFT073 genome size was underestimated by 14% as this meta-array lacked probes for many CFT073 CDS. ArrayOme permits rapid recognition of discordances between PFGE-measured genome and MVG sizes, thereby enabling high-throughput identification of strains rich in novel genes. Gene discovery studies focused on these strains will greatly facilitate characterization of the global gene pool accessible to individual bacterial species.",
                "authors": [
                    {
                        "name": "Barer M.R."
                    },
                    {
                        "name": "Chaudhuri R.R."
                    },
                    {
                        "name": "Hinton J."
                    },
                    {
                        "name": "Lucchini S."
                    },
                    {
                        "name": "Ou H.Y."
                    },
                    {
                        "name": "Pallen M."
                    },
                    {
                        "name": "Rajakumar K."
                    },
                    {
                        "name": "Smith R."
                    }
                ],
                "citationCount": 8,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "ArrayOme: a program for estimating the sizes of microarray-visualized bacterial genomes."
            },
            "pmid": "15640440"
        },
        {
            "metadata": {
                "abstract": "MobilomeFINDER (http://mml.sjtu.edu.cn/Mobilome FINDER) is an interactive online tool that facilitates bacterial genomic island or 'mobile genome' (mobilome) discovery; it integrates the ArrayOme and tRNAcc software packages. ArrayOme utilizes a microarray-derived comparative genomic hybridization input data set to generate 'inferred contigs' produced by merging adjacent genes classified as 'present'. Collectively these 'fragments' represent a hypothetical 'microarray-visualized genome (MVG)'. ArrayOme permits recognition of discordances between physical genome and MVG sizes, thereby enabling identification of strains rich in microarrayelusive novel genes. Individual tRNAcc tools facilitate automated identification of genomic islands by comparative analysis of the contents and contexts of tRNA sites and other integration hotspots in closely related sequenced genomes. Accessory tools facilitate design of hotspot-flanking primers for in silico and/or wet-science-based interrogation of cognate loci in unsequenced strains and analysis of islands for features suggestive of foreign origins; island-specific and genome-contextual features are tabulated and represented in schematic and graphical forms. To date we have used MobilomeFINDER to analyse several Enterobacteriaceae, Pseudomonas aeruginosa and Streptococcus suis genomes. MobilomeFINDER enables high-throughput island identification and characterization through increased exploitation of emerging sequence data and PCR-based profiling of unsequenced test strains; subsequent targeted yeast recombination-based capture permits fulllength sequencing and detailed functional studies of novel genomic islands. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Barer M.R."
                    },
                    {
                        "name": "Deng Z."
                    },
                    {
                        "name": "Harrison E.M."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Hinton J.C.D."
                    },
                    {
                        "name": "Kadioglu A."
                    },
                    {
                        "name": "Kulasekara B.R."
                    },
                    {
                        "name": "Lory S."
                    },
                    {
                        "name": "Ou H.-Y."
                    },
                    {
                        "name": "Rajakumar K."
                    },
                    {
                        "name": "Thani A.B."
                    }
                ],
                "citationCount": 61,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MobilomeFINDER: Web-based tools for in silico and experimental discovery of bacterial genomic islands"
            },
            "pmid": "17537813"
        },
        {
            "metadata": {
                "abstract": "We devised software tools to systematically investigate the contents and contexts of bacterial tRNA and tmRNA genes, which are known insertion hotspots for genomic islands (GIs). The strategy, based on MAUVE-facilitated multigenome comparisons, was used to examine 87 Escherichia coli MG1655 tRNA and tmRNA genes and their orthologues in E.coli EDL933, E.coli CFT073 and Shigella flexneri Sf301. Our approach identified 49 GIs occupying ∼1.7 Mb that mapped to 18 tRNA genes, missing 2 but identifying a further 30 GIs as compared with Islander [Y. Mantri and K. P. Williams (2004), Nucleic Acids Res., 32, D55-D58]. All these GIs had many strain-specific CDS, anomalous GC contents and/or significant dinucleotide biases, consistent with foreign origins. Our analysis demonstrated marked conservation of sequences flanking both empty tRNA sites and tRNA-associated GIs across all four genomes. Remarkably, there were only 2 upstream and 5 downstream deletions adjacent to the 328 loci investigated. In silico PCR analysis based on conserved flanking regions was also used to interrogate hotspots in another eight completely or partially sequenced E.coli and Shigella genomes. The tools developed are ideal for the analysis of other bacterial species and will lead to in silico and experimental discovery of new genomic islands. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Barer M.R."
                    },
                    {
                        "name": "Chaudhuri R.R."
                    },
                    {
                        "name": "Chen L.-L."
                    },
                    {
                        "name": "Garton N.J."
                    },
                    {
                        "name": "Hinton J."
                    },
                    {
                        "name": "Lonnen J."
                    },
                    {
                        "name": "Ou H.-Y."
                    },
                    {
                        "name": "Pallen M."
                    },
                    {
                        "name": "Rajakumar K."
                    },
                    {
                        "name": "Smith R."
                    },
                    {
                        "name": "Thani A.B."
                    }
                ],
                "date": "2006-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A novel strategy for the identification of genomic islands by comparative analysis of the contents and contexts of tRNA sites in closely related bacteria"
            },
            "pmid": "16414954"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
