{
    "additionDate": "2020-01-14T19:46:08Z",
    "biotoolsCURIE": "biotools:MIAmaxent",
    "biotoolsID": "MIAmaxent",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "julienvollering@gmail.com",
            "name": "Julien Vollering",
            "orcidid": "https://orcid.org/0000-0002-7409-2898",
            "typeEntity": "Person"
        }
    ],
    "description": "Variable transformation and model selection for species distribution models.\n\nA reproducible paper describing the MIAmaxent R package.\n\nRead our open-access paper in Ecology and Evolution introducing MIAmaxent: https://doi.org/10.1002/ece3.5654.\n\nMaxent software for modeling species niches and distributions.\n\nThe file 'miamaxent-ms.\n\nMIAmaxent is intended primarily for maximum entropy distribution modeling (Phillips et al., 2006; Phillips et al., 2017), and provides an alternative to the standard methodology for training, selecting, and using models.\n\nUse this site to download Maxent software for modeling species niches and distributions by applying a machine-learning technique called maximum entropy modeling.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MIAmaxent R package'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://biodiversityinformatics.amnh.org/open_source/maxent/",
    "language": [
        "R",
        "Lua"
    ],
    "lastUpdate": "2020-01-14T19:46:08Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/julienvollering/MIAmaxent-paper"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/julienvollering/MIAmaxent"
        }
    ],
    "name": "MIAmaxent",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ECE3.5654",
            "metadata": {
                "abstract": "© 2019 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.The widely used “Maxent” software for modeling species distributions from presence-only data (Phillips et al., Ecological Modelling, 190, 2006, 231) tends to produce models with high-predictive performance but low-ecological interpretability, and implications of Maxent's statistical approach to variable transformation, model fitting, and model selection remain underappreciated. In particular, Maxent's approach to model selection through lasso regularization has been shown to give less parsimonious distribution models—that is, models which are more complex but not necessarily predictively better—than subset selection. In this paper, we introduce the MIAmaxent R package, which provides a statistical approach to modeling species distributions similar to Maxent's, but with subset selection instead of lasso regularization. The simpler models typically produced by subset selection are ecologically more interpretable, and making distribution models more grounded in ecological theory is a fundamental motivation for using MIAmaxent. To that end, the package executes variable transformation based on expected occurrence–environment relationships and contains tools for exploring data and interrogating models in light of knowledge of the modeled system. Additionally, MIAmaxent implements two different kinds of model fitting: maximum entropy fitting for presence-only data and logistic regression (GLM) for presence–absence data. Unlike Maxent, MIAmaxent decouples variable transformation, model fitting, and model selection, which facilitates methodological comparisons and gives the modeler greater flexibility when choosing a statistical approach to a given distribution modeling problem.",
                "authors": [
                    {
                        "name": "Vollering J."
                    },
                    {
                        "name": "Halvorsen R."
                    },
                    {
                        "name": "Mazzoni S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "The MIAmaxent R package: Variable transformation and model selection for species distribution models"
            },
            "pmcid": "PMC6854112",
            "pmid": "31832144"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}