{
    "additionDate": "2021-01-18T09:50:32Z",
    "biotoolsCURIE": "biotools:idp-seq2seq",
    "biotoolsID": "idp-seq2seq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of Intrinsically Disordered Regions based on Sequence to Sequence Learning.\n\nIdentification of Intrinsically Disordered Proteins and Regions.\n\nbased on Sequence to Sequence Learning.\n\nThe datasets used in this study can be downloaded from below links:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/IDP-Seq2Seq/",
    "lastUpdate": "2021-02-03T07:25:46Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bliulab.net/IDP-Seq2Seq/benchmark/"
        }
    ],
    "name": "IDP-Seq2Seq",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA667",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Related to many important biological functions, intrinsically disordered regions (IDRs) are widely distributed in proteins. Accurate prediction of IDRs is critical for the protein structure and function analysis. However, the existing computational methods construct the predictive models solely in the sequence space, failing to convert the sequence space into the 'semantic space' to reflect the structure characteristics of proteins. Furthermore, although the length-dependent predictors showed promising results, new fusion strategies should be explored to improve their predictive performance and the generalization. Results: In this study, we applied the Sequence to Sequence Learning (Seq2Seq) derived from natural language processing (NLP) to map protein sequences to 'semantic space' to reflect the structure patterns with the help of predicted residue-residue contacts (CCMs) and other sequence-based features. Furthermore, the Attention mechanism was used to capture the global associations between all residue pairs in the proteins. Three length-dependent predictors were constructed: IDP-Seq2Seq-L for long disordered region prediction, IDP-Seq2Seq-S for short disordered region prediction and IDP-Seq2Seq-G for both long and short disordered region predictions. Finally, these three predictors were fused into one predictor called IDP-Seq2Seq to improve the discriminative power and generalization. Experimental results on four independent test datasets and the CASP test dataset showed that IDP-Seq2Seq is insensitive with the ratios of long and short disordered regions and outperforms other competing methods.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Pang Y.-H."
                    },
                    {
                        "name": "Tang Y.-J."
                    }
                ],
                "citationCount": 19,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IDP-Seq2Seq: Identification of intrinsically disordered regions based on sequence to sequence learning"
            },
            "pmid": "32702119"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
