{
    "additionDate": "2018-08-28T07:42:57Z",
    "biotoolsCURIE": "biotools:aiida",
    "biotoolsID": "aiida",
    "credit": [
        {
            "email": "andrius.merkys@gmail.com",
            "name": "Andrius Merkys",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Sophisticated framework designed from scratch to be a flexible and scalable infrastructure for computational science. Being able to store the full data provenance of each simulation, and based on a tailored database solution built for efficient data mining implementations, AiiDA gives the user the ability to interact seamlessly with any number of HPC machines and codes thanks to its flexible plugin interface, together with a powerful workflow engine for the automation of simulations.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://aiida.readthedocs.io/projects/aiida-core/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "homepage": "https://www.aiida.net/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-21T15:35:23Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/aiidateam/aiida_core"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/aiidateam/aiida_core/issues"
        }
    ],
    "name": "AiiDA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0242-y",
            "metadata": {
                "abstract": "© 2017 The Author(s).In order to make results of computational scientific research findable, accessible, interoperable and re-usable, it is necessary to decorate them with standardised metadata. However, there are a number of technical and practical challenges that make this process difficult to achieve in practice. Here the implementation of a protocol is presented to tag crystal structures with their computed properties, without the need of human intervention to curate the data. This protocol leverages the capabilities of AiiDA, an open-source platform to manage and automate scientific computational workflows, and the TCOD, an open-access database storing computed materials properties using a well-defined and exhaustive ontology. Based on these, the complete procedure to deposit computed data in the TCOD database is automated. All relevant metadata are extracted from the full provenance information that AiiDA tracks and stores automatically while managing the calculations. Such a protocol also enables reproducibility of scientific data in the field of computational materials science. As a proof of concept, the AiiDA-TCOD interface is used to deposit 170 theoretical structures together with their computed properties and their full provenance graphs, consisting in over 4600 AiiDA nodes.",
                "authors": [
                    {
                        "name": "Merkys A."
                    },
                    {
                        "name": "Mounet N."
                    },
                    {
                        "name": "Cepellotti A."
                    },
                    {
                        "name": "Marzari N."
                    },
                    {
                        "name": "Grazulis S."
                    },
                    {
                        "name": "Pizzi G."
                    }
                ],
                "citationCount": 9,
                "date": "2017-11-14T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "A posteriori metadata from automated provenance tracking: Integration of AiiDA and TCOD"
            }
        },
        {
            "doi": "10.1038/S41597-020-00638-4",
            "metadata": {
                "abstract": "© 2020, The Author(s).The ever-growing availability of computing power and the sustained development of advanced computational methods have contributed much to recent scientific progress. These developments present new challenges driven by the sheer amount of calculations and data to manage. Next-generation exascale supercomputers will harden these challenges, such that automated and scalable solutions become crucial. In recent years, we have been developing AiiDA (aiida.net), a robust open-source high-throughput infrastructure addressing the challenges arising from the needs of automated workflow management and data provenance recording. Here, we introduce developments and capabilities required to reach sustained performance, with AiiDA supporting throughputs of tens of thousands processes/hour, while automatically preserving and storing the full data provenance in a relational database making it queryable and traversable, thus enabling high-performance data analytics. AiiDA’s workflow language provides advanced automation, error handling features and a flexible plugin model to allow interfacing with external simulation software. The associated plugin registry enables seamless sharing of extensions, empowering a vibrant user community dedicated to making simulations more robust, user-friendly and reproducible.",
                "authors": [
                    {
                        "name": "Huber S.P."
                    },
                    {
                        "name": "Zoupanos S."
                    },
                    {
                        "name": "Uhrin M."
                    },
                    {
                        "name": "Talirz L."
                    },
                    {
                        "name": "Kahle L."
                    },
                    {
                        "name": "Hauselmann R."
                    },
                    {
                        "name": "Gresch D."
                    },
                    {
                        "name": "Muller T."
                    },
                    {
                        "name": "Yakutovich A.V."
                    },
                    {
                        "name": "Andersen C.W."
                    },
                    {
                        "name": "Ramirez F.F."
                    },
                    {
                        "name": "Adorf C.S."
                    },
                    {
                        "name": "Gargiulo F."
                    },
                    {
                        "name": "Kumbhar S."
                    },
                    {
                        "name": "Passaro E."
                    },
                    {
                        "name": "Johnston C."
                    },
                    {
                        "name": "Merkys A."
                    },
                    {
                        "name": "Cepellotti A."
                    },
                    {
                        "name": "Mounet N."
                    },
                    {
                        "name": "Marzari N."
                    },
                    {
                        "name": "Kozinsky B."
                    },
                    {
                        "name": "Pizzi G."
                    }
                ],
                "citationCount": 16,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "AiiDA 1.0, a scalable computational infrastructure for automated reproducible workflows and data provenance"
            },
            "pmcid": "PMC7479590",
            "pmid": "32901044"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1
}