{
    "additionDate": "2017-05-01T14:07:25Z",
    "biotoolsCURIE": "biotools:expasy",
    "biotoolsID": "expasy",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.expasy.org/support"
        }
    ],
    "description": "ExPASy is the bioinformatics resource portal for access to programs and databases for the analysis of proteomics, genomics, phylogeny, systems biology, population genetics, transcriptomics etc.",
    "documentation": [
        {
            "type": "General",
            "url": "https://www.expasy.org/links"
        }
    ],
    "editPermission": {
        "authors": [
            "hstockin",
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Switzerland"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://www.expasy.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-03-26T08:16:32Z",
    "name": "ExPASy",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hstockin",
    "publication": [
        {
            "metadata": {
                "abstract": "The ExPASy (the Expert Protein Analysis System) World Wide Web server (http://www.expasy.org), is provided as a service to the life science community by a multidisciplinary team at the Swiss Institute of Bioinformatics (SIB). It provides access to a variety of databases and analytical tools dedicated to proteins and proteomics. ExPASy databases include SWISS-PROT and TrEMBL, SWISS-2DPAGE, PROSITE, ENZYME and the SWISS-MODEL repository. Analysis tools are available for specific tasks relevant to proteomics, similarity searches, pattern and profile searches, post-translational modification prediction, topology prediction, primary, secondary and tertiary structure analysis and sequence alignment. These databases and tools are tightly interlinked: a special emphasis is placed on integration of database entries with related resources developed at the SIB and elsewhere, and the proteomics tools have been designed to read the annotations in SWISS-PROT in order to enhance their predictions. ExPASy started to operate in 1993, as the first WWW server in the field of life sciences. In addition to the main site in Switzerland, seven mirror sites in different continents currently serve the user community.",
                "authors": [
                    {
                        "name": "Gasteiger E."
                    },
                    {
                        "name": "Gattiker A."
                    },
                    {
                        "name": "Hoogland C."
                    },
                    {
                        "name": "Ivanyi I."
                    },
                    {
                        "name": "Appel R.D."
                    },
                    {
                        "name": "Bairoch A."
                    }
                ],
                "citationCount": 2185,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ExPASy: The proteomics server for in-depth protein knowledge and analysis"
            },
            "pmid": "12824418"
        },
        {
            "metadata": {
                "abstract": "ExPASy (http://www.expasy.org) has worldwide reputation as one of the main bioinformatics resources for proteomics. It has now evolved, becoming an extensible and integrative portal accessing many scientific resources, databases and software tools in different areas of life sciences. Scientists can henceforth access seamlessly a wide range of resources in many different domains, such as proteomics, genomics, phylogeny/evolution, systems biology, population genetics, transcriptomics, etc. The individual resources (databases, web-based and downloadable software tools) are hosted in a 'decentralized' way by different groups of the SIB Swiss Institute of Bioinformatics and partner institutions. Specifically, a single web portal provides a common entry point to a wide range of resources developed and operated by different SIB groups and external institutions. The portal features a search function across 'selected' resources. Additionally, the availability and usage of resources are monitored. The portal is aimed for both expert users and people who are not familiar with a specific domain in life sciences. The new web interface provides, in particular, visual guidance for newcomers to ExPASy. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Artimo P."
                    },
                    {
                        "name": "Jonnalagedda M."
                    },
                    {
                        "name": "Arnold K."
                    },
                    {
                        "name": "Baratin D."
                    },
                    {
                        "name": "Csardi G."
                    },
                    {
                        "name": "De Castro E."
                    },
                    {
                        "name": "Duvaud S."
                    },
                    {
                        "name": "Flegel V."
                    },
                    {
                        "name": "Fortier A."
                    },
                    {
                        "name": "Gasteiger E."
                    },
                    {
                        "name": "Grosdidier A."
                    },
                    {
                        "name": "Hernandez C."
                    },
                    {
                        "name": "Ioannidis V."
                    },
                    {
                        "name": "Kuznetsov D."
                    },
                    {
                        "name": "Liechti R."
                    },
                    {
                        "name": "Moretti S."
                    },
                    {
                        "name": "Mostaguir K."
                    },
                    {
                        "name": "Redaschi N."
                    },
                    {
                        "name": "Rossier G."
                    },
                    {
                        "name": "Xenarios I."
                    },
                    {
                        "name": "Stockinger H."
                    }
                ],
                "citationCount": 585,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ExPASy: SIB bioinformatics resource portal"
            },
            "pmid": "22661580"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}