{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T14:05:01.519543Z",
    "biotoolsCURIE": "biotools:tox-gan",
    "biotoolsID": "tox-gan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "weida.tong@fda.hhs.gov",
            "name": "Weida Tong",
            "typeEntity": "Person"
        },
        {
            "email": "zhichao.liu@fda.hhs.gov",
            "name": "Zhichao Liu",
            "typeEntity": "Person"
        },
        {
            "name": "Ruth Roberts",
            "orcidid": "https://orcid.org/0000-0002-7763-7558"
        },
        {
            "name": "Xi Chen",
            "orcidid": "https://orcid.org/0000-0003-3459-4217"
        }
    ],
    "description": "An Artificial Intelligence Approach Alternative to Animal Studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XC-NCTR/Tox-GAN",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-06-08T14:05:01.522013Z",
    "license": "Not licensed",
    "name": "Tox-GAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/TOXSCI/KFAB157",
            "metadata": {
                "abstract": "© 2021 Published by Oxford University Press on behalf of the Society of Toxicology 2021. This work is written by US Government employees and is in the public domain in the US.Animal studies are a critical component in biomedical research, pharmaceutical product development, and regulatory submissions. There is a worldwide effort in toxicology toward \"reducing, refining, and replacing\"animal use. Here, we proposed a deep generative adversarial network (GAN)-based framework capable of deriving new animal results from existing animal studies without additional experiments. To prove the concept, we employed this Tox-GAN framework to generate both gene activities and expression profiles for multiple doses and treatment durations in toxicogenomics (TGx). Using the pre-existing rat liver TGx data from the Open Toxicogenomics Project-Genomics-Assisted Toxicity Evaluation System (Open TG-GATES), we generated Tox-GAN transcriptomic profiles with high similarity (0.997 ± 0.002 in intensity and 0.740 ± 0.082 in fold change) to the corresponding real gene expression profiles. Consequently, Tox-GAN showed an outstanding performance in 2 critical TGx applications, gaining a molecular understanding of underlying toxicological mechanisms and gene expression-based biomarker development. For the former, over 87% agreement in Gene Ontology was found between Tox-GAN results and real gene expression data. For the latter, the concordance of biomarkers between real and generated data was high in both predictive performance and biomarker genes. We also demonstrated that the Tox-GAN models constructed with the Open TG-GATES data were capable of generating transcriptomic profiles reported in DrugMatrix. Finally, we demonstrated potential utility for Tox-GAN in aiding chemical-based read-across. To the best of our knowledge, the proposed Tox-GAN model is novel in its ability to generate in vivo transcriptomic profiles at different treatment conditions from chemical structures. Overall, Tox-GAN holds great promise for generating high-quality toxicogenomic profiles without animal experimentation.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Roberts R."
                    },
                    {
                        "name": "Tong W."
                    }
                ],
                "citationCount": 1,
                "date": "2022-04-01T00:00:00Z",
                "journal": "Toxicological Sciences",
                "title": "Tox-GAN: An Artificial Intelligence Approach Alternative to Animal Studies - A Case Study with Toxicogenomics"
            },
            "pmid": "34971401"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Animal study",
            "uri": "http://edamontology.org/topic_3679"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
