{
    "additionDate": "2020-01-09T17:54:39Z",
    "biotoolsCURIE": "biotools:BWMR",
    "biotoolsID": "BWMR",
    "confidence_flag": "tool",
    "description": "Bayesian weighted Mendelian randomization for causal inference based on summary statistics.\n\nBWMR (Bayesian Weighted Mendelian Randomization).\n\nCode for the experiments in BWMR.\n\nBWMR (Bayesian Weighted Mendelian Randomization), is an efficient statistical method to infer the causality between a risk exposure factor and a trait or disease outcome, based on GWAS summary statistics. 'BWMR' package provides the estimate of causal effect with its standard error and the P-value under the test of causality",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jiazhao97/BWMR",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-09T16:11:10Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jiazhao97/sim-BWMR"
        }
    ],
    "name": "BWMR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ749",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: The results from Genome-Wide Association Studies (GWAS) on thousands of phenotypes provide an unprecedented opportunity to infer the causal effect of one phenotype (exposure) on another (outcome). Mendelian randomization (MR), an instrumental variable (IV) method, has been introduced for causal inference using GWAS data. Due to the polygenic architecture of complex traits/diseases and the ubiquity of pleiotropy, however, MR has many unique challenges compared to conventional IV methods. Results: We propose a Bayesian weighted Mendelian randomization (BWMR) for causal inference to address these challenges. In our BWMR model, the uncertainty of weak effects owing to polygenicity has been taken into account and the violation of IV assumption due to pleiotropy has been addressed through outlier detection by Bayesian weighting. To make the causal inference based on BWMR computationally stable and efficient, we developed a variational expectation-maximization (VEM) algorithm. Moreover, we have also derived an exact closed-form formula to correct the posterior covariance which is often underestimated in variational inference. Through comprehensive simulation studies, we evaluated the performance of BWMR, demonstrating the advantage of BWMR over its competitors. Then we applied BWMR to make causal inference between 130 metabolites and 93 complex human traits, uncovering novel causal relationship between exposure and outcome traits.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Ming J."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Zhao J."
                    }
                ],
                "citationCount": 6,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Bayesian weighted Mendelian randomization for causal inference based on summary statistics"
            },
            "pmid": "31593215"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
