
{
    "credit": [
        {
            "email": "avi.maayan@mssm.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://icahn.mssm.edu/research/labs/maayan-laboratory"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.maayanlab.net/X2K/documentation.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/x2k-1-6-1207-mrna-profiling-linked-multiple-upstream-regulatory-layers.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Genome-wide mRNA profiling provides a snapshot of the global state of cells under different conditions. However, mRNA levels do not provide direct understanding of upstream regulatory mechanisms. Here, we present a new approach called Expression2Kinases (X2K) to identify upstream regulators likely responsible for observed patterns in genome-wide gene expression. By integrating chromatin immuno-precipitation (ChIP)-seq/chip and position weight matrices (PWMs) data, protein-protein interactions and kinase-substrate phosphorylation reactions, we can better identify regulatory mechanisms upstream of genome-wide differences in gene expression. We validated X2K by applying it to recover drug targets of food and drug administration (FDA)-approved drugs from drug perturbations followed by mRNA expression profiling; to map the regulatory landscape of 44 stem cells and their differentiating progeny; to profile upstream regulatory mechanisms of 327 breast cancer tumors; and to detect pathways from profiled hepatic stellate cells and hippocampal neurons. The X2K approach can advance our understanding of cell signaling and unravel drugs mechanisms of action. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Chen E.Y.",
                "Xu H.",
                "Gordonov S.",
                "Lim M.P.",
                "Perkins M.H.",
                "Ma'ayan A."
            ],
            "cit_count": 57,
            "journal": "Bioinformatics",
            "pmid": "22080467",
            "title": "Expression2Kinases: mRNA profiling linked to multiple upstream regulatory layers",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:x2k",
        "biotoolsID": "x2k",
        "description": "Method to identify upstream regulators likely responsible for observed patterns in genome-wide gene expression. By integrating ChIP-seq/chip and position-weight-matrices (PWMs) data, protein-protein interactions, and kinase-substrate phosphorylation reactions, it can better identify regulatory mechanisms upstream of genome-wide differences in gene expression.",
        "homepage": "http://www.maayanlab.net/X2K",
        "name": "X2K"
    }
}