{
    "additionDate": "2018-08-04T13:06:09Z",
    "biotoolsCURIE": "biotools:decostar",
    "biotoolsID": "decostar",
    "credit": [
        {
            "email": "Eric.Tannier@inria.fr",
            "name": "Eric Tannier",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Reconstructing the Ancestral Organization of Genes or Genomes Using Reconciled Phylogenies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pbil.univ-lyon1.fr/software/DeCoSTAR/use.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://pbil.univ-lyon1.fr/software/DeCoSTAR/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "DeCoSTAR",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gbe/evx069",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.DeCoSTAR is a software that aims at reconstructing the organization of ancestral genes or genomes in the form of sets of neighborhood relations (adjacencies) between pairs of ancestral genes or gene domains. It can also improve the assembly of fragmented genomes by proposing evolutionary-induced adjacencies between scaffolding fragments. Ancestral genes or domains are deduced from reconciled phylogenetic trees under an evolutionarymodel that considers gains, losses, speciations, duplications, and transfers as possible events for gene evolution. Reconciliations are either given as input or computed with the ecceTERA package, into which DeCoSTAR is integrated. DeCoSTAR computes adjacency evolutionary scenarios using a scoring scheme based on aweighted sum of adjacency gains and breakages. Solutions, both optimal and near-optimal, are sampled according to the Boltzmann-Gibbs distribution centered around parsimonious solutions, and statistical supports on ancestral and extant adjacencies are provided.DeCoSTAR supports the features of previously contributed tools that reconstruct ancestral adjacencies, namely DeCo, DeCoLT, ART-DeCo, and DeClone. In a fewminutes, DeCoSTAR can reconstruct the evolutionary history of domains inside genes, of gene fusion and fission events, or of gene order along chromosomes, for large data sets including dozens of whole genomes from all kingdoms of life. We illustrate the potential of DeCoSTAR with several applications: ancestral reconstruction of gene orders for Anopheles mosquito genomes, multidomain proteins in Drosophila, and gene fusion and fission detection in Actinobacteria.",
                "authors": [
                    {
                        "name": "Anselmetti Y."
                    },
                    {
                        "name": "Berard S."
                    },
                    {
                        "name": "Chauve C."
                    },
                    {
                        "name": "Daubin V."
                    },
                    {
                        "name": "Duchemin W."
                    },
                    {
                        "name": "Patterson M."
                    },
                    {
                        "name": "Ponty Y."
                    },
                    {
                        "name": "Scornavacca C."
                    },
                    {
                        "name": "Tannier E."
                    }
                ],
                "citationCount": 23,
                "date": "2017-05-01T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "DeCoSTAR: Reconstructing the ancestral organization of genes or genomes using reconciled phylogenies"
            },
            "pmcid": "PMC5441342",
            "pmid": "28402423"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}
