{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T13:16:22.608649Z",
    "biotoolsCURIE": "biotools:oasismove",
    "biotoolsID": "oasismove",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kvs@simula.no",
            "name": "Kristian Valen-Sendstad",
            "orcidid": "https://orcid.org/0000-0002-2907-0171"
        }
    ],
    "description": "A verified and validated moving domain computational fluid dynamics solver with applications to cardiovascular flows.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KVSlab/OasisMove/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:29:50.295038Z",
    "license": "GPL-3.0",
    "name": "OasisMove",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/cnm.3703",
            "metadata": {
                "abstract": "Computational fluid dynamics (CFD) in combination with patient-specific medical images has been used to correlate flow phenotypes with disease initiation, progression and outcome, in search of a prospective clinical tool. A large number of CFD software packages are available, but are typically based on rigid domains and low-order finite volume methods, and are often implemented in massive low-level C++ libraries. Furthermore, only a handful of solvers have been appropriately verified and validated for their intended use. Our goal was to develop, verify and validate an open-source CFD solver for moving domains, with applications to cardiovascular flows. The solver is an extension of the CFD solver Oasis, which is based on the finite element method and implemented using the FEniCS open source framework. The new solver, named OasisMove, extends Oasis by expressing the Navier–Stokes equations in the arbitrary Lagrangian–Eulerian formulation, which is suitable for handling moving domains. For code verification we used the method of manufactured solutions for a moving 2D vortex problem, and for validation we compared our results against existing high-resolution simulations and laboratory experiments for two moving domain problems of varying complexity. Verification results showed that the (Formula presented.) error followed the theoretical convergence rates. The temporal accuracy was second-order, while the spatial accuracy was second- and third-order using (Formula presented.) and (Formula presented.) finite elements, respectively. Validation results showed good agreement with existing benchmark results, by reproducing lift and drag coefficients with less than 1% error, and demonstrating the solver's ability to capture vortex patterns in transitional and turbulent-like flow regimes. In conclusion, we have shown that OasisMove is an open-source, accurate and reliable solver for cardiovascular flows in moving domains.",
                "authors": [
                    {
                        "name": "Kjeldsberg H.A."
                    },
                    {
                        "name": "Sundnes J."
                    },
                    {
                        "name": "Valen-Sendstad K."
                    }
                ],
                "citationCount": 3,
                "date": "2023-06-01T00:00:00Z",
                "journal": "International Journal for Numerical Methods in Biomedical Engineering",
                "title": "A verified and validated moving domain computational fluid dynamics solver with applications to cardiovascular flows"
            },
            "pmid": "37020156",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
