{
    "additionDate": "2021-01-18T11:21:35Z",
    "biotoolsCURIE": "biotools:rasp-rna",
    "biotoolsID": "rasp-rna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qczhang@mail.tsinghua.edu.cn",
            "name": "Qiangfeng Cliff Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "an atlas of transcriptome-wide RNA secondary structure probing data.\n\n\nRASP (RNA Alatas of Structure Probing) is a transcriptome-scale RNA structure probing database. Currently, RASP contains 161 deduplicated transcriptome-wide RNA secondary structure probing datasets from 38 papers. RASP covers 18 species across animals, plants, bacteria, fungi, and also viruses, and categorizes 18 experimental methods including DMS-Seq, SHAPE-Seq, SHAPE-MaP, and icSHAPE, etc. RASP also provides a user-friendly interface to query, browse, and visualize RNA structure profiles, offering a shortcut to accessing RNA secondary structures grounded in experimental data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                }
            ]
        }
    ],
    "homepage": "http://rasp.zhanglab.net",
    "lastUpdate": "2021-02-03T15:22:16Z",
    "name": "RASP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA880",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.RNA molecules fold into complex structures that are important across many biological processes. Recent technological developments have enabled transcriptome-wide probing of RNA secondary structure using nucleases and chemical modifiers. These approaches have been widely applied to capture RNA secondary structure in many studies, but gathering and presenting such data from very different technologies in a comprehensive and accessible way has been challenging. Existing RNA structure probing databases usually focus on low-throughput or very specific datasets. Here, we present a comprehensive RNA structure probing database called RASP (RNA Atlas of Structure Probing) by collecting 161 deduplicated transcriptome-wide RNA secondary structure probing datasets from 38 papers. RASP covers 18 species across animals, plants, bacteria, fungi, and also viruses, and categorizes 18 experimental methods including DMS-seq, SHAPE-Seq, SHAPE-MaP, and icSHAPE, etc. Specially, RASP curates the up-to-date datasets of several RNA secondary structure probing studies for the RNA genome of SARS-CoV-2, the RNA virus that caused the on-going COVID-19 pandemic. RASP also provides a user-friendly interface to query, browse, and visualize RNA structure profiles, offering a shortcut to accessing RNA secondary structures grounded in experimental data. The database is freely available at http://rasp.zhanglab.net.",
                "authors": [
                    {
                        "name": "Li P."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Xu K."
                    },
                    {
                        "name": "Zhang Q.C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RASP: An atlas of transcriptome-wide RNA secondary structure probing data"
            },
            "pmid": "33068412"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}