{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:04:19Z",
    "biotoolsCURIE": "biotools:VCF-Server",
    "biotoolsID": "VCF-Server",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "huilu@sjtu.edu.cn",
            "name": "Hui Lu",
            "orcidid": "https://orcid.org/0000-0001-8347-0830",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web-based visualization tool for high-throughput variant data mining and management.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://diseasegps.sjtu.edu.cn/templates/default/pdf/VCF-Server-Manual-EN.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "http://diseasegps.sjtu.edu.cn/VCF-Server?lan=eng",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/biojiang/VCF-Server"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/biojiang/VCF-Server-docker/issues"
        }
    ],
    "maturity": "Mature",
    "name": "VCF-Server",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1002/MGG3.641",
            "metadata": {
                "abstract": "© 2019 The Authors. Molecular Genetics & Genomic Medicine published by Wiley Periodicals, Inc.Background: Next-generation sequencing (NGS) has been widely used in both clinics and research. It has become the most powerful tool for diagnosing genetic disorders and investigating disease etiology through the discovery of genetic variants. Variants identified by NGS are stored in variant call format (VCF) files. However, querying and filtering VCF files are extremely difficult for researchers without programming skills. Furthermore, as the mutation data are increasing exponentially, there is an urgent need to develop tools to manage these variant data in a centralized way. Methods: The VCF-Server was developed as a web-based visualization tool to support the interactive analysis of genetic variant data. It allows researchers and medical geneticists to manage, annotate, filter, query, and export variants in a fast and effective way. Results: In this study, we developed the VCF-Server, a powerful and easily accessible tool for researchers and medical geneticists to perform variant analysis. Users can query VCFs, annotate, and filter variants without knowing programming code. Once the VCF file is uploaded, VCF-Server allows users to annotate the VCF with commonly used databases or user-defined variant annotations (including variant blacklist and whitelist). Variant information in the VCF is shown visually via the interactive graphical interface. Users can filter the variants with flexible filtering rules, and the prioritized variants can be exported locally for further analysis. As VCF-Server adopts a web file system, files in the VCF-Server can be stored and managed in a centralized way. Moreover, VCF-Server allows direct web-based analysis (accessible through either desktop computers or mobile devices) as well as local deployment. Conclusions: With an easy-to-use graphical interface, VCF-Server allows researchers with little bioinformatics background to explore and mine mutation data, which may broaden the application of NGS technology in clinics and research. The tool is freely available for use at https://www.diseasegps.org/VCF-Server?lan = eng.",
                "authors": [
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Gu J."
                    },
                    {
                        "name": "Zhao T."
                    },
                    {
                        "name": "Lu H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomic Medicine",
                "title": "VCF-Server: A web-based visualization tool for high-throughput variant data mining and management"
            },
            "pmcid": "PMC6625089",
            "pmid": "31127704",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}