{
    "additionDate": "2021-01-18T08:03:39Z",
    "biotoolsCURIE": "biotools:pesm",
    "biotoolsID": "pesm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "duangh@csu.edu.cn",
            "name": "Guihua Duan",
            "typeEntity": "Person"
        }
    ],
    "description": "PESM is for predicting the essentiality of miRNAs based on gradient boosting machines and sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinfomaticsCSU/PESM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T09:15:06Z",
    "name": "PESM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3426-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: MicroRNAs (miRNAs) are a kind of small noncoding RNA molecules that are direct posttranscriptional regulations of mRNA targets. Studies have indicated that miRNAs play key roles in complex diseases by taking part in many biological processes, such as cell growth, cell death and so on. Therefore, in order to improve the effectiveness of disease diagnosis and treatment, it is appealing to develop advanced computational methods for predicting the essentiality of miRNAs. Result: In this study, we propose a method (PESM) to predict the miRNA essentiality based on gradient boosting machines and miRNA sequences. First, PESM extracts the sequence and structural features of miRNAs. Then it uses gradient boosting machines to predict the essentiality of miRNAs. We conduct the 5-fold cross-validation to assess the prediction performance of our method. The area under the receiver operating characteristic curve (AUC), F-measure and accuracy (ACC) are used as the metrics to evaluate the prediction performance. We also compare PESM with other three competing methods which include miES, Gaussian Naive Bayes and Support Vector Machine. Conclusion: The results of experiments show that PESM achieves the better prediction performance (AUC: 0.9117, F-measure: 0.8572, ACC: 0.8516) than other three computing methods. In addition, the relative importance of all features also further shows that newly added features can be helpful to improve the prediction performance of methods.",
                "authors": [
                    {
                        "name": "Duan G."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Yan C."
                    }
                ],
                "date": "2020-03-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PESM: Predicting the essentiality of miRNAs based on gradient boosting machines and sequences"
            },
            "pmcid": "PMC7079416",
            "pmid": "32183740"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
