{
    "additionDate": "2016-10-02T23:49:16Z",
    "biotoolsCURIE": "biotools:genomics_virtual_lab",
    "biotoolsID": "genomics_virtual_lab",
    "credit": [
        {
            "name": "Victorian Life Sciences Computation Initiative (VLSCI)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "The University of Queensland (RCC)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "NeCTAR",
            "typeEntity": "Consortium"
        },
        {
            "name": "funding from the NeCTAR project",
            "typeEntity": "Funding agency",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "unimelb.edu.au",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "help@genome.edu.au",
            "name": "Australia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genome.edu.au/help/gvl-help"
        }
    ],
    "description": "A virtual laboratory for genomics research and training.",
    "documentation": [
        {
            "type": [
                "Terms of use",
                "Citation instructions"
            ],
            "url": "http://genome.edu.au/about/about-the-gvl-project#acknowledge"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://genome.edu.au/help/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "It provides a cloud-based suite of genomics analysis tools that would normally require specialist assistance.",
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://genome.edu.au/",
    "lastUpdate": "2019-01-11T01:45:57Z",
    "name": "Genomics Virtual Lab",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mv.schneider@unimelb.edu.au",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0140829",
            "metadata": {
                "abstract": "© 2015 Afgan et al.This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background: Analyzing high throughput genomics data is a complex and compute intensive task, generally requiring numerous software tools and large reference data sets, tied together in successive stages of data transformation and visualisation. A computational platform enabling best practice genomics analysis ideally meets a number of requirements, including: a wide range of analysis and visualisation tools, closely linked to large user and reference data sets; workflow platform(s) enabling accessible, reproducible, portable analyses, through a flexible set of interfaces; highly available, scalable computational resources; and flexibility and versatility in the use of these resources to meet demands and expertise of a variety of users. Access to an appropriate computational platform can be a significant barrier to researchers, as establishing such a platform requires a large upfront investment in hardware, experience, and expertise. Results: We designed and implemented the Genomics Virtual Laboratory (GVL) as a middleware layer of machine images, cloud management tools, and online services that enable researchers to build arbitrarily sized compute clusters on demand, pre-populated with fully configured bioinformatics tools, reference datasets and workflow and visualisation options. The platform is flexible in that users can conduct analyses through web-based (Galaxy, RStudio, IPython Notebook) or command-line interfaces, and add/remove compute nodes and data resources as required. Best-practice tutorials and protocols provide a path from introductory training to practice. The GVL is available on the OpenStack-based Australian Research Cloud (http://nectar.org.au) and the Amazon Web Services cloud. The principles, implementation and build process are designed to be cloud-agnostic. Conclusions: This paper provides a blueprint for the design and implementation of a cloud-based Genomics Virtual Laboratory. We discuss scope, design considerations and technical and logistical constraints, and explore the value added to the research community through the suite of services and resources provided by our implementation.",
                "authors": [
                    {
                        "name": "Afgan E."
                    },
                    {
                        "name": "Sloggett C."
                    },
                    {
                        "name": "Goonasekera N."
                    },
                    {
                        "name": "Makunin I."
                    },
                    {
                        "name": "Benson D."
                    },
                    {
                        "name": "Crowe M."
                    },
                    {
                        "name": "Gladman S."
                    },
                    {
                        "name": "Kowsar Y."
                    },
                    {
                        "name": "Pheasant M."
                    },
                    {
                        "name": "Horst R."
                    },
                    {
                        "name": "Lonie A."
                    }
                ],
                "citationCount": 61,
                "date": "2015-10-26T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Genomics Virtual Laboratory: A practical bioinformatics workbench for the cloud"
            },
            "pmcid": "PMC4621043",
            "pmid": "26501966",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}