{
    "additionDate": "2022-11-23T19:57:40.181581Z",
    "biotoolsCURIE": "biotools:travis_pies",
    "biotoolsID": "travis_pies",
    "collectionID": [
        "VIB"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Sam De Craemer",
            "orcidid": "https://orcid.org/0000-0003-4978-8188",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "Tracer metabolomics is a powerful technology for the biomedical community to study and understand disease-inflicted metabolic mechanisms. However, the interpretation of tracer metabolomics results is highly technical, as the metabolites' abundances, tracer incorporation and positions on the metabolic map all must be jointly interpreted. The field is currently lacking a structured approach to help less experienced researchers start the interpretation of tracer metabolomics datasets. We propose an approach using an intuitive visualization concept aided by a novel open-source tool, and provide guidelines on how researchers can apply the approach and the visualization tool to their own datasets. Using a showcase experiment, we demonstrate that the visualization approach leads to an intuitive interpretation that can ease researchers into understanding their tracer metabolomics data.",
    "documentation": [
        {
            "type": [
                "Release notes"
            ],
            "url": "https://github.com/vibbits/mec-shiny-apps"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/vibbits/mec-shiny-apps"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Belgium"
    ],
    "homepage": "https://mec-shiny.vib.be/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-23T20:20:33.706499Z",
    "license": "Apache-2.0",
    "name": "TraVis Pies",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.3390/metabo12070593",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Tracer metabolomics is a powerful technology for the biomedical community to study and understand disease-inflicted metabolic mechanisms. However, the interpretation of tracer metabolomics results is highly technical, as the metabolites’ abundances, tracer incorporation and positions on the metabolic map all must be jointly interpreted. The field is currently lacking a structured approach to help less experienced researchers start the interpretation of tracer metabolomics datasets. We propose an approach using an intuitive visualization concept aided by a novel opensource tool, and provide guidelines on how researchers can apply the approach and the visualization tool to their own datasets. Using a showcase experiment, we demonstrate that the visualization approach leads to an intuitive interpretation that can ease researchers into understanding their tracer metabolomics data.",
                "authors": [
                    {
                        "name": "De Craemer S."
                    },
                    {
                        "name": "Driesen K."
                    },
                    {
                        "name": "Ghesquiere B."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "TraVis Pies: A Guide for Stable Isotope Metabolomics Interpretation Using an Intuitive Visualization"
            },
            "pmcid": "PMC9321460",
            "pmid": "35888717",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}
