{
    "additionDate": "2021-01-18T10:08:23Z",
    "biotoolsCURIE": "biotools:sdtlu",
    "biotoolsID": "sdtlu",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Andrew L. Cohen",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for the signal detection analysis of eyewitness lineup data.\n\nIn a standard eyewitness lineup scenario, a witness observes a culprit commit a crime and is later asked to identify the culprit from a set of faces, the lineup. Signal detection theory (SDT), a powerful modeling framework for analyzing data, has recently become a common way to analyze lineup data. The goal of this paper is to introduce a new R package, sdtlu (Signal Detection Theory - LineUp), that streamlines and automates the SDT analysis of lineup data. sdtlu provides functions to process lineup data, determine the best-fitting SDT parameters, compute model-based performance measures such as area under the curve (AUC) and diagnosticity, use bootstrapping to determine uncertainty intervals around these parameters and measures, and compare parameters across two different data sets",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                }
            ]
        }
    ],
    "homepage": "https://osf.io/mfk4e/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-13T17:16:53Z",
    "name": "sdtlu",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3758/S13428-020-01402-7",
            "metadata": {
                "abstract": "© 2020, The Psychonomic Society, Inc.In a standard eyewitness lineup scenario, a witness observes a culprit commit a crime and is later asked to identify the culprit from a set of faces, the lineup. Signal detection theory (SDT), a powerful modeling framework for analyzing data, has recently become a common way to analyze lineup data. The goal of this paper is to introduce a new R package, sdtlu (Signal Detection Theory – LineUp), that streamlines and automates the SDT analysis of lineup data. sdtlu provides functions to process lineup data, determine the best-fitting SDT parameters, compute model-based performance measures such as area under the curve (AUC) and diagnosticity, use bootstrapping to determine uncertainty intervals around these parameters and measures, and compare parameters across two different data sets. The package incorporates closed-form solutions for both simultaneous and sequential lineups that allow for model-based analyses without Monte Carlo simulation. Show-ups are also supported. The package can estimate the base-rate of lineups that include a guilty suspect when the guilt or innocence of each suspect in the data set is unknown, as in “real-world” lineups. The package can also produce a full set of graphs, including data and model-based ROC curves and the underlying SDT model.",
                "authors": [
                    {
                        "name": "Cohen A.L."
                    },
                    {
                        "name": "Starns J.J."
                    },
                    {
                        "name": "Rotello C.M."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "sdtlu: An R package for the signal detection analysis of eyewitness lineup data"
            },
            "pmid": "32700238"
        }
    ]
}