{
    "additionDate": "2021-10-09T18:30:00.985959Z",
    "biotoolsCURIE": "biotools:mdpet",
    "biotoolsID": "mdpet",
    "confidence_flag": "tool",
    "description": "MDPET is a unified motion correction and denoising adversarial network for low-dose gated PET.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bbbbbbzhou/MDPET",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-10-09T18:30:00.988672Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bbbbbbzhou/MDPET/issues"
        }
    ],
    "name": "MDPET",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3076191",
            "metadata": {
                "abstract": "CCBYIn positron emission tomography (PET), gating is commonly utilized to reduce respiratory motion blurring and to facilitate motion correction methods. In application where low-dose gated PET is useful, reducing injection dose causes increased noise levels in gated images that could corrupt motion estimation and subsequent corrections, leading to inferior image quality. To address these issues, we propose MDPET, a unified motion correction and denoising adversarial network for generating motion-compensated low-noise images from low-dose gated PET data. Specifically, we proposed a Temporal Siamese Pyramid Network (TSP-Net) with basic units made up of 1.) Siamese Pyramid Network (SP-Net), and 2.) a recurrent layer for motion estimation among the gates. The denoising network is unified with our motion estimation network to simultaneously correct the motion and predict a motion-compensated denoised PET reconstruction. The experimental results on human data demonstrated that our MDPET can generate accurate motion estimation directly from low-dose gated images and produce high-quality motion-compensated low-noise reconstructions. Comparative studies with previous methods also show that our MDPET is able to generate superior motion estimation and denoising performance. Our code is available at https://github.com/bbbbbbzhou/MDPET.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Duncan J.S."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Tsai Y."
                    },
                    {
                        "name": "Zhou B."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "MDPET: A Unified Motion Correction and Denoising Adversarial Network for Low-dose Gated PET"
            },
            "pmid": "33909561",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
