{
    "additionDate": "2021-01-18T08:38:26Z",
    "biotoolsCURIE": "biotools:squamatabase",
    "biotoolsID": "squamatabase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mgru@umich.edu",
            "name": "Michael C. Grundler",
            "orcidid": "https://orcid.org/0000-0003-0729-6687",
            "typeEntity": "Person"
        }
    ],
    "description": "a natural history database and R package for comparative biology of snake feeding habits.\n\nSquamatabase is a database of prey items recorded in diet samples from the world's snakes, compiled by me, during my time as a PhD student at the University of Michigan.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/blueraleigh/squamatabase",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-21T15:08:19Z",
    "name": "SquamataBase",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3897/BDJ.8.E49943",
            "metadata": {
                "abstract": "© Grundler M.Public databases in taxonomy, phylogenetics and geographic and fossil occurrence records are key research tools that provide raw materials, on which broad-scale analyses and synthesis in their respective fields are based. Comparable repositories for natural history observations are rare. Publicly available natural history data on traits like diet, habitat and reproduction are scattered across an extensive primary literature and remain relatively inaccessible to researchers interested in using these data for broad-scale analyses in macroecology and macroevolution. In this paper, I introduce SquamataBase, an open-source R package and database of predator-prey records involving the world's snakes. SquamataBase facilitates the discovery of natural history observations for use in comparative analyses and synthesis and, in its current form, contains observations of at least 18,304 predator individuals comprising 1,227 snake species and at least 58,633 prey items comprising 3,231 prey taxa. To facilitate integration with comparative analysis workflows, the data are distributed inside an R package, which also provides basic functionality for common data manipulation and filtering operations. Moving forward, the continued development of public natural history databases and their integration with existing digitisation efforts in biodiversity science should become a priority.",
                "authors": [
                    {
                        "name": "Grundler M.C."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Biodiversity Data Journal",
                "title": "SquamataBase: A natural history database and R package for comparative biology of snake feeding habits"
            },
            "pmcid": "PMC7125237",
            "pmid": "32269478"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}