{
    "additionDate": "2021-06-14T13:06:45Z",
    "biotoolsCURIE": "biotools:attnsleep",
    "biotoolsID": "attnsleep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "emad0002@e.ntu.edu.sg",
            "name": "Emadeldeen Eldele",
            "orcidid": "https://orcid.org/0000-0002-9282-0991",
            "url": "https://emadeldeen24.github.io/"
        }
    ],
    "description": "AttnSleep an attention-based deep learning approach for sleep stage classification with single-channel EEG.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/emadeldeen24/AttnSleep",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-08-13T08:53:17Z",
    "license": "MIT",
    "name": "AttnSleep",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TNSRE.2021.3076234",
            "metadata": {
                "abstract": "© 2001-2011 IEEE.Automatic sleep stage mymargin classification is of great importance to measure sleep quality. In this paper, we propose a novel attention-based deep learning architecture called AttnSleep to classify sleep stages using single channel EEG signals. This architecture starts with the feature extraction module based on multi-resolution convolutional neural network (MRCNN) and adaptive feature recalibration (AFR). The MRCNN can extract low and high frequency features and the AFR is able to improve the quality of the extracted features by modeling the inter-dependencies between the features. The second module is the temporal context encoder (TCE) that leverages a multi-head attention mechanism to capture the temporal dependencies among the extracted features. Particularly, the multi-head attention deploys causal convolutions to model the temporal relations in the input features. We evaluate the performance of our proposed AttnSleep model using three public datasets. The results show that our AttnSleep outperforms state-of-the-art techniques in terms of different evaluation metrics. Our source codes, experimental data, and supplementary materials are available at https://github.com/emadeldeen24/AttnSleep.",
                "authors": [
                    {
                        "name": "Eldele E."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Kwoh C.-K."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Guan C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Systems and Rehabilitation Engineering",
                "title": "An Attention-Based Deep Learning Approach for Sleep Stage Classification with Single-Channel EEG"
            },
            "pmid": "33909566"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}