{
    "additionDate": "2017-02-14T09:34:19Z",
    "biotoolsCURIE": "biotools:guidance",
    "biotoolsID": "guidance",
    "credit": [
        {
            "email": "bioSequence@tauex.tau.ac.il",
            "name": "GUIDANCE Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Assess alignment confidence scores for the identification of unreliable alignment regions. Users input a set of unaligned sequences, output is a graphic visualization of the alignment with confidence scores at each residue.",
    "documentation": [
        {
            "type": "General",
            "url": "http://guidance.tau.ac.il/ver2/overview.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Representative sequence identification",
                    "uri": "http://edamontology.org/operation_2233"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://guidance.tau.ac.il",
    "language": [
        "Ruby",
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "GUIDANCE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Evaluating the accuracy of multiple sequence alignment (MSA) is critical for virtually every comparative sequence analysis that uses an MSA as input. Here we present the GUIDANCE web-server, a userfriendly, open access tool for the identification of unreliable alignment regions. The web-server accepts as input a set of unaligned sequences. The server aligns the sequences and provides a simple graphic visualization of the confidence score of each column, residue and sequence of an alignment, using a color-coding scheme. The method is generic and the user is allowed to choose the alignment algorithm (ClustalW, MAFFT and PRANK are supported) as well as any type of molecular sequences (nucleotide, protein or codon sequences). The server implements two different algorithms for evaluating confidence scores: (i) the heads-or-tails (HoT) method, which measures alignment uncertainty due to co-optimal solutions; (ii) the GUIDANCE method, which measures the robustness of the alignment to guide-tree uncertainty. The server projects the confidence scores onto the MSA and points to columns and sequences that are unreliably aligned. These can be automatically removed in preparation for downstream analyses. GUIDANCE is freely available for use at http://guidance.tau.ac.il. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Penn O."
                    },
                    {
                        "name": "Privman E."
                    },
                    {
                        "name": "Ashkenazy H."
                    },
                    {
                        "name": "Landan G."
                    },
                    {
                        "name": "Graur D."
                    },
                    {
                        "name": "Pupko T."
                    }
                ],
                "citationCount": 352,
                "date": "2010-05-22T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GUIDANCE: A web server for assessing alignment confidence scores"
            },
            "pmid": "20497997"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}