{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2017-01-13T13:14:39Z",
    "biotoolsCURIE": "biotools:fusionmap",
    "biotoolsID": "fusionmap",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fusionmapauthors@gmail.com",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Detects fusion events in both single- and paired-end datasets from either RNA-Seq or gDNA-Seq studies and characterize fusion junctions at base-pair resolution.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.arrayserver.com/wiki/index.php?title=FusionMap"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Split read mapping",
                    "uri": "http://edamontology.org/operation_3199"
                }
            ]
        }
    ],
    "homepage": "http://www.arrayserver.com/wiki/index.php?title=FusionMap",
    "language": [
        "C#"
    ],
    "lastUpdate": "2019-07-22T09:45:44Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "FusionMap",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Next generation sequencing technology generates highthroughput data, which allows us to detect fusion genes at both transcript and genomic levels. To detect fusion genes, the current bioinformatics tools heavily rely on paired-end approaches and overlook the importance of reads that span fusion junctions. Thus there is a need to develop an efficient aligner to detect fusion events by accurate mapping of these junction-spanning single reads, particularly when the read gets longer with the improvement in sequencing technology. Results: We present a novel method, FusionMap, which aligns fusion reads directly to the genome without prior knowledge of potential fusion regions. FusionMap can detect fusion events in both single- and paired-end datasets from either RNA-Seq or gDNA-Seq studies and characterize fusion junctions at base-pair resolution. We showed that FusionMap achieved high sensitivity and specificity in fusion detection on two simulated RNA-Seq datasets, which contained 75 nt paired-end reads. FusionMap achieved substantially higher sensitivity and specificity than the paired-end approach when the inner distance between read pairs was small. Using FusionMap to characterize fusion genes in K562 chronic myeloid leukemia cell line, we further demonstrated its accuracy in fusion detection in both single-end RNA-Seq and gDNA-Seq datasets. These combined results show that FusionMap provides an accurate and systematic solution to detecting fusion events through junction-spanning reads. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Ge H."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Juan T."
                    },
                    {
                        "name": "Fang F."
                    },
                    {
                        "name": "Newman M."
                    },
                    {
                        "name": "Hoeck W."
                    }
                ],
                "citationCount": 134,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FusionMap: Detecting fusion genes from next-generation sequencing data at base-pair resolution"
            },
            "pmid": "21593131"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ]
}