{"credit":[{"email":"myandell@genetics.utah.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.yandell-lab.org/index.html"},{"email":"barry.moore@genetics.utah.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.yandell-lab.org/software/repeatrunner_docs.html"}],"function":[{"operation":[{"term":"Repeat sequence detection","uri":"http://edamontology.org/operation_0379"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence composition, complexity and repeats","uri":"http://edamontology.org/topic_0157"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/repeatrunner-repeat-identification-masking-dipterans.html"}],"publication":[{"abstract":"Repetitive sequences are a major constituent of many eukaryote genomes and play roles in gene regulation, chromosome inheritance, nuclear architecture, and genome stability. The identification of repetitive elements has traditionally relied on in-depth, manual curation and computational determination of close relatives based on DNA identity. However, the rapid divergence of repetitive sequence has made identification of repeats by DNA identity difficult even in closely related species. Hence, the presence of unidentified repeats in genome sequences affects the quality of gene annotations and annotation-dependent analyses (e.g. microarray analyses). We have developed an enhanced repeat identification pipeline using two approaches. First, the de novo repeat finding program PILER-DF was used to identify interspersed repetitive elements in several recently finished Dipteran genomes. Repeats were classified, when possible, according to their similarity to known elements described in Repbase and GenBank, and also screened against annotated genes as one means of eliminating false positives. Second, we used a new program called RepeatRunner, which integrates results from both RepeatMasker nucleotide searches and protein searches using BLASTX. Using RepeatRunner with PILER-DF predictions, we masked repeats in thirteen Dipteran genomes and conclude that combining PILER-DF and RepeatRunner greatly enhances repeat identification in both well-characterized and un-annotated genomes. © 2006 Elsevier B.V. All rights reserved.","authors":["Smith C.D.","Edgar R.C.","Yandell M.D.","Smith D.R.","Celniker S.E.","Myers E.W.","Karpen G.H."],"cit_count":47,"journal":"Gene","pmid":"17137733","title":"Improved repeat identification and masking in Dipterans","year":"2007-03-01"}],"summary":{"biotoolsCURIE":"biotools:repeatrunner","biotoolsID":"repeatrunner","description":"A CGL-based program that integrates RepeatMasker with BLASTX to provide a comprehensive means of identifying repetitive elements. Because RepeatMasker identifies repeats by means of similarity to a nucleotide library of known repeats, it often fails to identify highly divergent repeats and divergent portions of repeats, especially near repeat edges.","homepage":"http://www.yandell-lab.org/software/repeatrunner.html","name":"RepeatRunner"}}