{
    "additionDate": "2017-12-18T00:05:35Z",
    "biotoolsCURIE": "biotools:dissect",
    "biotoolsID": "dissect",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.cs.sfu.ca/"
        }
    ],
    "description": "Dissect (DIScovery of Structural Alteration Event Containing Transcripts) is a transcriptome-to-genome alignment tool, which can identify and characterize transcriptomic events such as duplications, inversions, rearrangements and fusions. Dissect is suitable for whole transcriptome structural variation discovery problems involving sufficiently long reads or accurately assembled contigs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://dissect-trans.sourceforge.net/Manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structural variation discovery",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                }
            ]
        }
    ],
    "homepage": "http://dissect-trans.sourceforge.net/Home",
    "lastUpdate": "2021-04-17T19:16:32.601917Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/dissect-1-0-2-transcriptome-to-genome-alignment-tool.html"
        }
    ],
    "name": "DISSECT",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_000058"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts214",
            "metadata": {
                "abstract": "Motivation: Computational identification of genomic structural variants via high-throughput sequencing is an important problem for which a number of highly sophisticated solutions have been recently developed. With the advent of high-throughput transcriptome sequencing (RNA-Seq), the problem of identifying structural alterations in the transcriptome is now attracting significant attention. In this article, we introduce two novel algorithmic formulations for identifying transcriptomic structural variants through aligning transcripts to the reference genome under the consideration of such variation. The first formulation is based on a nucleotide-level alignment model; a second, potentially faster formulation is based on chaining fragments shared between each transcript and the reference genome. Based on these formulations, we introduce a novel transcriptome-to-genome alignment tool, Dissect (DIScovery of Structural Alteration Event Containing Transcripts), which can identify and characterize transcriptomic events such as duplications, inversions, rearrangements and fusions. Dissect is suitable for whole transcriptome structural variation discovery problems involving sufficiently long reads or accurately assembled contigs. Results: We tested Dissect on simulated transcripts altered via structural events, as well as assembled RNA-Seq contigs from human prostate cancer cell line C4-2. Our results indicate that Dissect has high sensitivity and specificity in identifying structural alteration events in simulated transcripts as well as uncovering novel structural alterations in cancer transcriptomes. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Yorukoglu D."
                    },
                    {
                        "name": "Hach F."
                    },
                    {
                        "name": "Swanson L."
                    },
                    {
                        "name": "Collins C.C."
                    },
                    {
                        "name": "Birol I."
                    },
                    {
                        "name": "Cenk Sahinalp S."
                    }
                ],
                "citationCount": 12,
                "date": "2012-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Dissect: Detection and characterization of novel structural alterations in transcribed sequences"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptome",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.2"
    ]
}