{
    "additionDate": "2021-01-18T06:58:34Z",
    "biotoolsCURIE": "biotools:maninetcluster",
    "biotoolsID": "maninetcluster",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ikblaby@lbl.gov",
            "name": "Ian K. Blaby",
            "typeEntity": "Person"
        },
        {
            "email": "daifeng.wang@wisc.edu",
            "name": "Daifeng Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel manifold learning approach to reveal the functional links between gene networks.\n\nA novel manifold learning approach to reveal thefunctional links between gene networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/daifengwanglab/ManiNetCluster",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-19T09:20:31Z",
    "name": "ManiNetCluster",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6329-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The coordination of genomic functions is a critical and complex process across biological systems such as phenotypes or states (e.g., time, disease, organism, environmental perturbation). Understanding how the complexity of genomic function relates to these states remains a challenge. To address this, we have developed a novel computational method, ManiNetCluster, which simultaneously aligns and clusters gene networks (e.g., co-expression) to systematically reveal the links of genomic function between different conditions. Specifically, ManiNetCluster employs manifold learning to uncover and match local and non-linear structures among networks, and identifies cross-network functional links. Results: We demonstrated that ManiNetCluster better aligns the orthologous genes from their developmental expression profiles across model organisms than state-of-the-art methods (p-value <2.2×10-16). This indicates the potential non-linear interactions of evolutionarily conserved genes across species in development. Furthermore, we applied ManiNetCluster to time series transcriptome data measured in the green alga Chlamydomonas reinhardtii to discover the genomic functions linking various metabolic processes between the light and dark periods of a diurnally cycling culture. We identified a number of genes putatively regulating processes across each lighting regime. Conclusions: ManiNetCluster provides a novel computational tool to uncover the genes linking various functions from different networks, providing new insight on how gene functions coordinate across different conditions. ManiNetCluster is publicly available as an R package at https://github.com/daifengwanglab/ManiNetCluster.",
                "authors": [
                    {
                        "name": "Nguyen N.D."
                    },
                    {
                        "name": "Blaby I.K."
                    },
                    {
                        "name": "Wang D."
                    }
                ],
                "citationCount": 6,
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ManiNetCluster: A novel manifold learning approach to reveal the functional links between gene networks"
            },
            "pmcid": "PMC6936142",
            "pmid": "31888454"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}