{
    "additionDate": "2018-05-21T19:33:10Z",
    "biotoolsCURIE": "biotools:rpicoo",
    "biotoolsID": "rpicoo",
    "credit": [
        {
            "email": "zahiri@modarestmu.ac.ir",
            "name": "Zahiri J.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "In Silico RNA-protein interaction detection using random forest.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biocool.ir/softs/data/README2.TXT"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://biocool.ir/softs/rpicool.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "rpiCOO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1016/J.JTBI.2016.04.025",
            "metadata": {
                "abstract": "© 2016 Elsevier Ltd.Understanding the principle of RNA-protein interactions (RPIs) is of critical importance to provide insights into post-transcriptional gene regulation and is useful to guide studies about many complex diseases. The limitations and difficulties associated with experimental determination of RPIs, call an urgent need to computational methods for RPI prediction. In this paper, we proposed a machine learning method to detect RNA-protein interactions based on sequence information. We used motif information and repetitive patterns, which have been extracted from experimentally validated RNA-protein interactions, in combination with sequence composition as descriptors to build a model to RPI prediction via a random forest classifier. About 20% of the \"sequence motifs\" and \"nucleotide composition\" features have been selected as the informative features with the feature selection methods. These results suggest that these two feature types contribute effectively in RPI detection. Results of 10-fold cross-validation experiments on three non-redundant benchmark datasets show a better performance of the proposed method in comparison with the current state-of-the-art methods in terms of various performance measures. In addition, the results revealed that the accuracy of the RPI prediction methods could vary considerably across different organisms. We have implemented the proposed method, namely rpiCOOL, as a stand-alone tool with a user friendly graphical user interface (GUI) that enables the researchers to predict RNA-protein interaction. The rpiCOOL is freely available at http://biocool.ir/rpicool.html for non-commercial uses.",
                "authors": [
                    {
                        "name": "Akbaripour-Elahabad M."
                    },
                    {
                        "name": "Zahiri J."
                    },
                    {
                        "name": "Rafeh R."
                    },
                    {
                        "name": "Eslami M."
                    },
                    {
                        "name": "Azari M."
                    }
                ],
                "citationCount": 20,
                "date": "2016-08-07T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "rpiCOOL: A tool for In Silico RNA-protein interaction detection using random forest"
            },
            "pmid": "27134008"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}