{
    "additionDate": "2021-01-18T08:14:20Z",
    "biotoolsCURIE": "biotools:idminer",
    "biotoolsID": "idminer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fengzc81@sina.com",
            "name": "Zhi-Chun Feng",
            "typeEntity": "Person"
        }
    ],
    "description": "Gene-Focused Networks Underlying Phenotypic Convergence in a Systematically Phenotyped Cohort With Heterogeneous Intellectual Disability.\n\nThe broad spectrum of intellectual disability (ID) patients' clinical manifestations, the heterogeneity of ID genetic variation, and the diversity of the phenotypic variation represent major challenges for ID diagnosis. By exploiting a manually curated systematic phenotyping cohort of 3803 patients harboring ID, we identified 704 pathogenic genes, 3848 pathogenic sites, and 2075 standard phenotypes for underlying molecular perturbations and their phenotypic impact. We found the positive correlation between the number of phenotypes and that of patients that revealed their extreme heterogeneities, and the relative contribution of multiple determinants to the heterogeneity of ID phenotypes",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://218.4.234.74:3100/IDminer/",
    "lastUpdate": "2021-02-02T07:53:29Z",
    "name": "IDminer",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00045",
            "metadata": {
                "abstract": "© Copyright © 2020 Wang, Zhu, Ma, Yang, Xu, Yang, Yang, Peng, Zhang, Liang, Zhu, Jiang, Zhang and Feng.The broad spectrum of intellectual disability (ID) patients’ clinical manifestations, the heterogeneity of ID genetic variation, and the diversity of the phenotypic variation represent major challenges for ID diagnosis. By exploiting a manually curated systematic phenotyping cohort of 3803 patients harboring ID, we identified 704 pathogenic genes, 3848 pathogenic sites, and 2075 standard phenotypes for underlying molecular perturbations and their phenotypic impact. We found the positive correlation between the number of phenotypes and that of patients that revealed their extreme heterogeneities, and the relative contribution of multiple determinants to the heterogeneity of ID phenotypes. Nevertheless, despite the extreme heterogeneity in phenotypes, the ID genes had a specific bias of mutation types, and the top 44 genes that ranked by the number of patients accounted for 39.9% of total patients. More interesting, enriched co-occurrent phenotypes and co-occurrent phenotype networks for each gene had the potential for prioritizing ID genes, further exhibited the convergences of ID phenotypes. Then we established a predictor called IDpred using machine learning methods for ID pathogenic genes prediction. Using10-fold cross-validation, our evaluation shows remarkable AUC values for IDpred (auc = 0.978), demonstrating the robustness and reliability of our tool. Besides, we built the most comprehensive database of ID phenotyped cohort to date: IDminer http://218.4.234.74:3100/IDminer/, which included the curated ID data and integrated IDpred tool for both clinical and experimental researchers. The IDminer serves as an important resource and user-friendly interface to help researchers investigate ID data, and provide important implications for the diagnosis and pathogenesis of developmental disorders of cognition.",
                "authors": [
                    {
                        "name": "Feng Z.-C."
                    },
                    {
                        "name": "Jiang T.-J."
                    },
                    {
                        "name": "Liang J.-Y."
                    },
                    {
                        "name": "Ma X.-W."
                    },
                    {
                        "name": "Peng W."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xu X.-L."
                    },
                    {
                        "name": "Yang F."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhang W.-Q."
                    },
                    {
                        "name": "Zhang X.-L."
                    },
                    {
                        "name": "Zhu L.-N."
                    },
                    {
                        "name": "Zhu W.-D."
                    }
                ],
                "date": "2020-02-07T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Gene-Focused Networks Underlying Phenotypic Convergence in a Systematically Phenotyped Cohort With Heterogeneous Intellectual Disability"
            },
            "pmcid": "PMC7019181",
            "pmid": "32117926"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
