{
    "additionDate": "2021-01-18T11:56:22Z",
    "biotoolsCURIE": "biotools:dbaasp",
    "biotoolsID": "dbaasp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.pirtskhalava@lifescience.org.ge",
            "name": "Malak Pirtskhalava",
            "typeEntity": "Person"
        }
    ],
    "description": "Database of Antimicrobial Activity and Structure of Peptides (DBAASP)  is the manually-curated database. It has been developed to provide the information and analytical resources to the  scientific community in order to develop antimicrobial compounds with the high therapeutic index.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein hydrophobic moment plotting",
                    "uri": "http://edamontology.org/operation_0407"
                }
            ]
        }
    ],
    "homepage": "http://dbaasp.org",
    "lastUpdate": "2021-02-22T15:12:34Z",
    "name": "DBAASP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA991",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited. For commercial re-use, please contact journals.permissions@oup.comThe Database of Antimicrobial Activity and Structure of Peptides (DBAASP) is an open-access, comprehensive database containing information on amino acid sequences, chemical modifications, 3D structures, bioactivities and toxicities of peptides that possess antimicrobial properties. DBAASP is updated continuously, and at present, version 3.0 (DBAASP v3) contains >15 700 entries (8000 more than the previous version), including >14 500 monomers and nearly 400 homo- and heteromultimers. Of the monomeric antimicrobial peptides (AMPs), >12 000 are synthetic, about 2700 are ribosomally synthesized, and about 170 are nonribosomally synthesized. Approximately 3/4 of the entries were added after the initial release of the database in 2014 reflecting the recent sharp increase in interest in AMPs. Despite the increased interest, adoption of peptide antimicrobials in clinical practice is still limited as a consequence of several factors including side effects, problems with bioavailability and high production costs. To assist in developing and optimizing de novo peptides with desired biological activities, DBAASP offers several tools including a sophisticated multifactor analysis of relevant physicochemical properties. Furthermore, DBAASP has implemented a structure modelling pipeline that automates the setup, execution and upload of molecular dynamics (MD) simulations of database peptides. At present, >3200 peptides have been populated with MD trajectories and related analyses that are both viewable within the web browser and available for download. More than 400 DBAASP entries also have links to experimentally determined structures in the Protein Data Bank. DBAASP v3 is freely accessible at http://dbaasp.org.",
                "authors": [
                    {
                        "name": "Alimbarashvili E."
                    },
                    {
                        "name": "Amstrong A.A."
                    },
                    {
                        "name": "Chubinidze M."
                    },
                    {
                        "name": "Gabrielian A."
                    },
                    {
                        "name": "Grigolava M."
                    },
                    {
                        "name": "Hurt D.E."
                    },
                    {
                        "name": "Pirtskhalava M."
                    },
                    {
                        "name": "Rosenthal A."
                    },
                    {
                        "name": "Tartakovsky M."
                    },
                    {
                        "name": "Vishnepolsky B."
                    }
                ],
                "citationCount": 9,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DBAASP v3: Database of antimicrobial/cytotoxic activity and structure of peptides as a resource for development of new therapeutics"
            },
            "pmid": "33151284"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "version": [
        "3"
    ]
}
