{
    "additionDate": "2017-08-03T19:07:59Z",
    "biotoolsCURIE": "biotools:proovread",
    "biotoolsID": "proovread",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/BioInf-Wuerzburg"
        }
    ],
    "description": "Hybrid correction pipeline for SMRT reads, which can be flexibly adapted on existing hardware and infrastructure from a laptop to a high performance computing cluster.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BioInf-Wuerzburg/proovread"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinfo.biozentrum.uni-wuerzburg.de/groups/genomics/research/development_of_bioinformatical_tools/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:46Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/14288.html"
        }
    ],
    "name": "proovread",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press.Motivation: Today, the base code of DNA is mostly determined through sequencing by synthesis as provided by the Illumina sequencers. Although highly accurate, resulting reads are short, making their analyses challenging. Recently, a new technology, single molecule real-time (SMRT) sequencing, was developed that could address these challenges, as it generates reads of several thousand bases. But, their broad application has been hampered by a high error rate. Therefore, hybrid approaches that use high-quality short reads to correct erroneous SMRT long reads have been developed. Still, current implementations have great demands on hardware, work only in well-defined computing infrastructures and reject a substantial amount of reads. This limits their usability considerably, especially in the case of large sequencing projects. Results: Here we present proovread, a hybrid correction pipeline for SMRT reads, which can be flexibly adapted on existing hardware and infrastructure from a laptop to a high-performance computing cluster. On genomic and transcriptomic test cases covering Escherichia coli, Arabidopsis thaliana and human, proovread achieved accuracies up to 99.9% and outperformed the existing hybrid correction programs. Furthermore, proovread-corrected sequences were longer and the throughput was higher. Thus, proovread combines the most accurate correction results with an excellent adaptability to the available hardware. It will therefore increase the applicability and value of SMRT sequencing.",
                "authors": [
                    {
                        "name": "Hackl T."
                    },
                    {
                        "name": "Hedrich R."
                    },
                    {
                        "name": "Schultz J."
                    },
                    {
                        "name": "Forster F."
                    }
                ],
                "citationCount": 263,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Proovread: Large-scale high-accuracy PacBio correction through iterative short read consensus"
            },
            "pmid": "25015988"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}