{
    "additionDate": "2018-05-07T16:47:23Z",
    "biotoolsCURIE": "biotools:epianno",
    "biotoolsID": "epianno",
    "credit": [
        {
            "email": "hychen@stat.sinica.edu.tw",
            "name": "Hsuan-Yu Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ePIgenomics ANNOtation tool.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://epianno.stat.sinica.edu.tw/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://epianno.stat.sinica.edu.tw/index.html",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ePIANNO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0148321",
            "metadata": {
                "abstract": "© 2016 Liu et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Recently, with the development of next generation sequencing (NGS), the combination of chromatin immunoprecipitation (ChIP) and NGS, namely ChIP-seq, has become a powerful technique to capture potential genomic binding sites of regulatory factors, histone modifications and chromatin accessible regions. For most researchers, additional information including genomic variations on the TF binding site, allele frequency of variation between different populations, variation associated disease, and other neighbour TF binding sites are essential to generate a proper hypothesis or a meaningful conclusion. Many ChIP-seq datasets had been deposited on the public domain to help researchers make new discoveries. However, researches are often intimidated by the complexity of data structure and largeness of data volume. Such information would be more useful if they could be combined or downloaded with ChIP-seq data. To meet such demands, we built a webtool: ePIgenomic ANNOtation tool (ePIANNO, http://epianno.stat.sinica.edu.tw/index.html). ePIANNO is a web server that combines SNP information of populations (1000 Genomes Project) and gene-disease association information of GWAS (NHGRI) with ChIP-seq (hmChIP, ENCODE, and ROADMAP epigenomics) data. ePIANNO has a user-friendly website interface allowing researchers to explore, navigate, and extract data quickly. We use two examples to demonstrate how users could use functions of ePIANNO webserver to explore useful information about TF related genomic variants. Users could use our query functions to search target regions, transcription factors, or annotations. ePIANNO may help users to generate hypothesis or explore potential biological functions for their studies.",
                "authors": [
                    {
                        "name": "Liu C.-H."
                    },
                    {
                        "name": "Ho B.-C."
                    },
                    {
                        "name": "Chen C.-L."
                    },
                    {
                        "name": "Chang Y.-H."
                    },
                    {
                        "name": "Hsu Y.-C."
                    },
                    {
                        "name": "Li Y.-C."
                    },
                    {
                        "name": "Yuan S.-S."
                    },
                    {
                        "name": "Huang Y.-H."
                    },
                    {
                        "name": "Chang C.-S."
                    },
                    {
                        "name": "Li K.-C."
                    },
                    {
                        "name": "Chen H.-Y."
                    }
                ],
                "citationCount": 3,
                "date": "2016-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "EPIANNO: EPIgenomics ANNOtation tool"
            },
            "pmcid": "PMC4747527",
            "pmid": "26859295"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}