{
    "additionDate": "2019-11-14T18:05:08Z",
    "biotoolsCURIE": "biotools:BANDITS",
    "biotoolsID": "BANDITS",
    "confidence_flag": "tool",
    "description": "Bayesian differential splicing accounting for sample-to-sample variability and mapping uncertainty | BANDITS: Bayesian ANalysis of DIfferenTial Splicing | BANDITS is a Bayesian hierarchical model for detecting differential splicing of genes and transcripts, via differential transcript usage (DTU), between two or more conditions. The method uses a Bayesian hierarchical framework, which allows for sample specific proportions in a Dirichlet-Multinomial model, and samples the allocation of fragments to the transcripts. Parameters are inferred via Markov chain Monte Carlo (MCMC) techniques and a DTU test is performed via a multivariate Wald test on the posterior densities for the average relative abundance of transcripts",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/BANDITS",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:56:55.680563Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SimoneTiberi/BANDITS"
        }
    ],
    "name": "BANDITS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13059-020-01967-8",
            "metadata": {
                "abstract": "Alternative splicing is a biological process during gene expression that allows a single gene to code for multiple proteins. However, splicing patterns can be altered in some conditions or diseases. Here, we present BANDITS, a R/Bioconductor package to perform differential splicing, at both gene and transcript level, based on RNA-seq data. BANDITS uses a Bayesian hierarchical structure to explicitly model the variability between samples and treats the transcript allocation of reads as latent variables. We perform an extensive benchmark across both simulated and experimental RNA-seq datasets, where BANDITS has extremely favourable performance with respect to the competitors considered.",
                "authors": [
                    {
                        "name": "Robinson M.D."
                    },
                    {
                        "name": "Tiberi S."
                    }
                ],
                "citationCount": 14,
                "date": "2020-03-16T00:00:00Z",
                "journal": "Genome Biology",
                "title": "BANDITS: Bayesian differential splicing accounting for sample-to-sample variability and mapping uncertainty"
            },
            "pmcid": "PMC7075019",
            "pmid": "32178699"
        }
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
