{
    "additionDate": "2020-01-14T08:51:09Z",
    "biotoolsCURIE": "biotools:AB_SA",
    "biotoolsID": "AB_SA",
    "confidence_flag": "tool",
    "description": "The Accessory-based source attribution (AB_SA) method aims at attributing the origin of bacterial strains associated to human cases or isolated in environment.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lguillier/AB_SA",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:09:26.461779Z",
    "license": "GPL-3.0",
    "name": "Accessory-based source attribution (AB_SA)",
    "owner": "lguillier",
    "publication": [
        {
            "doi": "10.1101/814459"
        },
        {
            "doi": "10.1099/mgen.0.000366",
            "metadata": {
                "abstract": "The partitioning of pathogenic strains isolated in environmental or human cases to their sources is challenging. The pathogens usually colonize multiple animal hosts, including livestock, which contaminate the food-production chain and the environment (e.g. soil and water), posing an additional public-health burden and major challenges in the identification of the source. Genomic data opens up new opportunities for the development of statistical models aiming to indicate the likely source of pathogen con-tamination. Here, we propose a computationally fast and efficient multinomial logistic regression source-attribution classifier to predict the animal source of bacterial isolates based on ‘source-enriched’ loci extracted from the accessory-genome profiles of a pangenomic dataset. Depending on the accuracy of the model’s self-attribution step, the modeller selects the number of candidate accessory genes that best fit the model for calculating the likelihood of (source) category membership. The Accessory genes-Based Source Attribution (AB_SA) method was applied to a dataset of strains of Salmonella enterica Typhimurium and its monophasic variant (S. enterica 1,4,[5],12:i:-). The model was trained on 69 strains with known animal-source categories (i.e. poultry, ruminant and pig). The AB_SA method helped to identify 8 genes as predictors among the 2802 accessory genes. The self-attribution accuracy was 80 %. The AB_SA model was then able to classify 25 of the 29 S. enterica Typhimurium and S. enterica 1,4,[5],12:i:-isolates collected from the environment (considered to be of unknown source) into a specific category (i.e. animal source), with more than 85 % of probability. The AB_SA method herein described provides a user-friendly and valuable tool for performing source-attribution studies in only a few steps. AB_SA is written in R and freely available at https://​github.​ com/​lguillier/​AB_​SA.",
                "authors": [
                    {
                        "name": "Cadel-Six S."
                    },
                    {
                        "name": "Gourmelon M."
                    },
                    {
                        "name": "Guillier L."
                    },
                    {
                        "name": "Hald T."
                    },
                    {
                        "name": "Lozach S."
                    },
                    {
                        "name": "Munck N."
                    },
                    {
                        "name": "Palma F."
                    },
                    {
                        "name": "Vignaud M.-L."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "AB_SA: Accessory genes-based source attribution – Tracing the source of Salmonella enterica typhimurium environmental strains"
            },
            "pmcid": "PMC7478624",
            "pmid": "32320376"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
