{
    "additionDate": "2021-01-18T12:25:49Z",
    "biotoolsCURIE": "biotools:ichespa",
    "biotoolsID": "ichespa",
    "confidence_flag": "high",
    "description": "Streamlining Expansive Chemical Space Evaluation of Molecular Sets.\n\nIf you would like to reference chespa in an academic paper, we ask you include the following:.\n\nchespa, version 1.0.0 http://github.com/pnnl/chespa (accessed MMM YYYY).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://github.com/pnnl/chespa",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:46:05.532383Z",
    "name": "ichespa",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.0c00899",
            "metadata": {
                "abstract": "Thousands of chemical properties can be calculated for small molecules, which can be used to place the molecules within the context of a broader \"chemical space.\"These definitions vary based on compounds of interest and the goals for the given chemical space definition. Here, we introduce a customizable Python module, chespa, built to easily assess different chemical space definitions through clustering of compounds in these spaces and visualizing trends of these clusters. To demonstrate this, chespa currently streamlines prediction of various molecular descriptors (predicted chemical properties, molecular substructures, AI-based chemical space, and chemical class ontology) in order to test six different chemical space definitions. Furthermore, we investigated how these varying definitions trend with mass spectrometry (MS)-based observability, that is, the ability of a molecule to be observed with MS (e.g., as a function of the molecule ionizability), using an example data set from the U.S. EPA's nontargeted analysis collaborative trial, where blinded samples had been analyzed previously, providing 1398 data points. Improved understanding of observability would offer many advantages in small-molecule identification, such as (i) a priori selection of experimental conditions based on suspected sample composition, (ii) the ability to reduce the number of candidate structures during compound identification by removing those less likely to ionize, and, in turn, (iii) a reduced false discovery rate and increased confidence in identifications. Factors controlling observability are not fully understood, making prediction of this property nontrivial and a prime candidate for chemical space analysis. Chespa is available at github.com/pnnl/chespa.",
                "authors": [
                    {
                        "name": "McGrady M."
                    },
                    {
                        "name": "Metz T.O."
                    },
                    {
                        "name": "Nunez J.R."
                    },
                    {
                        "name": "Renslow R.S."
                    },
                    {
                        "name": "Yesiltepe Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Chespa: Streamlining Expansive Chemical Space Evaluation of Molecular Sets"
            },
            "pmcid": "PMC9648166",
            "pmid": "33283505"
        }
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
