{
    "additionDate": "2018-05-01T18:36:25Z",
    "biotoolsCURIE": "biotools:idepi",
    "biotoolsID": "idepi",
    "credit": [
        {
            "email": "spond@ucsd.edu",
            "name": "Sergei L. Kosakovsky Pond",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Rapid Prediction of HIV-1 Antibody Epitopes and Other Phenotypic Features from Sequence Data Using a Flexible Machine Learning Platform.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/veg/idepi"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                }
            ]
        }
    ],
    "homepage": "https://github.com/veg/idepi",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "IDEPI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1003842",
            "metadata": {
                "abstract": "© 2014 Hepler et al.Since its identification in 1983, HIV-1 has been the focus of a research effort unprecedented in scope and difficulty, whose ultimate goals — a cure and a vaccine – remain elusive. One of the fundamental challenges in accomplishing these goals is the tremendous genetic variability of the virus, with some genes differing at as many as 40% of nucleotide positions among circulating strains. Because of this, the genetic bases of many viral phenotypes, most notably the susceptibility to neutralization by a particular antibody, are difficult to identify computationally. Drawing upon open-source general-purpose machine learning algorithms and libraries, we have developed a software package IDEPI (IDentify EPItopes) for learning genotype-to-phenotype predictive models from sequences with known phenotypes. IDEPI can apply learned models to classify sequences of unknown phenotypes, and also identify specific sequence features which contribute to a particular phenotype. We demonstrate that IDEPI achieves performance similar to or better than that of previously published approaches on four well-studied problems: finding the epitopes of broadly neutralizing antibodies (bNab), determining coreceptor tropism of the virus, identifying compartment-specific genetic signatures of the virus, and deducing drug-resistance associated mutations. The cross-platform Python source code (released under the GPL 3.0 license), documentation, issue tracking, and a pre-configured virtual machine for IDEPI can be found at https://github.com/veg/idepi.",
                "authors": [
                    {
                        "name": "Hepler N.L."
                    },
                    {
                        "name": "Scheffler K."
                    },
                    {
                        "name": "Weaver S."
                    },
                    {
                        "name": "Murrell B."
                    },
                    {
                        "name": "Richman D.D."
                    },
                    {
                        "name": "Burton D.R."
                    },
                    {
                        "name": "Poignard P."
                    },
                    {
                        "name": "Smith D.M."
                    },
                    {
                        "name": "Kosakovsky Pond S.L."
                    }
                ],
                "citationCount": 9,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "IDEPI: Rapid Prediction of HIV-1 Antibody Epitopes and Other Phenotypic Features from Sequence Data Using a Flexible Machine Learning Platform"
            },
            "pmcid": "PMC4177671",
            "pmid": "25254639"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        }
    ],
    "validated": 1
}