{
    "additionDate": "2017-01-17T15:04:49Z",
    "biotoolsCURIE": "biotools:papi",
    "biotoolsID": "papi",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "raphael.aggio@gmail.com",
            "name": "Raphael Aggio",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Pathway Activity Profiling is an R package for predicting the activity of metabolic pathways based solely on a metabolomics data set containing a list of metabolites identified and their respective abundances in different biological samples. It generates hypothesis that improves the final biological interpretation.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/PAPi.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/PAPi_1.14.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/PAPi.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "name": "PAPi",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq567",
            "metadata": {
                "abstract": "Motivation: Metabolomics is one of the most recent omics-technologies and uses robust analytical techniques to screen low molecular mass metabolites in biological samples. It has evolved very quickly during the last decade. However, metabolomics datasets are considered highly complex when used to relate metabolite levels to metabolic pathway activity. Despite recent developments in bioinformatics, which have improved the quality of metabolomics data, there is still no straightforward method capable of correlating metabolite level to the activity of different metabolic pathways operating within the cells. Thus, this kind of analysis still depends on extremely laborious and time-consuming processes. Results: Here, we present a new algorithm Pathway Activity Profiling (PAPi) with which we are able to compare metabolic pathway activities from metabolite profiles. The applicability and potential of PAPi was demonstrated using a previously published data from the yeast Saccharomyces cerevisiae. PAPi was able to support the biological interpretations of the previously published observations and, in addition, generated new hypotheses in a straightforward manner. However, PAPi is time consuming to perform manually. Thus, we also present here a new R-software package (PAPi) which implements the PAPi algorithm and facilitates its usage to quickly compare metabolic pathways activities between different experimental conditions. Using the identified metabolites and their respective abundances as input, the PAPi package calculates pathways' Activity Scores, which represents the potential metabolic pathways activities and allows their comparison between conditions. PAPi also performs principal components analysis and analysis of variance or t-test to investigate differences in activity level between experimental conditions. In addition, PAPi generates comparative graphs highlighting up-and down-regulated pathway activity. © The Author 2010. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Aggio R.B.M."
                    },
                    {
                        "name": "Ruggiero K."
                    },
                    {
                        "name": "Villas-Boas S.G."
                    }
                ],
                "citationCount": 56,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Pathway activity profiling (papi): From the metabolite profile to the metabolic pathway activity"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.0"
    ]
}