{
    "additionDate": "2021-01-18T10:07:37Z",
    "biotoolsCURIE": "biotools:cdsnake",
    "biotoolsID": "cdsnake",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jdkondratenko@gmail.com",
            "name": "Yulia Kondratenko",
            "orcidid": "https://orcid.org/0000-0001-8139-3202",
            "typeEntity": "Person"
        }
    ],
    "description": "CDSnake Snakemake pipeline for retrieval of annotated OTUs from paired-end reads using CD-HIT-OTU-MiSeq utilities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ydkondratenko/cdsnake",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-10T12:08:36Z",
    "name": "CDSnake",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03591-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Illumina paired-end reads are often used for 16S analysis in metagenomic studies. Since DNA fragment size is usually smaller than the sum of lengths of paired reads, reads can be merged for downstream analysis. In spite of development of several tools for merging of paired-end reads, poor quality at the 3′ ends within the overlapping region prevents the accurate combining of significant portion of read pairs. Recently CD-HIT-OTU-Miseq was presented as a new approach for 16S analysis using the paired-end reads, it completely avoids the reads merging process due to separate clustering of paired reads. CD-HIT-OTU-Miseq is a set of tools which are supposed to be successively launched by auxiliary shell scripts. This launch mode is not suitable for processing of big amounts of data generated in modern omics experiments. To solve this issue we created CDSnake - Snakemake pipeline utilizing CD-HIT tools for easier consecutive launch of CD-HIT-OTU-Miseq tools for complete processing of paired end reads in metagenomic studies. Usage of pipeline make 16S analysis easier due to one-command launch and helps to yield reproducible results. Results: We benchmarked our pipeline against two commonly used pipelines for OTU retrieval, incorporated into popular workflow for microbiome analysis, QIIME2 - DADA2 and deblur. Three mock datasets having highly overlapping paired-end 2 × 250 bp reads were used for benchmarking - Balanced, HMP, and Extreme. CDSnake outputted less OTUs than DADA2 and deblur. However, on Balanced and HMP datasets number of OTUs outputted by CDSnake was closer to real number of strains which were used for mock community generation, than those outputted by DADA2 and deblur. Though generally slower than other pipelines, CDSnake outputted higher total counts, preserving more information from raw data. Inheriting this properties from original CD-HIT-OTU-MiSeq utilities, CDSnake made their usage handier due to simple scalability, easier automated runs and other Snakemake benefits. Conclusions: We developed Snakemake pipeline for OTU-MiSeq utilities, which simplified and automated data analysis. Benchmarking showed that this approach is capable to outperform popular tools in certain conditions.",
                "authors": [
                    {
                        "name": "Kondratenko Y."
                    },
                    {
                        "name": "Korobeynikov A."
                    },
                    {
                        "name": "Lapidus A."
                    }
                ],
                "date": "2020-07-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CDSnake: Snakemake pipeline for retrieval of annotated OTUs from paired-end reads using CD-HIT utilities"
            },
            "pmcid": "PMC7379820",
            "pmid": "32703166"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
