{
    "additionDate": "2017-08-03T19:02:17Z",
    "biotoolsCURIE": "biotools:surreyfba",
    "biotoolsID": "surreyfba",
    "credit": [
        {
            "email": "h.wu@surrey.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.surrey.ac.uk/microbial/index.htm"
        }
    ],
    "description": "This provides constraint-based simulations and network map visualization. In addition to basic simulation protocols, the tool also implements the analysis of minimal substrate and product sets, which is useful for metabolic engineering and prediction of nutritional requirements in complex in vivo environments, but not available in other commonly used programs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sysbio3.fhms.surrey.ac.uk/sfba/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://sysbio3.fhms.surrey.ac.uk/sfba/index.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/surreyfba-1-32-constraint-based-modeling-genome-scale-metabolic-reaction-networks.html"
        }
    ],
    "name": "SurreyFBA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Summary: Constraint-based modeling of genome-scale metabolic networks has been successfully used in numerous applications such as prediction of gene essentiality and metabolic engineering. We present SurreyFBA, which provides constraint-based simulations and network map visualization in a free, stand-alone software. In addition to basic simulation protocols, the tool also implements the analysis of minimal substrate and product sets, which is useful for metabolic engineering and prediction of nutritional requirements in complex in vivo environments, but not available in other commonly used programs. The SurreyFBA is based on a command line interface to the GLPK solver distributed as binary and source code for the three major operating systems. The command line tool, implemented in C++, is easily executed within scripting languages used in the bioinformatics community and provides efficient implementation of tasks requiring iterative calls to the linear programming solver. SurreyFBA includes JyMet, a graphics user interface allowing spreadsheet-based model presentation, visualization of numerical results on metabolic networks represented in the Petri net convention, as well as in charts and plots. © The Author 2010. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Gevorgyan A."
                    },
                    {
                        "name": "Bushell M.E."
                    },
                    {
                        "name": "Avignone-Rossa C."
                    },
                    {
                        "name": "Kierzek A.M."
                    }
                ],
                "citationCount": 30,
                "date": "2011-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SurreyFBA: A command line tool and graphics user interface for constraint-based modeling of genome-scale metabolic reaction networks"
            },
            "pmid": "21148545"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}