{
    "additionDate": "2018-02-12T11:51:12Z",
    "biotoolsCURIE": "biotools:covacs",
    "biotoolsID": "covacs",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "graziano.pesole@uniba.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://bioinformatics.cineca.it/covacs/"
        },
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Consortium",
            "typeRole": [
                "Provider"
            ],
            "url": "http://elixir-italy.org"
        }
    ],
    "description": "A fully automated, highly accurate system with a web based graphical interface for genotyping and variant annotation. Extensive tests on a gold standard benchmark data-set -the NA12878 Illumina platinum genome- confirm that call-sets based on our consensus strategy are completely in line with those attained by similar command line based approaches, and far more accurate than call-sets from any individual tool.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://bioinformatics.cineca.it/covacs/faq.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set (nucleic acid)",
                        "uri": "http://edamontology.org/data_1234"
                    }
                }
            ],
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "https://bioinformatics.cineca.it/covacs/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://bioinformatics.cineca.it/covacs/"
        }
    ],
    "maturity": "Emerging",
    "name": "CoVaCS",
    "owner": "ELIXIR-ITA-MILANO",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: The advent and ongoing development of next generation sequencing technologies (NGS) has led to a rapid increase in the rate of human genome re-sequencing data, paving the way for personalized genomics and precision medicine. The body of genome resequencing data is progressively increasing underlining the need for accurate and time-effective bioinformatics systems for genotyping - a crucial prerequisite for identification of candidate causal mutations in diagnostic screens. Results: Here we present CoVaCS, a fully automated, highly accurate system with a web based graphical interface for genotyping and variant annotation. Extensive tests on a gold standard benchmark data-set -the NA12878 Illumina platinum genome- confirm that call-sets based on our consensus strategy are completely in line with those attained by similar command line based approaches, and far more accurate than call-sets from any individual tool. Importantly our system exhibits better sensitivity and higher specificity than equivalent commercial software. Conclusions: CoVaCS offers optimized pipelines integrating state of the art tools for variant calling and annotation for whole genome sequencing (WGS), whole-exome sequencing (WES) and target-gene sequencing (TGS) data. The system is currently hosted at Cineca, and offers the speed of a HPC computing facility, a crucial consideration when large numbers of samples must be analysed. Importantly, all the analyses are performed automatically allowing high reproducibility of the results. As such, we believe that CoVaCS can be a valuable tool for the analysis of human genome resequencing studies. CoVaCS is available at: https://bioinformatics.cineca.it/covacs.",
                "authors": [
                    {
                        "name": "Castrignano T."
                    },
                    {
                        "name": "Chiara M."
                    },
                    {
                        "name": "Chillemi G."
                    },
                    {
                        "name": "D'Antonio M."
                    },
                    {
                        "name": "Flati T."
                    },
                    {
                        "name": "Gioiosa S."
                    },
                    {
                        "name": "Horner D.S."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Zambelli F."
                    }
                ],
                "citationCount": 9,
                "date": "2018-02-05T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "CoVaCS: A consensus variant calling system"
            },
            "pmid": "29402227"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
