{
    "additionDate": "2017-01-13T13:15:02Z",
    "biotoolsCURIE": "biotools:hmmsplicer",
    "biotoolsID": "hmmsplicer",
    "credit": [
        {
            "email": "brittany.worth@ucsf.edu",
            "name": "Brittany Worth",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Splice junction discovery in RNA-Seq data",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splicing model analysis",
                    "uri": "http://edamontology.org/operation_2499"
                }
            ]
        }
    ],
    "homepage": "http://derisilab.ucsf.edu/software/hmmsplicer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "HMMSplicer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: High-throughput sequencing of an organism's transcriptome, or RNA-Seq, is a valuable and versatile new strategy for capturing snapshots of gene expression. However, transcriptome sequencing creates a new class of alignment problem: mapping short reads that span exon-exon junctions back to the reference genome, especially in the case where a splice junction is previously unknown. Methodology/Principal Findings: Here we introduce HMMSplicer, an accurate and efficient algorithm for discovering canonical and non-canonical splice junctions in short read datasets. HMMSplicer identifies more splice junctions than currently available algorithms when tested on publicly available A. thaliana, P. falciparum, and H. sapiens datasets without a reduction in specificity. Conclusions/Significance: HMMSplicer was found to perform especially well in compact genomes and on genes with low expression levels, alternative splice isoforms, or non-canonical splice junctions. Because HHMSplicer does not rely on prebuilt gene models, the products of inexact splicing are also detected. For H. sapiens, we find 3.6% of 39 splice sites and 1.4% of 59 splice sites are inexact, typically differing by 3 bases in either direction. In addition, HMMSplicer provides a score for every predicted junction allowing the user to set a threshold to tune false positive rates depending on the needs of the experiment. HMMSplicer is implemented in Python. Code and documentation are freely available at http://derisilab.ucsf.edu/software/hmmsplicer. © 2010 Dimon et al.",
                "authors": [
                    {
                        "name": "Dimon M.T."
                    },
                    {
                        "name": "Sorber K."
                    },
                    {
                        "name": "DeRisi J.L."
                    }
                ],
                "citationCount": 42,
                "date": "2010-11-19T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "HMMSplicer: A Tool for Efficient and Sensitive Discovery of Known and Novel Splice Junctions in RNA-Seq Data"
            },
            "pmid": "21079731"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}