{"credit":[],"function":[{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"},{"term":"Protein interaction prediction","uri":"http://edamontology.org/operation_2492"}]}],"labels":{"language":["Java"],"license":"GPL-3.0","topic":[{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"}]},"publication":[{"abstract":"© 2019 The Author(s).Background: Semantic similarity between Gene Ontology (GO) terms is a fundamental measure for many bioinformatics applications, such as determining functional similarity between genes or proteins. Most previous research exploited information content to estimate the semantic similarity between GO terms; recently some research exploited word embeddings to learn vector representations for GO terms from a large-scale corpus. In this paper, we proposed a novel method, named GO2Vec, that exploits graph embeddings to learn vector representations for GO terms from GO graph. GO2Vec combines the information from both GO graph and GO annotations, and its learned vectors can be applied to a variety of bioinformatics applications, such as calculating functional similarity between proteins and predicting protein-protein interactions. Results: We conducted two kinds of experiments to evaluate the quality of GO2Vec: (1) functional similarity between proteins on the Collaborative Evaluation of GO-based Semantic Similarity Measures (CESSM) dataset and (2) prediction of protein-protein interactions on the Yeast and Human datasets from the STRING database. Experimental results demonstrate the effectiveness of GO2Vec over the information content-based measures and the word embedding-based measures. Conclusion: Our experimental results demonstrate the effectiveness of using graph embeddings to learn vector representations from undirected GO and GOA graphs. Our results also demonstrate that GO annotations provide useful information for computing the similarity between GO terms and between proteins.","authors":["Zhong X.","Kaalia R.","Rajapakse J.C."],"cit_count":0,"doi":"10.1186/S12864-019-6272-2","journal":"BMC Genomics","pmid":"31874639","title":"GO2Vec: Transforming GO terms and proteins to vector representations via graph embeddings","year":"2019-12-24"}],"summary":{"biotoolsCURIE":"biotools:GO2Vec","biotoolsID":"GO2Vec","description":"transforming GO terms and proteins to vector representations via graph embeddings.\n\nBACKGROUND:Semantic similarity between Gene Ontology (GO) terms is a fundamental measure for many bioinformatics applications, such as determining functional similarity between genes or proteins. Most previous research exploited information content to estimate the semantic similarity between GO terms; recently some research exploited word embeddings to learn vector representations for GO terms from a large-scale corpus. In this paper, we proposed a novel method, named GO2Vec, that exploits graph embeddings to learn vector representations for GO terms from GO graph. GO2Vec combines the information from both GO graph and GO annotations, and its learned vectors can be applied to a variety of bioinformatics applications, such as calculating functional similarity between proteins and predicting protein-protein interactions","homepage":"https://github.com/xszhong/GO2Vec","name":"GO2Vec"}}