{"credit":[{"name":"ELIXIR-NL","typeEntity":"Institute","typeRoles":["Provider"]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://metabocloud.com/?Processing_software___Pre-Processing___LCMS_TNO-DECO"}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"}]}],"labels":{"collectionID":["NMC","ELIXIR-NL"],"toolType":["Command-line tool"],"topic":[{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"}]},"publication":[{"abstract":"RATIONALE Mass spectra obtained by deconvolution of liquid chromatography/high-resolution mass spectrometry (LC/HRMS) data can be impaired by non-informative mass-over-charge (m/z) channels. This impairment of mass spectra can have significant negative influence on further post-processing, like quantification and identification. METHODS A metric derived from the knowledge of errors in isotopic distribution patterns, and quality of the signal within a pre-defined mass chromatogram block, has been developed to pre-select all informative m/z channels. RESULTS This procedure results in the clean-up of deconvoluted mass spectra by maintaining the intensity counts from m/z channels that originate from a specific compound/molecular ion, for example, molecular ion, adducts, 13 C-isotopes, multiply charged ions and removing all m/z channels that are not related to the specific peak. The methodology has been successfully demonstrated for two sets of high-resolution LC/MS data. CONCLUSIONS The approach described is therefore thought to be a useful tool in the automatic processing of LC/HRMS data. It clearly shows the advantages compared to other approaches like peak picking and de-isotoping in the sense that all information is retained while non-informative data is removed automatically. Copyright © 2013 John Wiley & Sons, Ltd. Copyright © 2013 John Wiley & Sons, Ltd.","authors":["Krishnan S.","Verheij E.E.R.","Bas R.C.","Hendriks M.W.B.","Hankemeier T.","Thissen U.","Coulier L."],"cit_count":6,"doi":"10.1002/rcm.6517","journal":"Rapid Communications in Mass Spectrometry","title":"Pre-processing liquid chromatography/high-resolution mass spectrometry data: Extracting pure mass spectra by deconvolution from the invariance of isotopic distribution","type":"Primary","year":"2013-05-15"}],"summary":{"biotoolsCURIE":"biotools:lcms_tno_deco","biotoolsID":"lcms_tno_deco","description":"A generic and automatic pre-processing tool for high resolution (HR) LC-MS and GC-MS data.","homepage":"http://metabocloud.com/?Processing_software___Pre-Processing___LCMS_TNO-DECO","name":"LCMS TNO DECO","version":["1"]}}