{
    "additionDate": "2023-01-28T10:28:33.762748Z",
    "biotoolsCURIE": "biotools:diadpredictor",
    "biotoolsID": "diadpredictor",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lixiao1688@163.com",
            "name": "Xiao Li",
            "typeEntity": "Person"
        }
    ],
    "description": "DIADpredictor: in silico prediction for drug-induced autoimmune diseases (DIAD) with machine learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://diad.sapredictor.cn/",
    "lastUpdate": "2023-01-28T10:28:33.765346Z",
    "license": "Other",
    "name": "DIADpredictor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2022.1015409",
            "metadata": {
                "abstract": "Copyright © 2022 Guo, Zhang, Zhang, Hua, Zhang, Cui, Huang and Li.The incidence and complexity of drug-induced autoimmune diseases (DIAD) have been on the rise in recent years, which may lead to serious or fatal consequences. Besides, many environmental and industrial chemicals can also cause DIAD. However, there are few effective approaches to estimate the DIAD potential of drugs and other chemicals currently, and the structural characteristics and mechanism of action of DIAD compounds have not been clarified. In this study, we developed the in silico models for chemical DIAD prediction and investigated the structural characteristics of DIAD chemicals based on the reliable drug data on human autoimmune diseases. We collected 148 medications which were reported can cause DIAD clinically and 450 medications that clearly do not cause DIAD. Several different machine learning algorithms and molecular fingerprints were combined to develop the in silico models. The best performed model provided the good overall accuracy on validation set with 76.26%. The model was made freely available on the website http://diad.sapredictor.cn/. To further investigate the differences in structural characteristics between DIAD chemicals and non-DIAD chemicals, several key physicochemical properties were analyzed. The results showed that AlogP, molecular polar surface area (MPSA), and the number of hydrogen bond donors (nHDon) were significantly different between the DIAD and non-DIAD structures. They may be related to the DIAD toxicity of chemicals. In addition, 14 structural alerts (SA) for DIAD toxicity were detected from predefined substructures. The SAs may be helpful to explain the mechanism of action of drug induced autoimmune disease, and can used to identify the chemicals with potential DIAD toxicity. The structural alerts have been integrated in a structural alert-based web server SApredictor (http://www.sapredictor.cn). We hope the results could provide useful information for the recognition of DIAD chemicals and the insights of structural characteristics for chemical DIAD toxicity.",
                "authors": [
                    {
                        "name": "Cui X."
                    },
                    {
                        "name": "Guo H."
                    },
                    {
                        "name": "Hua Y."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "date": "2022-10-24T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "Modeling and insights into the structural characteristics of drug-induced autoimmune diseases"
            },
            "pmcid": "PMC9637949",
            "pmid": "36353637"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
