{
    "additionDate": "2021-01-18T10:19:54Z",
    "biotoolsCURIE": "biotools:icarps",
    "biotoolsID": "icarps",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "A computational tool for identifying protein carbonylation sites by novel encoded features.\n\nThe role of this page is a brief introduction to iCarPS.\n\nto view more scientific achievements.\n\niCarPS is a server for the prediction of carbonylation sites based on omputational method.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://lin-group.cn/server/iCarPS/download.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/server/iCarPS",
    "lastUpdate": "2021-02-01T09:29:32Z",
    "name": "iCarPS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA702",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Motivation: Protein carbonylation is one of the most important oxidative stress-induced post-translational modifications, which is generally characterized as stability, irreversibility and relative early formation. It plays a significant role in orchestrating various biological processes and has been already demonstrated to be related to many diseases. However, the experimental technologies for carbonylation sites identification are not only costly and time consuming, but also unable of processing a large number of proteins at a time. Thus, rapidly and effectively identifying carbonylation sites by computationalmethods will provide key clues for the analysis of occurrence and development of diseases. Results: In this study, we developed a predictor called iCarPS to identify carbonylation sites based on sequence information. A novel feature encoding scheme called residues conical coordinates combined with their physicochemical properties was proposed to formulate carbonylated protein and non-carbonylated protein samples. To remove potential redundant features and improve the prediction performance, a feature selection technique was used. The accuracy and robustness of iCarPS were proved by experiments on training and independent datasets. Comparison with other published methods demonstrated that the proposed method is powerful and could provide powerful performance for carbonylation sites identification. Availability and implementation: Based on the proposed model, a user-friendly webserver and a software package were constructed, which can be freely accessed at http://lin-group.cn/server/iCarPS.",
                "authors": [
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Xu Z.-C."
                    },
                    {
                        "name": "Su W."
                    },
                    {
                        "name": "Yang Y.-H."
                    },
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 9,
                "date": "2021-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ICarPS: A computational tool for identifying protein carbonylation sites by novel encoded features"
            },
            "pmid": "32766811"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}