
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            },
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            },
            {
                "term": "Molecular biology",
                "uri": "http://edamontology.org/topic_3047"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/openforcefield/smirnoff99Frosst/issues/61"
        }
    ],
    "publication": [
        {
            "doi": "10.26434/CHEMRXIV.9159872.V2"
        },
        {
            "abstract": "Copyright © 2019 American Chemical Society.Designing ligands that bind their target biomolecules with high affinity and specificity is a key step in small-molecule drug discovery, but accurately predicting protein-ligand binding free energies remains challenging. Key sources of errors in the calculations include inadequate sampling of conformational space, ambiguous protonation states, and errors in force fields. Noncovalent complexes between a host molecule with a binding cavity and a druglike guest molecule have emerged as powerful model systems. As model systems, host-guest complexes reduce many of the errors in more complex protein-ligand binding systems, as their small size greatly facilitates conformational sampling, and one can choose systems that avoid ambiguities in protonation states. These features, combined with their ease of experimental characterization, make host-guest systems ideal model systems to test and ultimately optimize force fields in the context of binding thermodynamics calculations. The Open Force Field Initiative aims to create a modern, open software infrastructure for automatically generating and assessing force fields using data sets. The first force field to arise out of this effort, named SMIRNOFF99Frosst, has approximately one tenth the number of parameters, in version 1.0.5, compared to typical general small molecule force fields, such as GAFF. Here, we evaluate the accuracy of this initial force field, using free energy calculations of 43 α and β-cyclodextrin host-guest pairs for which experimental thermodynamic data are available, and compare with matched calculations using two versions of GAFF. For all three force fields, we used TIP3P water and AM1-BCC charges. The calculations are performed using the attach-pull-release (APR) method as implemented in the open source package, pAPRika. For binding free energies, the root-mean-square error of the SMIRNOFF99Frosst calculations relative to experiment is 0.9 [0.7, 1.1] kcal/mol, while the corresponding results for GAFF 1.7 and GAFF 2.1 are 0.9 [0.7, 1.1] kcal/mol and 1.7 [1.5, 1.9] kcal/mol, respectively, with 95% confidence ranges in brackets. These results suggest that SMIRNOFF99Frosst performs competitively with existing small molecule force fields and is a parsimonious starting point for optimization.",
            "authors": [
                "Slochower D.R.",
                "Henriksen N.M.",
                "Wang L.-P.",
                "Chodera J.D.",
                "Mobley D.L.",
                "Gilson M.K."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JCTC.9B00748",
            "journal": "Journal of Chemical Theory and Computation",
            "pmid": "31603667",
            "title": "Binding Thermodynamics of Host-Guest Systems with SMIRNOFF99Frosst 1.0.5 from the Open Force Field Initiative",
            "year": "2019-11-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:SMIRNOFF99Frosst",
        "biotoolsID": "SMIRNOFF99Frosst",
        "description": "Binding thermodynamics of host-guest systems with SMIRNOFF99Frosst 1.0.5 from the Open Force Field Initiative.\n\nAdd hydroxyl hydrogen radii, remove generics, update for 1.0.7 release by davidlmobley.\n\nUpdates as per openforcefield/openforcefield#101 ; most notably adding nonzero LJ parameters for hydroxyl hydrogens, as introduced in SMIRNOFF paper. Also updates for 1.0.7 release, as we need a point release for this.\n\nYou can’t perform that action at this time.\n\nYou signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'APR', 'host-guest'",
        "homepage": "https://github.com/openforcefield/smirnoff99Frosst/pull/74",
        "name": "SMIRNOFF99Frosst"
    }
}