{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://hcil.snu.ac.kr/people/jinwook-seo"}],"documentation":[{"url":"http://hcil.snu.ac.kr/research-data/geneshelf/manual.html"}],"function":[{"operation":[{"term":"Expression data visualisation","uri":"http://edamontology.org/operation_0571"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/geneshelf-web-based-visual-interface-large-gene-expression-time-series-data-repositories.html"}],"publication":[{"abstract":"A widespread use of high-throughput gene expression analysis techniques enabled the biomedical research community to share a huge body of gene expression datasets in many public databases on the web. However, current gene expression data repositories provide static representations of the data and support limited interactions. This hinders biologists from effectively exploring shared gene expression datasets. Responding to the growing need for better interfaces to improve the utility of the public datasets, we have designed and developed a new web-based visual interface entitled GeneShelf (http://bioinformatics.cnmcresearch.org/GeneShelf). It builds upon a zoomable grid display to represent two categorical dimensions. It also incorporates an augmented timeline with expandable time points that better shows multiple data values for the focused time point by embedding bar charts. We applied GeneShelf to one of the largest microarray datasets generated to study the progression and recovery process of injuries at the spinal cord of mice and rats. We present a case study and a preliminary qualitative user study with biologists to show the utility and usability of GeneShelf. © 2009 IEEE.","authors":["Kim B.","Lee B.","Knoblach S.","Hoffman E.","Seo J."],"cit_count":8,"journal":"IEEE Transactions on Visualization and Computer Graphics","pmid":"19834153","title":"GeneShelf: A web-based visual interface for large gene expression time-series data repositories","year":"2009-11-01"}],"summary":{"biotoolsCURIE":"biotools:geneshelf","biotoolsID":"geneshelf","description":"This tool builds upon a zoomable grid display to represent two categorical dimensions. It also incorporates an augmented timeline with expandable time points that better shows multiple data values for the focused time point by embedding bar charts.","homepage":"http://hcil.snu.ac.kr/research/geneshelf","name":"GeneShelf"}}