{
    "accessibility": "Open access",
    "additionDate": "2023-02-17T12:43:16.543537Z",
    "biotoolsCURIE": "biotools:osadhi",
    "biotoolsID": "osadhi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dipshikha Gogoi"
        },
        {
            "name": "Esther Jamir"
        },
        {
            "name": "G. Narahari Sastry"
        },
        {
            "name": "Kikrusenuo Kiewhuo"
        }
    ],
    "description": "An online structural and analytics based database for herbs of India.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://neist.res.in/osadhi/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-17T12:43:16.547334Z",
    "name": "OSADHI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2022.107799",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdThe current study aims to develop a PAN India database of medicinal plants along with their phytochemicals and geographical availability. The database consists of 6959 unique medicinal plants belonging to 348 families which are available across 28 states and 8 union territories of India. The database sources the information on four different sections – traditional knowledge, geographical indications, phytochemicals, and chemoinformatics. The traditional knowledge reports the plant taxonomy with their vernacular names. A total of 27,440 unique phytochemicals associated with these plants were curated from various sources in this study. However, due to the non-availability of general information like IUPAC names, InChI key, etc. from reliable sources, only 22,314 phytochemicals have been currently reported in the database. Various analyses have been performed for the phytochemicals which include analysis of physicochemical and ADMET properties calculated from open-source web servers using in-house python scripts. The phytochemical data set has also been classified based on the class, superclass, and pathways respectively using NPClassifier, a deep learning framework. Additionally, the antiviral potency of the phytochemicals was also predicted using two machine learning models – Random Forest and XGBoost. The database aims to provide accurate and exhaustive data of the traditional practice of medicinal plants in India in a single platform integrating and analyzing the rich customary practices and facilitating the development and identification of plant-based therapeutics for a variety of diseases. The database can be accessed at https://neist.res.in/osadhi/.",
                "authors": [
                    {
                        "name": "Das D."
                    },
                    {
                        "name": "Gogoi D."
                    },
                    {
                        "name": "Jamir E."
                    },
                    {
                        "name": "Kiewhuo K."
                    },
                    {
                        "name": "Mahanta H.J."
                    },
                    {
                        "name": "Rawal R.K."
                    },
                    {
                        "name": "S V."
                    },
                    {
                        "name": "Sastry G.N."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "OSADHI – An online structural and analytics based database for herbs of India"
            },
            "pmid": "36512929"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
