
{
    "credit": [
        {
            "email": "araport@jcvi.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.araport.org/tutorials"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Indexing",
                    "uri": "http://edamontology.org/operation_0227"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal",
            "Web service"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/Arabidopsis-Information-Portal?page=2"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 The Authors The Plant Journal © 2016 John Wiley & Sons Ltd The flowering plant Arabidopsis thaliana is a dicot model organism for research in many aspects of plant biology. A comprehensive annotation of its genome paves the way for understanding the functions and activities of all types of transcripts, including mRNA, the various classes of non-coding RNA, and small RNA. The TAIR10 annotation update had a profound impact on Arabidopsis research but was released more than 5 years ago. Maintaining the accuracy of the annotation continues to be a prerequisite for future progress. Using an integrative annotation pipeline, we assembled tissue-specific RNA-Seq libraries from 113 datasets and constructed 48 359 transcript models of protein-coding genes in eleven tissues. In addition, we annotated various classes of non-coding RNA including microRNA, long intergenic RNA, small nucleolar RNA, natural antisense transcript, small nuclear RNA, and small RNA using published datasets and in-house analytic results. Altogether, we identified 635 novel protein-coding genes, 508 novel transcribed regions, 5178 non-coding RNAs, and 35 846 small RNA loci that were formerly unannotated. Analysis of the splicing events and RNA-Seq based expression profiles revealed the landscapes of gene structures, untranslated regions, and splicing activities to be more intricate than previously appreciated. Furthermore, we present 692 uniformly expressed housekeeping genes, 43% of whose human orthologs are also housekeeping genes. This updated Arabidopsis genome annotation with a substantially increased resolution of gene models will not only further our understanding of the biological processes of this plant model but also of other species.",
            "authors": [
                "Cheng C.-Y.",
                "Krishnakumar V.",
                "Chan A.P.",
                "Thibaud-Nissen F.",
                "Schobel S.",
                "Town C.D."
            ],
            "cit_count": 68,
            "doi": "10.1111/tpj.13415",
            "journal": "Plant Journal",
            "pmid": "27862469",
            "title": "Araport11: a complete reannotation of the Arabidopsis thaliana reference genome",
            "type": "Primary",
            "year": "2017-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:araport",
        "biotoolsID": "araport",
        "description": "Resource for Arabidopsis thaliana genomics. Araport offers gene and protein reports with orthology, expression, interactions and the latest annotation, plus analysis tools, community apps, and web services",
        "homepage": "https://www.araport.org/",
        "name": "Araport"
    }
}