{
    "name": "STRAP", 
    "description": "The Structural Alignment Program for Proteins (STRAP) is a java-based program that can be run over the web using a Java Web Start enabled browser or downloaded and run as a stand-alone application. Alignments can be done using one of several methods, including ClustalW, JAligner and T_coffee. STRAP is also able to incorporate structure information and interfaces with programs such as Pymol and Rasmol. There is also a tutorial included.", 
    "homepage": "http://www.bioinformatics.org/strap/", 
    "biotoolsID": "strap", 
    "biotoolsCURIE": "biotools:strap", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0492", 
                    "term": "Multiple sequence alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0504", 
                    "term": "Multiple structure alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2488", 
                    "term": "Protein secondary structure comparison"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0295", 
                    "term": "Structure alignment"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_0157", 
            "term": "Sequence composition, complexity and repeats"
        }, 
        {
            "uri": "http://edamontology.org/topic_0623", 
            "term": "Gene and protein families"
        }, 
        {
            "uri": "http://edamontology.org/topic_0097", 
            "term": "Nucleic acid structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.bioinformatics.org/strap/security.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "11301311", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "STRAP: Editor for STRuctural alignments of proteins", 
                "abstract": "STRAP is a comfortable and extensible tool for the generation and refinement of multiple alignments of protein sequences. Various sequence ordered input file formats are supported. These are the SwissProt-, GenBank-, EMBL-, DSSP- PDB-, MSF-, and plain ASCII text format. The special feature of STRAP is the simple visualization of spatial distances of Cα-atoms within the alignment. Thus structural information can easily be incorporated into the sequence alignment and can guide the alignment process in cases of low sequence similarities. Further STRAP is able to manage huge alignments comprising a lot of sequences. The protein viewers and modeling programs INSIGHT, RASMOL and WEBMOL are embedded into STRAP. STRAP is written in Java. The well-documented source code can be adapted easily to special requirements. STRAP may become the basis for complex alignment tools in the future.", 
                "date": "2001-01-01T00:00:00Z", 
                "citationCount": 164, 
                "authors": [
                    {
                        "name": "Gille C."
                    }, 
                    {
                        "name": "Frommel C."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "14668241", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "KISS for STRAP: User extensions for a protein alignment editor", 
                "abstract": "Summary: The Structural Alignment Program STRAP is a comfortable comprehensive editor and analyzing tool for protein alignments. A wide range of functions related to protein sequences and protein structures are accessible with an intuitive graphical interface. Recent features include mapping of mutations and polymorphisms onto structures and production of high quality figures for publication. Here we address the general problem of multi-purpose program packages to keep up with the rapid development of bioinformatical methods and the demand for specific program functions. STRAP was remade implementing a novel design which aims at Keeping Interfaces in STRAP Simple (KISS). KISS renders STRAP extendable to bio-scientists as well as to bio-informaticians. Scientists with basic computer skills are capable of implementing statistical methods or embedding existing bioinformatical tools in STRAP themselves. For bio-informaticians STRAP may serve as an environment for rapid prototyping and testing of complex algorithms such as automatic alignment algorithms or phylogenetic methods. Further, STRAP can be applied as an interactive web applet to present data related to a particular protein family and as a teaching tool.", 
                "date": "2003-12-12T00:00:00Z", 
                "citationCount": 16, 
                "authors": [
                    {
                        "name": "Gile C."
                    }, 
                    {
                        "name": "Lorenzen S."
                    }, 
                    {
                        "name": "Michalsky E."
                    }, 
                    {
                        "name": "Frommel C."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Christoph Gille", 
            "email": "christoph.gille@charite.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-05-02T10:01:00Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}