{
    "accessibility": "Open access",
    "additionDate": "2025-03-28T11:01:52.929561Z",
    "biotoolsCURIE": "biotools:chemfh",
    "biotoolsID": "chemfh",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yjc@nudt.edu.cn",
            "name": "Jiacai Yi",
            "note": "National University of Defense Technology, Changsha, Hunan",
            "orcidid": "https://orcid.org/0000-0001-6823-1882",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ],
            "url": "https://github.com/antwiser"
        }
    ],
    "description": "An integrated online platform developed for the screening and prediction of potential frequent drug hitters, thus improving the efficiency of drug R&D in colloidal aggregate, firefly luciferase reporter enzyme inhibition, fluorescence, chemical reactivity, and promiscuity. ChemFH: an integrated tool for screening frequent false positives in chemical biology and drug discovery.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/antwiser/ChemFH/blob/main/README.md"
        },
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://chemfh.scbdd.com/documentation/#/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/antwiser/ChemFH/releases/tag/ChemFH-1.0.0",
            "version": "1.0.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "SMILES string",
                        "uri": "http://edamontology.org/data_2301"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Chemical structure image",
                        "uri": "http://edamontology.org/data_1712"
                    }
                },
                {
                    "data": {
                        "term": "Drug report",
                        "uri": "http://edamontology.org/data_1696"
                    }
                }
            ]
        }
    ],
    "homepage": "https://chemfh.scbdd.com/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2025-03-28T12:04:07.529430Z",
    "license": "MIT",
    "link": [
        {
            "note": "Webpage of the tool",
            "type": [
                "Other"
            ],
            "url": "https://chemfh.scbdd.com/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/antwiser/ChemFH"
        }
    ],
    "maturity": "Emerging",
    "name": "ChemFH",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "etepf22",
    "publication": [
        {
            "doi": "10.1093/nar/gkae424",
            "metadata": {
                "abstract": "High-throughput screening rapidly tests an extensive array of chemical compounds to identify hit compounds for specific biological targets in drug discovery. However, false-positive results disrupt hit compound screening, leading to wastage of time and resources. To address this, we propose ChemFH, an integrated online platform facilitating rapid virtual evaluation of potential false positives, including colloidal aggregators, spectroscopic interference compounds, firefly luciferase inhibitors, chemical reactive compounds, promiscuous compounds, and other assay interferences. By leveraging a dataset containing 823 391 compounds, we constructed high-quality prediction models using multi-task directed message-passing network (DMPNN) architectures combining uncertainty estimation, yielding an average AUC value of 0.91. Furthermore, ChemFH incorporated 1441 representative alert substructures derived from the collected data and ten commonly used frequent hitter screening rules. ChemFH was validated with an external set of 75 compounds. Subsequently, the virtual screening capability of ChemFH was successfully confirmed through its application to five virtual screening libraries. Furthermore, ChemFH underwent additional validation on two natural products and FDA-approved drugs, yielding reliable and accurate results. ChemFH is a comprehensive, reliable, and computationally efficient screening pipeline that facilitates the identification of true positive results in assays, contributing to enhanced efficiency and success rates in drug discovery. ChemFH is freely available via https://chemfh.scbdd.com/.",
                "authors": [
                    {
                        "name": "Cao D."
                    },
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Fu L."
                    },
                    {
                        "name": "Hou T."
                    },
                    {
                        "name": "Lyu A."
                    },
                    {
                        "name": "Shi S."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yi J."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhao W."
                    }
                ],
                "date": "2024-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ChemFH: An integrated tool for screening frequent false positives in chemical biology and drug discovery"
            },
            "note": "High-throughput screening rapidly tests an extensive array of chemical compounds to identify hit compounds for specific biological targets in drug discovery. However, false-positive results disrupt hit compound screening, leading to wastage of time and resources. To address this, we propose ChemFH, an integrated online platform facilitating rapid virtual evaluation of potential false positives, including colloidal aggregators, spectroscopic interference compounds, firefly luciferase inhibitors, chemical reactive compounds, promiscuous compounds, and other assay interferences. ChemFH is freely available via https://chemfh.scbdd.com/.",
            "pmcid": "PMC11223804",
            "pmid": "38783035",
            "type": [
                "Method"
            ],
            "version": "1.0.0"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ],
    "version": [
        "1.0.0"
    ]
}
