{
    "additionDate": "2017-03-25T22:23:18Z",
    "biotoolsCURIE": "biotools:institute_of_enzymology_servers",
    "biotoolsID": "institute_of_enzymology_servers",
    "credit": [
        {
            "email": "simon@enzim.hu",
            "name": "Istva´n Simon*",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A set of severs developed by the Institute of Enzymology that includes tools for transmembrane protein structure prediction and structural analyses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.enzim.hu/index.php?option=com_content&task=blogcategory&id=30&Itemid=92"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://www.ttk.mta.hu/en/szolgaltatas/adatbazisok/",
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "Institute of Enzymology Servers",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A new method is suggested here for topology prediction of helical transmembrane proteins. The method is based on the hypothesis that the localizations of the transmembrane segments and the topology are determined by the difference in the amino acid distributions in various structural parts of these proteins rather than by specific amino acid compositions of these parts. A hidden Markov model with special architecture was developed to search transmembrane topology corresponding to the maximum likelihood among all the possible topologies of a given protein. The prediction accuracy was tested on 158 proteins and was found to be higher than that found using prediction methods already available. The method successfully predicted all the transmembrane segments in 143 proteins out of the 158, and for 135 of these proteins both the membrane spanning regions and the topologies were predicted correctly. The observed level of accuracy is a strong argument in favor of our hypothesis.",
                "authors": [
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 929,
                "date": "1998-10-23T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Principles governing amino acid composition of integral membrane proteins: Application to topology prediction"
            },
            "pmid": "9769220"
        },
        {
            "metadata": {
                "abstract": "Bisulfite genomic sequencing is the most widely used technique to analyze the 5-methylation of cytosines, the prevalent covalent DNA modification in mammals. The process is based on the selective transformation of unmethylated cytosines to uridines. Then, the investigated genomic regions are PCR amplified, subcloned and sequenced. During sequencing, the initially unmethylated cytosines are detected as thymines. The efficacy of bisulfite PCR is generally low; mispriming and non-specific amplification often occurs due to the T richness of the target sequences. In order to ameliorate the efficiency of PCR, we developed a new primer-design software called BiSearch, available on the World Wide Web. It has the unique property of analyzing the primer pairs for mispriming sites on the bisulfite-treated genome and determines potential non-specific amplification products with a new search algorithm. The options of primer-design and analysis for mispriming sites can be used sequentially or separately, both on bisulfite-treated and untreated sequences. In silico and in vitro tests of the software suggest that new PCR strategies may increase the efficiency of the amplification.",
                "authors": [
                    {
                        "name": "Aranyi T."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    },
                    {
                        "name": "Varadi A."
                    }
                ],
                "citationCount": 131,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "BiSearch: primer-design and search tool for PCR on bisulfite-treated genomes."
            },
            "pmid": "15653630"
        },
        {
            "metadata": {
                "abstract": "In nature, 1 out of every 10 proteins has an (α/β)8 (TIM)-barrel fold, and in most cases, pairwise comparisons show no sequence similarity between them. Hence, delineating the key residues that induce very different sequences to share a common fold is important for understanding the folding and stability of TIM-barrel domains. In this work, we propose a new consensus approach for locating these stabilizing residues based on long-range interactions, hydrophobicity, and conservation of amino acid residues. We have identified 957 stabilizing residues in 63 proteins from a nonredundant set of 71 TIM-barrel domains. Most of these residues are located in the 8-stranded β-sheet, with nearly one half of them oriented toward the interior of the barrel and the other half oriented toward the surrounding α-helices. Several stabilizing residues are found in the N- and C-terminal loops, whereas very few appear in the α-helices that surround the internal β-sheet. Further, these 957 residues are placed in 434 stabilizing segments of various sizes, and each domain contains 1-10 of these segments. We found that 8 segments per domain is the most abundant one, and two thirds of the proteins have 7-9 stabilizing segments. Finally, we verified the identified residues with experimental temperature factors and found that these residues are among the ones with less mobility in the considered proteins. We suggest that our new protocol serves as a powerful tool to identify the stabilizing residues in TIM-barrel domains, which can be used as potential candidates for studying protein folding and stability by means of protein engineering experiments. © 2004 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Magyar C."
                    },
                    {
                        "name": "Pujadas G."
                    },
                    {
                        "name": "Selvaraj S."
                    },
                    {
                        "name": "Simon I."
                    }
                ],
                "citationCount": 73,
                "date": "2004-05-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Locating the Stabilizing Residues in (α/β)8 Barrel Proteins Based on Hydrophobicity, Long-Range Interactions, and Sequence Conservation"
            },
            "pmid": "15048825"
        },
        {
            "metadata": {
                "abstract": "Methods are presented to locate residues, stabilization center elements, which are expected to stabilize protein structures by preventing their decay with their cooperative long range interactions. Artificial neural network-based algorithms were developed to predict these residues from the primary structure of single proteins and from the amino acid sequences of homologous proteins. The prediction accuracy using only single sequence information is 65%, but the incorporation of evolutionary information in the form of multiple alignments and conservation scores raises the efficiency by 3%. The composition, relative accessibility, number and type of interactions, conservation and the X-ray thermal factor of the identified stabilization center residues are different, not only from the whole data set but from the rest of the long range interacting residues as well. The most frequent stabilization center residues are usually found at buried positions and have a hydrophobic or aromatic side-chain, but some polar or charged residues also play an important role in the stabilization. The stabilization centers show significant difference in the composition and in the type of linked secondary structural elements compared with the rest of the residues. The performed structural and sequential conservation analysis showed the higher conservation of stabilization centers over protein families. The relation of the proposed stabilization centers to folding nuclei is also discussed.",
                "authors": [
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Fiser A."
                    },
                    {
                        "name": "Simon I."
                    }
                ],
                "citationCount": 135,
                "date": "1997-10-03T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Stabilization centers in proteins: Identification, characterization and predictions"
            },
            "pmid": "9325115"
        },
        {
            "metadata": {
                "abstract": "Motivation: Integral membrane proteins play important roles in living cells. Although these proteins are estimated to constitute ∼ 25% of proteins at a genomic scale, the Protein Data Bank (PDB) contains only a few hundred membrane proteins due to the difficulties with experimental techniques. The presence of transmembrane proteins in the structure data bank, however, is quite invisible, as the annotation of these entries is rather poor. Even if a protein is identified as a transmembrane one, the possible location of the lipid bilayer is not indicated in the PDB because these proteins are crystallized without their natural lipid bilayer, and currently no method is publicly available to detect the possible membrane plane using the atomic coordinates of membrane proteins. Results: Here, we present a new geometrical approach to distinguish between transmembrane and globular proteins using structural information only and to locate the most likely position of the lipid bilayer. An automated algorithm (TMDET) is given to determine the membrane planes relative to the position of atomic coordinates, together with a discrimination function which is able to separate transmembrane and globular proteins even in cases of low resolution or incomplete structures such as fragments or parts of large multi chain complexes. This method can be used for the proper annotation of protein structures containing transmembrane segments and paves the way to an up-to-date database containing the structure of all known transmembrane proteins and fragments (PDB_TM) which can be automatically updated. The algorithm is equally important for the purpose of constructing databases purely of globular proteins. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 182,
                "date": "2004-11-22T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Transmembrane proteins in the Protein Data Bank: Identification and classification"
            },
            "pmid": "15180935"
        },
        {
            "metadata": {
                "abstract": "PDB_TM is a database for transmembrane proteins with known structures. It aims to collect all transmembrane proteins that are deposited in the protein structure database (PDB) and to determine their membrane-spanning regions. These assignments are based on the TMDET algorithm, which uses only structural information to locate the most likely position of the lipid bilayer and to distinguish between transmembrane and globular proteins. This algorithm was applied to all PDB entries and the results were collected in the PDB_TM database. By using TMDET algorithm, the PDB_TM database can be automatically updated every week, keeping it synchronized with the latest PDB updates. The PDB_TM database is available at http://www.enzim.hu/PDB_TM. © Oxford University Press 2005; all rights reserved.",
                "authors": [
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 223,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PDB_TM: Selection and membrane localization of transmembrane proteins in the protein data bank"
            },
            "pmid": "15608195"
        },
        {
            "metadata": {
                "abstract": "Summary: Intrinsically unstructured/disordered proteins and domains (IUPs) lack a well-defined three-dimensional structure under native conditions. The IUPred server presents a novel algorithm for predicting such regions from amino acid sequences by estimating their total pairwise interresidue interaction energy, based on the assumption that IUP sequences do not fold due to their inability to form sufficient stabilizing interresidue interactions. Optional to the prediction are built-in parameter sets optimized for predicting short or long disordered regions and structured domains. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Csizmok V."
                    },
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tompa P."
                    }
                ],
                "citationCount": 1452,
                "date": "2005-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IUPred: Web server for the prediction of intrinsically unstructured regions of proteins based on estimated energy content"
            },
            "pmid": "15955779"
        },
        {
            "metadata": {
                "abstract": "Summary: SCide is a program to identify stabilization centers from known protein structures. These are residues involved in cooperative long-range contacts, which can be formed between various regions of a single polypeptide chain, or they can belong to different peptides or polypeptides in a complex. The server takes a PDB file as an input, and the result is presented in graphical or text format.",
                "authors": [
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Magyar C."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 94,
                "date": "2003-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SCide: Identification of stabilization centers in proteins"
            },
            "pmid": "12724305"
        },
        {
            "metadata": {
                "abstract": "Summary: The HMMTOP transmembrane topology prediction server predicts both the localization of helical transmembrane segments and the topology of transmembrane proteins. Recently, several improvements have been introduced to the original method. Now, the user is allowed to submit additional information about segment localization to enhance the prediction power. This option improves the prediction accuracy as well as helps the interpretation of experimental results, i.e. in epitope insertion experiments.",
                "authors": [
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 1475,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "The HMMTOP transmembrane topology prediction server"
            },
            "pmid": "11590105"
        },
        {
            "metadata": {
                "abstract": "Summary: The structure of integral membrane proteins is determined in the absence of the lipid bilayer; consequently the membrane localization of the protein is usually not specified in the corresponding PDB file. Recently, we have developed a new method called TMDET which determines the most possible localization of the membrane relative to the protein structure, and gives the annotation of the membrane embedded parts of the sequence. The entire Protein Data Bank has been scanned by the new TMDET algorithm resulting in the database of structurally determined transmembrane proteins (PDB_TM). Here we present the web interface of the TMDET algorithm to allow scientists to determine the membrane localization of structural data prior to deposition or to analyze model structures. © The Author 2004. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 110,
                "date": "2005-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TMDET: Web server for detecting transmembrane regions of proteins by using their 3D coordinates"
            },
            "pmid": "15539454"
        },
        {
            "metadata": {
                "abstract": "The structural stability of a protein requires a large number of interresidue interactions. The energetic contribution of these can be approximated by low-resolution force fields extracted from known structures, based on observed amino acid pairing frequencies. The summation of such energies, however, cannot be carried out for proteins whose structure is not known or for intrinsically unstructured proteins. To overcome these limitations, we present a novel method for estimating the total pairwise interaction energy, based on a quadratic form in the amino acid composition of the protein. This approach is validated by the good correlation of the estimated and actual energies of proteins of known structure and by a clear separation of folded and disordered proteins in the energy space it defines. As the novel algorithm has not been trained on unstructured proteins, it substantiates the concept of protein disorder, i.e. that the inability to form a well-defined 3D structure is an intrinsic property of many proteins and protein domains. This property is encoded in their sequence, because their biased amino acid composition does not allow sufficient stabilizing interactions to form. By limiting the calculation to a predefined sequential neighborhood, the algorithm was turned into a position-specific scoring scheme that characterizes the tendency of a given amino acid to fall into an ordered or disordered region. This application we term IUPred and compare its performance with three generally accepted predictors, PONDR VL3H, DISOPRED2 and GlobPlot on a database of disordered proteins. © 2005 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Csizmok V."
                    },
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tompa P."
                    }
                ],
                "citationCount": 675,
                "date": "2005-04-08T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "The pairwise energy content estimated from amino acid composition discriminates between folded and intrinsically unstructured proteins"
            },
            "pmid": "15769473"
        },
        {
            "metadata": {
                "abstract": "We describe several algorithms and public servers that were developed to analyze and predict various features of protein structures. These servers provide information about the covalent state of cysteine (CYSREDOX), as well as about residues involved in non-covalent cross links that play an important role in the structural stability of proteins (SCIDE and SCPRED). We also discuss methods and servers developed to identify helical transmembrane proteins from large databases and rough genomic data, including two of the most popular transmembrane prediction methods, DAS and HMMTOP. Several biologically interesting applications of these servers are also presented. The servers are available through http://www.enzim.hu/servers.html.",
                "authors": [
                    {
                        "name": "Cserzo M."
                    },
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Fiser A."
                    },
                    {
                        "name": "Magyar C."
                    },
                    {
                        "name": "Simon I."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 10,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Servers for sequence-structure relationship analysis and prediction"
            },
            "pmid": "12824327"
        },
        {
            "metadata": {
                "abstract": "While helical transmembrane (TM) region prediction tools achieve high (>90%) success rates for real integral membrane proteins, they produce a considerable number of false positive hits in sequences of known non-transmembrane queries. We propose a modification of the dense alignment surface (DAS) method that achieves a substantial decrease in the false positive error rate. Essentially, a sequence that includes possible transmembrane regions is compared in a second step with TM segments in a sequence library of documented transmembrane proteins. If the performance of the query sequence against the library of documented TM segment-containing sequences in this test is lower than an empirical threshold, it is classified as a non-transmembrane protein. The probability of false positive prediction for trusted TM region hits is expressed in terms of E-values. The modified DAS method, the DAS-TMfilter algorithm, has an unchanged high sensitivity for TM segments (∼95% detected in a learning set of 128 documented transmembrane proteins). At the same time, the selectivity measured over a non-redundant set of 526 soluble proteins with known 3D structure is ∼99%, mainly because a large number of falsely predicted single membrane-pass proteins are eliminated by the DAS-TMfilter algorithm.",
                "authors": [
                    {
                        "name": "Cserzo M."
                    },
                    {
                        "name": "Eisenhaber B."
                    },
                    {
                        "name": "Eisenhaber F."
                    },
                    {
                        "name": "Simon I."
                    }
                ],
                "citationCount": 124,
                "date": "2002-09-01T00:00:00Z",
                "journal": "Protein Engineering",
                "title": "On filtering false positive transmembrane protein predictions"
            },
            "pmid": "12456873"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
