{
    "additionDate": "2021-01-18T09:04:15Z",
    "biotoolsCURIE": "biotools:imaging-amaretto",
    "biotoolsID": "imaging-amaretto",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "npochet@broadinstitute.org",
            "name": "Nathalie Pochet",
            "typeEntity": "Person"
        }
    ],
    "description": "An Imaging Genomics Software Tool to Interrogate Multiomics Networks for Relevance to Radiography and Histopathology Imaging Biomarkers of Clinical Outcomes.\n\nImaging-AMARETTO: tools for interpreting multi-omics networks for relevance to radiographic and histopathology imaging-derived biomarkers of clinical outcomes.\n\nThe *AMARETTO framework for network biology and medicine: linking diseases, drivers, targets and drugs via graph-based fusion of multi-omics, clinical, imaging and perturbation data.\n\nNIH NCI CBIIT ITCR Cancer Data Science Pulse Blog.\n\nRegulatory Network Inference and Driver Gene Evaluation using Integrative Multi-Omics Analysis and Penalized Regression.\n\nIntegrating an increasing number of available multi-omics cancer data remains one of the main challenges to improve our understanding of cancer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://portals.broadinstitute.org/pochetlab/amaretto.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-03T08:07:17Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/broadinstitute/ImagingAMARETTO"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/AMARETTO"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://datasets.genepattern.org/?prefix=data/module_support_files/Amaretto"
        }
    ],
    "name": "Imaging-AMARETTO",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1200/CCI.19.00125",
            "metadata": {
                "abstract": "© 2020 by American Society of Clinical Oncology Licensed under the Creative Commons Attribution 4.0 LicensePURPOSE The availability of increasing volumes of multiomics, imaging, and clinical data in complex diseases such as cancer opens opportunities for the formulation and development of computational imaging genomics methods that can link multiomics, imaging, and clinical data. METHODS Here, we present the Imaging-AMARETTO algorithms and software tools to systematically interrogate regulatory networks derived from multiomics data within and across related patient studies for their relevance to radiography and histopathology imaging features predicting clinical outcomes. RESULTS To demonstrate its utility, we applied Imaging-AMARETTO to integrate three patient studies of brain tumors, specifically, multiomics with radiography imaging data from The Cancer Genome Atlas (TCGA) glioblastoma multiforme (GBM) and low-grade glioma (LGG) cohorts and transcriptomics with histopathology imaging data from the Ivy Glioblastoma Atlas Project (IvyGAP) GBM cohort. Our results show that ImagingAMARETTO recapitulates known key drivers of tumor-associated microglia and macrophage mechanisms, mediated by STAT3, AHR, and CCR2, and neurodevelopmental and stemness mechanisms, mediated by OLIG2. Imaging-AMARETTO provides interpretation of their underlying molecular mechanisms in light of imaging biomarkers of clinical outcomes and uncovers novel master drivers, THBS1 and MAP2, that establish relationships across these distinct mechanisms. CONCLUSION Our network-based imaging genomics tools serve as hypothesis generators that facilitate the interrogation of known and uncovering of novel hypotheses for follow-up with experimental validation studies. We anticipate that our Imaging-AMARETTO imaging genomics tools will be useful to the community of biomedical researchers for applications to similar studies of cancer and other complex diseases with available multiomics, imaging, and clinical data.",
                "authors": [
                    {
                        "name": "Gevaert O."
                    },
                    {
                        "name": "Nabian M."
                    },
                    {
                        "name": "Bakr S."
                    },
                    {
                        "name": "Everaert C."
                    },
                    {
                        "name": "Shinde J."
                    },
                    {
                        "name": "Manukyan A."
                    },
                    {
                        "name": "Liefeld T."
                    },
                    {
                        "name": "Tabor T."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Lupberger J."
                    },
                    {
                        "name": "Haas B.J."
                    },
                    {
                        "name": "Baumert T.F."
                    },
                    {
                        "name": "Hernaez M."
                    },
                    {
                        "name": "Reich M."
                    },
                    {
                        "name": "Quintana F.J."
                    },
                    {
                        "name": "Uhlmann E.J."
                    },
                    {
                        "name": "Krichevsky A.M."
                    },
                    {
                        "name": "Mesirov J.P."
                    },
                    {
                        "name": "Carey V."
                    },
                    {
                        "name": "Pochet N."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "Imaging-AMARETTO: An imaging genomics software tool to interrogate multiomics networks for relevance to radiography and histopathology imaging biomarkers of clinical outcomes"
            },
            "pmcid": "PMC7265792",
            "pmid": "32383980"
        }
    ],
    "toolType": [
        "Desktop application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}