{
    "additionDate": "2021-03-19T08:33:15Z",
    "biotoolsCURIE": "biotools:ldm",
    "biotoolsID": "ldm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yijuan.hu@emory.edu",
            "name": "Yi-Juan Hu",
            "typeEntity": "Person"
        }
    ],
    "description": "A rarefaction-based extension of the LDM for testing presence-absence associations in the microbiome.\n\nLinear Decomposition Model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Rarefaction",
                    "uri": "http://edamontology.org/operation_3797"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yijuanhu/LDM",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:37:15.563539Z",
    "name": "LDM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab012",
            "metadata": {
                "abstract": "Motivation: Many methods for testing association between the microbiome and covariates of interest (e.g. clinical outcomes, environmental factors) assume that these associations are driven by changes in the relative abundance of taxa. However, these associations may also result from changes in which taxa are present and which are absent. Analyses of such presence-absence associations face a unique challenge: confounding by library size (total sample read count), which occurs when library size is associated with covariates in the analysis. It is known that rarefaction (subsampling to a common library size) controls this bias, but at the potential cost of information loss as well as the introduction of a stochastic component into the analysis. Currently, there is a need for robust and efficient methods for testing presence-absence associations in the presence of such confounding, both at the community level and at the individual-taxon level, that avoid the drawbacks of rarefaction. Results: We have previously developed the linear decomposition model (LDM) that unifies the community-level and taxon-level tests into one framework. Here, we present an extension of the LDM for testing presence-absence associations. The extended LDM is a non-stochastic approach that repeatedly applies the LDM to all rarefied taxa count tables, averages the residual sum-of-squares (RSS) terms over the rarefaction replicates, and then forms an F-statistic based on these average RSS terms. We show that this approach compares favorably to averaging the F-statistic from R rarefaction replicates, which can only be calculated stochastically. The flexible nature of the LDM allows discrete or continuous traits or interactions to be tested while allowing confounding covariates to be adjusted for. Our simulations indicate that our proposed method is robust to any systematic differences in library size and has better power than alternative approaches. We illustrate our method using an analysis of data on inflammatory bowel disease (IBD) in which cases have systematically smaller library sizes than controls. Availabilityand implementation: The R package LDM is available on GitHub at https://github.com/yijuanhu/LDM in formats appropriate for Macintosh or Windows.",
                "authors": [
                    {
                        "name": "Hu Y.-J."
                    },
                    {
                        "name": "Lane A."
                    },
                    {
                        "name": "Satten G.A."
                    }
                ],
                "citationCount": 14,
                "date": "2021-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A rarefaction-based extension of the LDM for testing presence-absence associations in the microbiome"
            },
            "pmcid": "PMC8289387",
            "pmid": "33479757"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
