{
    "additionDate": "2021-01-18T09:28:34Z",
    "biotoolsCURIE": "biotools:deep4mc",
    "biotoolsID": "deep4mc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhongming.zhao@uth.tmc.edu",
            "name": "Zhongming Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep4mC is a web server for computational prediction of 4mC sites in the DNA sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo.uth.edu/Deep4mC",
    "lastUpdate": "2021-02-24T15:01:05Z",
    "name": "Deep4mC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA099",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.DNA N4-methylcytosine (4mC) modification represents a novel epigenetic regulation. It involves in various cellular processes, including DNA replication, cell cycle and gene expression, among others. In addition to experimental identification of 4mC sites, in silico prediction of 4mC sites in the genome has emerged as an alternative and promising approach. In this study, we first reviewed the current progress in the computational prediction of 4mC sites and systematically evaluated the predictive capacity of eight conventional machine learning algorithms as well as 12 feature types commonly used in previous studies in six species. Using a representative benchmark dataset, we investigated the contribution of feature selection and stacking approach to the model construction, and found that feature optimization and proper reinforcement learning could improve the performance. We next recollected newly added 4mC sites in the six species' genomes and developed a novel deep learning-based 4mC site predictor, namely Deep4mC. Deep4mC applies convolutional neural networks with four representative features. For species with small numbers of samples, we extended our deep learning framework with a bootstrapping method. Our evaluation indicated that Deep4mC could obtain high accuracy and robust performance with the average area under curve (AUC) values greater than 0.9 in all species (range: 0.9005-0.9722). In comparison, Deep4mC achieved an AUC value improvement from 10.14 to 46.21% when compared to previous tools in these six species. A user-friendly web server (https://bioinfo.uth.edu/Deep4mC) was built for predicting putative 4mC sites in a genome.",
                "authors": [
                    {
                        "name": "Jia P."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "citationCount": 6,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Deep4mC: systematic assessment and computational prediction for DNA N4-methylcytosine sites by deep learning"
            },
            "pmid": "32578842"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
