{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T08:43:52.801396Z",
    "biotoolsCURIE": "biotools:agrvate",
    "biotoolsID": "agrvate",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tread@emory.edu",
            "name": "Timothy D. Read",
            "orcidid": "https://orcid.org/0000-0001-8966-9680",
            "typeEntity": "Person"
        }
    ],
    "description": "AgrVATE is a tool for rapid identification of Staphylococcus aureus agr locus type and also reports possible variants in the agr operon.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Frameshift detection",
                    "uri": "http://edamontology.org/operation_0265"
                },
                {
                    "term": "Operon drawing",
                    "uri": "http://edamontology.org/operation_0579"
                },
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VishnuRaghuram94/AgrVATE",
    "lastUpdate": "2022-06-08T08:43:52.804065Z",
    "license": "MIT",
    "name": "AgrVATE",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1128/SPECTRUM.01334-21",
            "metadata": {
                "abstract": "Copyright © 2022 Raghuram et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.Staphylococcus aureus is a prominent nosocomial pathogen that causes several life-threatening diseases, such as pneumonia and bacteremia. S. aureus modulates the expression of its arsenal of virulence factors through sensing and integrating responses to environmental signals. The agr (accessory gene regulator) quorum sensing (QS) system is a major regulator of virulence phenotypes in S. aureus. There are four agr specificity groups each with a different autoinducer peptide sequence encoded by the agrD gene. Although agr is critical for the expression of many toxins, paradoxically, S. aureus strains often have nonfunctional agr activity due to loss-of-function mutations in the four-gene agr operon. To understand patterns in agr variability across S. aureus, we undertook a species-wide genomic investigation. We developed a software tool (AgrVATE; https://github.com/VishnuRaghuram94/AgrVATE) for typing and detecting frameshift mutations in the agr operon. In an analysis of over 40,000 S. aureus genomes, we showed a close association between agr type and S. aureus clonal complex. We also found a strong linkage between agrBDC alleles (encoding the peptidase, autoinducing peptide itself, and peptide sensor, respectively) but not agrA (encoding the response regulator). More than 5% of the genomes were found to have frameshift mutations in the agr operon. While 52% of these frameshifts occurred only once in the entire species, we observed cases where the recurring mutations evolved convergently across different clonal lineages with no evidence of long-term phylogenetic transmission, suggesting that strains with agr frameshifts were evolutionarily short-lived. Overall, genomic analysis of agr operon suggests evolution through multiple processes with functional consequences that are not fully understood. IMPORTANCE Staphylococcus aureus is a globally pervasive pathogen that produces a plethora of toxic molecules that can harm host immune cells. Production of these toxins is mainly controlled by an active agr quorum-sensing system, which senses and responds to bacterial cell density. However, there are many reports of S. aureus strains with genetic changes leading to impaired agr activity that are often found during chronic bloodstream infections and may be associated with increased disease severity. We developed an open-source software called AgrVATE to type agr systems and identify mutations. We used AgrVATE for a species-wide genomic survey of S. aureus, finding that more than 5% of strains in the public database had nonfunctional agr systems. We also provided new insights into the evolution of these genetic mutations in the agr system. Overall, this study contributes to our understanding of a common but relatively understudied means of virulence regulation in S. aureus.",
                "authors": [
                    {
                        "name": "Alexander A.M."
                    },
                    {
                        "name": "Goldberg J.B."
                    },
                    {
                        "name": "Loo H.Q."
                    },
                    {
                        "name": "Petit R.A."
                    },
                    {
                        "name": "Raghuram V."
                    },
                    {
                        "name": "Read T.D."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "Microbiology Spectrum",
                "title": "Species-Wide Phylogenomics of the Staphylococcus aureus Agr Operon Revealed Convergent Evolution of Frameshift Mutations"
            },
            "pmcid": "PMC8768832",
            "pmid": "35044202"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
