{
    "accessibility": "Open access",
    "additionDate": "2022-11-05T18:11:47.406087Z",
    "biotoolsCURIE": "biotools:thincr",
    "biotoolsID": "thincr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jmymryk@uwo.ca",
            "name": "Joe S. Mymryk",
            "orcidid": "https://orcid.org/0000-0002-3521-8005",
            "typeEntity": "Person"
        },
        {
            "name": "Anthony C. Nichols"
        },
        {
            "name": "John W. Barrett"
        },
        {
            "name": "Peter Y. F. Zeng"
        }
    ],
    "description": "A Suite of Tools for Investigating HPV-Dependent Human Carcinogenesis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://thincr.ca/",
    "lastUpdate": "2022-11-05T18:11:47.409567Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/msaland/THInCR-Suite"
        }
    ],
    "name": "THInCR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1128/MSPHERE.00317-22",
            "metadata": {
                "abstract": "Copyright © 2022 Salnikov et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.Human papillomaviruses (HPVs) are highly infectious and cause the most common sexually transmitted viral infections. They induce hyperproliferation of squamous epithelial tissue, often forming warts. Virally encoded proteins reprogram gene expression and cell growth to create an optimal environment for viral replication. In addition to their normal roles in infection, functional alterations induced by viral proteins establish conditions that frequently contribute to human carcinogenesis. In fact,;5% of human cancers are caused by HPVs, with virtually all cervical squamous cell carcinomas (CESC) and an increasing number of head and neck squamous cell carcinomas (HNSC) attributed to HPV infection. The Cancer Genome Atlas (TCGA) molecularly characterized thousands of primary human cancer samples in many cancer types, including CESC and HNSC, and created a comprehensive atlas of genomic, epigenomic, and transcriptomic data. This publicly available genome-wide information provides an unprecedented opportunity to expand the knowledge of the role that HPV plays in human carcinogenesis. While many tools exist to mine these data, few, if any, focus on the comparison of HPV-positive cancers with their HPV-negative counterparts or adjacent normal control tissue. We have constructed a suite of web-based tools, The HPV Induced Cancer Resource (THInCR), to utilize TCGA data for research related to HPV-induced CESC and HNSC. These tools allow investigators to gain greater biological and medical insights by exploring the impacts of HPV on cellular gene expression (mRNA and microRNA), altered gene methylation, and associations with patient survival and immune landscape features. These tools are accessible at https://thincr.ca/. IMPORTANCE The suite of analytical tools of THInCR provides the opportunity to investigate the roles that candidate target genes identified in cell lines or other model systems contribute to in actual HPV-dependent human cancers and is based on large-scale TCGA data sets. Expression of target genes, including both mRNA and microRNA, can be correlated with HPV gene expression, epigenetic changes in DNA methylation, patient survival, and numerous immune features, like leukocyte infiltration, interferon gamma response, T cell response, etc. Data from these analyses may immediately provide evidence to validate in vitro observations, reveal insights into mechanisms of virus-mediated alterations in cell growth, behavior, gene expression, and innate and adaptive immunity and may help hypothesis generation for further investigations.",
                "authors": [
                    {
                        "name": "Barrett J.W."
                    },
                    {
                        "name": "Gameiro S.F."
                    },
                    {
                        "name": "Mymryk J.S."
                    },
                    {
                        "name": "Nichols A.C."
                    },
                    {
                        "name": "Salnikov M."
                    },
                    {
                        "name": "Zeng P.Y.F."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "mSphere",
                "title": "The HPV Induced Cancer Resource (THInCR): a Suite of Tools for Investigating HPV-Dependent Human Carcinogenesis"
            },
            "pmcid": "PMC9429961",
            "pmid": "35950764"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
