{
    "additionDate": "2021-05-05T10:24:25Z",
    "biotoolsCURIE": "biotools:arx",
    "biotoolsID": "arx",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "thierry.meurers@charite.de",
            "name": "Thierry Meurers",
            "orcidid": "https://orcid.org/0000-0001-8168-7067",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "ARX is a comprehensive open source software for anonymizing sensitive personal data. It supports a wide variety of (1) privacy and risk models, (2) methods for transforming data and (3) methods for analyzing the usefulness of output data.\nThe software has been used in a variety of contexts, including commercial big data analytics platforms, research projects, clinical trial data sharing and for training purposes.\nARX is able to handle large datasets on commodity hardware and it features an intuitive cross-platform graphical user interface.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://arx.deidentifier.org/development/api/"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://arx.deidentifier.org/overview/"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://arx.deidentifier.org/downloads/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://arx.deidentifier.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-05-06T08:34:34Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/arx-deidentifier/arx"
        }
    ],
    "maturity": "Mature",
    "name": "ARX Data Anonymization Tool",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bih-tm",
    "publication": [
        {
            "doi": "10.1002/spe.2812",
            "metadata": {
                "abstract": "© 2020 The Authors. Software:Practice and Experience published by John Wiley & Sons, Ltd.The race for innovation has turned into a race for data. Rapid developments of new technologies, especially in the field of artificial intelligence, are accompanied by new ways of accessing, integrating, and analyzing sensitive personal data. Examples include financial transactions, social network activities, location traces, and medical records. As a consequence, adequate and careful privacy management has become a significant challenge. New data protection regulations, for example in the EU and China, are direct responses to these developments. Data anonymization is an important building block of data protection concepts, as it allows to reduce privacy risks by altering data. The development of anonymization tools involves significant challenges, however. For instance, the effectiveness of different anonymization techniques depends on context, and thus tools need to support a large set of methods to ensure that the usefulness of data is not overly affected by risk-reducing transformations. In spite of these requirements, existing solutions typically only support a small set of methods. In this work, we describe how we have extended an open source data anonymization tool to support almost arbitrary combinations of a wide range of techniques in a scalable manner. We then review the spectrum of methods supported and discuss their compatibility within the novel framework. The results of an extensive experimental comparison show that our approach outperforms related solutions in terms of scalability and output data quality—while supporting a much broader range of techniques. Finally, we discuss practical experiences with ARX and present remaining issues and challenges ahead.",
                "authors": [
                    {
                        "name": "Bild R."
                    },
                    {
                        "name": "Eicher J."
                    },
                    {
                        "name": "Kuhn K.A."
                    },
                    {
                        "name": "Prasser F."
                    },
                    {
                        "name": "Spengler H."
                    }
                ],
                "citationCount": 4,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Software - Practice and Experience",
                "title": "Flexible data anonymization using ARX—Current status and challenges ahead"
            },
            "type": [
                "Review"
            ]
        },
        {
            "doi": "10.1038/s41597-020-00773-y",
            "metadata": {
                "abstract": "© 2020, The Author(s).The Lean European Open Survey on SARS-CoV-2 Infected Patients (LEOSS) is a European registry for studying the epidemiology and clinical course of COVID-19. To support evidence-generation at the rapid pace required in a pandemic, LEOSS follows an Open Science approach, making data available to the public in real-time. To protect patient privacy, quantitative anonymization procedures are used to protect the continuously published data stream consisting of 16 variables on the course and therapy of COVID-19 from singling out, inference and linkage attacks. We investigated the bias introduced by this process and found that it has very little impact on the quality of output data. Current laws do not specify requirements for the application of formal anonymization methods, there is a lack of guidelines with clear recommendations and few real-world applications of quantitative anonymization procedures have been described in the literature. We therefore believe that our work can help others with developing urgently needed anonymization pipelines for their projects.",
                "authors": [
                    {
                        "name": "Jakob C.E.M."
                    },
                    {
                        "name": "Kohlmayer F."
                    },
                    {
                        "name": "Meurers T."
                    },
                    {
                        "name": "Prasser F."
                    },
                    {
                        "name": "Vehreschild J.J."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "Design and evaluation of a data anonymization pipeline to promote Open Science on COVID-19"
            },
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Desktop application",
        "Library"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Translational medicine",
            "uri": "http://edamontology.org/topic_3342"
        }
    ]
}
