
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/UtaDaphniaLab/Gene_Annotation_Easy_Viewer"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool",
            "Script"
        ],
        "topic": [
            {
                "term": "Functional genomics",
                "uri": "http://edamontology.org/topic_0085"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://zenodo.org/record/1251973#.W2wqly1kjfY"
        }
    ],
    "publication": [
        {
            "doi": "10.5281/zenodo.1251973",
            "type": "Primary"
        },
        {
            "abstract": "© 2018 Huynh T and Xu S. We developed a Gene Annotation Easy Viewer (GAEV) that integrates the gene annotation data from the KEGG (Kyoto Encyclopedia of Genes and Genomes) Automatic Annotation Server. GAEV generates an easy-to-read table that summarizes the query gene name, the KO (KEGG Orthology) number, name of gene orthologs, functional definition of the ortholog, and the functional pathways that query gene has been mapped to. Via links to KEGG pathway maps, users can directly examine the interaction between gene products involved in the same molecular pathway. We provide a usage example by annotating the newly published freshwater microcrustacean Daphnia pulex genome. This gene-centered view of gene function and pathways will greatly facilitate the genome annotation of non-model species and metagenomics data. GAEV runs on a Windows or Linux system equipped with Python 3 and provides easy accessibility to users with no prior Unix command line experience.",
            "authors": [
                "Huynh T.",
                "Xu S."
            ],
            "cit_count": 0,
            "doi": "10.12688/f1000research.14012.2",
            "journal": "F1000Research",
            "title": "Gene annotation easy viewer (GAEV): Integrating KEGG’s gene function annotations and associated molecular pathways [version 2; referees: 1 approved, 2 approved with reservations]",
            "type": "Primary",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gaev",
        "biotoolsID": "gaev",
        "description": "Gene Annotation Easy Viewer. It integrates the gene annotation data from the KEGG (Kyoto Encyclopedia of Genes and Genomes) Automatic Annotation Server and generates an easy-to-read table that summarizes the query gene name, the KO (KEGG Orthology) number, name of gene orthologs, functional definition of the ortholog, and the functional pathways that query gene has been mapped to.",
        "homepage": "https://github.com/UtaDaphniaLab/Gene_Annotation_Easy_Viewer",
        "name": "GAEV",
        "version": [
            "1.1.1"
        ]
    }
}