{
    "additionDate": "2017-08-03T19:06:19Z",
    "biotoolsCURIE": "biotools:itis-psetnc",
    "biotoolsID": "itis-psetnc",
    "credit": [
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://lin.uestc.edu.cn/"
        }
    ],
    "description": "This web-server was developed to identify Translation initiation site (TIS) by using the physicochemical properties of the pseudo trinucleotide composition.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lin.uestc.edu.cn/server/iTISPseTNC/readme"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Translation initiation site prediction",
                    "uri": "http://edamontology.org/operation_0439"
                }
            ]
        }
    ],
    "homepage": "http://lin.uestc.edu.cn/server/iTIS-PseTNC",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/itis-psetnc-identifying-translation-initiation-site-in-human-genes.html"
        }
    ],
    "name": "iTIS-PseTNC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 Elsevier Inc. All rights reserved.Translation is a key process for gene expression. Timely identification of the translation initiation site (TIS) is very important for conducting in-depth genome analysis. With the avalanche of genome sequences generated in the postgenomic age, it is highly desirable to develop automated methods for rapidly and effectively identifying TIS. Although some computational methods were proposed in this regard, none of them considered the global or long-range sequence-order effects of DNA, and hence their prediction quality was limited. To count this kind of effects, a new predictor, called \"iTIS-PseTNC,\" was developed by incorporating the physicochemical properties into the pseudo trinucleotide composition, quite similar to the PseAAC (pseudo amino acid composition) approach widely used in computational proteomics. It was observed by the rigorous cross-validation test on the benchmark dataset that the overall success rate achieved by the new predictor in identifying TIS locations was over 97%. As a web server, iTIS-PseTNC is freely accessible at http://lin.uestc.edu.cn/server/iTIS-PseTNC. To maximize the convenience of the vast majority of experimental scientists, a step-by-step guide is provided on how to use the web server to obtain the desired results without the need to go through detailed mathematical equations, which are presented in this paper just for the integrity of the new prection method.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Deng E.-Z."
                    },
                    {
                        "name": "Feng P.-M."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 231,
                "date": "2014-10-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "iTIS-PseTNC: A sequence-based predictor for identifying translation initiation site in human genes using pseudo trinucleotide composition"
            },
            "pmid": "25016190"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}
