{
    "accessibility": "Open access",
    "additionDate": "2024-06-17T18:46:35.226818Z",
    "biotoolsCURIE": "biotools:mttlmsup6_supa",
    "biotoolsID": "mttlmsup6_supa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yjsun@cumt.edu.cn",
            "name": "Yanjing Sun"
        }
    ],
    "description": "A multi-task transfer learning approach for base-resolution mRNA m6A site prediction based on an improved transformer.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://47.242.23.141/MTTLm6A/index.php",
    "lastUpdate": "2024-11-24T13:55:05.785056Z",
    "name": "MTTLmsup6 supA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3934/mbe.2024013",
            "metadata": {
                "abstract": "N6-methyladenosine (m6A) is a crucial RNA modification involved in various biological activities. Computational methods have been developed for the detection of m6A sites in Saccharomyces cerevisiae at base-resolution due to their cost-effectiveness and efficiency. However, the generalization of these methods has been hindered by limited base-resolution datasets. Additionally, RMBase contains a vast number of low-resolution m6A sites for Saccharomyces cerevisiae, and baseresolution sites are often inferred from these low-resolution results through post-calibration. We propose MTTLm6A, a multi-task transfer learning approach for base-resolution mRNA m6A site prediction based on an improved transformer. First, the RNA sequences are encoded by using one-hot encoding. Then, we construct a multi-task model that combines a convolutional neural network with a multi-head-attention deep framework. This model not only detects low-resolution m6A sites, it also assigns reasonable probabilities to the predicted sites. Finally, we employ transfer learning to predict base-resolution m6A sites based on the low-resolution m6A sites. Experimental results on Saccharomyces cerevisiae m6A and Homo sapiens m1A data demonstrate that MTTLm6A respectively achieved area under the receiver operating characteristic (AUROC) values of 77.13% and 92.9%, outperforming the state-of-the-art models. At the same time, it shows that the model has strong generalization ability. To enhance user convenience, we have made a user-friendly web server for MTTLm6A publicly available at http://47.242.23.141/MTTLm6A/index.php.",
                "authors": [
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zeng W."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 1,
                "date": "2024-01-01T00:00:00Z",
                "journal": "Mathematical Biosciences and Engineering",
                "title": "MTTLm6A: A multi-task transfer learning approach for base-resolution mRNA m6A site prediction based on an improved transformer"
            },
            "pmid": "38303423"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
