{
    "additionDate": "2020-01-14T20:03:36Z",
    "biotoolsCURIE": "biotools:RRphylo",
    "biotoolsID": "RRphylo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pasquale.raia@unina.it",
            "name": "Pasquale Raia",
            "orcidid": "https://orcid.org/0000-0002-4593-8006",
            "typeEntity": "Person"
        }
    ],
    "description": "A new, fast method to search for morphological convergence with shape data.\n\nThe goal of RRphylo is to compute phenotypic evolutionary rates, estimate ancestral states, locate rate shifts on the tree, and compare vectors of phenotypes and evolutionary rates among species. RRphylo is not based on any evolutionary model, and is best suited to work with phylogenies of fossil species.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis (shape)",
                    "uri": "http://edamontology.org/operation_0551"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pasraia/RRphylo",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-15T19:55:28Z",
    "name": "RRphylo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0226949",
            "metadata": {
                "abstract": "© 2019 Castiglione et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Morphological convergence is an intensely studied macroevolutionary phenomenon. It refers to the morphological resemblance between phylogenetically distant taxa. Currently available methods to explore evolutionary convergence either: rely on the analysis of the phenotypic resemblance between sister clades as compared to their ancestor, fit different evolutionary regimes to different parts of the tree to see whether the same regime explains phenotypic evolution in phylogenetically distant clades, or assess deviations from the congruence between phylogenetic and phenotypic distances. We introduce a new test for morphological convergence working directly with non-ultrametric (i.e. paleontological) as well as ultrametric phylogenies and multivariate data. The method (developed as the function search.conv within the R package RRphylo) tests whether unrelated clades are morphologically more similar to each other than expected by their phylogenetic distance. It additionally permits using known phenotypes as the most recent common ancestors of clades, taking full advantage of fossil information. We assessed the power of search.conv and the incidence of false positives by means of simulations, and then applied it to three well-known and long-discussed cases of (purported) morphological convergence: the evolution of grazing adaptation in the mandible of ungulates with high-crowned molars, the evolution of mandibular shape in sabertooth cats, and the evolution of discrete ecomorphs among anoles of Caribbean islands. The search.conv method was found to be powerful, correctly identifying simulated cases of convergent morphological evolution in 95% of the cases. Type I error rate is as low as 4-6%. We found search. conv is some three orders of magnitude faster than a competing method for testing convergence.",
                "authors": [
                    {
                        "name": "Barattolo F."
                    },
                    {
                        "name": "Castiglione S."
                    },
                    {
                        "name": "Di Febbraro M."
                    },
                    {
                        "name": "Melchionna M."
                    },
                    {
                        "name": "Mondanaro A."
                    },
                    {
                        "name": "Piras P."
                    },
                    {
                        "name": "Profico A."
                    },
                    {
                        "name": "Raia P."
                    },
                    {
                        "name": "Serio C."
                    },
                    {
                        "name": "Tamagnini D."
                    }
                ],
                "citationCount": 15,
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A new, fast method to search for morphological convergence with shape data"
            },
            "pmcid": "PMC6934287",
            "pmid": "31881075"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
