{
    "additionDate": "2019-11-14T18:38:13Z",
    "biotoolsCURIE": "biotools:ipcwswitch",
    "biotoolsID": "ipcwswitch",
    "confidence_flag": "tool",
    "description": "An R package for inverse probability of censoring weighting with an application to switches in clinical trials | In randomized clinical trials (RCT), the analysis is based on the intent-to-treat principle to avoid any selection bias in the constitution of groups. However, estimates of overall survival can be biased when significant crossover occurs because the separation of randomized groups is lost. To handle these switches, the inverse probability of censoring weighting (IPCW) method has been proposed; however, it is still poorly used in RCT, notably because of its complex implementation. In particular, for time-to-event outcomes, it can be difficult to format data, especially when time-dependent covariates have to be managed, with different measurement times between patients",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://cran.r-project.org/web/packages/ipcwswitch/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-14T13:05:47Z",
    "name": "ipcwswitch",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2019.103339",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdIn randomized clinical trials (RCT), the analysis is based on the intent-to-treat principle to avoid any selection bias in the constitution of groups. However, estimates of overall survival can be biased when significant crossover occurs because the separation of randomized groups is lost. To handle these switches, the inverse probability of censoring weighting (IPCW) method has been proposed; however, it is still poorly used in RCT, notably because of its complex implementation. In particular, for time-to-event outcomes, it can be difficult to format data, especially when time-dependent covariates have to be managed, with different measurement times between patients. This paper aims to present the R package ipcwswitch with some guidance for the analysis of the treatment effect on survival in a hypothetical setting where all patients would have continued to take the randomization treatment. After a brief recall of the key principles of the IPCW method, each step of the implementation is described using a toy example. The guidelines are illustrated in a case study that aimed at evaluating the benefit of therapy based on tumour molecular profiling for advanced cancers, SHIVA01.",
                "authors": [
                    {
                        "name": "Graffeo N."
                    },
                    {
                        "name": "Latouche A."
                    },
                    {
                        "name": "Le Tourneau C."
                    },
                    {
                        "name": "Chevret S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "ipcwswitch: An R package for inverse probability of censoring weighting with an application to switches in clinical trials"
            },
            "pmid": "31442762"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}