{
    "additionDate": "2020-01-14T19:55:12Z",
    "biotoolsCURIE": "biotools:nutriNetwork",
    "biotoolsID": "nutriNetwork",
    "confidence_flag": "tool",
    "description": "Dietary Intakes of Vegetable Protein, Folate, and Vitamins B-6 and B-12 Are Partially Correlated with Physical Functioning of Dutch Older Adults Using Copula Graphical Models.\n\nStructure Learning with Copula Graphical Model.\n\nStatistical tool for learning the structure of direct associations among variables for continuous data, discrete data and mixed discrete-continuous data. The package is based on the copula graphical model in Behrouzi and Wit (2017) <doi:10.1111/rssc.12287>",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/nutriNetwork",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:50:50.311106Z",
    "license": "GPL-3.0",
    "name": "nutriNetwork",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/jn/nxz269",
            "metadata": {
                "abstract": "Background: In nutritional epidemiology, dealing with confounding and complex internutrient relations are major challenges. An often-used approach is dietary pattern analyses, such as principal component analysis, to deal with internutrient correlations, and to more closely resemble the true way nutrients are consumed. However, despite these improvements, these approaches still require subjective decisions in the preselection of food groups. Moreover, they do not make efficient use of multivariate dietary data, because they detect only marginal associations. We propose the use of copula graphical models (CGMs) to model and make statistical inferences regarding complex associations among variables in multivariate data, where associations between all variables can be learned simultaneously. Objective: We aimed to reconstruct nutritional intake and physical functioning networks in Dutch older adults by applying a CGM. Methods: We addressed this issue by uncovering the pairwise associations between variables while correcting for the effect of remaining variables. More specifically, we used a CGM to infer the precision matrix, which contains all the conditional independence relations between nodes in the graph. The nonzero elements of the precision matrix indicate the presence of a direct association. We applied this method to reconstruct nutrient-physical functioning networks from the combined data of 4 studies (Nu-Age, ProMuscle, ProMO, and V-Fit, total n = 662, mean ± SD age = 75 ± 7 y). The method was implemented in the R package nutriNetwork which is freely available at https://cran.r-project.org/web/packages/nutriNetwork. Results: Greater intakes of vegetable protein and vitamin B-6 were partially correlated with higher scores on the total Short Physical Performance Battery (SPPB) and the chair rise test. Greater intakes of vitamin B-12 and folate were partially correlated with higher scores on the chair rise test and the total SPPB, respectively. Conclusions: We determined that vegetable protein, vitamin B-6, folate, and vitamin B-12 intakes are partially correlated with improved functional outcome measurements in Dutch older adults.",
                "authors": [
                    {
                        "name": "Behrouzi P."
                    },
                    {
                        "name": "De Groot L.C.P.G.M."
                    },
                    {
                        "name": "Feskens E.J.M."
                    },
                    {
                        "name": "Grootswagers P."
                    },
                    {
                        "name": "Keizer P.L.C."
                    },
                    {
                        "name": "Smeets E.T.H.C."
                    },
                    {
                        "name": "Van Eeuwijk F.A."
                    }
                ],
                "citationCount": 23,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Journal of Nutrition",
                "title": "Dietary Intakes of Vegetable Protein, Folate, and Vitamins B-6 and B-12 Are Partially Correlated with Physical Functioning of Dutch Older Adults Using Copula Graphical Models"
            },
            "pmcid": "PMC7056616",
            "pmid": "31858107"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
