{"credit":[{"email":"jean-francois.gibrat@inra.fr","name":"Jean-François Gibrat","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://forgemia.inra.fr/jean-francois.gibrat/BAND_DYN_PROG/blob/master/00README"}],"function":[{"operation":[{"term":"Short read error correction","uri":"http://edamontology.org/operation_3195"}]},{"operation":[{"term":"Global alignment","uri":"http://edamontology.org/operation_0496"}]}],"labels":{"language":["C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Next generation sequencing","uri":"http://edamontology.org/topic_3168"}]},"publication":[{"abstract":"© 2018 The Author(s). Background: Third generation sequencing technologies generate long reads that exhibit high error rates, in particular for insertions and deletions which are usually the most difficult errors to cope with. The only exact algorithm capable of aligning sequences with insertions and deletions is a dynamic programming algorithm. Results: In this note, for the sake of efficiency, we consider dynamic programming in a band. We show how to choose the band width in function of the long reads' error rates, thus obtaining an O( N 3/2 ) algorithm in space and time. We also propose a procedure to decide whether this algorithm, when applied to semi-global alignments, provides the optimal score. Conclusions: We suggest that dynamic programming in a band is well suited to the problem of aligning long reads between themselves and can be used as a core component of methods for obtaining a consensus sequence from the long reads alone. The function implementing the dynamic programming algorithm in a band is available, as a standalone program, at: https://forgemia.inra.fr/jean-francois.gibrat/BAND_DYN_PROG.git.","authors":["Gibrat J.-F."],"cit_count":0,"doi":"10.1186/s12859-018-2228-9","journal":"BMC Bioinformatics","title":"A short note on dynamic programming in a band","type":"Primary","year":"2018-06-15"}],"summary":{"biotoolsCURIE":"biotools:band_dyn_prog","biotoolsID":"band_dyn_prog","description":"Dynamic programming in a band is well suited to the problem of aligning long reads between themselves and can be used as a core component of methods for obtaining a consensus sequence from the long reads alone.","homepage":"https://forgemia.inra.fr/jean-francois.gibrat/BAND_DYN_PROG","name":"BAND_DYN_PROG"}}