{
    "additionDate": "2021-01-18T10:07:24Z",
    "biotoolsCURIE": "biotools:rssalib",
    "biotoolsID": "rssalib",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thanh.vo@aalto.fi",
            "name": "Vo Hong Thanh",
            "typeEntity": "Person"
        }
    ],
    "description": "a library for stochastic simulation of complex biochemical reactions.\n\nThe Java-based implementation of the rejection-based stochastic simulation algorithm (RSSA) and a wide range of its improvements to accelerate the simulation and analysis of biochemical reactions. The simulation library supports reactions with complex kinetics and time delays, necessary to model complexities of reaction mechanisms. RSSALib provides both an application program interface (API) and a graphic user interface (GUI) to ease the set-up and visualization of the simulation results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vo-hong-thanh/rssalib",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-08T13:43:34Z",
    "license": "GPL-3.0",
    "name": "RSSALib",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA602",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Stochastic chemical kinetics is an essential mathematical framework for investigating the dynamics of biological processes, especially when stochasticity plays a vital role in their development. Simulation is often the only option for the analysis of many practical models due to their analytical intractability. Results: We present in this article, the simulation library RSSALib, implementing our recently developed rejection-based stochastic simulation algorithm (RSSA) and a wide range of its improvements, to accelerate the simulation and analysis of biochemical reactions. RSSALib supports reactions with complex kinetics and time delays, necessary to model complexities of reaction mechanisms. Our library provides both an application program interface and a graphic user interface to ease the set-up and visualization of the simulation results.",
                "authors": [
                    {
                        "name": "Thanh V.H."
                    }
                ],
                "date": "2020-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RSSALib: A library for stochastic simulation of complex biochemical reactions"
            },
            "pmcid": "PMC7750935",
            "pmid": "32614393"
        }
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}
