{"collectionID": [], "accessibility": [], "topic": [{"term": "DNA", "uri": "http://edamontology.org/topic_0654"}, {"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "16538282", "type": null, "pmcid": null, "metadata": {"title": "Statistical, computational and visualization methodologies to unveil gene primary structure features", "abstract": "Objectives: Gene sequence features such as codon bias, codon context, and codon expansion (e.g. trinucleotide repeats) can be better understood at the genomic scale level by combining statistical methodologies with advanced computer algorithms and data visualization through sophisticated graphical interfaces. This paper presents the ANACONDA system, a bioinformatics application for gene primary structure analysis. Methods: Codon usage tables using absolute metric and software for multivariate analysis of codon and amino acid usage are available in public databases. However, they do not provide easy computational and statistical tools to carry out detailed gene primary structure analysis on a genomic scale. We propose the usage of several statistical methods - contingency table analysis, residual analysis, multivariate analysis (cluster analysis) - to analyze the codon bias under various aspects (degree of association, contexts and clustering). Results: The developed solution is a software application that provides a user-guided analysis of codon sequences considering several contexts and codon usage on a genomic scale. The utilization of this tool in our molecular biology laboratory is focused on particular genomes, especially those from Sacchoromyces cerevisiae, Candida albicans Escherichia coli. In order to illustrate the applicability and output layouts of the software these species are herein used as examples. Conclusions: The statistical tools incorporated in the system are allowing to obtain global views of important sequence features. It is expected that the results obtained will permit identification of general rules that govern codon context and codon usage in any genome. Additionally, identification of genes containing expanded codons that arise as a consequence of erroneous DNA replication events will permit uncovering new genes associated with human disease. © 2006 Schattauer GmbH.", "citationCount": 17, "authors": [{"name": "Pinheiro M."}, {"name": "Afreixo V."}, {"name": "Moura G."}, {"name": "Freitas A."}, {"name": "Santos M.A.S."}, {"name": "Oliveira J.L."}], "date": "2006-07-19T00:00:00Z", "journal": "Methods of Information in Medicine"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "José Luis Oliveira", "url": "http://bioinformatics.ua.pt/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "jlo@ua.pt"}], "biotoolsCURIE": "biotools:anaconda", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://bioinformatics.ua.pt/software/anaconda/", "function": [{"note": null, "input": [], "operation": [{"term": "Statistical inference", "uri": "http://edamontology.org/operation_3658"}, {"term": "Nucleic acid sequence analysis", "uri": "http://edamontology.org/operation_2478"}, {"term": "Coding region prediction", "uri": "http://edamontology.org/operation_0436"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:43Z", "otherID": [], "description": "Software package specially developed for the study of genes’ primary structure. It uses gene sequences downloaded from public databases, as FASTA and GenBank, and it applies a set of statistical and visualization methods in different ways, to reveal information about codon context, codon usage, nucleotide repeats within open reading frames (ORFeome) and others.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/anaconda-2-0-study-genes-primary-structure.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "anaconda", "additionDate": "2017-08-03T18:35:48Z", "name": "ANACONDA", "license": null, "documentation": [{"url": "http://bioinformatics.ua.pt/software/anaconda/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Windows"]}