
{
    "credit": [
        {
            "email": "pbourkey@gmail.com",
            "name": "Peter Bourke",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://cran.r-project.org/web/packages/polymapR/polymapR.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press.Motivation Polyploid species carry more than two copies of each chromosome, a condition found in many of the world's most important crops. Genetic mapping in polyploids is more complex than in diploid species, resulting in a lack of available software tools. These are needed if we are to realize all the opportunities offered by modern genotyping platforms for genetic research and breeding in polyploid crops. Results polymapR is an R package for genetic linkage analysis and integrated genetic map construction from bi-parental populations of outcrossing autopolyploids. It can currently analyse triploid, tetraploid and hexaploid marker datasets and is applicable to various crops including potato, leek, alfalfa, blueberry, chrysanthemum, sweet potato or kiwifruit. It can detect, estimate and correct for preferential chromosome pairing, and has been tested on high-density marker datasets from potato, rose and chrysanthemum, generating high-density integrated linkage maps in all of these crops. Availability and implementation polymapR is freely available under the general public license from the Comprehensive R Archive Network (CRAN) at http://cran.r-project.org/package=polymapR. Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Bourke P.M.",
                "Van Geest G.",
                "Voorrips R.E.",
                "Jansen J.",
                "Kranenburg T.",
                "Shahin A.",
                "Visser R.G.F.",
                "Arens P.",
                "Smulders M.J.M.",
                "Maliepaard C."
            ],
            "cit_count": 3,
            "doi": "10.1093/bioinformatics/bty371",
            "journal": "Bioinformatics",
            "title": "PolymapR - Linkage analysis and genetic map construction from F 1 populations of outcrossing polyploids",
            "year": "2018-10-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:polymapr",
        "biotoolsID": "polymapr",
        "description": "Creation of linkage maps in polyploid species from marker dosage scores of an F1 cross from two heterozygous parents.",
        "homepage": "https://cran.r-project.org/web/packages/polymapR/index.html",
        "name": "polymapR"
    }
}