{
    "additionDate": "2021-11-29T10:16:11.387518Z",
    "biotoolsCURIE": "biotools:rephiner",
    "biotoolsID": "rephiner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jshapiro2@luc.edu",
            "name": "Jason W. Shapiro",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://jasonshapiro.weebly.com/"
        }
    ],
    "description": "Rephine.r is a pipeline for correcting gene calls and clusters to improve phage pangenomes and phylogenies. Rephine.r is a command-line R script designed to identify common errors in gene clustering that can arise when building phage pangenomes. These include errors due to distant homologs being separated into multiple gene clusters, or fragmented genes being misidentified as multi-copy genes. Correcting these errors will often make it possible to identify new single-copy core genes that can be used downstream to build phylogenies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://www.github.com/coevoeco/Rephine.r",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T10:16:11.390177Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/coevoeco/Rephine.r/issues"
        }
    ],
    "name": "Rephine.r",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/peerj.11950",
            "metadata": {
                "abstract": "© 2021 Shapiro and PutontiBackground. A pangenome is the collection of all genes found in a set of related genomes. For microbes, these genomes are often different strains of the same species, and the pangenome offers a means to compare gene content variation with differences in phenotypes, ecology, and phylogenetic relatedness. Though most frequently applied to bacteria, there is growing interest in adapting pangenome analysis to bacteriophages. However, working with phage genomes presents new challenges. First, most phage families are under-sampled, and homologous genes in related viruses can be difficult to identify. Second, homing endonucleases and intron-like sequences may be present, resulting in fragmented gene calls. Each of these issues can reduce the accuracy of standard pangenome analysis tools. Methods. We developed an R pipeline called Rephine.r that takes as input the gene clusters produced by an initial pangenomics workflow. Rephine.r then proceeds in two primary steps. First, it identifies three common causes of fragmented gene calls: (1) indels creating early stop codons and new start codons; (2) interruption by a selfish genetic element; and (3) splitting at the ends of the reported genome. Fragmented genes are then fused to create new sequence alignments. In tandem, Rephine.r searches for distant homologs separated into different gene families using Hidden Markov Models. Significant hits are used to merge families into larger clusters. A final round of fragment identification is then run, and results may be used to infer single-copy core genomes and phylogenetic trees. Results. We applied Rephine.r to three well-studied phage groups: the Tevenvirinae (e.g., T4), the Studiervirinae (e.g., T7), and the Pbunaviruses (e.g., PB1). In each case, Rephine.r recovered additional members of the single-copy core genome and increased the overall bootstrap support of the phylogeny. The Rephine.r pipeline is provided through GitHub (https://www.github.com/coevoeco/Rephine.r) as a single script for automated analysis and with utility functions to assist in building single-copy core genomes and predicting the sources of fragmented genes.",
                "authors": [
                    {
                        "name": "Putonti C."
                    },
                    {
                        "name": "Shapiro J.W."
                    }
                ],
                "date": "2021-08-06T00:00:00Z",
                "journal": "PeerJ",
                "title": "Rephine.r: A pipeline for correcting gene calls and clusters to improve phage pangenomes and phylogenies"
            },
            "pmid": "34434663",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
