{
    "additionDate": "2018-06-30T17:36:42Z",
    "biotoolsCURIE": "biotools:emase",
    "biotoolsID": "emase",
    "credit": [
        {
            "email": "gary.churchill@jax.org",
            "name": "Gary A Churchill",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Expectation-Maximization algorithm for Allele Specific Expression.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/churchill-lab/emase"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/churchill-lab/emase",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-3.0",
    "name": "EMASE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty078",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved. Motivation: Allele-specific expression (ASE) refers to the differential abundance of the allelic copies of a transcript. RNA sequencing (RNA-seq) can provide quantitative estimates of ASE for genes with transcribed polymorphisms. When short-read sequences are aligned to a diploid transcriptome, read-mapping ambiguities confound our ability to directly count reads. Multi-mapping reads aligning equally well to multiple genomic locations, isoforms or alleles can comprise the majority (>85%) of reads. Discarding them can result in biases and substantial loss of information. Methods have been developed that use weighted allocation of read counts but these methods treat the different types of multi-reads equivalently. We propose a hierarchical approach to allocation of read counts that first resolves ambiguities among genes, then among isoforms, and lastly between alleles. We have implemented our model in EMASE software (Expectation-Maximization for Allele Specific Expression) to estimate total gene expression, isoform usage and ASE based on this hierarchical allocation. Results: Methods that align RNA-seq reads to a diploid transcriptome incorporating known genetic variants improve estimates of ASE and total gene expression compared to methods that use reference genome alignments. Weighted allocation methods outperform methods that discard multi-reads. Hierarchical allocation of reads improves estimation of ASE even when data are simulated from a nonhierarchical model. Analysis of RNA-seq data from F1 hybrid mice using EMASE reveals widespread ASE associated with cis-acting polymorphisms and a small number of parent-of-origin effects.",
                "authors": [
                    {
                        "name": "Raghupathy N."
                    },
                    {
                        "name": "Choi K."
                    },
                    {
                        "name": "Vincent M.J."
                    },
                    {
                        "name": "Beane G.L."
                    },
                    {
                        "name": "Sheppard K.S."
                    },
                    {
                        "name": "Munger S.C."
                    },
                    {
                        "name": "Korstanje R."
                    },
                    {
                        "name": "Pardo-Manual De Villena F."
                    },
                    {
                        "name": "Churchill G.A."
                    }
                ],
                "citationCount": 2,
                "date": "2018-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Hierarchical analysis of RNA-seq reads improves the accuracy of allele-specific expression"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}