{
    "accessibility": "Open access",
    "additionDate": "2024-03-27T20:35:20.553995Z",
    "biotoolsCURIE": "biotools:amend",
    "biotoolsID": "amend",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jthompson21@kumc.edu",
            "name": "Jeffrey A. Thompson",
            "typeEntity": "Person"
        },
        {
            "name": "Chad Slawson",
            "typeEntity": "Person"
        },
        {
            "name": "Samuel S Boyd",
            "typeEntity": "Person"
        }
    ],
    "description": "AMEND (Active Module identification using Experimental data and Network Diffusion) is an algorithm designed to find a subset of connected nodes in a molecular interaction network that have large experimental values. It makes use of random walk with restart (RWR) to create node weights, and a heuristic approach for solving the Maximum-weight Connected Subgraph problem using these weights. The resulting subnetwork is then scored based on average experimental values and connectivity, and it is used as input into RWR for the next iteration. This process is performed iteratively until an optimal subnetwork (i.e., module) is found.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/samboyd0/AMEND",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-03-27T20:35:20.556565Z",
    "name": "AMEND",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05376-Z",
            "metadata": {
                "abstract": "Background: Molecular interaction networks have become an important tool in providing context to the results of various omics experiments. For example, by integrating transcriptomic data and protein–protein interaction (PPI) networks, one can better understand how the altered expression of several genes are related with one another. The challenge then becomes how to determine, in the context of the interaction network, the subset(s) of genes that best captures the main mechanisms underlying the experimental conditions. Different algorithms have been developed to address this challenge, each with specific biological questions in mind. One emerging area of interest is to determine which genes are equivalently or inversely changed between different experiments. The equivalent change index (ECI) is a recently proposed metric that measures the extent to which a gene is equivalently or inversely regulated between two experiments. The goal of this work is to develop an algorithm that makes use of the ECI and powerful network analysis techniques to identify a connected subset of genes that are highly relevant to the experimental conditions. Results: To address the above goal, we developed a method called Active Module identification using Experimental data and Network Diffusion (AMEND). The AMEND algorithm is designed to find a subset of connected genes in a PPI network that have large experimental values. It makes use of random walk with restart to create gene weights, and a heuristic solution to the Maximum-weight Connected Subgraph problem using these weights. This is performed iteratively until an optimal subnetwork (i.e., active module) is found. AMEND was compared to two current methods, NetCore and DOMINO, using two gene expression datasets. Conclusion: The AMEND algorithm is an effective, fast, and easy-to-use method for identifying network-based active modules. It returned connected subnetworks with the largest median ECI by magnitude, capturing distinct but related functional groups of genes. Code is freely available at https://github.com/samboyd0/AMEND .",
                "authors": [
                    {
                        "name": "Boyd S.S."
                    },
                    {
                        "name": "Slawson C."
                    },
                    {
                        "name": "Thompson J.A."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AMEND: active module identification using experimental data and network diffusion"
            },
            "pmcid": "PMC10324253",
            "pmid": "37415126"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
