{
    "additionDate": "2018-04-22T14:16:52Z",
    "biotoolsCURIE": "biotools:t-lex2",
    "biotoolsID": "t-lex2",
    "credit": [
        {
            "email": "asfiston@univ-montp2.fr",
            "name": "Anna-Sophie Fiston-Lavier",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software that allows routine, automatic and accurate genotyping of individual TE insertions and estimation of their population frequencies both using individual strain and pooled next-generation sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://petrov.stanford.edu/cgi-bin/Tlex2_manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://petrov.stanford.edu/cgi-bin/Tlex.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-05-19T15:00:31Z",
    "name": "T-lex2",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_005134"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/nar/gku1250",
            "metadata": {
                "abstract": "© 2015 The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.Transposable elements (TEs) constitute the most active, diverse and ancient component in a broad range of genomes. Complete understanding of genome function and evolution cannot be achieved without a thorough understanding of TE impact and biology. However, in-depth analysis of TEs still represents a challenge due to the repetitive nature of these genomic entities. In this work, we present a broadly applicable and flexible tool: T-lex2. T-lex2 is the only available software that allows routine, automatic and accurate genotyping of individual TE insertions and estimation of their population frequencies both using individual strain and pooled next-generation sequencing data. Furthermore, T-lex2 also assesses the quality of the calls allowing the identification of miss-annotated TEs and providing the necessary information to re-annotate them. The flexible and customizable design of T-lex2 allows running it in any genome and for any type of TE insertion. Here, we tested the fidelity of T-lex2 using the fly and human genomes. Overall, T-lex2 represents a significant improvement in our ability to analyze the contribution of TEs to genome function and evolution as well as learning about the biology of TEs. T-lex2 is freely available online at http://sourceforge.net/projects/tlex.",
                "authors": [
                    {
                        "name": "Fiston-Lavier A.-S."
                    },
                    {
                        "name": "Barron M.G."
                    },
                    {
                        "name": "Petrov D.A."
                    },
                    {
                        "name": "Gonzalez J."
                    }
                ],
                "citationCount": 37,
                "date": "2015-02-27T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "T-lex2: Genotyping, frequency estimation and re-annotation of transposable elements using single or pooled next-generation sequencing data"
            },
            "pmcid": "PMC4344482",
            "pmid": "25510498"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}