{
    "additionDate": "2017-01-13T13:15:22Z",
    "biotoolsCURIE": "biotools:metaxa",
    "biotoolsID": "metaxa",
    "credit": [
        {
            "email": "Johan.Bengtsson@microbiology.se",
            "name": "Johan Bengtsson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Metaxa uses Hidden Markov Models to identify, extract and classify small-subunit (SSU) rRNA sequences (12S/16S/18S) of bacterial, archaeal, eukaryotic, chloroplast and mitochondrial origin in metagenomes and other large sequence sets",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://microbiology.se/software/metaxa/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://microbiology.se/software/metaxa/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Metaxa",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The ribosomal small subunit (SSU) rRNA gene has emerged as an important genetic marker for taxonomic identification in environmental sequencing datasets. In addition to being present in the nucleus of eukaryotes and the core genome of prokaryotes, the gene is also found in the mitochondria of eukaryotes and in the chloroplasts of photosynthetic eukaryotes. These three sets of genes are conceptually paralogous and should in most situations not be aligned and analyzed jointly. To identify the origin of SSU sequences in complex sequence datasets has hitherto been a time-consuming and largely manual undertaking. However, the present study introduces Metaxa (http://microbiology.se/software/ metaxa/), an automated software tool to extract full-length and partial SSU sequences from larger sequence datasets and assign them to an archaeal, bacterial, nuclear eukaryote, mitochondrial, or chloroplast origin. Using data from reference databases and from full-length organelle and organism genomes, we show that Metaxa detects and scores SSU sequences for origin with very low proportions of false positives and negatives. We believe that this tool will be useful in microbial and evolutionary ecology as well as in metagenomics. © 2011 Springer Science+Business Media B.V.",
                "authors": [
                    {
                        "name": "Bengtsson J."
                    },
                    {
                        "name": "Eriksson K.M."
                    },
                    {
                        "name": "Hartmann M."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Shenoy B.D."
                    },
                    {
                        "name": "Grelet G.-A."
                    },
                    {
                        "name": "Abarenkov K."
                    },
                    {
                        "name": "Petri A."
                    },
                    {
                        "name": "Alm Rosenblad M."
                    },
                    {
                        "name": "Nilsson R.H."
                    }
                ],
                "citationCount": 46,
                "date": "2011-10-01T00:00:00Z",
                "journal": "Antonie van Leeuwenhoek, International Journal of General and Molecular Microbiology",
                "title": "Metaxa: A software tool for automated detection and discrimination among ribosomal small subunit (12S/16S/18S) sequences of archaea, bacteria, eukaryotes, mitochondria, and chloroplasts in metagenomes and environmental sequencing datasets"
            },
            "pmid": "21674231"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}