{
    "accessibility": [],
    "additionDate": "2015-08-03T09:36:55Z",
    "biotoolsCURIE": "biotools:moduleorganizer",
    "biotoolsID": "moduleorganizer",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "BioCatalogue",
            "note": null,
            "orcidid": null,
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "email": "support@genouest.org",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Software package proposing a synthetic view of a set of DNA sequences by providing both a segmentation of them into domains and a classification on the basis of these domains.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.genouest.org/spip.php?page=outils&id_rubrique=113&lang=en"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.genouest.org/spip.php?page=outils&id_rubrique=113&lang=en",
    "homepage_status": 1,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "https://www.biocatalogue.org/services/2066"
        }
    ],
    "maturity": null,
    "name": "moduleorganizer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-474",
            "metadata": {
                "abstract": "Background: Most known eukaryotic genomes contain mobile copied elements called transposable elements. In some species, these elements account for the majority of the genome sequence. They have been subject to many mutations and other genomic events (copies, deletions, captures) during transposition. The identification of these transformations remains a difficult issue. The study of families of transposable elements is generally founded on a multiple alignment of their sequences, a critical step that is adapted to transposons containing mostly localized nucleotide mutations. Many transposons that have lost their protein-coding capacity have undergone more complex rearrangements, needing the development of more complex methods in order to characterize the architecture of sequence variations.Results: In this study, we introduce the concept of a transposable element module, a flexible motif present in at least two sequences of a family of transposable elements and built on a succession of maximal repeats. The paper proposes an assembly method working on a set of exact maximal repeats of a set of sequences to create such modules. It results in a graphical view of sequences segmented into modules, a representation that allows a flexible analysis of the transformations that have occurred between them. We have chosen as a demonstration data set in depth analysis of the transposable element Foldback in Drosophila melanogaster. Comparison with multiple alignment methods shows that our method is more sensitive for highly variable sequences. The study of this family and the two other families AtREP21 and SIDER2 reveals new copies of very different sizes and various combinations of modules which show the potential of our method. Conclusions: ModuleOrganizer is available on the Genouest bioinformatics center at http://moduleorganizer.genouest.org. © 2010 Tempel et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Tempel S."
                    },
                    {
                        "name": "Rousseau C."
                    },
                    {
                        "name": "Tahi F."
                    },
                    {
                        "name": "Nicolas J."
                    }
                ],
                "citationCount": 4,
                "date": "2010-09-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ModuleOrganizer: Detecting modules in families of transposable elements"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}