{
    "additionDate": "2019-11-14T18:43:27Z",
    "biotoolsCURIE": "biotools:stra-net",
    "biotoolsID": "stra-net",
    "confidence_flag": "tool",
    "description": "Video Saliency Prediction using Spatiotemporal Residual Attentive Networks | This repository is the implementation of 'Video Saliency Prediction using Spatiotemporal Residual Attentive Networks (TIP2019)'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ashleylqx/STRA-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-24T08:28:57Z",
    "name": "Spatiotemporal Residual Attentive Networks",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TIP.2019.2936112",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.This paper proposes a novel residual attentive learning network architecture for predicting dynamic eye-fixation maps. The proposed model emphasizes two essential issues, i.e., effective spatiotemporal feature integration and multi-scale saliency learning. For the first problem, appearance and motion streams are tightly coupled via dense residual cross connections, which integrate appearance information with multi-layer, comprehensive motion features in a residual and dense way. Beyond traditional two-stream models learning appearance and motion features separately, such design allows early, multi-path information exchange between different domains, leading to a unified and powerful spatiotemporal learning architecture. For the second one, we propose a composite attention mechanism that learns multi-scale local attentions and global attention priors end-to-end. It is used for enhancing the fused spatiotemporal features via emphasizing important features in multi-scales. A lightweight convolutional Gated Recurrent Unit (convGRU), which is flexible for small training data situation, is used for long-term temporal characteristics modeling. Extensive experiments over four benchmark datasets clearly demonstrate the advantage of the proposed video saliency model over other competitors and the effectiveness of each component of our network. Our code and all the results will be available at https://github.com/ashleylqx/STRA-Net.",
                "authors": [
                    {
                        "name": "Lai Q."
                    },
                    {
                        "name": "Shen J."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Wang W."
                    }
                ],
                "citationCount": 35,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Video saliency prediction using spatiotemporal residual attentive networks"
            },
            "pmid": "31449021"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
