{
    "accessibility": "Open access",
    "additionDate": "2022-05-27T13:59:52.873603Z",
    "biotoolsCURIE": "biotools:me_again_meds",
    "biotoolsID": "me_again_meds",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "falemi@gmu.edu",
            "name": "Farrokh Alemi",
            "typeEntity": "Person"
        },
        {
            "name": "Janusz Wojtusiak"
        },
        {
            "name": "Vijay S Nori"
        }
    ],
    "description": "A site to help depressed patients select an antidepressant tahat is most likely to help them",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://hi.gmu.edu/ad",
    "lastUpdate": "2022-05-27T13:59:52.876294Z",
    "name": "Me Again Meds",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.ECLINM.2021.101171",
            "metadata": {
                "abstract": "© 2021Background: This study summarizes the experiences of patients, who have multiple comorbidities, with 15 mono-treated antidepressants. Methods: This is a retrospective, observational, matched case control study. The cohort was organized using claims data available through OptumLabs for depressed patients treated with antidepressants between January 1, 2001 and December 31, 2018. The cohort included patients from all states within United States of America. The analysis focused on 3,678,082 patients with major depression who had 10,221,145 antidepressant treatments. Using the robust, and large predictors of remission, and propensity to prescribe an antidepressant, the study created 16,770 subgroups of patients. The study reports the remission rate for the antidepressants within the subgroups. The overall impact of antidepressant on remission was calculated as the common odds ratio across the strata. Findings: The study accurately modelled clinicians’ prescription patterns (cross-validated Area under the Receiver Operating Curve, AROC, of 82.0%, varied from 77% to 90%) and patients’ remission (cross-validated AROC of 72.0%, varied from 69.5% to 78%). In different strata, contrary to published randomized studies, remission rates differed significantly and antidepressants were not equally effective. For example, in age and gender subgroups, the best antidepressant had an average remission rate of 50.78%, 1.5 times higher than the average antidepressant (30.30% remission rate) and 20 times higher than the worst antidepressant. The Breslow-Day chi-square test for homogeneity showed that across strata a homogenous common odds-ratio did not exist (alpha<0.0001). Therefore, the choice of the optimal antidepressant depended on the strata defined by the patient's medical history. Interpretation: Study findings may not be appropriate for specific patients. To help clinicians assess the transferability of study findings to specific patient, the web site http://hi.gmu.edu/ad assesses the patient's medical history, finds similar cases in our data, and recommends an antidepressant based on the experience of remission in our data. Patients can share this site's recommendations with their clinicians, who can then assess the appropriateness of the recommendations. Funding: This project was funded by the Robert Wood Johnson foundation grant #76786. The development of related web site was supported by grant 247-02-20 from Virginia's Commonwealth Health Research Board.",
                "authors": [
                    {
                        "name": "Alemi F."
                    },
                    {
                        "name": "Becker L.K."
                    },
                    {
                        "name": "Hane C.A."
                    },
                    {
                        "name": "Min H."
                    },
                    {
                        "name": "Nori V.S."
                    },
                    {
                        "name": "Wojtusiak J."
                    },
                    {
                        "name": "Yousefi M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-11-01T00:00:00Z",
                "journal": "eClinicalMedicine",
                "title": "Effectiveness of common antidepressants: a post market release study"
            },
            "pmcid": "PMC8633963",
            "pmid": "34877511"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
