{
    "additionDate": "2019-11-14T18:01:20Z",
    "biotoolsCURIE": "biotools:WiPP",
    "biotoolsID": "WiPP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jennifer.Kirwan@mdc-berlin.de",
            "name": "Jennifer Kirwan",
            "orcidid": "https://orcid.org/0000-0002-5423-1651",
            "typeEntity": "Person"
        }
    ],
    "description": "Workflow for Improved Peak Picking for Gas Chromatography-Mass Spectrometry (GC-MS) Data | large scale GC-MS data preprocessing workflow | WiPP - A Workflow for improved Peak Picking - Quick Start Guide | WiPP is an open source large scale GC-MS data preprocessing workflow built in Python 3 that uses machine learning to optimise, automate and combine the peak detection process of commonly used peak picking algorithms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bihealth/WiPP",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2021-01-03T16:37:17Z",
    "license": "MIT",
    "name": "WiPP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/METABO9090171",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Lack of reliable peak detection impedes automated analysis of large-scale gas chromatography-mass spectrometry (GC-MS) metabolomics datasets. Performance and outcome of individual peak-picking algorithms can differ widely depending on both algorithmic approach and parameters, as well as data acquisition method. Therefore, comparing and contrasting between algorithms is difficult. Here we present a workflow for improved peak picking (WiPP), a parameter optimising, multi-algorithm peak detection for GC-MS metabolomics. WiPP evaluates the quality of detected peaks using a machine learning-based classification scheme based on seven peak classes. The quality information returned by the classifier for each individual peak is merged with results from different peak detection algorithms to create one final high-quality peak set for immediate down-stream analysis. Medium- and low-quality peaks are kept for further inspection. By applyingWiPP to standard compound mixes and a complex biological dataset, we demonstrate that peak detection is improved through the novel way to assign peak quality, an automated parameter optimisation, and results in integration across different embedded peak picking algorithms. Furthermore, our approach can provide an impartial performance comparison of different peak picking algorithms. WiPP is freely available on GitHub (https://github.com/bihealth/WiPP) under MIT licence.",
                "authors": [
                    {
                        "name": "Borgsmuller N."
                    },
                    {
                        "name": "Gloaguen Y."
                    },
                    {
                        "name": "Opialla T."
                    },
                    {
                        "name": "Blanc E."
                    },
                    {
                        "name": "Sicard E."
                    },
                    {
                        "name": "Royer A.-L."
                    },
                    {
                        "name": "Le Bizec B."
                    },
                    {
                        "name": "Durand S."
                    },
                    {
                        "name": "Migne C."
                    },
                    {
                        "name": "Petera M."
                    },
                    {
                        "name": "Pujos-Guillot E."
                    },
                    {
                        "name": "Giacomoni F."
                    },
                    {
                        "name": "Guitton Y."
                    },
                    {
                        "name": "Beule D."
                    },
                    {
                        "name": "Kirwan J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "WiPP: Workflow for improved peak picking for gas chromatography-mass spectrometry (GC-MS) data"
            },
            "pmcid": "PMC6780109",
            "pmid": "31438611"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}