{
    "name": "CLUMPAK", 
    "description": "Clustering Markov Packager Across K- was developed in order to aid users analyse the results of STRUCTURE-like programs. The main pipeline offers a full pipeline for the summation and graphical representation of the results previously obtained by the user using a STRUCTURE-like program.", 
    "homepage": "http://clumpak.tau.ac.il/", 
    "biotoolsID": "clumpak", 
    "biotoolsCURIE": "biotools:clumpak", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3197", 
                    "term": "Genetic variation analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3056", 
            "term": "Population genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Perl"
    ], 
    "license": "Unlicensed", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://clumpak.tau.ac.il/help.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1111/1755-0998.12387", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Clumpak: A program for identifying clustering modes and packaging population structure inferences across K", 
                "abstract": "© 2015 John Wiley & Sons Ltd.The identification of the genetic structure of populations from multilocus genotype data has become a central component of modern population-genetic data analysis. Application of model-based clustering programs often entails a number of steps, in which the user considers different modelling assumptions, compares results across different predetermined values of the number of assumed clusters (a parameter typically denoted K), examines multiple independent runs for each fixed value of K, and distinguishes among runs belonging to substantially distinct clustering solutions. Here, we present Clumpak (Cluster Markov Packager Across K), a method that automates the postprocessing of results of model-based population structure analyses. For analysing multiple independent runs at a single K value, Clumpak identifies sets of highly similar runs, separating distinct groups of runs that represent distinct modes in the space of possible solutions. This procedure, which generates a consensus solution for each distinct mode, is performed by the use of a Markov clustering algorithm that relies on a similarity matrix between replicate runs, as computed by the software Clumpp. Next, Clumpak identifies an optimal alignment of inferred clusters across different values of K, extending a similar approach implemented for a fixed K in Clumpp and simplifying the comparison of clustering results across different K values. Clumpak incorporates additional features, such as implementations of methods for choosing K and comparing solutions obtained by different programs, models, or data subsets. Clumpak, available at http://clumpak.tau.ac.il, simplifies the use of model-based analyses of population structure in population genetics and molecular ecology.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 489, 
                "authors": [
                    {
                        "name": "Kopelman N.M."
                    }, 
                    {
                        "name": "Mayzel J."
                    }, 
                    {
                        "name": "Jakobsson M."
                    }, 
                    {
                        "name": "Rosenberg N.A."
                    }, 
                    {
                        "name": "Mayrose I."
                    }
                ], 
                "journal": "Molecular Ecology Resources"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "evolseq@post.tau.ac.il", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "vzn529@binf.ku.dk", 
    "additionDate": "2017-08-20T15:20:59Z", 
    "lastUpdate": "2019-01-29T11:58:56Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}