{
    "additionDate": "2021-10-04T08:48:56.987457Z",
    "biotoolsCURIE": "biotools:jedi-md",
    "biotoolsID": "jedi-md",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Charles.David@plantandfood.co.nz",
            "name": "Charles C. David",
            "orcidid": "https://orcid.org/0000-0003-1206-3028",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "JEDi (Java Essential Dynamics Inspector) is a powerful tool for inspecting the dynamics of proteins from trajectories derived from MD or Geometric simulation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/charlesdavid/JEDi",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-10-04T08:48:56.989920Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/charlesdavid/JEDi/issues"
        }
    ],
    "name": "JEDi",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04140-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Principal component analysis (PCA) is commonly applied to the atomic trajectories of biopolymers to extract essential dynamics that describe biologically relevant motions. Although application of PCA is straightforward, specialized software to facilitate workflows and analysis of molecular dynamics simulation data to fully harness the power of PCA is lacking. The Java Essential Dynamics inspector (JEDi) software is a major upgrade from the previous JED software. Results: Employing multi-threading, JEDi features a user-friendly interface to control rapid workflows for interrogating conformational motions of biopolymers at various spatial resolutions and within subregions, including multiple chain proteins. JEDi has options for Cartesian-based coordinates (cPCA) and internal distance pair coordinates (dpPCA) to construct covariance (Q), correlation (R), and partial correlation (P) matrices. Shrinkage and outlier thresholding are implemented for the accurate estimation of covariance. The effect of rare events is quantified using outlier and inlier filters. Applying sparsity thresholds in statistical models identifies latent correlated motions. Within a hierarchical approach, small-scale atomic motion is first calculated with a separate local cPCA calculation per residue to obtain eigenresidues. Then PCA on the eigenresidues yields rapid and accurate description of large-scale motions. Local cPCA on all residue pairs creates a map of all residue-residue dynamical couplings. Additionally, kernel PCA is implemented. JEDi output gives high quality PNG images by default, with options for text files that include aligned coordinates, several metrics that quantify mobility, PCA modes with their eigenvalues, and displacement vector projections onto the top principal modes. JEDi provides PyMol scripts together with PDB files to visualize individual cPCA modes and the essential dynamics occurring within user-selected time scales. Subspace comparisons performed on the most relevant eigenvectors using several statistical metrics quantify similarity/overlap of high dimensional vector spaces. Free energy landscapes are available for both cPCA and dpPCA. Conclusion: JEDi is a convenient toolkit that applies best practices in multivariate statistics for comparative studies on the essential dynamics of similar biopolymers. JEDi helps identify functional mechanisms through many integrated tools and visual aids for inspecting and quantifying similarity/differences in mobility and dynamic correlations.",
                "authors": [
                    {
                        "name": "David C.C."
                    },
                    {
                        "name": "Avery C.S."
                    },
                    {
                        "name": "Jacobs D.J."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "JEDi: java essential dynamics inspector — a molecular trajectory analysis toolkit"
            },
            "pmcid": "PMC8088583",
            "pmid": "33932974",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}