{
    "additionDate": "2022-04-28T13:37:54.207179Z",
    "biotoolsCURIE": "biotools:cellcollective",
    "biotoolsID": "cellcollective",
    "description": "The Cell Collective is a platform that allows the world-wide scientific community to create these models collectively. Its interface enables users to build and use models without specifying any mathematical equations or computer code - addressing one of the major hurdles with computational research. In addition, this platform allows scientists to simulate and analyze the models in real-time on the web, including the ability to simulate loss/gain of function and test what-if scenarios in real time.",
    "download": [
        {
            "type": "Biological data",
            "url": "https://research.cellcollective.org/?dashboard=true#"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Simulation",
                        "uri": "http://edamontology.org/data_3869"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://cellcollective.org/",
    "lastUpdate": "2024-11-24T15:19:37.467832Z",
    "name": "CellCollective",
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1186/1752-0509-6-96",
            "metadata": {
                "abstract": "Background: Despite decades of new discoveries in biomedical research, the overwhelming complexity of cells has been a significant barrier to a fundamental understanding of how cells work as a whole. As such, the holistic study of biochemical pathways requires computer modeling. Due to the complexity of cells, it is not feasible for one person or group to model the cell in its entirety.Results: The Cell Collective is a platform that allows the world-wide scientific community to create these models collectively. Its interface enables users to build and use models without specifying any mathematical equations or computer code - addressing one of the major hurdles with computational research. In addition, this platform allows scientists to simulate and analyze the models in real-time on the web, including the ability to simulate loss/gain of function and test what-if scenarios in real time.Conclusions: The Cell Collective is a web-based platform that enables laboratory scientists from across the globe to collaboratively build large-scale models of various biological processes, and simulate/analyze them in real time. In this manuscript, we show examples of its application to a large-scale model of signal transduction. © 2012 Helikar et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bruckner M."
                    },
                    {
                        "name": "Helikar T."
                    },
                    {
                        "name": "Kowal B."
                    },
                    {
                        "name": "Limbu K."
                    },
                    {
                        "name": "Madrahimov A."
                    },
                    {
                        "name": "McClenathan S."
                    },
                    {
                        "name": "Rogers J.A."
                    },
                    {
                        "name": "Rowley T."
                    },
                    {
                        "name": "Shrestha M."
                    },
                    {
                        "name": "Wicks B."
                    }
                ],
                "citationCount": 164,
                "date": "2012-08-07T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "The Cell Collective: Toward an open and collaborative approach to systems biology"
            },
            "pmcid": "PMC3443426",
            "pmid": "22871178"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}
