{
    "additionDate": "2024-01-12T08:52:57.969638Z",
    "biotoolsCURIE": "biotools:appindels",
    "biotoolsID": "appindels",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gupta@mcmaster.ca",
            "name": "Radhey S. Gupta",
            "orcidid": "https://orcid.org/0000-0001-7034-4018"
        }
    ],
    "description": "Web-based tool for the identification of known taxon-specific conserved signature indels in genome sequences.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://AppIndels.com",
    "lastUpdate": "2024-01-12T08:52:57.972251Z",
    "name": "AppIndels",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1099/IJSEM.0.005844",
            "metadata": {
                "abstract": "Taxon-specific conserved signature indels (CSIs) in genes/proteins provide reliable molecular markers (synapomorphies) for unambiguous demarcation of taxa of different ranks in molecular terms and for genetic, biochemical and diagnostic studies. Because of their predictive abilities, the shared presence of known taxon-specific CSIs in genome sequences has proven useful for taxonomic purposes. However, the lack of a convenient method for identifying the presence of known CSIs in genome sequences has limited their utility for taxonomic and other studies. We describe here a web-based tool/server (AppIndels.com) that identifies the presence of known and validated CSIs in genome sequences and uses this information for predicting taxonomic affiliation. The utility of this server was tested by using a database of 585 validated CSIs, which included 350 CSIs specific for ≈45 Bacillales genera, with the remaining CSIs being specific for members of the orders Neisseriales, Legionellales and Chlo-robiales, family Borreliaceae, and some Pseudomonadaceae species/genera. Using this server, genome sequences were ana-lysed for 721 Bacillus strains of unknown taxonomic affiliation. Results obtained showed that 651 of these genomes contained significant numbers of CSIs specific for the following Bacillales genera/families: Alkalicoccus, ‘Alkalihalobacillaceae’, Alteribacter, Bacillus Cereus clade, Bacillus Subtilis clade, Caldalkalibacillus, Caldibacillus, Cytobacillus, Ferdinandcohnia, Gottfriedia, Heyn-drickxia, Lederbergia, Litchfieldia, Margalitia, Mesobacillus, Metabacillus, Neobacillus, Niallia, Peribacillus, Priestia, Pseudalkalibacil-lus, Robertmurraya, Rossellomorea, Schinkia, Siminovitchia, Sporosarcina, Sutcliffiella, Weizmannia and Caryophanaceae. Validity of the taxon assignment made by the server was examined by reconstructing phylogenomic trees. In these trees, all Bacillus strains for which taxonomic predictions were made correctly branched with the indicated taxa. The unassigned strains likely correspond to taxa for which CSIs are lacking in our database. Results presented here show that the AppIndels server provides a useful new tool for predicting taxonomic affiliation based on shared presence of the taxon-specific CSIs. Some caveats in using this server are discussed.",
                "authors": [
                    {
                        "name": "Gupta R.S."
                    },
                    {
                        "name": "Kanter-Eivin D.A."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "International Journal of Systematic and Evolutionary Microbiology",
                "title": "AppIndels.com server: a web-based tool for the identification of known taxon-specific conserved signature indels in genome sequences. Validation of its usefulness by predicting the taxonomic affiliation of >700 unclassified strains of Bacillus species"
            },
            "pmid": "37159410",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ]
}
