{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www2.ouc.edu.cn/mollusk/about.asp"}],"documentation":[{"type":"GENERAL","url":"http://www2.ouc.edu.cn/mollusk/detailen.asp?id=727"}],"function":[{"operation":[{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]},{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Genotyping experiment","uri":"http://edamontology.org/topic_3516"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/radtyping-1-3-0-de-novo-rad-genotyping-in-mapping-populations.html"}],"publication":[{"abstract":"Genetic linkage maps are indispensable tools in genetic, genomic and breeding studies. As one of genotyping-by-sequencing methods, RAD-Seq (restriction-site associated DNA sequencing) has gained particular popularity for construction of high-density linkage maps. Current RAD analytical tools are being predominantly used for typing codominant markers. However, no genotyping algorithm has been developed for dominant markers (resulting from recognition site disruption). Given their abundance in eukaryotic genomes, utilization of dominant markers would greatly diminish the extensive sequencing effort required for large-scale marker development. In this study, we established, for the first time, a novel statistical framework for de novo dominant genotyping in mapping populations. An integrated package called RADtyping was developed by incorporating both de novo codominant and dominant genotyping algorithms. We demonstrated the superb performance of RADtyping in achieving remarkably high genotyping accuracy based on simulated and real mapping datasets. The RADtyping package is freely available at http://www2.ouc.edu.cn/mollusk/detailen.asp?id= 727. © 2013 Fu et al.","authors":["Fu X.","Dou J.","Mao J.","Su H.","Jiao W.","Zhang L.","Hu X.","Huang X.","Wang S.","Bao Z."],"cit_count":30,"doi":"10.1371/journal.pone.0079960","journal":"PLoS ONE","title":"RADtyping: An integrated package for accurate de novo codominant and dominant RAD genotyping in mapping populations","type":"Primary","year":"2013-11-21"},{"abstract":"Genetic linkage maps are indispensable tools in genetic and genomic studies. Recent development of genotyping-by-sequencing (GBS) methods holds great promise for constructing high-resolution linkage maps in organisms lacking extensive genomic resources. In the present study, linkage mapping was conducted for a bivalve mollusc (Chlamys farreri) using a newly developed GBS method-2b-restriction site-associated DNA (2b-RAD). Genome survey sequencing was performed to generate a preliminary reference genome that was utilized to facilitate linkage and quantitative trait locus (QTL) mapping in C. farreri. A high-resolution linkage map was constructed with a marker density (3806) that has, to our knowledge, never been achieved in any other molluscs. The linkage map covered nearly the whole genome (99.5%) with a resolution of 0.41 cM. QTL mapping and association analysis congruously revealed two growth-related QTLs and one potential sex-determination region. An important candidate QTL gene named PROP1, which functions in the regulation of growth hormone production in vertebrates, was identified from the growth-related QTL region detected on the linkage group LG3. We demonstrate that this linkage map can serve as an important platform for improving genome assembly and unifying multiple genomic resources. Our study, therefore, exemplifies how to build up an integrative genomic framework in a non-model organism. © 2013 The Author.","authors":["Jiao W.","Fu X.","Dou J.","Li H.","Su H.","Mao J.","Yu Q.","Zhang L.","Hu X.","Huang X.","Wang Y.","Wang S.","Bao Z."],"cit_count":63,"doi":"10.1093/dnares/dst043","journal":"DNA Research","title":"High-resolution linkage and quantitative trait locus mapping aided by genome survey sequencing: Building up an integrative genomic framework for a bivalve mollusc","year":"2014-02-01"}],"summary":{"biotoolsCURIE":"biotools:radtyping","biotoolsID":"radtyping","description":"User-defined perl procedure for performing de novo RAD genotyping in mapping populations. It can deal with both single-end and paired-end RAD sequencing data.","homepage":"http://www2.ouc.edu.cn/mollusk/detailen.asp?id=727","name":"RADtyping","version":["1.3.0"]}}