{
    "accessibility": "Open access",
    "additionDate": "2023-02-08T00:36:32.232430Z",
    "biotoolsCURIE": "biotools:metagt",
    "biotoolsID": "metagt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "andrewprzh@gmail.com",
            "name": "Andrey D. Prjibelski",
            "typeEntity": "Person"
        },
        {
            "name": "Daria Shafranskaya"
        },
        {
            "name": "Rob Finn"
        },
        {
            "name": "Varsha Kale"
        }
    ],
    "description": "metaGT is a bioinformatics analysis pipeline used for improving and quantification metatranscriptome assembly using metagenome data. The pipeline supports Illumina sequencing data and complete metagenome and metatranscriptome assemblies. The pipeline involves the alignment of metatranscriprome assembly to the metagenome assembly with further extracting CDSs, which are covered by transcripts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ablab/metaGT",
    "language": [
        "Groovy",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:04:53.710726Z",
    "license": "MIT",
    "name": "MetaGT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fmicb.2022.981458",
            "metadata": {
                "abstract": "While metagenome sequencing may provide insights on the genome sequences and composition of microbial communities, metatranscriptome analysis can be useful for studying the functional activity of a microbiome. RNA-Seq data provides the possibility to determine active genes in the community and how their expression levels depend on external conditions. Although the field of metatranscriptomics is relatively young, the number of projects related to metatranscriptome analysis increases every year and the scope of its applications expands. However, there are several problems that complicate metatranscriptome analysis: complexity of microbial communities, wide dynamic range of transcriptome expression and importantly, the lack of high-quality computational methods for assembling meta-RNA sequencing data. These factors deteriorate the contiguity and completeness of metatranscriptome assemblies, therefore affecting further downstream analysis. Here we present MetaGT, a pipeline for de novo assembly of metatranscriptomes, which is based on the idea of combining both metatranscriptomic and metagenomic data sequenced from the same sample. MetaGT assembles metatranscriptomic contigs and fills in missing regions based on their alignments to metagenome assembly. This approach allows to overcome described complexities and obtain complete RNA sequences, and additionally estimate their abundances. Using various publicly available real and simulated datasets, we demonstrate that MetaGT yields significant improvement in coverage and completeness of metatranscriptome assemblies compared to existing methods that do not exploit metagenomic data. The pipeline is implemented in NextFlow and is freely available from https://github.com/ablab/metaGT.",
                "authors": [
                    {
                        "name": "Finn R."
                    },
                    {
                        "name": "Kale V."
                    },
                    {
                        "name": "Korobeynikov A."
                    },
                    {
                        "name": "Lapidus A.L."
                    },
                    {
                        "name": "Prjibelski A.D."
                    },
                    {
                        "name": "Shafranskaya D."
                    }
                ],
                "citationCount": 4,
                "date": "2022-10-28T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "MetaGT: A pipeline for de novo assembly of metatranscriptomes with the aid of metagenomic data"
            },
            "pmcid": "PMC9651917",
            "pmid": "36386613"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
