{
    "additionDate": "2021-01-18T10:24:52Z",
    "biotoolsCURIE": "biotools:spfa",
    "biotoolsID": "spfa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "whitecf@seu.edu.cn",
            "name": "Yunfei Bai",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying disease-associated signaling pathways through a novel effector gene analysis.\n\nSignaling pathway analysis methods are commonly used to explain biological behaviors of disease cells. Effector genes typically decide functional attributes (associated with biological behaviors of disease cells) by abnormal signals they received. The signals that the effector genes receive can be quite different in normal vs. disease conditions. However, most of current signaling pathway analysis methods do not take these signal variations into consideration. Methods:In this study, we developed a novel signaling pathway analysis method called signaling pathway functional attributes analysis (SPFA) method. This method analyzes the signal variations that effector genes received between two conditions (normal and disease) in different signaling pathways",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ZhenshenBao/SPFA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-21T13:46:25Z",
    "license": "MIT",
    "name": "SPFA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.7717/PEERJ.9695",
            "metadata": {
                "abstract": "© 2020 Bao et al.Background: Signaling pathway analysis methods are commonly used to explain biological behaviors of disease cells. Effector genes typically decide functional attributes (associated with biological behaviors of disease cells) by abnormal signals they received. The signals that the effector genes receive can be quite different in normal vs. disease conditions. However, most of current signaling pathway analysis methods do not take these signal variations into consideration. Methods: In this study, we developed a novel signaling pathway analysis method called signaling pathway functional attributes analysis (SPFA) method. This method analyzes the signal variations that effector genes received between two conditions (normal and disease) in different signaling pathways. Results: We compared the SPFA method to seven other methods across 33 Gene Expression Omnibus datasets using three measurements: the median rank of target pathways, the median p-value of target pathways, and the percentages of significant pathways. The results confirmed that SPFA was the top-ranking method in terms of median rank of target pathways and the fourth best method in terms of median p-value of target pathways. SPFA's percentage of significant pathways was modest, indicating a good false positive rate and false negative rate. Overall, SPFA was comparable to the other methods. Our results also suggested that the signal variations calculated by SPFA could help identify abnormal functional attributes and parts of pathways. The SPFA R code and functions can be accessed at https://github.com/ZhenshenBao/SPFA.",
                "authors": [
                    {
                        "name": "Bao Z."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Ge Q."
                    },
                    {
                        "name": "Gu W."
                    },
                    {
                        "name": "Bai Y."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Identifying disease-associated signaling pathways through a novel effector gene analysis"
            },
            "pmcid": "PMC7430270",
            "pmid": "32864216"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}