{
    "additionDate": "2018-06-01T16:33:47Z",
    "biotoolsCURIE": "biotools:tisan",
    "biotoolsID": "tisan",
    "credit": [
        {
            "email": "Jacob-Michaelson@uiowa.edu",
            "name": "Jacob J Michaelson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Estimating tissue-specific effects of coding and non-coding variants.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/kevinVervier/TiSAn"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation annotation",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kevinVervier/TiSAn",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:36:48.786277Z",
    "name": "TiSAn",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty301",
            "metadata": {
                "abstract": "Motivation: Model-based estimates of general deleteriousness, like CADD, DANN or PolyPhen, have become indispensable tools in the interpretation of genetic variants. However, these approaches say little about the tissues in which the effects of deleterious variants will be most meaningful. Tissue-specific annotations have been recently inferred for dozens of tissues/cell types from large collections of cross-tissue epigenomic data, and have demonstrated sensitivity in predicting affected tissues in complex traits. It remains unclear, however, whether including additional genome-scale data specific to the tissue of interest would appreciably improve functional annotations. Results: Herein, we introduce TiSAn, a tool that integrates multiple genome-scale data sources, defined by expert knowledge. TiSAn uses machine learning to discriminate variants relevant to a tissue from those with no bearing on the function of that tissue. Predictions are made genome-wide, and can be used to contextualize and filter variants of interest in whole genome sequencing or genome-wide association studies. We demonstrate the accuracy and flexibility of TiSAn by producing predictive models for human heart and brain, and detecting tissue-relevant variations in large cohorts for autism spectrum disorder (TiSAn-brain) and coronary artery disease (TiSAn-heart). We find the multiomics TiSAn model is better able to prioritize genetic variants according to their tissue-specific action than the current state-of-the-art method, GenoSkyLine.",
                "authors": [
                    {
                        "name": "Michaelson J.J."
                    },
                    {
                        "name": "Vervier K."
                    }
                ],
                "citationCount": 5,
                "date": "2018-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TiSAn: Estimating tissue-specific effects of coding and non-coding variants"
            },
            "pmcid": "PMC6137979",
            "pmid": "29912365"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ],
    "validated": 1
}
