{
    "accessibility": [],
    "additionDate": "2017-02-07T13:52:13Z",
    "biotoolsCURIE": "biotools:bioverse",
    "biotoolsID": "bioverse",
    "collectionID": [
        "Proteomics"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [],
    "description": "System that uses computational techniques to facilitate exploring the relationships between molecular, genomic, proteomic, systems and organismal information.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Molecular replacement",
                    "uri": "http://edamontology.org/operation_3455"
                },
                {
                    "term": "Relation inference",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://bioverse.compbio.washington.edu/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2019-03-26T08:12:34Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Bioverse",
    "operatingSystem": [],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Functional annotation is routinely performed for large-scale genomics projects and databases. Researchers working on more specific problems, for instance on an individual pathway or complex, also need to be able to quickly, completely and accurately annotate sequences. The Bioverse sequence annotation server (http://bioverse.compbio.washington.edu) provides a web-based interface to allow users to submit protein sequences to the Bioverse framework. Sequences are functionally and structurally annotated and potential contextual annotations are provided. Researchers can also submit candidate genomes for annotation of all proteins encoded by the genome (proteome).",
                "authors": [
                    {
                        "name": "McDermott J."
                    },
                    {
                        "name": "Samudrala R."
                    }
                ],
                "citationCount": 19,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Bioverse: Functional, structural and contextual annotation of proteins and proteomes"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12824406",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Motivation: Progress in large-scale experimental determination of protein-protein interaction networks for several organisms has resulted in innovative methods of functional inference based on network connectivity. However, the amount of effort and resources required for the elucidation of experimental protein interaction networks is prohibitive. Previously we, and others, have developed techniques to predict protein interactions for novel genomes using computational methods and data generated from other genomes. Results: We evaluated the performance of a network-based functional annotation method that makes use of our predicted protein interaction networks. We show that this approach performs equally well on experimentally derived and predicted interaction networks, for both manually and computationally assigned annotations. We applied the method to predicted protein interaction networks for over 50 organisms from all domains of life, providing annotations for many previously unannotated proteins and verifying existing low-confidence annotations. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "McDermott J."
                    },
                    {
                        "name": "Bumgarner R."
                    },
                    {
                        "name": "Samudrala R."
                    }
                ],
                "citationCount": 41,
                "date": "2005-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Functional annotation from predicted protein interaction networks"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15919725",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "We have made a number of enhancements to the previously described Bioverse web server and computational biology framework (http:// bioverse.compbio.washington.edu). In this update, we provide an overview of the new features available that include: (i) expansion of the number of organisms represented in the Bioverse and addition of new data sources and novel prediction techniques not available elsewhere, including network-based annotation; (ii) reengineering the database backend and supporting code resulting in significant speed, search and ease-of use improvements; and (iii) creation of a stateful and dynamic web application frontend to improve interface speed and usability. Integrated Java-based applications also allow dynamic visualization of real and predicted protein interaction networks. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "McDermott J."
                    },
                    {
                        "name": "Guerquin M."
                    },
                    {
                        "name": "Frazier Z."
                    },
                    {
                        "name": "Chang A.N."
                    },
                    {
                        "name": "Samudrala R."
                    }
                ],
                "citationCount": 14,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BIOVERSE: Enhancements to the framework for structural, functional and contextual modeling of proteins and proteomes"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15980482",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Experimentally derived genome-wide protein interaction networks have been useful in the elucidation of functional information that is not evident from examining individual proteins but determination of these networks is complex and time consuming. To address this problem, several computational methods for predicting protein networks in novel genomes have been developed. A recent publication by Date and Marcotte describes the use of phylogenetic profiling for elucidating novel pathways in proteomes that have not been experimentally characterized. This method, in combination with other computational methods for generating protein-interaction networks, might help identify novel functional pathways and enhance functional annotation of individual proteins.",
                "authors": [
                    {
                        "name": "McDermott J."
                    },
                    {
                        "name": "Samudrala R."
                    },
                    {
                        "name": "Date S.V."
                    },
                    {
                        "name": "Marcotte E.M."
                    }
                ],
                "citationCount": 18,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Trends in Biotechnology",
                "title": "Enhanced functional information from predicted protein networks"
            },
            "note": null,
            "pmcid": null,
            "pmid": "14757037",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 0,
    "version": []
}