{"credit":[{"email":"dwhong@ncc.re.kr","name":"D. Hong","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://tiara.gmi.ac.kr/document"}],"function":[{"operation":[{"term":"Genome comparison","uri":"http://edamontology.org/operation_3209"},{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"},{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"},{"term":"Structural variation detection","uri":"http://edamontology.org/operation_3228"}]}],"labels":{"language":["JavaScript"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"DNA structural variation","uri":"http://edamontology.org/topic_3175"}]},"publication":[{"abstract":"High-throughput genomic technologies have been used to explore personal human genomes for the past few years. Although the integration of technologies is important for high-accuracy detection of personal genomic variations, no databases have been prepared to systematically archive genomes and to facilitate the comparison ofpersonal genomic data sets prepared using a variety of experimental platforms. We describe here the Total Integrated Archive of Short-Read and Array (TIARA; http://tiara.gmi.ac.kr) database, which contains personal genomic information obtained from next generation sequencing (NGS) techniques and ultra-high-resolution comparative genomic hybridization (CGH) arrays. This database improves the accuracy of detecting personal genomic variations, such as SNPs, short indels and structural variants (SVs). At present, 36 individual genomes have been archived and may be displayed in the database. TIARA supports a user-friendly genome browser, which retrieves read-depths (RDs) and log2 ratios from NGS and CGH arrays, respectively. In addition, this database provides information on all genomic variants and the raw data, including short reads and feature-level CGH data, through anonymous file transfer protocol. More personal genomes will be archived as more individuals are analyzed by NGS or CGH array. TIARA provides a new approach to the accurate interpretation of personal genomes for genome research. © The Author(s) 2010.","authors":["Hong D.","Park S.-S.","Ju Y.S.","Kim S.","Shin J.-Y.","Kim S.","Yu S.-B.","Lee W.-C.","Lee S.","Park H.","Kim J.-I.","Seo J.-S."],"cit_count":15,"journal":"Nucleic Acids Research","pmid":"21051338","title":"TIARA: A database for accurate analysis of multiple personal genomes based on cross-technology","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:tiara","biotoolsID":"tiara","description":"Total Integrated Archive of Short-Read and Array (TIARA) database, contains personal genomic information obtained from next generation sequencing (NGS) techniques and ultra-high-resolution comparative genomic hybridization (CGH) arrays. This database improves the accuracy of detecting personal genomic variations, such as SNPs, short indels and structural variants (SVs).","homepage":"http://tiara.gmi.ac.kr","name":"TIARA"}}