
{
    "credit": [
        {
            "email": "info@gchelpdesk.ualberta.ca",
            "name": "MovieMaker Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://wishart.biology.ualberta.ca/moviemaker/gallery/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Protein folding, stability and design",
                "uri": "http://edamontology.org/topic_0130"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            }
        ]
    },
    "publication": [
        {
            "abstract": "MovieMaker is a web server that allows short (∼10 s), downloadable movies of protein motions to be generated. It accepts PDB files or PDB accession numbers as input and automatically calculates, renders and merges the necessary image files to create colourful animations covering a wide range of protein motions and other dynamic processes. Users have the option of animating (i) simple rotation, (ii) morphing between two end-state conformers, (iii) short-scale, picosecond vibrations, (iv) ligand docking, (v) protein oligomerization, (vi) mid-scale nanosecond (ensemble) motions and (vii) protein folding/unfolding. MovieMaker does not perform molecular dynamics calculations. Instead it is an animation tool that uses a sophisticated superpositioning algorithm in conjunction with Cartesian coordinate interpolation to rapidly and automatically calculate the intermediate structures needed for many of its animations. Users have extensive control over the rendering style, structure colour, animation quality, background and other image features. MovieMaker is intended to be a general-purpose server that allows both experts and non-experts to easily generate useful, informative protein animations for educational and illustrative purposes. MovieMaker is accessible at http://wishart.biology.ualberta.ca/moviemaker. © 2005 Oxford University Press.",
            "authors": [
                "Maiti R.",
                "Van Domselaar G.H.",
                "Wishart D.S."
            ],
            "cit_count": 17,
            "journal": "Nucleic Acids Research",
            "pmid": "15980488",
            "title": "MovieMaker: A web server for rapid rendering of protein motions and interactions",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:moviemaker",
        "biotoolsID": "moviemaker",
        "description": "MovieMaker is a web server that accepts PDB files or PDB accession numbers as input and allows short (~10 sec) downloadable movies to be generated of protein motions and interactions.",
        "homepage": "http://wishart.biology.ualberta.ca/moviemaker/",
        "name": "MovieMaker"
    }
}