{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://charite.github.io/team_hansen.html"}],"documentation":[{"type":"GENERAL","url":"http://charite.github.io/Q/tutorial.html"}],"function":[{"operation":[{"term":"Peak detection","uri":"http://edamontology.org/operation_3215"}]}],"labels":{"collectionID":["Animal and Crop Genomics"],"language":["C++"],"license":"BSD-3-Clause","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"},{"term":"DNA packaging","uri":"http://edamontology.org/topic_3176"}]},"publication":[{"abstract":"© 2015 Hansen et al.Chromatin immunoprecipitation coupled with next-generation sequencing (ChIP-seq) is a powerful technology to identify the genome-wide locations of transcription factors and other DNA binding proteins. Computational ChIP-seq peak calling infers the location of protein-DNA interactions based on various measures of enrichment of sequence reads. In this work, we introduce an algorithm, Q, that uses an assessment of the quadratic enrichment of reads to center candidate peaks followed by statistical analysis of saturation of candidate peaks by 5′ ends of reads. We show that our method not only is substantially faster than several competing methods but also demonstrates statistically significant advantages with respect to reproducibility of results and in its ability to identify peaks with reproducible binding site motifs. We show that Q has superior performance in the delineation of double RNAPII and H3K4me3 peaks surrounding transcription start sites related to a better ability to resolve individual peaks. The method is implemented in C++ and is freely available under an open source license.","authors":["Hansen P.","Hecht J.","Ibrahim D.M.","Krannich A.","Truss M.","Robinson P.N."],"cit_count":12,"doi":"10.1101/gr.189894.115","journal":"Genome Research","title":"Saturation analysis of ChIP-seq data for reproducible identification of binding peaks","type":"Primary","year":"2015-09-01"}],"summary":{"biotoolsCURIE":"biotools:q","biotoolsID":"q","description":"Saturation-based ChIP-seq and ChIP-nexus caller. Q works with the irreproducible discovery rate (IDR) procedure. Q can be run with or without data from a control experiment.","homepage":"http://charite.github.io/Q/","name":"Q"}}