{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://github.com/evoldoers/wtfgenes/issues"}],"function":[{"operation":[{"term":"Enrichment analysis","uri":"http://edamontology.org/operation_3501"}]}],"labels":{"language":["JavaScript","C++"],"license":"BSD-3-Clause","toolType":["Command-line tool","Web application"],"topic":[{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/evoldoers/wtfgenes"}],"publication":[{"abstract":"© 2017 Mungall CJ and Holmes IH. A common technique for interpreting experimentally-identified lists of genes is to look for enrichment of genes associated with particular ontology terms. The most common test uses the hypergeometric distribution; more recently, a model-based test was proposed. These approaches must typically be run using downloaded software, or on a server. We develop a collapsed likelihood for model-based gene set analysis and present WTFgenes, an implementation of both hypergeometric and model-based approaches, that can be published as a static site with computation run in JavaScript on the user's web browser client. Apart from hosting files, zero server resources are required: the site can (for example) be served directly from Amazon S3 or GitHub Pages. A C++11 implementation yielding identical results runs roughly twice as fast as the JavaScript version. WTFgenes is available from https://github.com/evoldoers/wtfgenes under the BSD3 license. A demonstration for the Gene Ontology is usable at https://evoldoers.github.io/wtfgo.","authors":["Mungall C.J.","Holmes I.H."],"cit_count":0,"doi":"10.12688/f1000research.11175.1","journal":"F1000Research","title":"WTFgenes: What's The Function of these genes? Static sites for model-based gene set analysis","type":"Primary","year":"2017-01-01"}],"summary":{"biotoolsCURIE":"biotools:wtfgenes","biotoolsID":"wtfgenes","description":"Enrichment of genes associated with particular ontology terms. Implementation of both hypergeometric and model-based approaches, that can be published as a static site with computation run in JavaScript on the user's web browser client.","homepage":"https://evoldoers.github.io/wtfgo/web/index.html","name":"WTFgenes"}}