{
    "additionDate": "2018-07-25T16:15:13Z",
    "biotoolsCURIE": "biotools:coremic",
    "biotoolsID": "coremic",
    "credit": [
        {
            "email": "markwill@vt.edu",
            "name": "Mark A. Williams",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "richrr@vt.edu",
            "name": "Richard R. Rodrigue",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Search for a niche associated CORE MICrobiome.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://core-mic.com/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://core-mic.com/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "COREMIC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.7717/peerj.4395",
            "metadata": {
                "abstract": "© 2018 Rodrigues et al.Microbial diversity on earth is extraordinary, and soils alone harbor thousands of species per gram of soil. Understanding how this diversity is sorted and selected into habitat niches is a major focus of ecology and biotechnology, but remains only vaguely understood. A systems-biology approach was used to mine information from databases to show how it can be used to answer questions related to the core microbiome of habitat-microbe relationships. By making use of the burgeoning growth of information from databases, our tool \"COREMIC\" meets a great need in the search for understanding niche partitioning and habitat-function relationships. The work is unique, furthermore, because it provides a user-friendly statistically robust web-tool (http://coremic2.appspot.com or http://core-mic.com), developed using Google App Engine, to help in the process of database mining to identify the \"core microbiome\" associated with a given habitat. A case study is presented using data from 31 switchgrass rhizosphere community habitats across a diverse set of soil and sampling environments. The methodology utilizes an outgroup of 28 non-switchgrass (other grasses and forbs) to identify a core switchgrass microbiome. Even across a diverse set of soils (five environments), and conservative statistical criteria (presence in more than 90% samples and FDR q-val < 0.05% for Fisher's exact test) a core set of bacteria associated with switchgrass was observed. These included, among others, closely related taxa from Lysobacter spp., Mesorhizobium spp, and Chitinophagaceae. These bacteria have been shown to have functions related to the production of bacterial and fungal antibiotics and plant growth promotion. COREMIC can be used as a hypothesis generating or confirmatory tool that shows great potential for identifying taxa that may be important to the functioning of a habitat (e.g. host plant). The case study, in conclusion, shows that COREMIC can identify key habitat-specific microbes across diverse samples, using currently available databases and a unique freely available software.",
                "authors": [
                    {
                        "name": "Rodrigues R.R."
                    },
                    {
                        "name": "Rodgers N.C."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Williams M.A."
                    }
                ],
                "citationCount": 7,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "COREMIC: A web-tool to search for a niche associated CORE MICrobiome"
            },
            "pmcid": "PMC5816963",
            "pmid": "29473009"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiome",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}