
{
    "credit": [
        {
            "email": "galaxy@pasteur.fr",
            "name": "Galaxy Support Team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bio-bwa.sourceforge.net/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "FASTQ-sanger",
                            "uri": "http://edamontology.org/format_1932"
                        },
                        {
                            "term": "FASTQ-illumina",
                            "uri": "http://edamontology.org/format_1931"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence trace",
                        "uri": "http://edamontology.org/data_0924"
                    },
                    "format": [
                        {
                            "term": "SAM",
                            "uri": "http://edamontology.org/format_2573"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "Institut Pasteur",
            "galaxyPasteur",
            "ptools",
            "BWA"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Human biology",
                "uri": "http://edamontology.org/topic_2815"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Galaxy service",
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/fmareuil/mbwa_map/mbwa_wrapper/0.7.4"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The enormous amount of short reads generated by the new DNA sequencing technologies call for the development of fast and accurate read alignment programs. A first generation of hash table-based methods has been developed, including MAQ, which is accurate, feature rich and fast enough to align short reads from a single individual. However, MAQ does not support gapped alignment for single-end reads, which makes it unsuitable for alignment of longer reads where indels may occur frequently. The speed of MAQ is also a concern when the alignment is scaled up to the resequencing of hundreds of individuals. Results: We implemented Burrows-Wheeler Alignment tool (BWA), a new read alignment package that is based on backward search with Burrows-Wheeler Transform (BWT), to efficiently align short sequencing reads against a large reference sequence such as the human genome, allowing mismatches and gaps. BWA supports both base space reads, e.g. from Illumina sequencing machines, and color space reads from AB SOLiD machines. Evaluations on both simulated and real data suggest that BWA is ∼10-20× faster than MAQ, while achieving similar accuracy. In addition, BWA outputs alignment in the new standard SAM (Sequence Alignment/Map) format. Variant calling and other downstream analyses after the alignment can be achieved with the open source SAMtools software package. © 2009 The Author(s).",
            "authors": [
                "Li H.",
                "Durbin R."
            ],
            "cit_count": 13546,
            "doi": "10.1093/bioinformatics/btp324",
            "journal": "Bioinformatics",
            "title": "Fast and accurate short read alignment with Burrows-Wheeler transform",
            "type": "Primary",
            "year": "2009-07-01"
        },
        {
            "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput data production technologies, particularly 'next-generation' DNA sequencing, have ushered in widespread and disruptive changes to biomedical research. Making sense of the large datasets produced by these technologies requires sophisticated statistical and computational methods, as well as substantial computational power. This has led to an acute crisis in life sciences, as researchers without informatics training attempt to perform computation-dependent analyses. Since 2005, the Galaxy project has worked to address this problem by providing a framework that makes advanced computational tools usable by non experts. Galaxy seeks to make data-intensive research more accessible, transparent and reproducible by providing a Web-based environment in which users can perform computational analyses and have all of the details automatically tracked for later inspection, publication, or reuse. In this report we highlight recently added features enabling biomedical analyses on a large scale.",
            "authors": [
                "Afgan E.",
                "Baker D.",
                "van den Beek M.",
                "Blankenberg D.",
                "Bouvier D.",
                "Cech M.",
                "Chilton J.",
                "Clements D.",
                "Coraor N.",
                "Eberhard C.",
                "Gruning B.",
                "Guerler A.",
                "Hillman-Jackson J.",
                "Von Kuster G.",
                "Rasche E.",
                "Soranzo N.",
                "Turaga N.",
                "Taylor J.",
                "Nekrutenko A.",
                "Goecks J."
            ],
            "cit_count": 608,
            "doi": "10.1093/nar/gkw343",
            "journal": "Nucleic acids research",
            "title": "The Galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2016 update",
            "type": "Other",
            "year": "2016-07-08"
        },
        {
            "doi": "10.7490/f1000research.1114334.1",
            "type": "Other"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mbwa_wrapper-ip",
        "biotoolsID": "mbwa_wrapper",
        "description": "Fast light-weighted tool that aligns relatively short sequences (queries) to a sequence database (large), such as the human reference genome.",
        "homepage": "https://bioweb.pasteur.fr/packages/pack@ptools@0.99d",
        "name": "mbwa_wrapper",
        "version": [
            "0.7.4"
        ]
    }
}