{
    "additionDate": "2021-11-01T13:43:44.083130Z",
    "biotoolsCURIE": "biotools:pgainsim",
    "biotoolsID": "pgainsim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pascal.schlosser@uniklinik-freiburg.de",
            "name": "Pascal Schlosser",
            "orcidid": "https://orcid.org/0000-0002-8460-0462",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "pgainsim is an R-package to assess the mode of inheritance for quantitative trait loci in GWAS. After performing genome-wide association studies under an additive, recessive and dominant model for a quantitative trait the pgainsim package allows to determine study specific critical values when one of the three models is more informative than the other ones for a quantitative trait locus. First, study specific p-gain values are simulated. Second, based on the simulated values quantiles of the empirical density of the p-gain are computed. Finally, the quantiles are exported or interpolated and the critical values are obtained.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/genepi-freiburg/pgainsim",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:17:00.701156Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/genepi-freiburg/pgainsim/issues"
        }
    ],
    "name": "pgainsim",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab150",
            "metadata": {
                "abstract": "Motivation: When performing genome-wide association studies conventionally the additive genetic model is used to explore whether a single nucleotide polymorphism (SNP) is associated with a quantitative trait. But for variants, which do not follow an intermediate mode of inheritance (MOI), the recessive or the dominant genetic model can have more power to detect associations and furthermore the MOI is important for downstream analyses and clinical interpretation. When multiple MOIs are modelled the question arises, which describes the true underlying MOI best. Results: We developed an R-package allowing for the first time to determine study specific critical values when one of the three models is more informative than the other ones for a quantitative trait locus. The package allows for user-friendly simulations to determine these critical values with predefined minor allele frequencies and study sizes. For application scenarios with extensive multiple testing we integrated an interpolation functionality to determine critical values already based on a moderate number of random draws.",
                "authors": [
                    {
                        "name": "Pfaffelhuber P."
                    },
                    {
                        "name": "Scherer N."
                    },
                    {
                        "name": "Schlosser P."
                    },
                    {
                        "name": "Sekula P."
                    }
                ],
                "date": "2021-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "pgainsim: an R-package to assess the mode of inheritance for quantitative trait loci in GWAS"
            },
            "pmcid": "PMC8479659",
            "pmid": "33738486",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ]
}
