{
    "additionDate": "2017-08-03T19:04:25Z",
    "biotoolsCURIE": "biotools:wattos",
    "biotoolsID": "wattos",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/jurgenfd/profile/"
        }
    ],
    "description": "Collection of Java programs for structural biology and NMR spectroscopy. It’s programs analyze, annotate, parse, archive, and disseminate experimental NMR data deposited by authors world wide into the PDB and BMRB.",
    "documentation": [
        {
            "type": "General",
            "url": "https://code.google.com/archive/p/wattos/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "https://code.google.com/p/wattos/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/wattos-software-structural-biology-nmr-spectroscopy.html"
        }
    ],
    "name": "Wattos",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "We present two new databases of NMR-derived distance and dihedral angle restraints: the Database Of Converted Restraints (DOCR) and the Filtered Restraints Database (FRED). These databases currently correspond to 545 proteins with NMR structures deposited in the Protein Databank (PDB). The criteria for inclusion were that these should be unique, monomeric proteins with author-provided experimental NMR data and coordinates available from the PDB capable of being parsed and prepared in a consistent manner. The Wattos program was used to parse the files, and the CcpNmr FormatConverter program was used to prepare them semi-automatically. New modules, including a new implementation of Aqua in the BioMagResBank (BMRB) software Wattos were used to analyze the sets of distance restraints (DRs) for inconsistencies, redundancies, NOE completeness, classification and violations with respect to the original coordinates. Restraints that could not be associated with a known nomenclature were flagged. The coordinates of hydrogen atoms were recalculated from the positions of heavy atoms to allow for a full restraint analysis. The DOCR database contains restraint and coordinate data that is made consistent with each other and with IUPAC conventions. The FRED database is based on the DOCR data but is filtered for use by test calculation protocols and longitudinal analyses and validations. These two databases are available from websites of the BMRB and the Macromolecular Structure Database (MSD) in various formats: NMR-STAR, CCPN XML, and in formats suitable for direct use in the software packages CNS and CYANA. © Springer 2005.",
                "authors": [
                    {
                        "name": "Doreleijers J.F."
                    },
                    {
                        "name": "Nederveen A.J."
                    },
                    {
                        "name": "Vranken W."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    },
                    {
                        "name": "Kaptein R."
                    },
                    {
                        "name": "Markley J.L."
                    },
                    {
                        "name": "Ulrich E.L."
                    }
                ],
                "citationCount": 34,
                "date": "2005-05-01T00:00:00Z",
                "journal": "Journal of Biomolecular NMR",
                "title": "BioMagResBank databases DOCR and FRED containing converted and filtered sets of experimental NMR restraints and coordinates from over 500 protein PDB structures"
            },
            "pmid": "16041478"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}