{
    "additionDate": "2017-04-21T12:12:58Z",
    "biotoolsCURIE": "biotools:islandviewer",
    "biotoolsID": "islandviewer",
    "credit": [
        {
            "email": "islandpick-mail@sfu.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "brinkman@sfu.ca",
            "name": "Fiona S. L. Brinkman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Prediction and analysis of genomic islands in bacterial and archael genomes. It integrates four different genomic island prediction methods: IslandPick, IslandPath-DIMOB, SIGI-HMM, and Islander.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.pathogenomics.sfu.ca/islandviewer/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "tRNA gene prediction",
                    "uri": "http://edamontology.org/operation_0464"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://www.pathogenomics.sfu.ca/islandviewer/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "IslandViewer 4",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Summary: Genomic islands (clusters of genes of probable horizontal origin; GIs) play a critical role in medically important adaptations of bacteria. Recently, several computational methods have been developed to predict GIs that utilize either sequence composition bias or comparative genomics approaches. IslandViewer is a web accessible application that provides the first user-friendly interface for obtaining precomputed GI predictions, or predictions from user-inputted sequence, using the most accurate methods for genomic island prediction: IslandPick, IslandPath-DIMOB and SIGI-HMM. The graphical interface allows easy viewing and downloading of island data in multiple formats, at both the chromosome and gene level, for method-specific, or overlapping, GI predictions. © 2009 The Author(s).",
                "authors": [
                    {
                        "name": "Langille M.G.I."
                    },
                    {
                        "name": "Brinkman F.S.L."
                    }
                ],
                "citationCount": 327,
                "date": "2009-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IslandViewer: An integrated interface for computational identification and visualization of genomic islands"
            },
            "pmid": "19151094"
        },
        {
            "metadata": {
                "abstract": "IslandViewer (http://pathogenomics.sfu.ca/islandviewer) is a web-accessible application for the computational prediction and analysis of genomic islands (GIs) in bacterial and archaeal genomes. GIs are clusters of genes of probable horizontal origin and are of high interest because they disproportionately encode virulence factors and other adaptations of medical, environmental and industrial interest. Many computational tools exist for the prediction of GIs, but three of the most accurate methods are available in integrated form via IslandViewer: IslandPath-DIMOB, SIGI-HMM and IslandPick. IslandViewer GI predictions are precomputed for all complete microbial genomes from National Center for Biotechnology Information, with an option to upload other genomes and/or perform customized analyses using different settings. Here, we report recent changes to the IslandViewer framework that have vastly improved its efficiency in handling an increasing number of users, plus better facilitate custom genome analyses. Users may also now overlay additional annotations such as virulence factors, antibiotic resistance genes and pathogen-associated genes on top of current GI predictions. Comparisons of GIs between user-selected genomes are now facilitated through a highly requested side-by-side viewer. IslandViewer improvements aim to provide a more flexible interface, coupled with additional highly relevant annotation information, to aid analysis of GIs in diverse microbial species.",
                "authors": [
                    {
                        "name": "Dhillon B.K."
                    },
                    {
                        "name": "Chiu T.A."
                    },
                    {
                        "name": "Laird M.R."
                    },
                    {
                        "name": "Langille M.G."
                    },
                    {
                        "name": "Brinkman F.S."
                    }
                ],
                "citationCount": 64,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "IslandViewer update: Improved genomic island discovery and visualization."
            },
            "pmid": "23677610"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1
}