{
    "accessibility": "Open access",
    "additionDate": "2023-02-12T15:55:07.130908Z",
    "biotoolsCURIE": "biotools:cancereffectsizer",
    "biotoolsID": "cancereffectsizer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jeffrey D Mandell"
        }
    ],
    "description": "Estimation of neutral mutation rates and quantification of somatic variant selection using canceffectsizeR.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://townsend-lab-yale.github.io/cancereffectsizeR/articles/cancereffectsizeR.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://townsend-lab-yale.github.io/cancereffectsizeR",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:02:42.399413Z",
    "license": "GPL-3.0",
    "name": "cancereffectsizeR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1158/0008-5472.can-22-1508",
            "metadata": {
                "abstract": "Somatic nucleotide mutations can contribute to cancer cell survival, proliferation, and pathogenesis. Although research has focused on identifying which mutations are \"drivers\"versus \"passengers,\"quantifying the proliferative effects of specific variants within clinically relevant contexts could reveal novel aspects of cancer biology. To enable researchers to estimate these cancer effects, we developed cancereffectsizeR, an R package that organizes somatic variant data, facilitates mutational signature analysis, calculates site-specific mutation rates, and tests models of selection. Built-in models support effect estimation from single nucleotides to genes. Users can also estimate epistatic effects between paired sets of variants, or design and test custom models. The utility of cancer effect was validated by showing in a pan-cancer dataset that somatic variants classified as likely pathogenic or pathogenic in ClinVar exhibit substantially higher effects than most other variants. Indeed, cancer effect was a better predictor of pathogenic status than variant prevalence or functional impact scores. In addition, the application of this approach toward pairwise epistasis in lung adenocarcinoma showed that driver mutations in BRAF, EGFR, or KRAS typically reduce selection for alterations in the other two genes. Companion reference data packages support analyses using the hg19 or hg38 human genome builds, and a reference data builder enables use with any species or custom genome build with available genomic and transcriptomic data. Areference manual, tutorial, and public source code repository are available at https://townsend-lab-yale.github.io/ cancereffectsizeR. Comprehensive estimation of cancer effects of somatic mutations can provide insights into oncogenic trajectories, with implications for cancer prognosis and treatment.",
                "authors": [
                    {
                        "name": "Cannataro V.L."
                    },
                    {
                        "name": "Mandell J.D."
                    },
                    {
                        "name": "Townsend J.P."
                    }
                ],
                "citationCount": 7,
                "date": "2023-02-15T00:00:00Z",
                "journal": "Cancer Research",
                "title": "Estimation of Neutral Mutation Rates and Quantification of Somatic Variant Selection Using cancereffectsizeR"
            },
            "pmcid": "PMC9929515",
            "pmid": "36469362"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epistasis",
            "uri": "http://edamontology.org/topic_3974"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
