{
    "accessibility": "Open access",
    "additionDate": "2022-09-17T12:24:33.089944Z",
    "biotoolsCURIE": "biotools:rrqnet",
    "biotoolsID": "rrqnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dbhattacharya@vt.edu",
            "name": "Debswapna Bhattacharya",
            "orcidid": "https://orcid.org/0000-0002-9630-0141",
            "typeEntity": "Person"
        },
        {
            "name": "Md Hossain Shuvo"
        },
        {
            "name": "Rahmatullah Roche"
        },
        {
            "name": "Sutanu Bhattacharya"
        }
    ],
    "description": "Protein contact map quality estimation by deep evolutionary reconciliation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Contact map calculation",
                    "uri": "http://edamontology.org/operation_0392"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Bhattacharya-Lab/rrQNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-17T12:24:33.092607Z",
    "license": "GPL-3.0",
    "name": "rrQNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/prot.26394",
            "metadata": {
                "abstract": "© 2022 Wiley Periodicals LLC.Protein contact maps have proven to be a valuable tool in the deep learning revolution of protein structure prediction, ushering in the recent breakthrough by AlphaFold2. However, self-assessment of the quality of predicted structures are typically performed at the granularity of three-dimensional coordinates as opposed to directly exploiting the rotation- and translation-invariant two-dimensional (2D) contact maps. Here, we present rrQNet, a deep learning method for self-assessment in 2D by contact map quality estimation. Our approach is based on the intuition that for a contact map to be of high quality, the residue pairs predicted to be in contact should be mutually consistent with the evolutionary context of the protein. The deep neural network architecture of rrQNet implements this intuition by cascading two deep modules—one encoding the evolutionary context and the other performing evolutionary reconciliation. The penultimate stage of rrQNet estimates the quality scores at the interacting residue-pair level, which are then aggregated for estimating the quality of a contact map. This design choice offers versatility at varied resolutions from individual residue pairs to full-fledged contact maps. Trained on multiple complementary sources of contact predictors, rrQNet facilitates generalizability across various contact maps. By rigorously testing using publicly available datasets and comparing against several in-house baseline approaches, we show that rrQNet accurately reproduces the true quality score of a predicted contact map and successfully distinguishes between accurate and inaccurate contact maps predicted by a wide variety of contact predictors. The open-source rrQNet software package is freely available at https://github.com/Bhattacharya-Lab/rrQNet.",
                "authors": [
                    {
                        "name": "Bhattacharya D."
                    },
                    {
                        "name": "Bhattacharya S."
                    },
                    {
                        "name": "Roche R."
                    },
                    {
                        "name": "Shuvo M.H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "rrQNet: Protein contact map quality estimation by deep evolutionary reconciliation"
            },
            "pmid": "35751651"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
