{"credit":[{"name":"Matthew Ezewudo","typeEntity":"Person","typeRoles":["Developer"]}],"function":[{"input":[{"data":{"term":"DNA sequence","uri":"http://edamontology.org/data_3494"},"format":[{"term":"FASTQ","uri":"http://edamontology.org/format_1930"}]},{"data":{"term":"DNA sequence","uri":"http://edamontology.org/data_3494"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]}],"operation":[{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"},{"term":"Read mapping","uri":"http://edamontology.org/operation_3198"}]}],"labels":{"cost":"Free of charge","language":["Python"],"license":"MIT","maturity":"Emerging","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool","Workflow"],"topic":[{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/CPTR-ReSeqTB/UVP"}],"publication":[{"abstract":"© 2018, The Author(s).Drug-resistant tuberculosis poses a persistent public health threat. The ReSeqTB platform is a collaborative, curated knowledgebase, designed to standardize and aggregate global Mycobacterium tuberculosis complex (MTBC) variant data from whole genome sequencing (WGS) with phenotypic drug susceptibility testing (DST) and clinical data. We developed a unified analysis variant pipeline (UVP) (https://github.com/CPTR-ReSeqTB/UVP) to identify variants and assign lineage from MTBC sequence data. Stringent thresholds and quality control measures were incorporated in this open source tool. The pipeline was validated using a well-characterized dataset of 90 diverse MTBC isolates with conventional DST and DNA Sanger sequencing data. The UVP exhibited 98.9% agreement with the variants identified using Sanger sequencing and was 100% concordant with conventional methods of assigning lineage. We analyzed 4636 publicly available MTBC isolates in the ReSeqTB platform representing all seven major MTBC lineages. The variants detected have an above 94% accuracy of predicting drug based on the accompanying DST results in the platform. The aggregation of variants over time in the platform will establish confidence-graded mutations statistically associated with phenotypic drug resistance. These tools serve as critical reference standards for future molecular diagnostic assay developers, researchers, public health agencies and clinicians working towards the control of drug-resistant tuberculosis.","authors":["Ezewudo M.","Borens A.","Chiner-Oms A.","Miotto P.","Chindelevitch L.","Starks A.M.","Hanna D.","Liwski R.","Zignol M.","Gilpin C.","Niemann S.","Kohl T.A.","Warren R.M.","Crook D.","Gagneux S.","Hoffner S.","Rodrigues C.","Comas I.","Engelthaler D.M.","Alland D.","Rigouts L.","Lange C.","Dheda K.","Hasan R.","McNerney R.","Cirillo D.M.","Schito M.","Rodwell T.C.","Posey J."],"cit_count":7,"doi":"10.1038/s41598-018-33731-1","journal":"Scientific Reports","title":"Integrating standardized whole genome sequence analysis with a global Mycobacterium tuberculosis antibiotic resistance knowledgebase","year":"2018-12-01"}],"summary":{"biotoolsCURIE":"biotools:UVP","biotoolsID":"UVP","description":"The Unified Variant Pipeline (UVP) is used to identify variants and assign lineage from Mycobacterium tuberculosis sequence data.","homepage":"https://github.com/CPTR-ReSeqTB/UVP","name":"UVP","version":["2.7.0","2.6.0"]}}