{
    "accessibility": "Open access",
    "additionDate": "2019-05-21T08:59:23Z",
    "biotoolsCURIE": "biotools:NanoMod",
    "biotoolsID": "NanoMod",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Wang Genomics Lab",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://wglab.org/"
        }
    ],
    "description": "Computational tool to detect DNA modifications using Nanopore long-read sequencing data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/WGLab/NanoMod/blob/master/docs/Usage.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WGLab/NanoMod",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "NanoMod",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12864-018-5372-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recent advances in single-molecule sequencing techniques, such as Nanopore sequencing, improved read length, increased sequencing throughput, and enabled direct detection of DNA modifications through the analysis of raw signals. These DNA modifications include naturally occurring modifications such as DNA methylations, as well as modifications that are introduced by DNA damage or through synthetic modifications to one of the four standard nucleotides. Methods: To improve the performance of detecting DNA modifications, especially synthetically introduced modifications, we developed a novel computational tool called NanoMod. NanoMod takes raw signal data on a pair of DNA samples with and without modified bases, extracts signal intensities, performs base error correction based on a reference sequence, and then identifies bases with modifications by comparing the distribution of raw signals between two samples, while taking into account of the effects of neighboring bases on modified bases (\"neighborhood effects\"). Results: We evaluated NanoMod on simulation data sets, based on different types of modifications and different magnitudes of neighborhood effects, and found that NanoMod outperformed other methods in identifying known modified bases. Additionally, we demonstrated superior performance of NanoMod on an E. coli data set with 5mC (5-methylcytosine) modifications. Conclusions: In summary, NanoMod is a flexible tool to detect DNA modifications with single-base resolution from raw signals in Nanopore sequencing, and will facilitate large-scale functional genomics experiments that use modified nucleotides.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Georgieva D.C."
                    },
                    {
                        "name": "Egli D."
                    },
                    {
                        "name": "Wang K."
                    }
                ],
                "citationCount": 16,
                "date": "2019-02-04T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "NanoMod: A computational tool to detect DNA modifications using Nanopore long-read sequencing data"
            },
            "pmcid": "PMC6360650",
            "pmid": "30712508",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        }
    ],
    "validated": 1,
    "version": [
        "0.1.0"
    ]
}