{
    "accessibility": "Open access",
    "additionDate": "2022-03-23T17:24:00.884895Z",
    "biotoolsCURIE": "biotools:pclouds",
    "biotoolsID": "pclouds",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "David.Pollock@UCDenver.edu",
            "name": "David Pollock"
        },
        {
            "email": "jason.de.koning@gmail.com",
            "name": "Jason de Koning"
        },
        {
            "email": "midnightline@yahoo.com",
            "name": "Kathryn Hall"
        },
        {
            "email": "wanjun.gu@gmail.com",
            "name": "Wanjun Gu"
        }
    ],
    "description": "The P-clouds package is designed to identify repeat structure in large eukaryotic genomes using oligonucleotide counts.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.evolutionarygenomics.com/ProgramsData/PClouds/P-Clouds_v0.9a_doc.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                }
            ]
        }
    ],
    "homepage": "http://www.evolutionarygenomics.com/ProgramsData/PClouds/PClouds.html",
    "lastUpdate": "2022-03-23T17:24:00.887663Z",
    "license": "Not licensed",
    "name": "pclouds",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.ab.2008.05.015",
            "metadata": {
                "abstract": "The identification of repeat structure in eukaryotic genomes can be time-consuming and difficult because of the large amount of information (∼3 × 109 bp) that needs to be processed and compared. We introduce a new approach based on exact word counts to evaluate, de novo, the repeat structure present within large eukaryotic genomes. This approach avoids sequence alignment and similarity search, two of the most time-consuming components of traditional methods for repeat identification. Algorithms were implemented to efficiently calculate exact counts for any length oligonucleotide in large genomes. Based on these oligonucleotide counts, oligonucleotide excess probability clouds, or \"P-clouds,\" were constructed. P-clouds are composed of clusters of related oligonucleotides that occur, as a group, more often than expected by chance. After construction, P-clouds were mapped back onto the genome, and regions of high P-cloud density were identified as repetitive regions based on a sliding window approach. This efficient method is capable of analyzing the repeat content of the entire human genome on a single desktop computer in less than half a day, at least 10-fold faster than current approaches. The predicted repetitive regions strongly overlap with known repeat elements as well as other repetitive regions such as gene families, pseudogenes, and segmental duplicons. This method should be extremely useful as a tool for use in de novo identification of repeat structure in large newly sequenced genomes. © 2008 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Batzer M.A."
                    },
                    {
                        "name": "Castoe T.A."
                    },
                    {
                        "name": "Gu W."
                    },
                    {
                        "name": "Hedges D.J."
                    },
                    {
                        "name": "Pollock D.D."
                    }
                ],
                "citationCount": 31,
                "date": "2008-09-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "Identification of repeat structure in large genomes using repeat probability clouds"
            },
            "pmcid": "PMC2533575",
            "pmid": "18541131"
        },
        {
            "doi": "10.1371/journal.pgen.1002384",
            "metadata": {
                "abstract": "Transposable elements (TEs) are conventionally identified in eukaryotic genomes by alignment to consensus element sequences. Using this approach, about half of the human genome has been previously identified as TEs and low-complexity repeats. We recently developed a highly sensitive alternative de novo strategy, P-clouds, that instead searches for clusters of high-abundance oligonucleotides that are related in sequence space (oligo \"clouds\"). We show here that P-clouds predicts >840 Mbp of additional repetitive sequences in the human genome, thus suggesting that 66%-69% of the human genome is repetitive or repeat-derived. To investigate this remarkable difference, we conducted detailed analyses of the ability of both P-clouds and a commonly used conventional approach, RepeatMasker (RM), to detect different sized fragments of the highly abundant human Alu and MIR SINEs. RM can have surprisingly low sensitivity for even moderately long fragments, in contrast to P-clouds, which has good sensitivity down to small fragment sizes (~25 bp). Although short fragments have a high intrinsic probability of being false positives, we performed a probabilistic annotation that reflects this fact. We further developed \"element-specific\" P-clouds (ESPs) to identify novel Alu and MIR SINE elements, and using it we identified ~100 Mb of previously unannotated human elements. ESP estimates of new MIR sequences are in good agreement with RM-based predictions of the amount that RM missed. These results highlight the need for combined, probabilistic genome annotation approaches and suggest that the human genome consists of substantially more repetitive sequence than previously believed. © 2011 de Koning et al.",
                "authors": [
                    {
                        "name": "Batzer M.A."
                    },
                    {
                        "name": "Castoe T.A."
                    },
                    {
                        "name": "Gu W."
                    },
                    {
                        "name": "Pollock D.D."
                    },
                    {
                        "name": "de Koning A.P.J."
                    }
                ],
                "citationCount": 648,
                "date": "2011-12-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Repetitive elements may comprise over Two-Thirds of the human genome"
            },
            "pmcid": "PMC3228813",
            "pmid": "22144907"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}
