{
    "additionDate": "2019-11-14T19:40:18Z",
    "biotoolsCURIE": "biotools:abcd-alzheimer",
    "biotoolsID": "abcd-alzheimer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tiratharaj@gmail.com",
            "name": "Tiratha Raj Singh",
            "typeEntity": "Person"
        }
    ],
    "description": "An Alzheimer's Disease Biomarker Comprehensive Database for Humans. It includes the information for all the genetic parameters like mitochondrial genes, polymorphic genes (SNP's), transcription factors, proteins, miRNAs, Associative pathway, and AD brain images.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinfoindia.org/abcd",
    "lastUpdate": "2021-01-11T14:41:42Z",
    "name": "Alzheimers Disease Biomarker Comprehensive Database (ABCD)",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S13205-019-1888-0",
            "metadata": {
                "abstract": "© 2019, King Abdulaziz City for Science and Technology.Alzheimer’s disease (AD) is an age-related, non-reversible, and progressive brain disorder. Memory loss, confusion, and personality changes are major symptoms noticed. AD ultimately leads to a severe loss of mental function. Due to lack of effective biomarkers, no effective medication was available for the complete treatment of AD. There is a need to provide all AD-related essential information to the scientific community. Our resource Alzheimer’s disease Biomarkers Comprehensive Database (ABCD) is being planned to accomplish this objective. ABCD is a huge collection of AD-related data of molecular markers. The web interface contains information concerning the proteins, genes, transcription factors, SNPs, miRNAs, mitochondrial genes, and expressed genes implicated in AD pathogenesis. In addition to the molecular-level data, the database has information for animal models, medicinal candidates and pathways involved in the AD and some image data for AD patients. ABCD is coupled with some major external resources where the user can retrieve additional general information about the disease. The database was designed in such a manner that user can extract meaningful information about gene, protein, pathway, and regulatory elements based search options. This database is unique in the sense that it is completely dedicated to specific neurological disorder i.e. AD. Further advance options like AD-affected brain image data of patients and structural compound level information add values to our database. Features of this database enable users to extract, analyze and display information related to a disease in many different ways. The database is available for academic purpose and accessible at http://www.bioinfoindia.org/abcd.",
                "authors": [
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Bansal A."
                    },
                    {
                        "name": "Singh T.R."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "3 Biotech",
                "title": "ABCD: Alzheimer’s disease Biomarkers Comprehensive Database"
            },
            "pmcid": "PMC6722159",
            "pmid": "31501752"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}