{"credit":[{"email":"devlinbj@upmc.edu","name":"Bernie Devlin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://wpicr.wpic.pitt.edu/WPICCompGen/"}],"documentation":[{"url":"http://wpicr.wpic.pitt.edu/WPICCompGen/GroupedFDR/readme.txt"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows"],"toolType":["Library"],"topic":[{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/grouped-fdr-grouped-false-discovery-rate.html"}],"publication":[{"abstract":"The potential of genome-wide association analysis can only be realized when they have power to detect signals despite the detrimental effect of multiple testing on power. We develop a weighted multiple testing procedure that facilitates the input of prior information in the form of groupings of tests. For each group a weight is estimated from the observed test statistics within the group. Differentially weighting groups improves the power to detect signals in likely groupings. The advantage of the grouped-weighting concept, over fixed weights based on prior information, is that it often leads to an increase in power even if many of the groupings are not correlated with the signal. Being data dependent, the procedure is remarkably robust to poor choices in groupings. Power is typically improved if one (or more) of the groups clusters multiple tests with signals, yet little power is lost when the groupings are totally random. If there is no apparent signal in a group, relative to a group that appears to have several tests with signals, the former group will be down-weighted relative to the latter. If no groups show apparent signals, then the weights will be approximately equal. The only restriction on the procedure is that the number of groups be small, relative to the total number of tests performed. © 2007 Wiley-Liss, Inc.","authors":["Roeder K.","Devlin B.","Wasserman L."],"cit_count":64,"journal":"Genetic Epidemiology","pmid":"17549760","title":"Improving power in genome-wide association studies: Weights tip the scale","year":"2007-11-01"}],"summary":{"biotoolsCURIE":"biotools:grouped_fdr","biotoolsID":"grouped_fdr","description":"Designed to test multiple hypotheses and control either the false discovery rate or the family-wise error rate. The method facilitates the input of prior information in the form of groupings of tests, for example, one group might include SNPs in candidate genes, while another includes all other SNPS. For each group a weight is estimated from the observed test statistics within the group.","homepage":"http://wpicr.wpic.pitt.edu/WPICCompGen/GroupedFDR/","name":"Grouped FDR"}}