{
    "additionDate": "2024-01-22T09:59:39.638556Z",
    "biotoolsCURIE": "biotools:uni_dock",
    "biotoolsID": "uni_dock",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhengh@dp.tech",
            "name": "Hang Zheng"
        },
        {
            "email": "zhuzd@dp.tech",
            "name": "Zhengdan Zhu",
            "orcidid": "https://orcid.org/0000-0001-9260-6226"
        }
    ],
    "description": "GPU-accelerated docking.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://app.bohrium.dp.tech/uni-dock/",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:21:11.440616Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/dptech-corp/Uni-Dock"
        }
    ],
    "name": "Uni-Dock",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jctc.2c01145",
            "metadata": {
                "abstract": "Molecular docking, a structure-based virtual screening method, is a reliable tool to enrich potential bioactive molecules from molecular databases. With the rapid expansion of compound library sizes, the speed of existing molecular docking programs becomes less than adequate to meet the demand for screening ultralarge libraries containing tens of millions or billions of molecules. Here, we propose Uni-Dock, a GPU-accelerated molecular docking program that supports various scoring functions including vina, vinardo, and ad4. Uni-Dock achieves more than 1000-fold speedup with high accuracy compared with the AutoDock Vina running in single CPU core, outperforming reported GPU-accelerated docking programs including AutoDock-GPU and Vina-GPU based on head-to-head experiments. Uni-Dock docks molecules in batches simultaneously using concurrent threads of each molecule. The data flow between GPU and CPU is optimized to eliminate CPU hotspots and maximize GPU utility. Additionally, Uni-Dock also supports hydrogen bond biased docking for all scoring functions and can be migrated to multiple GPUs of different architectures and manufacturers. We analyzed the improved performance of Uni-Dock on the CASF-2016 and DUD-E datasets and recommend three combinations of hyperparameters corresponding to different docking scenarios. To demonstrate Uni-Dock's capability on routinely screening ultralarge libraries, we performed hierarchical virtual screening experiments with Uni-Dock on the Enamine Diverse REAL druglike set containing 38.2 million molecules to a popular target KRAS G12D in 12 h using 100 NVIDIA V100 GPUs. To the best of our knowledge, Uni-Dock should be the fastest GPU-accelerated docking program to date.",
                "authors": [
                    {
                        "name": "Bo Z."
                    },
                    {
                        "name": "Cai C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Zheng H."
                    },
                    {
                        "name": "Zhu Z."
                    }
                ],
                "citationCount": 17,
                "date": "2023-06-13T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "Uni-Dock: GPU-Accelerated Docking Enables Ultralarge Virtual Screening"
            },
            "pmid": "37125970"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}
