{
    "additionDate": "2018-07-14T21:21:52Z",
    "biotoolsCURIE": "biotools:sepira",
    "biotoolsID": "sepira",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "cytwarmmay@hotmail.com",
            "name": "Yuting Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Systems EPigenomics Inference of Regulatory Activity is an algorithm that infers sample-specific transcription factor activity from the genome-wide expression or DNA methylation profile of the sample.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/manuals/SEPIRA/man/SEPIRA.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/SEPIRA_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/SEPIRA.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://bioconductor.org/packages/SEPIRA/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://git.bioconductor.org/packages/SEPIRA"
        }
    ],
    "name": "SEPIRA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s13059-017-1366-0",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Diverse molecular alterations associated with smoking in normal and precursor lung cancer cells have been reported, yet their role in lung cancer etiology remains unclear. A prominent example is hypomethylation of the aryl hydrocarbon-receptor repressor (AHRR) locus, which is observed in blood and squamous epithelial cells of smokers, but not in lung cancer. Results: Using a novel systems-epigenomics algorithm, called SEPIRA, which leverages the power of a large RNA-sequencing expression compendium to infer regulatory activity from messenger RNA expression or DNA methylation (DNAm) profiles, we infer the landscape of binding activity of lung-specific transcription factors (TFs) in lung carcinogenesis. We show that lung-specific TFs become preferentially inactivated in lung cancer and precursor lung cancer lesions and further demonstrate that these results can be derived using only DNAm data. We identify subsets of TFs which become inactivated in precursor cells. Among these regulatory factors, we identify AHR, the aryl hydrocarbon-receptor which controls a healthy immune response in the lung epithelium and whose repressor, AHRR, has recently been implicated in smoking-mediated lung cancer. In addition, we identify FOXJ1, a TF which promotes growth of airway cilia and effective clearance of the lung airway epithelium from carcinogens. Conclusions: We identify TFs, such as AHR, which become inactivated in the earliest stages of lung cancer and which, unlike AHRR hypomethylation, are also inactivated in lung cancer itself. The novel systems-epigenomics algorithm SEPIRA will be useful to the wider epigenome-wide association study community as a means of inferring regulatory activity.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Widschwendter M."
                    },
                    {
                        "name": "Teschendorff A.E."
                    }
                ],
                "citationCount": 10,
                "date": "2017-12-20T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Systems-epigenomics inference of transcription factor activity implicates aryl-hydrocarbon-receptor inactivation as a key event in lung cancer development"
            },
            "pmcid": "PMC5738803",
            "pmid": "29262847",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}