
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://hub.iis.sinica.edu.tw/spotlight/contact.htm"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://hub.iis.sinica.edu.tw/spotlight/help.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/spotlight-assembly-of-protein-complex-from-interactomes.html"
        }
    ],
    "publication": [
        {
            "abstract": "As is generally assumed, clusters in protein-protein interaction (PPI) networks perform specific, crucial functions in biological systems. Various network community detection methods have been developed to exploit PPI networks in order to identify protein complexes and functional modules. Due to the potential role of various regulatory modes in biological networks, a single method may just apply a single graph property and neglect communities highlighted by other network properties. This work presents a novel integration method to capture protein modules/protein complexes by multiple network features detected by different algorithms. The integration method is further implemented in a web-based platform with a highly effective interactive network analyzer. Conventionally adopted methods with different perspectives on network community detection (e.g., CPM, FastGreedy, HUNTER, MCL, LE, SpinGlass, and WalkTrap) are also executed simultaneously. Analytical results indicate that the proposed method performs better than the conventional ones. The proposed approach can capture the transcription and RNA splicing machineries from the yeast protein network. Meanwhile, proteins that are highly associated with each other, yet not described in both machineries are also identified. In sum, a protein that is closely connected to components of a known module or a complex in the network view implies the functional association among them. Importantly, our method can detect these unique network features, thus facilitating efforts to discover unknown components of functional modules/protein complexes. Availability: Spotlight is freely accessible at http://hub.iis.sinica.edu.tw/spotlight. Video clips for a quick view of usage are available in the website online help page. © 2012.",
            "authors": [
                "Chin C.-H.",
                "Chen S.-H.",
                "Chen C.-Y.",
                "Hsiung C.A.",
                "Ho C.-W.",
                "Ko M.-T.",
                "Lin C.-Y."
            ],
            "cit_count": 1,
            "journal": "Gene",
            "pmid": "23274651",
            "title": "Spotlight: Assembly of protein complexes by integrating graph clustering methods",
            "year": "2013-04-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:spotlight",
        "biotoolsID": "spotlight",
        "description": "The tool is designed to detect community structures in a network. Community, in which vertices are joined tightly together, between which there are only looser edges, exists in many real networks.",
        "homepage": "http://hub.iis.sinica.edu.tw/spotlight/",
        "name": "Spotlight"
    }
}