{
    "additionDate": "2020-01-14T09:01:41Z",
    "biotoolsCURIE": "biotools:CYSMA",
    "biotoolsID": "CYSMA",
    "confidence_flag": "tool",
    "description": "An example of integrative tool for in silico analysis of missense variants identified in Mendelian disorders.\n\nCystic Fibrosis Missense Analysis.\n\nWebsite dedicated to the in silico analysis of missense variants in the CFTR gene.\n\nWelcome to the Cystic Fibrosis Missense Analysis Website.\n\nData provided and calculated by CYSMA must be considered as predictions.\n\nIf you are dealing with the genetics of cystic fibrosis or CFTR-related disorders, you may find this website useful. CYSMA has been developed as a tool to help you to predict the impact of novel uncharacterized missense variants when the information provided by CFTR patient databases such as CFTR-France, CFTR1 and CFTR2 remain insufficient",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://cftr.iurc.montp.inserm.fr/cysma/",
    "lastUpdate": "2020-12-17T11:56:13Z",
    "name": "CYSMA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/HUMU.23941",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Exome sequencing used for molecular diagnosis of Mendelian disorders considerably increases the number of missense variants of unclear significance, whose pathogenicity can be assessed by a variety of prediction tools. As the performance of algorithms may vary according to the datasets, complementary specific resources are needed to improve variant interpretation. As a model, we were interested in the cystic fibrosis transmembrane conductance regulator gene (CFTR) causing cystic fibrosis, in which at least 40% of missense variants are reported. Cystic fibrosis missense analysis (CYSMA) is a new web server designed for online estimation of the pathological relevance of CFTR missense variants. CYSMA generates a set of computationally derived data, ranging from evolutionary conservation to functional observations from three-dimensional structures, provides all available allelic frequencies, clinical observations, and references for functional studies. Compared to software classically used in analysis pipelines on a dataset of 141 well-characterized missense variants, CYSMA was the most efficient tool to discriminate benign missense variants, with a specificity of 85%, and very good sensitivity of 89%. These results suggest that such integrative tools could be adapted to numbers of genes involved in Mendelian disorders to improve the interpretation of missense variants identified in the context of diagnosis.",
                "authors": [
                    {
                        "name": "Bareil C."
                    },
                    {
                        "name": "Baux D."
                    },
                    {
                        "name": "Bergougnoux A."
                    },
                    {
                        "name": "Claustres M."
                    },
                    {
                        "name": "Koenig M."
                    },
                    {
                        "name": "Lahure A."
                    },
                    {
                        "name": "Paulet D."
                    },
                    {
                        "name": "Raynal C."
                    },
                    {
                        "name": "Roux A.-F."
                    },
                    {
                        "name": "Sasorith S."
                    },
                    {
                        "name": "Taulan-Cadars M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "The CYSMA web server: An example of integrative tool for in silico analysis of missense variants identified in Mendelian disorders"
            },
            "pmid": "31674704"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}
