{
    "additionDate": "2019-11-14T19:32:11Z",
    "biotoolsCURIE": "biotools:GkmExplain",
    "biotoolsID": "GkmExplain",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "akundaje@stanford.edu",
            "name": "Anshul Kundaje",
            "orcidid": "https://orcid.org/0000-0003-3084-2287",
            "typeEntity": "Person"
        },
        {
            "email": "avanti@stanford.edu",
            "name": "Avanti Shrikumar",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast and accurate interpretation of nonlinear gapped k-mer SVMs | Accompanying repository for GkmExplain paper | GkmExplain: Fast and Accurate Interpretation of Nonlinear Gapped k-mer Support Vector Machines | This repository accompanies Gkmexplain: Fast and Accurate Interpretation of Nonlinear Gapped k-mer SVMs by Shrikumar*†, Prakash* and Kundaje† (*co-first authors †co-corresponding authors).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kundajelab/gkmexplain",
    "lastUpdate": "2020-12-03T11:38:09Z",
    "name": "GkmExplain",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ322",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Summary: Support Vector Machines with gapped k-mer kernels (gkm-SVMs) have been used to learn predictive models of regulatory DNA sequence. However, interpreting predictive sequence patterns learned by gkm-SVMs can be challenging. Existing interpretation methods such as deltaSVM, in-silico mutagenesis (ISM) or SHAP either do not scale well or make limiting assumptions about the model that can produce misleading results when the gkm kernel is combined with nonlinear kernels. Here, we propose GkmExplain: a computationally efficient feature attribution method for interpreting predictive sequence patterns from gkm-SVM models that has theoretical connections to the method of Integrated Gradients. Using simulated regulatory DNA sequences, we show that GkmExplain identifies predictive patterns with high accuracy while avoiding pitfalls of deltaSVM and ISM and being orders of magnitude more computationally efficient than SHAP. By applying GkmExplain and a recently developed motif discovery method called TF-MoDISco to gkm-SVM models trained on in vivo transcription factor (TF) binding data, we recover consolidated, non-redundant TF motifs. Mutation impact scores derived using GkmExplain consistently outperform deltaSVM and ISM at identifying regulatory genetic variants from gkm-SVM models of chromatin accessibility in lymphoblastoid cell-lines.",
                "authors": [
                    {
                        "name": "Kundaje A."
                    },
                    {
                        "name": "Prakash E."
                    },
                    {
                        "name": "Shrikumar A."
                    }
                ],
                "citationCount": 8,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GkmExplain: Fast and accurate interpretation of nonlinear gapped k-mer SVMs"
            },
            "pmcid": "PMC6612808",
            "pmid": "31510661"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
