{
    "accessibility": "Open access",
    "additionDate": "2021-11-05T21:14:39.033394Z",
    "biotoolsCURIE": "biotools:mpsbase",
    "biotoolsID": "mpsbase",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gcvsilva@hcpa.edu.br",
            "name": "Gerda Cristal Villalba Silva",
            "orcidid": "https://orcid.org/0000-0003-0283-7982"
        },
        {
            "email": "ldsoares@hcpa.edu.br",
            "name": "Luís Dias F. Soares",
            "orcidid": "https://orcid.org/0000-0003-2537-8571"
        },
        {
            "email": "umatte@hcpa.edu.br",
            "name": "Ursula Matte",
            "orcidid": "https://orcid.org/0000-0003-4977-6662"
        }
    ],
    "description": "MPSBase is a comprehensive repository of differentially expressed genes for Mucopolysaccharidoses studies. It includes all the currently available RNA-Seq and microarray studies with four MPS models. Here, you can look not only for the genes but also for ontology terms and biological pathways enriched in these studies. Also, the samples include not only the clinical features but also compare several tissues and experimental treatments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://www.ufrgs.br/mpsbase/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2021-11-05T21:16:53.420222Z",
    "name": "MPSBase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.YMGME.2021.06.004",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Mucopolysaccharidoses (MPS) are lysosomal storage diseases (LSDs) caused by the deficiency of enzymes essential for the metabolism of extracellular matrix components called glycosaminoglycans (GAGs). To understand the physiopathology and alterations due to the lysosomal accumulation resulting from enzymatic deficiencies and their secondary outcomes can improve the diagnosis and treatment of rare genetic diseases. This work presents a database for differentially expressed genes from different public MPS data. We developed our database, including 13 studies previously deposited in the GEO (https://www.ncbi.nlm.nih.gov/geo/). The website is hosted in the UFRGS data processing center (CPD) and is available at <https://www.ufrgs.br/mpsbase/>. The site was constructed in PHP, and the analyses were performed in R. The organisms represented by the datasets are Canis lupus familiaris, Homo sapiens, Mus musculus, and Rattus norvegicus. The user can search for the differentially expressed genes and ontologies by species, MPS type, or tissue type. For each comparison, a heatmap with the 50 top differentially expressed genes is available as well as dot plots for the 30 top ontologies divided by biological process, cellular component, KEGG pathways, and molecular function. This data is also fully available in tables. There are 54 possible comparisons involving about 5000 to 10,000 genes each. This website is the only specific database for MPS with filtering and presenting their results in a one-click approach to the best of our knowledge. The development of such analytical and automated strategies accessible to health professionals is essential for fostering MPS research. The MPSBase is a web user-friendly, comprehensive repository of differentially expressed genes and ontologies regarding the MPS data.",
                "authors": [
                    {
                        "name": "Giugliani R."
                    },
                    {
                        "name": "Kubaski F."
                    },
                    {
                        "name": "Matte U."
                    },
                    {
                        "name": "Soares L.D.F."
                    },
                    {
                        "name": "Villalba Silva G.C."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Molecular Genetics and Metabolism",
                "title": "MPSBase: Comprehensive repository of differentially expressed genes for mucopolysaccharidoses"
            },
            "pmid": "34147352"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
