{
    "additionDate": "2021-03-19T08:43:49Z",
    "biotoolsCURIE": "biotools:chromegcn",
    "biotoolsID": "chromegcn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jjl5sw@virginia.edu",
            "name": "Jack Lanchantin",
            "typeEntity": "Person"
        },
        {
            "email": "yanjun@virginia.edu",
            "name": "Yanjun Qi",
            "typeEntity": "Person"
        }
    ],
    "description": "ChromeGCN is a graph convolutional network for epigenetic state prediction using both sequence and 3D genome data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA profiling",
                    "uri": "http://edamontology.org/operation_3894"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QData/ChromeGCN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-22T15:24:55.678581Z",
    "name": "ChromeGCN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA793",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Predictive models of DNA chromatin profile (i.e. epigenetic state), such as transcription factor binding, are essential for understanding regulatory processes and developing gene therapies. It is known that the 3D genome, or spatial structure of DNA, is highly influential in the chromatin profile. Deep neural networks have achieved state of the art performance on chromatin profile prediction by using short windows of DNA sequences independently. These methods, however, ignore the long-range dependencies when predicting the chromatin profiles because modeling the 3D genome is challenging. Results: In this work, we introduce ChromeGCN, a graph convolutional network for chromatin profile prediction by fusing both local sequence and long-range 3D genome information. By incorporating the 3D genome, we relax the independent and identically distributed assumption of local windows for a better representation of DNA. ChromeGCN explicitly incorporates known long-range interactions into the modeling, allowing us to identify and interpret those important long-range dependencies in influencing chromatin profiles. We show experimentally that by fusing sequential and 3D genome data using ChromeGCN, we get a significant improvement over the state-of-the-art deep learning methods as indicated by three metrics. Importantly, we show that ChromeGCN is particularly useful for identifying epigenetic effects in those DNA windows that have a high degree of interactions with other DNA windows.",
                "authors": [
                    {
                        "name": "Lanchantin J."
                    },
                    {
                        "name": "Qi Y."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Graph convolutional networks for epigenetic state prediction using both sequence and 3D genome data"
            },
            "pmid": "33381816"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ]
}