{"credit":[{"email":"gorodkin@sund.ku.dk","name":"Jan Gorodkin","typeEntity":"Person","typeRoles":["Developer"]},{"name":"CBS","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"lund@cbs.dtu.dk","name":"Ole Lund","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.cbs.dtu.dk/services/distanceP/mandistanceP.html"}],"function":[{"input":[{"data":{"term":"Sequence","uri":"http://edamontology.org/data_2044"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]}],"note":"predicts distance constraints between amino acids in proteins from the amino acid sequence","operation":[{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}],"output":[{"data":{"term":"Protein structure report","uri":"http://edamontology.org/data_1537"},"format":[{"term":"Binary format","uri":"http://edamontology.org/format_2333"}]}]}],"labels":{"cost":"Free of charge (with restrictions)","license":"Other","maturity":"Emerging","operatingSystem":["Linux"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://cbs.dtu.dk/services"}],"publication":[{"abstract":"Correlations between sequence separation (in residues) and distance (in Angstrom) of any pair of amino acids in polypeptide chains are investigated. For each sequence separation we define a distance threshold. For pairs of amino acids where the distance between C alpha atoms is smaller than the threshold, a characteristic sequence (logo) motif, is found. The motifs change as the sequence separation increases: for small separations they consist of one peak located in between the two residues, then additional peaks at these residues appear, and finally the center peak smears out for very large separations. We also find correlations between the residues in the center of the motif. This and other statistical analysis are used to design neural networks with enhanced performance compared to earlier work. Importantly, the statistical analysis explains why neural networks perform better than simple statistical data-driven approaches such as pair probability density functions. The statistical results also explain characteristics of the network performance for increasing sequence separation. The improvement of the new network design is significant in the sequence separation range 10-30 residues. Finally, we find that the performance curve for increasing sequence separation is directly correlated to the corresponding information content. A WWW server, distanceP, is available at http://www.cbs.dtu.dk/services/distanceP/.","authors":["Gorodkin J.","Lund O.","Andersen C.A.","Brunak S."],"cit_count":14,"journal":"Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology","pmid":"10786291","title":"Using sequence motifs for enhanced neural network prediction of protein distance constraints.","type":"Primary","year":"1999-01-01"}],"summary":{"biotoolsCURIE":"biotools:distancep","biotoolsID":"distancep","description":"Prediction of distance constraints between amino acids in proteins from the amino acid sequence.","homepage":"http://cbs.dtu.dk/services/DistanceP","name":"DistanceP","version":["1.0"]}}