{
    "additionDate": "2018-04-28T09:47:24Z",
    "biotoolsCURIE": "biotools:shrimpgpat",
    "biotoolsID": "shrimpgpat",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://shrimpgpat.sc.mahidol.ac.th/ShrimpGPATV2/Guest/Contact.aspx"
        }
    ],
    "description": "Gene and protein annotation tool for knowledge sharing and gene discovery in shrimp.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://shrimpgpat.sc.mahidol.ac.th/ShrimpGPATV2/Guest/UserManual.aspx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "http://shrimpgpat.sc.mahidol.ac.th/ShrimpGPATV2/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ShrimpGPAT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-506",
            "metadata": {
                "abstract": "Background: Although captured and cultivated marine shrimp constitute highly important seafood in terms of both economic value and production quantity, biologists have little knowledge of the shrimp genome and this partly hinders their ability to improve shrimp aquaculture. To help improve this situation, the Shrimp Gene and Protein Annotation Tool (ShrimpGPAT) was conceived as a community-based annotation platform for the acquisition and updating of full-length complementary DNAs (cDNAs), Expressed Sequence Tags (ESTs), transcript contigs and protein sequences of penaeid shrimp and their decapod relatives and for in-silico functional annotation and sequence analysis.Description: ShrimpGPAT currently holds quality-filtered, molecular sequences of 14 decapod species (~500,000 records for six penaeid shrimp and eight other decapods). The database predominantly comprises transcript sequences derived by both traditional EST Sanger sequencing and more recently by massive-parallel sequencing technologies. The analysis pipeline provides putative functions in terms of sequence homologs, gene ontologies and protein-protein interactions. Data retrieval can be conducted easily either by a keyword text search or by a sequence query via BLAST, and users can save records of interest for later investigation using tools such as multiple sequence alignment and BLAST searches against pre-defined databases. In addition, ShrimpGPAT provides space for community insights by allowing functional annotation with tags and comments on sequences. Community-contributed information will allow for continuous database enrichment, for improvement of functions and for other aspects of sequence analysis.Conclusions: ShrimpGPAT is a new, free and easily accessed service for the shrimp research community that provides a comprehensive and up-to-date database of quality-filtered decapod gene and protein sequences together with putative functional prediction and sequence analysis tools. An important feature is its community-based functional annotation capability that allows the research community to contribute knowledge and insights about the properties of molecular sequences for better, shared, functional characterization of shrimp genes. Regularly updated and expanded with data on more decapods, ShrimpGPAT is publicly available at http://shrimpgpat.sc.mahidol.ac.th/. © 2014 Korshkari et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Korshkari P."
                    },
                    {
                        "name": "Vaiwsri S."
                    },
                    {
                        "name": "Flegel T.W."
                    },
                    {
                        "name": "Ngamsuriyaroj S."
                    },
                    {
                        "name": "Sonthayanon B."
                    },
                    {
                        "name": "Prachumwat A."
                    }
                ],
                "citationCount": 4,
                "date": "2014-06-21T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ShrimpGPAT: A gene and protein annotation tool for knowledge sharing and gene discovery in shrimp"
            },
            "pmcid": "PMC4094775",
            "pmid": "24952385"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}