{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T08:20:15.525711Z",
    "biotoolsCURIE": "biotools:l1-soul",
    "biotoolsID": "l1-soul",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Hassan Rivaz",
            "orcidid": "https://orcid.org/0000-0001-5800-3034"
        },
        {
            "name": "Md Ashikuzzaman",
            "orcidid": "https://orcid.org/0000-0001-9785-435X"
        }
    ],
    "description": "Second-Order Ultrasound Elastography With L1-Norm Spatial Regularization.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://users.encs.concordia.ca/~impact/code/",
    "lastUpdate": "2022-06-08T08:20:15.529287Z",
    "name": "L1-SOUL",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TUFFC.2022.3141686",
            "metadata": {
                "abstract": "© 1986-2012 IEEE.Time delay estimation (TDE) between two radio-frequency (RF) frames is one of the major steps of quasi-static ultrasound elastography, which detects tissue pathology by estimating its mechanical properties. Regularized optimization-based techniques, a prominent class of TDE algorithms, optimize a nonlinear energy functional consisting of data constancy and spatial continuity constraints to obtain the displacement and strain maps between the time-series frames under consideration. The existing optimization-based TDE methods often consider the {L}{2}-norm of displacement derivatives to construct the regularizer. However, such a formulation over-penalizes the displacement irregularity and poses two major issues to the estimated strain field. First, the boundaries between different tissues are blurred. Second, the visual contrast between the target and the background is suboptimal. To resolve these issues, herein, we propose a novel TDE algorithm where instead of {L}{2}-, {L}{1}-norms of both first-and second-order displacement derivatives are taken into account to devise the continuity functional. We handle the non-differentiability of {L}{1}-norm by smoothing the absolute value function's sharp corner and optimize the resulting cost function in an iterative manner. We call our technique Second-Order Ultrasound eLastography (SOUL) with the {L}{1}-norm spatial regularization ({L}{1}-SOUL). In terms of both sharpness and visual contrast, {L}{1}-SOUL substantially outperforms GLobal Ultrasound Elastography (GLUE), tOtal Variation rEgulaRization and WINDow-based time delay estimation (OVERWIND), and SOUL, three recently published TDE algorithms in all validation experiments performed in this study. In cases of simulated, phantom, and in vivo datasets, respectively, {L}{1}-SOUL achieves 67.8%, 46.81%, and 117.35% improvements of contrast-to-noise ratio (CNR) over SOUL. The {L}{1}-SOUL code can be downloaded from http://code.sonography.ai.",
                "authors": [
                    {
                        "name": "Ashikuzzaman M."
                    },
                    {
                        "name": "Rivaz H."
                    }
                ],
                "citationCount": 1,
                "date": "2022-03-01T00:00:00Z",
                "journal": "IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control",
                "title": "Second-Order Ultrasound Elastography with L1-Norm Spatial Regularization"
            },
            "pmid": "34995188"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
