
{
    "credit": [
        {
            "email": "gragon@upenn.edu",
            "name": "Tasnia Tahsin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://drive.google.com/drive/u/1/folders/0B_4ZL2GZpq2yeHRxMmRvYlNPY2s"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Virology",
                "uri": "http://edamontology.org/topic_0781"
            },
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            },
            {
                "term": "Data acquisition",
                "uri": "http://edamontology.org/topic_3077"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. GeoBoost is a command-line software package developed to address sparse or incomplete metadata in GenBank sequence records that relate to the location of the infected host (LOIH) of viruses. Given a set of GenBank accession numbers corresponding to virus GenBank records, GeoBoost extracts, integrates and normalizes geographic information reflecting the LOIH of the viruses using integrated information from GenBank metadata and related full-text publications. In addition, to facilitate probabilistic geospatial modeling, GeoBoost assigns probability scores for each possible LOIH. Availability and implementation Binaries and resources required for running GeoBoost are packed into a single zipped file and freely available for download at https://tinyurl.com/geoboost. A video tutorial is included to help users quickly and easily install and run the software. The software is implemented in Java 1.8, and supported on MS Windows and Linux platforms. Contact gragon@upenn.edu Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Tahsin T.",
                "Weissenbacher D.",
                "O'Connor K.",
                "Magge A.",
                "Scotch M.",
                "Gonzalez-Hernandez G."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx799",
            "journal": "Bioinformatics",
            "title": "GeoBoost: Accelerating research involving the geospatial metadata of virus GenBank records",
            "year": "2018-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:geoboost",
        "biotoolsID": "geoboost",
        "description": "Command-line software package developed to address sparse or incomplete metadata in GenBank sequence records that relate to the location of the infected host (LOIH) of viruses. Given a set of GenBank accession numbers corresponding to virus GenBank records, it extracts, integrates and normalizes geographic information reflecting the LOIH of the viruses using integrated information from GenBank metadata and related full-text publications.",
        "homepage": "https://drive.google.com/drive/u/1/folders/0B_4ZL2GZpq2yeHRxMmRvYlNPY2s",
        "name": "GeoBoost"
    }
}