{
    "additionDate": "2021-01-18T10:27:01Z",
    "biotoolsCURIE": "biotools:models-genesis",
    "biotoolsID": "models-genesis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jianming.liang@asu.edu",
            "typeEntity": "Person"
        }
    ],
    "description": "Generic Autodidactic Models for 3D Medical Image Analysis.\n\nWe have built a set of pre-trained models called Generic Autodidactic Models, nicknamed Models Genesis, because they are created ex nihilo (with no manual labeling), self-taught (learned by self-supervision), and generic (served as source models for generating application-specific target models). We envision that Models Genesis may serve as a primary source of transfer learning for 3D medical imaging applications, in particular, with limited annotated data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MrGiovanni/ModelsGenesis",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-02-26T09:16:58Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://tinyurl.com/ModelsGenesisFullVersion"
        }
    ],
    "name": "Models-Genesis",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/978-3-030-32251-9_42",
            "metadata": {
                "abstract": "© Springer Nature Switzerland AG 2019.Transfer learning from natural image to medical image has established as one of the most practical paradigms in deep learning for medical image analysis. However, to fit this paradigm, 3D imaging tasks in the most prominent imaging modalities (e.g., CT and MRI) have to be reformulated and solved in 2D, losing rich 3D anatomical information and inevitably compromising the performance. To overcome this limitation, we have built a set of models, called Generic Autodidactic Models, nicknamed Models Genesis, because they are created ex nihilo (with no manual labeling), self-taught (learned by self-supervision), and generic (served as source models for generating application-specific target models). Our extensive experiments demonstrate that our Models Genesis significantly outperform learning from scratch in all five target 3D applications covering both segmentation and classification. More importantly, learning a model from scratch simply in 3D may not necessarily yield performance better than transfer learning from ImageNet in 2D, but our Models Genesis consistently top any 2D approaches including fine-tuning the models pre-trained from ImageNet as well as fine-tuning the 2D versions of our Models Genesis, confirming the importance of 3D anatomical information and significance of our Models Genesis for 3D medical imaging. This performance is attributed to our unified self-supervised learning framework, built on a simple yet powerful observation: the sophisticated yet recurrent anatomy in medical images can serve as strong supervision signals for deep models to learn common anatomical representation automatically via self-supervision. As open science, all pre-trained Models Genesis are available at https://github.com/MrGiovanni/ModelsGenesis.",
                "authors": [
                    {
                        "name": "Feng R."
                    },
                    {
                        "name": "Gotway M.B."
                    },
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Rahman Siddiquee M.M."
                    },
                    {
                        "name": "Sodha V."
                    },
                    {
                        "name": "Tajbakhsh N."
                    },
                    {
                        "name": "Zhou Z."
                    }
                ],
                "citationCount": 52,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Models genesis: generic autodidactic models for 3d medical image analysis"
            },
            "pmcid": "PMC7405596",
            "pmid": "32766570"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
