{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T17:40:44.338098Z",
    "biotoolsCURIE": "biotools:rpop",
    "biotoolsID": "rpop",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Gil D.Rabinovici"
        },
        {
            "name": "Monica R.Camacho"
        },
        {
            "name": "Rachel Nosheny"
        }
    ],
    "description": "Robust PET-only processing of community acquired heterogeneous amyloid-PET data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/leoiacca/rPOP",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-05-17T17:40:44.340665Z",
    "license": "CC-BY-NC-SA-4.0",
    "name": "rPOP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2021.118775",
            "metadata": {
                "abstract": "© 2021The reference standard for amyloid-PET quantification requires structural MRI (sMRI) for preprocessing in both multi-site research studies and clinical trials. Here we describe rPOP (robust PET-Only Processing), a MATLAB-based MRI-free pipeline implementing non-linear warping and differential smoothing of amyloid-PET scans performed with any of the FDA-approved radiotracers (18F-florbetapir/FBP, 18F-florbetaben/FBB or 18F-flutemetamol/FLUTE). Each image undergoes spatial normalization based on weighted PET templates and data-driven differential smoothing, then allowing users to perform their quantification of choice. Prior to normalization, users can choose whether to automatically reset the origin of the image to the center of mass or proceed with the pipeline with the image as it is. We validate rPOP with n = 740 (514 FBP, 182 FBB, 44 FLUTE) amyloid-PET scans from the Imaging Dementia—Evidence for Amyloid Scanning – Brain Health Registry sub-study (IDEAS-BHR) and n = 1,518 scans from the Alzheimer's Disease Neuroimaging Initiative (n = 1,249 FBP, n = 269 FBB), including heterogeneous acquisition and reconstruction protocols. After running rPOP, a standard quantification to extract Standardized Uptake Value ratios and the respective Centiloids conversion was performed. rPOP-based amyloid status (using an independent pathology-based threshold of ≥24.4 Centiloid units) was compared with either local visual reads (IDEAS-BHR, n = 663 with complete valid data and reads available) or with amyloid status derived from an MRI-based PET processing pipeline (ADNI, thresholds of >20/>18 Centiloids for FBP/FBB). Finally, within the ADNI dataset, we tested the linear associations between rPOP- and MRI-based Centiloid values. rPOP achieved accurate warping for N = 2,233/2,258 (98.9%) in the first pass. Of the N = 25 warping failures, 24 were rescued with manual reorientation and origin reset prior to warping. We observed high concordance between rPOP-based amyloid status and both visual reads (IDEAS-BHR, Cohen's k = 0.72 [0.7–0.74], ∼86% concordance) or MRI-pipeline based amyloid status (ADNI, k = 0.88 [0.87–0.89], ∼94% concordance). rPOP- and MRI-pipeline based Centiloids were strongly linearly related (R2:0.95, p<0.001), with this association being significantly modulated by estimated PET resolution (β= -0.016, p<0.001). rPOP provides reliable MRI-free amyloid-PET warping and quantification, leveraging widely available software and only requiring an attenuation-corrected amyloid-PET image as input. The rPOP pipeline enables the comparison and merging of heterogeneous datasets and is publicly available at https://github.com/leoiacca/rPOP.",
                "authors": [
                    {
                        "name": "Apgar C."
                    },
                    {
                        "name": "Camacho M.R."
                    },
                    {
                        "name": "Carrillo M.C."
                    },
                    {
                        "name": "Gatsonis C."
                    },
                    {
                        "name": "Hillner B.E."
                    },
                    {
                        "name": "Iaccarino L."
                    },
                    {
                        "name": "Koeppe R."
                    },
                    {
                        "name": "La Joie R."
                    },
                    {
                        "name": "Nosheny R."
                    },
                    {
                        "name": "Rabinovici G.D."
                    },
                    {
                        "name": "Siegel B.A."
                    },
                    {
                        "name": "Whitmer R.A."
                    }
                ],
                "citationCount": 2,
                "date": "2022-02-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "rPOP: Robust PET-only processing of community acquired heterogeneous amyloid-PET data"
            },
            "pmid": "34890793"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
