{
    "additionDate": "2019-11-14T18:07:18Z",
    "biotoolsCURIE": "biotools:DROPA",
    "biotoolsID": "DROPA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "giovanni.capranico@unibo.it",
            "name": "Giovanni Capranico",
            "orcidid": "https://orcid.org/0000-0002-8708-6454",
            "typeEntity": "Person"
        }
    ],
    "description": "DRIP-seq optimized peak annotator | DROPA is a fully customizable peak-annotation tool optimized for DRIP-seq peaks, which allows a finest gene annotation based on gene expression information. Its output can easily be integrated into pipelines to perform downstream analyses, while useful and informative summary plots and statistical enrichment tests can be produced. Although it is developed for R-loop mapping, DROPA can also be used to annotate other genomic sequencing data as in the case of Histone marks IP-seq, DNAse-seq, FAIRE-seq",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marcrusso/DROPA",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-22T12:23:28Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/marcrusso/DROPA/issues"
        }
    ],
    "name": "DROPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3009-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: R-loops are three-stranded nucleic acid structures that usually form during transcription and that may lead to gene regulation or genome instability. DRIP (DNA:RNA Immunoprecipitation)-seq techniques are widely used to map R-loops genome-wide providing insights into R-loop biology. However, annotation of DRIP-seq peaks to genes can be a tricky step, due to the lack of strand information when using the common basic DRIP technique. Results: Here, we introduce DRIP-seq Optimized Peak Annotator (DROPA), a new tool for gene annotation of R-loop peaks based on gene expression information. DROPA allows a full customization of annotation options, ranging from the choice of reference datasets to gene feature definitions. DROPA allows to assign R-loop peaks to the DNA template strand in gene body with a false positive rate of less than 7%. A comparison of DROPA performance with three widely used annotation tools show that it identifies less false positive annotations than the others. Conclusions: DROPA is a fully customizable peak-annotation tool optimized for co-transcriptional DRIP-seq peaks, which allows a finest gene annotation based on gene expression information. Its output can easily be integrated into pipelines to perform downstream analyses, while useful and informative summary plots and statistical enrichment tests can be produced.",
                "authors": [
                    {
                        "name": "Capranico G."
                    },
                    {
                        "name": "Chillemi G."
                    },
                    {
                        "name": "De Lucca B."
                    },
                    {
                        "name": "Flati T."
                    },
                    {
                        "name": "Gioiosa S."
                    },
                    {
                        "name": "Russo M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DROPA: DRIP-seq optimized peak annotator"
            },
            "pmcid": "PMC6685255",
            "pmid": "31387525"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
