{
    "additionDate": "2021-06-14T13:28:12Z",
    "biotoolsCURIE": "biotools:cancercellnet",
    "biotoolsID": "cancercellnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "patrick.cahan@jhmi.edu",
            "name": "Patrick Cahan",
            "orcidid": "https://orcid.org/0000-0003-3652-2540",
            "typeEntity": "Person"
        }
    ],
    "description": "CancerCellNet is a R package that allows cancer type classification and evaluation of transcriptional fidelity for cancer models across species and platform (bulk RNA-seq, microarray). Alternatively, you can visit our web-app. You can also read about the applications of CancerCellNet in our bioRxiv preprint.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.cahanlab.org/resources/cancerCellNet_web",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-08-18T11:27:28.603351Z",
    "license": "MIT",
    "link": [
        {
            "note": "cancerCellNet R package",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pcahan1/cancerCellNet"
        },
        {
            "note": "cancerCellNet R package",
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/pcahan1/cancerCellNet/issues"
        }
    ],
    "name": "CancerCellNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13073-021-00888-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Cancer researchers use cell lines, patient-derived xenografts, engineered mice, and tumoroids as models to investigate tumor biology and to identify therapies. The generalizability and power of a model derive from the fidelity with which it represents the tumor type under investigation; however, the extent to which this is true is often unclear. The preponderance of models and the ability to readily generate new ones has created a demand for tools that can measure the extent and ways in which cancer models resemble or diverge from native tumors. Methods: We developed a machine learning-based computational tool, CancerCellNet, that measures the similarity of cancer models to 22 naturally occurring tumor types and 36 subtypes, in a platform and species agnostic manner. We applied this tool to 657 cancer cell lines, 415 patient-derived xenografts, 26 distinct genetically engineered mouse models, and 131 tumoroids. We validated CancerCellNet by application to independent data, and we tested several predictions with immunofluorescence. Results: We have documented the cancer models with the greatest transcriptional fidelity to natural tumors, we have identified cancers underserved by adequate models, and we have found models with annotations that do not match their classification. By comparing models across modalities, we report that, on average, genetically engineered mice and tumoroids have higher transcriptional fidelity than patient-derived xenografts and cell lines in four out of five tumor types. However, several patient-derived xenografts and tumoroids have classification scores that are on par with native tumors, highlighting both their potential as faithful model classes and their heterogeneity. Conclusions: CancerCellNet enables the rapid assessment of transcriptional fidelity of tumor models. We have made CancerCellNet available as a freely downloadable R package (https://github.com/pcahan1/cancerCellNet) and as a web application (http://www.cahanlab.org/resources/cancerCellNet_web) that can be applied to new cancer models that allows for direct comparison to the cancer models evaluated here.",
                "authors": [
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Gleyzer R."
                    },
                    {
                        "name": "Tai W.-H."
                    },
                    {
                        "name": "Kumar P."
                    },
                    {
                        "name": "Bian Q."
                    },
                    {
                        "name": "Isaacs B."
                    },
                    {
                        "name": "da Rocha E.L."
                    },
                    {
                        "name": "Cai S."
                    },
                    {
                        "name": "DiNapoli K."
                    },
                    {
                        "name": "Huang F.W."
                    },
                    {
                        "name": "Cahan P."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Evaluating the transcriptional fidelity of cancer models"
            },
            "pmcid": "PMC8086312",
            "pmid": "33926541"
        }
    ],
    "toolType": [
        "Web application",
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}