{
    "accessibility": "Open access",
    "additionDate": "2022-09-14T21:34:01.916855Z",
    "biotoolsCURIE": "biotools:hicimpute",
    "biotoolsID": "hicimpute",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shili@stat.osu.edu",
            "name": "Shili Lin",
            "orcidid": "https://orcid.org/0000-0003-2467-4491",
            "typeEntity": "Person"
        },
        {
            "name": "Chenggong Han"
        },
        {
            "name": "Qing Xie"
        },
        {
            "name": "Victor Jin",
            "orcidid": "https://orcid.org/0000-0002-8765-3471"
        }
    ],
    "description": "A Bayesian hierarchical model for identifying structural zeros and enhancing single cell Hi-C data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sl-lin/HiCImpute",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2022-09-14T21:34:01.919250Z",
    "license": "Not licensed",
    "name": "HiCImpute",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010129",
            "metadata": {
                "abstract": "© 2022 Xie et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Single cell Hi-C techniques enable one to study cell to cell variability in chromatin interactions. However, single cell Hi-C (scHi-C) data suffer severely from sparsity, that is, the existence of excess zeros due to insufficient sequencing depth. Complicating the matter further is the fact that not all zeros are created equal: some are due to loci truly not interacting because of the underlying biological mechanism (structural zeros); others are indeed due to insufficient sequencing depth (sampling zeros or dropouts), especially for loci that interact infrequently. Differentiating between structural zeros and dropouts is important since correct inference would improve downstream analyses such as clustering and discovery of subtypes. Nevertheless, distinguishing between these two types of zeros has received little attention in the single cell Hi-C literature, where the issue of sparsity has been addressed mainly as a data quality improvement problem. To fill this gap, in this paper, we propose HiCImpute, a Bayesian hierarchical model that goes beyond data quality improvement by also identifying observed zeros that are in fact structural zeros. HiCImpute takes spatial dependencies of scHi-C 2D data structure into account while also borrowing information from similar single cells and bulk data, when such are available. Through an extensive set of analyses of synthetic and real data, we demonstrate the ability of HiCImpute for identifying structural zeros with high sensitivity, and for accurate imputation of dropout values. Downstream analyses using data improved from HiCImpute yielded much more accurate clustering of cell types compared to using observed data or data improved by several comparison methods. Most significantly, HiCImpute-improved data have led to the identification of subtypes within each of the excitatory neuronal cells of L4 and L5 in the prefrontal cortex.",
                "authors": [
                    {
                        "name": "Han C."
                    },
                    {
                        "name": "Jin V."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Xie Q."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "HiCImpute: A Bayesian hierarchical model for identifying structural zeros and enhancing single cell Hi-C data"
            },
            "pmcid": "PMC9232133",
            "pmid": "35696429"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}
