{"credit":[{"email":"roald@rossnes.org","name":"Roald Rossnes","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.rossnes.org/phyrex/doc.html"}],"function":[{"operation":[{"term":"Phylogenetic tree reconstruction","uri":"http://edamontology.org/operation_3478"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/phyrex-1-1-reconstruction-continuous-character-trait-values-nodes-phylogenetic-trees.html"}],"publication":[{"abstract":"Background: As genomes evolve after speciation, gene content, coding sequence, gene expression, and splicing all diverge with time from ancestors with close relatives. A minimum evolution general method for continuous character analysis in a phylogenetic perspective is presented that allows for reconstruction of ancestral character states and for measuring along branch evolution. Results: A software package for reconstruction of continuous character traits, like relative gene expression levels or alternative splice site usage data is presented and is available for download at http://www.rossnes.org/phyrex. This program was applied to a primate gene expression dataset to detect transcription factor binding sites that have undergone substitution, potentially having driven lineage-specific differences in gene expression. Conclusion: Systematic analysis of lineage-specific evolution is becoming the cornerstone of comparative genomics. New methods, like phyrex, extend the capabilities of comparative genomics by tracing the evolution of additional biomolecular processes. © 2005 Rossnes et al., licensee BioMed Central Ltd.","authors":["Rossness R.","Eidhammer I.","Liberles D.A."],"cit_count":9,"journal":"BMC Bioinformatics","pmid":"15921519","title":"Phylogenetic reconstruction of ancestral character states for gene expression and mRNA splicing data","year":"2005-05-27"}],"summary":{"biotoolsCURIE":"biotools:phyrex","biotoolsID":"phyrex","description":"Program for reconstructing ancestral gene expression profiles and sequence data on a given phylogenetic tree. The program uses a Minimum Evolution algorithm to reconstruct the gene expression profiles and a combination of BaseML and ClustalW to reconstruct the ancestral sequences.","homepage":"http://www.rossnes.org/phyrex/","name":"Phyrex"}}