{
    "additionDate": "2022-09-26T07:16:45.227846Z",
    "biotoolsCURIE": "biotools:ametarisk",
    "biotoolsID": "ametarisk",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "panyou001@yahoo.com",
            "name": "Pan You",
            "typeEntity": "Person"
        },
        {
            "name": "Zhi-Liang Ji",
            "typeEntity": "Person"
        }
    ],
    "description": "AmetaRisk is an online tool for quantitative assessment of CRC metastasis risk based on the local invasion.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://www.bio-add.org/AmetaRisk",
    "lastUpdate": "2022-09-26T07:16:45.230432Z",
    "license": "Other",
    "name": "AmetaRisk",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FONC.2022.898117",
            "metadata": {
                "abstract": "Copyright © 2022 Ding, Zhang, Wu, You, Fang, Li, Zhang and Ji.Metastasis is the main fatal cause of colorectal cancer (CRC). Although enormous efforts have been made to date to identify biomarkers associated with metastasis, there is still a huge gap to translate these efforts into effective clinical applications due to the poor consistency of biomarkers in dealing with the genetic heterogeneity of CRCs. In this study, a small cohort of eight CRC patients was recruited, from whom we collected cancer, paracancer, and normal tissues simultaneously and performed whole-exome sequencing. Given the exomes, a novel statistical parameter LIP was introduced to quantitatively measure the local invasion power for every somatic and germline mutation, whereby we affirmed that the innate germline mutations instead of somatic mutations might serve as the major driving force in promoting local invasion. Furthermore, via bioinformatic analyses of big data derived from the public zone, we identified ten potential driver variants that likely urged the local invasion of tumor cells into nearby tissue. Of them, six corresponding genes were new to CRC metastasis. In addition, a metastasis resister variant was also identified. Based on these eleven variants, we constructed a logistic regression model for rapid risk assessment of early metastasis, which was also deployed as an online server, AmetaRisk (http://www.bio-add.org/AmetaRisk). In summary, we made a valuable attempt in this study to exome-wide explore the genetic driving force to local invasion, which provides new insights into the mechanistic understanding of metastasis. Furthermore, the risk assessment model can assist in prioritizing therapeutic regimens in clinics and discovering new drug targets, and thus substantially increase the survival rate of CRC patients.",
                "authors": [
                    {
                        "name": "Ding R.-F."
                    },
                    {
                        "name": "Fang Z.-X."
                    },
                    {
                        "name": "Ji Z.-L."
                    },
                    {
                        "name": "Li Z.-Y."
                    },
                    {
                        "name": "Wu L.-Y."
                    },
                    {
                        "name": "You P."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Z.-Y."
                    }
                ],
                "date": "2022-06-20T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "Discovering Innate Driver Variants for Risk Assessment of Early Colorectal Cancer Metastasis"
            },
            "pmcid": "PMC9252167",
            "pmid": "35795065"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
