{
    "additionDate": "2018-04-28T10:04:04Z",
    "biotoolsCURIE": "biotools:tssar",
    "biotoolsID": "tssar",
    "credit": [
        {
            "email": "tssar@tbi.univie.ac.at",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for automated de novo TSS annotation from dRNA-seq data that respects the statistics of dRNA-seq libraries.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nibiru.tbi.univie.ac.at/TSSAR/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "http://rna.tbi.univie.ac.at/TSSAR",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "TSSAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-89",
            "metadata": {
                "abstract": "Background: Differential RNA sequencing (dRNA-seq) is a high-throughput screening technique designed to examine the architecture of bacterial operons in general and the precise position of transcription start sites (TSS) in particular. Hitherto, dRNA-seq data were analyzed by visualizing the sequencing reads mapped to the reference genome and manually annotating reliable positions. This is very labor intensive and, due to the subjectivity, biased.Results: Here, we present TSSAR, a tool for automated de novo TSS annotation from dRNA-seq data that respects the statistics of dRNA-seq libraries. TSSAR uses the premise that the number of sequencing reads starting at a certain genomic position within a transcriptional active region follows a Poisson distribution with a parameter that depends on the local strength of expression. The differences of two dRNA-seq library counts thus follow a Skellam distribution. This provides a statistical basis to identify significantly enriched primary transcripts.We assessed the performance by analyzing a publicly available dRNA-seq data set using TSSAR and two simple approaches that utilize user-defined score cutoffs. We evaluated the power of reproducing the manual TSS annotation. Furthermore, the same data set was used to reproduce 74 experimentally validated TSS in H. pylori from reliable techniques such as RACE or primer extension. Both analyses showed that TSSAR outperforms the static cutoff-dependent approaches.Conclusions: Having an automated and efficient tool for analyzing dRNA-seq data facilitates the use of the dRNA-seq technique and promotes its application to more sophisticated analysis. For instance, monitoring the plasticity and dynamics of the transcriptomal architecture triggered by different stimuli and growth conditions becomes possible.The main asset of a novel tool for dRNA-seq analysis that reaches out to a broad user community is usability. As such, we provide TSSAR both as intuitive RESTful Web service (http://rna.tbi.univie.ac.at/TSSAR) together with a set of post-processing and analysis tools, as well as a stand-alone version for use in high-throughput dRNA-seq data analysis pipelines. © 2014 Amman et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Amman F."
                    },
                    {
                        "name": "Findeiss S."
                    },
                    {
                        "name": "Hofacker I.L."
                    },
                    {
                        "name": "Lorenz R."
                    },
                    {
                        "name": "Stadler P.F."
                    },
                    {
                        "name": "Wolfinger M.T."
                    }
                ],
                "citationCount": 33,
                "date": "2014-03-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TSSAR: TSS annotation regime for dRNA-seq data"
            },
            "pmcid": "PMC4098767",
            "pmid": "24674136"
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
