{
    "accessibility": "Open access",
    "additionDate": "2021-11-11T20:38:36.349387Z",
    "biotoolsCURIE": "biotools:kscv",
    "biotoolsID": "kscv",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nh1212@hit.edu.cn",
            "name": "Huan Nie",
            "typeEntity": "Person"
        },
        {
            "email": "qhjiang@hit.edu.cn",
            "name": "Qinghua Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "KIRC-specific Stemness Calculator and Visualization (KSCV) is a computational framework that quantitates the stemness level of samples from RNA-Seq data in KIRC. By modeling the expression matrix by which genes are produced significant abnormal alternative splicing in RNA-Seq, the KSCV model uses one-class logistic regression to estimate the stemness index of KIRC patients.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://jiang-lab.shinyapps.io/kscv/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression matrix",
                        "uri": "http://edamontology.org/data_3112"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                }
            ]
        }
    ],
    "homepage": "https://jiang-lab.shinyapps.io/kscv/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-11T20:38:36.351931Z",
    "name": "KSCV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12885-021-08470-8",
            "metadata": {
                "abstract": "© 2021, The Author(s).Backgroud: Cancer stemness is associated with metastases in kidney renal clear cell carcinoma (KIRC) and negatively correlates with immune infiltrates. Recent stemness evaluation methods based on the absolute expression have been proposed to reveal the relationship between stemness and cancer. However, we found that existing methods do not perform well in assessing the stemness of KIRC patients, and they overlooked the impact of alternative splicing. Alternative splicing not only progresses during the differentiation of stem cells, but also changes during the acquisition of the stemness features of cancer stem cells. There is an urgent need for a new method to predict KIRC-specific stemness more accurately, so as to provide help in selecting treatment options. Methods: The corresponding RNA-Seq data were obtained from the The Cancer Genome Atlas (TCGA) data portal. We also downloaded stem cell RNA sequence data from the Progenitor Cell Biology Consortium (PCBC) Synapse Portal. Independent validation sets with large sample size and common clinic pathological characteristics were obtained from the Gene Expression Omnibus (GEO) database. we constructed a KIRC-specific stemness prediction model using an algorithm called one-class logistic regression based on the expression and alternative splicing data to predict stemness indices of KIRC patients, and the model was externally validated. We identify stemness-associated alternative splicing events (SASEs) by analyzing different alternative splicing event between high- and low- stemness groups. Univariate Cox and multivariable logistic regression analysisw as carried out to detect the prognosis-related SASEs respectively. The area under curve (AUC) of receiver operating characteristic (ROC) was performed to evaluate the predictive values of our model. Results: Here, we constructed a KIRC-specific stemness prediction model with an AUC of 0.968,and to provide a user-friendly interface of our model for KIRC stemness analysis, we have developed KIRC Stemness Calculator and Visualization (KSCV), hosted on the Shiny server, can most easily be accessed via web browser and the url https://jiang-lab.shinyapps.io/kscv/. When applied to 605 KIRC patients, our stemness indices had a higher correlation with the gender, smoking history and metastasis of the patients than the previous stemness indices, and revealed intratumor heterogeneity at the stemness level. We identified 77 novel SASEs by dividing patients into high- and low- stemness groups with significantly different outcome and they had significant correlations with expression of 17 experimentally validated splicing factors. Both univariate and multivariate survival analysis demonstrated that SASEs closely correlated with the overall survival of patients. Conclusions: Basing on the stemness indices, we found that not only immune infiltration but also alternative splicing events showed significant different at the stemness level. More importantly, we highlight the critical role of these differential alternative splicing events in poor prognosis, and we believe in the potential for their further translation into targets for immunotherapy.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Cheng R."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Jiang Q."
                    },
                    {
                        "name": "Jin X."
                    },
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Ma K."
                    },
                    {
                        "name": "Nie H."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Xiao L."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Zhou W."
                    },
                    {
                        "name": "Zou G."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Cancer",
                "title": "Alternative splicing associated with cancer stemness in kidney renal clear cell carcinoma"
            },
            "pmcid": "PMC8204412",
            "pmid": "34130646"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
