{
    "additionDate": "2019-11-14T19:53:44Z",
    "biotoolsCURIE": "biotools:NPMA",
    "biotoolsID": "NPMA",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | A Novel Privacy-Preserving Mutual Authentication in TMIS for Mobile Edge-Cloud Architecture | Mobile Edge-Cloud Network is a new network structure after fog-cloud computing, where service and data computing are scattered in the most logical, nearby and efficient place. It provides better services than fog-cloud computing with better performance in reasonably low cost way and allows users to eliminate numerous limitations inherent in fog-cloud computing, although it inherits those security-privacy issues from fog-cloud computing. A novel privacy-preserving mutual authentication in TMIS for mobile Edge-Cloud architecture (abbreviated to NPMA) is constructed in this paper. NPMA scheme not only mitigates some weaknesses of fog-cloud computing, but has other advantages",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31522286",
    "lastUpdate": "2019-11-14T19:53:44Z",
    "name": "NPMA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S10916-019-1444-9",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.Mobile Edge-Cloud Network is a new network structure after fog-cloud computing, where service and data computing are scattered in the most logical, nearby and efficient place. It provides better services than fog-cloud computing with better performance in reasonably low cost way and allows users to eliminate numerous limitations inherent in fog-cloud computing, although it inherits those security-privacy issues from fog-cloud computing. A novel privacy-preserving mutual authentication in TMIS for mobile Edge-Cloud architecture (abbreviated to NPMA) is constructed in this paper. NPMA scheme not only mitigates some weaknesses of fog-cloud computing, but has other advantages. First, NPMA scheme supports patients(edge-servers) anonymity and forward-backward untraceability (traceability, when needed), since their identities are hidden in two distinct dynamic anonyms and a static one and only the trusted center can recover their real identities, when needed. Second, each edge-server shares a secret value, which realizes authentication with extremely low computional cost in authentication phase. Finally, NPMA scheme is proven safely against passive and active attacks under elliptic curve computable Diffie-Hellman problem (ECDHP) assumption in random oracle model. Hence, it achieves the required security properties and outperforms prior approaches in terms of energy and computational costs.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Ma W."
                    },
                    {
                        "name": "Cao H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Journal of Medical Systems",
                "title": "NPMA: A Novel Privacy-Preserving Mutual Authentication in TMIS for Mobile Edge-Cloud Architecture"
            },
            "pmid": "31522286"
        }
    ]
}