{
    "additionDate": "2018-05-09T16:22:57Z",
    "biotoolsCURIE": "biotools:tarsvm",
    "biotoolsID": "tarsvm",
    "credit": [
        {
            "email": "mgsamps@med.umich.edu",
            "name": "Sampson MG",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This increases the accuracy of variant calling when using microfluidic PCR based targeted sequencing approaches.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/christopher-gillies/TargetSpecificGATKSequencingPipeline"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/christopher-gillies/TargetSpecificGATKSequencingPipeline",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "tarSVM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1108-4",
            "metadata": {
                "abstract": "© 2016 Gillies et al.Background: Targeted sequencing of discrete gene sets is a cost effective strategy to screen subjects for monogenic forms of disease. One method to achieve this pairs microfluidic PCR with next generation sequencing. The PCR step of this pipeline creates challenges in accurate variant calling. This includes that most reads targeting a specific exon are duplicates that have been amplified from the PCR step. To reduce false positive variant calls from these experiments, previous studies have used threshold-based filtering of alternative allele depth ratio and manual inspection of the alignments. However even after manual inspection and filtering, many variants fail to be validated via Sanger sequencing. To improve the accuracy of variant calling from these experiments, we are challenged to design a variant filtering strategy that sufficiently models microfluidic PCR-specific issues. Results: We developed an open source variant filtering pipeline, targeted sequencing support vector machine (\"tarSVM\"), that uses a Support Vector Machine (SVM) and a new score the normalized allele dosage test to identify high quality variants from microfluidic PCR data. tarSVM maximizes training knowledge by selecting variants that are likely true and likely false variants by incorporating knowledge from the 1000 Genomes and the Exome Aggregation Consortium projects. tarSVM improves on previous approaches by synthesizing variant features from the Genome Analysis Toolkit and allele dosage information. We compared the accuracy of tarSVM versus existing variant quality filtering strategies on two cohorts (n=474 and n=1152), and validated our method on a third cohort (n=75). In the first cohort, our method achieved 84.5 % accuracy of predicting whether or not a variant would be validated with Sanger sequencing versus 78.8 % for the second most accurate method. In the second cohort, our method had an accuracy of 73.3 %, versus 61.5 % for the second best method. Finally, our method had a false discovery rate of 5 % for the validation cohort. Conclusions: tarSVM increases the accuracy of variant calling when using microfluidic PCR based targeted sequencing approaches. This results in higher confidence downstream analyses, and ultimately reduces the costs Sanger validation. Our approach is less labor intensive than existing approaches, and is available as an open source pipeline for read trimming, aligning, variant calling, and variant quality filtering on GitHub at https://github.com/christopher-gillies/TargetSpecificGATKSequencingPipeline.",
                "authors": [
                    {
                        "name": "Bhimma R."
                    },
                    {
                        "name": "Crawford B."
                    },
                    {
                        "name": "Gharavi A."
                    },
                    {
                        "name": "Gillies C.E."
                    },
                    {
                        "name": "Kang H.M."
                    },
                    {
                        "name": "Otto E.A."
                    },
                    {
                        "name": "Robertson C.C."
                    },
                    {
                        "name": "Sampson M.G."
                    },
                    {
                        "name": "Sanna-Cherchi S."
                    },
                    {
                        "name": "Vega-Warner V."
                    },
                    {
                        "name": "Winkler C."
                    }
                ],
                "citationCount": 2,
                "date": "2016-06-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "tarSVM: Improving the accuracy of variant calls derived from microfluidic PCR-based targeted next generation sequencing using a support vector machine"
            },
            "pmcid": "PMC4902911",
            "pmid": "27287006"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
