{
    "additionDate": "2021-01-20T10:53:36Z",
    "biotoolsCURIE": "biotools:emodel-bdb",
    "biotoolsID": "emodel-bdb",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michal@brylinski.org",
            "name": "Michal Brylinski",
            "orcidid": "https://orcid.org/0000-0002-6204-2869",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of comparative structure models of drug-target interactions from the Binding Database.\n\nComputational Systems Biology Group.\n\nA database of 200,005 comparative models of drug-bound proteins based on 1,391,403 interaction data obtained from the Binding Database. Complex models in eModel-BDB were generated with a collection of the state-of-the-art techniques, including protein meta-threading, template-based structure modeling, refinement and binding site detection, and ligand similarity-based docking.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                }
            ]
        }
    ],
    "homepage": "http://brylinski.org/emodel-bdb-0",
    "lastUpdate": "2021-05-14T06:37:22Z",
    "name": "eModel-BDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIY091",
            "metadata": {
                "abstract": "Background: The structural information on proteins in their ligand-bound conformational state is invaluable for protein function studies and rational drug design. Compared to the number of available sequences, not only is the repertoire of the experimentally determined structures of holo-proteins limited, these structures do not always include pharmacologically relevant compounds at their binding sites. In addition, binding affinity databases provide vast quantities of information on interactions between drug-like molecules and their targets, however, often lacking structural data. On that account, there is a need for computational methods to complement existing repositories by constructing the atomic-level models of drug-protein assemblies that will not be determined experimentally in the near future. Results: We created eModel-BDB, a database of 200,005 comparative models of drug-bound proteins based on 1,391,403 interaction data obtained from the Binding Database and the PDB library of 31 January 2017. Complex models in eModel-BDB were generated with a collection of the state-of-the-art techniques, including protein meta-threading, template-based structure modeling, refinement and binding site detection, and ligand similarity-based docking. In addition to a rigorous quality control maintained during dataset generation, a subset of weakly homologous models was selected for the retrospective validation against experimental structural data recently deposited to the Protein Data Bank. Validation results indicate that eModel-BDB contains models that are accurate not only at the global protein structure level but also with respect to the atomic details of bound ligands. Conclusions: Freely available eModel-BDB can be used to support structure-based drug discovery and repositioning, drug target identification, and protein structure determination.",
                "authors": [
                    {
                        "name": "Naderi M."
                    },
                    {
                        "name": "Govindaraj R.G."
                    },
                    {
                        "name": "Brylinski M."
                    }
                ],
                "citationCount": 4,
                "date": "2018-08-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "eModel-BDB: a database of comparative structure models of drug-target interactions from the Binding Database"
            },
            "pmcid": "PMC6131211",
            "pmid": "30052959"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}