{
    "additionDate": "2022-01-10T14:22:27.282986Z",
    "biotoolsCURIE": "biotools:santia",
    "biotoolsID": "santia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "muftimahmud@gmail.com",
            "name": "Mufti Mahmud",
            "orcidid": "https://orcid.org/0000-0002-2037-8348",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SANTIA is a Matlab-based open-source toolbox for artifact detection and removal from extracellular neuronal signals. Neuronal signals generally represent activation of the neuronal networks and give insights into brain functionalities. They are considered as fingerprints of actions and their processing across different structures of the brain. These recordings generate a large volume of data that are susceptible to noise and artifacts. Therefore, the review of these data to ensure high quality by automatically detecting and removing the artifacts is imperative. Toward this aim, this work proposes a custom-developed automatic artifact removal toolbox named, SANTIA (SigMate Advanced: a Novel Tool for Identification of Artifacts in Neuronal Signals). Developed in Matlab, SANTIA is an open-source toolbox that applies neural network-based machine learning techniques to label and train models to detect artifacts from the invasive neuronal signals known as local field potentials.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/IgnacioFabietti/SANTIAtoolbox",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-01-10T14:22:27.285622Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/IgnacioFabietti/SANTIAtoolbox/issues"
        }
    ],
    "name": "SANTIA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S40708-021-00135-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Neuronal signals generally represent activation of the neuronal networks and give insights into brain functionalities. They are considered as fingerprints of actions and their processing across different structures of the brain. These recordings generate a large volume of data that are susceptible to noise and artifacts. Therefore, the review of these data to ensure high quality by automatically detecting and removing the artifacts is imperative. Toward this aim, this work proposes a custom-developed automatic artifact removal toolbox named, SANTIA (SigMate Advanced: a Novel Tool for Identification of Artifacts in Neuronal Signals). Developed in Matlab, SANTIA is an open-source toolbox that applies neural network-based machine learning techniques to label and train models to detect artifacts from the invasive neuronal signals known as local field potentials.",
                "authors": [
                    {
                        "name": "Fabietti M."
                    },
                    {
                        "name": "Mahmud M."
                    },
                    {
                        "name": "Lotfi A."
                    },
                    {
                        "name": "Kaiser M.S."
                    },
                    {
                        "name": "Averna A."
                    },
                    {
                        "name": "Guggenmos D.J."
                    },
                    {
                        "name": "Nudo R.J."
                    },
                    {
                        "name": "Chiappalone M."
                    },
                    {
                        "name": "Chen J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Brain Informatics",
                "title": "SANTIA: a Matlab-based open-source toolbox for artifact detection and removal from extracellular neuronal signals"
            },
            "pmcid": "PMC8292498",
            "pmid": "34283328",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}