
{
    "credit": [
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "giulio.pavesi@unimi.it",
            "name": "Giulio Pavesi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "federico.zambelli@unimi.it",
            "name": "Federico Zambelli",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://159.149.160.88/cscan/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence database search (by property)",
                    "uri": "http://edamontology.org/operation_0349"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "MoD Tools"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The regulation of transcription of eukaryotic genes is a very complex process, which involves interactions between transcription factors (TFs) and DNA, as well as other epigenetic factors like histone modifications, DNA methylation, and so on, which nowadays can be studied and characterized with techniques like ChIP-Seq. Cscan is a web resource that includes a large collection of genome-wide ChIP-Seq experiments performed on TFs, histone modifications, RNA polymerases and others. Enriched peak regions from the ChIP-Seq experiments are crossed with the genomic coordinates of a set of input genes, to identify which of the experiments present a statistically significant number of peaks within the input genes' loci. The input can be a cluster of co-expressed genes, or any other set of genes sharing a common regulatory profile. Users can thus single out which TFs are likely to be common regulators of the genes, and their respective correlations. Also, by examining results on promoter activation, transcription, histone modifications, polymerase binding and so on, users can investigate the effect of the TFs (activation or repression of transcription) as well as of the cell or tissue specificity of the genes' regulation and expression. The web interface is free for use, and there is no login requirement. Available at: http://www.beaconlab.it/cscan. © 2012 The Author(s).",
            "authors": [
                "Zambelli F.",
                "Prazzoli G.M.",
                "Pesole G.",
                "Pavesi G."
            ],
            "cit_count": 23,
            "doi": "10.1093/nar/gks483",
            "journal": "Nucleic Acids Research",
            "title": "Cscan: Finding common regulators of a set of genes by using a collection of genome-wide ChIP-seq datasets",
            "type": "Primary",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cscan",
        "biotoolsID": "cscan",
        "description": "Web resource that includes a large collection of genome-wide ChIP-Seq experiments performed on TFs, histone modifications, RNA polymerases and others. Enriched peak regions from the ChIP-Seq experiments are crossed with the genomic coordinates of a set of input genes, to identify which of the experiments present a statistically significant number of peaks within the input genes’ loci.",
        "homepage": "http://www.beaconlab.it/cscan",
        "name": "Cscan",
        "version": [
            "1.2"
        ]
    }
}