{
    "additionDate": "2021-03-19T08:47:16Z",
    "biotoolsCURIE": "biotools:mr-tim",
    "biotoolsID": "mr-tim",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Dante Mantini",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated Head Tissue Modelling Based on Structural Magnetic Resonance Images for Electroencephalographic Source Reconstruction.\n\nMR-TIM: MR-based head tissue modelling is open source MATLAB software for head tissue modelling from structural magnetic resonance (MR) images.\n\nIt performs automated segmentation of whole-head T1-weighted MR images in 12 tissues:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://www.nitrc.org/projects/mr-tim",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-04-11T11:10:21.585451Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gtaberna/mrtim"
        }
    ],
    "name": "MR-TIM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S12021-020-09504-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).In the last years, technological advancements for the analysis of electroencephalography (EEG) recordings have permitted to investigate neural activity and connectivity in the human brain with unprecedented precision and reliability. A crucial element for accurate EEG source reconstruction is the construction of a realistic head model, incorporating information on electrode positions and head tissue distribution. In this paper, we introduce MR-TIM, a toolbox for head tissue modelling from structural magnetic resonance (MR) images. The toolbox consists of three modules: 1) image pre-processing – the raw MR image is denoised and prepared for further analyses; 2) tissue probability mapping – template tissue probability maps (TPMs) in individual space are generated from the MR image; 3) tissue segmentation – information from all the TPMs is integrated such that each voxel in the MR image is assigned to a specific tissue. MR-TIM generates highly realistic 3D masks, five of which are associated with brain structures (brain and cerebellar grey matter, brain and cerebellar white matter, and brainstem) and the remaining seven with other head tissues (cerebrospinal fluid, spongy and compact bones, eyes, muscle, fat and skin). Our validation, conducted on MR images collected in healthy volunteers and patients as well as an MR template image from an open-source repository, demonstrates that MR-TIM is more accurate than alternative approaches for whole-head tissue segmentation. We hope that MR-TIM, by yielding an increased precision in head modelling, will contribute to a more widespread use of EEG as a brain imaging technique.",
                "authors": [
                    {
                        "name": "Taberna G.A."
                    },
                    {
                        "name": "Samogin J."
                    },
                    {
                        "name": "Mantini D."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "Automated Head Tissue Modelling Based on Structural Magnetic Resonance Images for Electroencephalographic Source Reconstruction"
            },
            "pmid": "33506384"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}