{
    "additionDate": "2019-11-14T18:44:02Z",
    "biotoolsCURIE": "biotools:T1D",
    "biotoolsID": "T1D",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aalbanese@ufl.edu",
            "name": "Anastasia Albanese-O'Neill",
            "orcidid": "https://orcid.org/0000-0001-8219-6059",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'mDAD', 'T1DToolkit.org' | Designing Online and Mobile Diabetes Education for Fathers of Children With Type 1 Diabetes | T1D Toolkit – Manage Diabetes Better | Research QuestionBlog Post FeedbackTech Support | This field is for validation purposes and should be left unchanged",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://T1DToolkit.org",
    "lastUpdate": "2020-12-27T14:00:34Z",
    "name": "T1D",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2196/13724",
            "metadata": {
                "abstract": "© Anastasia Albanese-O'Neill, Desmond A Schatz, Nicole Thomas, Jay M Bernhardt, Christa L Cook, Michael J Haller, Angelina V Bernier, Janet H Silverstein, Sarah C Westen, Jennifer H Elder. Originally published in JMIR Diabetes (http://diabetes.jmir.org),06.08.2019. This is an open-access article distributed under the terms of the Creative Commons Attribution License (https://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided the original work, first published in JMIR Diabetes, is properly cited. The complete bibliographic information, a link to the original publication on http://diabetes.jmir.org/, as well as this copyright and license information must be included.Background: Fathers make unique and central contributions to the health of their children. However, research in type 1 diabetes (T1D) education largely ignores the needs of fathers, including during the development of online and mobile educational materials. Objective: The purpose of this study was to solicit and incorporate input from fathers of children with T1D into the design, content, and infrastructure of a suite of online diabetes self-management education and support (DSMES) resources. Methods: The study took part in three phases: (1) exploratory research, (2) website and subdomain development, and (3) evaluation. Fathers of children with T1D (n=30) completed surveys and semistructured qualitative interviews. Thematic content analysis was used to identify fathers' content and design preferences. An online DSMES website (T1DToolkit.org) and a separate mobile subdomain targeting fathers (Mobile Diabetes Advice for Dads, or mDAD) were developed. A prototype of the site for fathers was evaluated by 33 additional father participants. End user feedback was elicited via survey. Results: Participants in the exploratory phase were enthusiastic about the online diabetes resources. Preferences included high-quality design, availability via mobile phone and tablet, brief text content supplemented with multimedia and interactive features, reminders via text or email, endorsement by medical professionals, and links to scientific evidence. The mDAD subdomain received high usability and acceptability ratings, with 100% of participants very likely or likely to use the site again. Conclusions: The development of eHealth educational platforms for fathers of children with T1D remains an unmet need in optimizing diabetes management. This study incorporated fathers' feedback into the development of a suite of online diabetes education resources. The findings will serve as the basis for future research to assess the clinical efficacy of the website, its subdomain targeting fathers, and additional subdomains targeting unique populations.",
                "authors": [
                    {
                        "name": "Albanese-O'Neill A."
                    },
                    {
                        "name": "Schatz D.A."
                    },
                    {
                        "name": "Thomas N."
                    },
                    {
                        "name": "Bernhardt J.M."
                    },
                    {
                        "name": "Cook C.L."
                    },
                    {
                        "name": "Haller M.J."
                    },
                    {
                        "name": "Bernier A.V."
                    },
                    {
                        "name": "Silverstein J.H."
                    },
                    {
                        "name": "Westen S.C."
                    },
                    {
                        "name": "Elder J.H."
                    }
                ],
                "citationCount": 5,
                "date": "2019-07-01T00:00:00Z",
                "journal": "JMIR Diabetes",
                "title": "Designing online and mobile diabetes education for fathers of children with type 1 diabetes: Mixed methods study"
            },
            "pmcid": "PMC6701161",
            "pmid": "31389338"
        }
    ],
    "topic": [
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}