{
    "additionDate": "2020-01-09T18:05:24Z",
    "biotoolsCURIE": "biotools:ChaRTr",
    "biotoolsID": "ChaRTr",
    "confidence_flag": "tool",
    "description": "An R toolbox for modeling choices and response times in decision-making tasks.\n\nBACKGROUND:Decision-making is the process of choosing and performing actions in response to sensory cues to achieve behavioral goals. Many mathematical models have been developed to describe the choice behavior and response time (RT) distributions of observers performing decision-making tasks. However, relatively few researchers use these models because it demands expertise in various numerical, statistical, and software techniques. NEW METHOD:We present a toolbox - Choices and Response Times in R, or ChaRTr - that provides the user the ability to implement and test a wide variety of decision-making models ranging from classic through to modern versions of the diffusion decision model, to models with urgency signals, or collapsing boundaries.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mailchand/CHaRTr",
    "lastUpdate": "2020-12-10T16:28:32Z",
    "name": "ChaRTr",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JNEUMETH.2019.108432",
            "metadata": {
                "abstract": "© 2019 The Author(s)Background: Decision-making is the process of choosing and performing actions in response to sensory cues to achieve behavioral goals. Many mathematical models have been developed to describe the choice behavior and response time (RT) distributions of observers performing decision-making tasks. However, relatively few researchers use these models because it demands expertise in various numerical, statistical, and software techniques. New method: We present a toolbox — Choices and Response Times in R, or ChaRTr — that provides the user the ability to implement and test a wide variety of decision-making models ranging from classic through to modern versions of the diffusion decision model, to models with urgency signals, or collapsing boundaries. Results: In three different case studies, we demonstrate how ChaRTr can be used to effortlessly discriminate between multiple models of decision-making behavior. We also provide guidance on how to extend the toolbox to incorporate future developments in decision-making models. Comparison with existing method(s): Existing software packages surmounted some of the numerical issues but have often focused on the classical decision-making model, the diffusion decision model. Recent models that posit roles for urgency, time-varying decision thresholds, noise in various aspects of the decision-formation process or low pass filtering of sensory evidence have proven to be challenging to incorporate in a coherent software framework that permits quantitative evaluation among these competing classes of decision-making models. Conclusion: ChaRTr can be used to make insightful statements about the cognitive processes underlying observed decision-making behavior and ultimately for deeper insights into decision mechanisms.",
                "authors": [
                    {
                        "name": "Chandrasekaran C."
                    },
                    {
                        "name": "Hawkins G.E."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "ChaRTr: An R toolbox for modeling choices and response times in decision-making tasks"
            },
            "pmcid": "PMC6980795",
            "pmid": "31586868"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}