{
    "additionDate": "2022-08-02T14:37:42.284491Z",
    "biotoolsCURIE": "biotools:aegean",
    "biotoolsID": "aegean",
    "description": "The AEGeAn Toolkit provides a bundle of software tools for evaluating gene structure annotations and genome organization.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://aegean.readthedocs.io/en/v0.16.0/index.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                }
            ]
        }
    ],
    "homepage": "http://brendelgroup.github.io/AEGeAn/",
    "language": [
        "C",
        "Python"
    ],
    "lastUpdate": "2022-08-02T14:37:42.287435Z",
    "license": "ISC",
    "name": "AEGeAn",
    "owner": "alexcorm",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-187",
            "metadata": {
                "abstract": "Background: Accurate gene structure annotation is a fundamental but somewhat elusive goal of genome projects, as witnessed by the fact that (model) genomes typically undergo several cycles of re-annotation. In many cases, it is not only different versions of annotations that need to be compared but also different sources of annotation of the same genome, derived from distinct gene prediction workflows. Such comparisons are of interest to annotation providers, prediction software developers, and end-users, who all need to assess what is common and what is different among distinct annotation sources. We developed ParsEval, a software application for pairwise comparison of sets of gene structure annotations. ParsEval calculates several statistics that highlight the similarities and differences between the two sets of annotations provided. These statistics are presented in an aggregate summary report, with additional details provided as individual reports specific to non-overlapping, gene-model-centric genomic loci. Genome browser styled graphics embedded in these reports help visualize the genomic context of the annotations. Output from ParsEval is both easily read and parsed, enabling systematic identification of problematic gene models for subsequent focused analysis.Results: ParsEval is capable of analyzing annotations for large eukaryotic genomes on typical desktop or laptop hardware. In comparison to existing methods, ParsEval exhibits a considerable performance improvement, both in terms of runtime and memory consumption. Reports from ParsEval can provide relevant biological insights into the gene structure annotations being compared.Conclusions: Implemented in C, ParsEval provides the quickest and most feature-rich solution for genome annotation comparison to date. The source code is freely available (under an ISC license) at http://parseval.sourceforge.net/. © 2012 Standage and Brendel; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Brendel V.P."
                    },
                    {
                        "name": "Standage D.S."
                    }
                ],
                "citationCount": 15,
                "date": "2012-08-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ParsEval: Parallel comparison and analysis of gene structure annotations"
            }
        }
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "version": [
        "0.16.0"
    ]
}
