{
    "additionDate": "2022-09-02T17:57:55.634478Z",
    "biotoolsCURIE": "biotools:biotip",
    "biotoolsID": "biotip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xyang2@uchicago.edu",
            "name": "Xinan H Yang",
            "typeEntity": "Person"
        },
        {
            "name": "John M Cunningham"
        }
    ],
    "description": "BioTIP: an R-package for Characterization of Biological Tipping Points.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xyang2uchicago/BioTIP",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:44:21.540162Z",
    "license": "Not licensed",
    "name": "BioTIP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/nar/gkac452",
            "metadata": {
                "abstract": "Analyzing single-cell transcriptomes promises to decipher the plasticity, heterogeneity, and rapid switches in developmental cellular state transitions. Such analyses require the identification of gene markers for semi-stable transition states. However, there are nontrivial challenges such as unexplainable stochasticity, variable population sizes, and alternative trajectory constructions. By advancing current tipping-point theory-based models with feature selection, network decomposition, accurate estimation of correlations, and optimization, we developed BioTIP to overcome these challenges. BioTIP identifies a small group of genes, called critical transition signal (CTS), to characterize regulated stochasticity during semi-stable transitions. Although methods rooted in different theories converged at the same transition events in two benchmark datasets, BioTIP is unique in inferring lineage-determining transcription factors governing critical transition. Applying BioTIP to mouse gastrulation data, we identify multiple CTSs from one dataset and validated their significance in another independent dataset. We detect the established regulator Etv2 whose expression change drives the haemato-endothelial bifurcation, and its targets together in CTS across three datasets. After comparing to three current methods using six datasets, we show that BioTIP is accurate, user-friendly, independent of pseudo-temporal trajectory, and captures significantly interconnected and reproducible CTSs. We expect BioTIP to provide great insight into dynamic regulations of lineage-determining factors.",
                "authors": [
                    {
                        "name": "Cunningham J.M."
                    },
                    {
                        "name": "Goldstein A."
                    },
                    {
                        "name": "Moskowitz I.P."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wei M."
                    },
                    {
                        "name": "Yang X.H."
                    }
                ],
                "citationCount": 10,
                "date": "2022-09-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Detecting critical transition signals from single-cell transcriptomes to infer lineage-determining transcription factors"
            },
            "pmcid": "PMC9458468",
            "pmid": "35640613"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
