{
    "additionDate": "2020-01-14T19:35:06Z",
    "biotoolsCURIE": "biotools:Cox-PASNet",
    "biotoolsID": "Cox-PASNet",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "mingon.kang@unlv.edu",
            "name": "Mingon Kang",
            "typeEntity": "Person"
        }
    ],
    "description": "Interpretable deep neural network for cancer survival analysis by integrating genomic and clinical data.\n\nPathway-based sparse deep neural network for survival analysis.\n\nCox-PASNet is a pathway-based sparse deep neural network for survival analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DataX-JieHao/Cox-PASNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T19:35:06Z",
    "name": "Cox-PASNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0624-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Understanding the complex biological mechanisms of cancer patient survival using genomic and clinical data is vital, not only to develop new treatments for patients, but also to improve survival prediction. However, highly nonlinear and high-dimension, low-sample size (HDLSS) data cause computational challenges to applying conventional survival analysis. Results: We propose a novel biologically interpretable pathway-based sparse deep neural network, named Cox-PASNet, which integrates high-dimensional gene expression data and clinical data on a simple neural network architecture for survival analysis. Cox-PASNet is biologically interpretable where nodes in the neural network correspond to biological genes and pathways, while capturing the nonlinear and hierarchical effects of biological pathways associated with cancer patient survival. We also propose a heuristic optimization solution to train Cox-PASNet with HDLSS data. Cox-PASNet was intensively evaluated by comparing the predictive performance of current state-of-the-art methods on glioblastoma multiforme (GBM) and ovarian serous cystadenocarcinoma (OV) cancer. In the experiments, Cox-PASNet showed out-performance, compared to the benchmarking methods. Moreover, the neural network architecture of Cox-PASNet was biologically interpreted, and several significant prognostic factors of genes and biological pathways were identified. Conclusions: Cox-PASNet models biological mechanisms in the neural network by incorporating biological pathway databases and sparse coding. The neural network of Cox-PASNet can identify nonlinear and hierarchical associations of genomic and clinical data to cancer patient survival. The open-source code of Cox-PASNet in PyTorch implemented for training, evaluation, and model interpretation is available at: https://github.com/DataX-JieHao/Cox-PASNet.",
                "authors": [
                    {
                        "name": "Hao J."
                    },
                    {
                        "name": "Kim Y."
                    },
                    {
                        "name": "Mallavarapu T."
                    },
                    {
                        "name": "Oh J.H."
                    },
                    {
                        "name": "Kang M."
                    }
                ],
                "date": "2019-12-23T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Interpretable deep neural network for cancer survival analysis by integrating genomic and clinical data"
            },
            "pmcid": "PMC6927105",
            "pmid": "31865908"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}