{
    "additionDate": "2019-11-14T18:09:41Z",
    "biotoolsCURIE": "biotools:DeepCC",
    "biotoolsID": "DeepCC",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "l.vermeulen@amc.uva.nl",
            "name": "Louis Vermeulen",
            "typeEntity": "Person"
        },
        {
            "email": "Xin.Wang@cityu.edu.hk",
            "name": "Xin Wang",
            "orcidid": "https://orcid.org/0000-0002-5122-2418",
            "typeEntity": "Person"
        }
    ],
    "description": "a novel deep learning-based framework for cancer molecular subtype classification | a deep learning-based framework for cancer classification | After training, now you can use your DeepCC model to classify new sample(s). DeepCC can classify samples in a data set, as well as individual samples. The input data should be in the same format as above gene expression profile(s)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://cityuhk-compbio.github.io/DeepCC/",
    "lastUpdate": "2019-11-14T18:09:41Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://cityuhk-compbio.github.io/deepcc_online/"
        }
    ],
    "name": "DeepCC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41389-019-0157-8",
            "metadata": {
                "abstract": "© 2019, The Author(s).Molecular subtyping of cancer is a critical step towards more individualized therapy and provides important biological insights into cancer heterogeneity. Although gene expression signature-based classification has been widely demonstrated to be an effective approach in the last decade, the widespread implementation has long been limited by platform differences, batch effects, and the difficulty to classify individual patient samples. Here, we describe a novel supervised cancer classification framework, deep cancer subtype classification (DeepCC), based on deep learning of functional spectra quantifying activities of biological pathways. In two case studies about colorectal and breast cancer classification, DeepCC classifiers and DeepCC single sample predictors both achieved overall higher sensitivity, specificity, and accuracy compared with other widely used classification methods such as random forests (RF), support vector machine (SVM), gradient boosting machine (GBM), and multinomial logistic regression algorithms. Simulation analysis based on random subsampling of genes demonstrated the robustness of DeepCC to missing data. Moreover, deep features learned by DeepCC captured biological characteristics associated with distinct molecular subtypes, enabling more compact within-subtype distribution and between-subtype separation of patient samples, and therefore greatly reduce the number of unclassifiable samples previously. In summary, DeepCC provides a novel cancer classification framework that is platform independent, robust to missing data, and can be used for single sample prediction facilitating clinical implementation of cancer molecular subtyping.",
                "authors": [
                    {
                        "name": "Gao F."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Tan M."
                    },
                    {
                        "name": "Zhu L."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Fessler E."
                    },
                    {
                        "name": "Vermeulen L."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 7,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Oncogenesis",
                "title": "DeepCC: a novel deep learning-based framework for cancer molecular subtype classification"
            },
            "pmcid": "PMC6697729",
            "pmid": "31420533"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}