{
    "additionDate": "2021-01-18T10:17:49Z",
    "biotoolsCURIE": "biotools:shiny-sosv",
    "biotoolsID": "shiny-sosv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eva.chan@health.nsw.gov.au",
            "name": "Eva K. F. Chan",
            "orcidid": "https://orcid.org/0000-0002-6104-3763",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based performance calculator for somatic structural variant detection.\n\nShiny-SoSV provides an interactive and visual platform for users to easily explore the impact of different parameters on the power to detect somatic structural variants derived from short-read shole genome sequencing. Therefore, it enables users to rapidly address essential questions related to their study design.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://hcpcg.shinyapps.io/Shiny-SoSV",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-16T16:23:37Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://hcpcg.shinyapps.io/shiny-sosv"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tgong1/Shiny-SoSV"
        }
    ],
    "name": "Shiny-SoSV",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0238108",
            "metadata": {
                "abstract": "Copyright: © 2020 Gong et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Somatic structural variants are an important contributor to cancer development and evolution. Accurate detection of these complex variants from whole genome sequencing data is influenced by a multitude of parameters. However, there are currently no tools for guiding study design nor are there applications that could predict the performance of somatic structural variant detection. To address this gap, we developed Shiny-SoSV, a user-friendly web-based calculator for determining the impact of common variables on the sensitivity, precision and F1 score of somatic structural variant detection, including choice of variant detection tool, sequencing depth of coverage, variant allele fraction, and variant breakpoint resolution. Using simulation studies, we determined singular and combinatoric effects of these variables, modelled the results using a generalised additive model, allowing structural variant detection performance to be predicted for any combination of predictors. Shiny-SoSV provides an interactive and visual platform for users to easily compare individual and combined impact of different parameters. It predicts the performance of a proposed study design, on somatic structural variant detection, prior to the commencement of benchwork. Shiny-SoSV is freely available at https://hcpcg.shinyapps.io/Shiny-SoSV with accompanying user’s guide and example use-cases.",
                "authors": [
                    {
                        "name": "Gong T."
                    },
                    {
                        "name": "Hayes V.M."
                    },
                    {
                        "name": "Chan E.K.F."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Shiny-SoSV: A web-based performance calculator for somatic structural variant detection"
            },
            "pmcid": "PMC7451576",
            "pmid": "32853264"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ]
}