
{
    "credit": [
        {
            "email": "tanyuande@gmail.com",
            "name": "Yuan-De Tan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/MBttest.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MBttest_1.2.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Tan et al.Next generation sequencing (NGS) is increasingly being used for transcriptome-wide analysis of differential gene expression. The NGS data are multidimensional count data. Therefore, most of the statistical methods developed well for microarray data analysis are not applicable to transcriptomic data. For this reason, a variety of new statistical methods based on count data of transcript reads have been correspondingly proposed. But due to high cost and limitation of biological resources, current NGS data are still generated from a few replicate libraries. Some of these existing methods do not always have desirable performances on count data. We here developed a very powerful and robust statistical method based on beta and binomial distributions. Our method (mBeta t-test) is specifically applicable to sequence count data from small samples. Both simulated and real transcriptomic data showed mBeta t-test significantly outperformed the existing top statistical methods chosen in all 12 given scenarios and performed with high efficiency and high stability. The differentially expressed genes found by our method from real transcriptomic data were validated by qPCR experiments. Our method shows high power in finding truly differential expression, conservatively estimating FDR and high stability in RNA sequence count data derived from small samples. Our method can also be extended to genome-wide detection of differential splicing events.",
            "authors": [
                "Tan Y.-D.",
                "Chandler A.M.",
                "Chaudhury A.",
                "Neilson J.R."
            ],
            "cit_count": 1,
            "doi": "10.1371/journal.pone.0123658",
            "journal": "PLoS ONE",
            "title": "A powerful statistical approach for large-scale differential transcription analysis",
            "type": "Primary",
            "year": "2015-04-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mbttest",
        "biotoolsID": "mbttest",
        "description": "This high power, high conservativeness of FDR estimation and high stability method is suit-able to transcriptomic data, tag data, SAGE data (count data) from small samples or a few replicate libraries. It can be used to identify genes, mRNA isoforms or tags differentially expressed between two conditions.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/MBttest.html",
        "name": "MBttest",
        "version": [
            "1.2.0"
        ]
    }
}