{
    "accessibility": "Open access",
    "additionDate": "2023-01-17T00:36:31.619263Z",
    "biotoolsCURIE": "biotools:blmm",
    "biotoolsID": "blmm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Thomas E. Nichols",
            "orcidid": "http://orcid.org/0000-0002-4516-5103"
        },
        {
            "name": "Thomas Maullin-Sapey",
            "orcidid": "http://orcid.org/0000-0002-1890-330X"
        }
    ],
    "description": "Parallelised Computing for Big Linear Mixed Models.\n\nWithin neuroimaging large-scale, shared datasets are becoming increasingly commonplace, challenging existing tools both in terms of overall scale and complexity of the study designs. As sample sizes grow, researchers are presented with new opportunities to detect and account for grouping factors and covariance structure present in large experimental designs. In particular, standard linear model methods cannot account for the covariance and grouping structures present in large datasets, and the existing linear mixed models (LMM) tools are neither scalable nor exploit the computational speed-ups afforded by vectorisation of computations over voxels. Further, nearly all existing tools for imaging (fixed or mixed effect) do not account for variability in the patterns of missing data near cortical boundaries and the edge of the brain, and instead omit any voxels with any missing data",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/TomMaullin/BLMM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-17T00:36:31.621728Z",
    "license": "Not licensed",
    "name": "BLMM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2022.119729",
            "metadata": {
                "abstract": "© 2022Within neuroimaging large-scale, shared datasets are becoming increasingly commonplace, challenging existing tools both in terms of overall scale and complexity of the study designs. As sample sizes grow, researchers are presented with new opportunities to detect and account for grouping factors and covariance structure present in large experimental designs. In particular, standard linear model methods cannot account for the covariance and grouping structures present in large datasets, and the existing linear mixed models (LMM) tools are neither scalable nor exploit the computational speed-ups afforded by vectorisation of computations over voxels. Further, nearly all existing tools for imaging (fixed or mixed effect) do not account for variability in the patterns of missing data near cortical boundaries and the edge of the brain, and instead omit any voxels with any missing data. Yet in the large-n setting, such a voxel-wise deletion missing data strategy leads to severe shrinkage of the final analysis mask. To counter these issues, we describe the “Big” Linear Mixed Models (BLMM) toolbox, an efficient Python package for large-scale fMRI LMM analyses. BLMM is designed for use on high performance computing clusters and utilizes a Fisher Scoring procedure made possible by derivations for the LMM Fisher information matrix and score vectors derived in our previous work, Maullin-Sapey and Nichols (2021).",
                "authors": [
                    {
                        "name": "Maullin-Sapey T."
                    },
                    {
                        "name": "Nichols T.E."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "BLMM: Parallelised computing for big linear mixed models"
            },
            "pmid": "36336314"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
