{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2016-12-19T14:26:36Z",
    "biotoolsCURIE": "biotools:gemerr-ip",
    "biotoolsID": "gemerr",
    "collectionID": [
        "galaxyPasteur",
        "GemSIM"
    ],
    "credit": [
        {
            "email": "galaxy@pasteur.fr",
            "name": "Galaxy Support Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Generate error models from real data for GemReads.",
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/gemsim/files/?source=navbar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/gemsim/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-02-20T08:24:14Z",
    "link": [
        {
            "type": "Galaxy service",
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/afelten/microbiome_analyses/GemErr/1.6"
        }
    ],
    "maturity": "Mature",
    "name": "gemerr",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hmenager",
    "publication": [
        {
            "doi": "10.1186/1471-2164-13-74",
            "metadata": {
                "abstract": "Background: GemSIM, or General Error-Model based SIMulator, is a next-generation sequencing simulator capable of generating single or paired-end reads for any sequencing technology compatible with the generic formats SAM and FASTQ (including Illumina and Roche/454). GemSIM creates and uses empirically derived, sequence-context based error models to realistically emulate individual sequencing runs and/or technologies. Empirical fragment length and quality score distributions are also used. Reads may be drawn from one or more genomes or haplotype sets, facilitating simulation of deep sequencing, metagenomic, and resequencing projects.Results: We demonstrate GemSIM's value by deriving error models from two different Illumina sequencing runs and one Roche/454 run, and comparing and contrasting the resulting error profiles of each run. Overall error rates varied dramatically, both between individual Illumina runs, between the first and second reads in each pair, and between datasets from Illumina and Roche/454 technologies. Indels were markedly more frequent in Roche/454 than Illumina and both technologies suffered from an increase in error rates near the end of each read.The effects of these different profiles on low-frequency SNP-calling accuracy were investigated by analysing simulated sequencing data for a mixture of bacterial haplotypes. In general, SNP-calling using VarScan was only accurate for SNPs with frequency > 3%, independent of which error model was used to simulate the data. Variation between error profiles interacted strongly with VarScan's 'minumum average quality' parameter, resulting in different optimal settings for different sequencing runs.Conclusions: Next-generation sequencing has unprecedented potential for assessing genetic diversity, however analysis is complicated as error profiles can vary noticeably even between different runs of the same technology. Simulation with GemSIM can help overcome this problem, by providing insights into the error profiles of individual sequencing runs and allowing researchers to assess the effects of these errors on downstream data analysis. © 2012 McElroy et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "McElroy K.E."
                    },
                    {
                        "name": "Luciani F."
                    },
                    {
                        "name": "Thomas T."
                    }
                ],
                "citationCount": 81,
                "date": "2012-02-15T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GemSIM: General, error-model based simulator of next-generation sequencing data"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1093/nar/gkw343",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput data production technologies, particularly 'next-generation' DNA sequencing, have ushered in widespread and disruptive changes to biomedical research. Making sense of the large datasets produced by these technologies requires sophisticated statistical and computational methods, as well as substantial computational power. This has led to an acute crisis in life sciences, as researchers without informatics training attempt to perform computation-dependent analyses. Since 2005, the Galaxy project has worked to address this problem by providing a framework that makes advanced computational tools usable by non experts. Galaxy seeks to make data-intensive research more accessible, transparent and reproducible by providing a Web-based environment in which users can perform computational analyses and have all of the details automatically tracked for later inspection, publication, or reuse. In this report we highlight recently added features enabling biomedical analyses on a large scale.",
                "authors": [
                    {
                        "name": "Afgan E."
                    },
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "van den Beek M."
                    },
                    {
                        "name": "Blankenberg D."
                    },
                    {
                        "name": "Bouvier D."
                    },
                    {
                        "name": "Cech M."
                    },
                    {
                        "name": "Chilton J."
                    },
                    {
                        "name": "Clements D."
                    },
                    {
                        "name": "Coraor N."
                    },
                    {
                        "name": "Eberhard C."
                    },
                    {
                        "name": "Gruning B."
                    },
                    {
                        "name": "Guerler A."
                    },
                    {
                        "name": "Hillman-Jackson J."
                    },
                    {
                        "name": "Von Kuster G."
                    },
                    {
                        "name": "Rasche E."
                    },
                    {
                        "name": "Soranzo N."
                    },
                    {
                        "name": "Turaga N."
                    },
                    {
                        "name": "Taylor J."
                    },
                    {
                        "name": "Nekrutenko A."
                    },
                    {
                        "name": "Goecks J."
                    }
                ],
                "citationCount": 523,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "The Galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2016 update"
            },
            "type": "Other"
        },
        {
            "doi": "10.7490/f1000research.1114334.1",
            "type": "Other"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.6"
    ]
}