{
    "additionDate": "2017-12-18T00:08:49Z",
    "biotoolsCURIE": "biotools:mite_digger",
    "biotoolsID": "mite_digger",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://labs.csb.utoronto.ca/yang/"
        }
    ],
    "description": "MITE Digger is designed for the de novo retrieval of miniature inverted repeat transposable elements (MITEs) at genomic scales with high accuracy, specificity and efficiency.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://labs.csb.utoronto.ca/yang/MITEDigger/ReadMe1.4.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://labs.csb.utoronto.ca/yang/MITEDigger/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mite-digger-1-4-genome-wide-discovery-of-miniature-inverted-repeat-transposable-elements.html"
        }
    ],
    "name": "MITE Digger",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-186",
            "metadata": {
                "abstract": "Background: Miniature inverted repeat transposable elements (MITEs) are abundant non-autonomous elements, playing important roles in shaping gene and genome evolution. Their characteristic structural features are suitable for automated identification by computational approaches, however, de novo MITE discovery at genomic levels is still resource expensive. Efficient and accurate computational tools are desirable. Existing algorithms process every member of a MITE family, therefore a major portion of the computing task is redundant.Results: In this study, redundant computing steps were analyzed and a novel algorithm emphasizing on the reduction of such redundant computing was implemented in MITE Digger. It completed processing the whole rice genome sequence database in ~15 hours and produced 332 MITE candidates with low false positive (1.8%) and false negative (0.9%) rates. MITE Digger was also tested for genome wide MITE discovery with four other genomes.Conclusions: MITE Digger is efficient and accurate for genome wide retrieval of MITEs. Its user friendly interface further facilitates genome wide analyses of MITEs on a routine basis. The MITE Digger program is available at: http://labs.csb.utoronto.ca/yang/MITEDigger. © 2013 Yang; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Yang G."
                    }
                ],
                "citationCount": 25,
                "date": "2013-06-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MITE Digger, an efficient and accurate algorithm for genome wide discovery of miniature inverted repeat transposable elements"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "1.4"
    ]
}