{
    "accessibility": "Restricted access",
    "additionDate": "2020-01-14T09:33:37Z",
    "biotoolsCURIE": "biotools:HIV-related",
    "biotoolsID": "HIV-related",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cliff@optimamodel.com",
            "name": "Cliff C. Kerr",
            "typeEntity": "Person"
        }
    ],
    "description": "Optimal allocation of HIV resources among geographical regions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://hiv.ocds.co",
    "lastUpdate": "2020-12-10T09:07:51Z",
    "name": "HIV-related",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12889-019-7681-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Health resources are limited, which means spending should be focused on the people, places and programs that matter most. Choosing the mix of programs to maximize a health outcome is termed allocative efficiency. Here, we extend the methodology of allocative efficiency to answer the question of how resources should be distributed among different geographic regions. Methods: We describe a novel geographical optimization algorithm, which has been implemented as an extension to the Optima HIV model. This algorithm identifies an optimal funding of services and programs across regions, such as multiple countries or multiple districts within a country. The algorithm consists of three steps: (1) calibrating the model to each region, (2) determining the optimal allocation for each region across a range of different budget levels, and (3) finding the budget level in each region that minimizes the outcome (such as reducing new HIV infections and/or HIV-related deaths), subject to the constraint of fixed total budget across all regions. As a case study, we applied this method to determine an illustrative allocation of HIV program funding across three representative oblasts (regions) in Ukraine (Mykolayiv, Poltava, and Zhytomyr) to minimize the number of new HIV infections. Results: Geographical optimization was found to identify solutions with better outcomes than would be possible by considering region-specific allocations alone. In the case of Ukraine, prior to optimization (i.e. with status quo spending), a total of 244,000 HIV-related disability-adjusted life years (DALYs) were estimated to occur from 2016 to 2030 across the three oblasts. With optimization within (but not between) oblasts, this was estimated to be reduced to 181,000. With geographical optimization (i.e., allowing reallocation of funds between oblasts), this was estimated to be further reduced to 173,000. Conclusions: With the increasing availability of region- and even facility-level data, geographical optimization is likely to play an increasingly important role in health economic decision making. Although the largest gains are typically due to reallocating resources to the most effective interventions, especially treatment, further gains can be achieved by optimally reallocating resources between regions. Finally, the methods described here are not restricted to geographical optimization, and can be applied to other problems where competing resources need to be allocated with constraints, such as between diseases.",
                "authors": [
                    {
                        "name": "Kedziora D.J."
                    },
                    {
                        "name": "Stuart R.M."
                    },
                    {
                        "name": "Pearson J."
                    },
                    {
                        "name": "Latypov A."
                    },
                    {
                        "name": "Dierst-Davies R."
                    },
                    {
                        "name": "Duda M."
                    },
                    {
                        "name": "Avaliani N."
                    },
                    {
                        "name": "Wilson D.P."
                    },
                    {
                        "name": "Kerr C.C."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-12T00:00:00Z",
                "journal": "BMC Public Health",
                "title": "Optimal allocation of HIV resources among geographical regions"
            },
            "pmcid": "PMC6849208",
            "pmid": "31718603"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}