{
    "additionDate": "2021-01-18T12:30:26Z",
    "biotoolsCURIE": "biotools:thermonet-protein",
    "biotoolsID": "thermonet-protein",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tony.capra@vanderbilt.edu",
            "name": "John A. Capra",
            "orcidid": "https://orcid.org/0000-0001-9743-1795",
            "typeEntity": "Person"
        },
        {
            "email": "mark@gersteinlab.org",
            "name": "Mark B. Gerstein",
            "orcidid": "https://orcid.org/0000-0002-9746-3719",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting changes in protein thermodynamic stability upon point mutation with deep 3D convolutional neural networks.\n\nThermoNet is a computational framework for quantitative prediction of the changes in protein thermodynamic stability () caused by single-point amino acid substitutions. The core algorithm of ThermoNet is an ensemble of deep 3D convolutional neural networks. ThermoNet was compared with a large set of predictors and was shown to perform equally well as the best methods in the field while effectively addressing prediction bias.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gersteinlab/ThermoNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T09:17:10Z",
    "license": "GPL-3.0",
    "name": "ThermoNet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008291",
            "metadata": {
                "abstract": "© 2020 Li et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Predicting mutation-induced changes in protein thermodynamic stability (ΔΔG) is of great interest in protein engineering, variant interpretation, and protein biophysics. We introduce ThermoNet, a deep, 3D-convolutional neural network designed for structure-based prediction of ΔΔGs upon point mutation. To leverage the image-processing power inherent in convolutional neural networks, we treat protein structures as if they were multi-channel 3D images. In particular, the inputs to ThermoNet are uniformly constructed as multi-channel voxel grids based on biophysical properties derived from raw atom coordinates. We train and evaluate ThermoNet with a curated data set that accounts for protein homology and is balanced with direct and reverse mutations; this provides a framework for addressing biases that have likely influenced many previous ΔΔG prediction methods. ThermoNet demonstrates performance comparable to the best available methods on the widely used Ssym test set. In addition, ThermoNet accurately predicts the effects of both stabilizing and destabilizing mutations, while most other methods exhibit a strong bias towards predicting destabilization. We further show that homology between Ssym and widely used training sets like S2648 and VariBench has likely led to overestimated performance in previous studies. Finally, we demonstrate the practical utility of ThermoNet in predicting the ΔΔGs for two clinically relevant proteins, p53 and myoglobin, and for pathogenic and benign missense variants from ClinVar. Overall, our results suggest that 3D convolutional neural networks can model the complex, non-linear interactions perturbed by mutations, directly from biophysical properties of atoms.",
                "authors": [
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Yang Y.T."
                    },
                    {
                        "name": "Capra J.A."
                    },
                    {
                        "name": "Gerstein M.B."
                    }
                ],
                "citationCount": 3,
                "date": "2020-11-30T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Predicting changes in protein thermodynamic stability upon point mutation with deep 3D convolutional neural networks"
            },
            "pmcid": "PMC7728386",
            "pmid": "33253214"
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}