{
    "additionDate": "2017-12-18T00:12:22Z",
    "biotoolsCURIE": "biotools:scones",
    "biotoolsID": "scones",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.bsse.ethz.ch/mlcb"
        }
    ],
    "description": "SConES (Selecting Connected Explanatory SNPs) is a network-guided multi-locus association mapping methods. It allows for the discovery genetic loci that are maximally associated with a phenotype, and tend to be connected on an underlying network. This network can be constructed from a gene-gene interaction network (based on proximity), or in any way such that you believe that neighboring SNPs should tend to be selected together.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.bsse.ethz.ch/mlcb/research/bioinformatics-and-computational-biology/scones.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.bsse.ethz.ch/mlcb/research/bioinformatics-and-computational-biology/scones.html",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/scones-efficient-network-guided-multi-locus-association-mapping-graph-cuts.html"
        }
    ],
    "name": "SConES",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt238",
            "metadata": {
                "abstract": "Motivation: As an increasing number of genome-wide association studies reveal the limitations of the attempt to explain phenotypic heritability by single genetic loci, there is a recent focus on associating complex phenotypes with sets of genetic loci. Although several methods for multi-locus mapping have been proposed, it is often unclear how to relate the detected loci to the growing knowledge about gene pathways and networks. The few methods that take biological pathways or networks into account are either restricted to investigating a limited number of predetermined sets of loci or do not scale to genome-wide settings.Results: We present SConES, a new efficient method to discover sets of genetic loci that are maximally associated with a phenotype while being connected in an underlying network. Our approach is based on a minimum cut reformulation of the problem of selecting features under sparsity and connectivity constraints, which can be solved exactly and rapidly.SConES outperforms state-of-the-art competitors in terms of runtime, scales to hundreds of thousands of genetic loci and exhibits higher power in detecting causal SNPs in simulation studies than other methods. On flowering time phenotypes and genotypes from Arabidopsis thaliana, SConES detects loci that enable accurate phenotype prediction and that are supported by the literature. © The Author 2013.",
                "authors": [
                    {
                        "name": "Azencott C.-A."
                    },
                    {
                        "name": "Borgwardt K.M."
                    },
                    {
                        "name": "Grimm D."
                    },
                    {
                        "name": "Kawahara Y."
                    },
                    {
                        "name": "Sugiyama M."
                    }
                ],
                "citationCount": 39,
                "date": "2013-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Efficient network-guided multi-locus association mapping with graph cuts"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
