{"credit":[{"email":"conrad.burden@anu.edu.au","name":"Conrad Burden","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/Polyfit.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/Polyfit_1.8.0.tar.gz"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Laboratory information management","uri":"http://edamontology.org/topic_0607"}]},"publication":[{"abstract":"© 2014 Burden et al. Background: A number of algorithms exist for analysing RNA-sequencing data to infer profiles of differential gene expression. Problems inherent in building algorithms around statistical models of over dispersed count data are formidable and frequently lead to non-uniform p-value distributions for null-hypothesis data and to inaccurate estimates of false discovery rates (FDRs). This can lead to an inaccurate measure of significance and loss of power to detect differential expression. Results: We use synthetic and real biological data to assess the ability of several available R packages to accurately estimate FDRs. The packages surveyed are based on statistical models of overdispersed Poisson data and include edgeR, DESeq, DESeq2, PoissonSeq and QuasiSeq. Also tested is an add-on package to edgeR and DESeq which we introduce called Polyfit. Polyfit aims to address the problem of a non-uniform null p-value distribution for two-class datasets by adapting the Storey-Tibshirani procedure. Conclusions: We find the best performing package in the sense that it achieves a low FDR which is accurately estimated over the full range of p-values, albeit with a very slow run time, is the QLSpline implementation of QuasiSeq. This finding holds provided the number of biological replicates in each condition is at least 4. The next best performing packages are edgeR and DESeq2. When the number of biological replicates is sufficiently high, and within a range accessible tomultiplexed experimental designs, the Polyfit extension improves the performance DESeq (for approximately 6 or more replicates per condition), making its performance comparable with that of edgeR and DESeq2 in our tests with synthetic data.","authors":["Burden C.J.","Qureshi S.E.","Wilson S.R."],"cit_count":21,"doi":"10.7717/peerj.576","journal":"PeerJ","title":"Error estimates for the analysis of differential expression fromRNA-seq count data","type":"Primary","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:polyfit","biotoolsID":"polyfit","description":"Add-on to the packages DESeq which ensures the p-value distribution is uniform over the interval [0, 1] for data satisfying the null hypothesis of no differential expression, and uses an adpated Storey-Tibshiran method to calculate q-values.","homepage":"http://bioconductor.org/packages/release/bioc/html/Polyfit.html","name":"Polyfit","version":["1.8.0"]}}