{
    "additionDate": "2021-01-18T09:27:29Z",
    "biotoolsCURIE": "biotools:splice2deep",
    "biotoolsID": "splice2deep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "magbubah.essack@kaust.edu.sa",
            "name": "Magbubah Essack",
            "typeEntity": "Person"
        },
        {
            "email": "boris.jankovic@kaust.edu.sa",
            "name": "Boris R. Jankovic",
            "typeEntity": "Person"
        }
    ],
    "description": "An ensemble of deep convolutional neural networks for improved splice site prediction in genomic DNA.\n\nSplice2Deep: Deep Learning Model for Recognition of Splice Sites in Genomic DNA.\n\nThe accurate identification of the exon and intron boundaries is critical for the correct annotation of genes with multiple exons contained in a primary genomic DNA sequence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SomayahAlbaradei/Splice_Deep.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-21T14:32:13Z",
    "name": "Splice2Deep",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.GENE.2020.100035",
            "metadata": {
                "abstract": "© 2020Background: The accurate identification of the exon/intron boundaries is critical for the correct annotation of genes with multiple exons. Donor and acceptor splice sites (SS) demarcate these boundaries. Therefore, deriving accurate computational models to predict the SS are useful for functional annotation of genes and genomes, and for finding alternative SS associated with different diseases. Although various models have been proposed for the in silico prediction of SS, improving their accuracy is required for reliable annotation. Moreover, models are often derived and tested using the same genome, providing no evidence of broad application, i.e. to other poorly studied genomes. Results: With this in mind, we developed the Splice2Deep models for SS detection. Each model is an ensemble of deep convolutional neural networks. We evaluated the performance of the models based on the ability to detect SS in Homo sapiens, Oryza sativa japonica, Arabidopsis thaliana, Drosophila melanogaster, and Caenorhabditis elegans. Results demonstrate that the models efficiently detect SS in other organisms not considered during the training of the models. Compared to the state-of-the-art tools, Splice2Deep models achieved significantly reduced average error rates of 41.97% and 28.51% for acceptor and donor SS, respectively. Moreover, the Splice2Deep cross-organism validation demonstrates that models correctly identify conserved genomic elements enabling annotation of SS in new genomes by choosing the taxonomically closest model. Conclusions: The results of our study demonstrated that Splice2Deep both achieved a considerably reduced error rate compared to other state-of-the-art models and the ability to accurately recognize SS in other organisms for which the model was not trained, enabling annotation of poorly studied or newly sequenced genomes. Splice2Deep models are implemented in Python using Keras API; the models and the data are available at https://github.com/SomayahAlbaradei/Splice_Deep.git.",
                "authors": [
                    {
                        "name": "Albaradei S."
                    },
                    {
                        "name": "Magana-Mora A."
                    },
                    {
                        "name": "Thafar M."
                    },
                    {
                        "name": "Uludag M."
                    },
                    {
                        "name": "Bajic V.B."
                    },
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Essack M."
                    },
                    {
                        "name": "Jankovic B.R."
                    }
                ],
                "citationCount": 5,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Gene: X",
                "title": "Splice2Deep: An ensemble of deep convolutional neural networks for improved splice site prediction in genomic DNA"
            },
            "pmcid": "PMC7285987",
            "pmid": "32550561"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}