{
    "additionDate": "2020-01-14T09:40:37Z",
    "biotoolsCURIE": "biotools:memoryLSTM",
    "biotoolsID": "memoryLSTM",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "xinqigong@ruc.edu.cn",
            "name": "Xinqi Gong",
            "typeEntity": "Person"
        }
    ],
    "description": "Attention mechanism enhanced LSTM with residual architecture and its application for protein-protein interaction residue pairs prediction.\n\nBACKGROUND:Recurrent neural network(RNN) is a good way to process sequential data, but the capability of RNN to compute long sequence data is inefficient. As a variant of RNN, long short term memory(LSTM) solved the problem in some extent. Here we improved LSTM for big data application in protein-protein interaction interface residue pairs prediction based on the following two reasons. On the one hand, there are some deficiencies in LSTM, such as shallow layers, gradient explosion or vanishing, etc. With a dramatic data increasing, the imbalance between algorithm innovation and big data processing has been more serious and urgent.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'LSTM' (bio.tools/LSTM)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jiale-Liu/LSTM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T09:40:37Z",
    "name": "memory(LSTM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3199-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recurrent neural network(RNN) is a good way to process sequential data, but the capability of RNN to compute long sequence data is inefficient. As a variant of RNN, long short term memory(LSTM) solved the problem in some extent. Here we improved LSTM for big data application in protein-protein interaction interface residue pairs prediction based on the following two reasons. On the one hand, there are some deficiencies in LSTM, such as shallow layers, gradient explosion or vanishing, etc. With a dramatic data increasing, the imbalance between algorithm innovation and big data processing has been more serious and urgent. On the other hand, protein-protein interaction interface residue pairs prediction is an important problem in biology, but the low prediction accuracy compels us to propose new computational methods. Results: In order to surmount aforementioned problems of LSTM, we adopt the residual architecture and add attention mechanism to LSTM. In detail, we redefine the block, and add a connection from front to back in every two layers and attention mechanism to strengthen the capability of mining information. Then we use it to predict protein-protein interaction interface residue pairs, and acquire a quite good accuracy over 72%. What's more, we compare our method with random experiments, PPiPP, standard LSTM, and some other machine learning methods. Our method shows better performance than the methods mentioned above. Conclusion: We present an attention mechanism enhanced LSTM with residual architecture, and make deeper network without gradient vanishing or explosion to a certain extent. Then we apply it to a significant problem- protein-protein interaction interface residue pairs prediction and obtain a better accuracy than other methods. Our method provides a new approach for protein-protein interaction computation, which will be helpful for related biomedical researches.",
                "authors": [
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Gong X."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Attention mechanism enhanced LSTM with residual architecture and its application for protein-protein interaction residue pairs prediction"
            },
            "pmcid": "PMC6882172",
            "pmid": "31775612"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        }
    ]
}