{
    "accessibility": "Open access",
    "additionDate": "2022-10-10T21:18:11.702403Z",
    "biotoolsCURIE": "biotools:pfas-tox_database",
    "biotoolsID": "pfas-tox_database",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "j.varshavsky@northeastern.edu",
            "name": "Julia Varshavsky"
        },
        {
            "name": "Anna Reade"
        },
        {
            "name": "Katherine E. Pelch"
        },
        {
            "name": "Taylor Wolffe"
        }
    ],
    "description": "A systematic evidence map of health studies on 29 per- and polyfluoroalkyl substances.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "https://pfastoxdatabase.org",
    "lastUpdate": "2022-10-10T21:18:11.704863Z",
    "name": "PFAS-Tox Database",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.ENVINT.2022.107408",
            "metadata": {
                "abstract": "© 2022Background: PFAS (per-and polyfluoroalkyl substances) are a large class of synthetic chemicals widely used in consumer products and industrial processes. The scientific literature on PFAS has increased dramatically in the last decade. Many stakeholders, including regulators, scientists, non-governmental organizations, and concerned individuals could benefit from an efficient way to access the health and toxicological literature related to PFAS. Objective: To create a systematic evidence map of the available peer-reviewed health or toxicological research for 29 PFAS. Methods: A protocol for conducting this systematic evidence map was initially published on Zenodo (Pelch et al. 2019c), then peer reviewed and published in Environment International (Pelch et al. 2019d). PubMed database was searched through January 25, 2021. Studies were screened for inclusion and exclusion according to the Populations, Exposures, Comparators, and Outcomes (PECO) statement. Inclusion criteria were intentionally broad and included any human, animal, and/or in vitro study that investigated exposure to one of the 29 PFAS of interest and a human health or toxicological effect. Selected study details were extracted from included studies as described in the protocol. Study appraisal was not conducted. The included studies and extracted meta-data are freely available in the online, interactive systematic evidence map at https://pfastoxdatabase.org. Results: Over 15,000 studies were retrieved from the PubMed literature searches. After manual screening, 1,067 studies were identified and included as investigating the health or toxicological effect of one or more PFAS of interest. There were 505 human, 385 animal, and 220 in vitro studies. Summary tables of the extracted data and overall observations are included in this report. Conclusions: The PFAS-Tox Database is a useful tool for searching, filtering, and identifying peer reviewed research on the health and toxicological effects of the included PFAS. In this summary of the evidence map we provide examples of data gaps and clusters revealed by the database, with the goal of helping direct future research efforts, facilitate systematic reviews (e.g. on immune effects, mixtures of PFAS, or effects of short chain PFAS), inform regulatory risk assessments, and improve opportunities for cross-disciplinary coordination. We also discuss how this tool supports scientists, regulatory agencies, and other individuals by increasing awareness and access to current evidence regarding the health effects associated with PFAS exposure.",
                "authors": [
                    {
                        "name": "Cavalier H."
                    },
                    {
                        "name": "Kwiatkowski C.F."
                    },
                    {
                        "name": "Merced-Nieves F.M."
                    },
                    {
                        "name": "Pelch K.E."
                    },
                    {
                        "name": "Reade A."
                    },
                    {
                        "name": "Schultz K."
                    },
                    {
                        "name": "Varshavsky J."
                    },
                    {
                        "name": "Wolffe T."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Environment International",
                "title": "The PFAS-Tox Database: A systematic evidence map of health studies on 29 per- and polyfluoroalkyl substances"
            },
            "pmid": "35908389"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
