{
    "additionDate": "2020-01-14T09:25:43Z",
    "biotoolsCURIE": "biotools:ConvPath",
    "biotoolsID": "ConvPath",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "Guanghua.Xiao@UTSouthwestern.edu",
            "name": "Guanghua Xiao",
            "typeEntity": "Person"
        }
    ],
    "description": "A software tool for lung adenocarcinoma digital pathological image analysis aided by a convolutional neural network.\n\nBACKGROUND:The spatial distributions of different types of cells could reveal a cancer cell's growth pattern, its relationships with the tumor microenvironment and the immune response of the body, all of which represent key \"hallmarks of cancer\". However, the process by which pathologists manually recognize and localize all the cells in pathology slides is extremely labor intensive and error prone. METHODS:In this study, we developed an automated cell type classification pipeline, ConvPath, which includes nuclei segmentation, convolutional neural network-based tumor cell, stromal cell, and lymphocyte classification, and extraction of tumor microenvironment-related features for lung cancer pathology images.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'convolutional neural', 'convolutional neural network-based', 'convolutional neural network'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31767541",
    "lastUpdate": "2020-01-14T09:25:43Z",
    "name": "ConvPath",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.EBIOM.2019.10.033",
            "metadata": {
                "abstract": "© 2019 The AuthorsBackground: The spatial distributions of different types of cells could reveal a cancer cell's growth pattern, its relationships with the tumor microenvironment and the immune response of the body, all of which represent key “hallmarks of cancer”. However, the process by which pathologists manually recognize and localize all the cells in pathology slides is extremely labor intensive and error prone. Methods: In this study, we developed an automated cell type classification pipeline, ConvPath, which includes nuclei segmentation, convolutional neural network-based tumor cell, stromal cell, and lymphocyte classification, and extraction of tumor microenvironment-related features for lung cancer pathology images. To facilitate users in leveraging this pipeline for their research, all source scripts for ConvPath software are available at https://qbrc.swmed.edu/projects/cnn/. Findings: The overall classification accuracy was 92.9% and 90.1% in training and independent testing datasets, respectively. By identifying cells and classifying cell types, this pipeline can convert a pathology image into a “spatial map” of tumor, stromal and lymphocyte cells. From this spatial map, we can extract features that characterize the tumor micro-environment. Based on these features, we developed an image feature-based prognostic model and validated the model in two independent cohorts. The predicted risk group serves as an independent prognostic factor, after adjusting for clinical variables that include age, gender, smoking status, and stage. Interpretation: The analysis pipeline developed in this study could convert the pathology image into a “spatial map” of tumor cells, stromal cells and lymphocytes. This could greatly facilitate and empower comprehensive analysis of the spatial organization of cells, as well as their roles in tumor progression and metastasis.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Yang D.M."
                    },
                    {
                        "name": "Fujimoto J."
                    },
                    {
                        "name": "Yi F."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Yao B."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Moran C."
                    },
                    {
                        "name": "Kalhor N."
                    },
                    {
                        "name": "Weissferdt A."
                    },
                    {
                        "name": "Minna J."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Wistuba I.I."
                    },
                    {
                        "name": "Mao Y."
                    },
                    {
                        "name": "Xiao G."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-01T00:00:00Z",
                "journal": "EBioMedicine",
                "title": "ConvPath: A software tool for lung adenocarcinoma digital pathological image analysis aided by a convolutional neural network"
            },
            "pmcid": "PMC6921240",
            "pmid": "31767541"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}