{
    "accessibility": "Open access",
    "additionDate": "2022-12-06T01:08:09.636316Z",
    "biotoolsCURIE": "biotools:stsgt",
    "biotoolsID": "stsgt",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "s.banerjee@wayne.edu",
            "name": "Soumyanil Banerjee",
            "orcidid": "https://orcid.org/0000-0003-4165-8637"
        },
        {
            "email": "weisong@wayne.edu",
            "name": "Weisong Shi",
            "orcidid": "https://orcid.org/0000-0001-5864-4675"
        },
        {
            "email": "mdong@wayne.edu",
            "name": "Ming Dong",
            "orcidid": "https://orcid.org/0000-0001-8133-7809",
            "typeEntity": "Person"
        }
    ],
    "description": "Spatial-Temporal Synchronous Graph Transformer network (STSGT) for COVID-19 forecasting.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/soumbane/STSGT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-06T01:08:09.638605Z",
    "license": "Apache-2.0",
    "name": "STSGT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.SMHL.2022.100348",
            "metadata": {
                "abstract": "© 2022 Elsevier Inc.COVID-19 has become a matter of serious concern over the last few years. It has adversely affected numerous people around the globe and has led to the loss of billions of dollars of business capital. In this paper, we propose a novel Spatial–Temporal Synchronous Graph Transformer network (STSGT) to capture the complex spatial and temporal dependency of the COVID-19 time series data and forecast the future status of an evolving pandemic. The layers of STSGT combine the graph convolution network (GCN) with the self-attention mechanism of transformers on a synchronous spatial–temporal graph to capture the dynamically changing pattern of the COVID time series. The spatial–temporal synchronous graph simultaneously captures the spatial and temporal dependencies between the vertices of the graph at a given and subsequent time-steps, which helps capture the heterogeneity in the time series and improve the forecasting accuracy. Our extensive experiments on two publicly available real-world COVID-19 time series datasets demonstrate that STSGT significantly outperforms state-of-the-art algorithms that were designed for spatial–temporal forecasting tasks. Specifically, on average over a 12-day horizon, we observe a potential improvement of 12.19% and 3.42% in Mean Absolute Error (MAE) over the next best algorithm while forecasting the daily infected and death cases respectively for the 50 states of US and Washington, D.C. Additionally, STSGT also outperformed others when forecasting the daily infected cases at the state level, e.g., for all the counties in the State of Michigan. The code and models are publicly available at https://github.com/soumbane/STSGT.",
                "authors": [
                    {
                        "name": "Banerjee S."
                    },
                    {
                        "name": "Dong M."
                    },
                    {
                        "name": "Shi W."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Smart Health",
                "title": "Spatial–Temporal Synchronous Graph Transformer network (STSGT) for COVID-19 forecasting"
            },
            "pmcid": "PMC9577246",
            "pmid": "36277841"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
