{"credit":[{"email":"w3txnet@hgc.jp","name":"Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://txnet.hgc.jp/intro"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"Summary: Condition-specific time-course omics profiles are frequently used to study cellular response to stimuli and identify associated signaling pathways. However, few online tools allow users to analyze multiple types of high-throughput time-course data. TimeXNet Web is a web server that extracts a time-dependent gene/protein response network from time-course transcriptomic, proteomic or phospho-proteomic data, and an input interaction network. It classifies the given genes/proteins into time-dependent groups based on the time of their highest activity and identifies the most probable paths connecting genes/proteins in consecutive groups. The response sub-network is enriched in activated genes/proteins and contains novel regulators that do not show any observable change in the input data. Users can view the resultant response network and analyze it for functional enrichment. TimeXNet Web supports the analysis of high-throughput data from multiple species by providing high quality, weighted protein-protein interaction networks for 12 model organisms. Availability and implementation: http://txnet.hgc.jp/. Supplementary information: Supplementary data are available at Bioinformatics online.","authors":["Tan P.L.","Lopez Y.","Nakai K.","Patil A."],"cit_count":0,"doi":"10.1093/bioinformatics/bty393","journal":"Bioinformatics (Oxford, England)","title":"TimeXNet Web: identifying cellular response networks from diverse omics time-course data","year":"2018-11-01"}],"summary":{"biotoolsCURIE":"biotools:timexnet_web","biotoolsID":"timexnet_web","description":"Identifying cellular response networks from diverse omics time-course data.","homepage":"http://txnet.hgc.jp/","name":"TimeXNet Web"}}