{
    "additionDate": "2017-08-20T15:58:24Z",
    "biotoolsCURIE": "biotools:pear",
    "biotoolsID": "pear",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://groups.google.com/forum/?hl=en&fromgroups#!forum/pear-users"
        }
    ],
    "description": "Paired-end read merger. PEAR evaluates all possible paired-end read overlaps without requiring the target fragment size as input. In addition, it implements a statistical test for minimizing false-positive results.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sco.h-its.org/exelixis/web/software/pear/doc.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ]
        }
    ],
    "homepage": "http://sco.h-its.org/exelixis/web/software/pear/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-09-04T08:38:22Z",
    "license": "CC-BY-NC-1.0",
    "name": "PEAR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt593",
            "metadata": {
                "abstract": "Motivation: The Illumina paired-end sequencing technology can generate reads from both ends of target DNA fragments, which can subsequently be merged to increase the overall read length. There already exist tools for merging these paired-end reads when the target fragments are equally long. However, when fragment lengths vary and, in particular, when either the fragment size is shorter than a single-end read, or longer than twice the size of a single-end read, most state-of-the-art mergers fail to generate reliable results. Therefore, a robust tool is needed to merge paired-end reads that exhibit varying overlap lengths because of varying target fragment lengths.Results: We present the PEAR software for merging raw Illumina paired-end reads from target fragments of varying length. The program evaluates all possible paired-end read overlaps and does not require the target fragment size as input. It also implements a statistical test for minimizing false-positive results. Tests on simulated and empirical data show that PEAR consistently generates highly accurate merged paired-end reads. A highly optimized implementation allows for merging millions of paired-end reads within a few minutes on a standard desktop computer. On multi-core architectures, the parallel version of PEAR shows linear speedups compared with the sequential version of PEAR. © 2013 The Author 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Kobert K."
                    },
                    {
                        "name": "Flouri T."
                    },
                    {
                        "name": "Stamatakis A."
                    }
                ],
                "citationCount": 1526,
                "date": "2014-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PEAR: A fast and accurate Illumina Paired-End reAd mergeR"
            },
            "pmcid": "PMC3933873",
            "pmid": "24142950",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}