{
    "additionDate": "2020-01-09T17:42:06Z",
    "biotoolsCURIE": "biotools:VETA",
    "biotoolsID": "VETA",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "img@uoregon.edu",
            "name": "Ian Greenhouse",
            "typeEntity": "Person"
        }
    ],
    "description": "An Open-Source Matlab-Based Toolbox for the Collection and Analysis of Electromyography Combined With Transcranial Magnetic Stimulation.\n\nThe combination of electromyography (EMG) and transcranial magnetic stimulation (TMS) offers a powerful non-invasive approach for investigating corticospinal excitability in both humans and animals. Acquiring and analyzing the data produced with this combination of tools requires overcoming multiple technical hurdles. Due in part to these technical hurdles, the field lacks standard routines for EMG data collection and analysis. This poses a problem for study replication and direct comparisons. Although software toolboxes already exist that perform either online EMG data visualization or offline analysis, there currently are no openly available toolboxes that flexibly perform both and also interface directly with peripheral EMG and TMS equipment",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/greenhouselab/Veta/tree/master/data",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-01-09T17:42:06Z",
    "name": "VETA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNINS.2019.00975",
            "metadata": {
                "abstract": "© Copyright © 2019 Jackson and Greenhouse.The combination of electromyography (EMG) and transcranial magnetic stimulation (TMS) offers a powerful non-invasive approach for investigating corticospinal excitability in both humans and animals. Acquiring and analyzing the data produced with this combination of tools requires overcoming multiple technical hurdles. Due in part to these technical hurdles, the field lacks standard routines for EMG data collection and analysis. This poses a problem for study replication and direct comparisons. Although software toolboxes already exist that perform either online EMG data visualization or offline analysis, there currently are no openly available toolboxes that flexibly perform both and also interface directly with peripheral EMG and TMS equipment. Here, we introduce Visualize EMG TMS Analyze (VETA), a MATLAB-based toolbox that supports simultaneous EMG data collection and visualization as well as automated offline processing and is specially tailored for use with motor TMS. The VETA toolbox enables the simultaneous recording of EMG, timed administration of TMS, and presentation of behavioral stimuli from a single computer. These tools also provide a streamlined analysis pipeline with interactive data visualization. Finally, VETA offers a standard EMG data format to facilitate data sharing and open science.",
                "authors": [
                    {
                        "name": "Jackson N."
                    },
                    {
                        "name": "Greenhouse I."
                    }
                ],
                "date": "2019-09-13T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "VETA: An Open-Source Matlab-Based Toolbox for the Collection and Analysis of Electromyography Combined With Transcranial Magnetic Stimulation"
            },
            "pmcid": "PMC6753167",
            "pmid": "31572120"
        }
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ]
}