{
    "additionDate": "2017-02-10T14:15:09Z",
    "biotoolsCURIE": "biotools:gopubmed",
    "biotoolsID": "gopubmed",
    "credit": [
        {
            "email": "ms@biotec.tu-dresden.de",
            "name": "Michael Schroeder",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool that allows users to explore the results of PubMed queries in the context of Gene Ontology (GO) terms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "http://www.gopubmed.org/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "GoPubMed",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The biomedical literature grows at a tremendous rate and PubMed comprises already over 15 000 000 abstracts. Finding relevant literature is an important and difficult problem. We introduce GoPubMed, a web server which allows users to explore PubMed search results with the Gene Ontology (GO), a hierarchically structured vocabulary for molecular biology. GoPubMed provides the following benefits: first, it gives an overview of the literature abstracts by categorizing abstracts according to the GO and thus allowing users to quickly navigate through the abstracts by category. Second, it automatically shows general ontology terms related to the original query, which often do not even appear directly in the abstract. Third, it enables users to verify its classification because GO terms are highlighted in the abstracts and as each term is labelled with an accuracy percentage. Fourth, exploring PubMed abstracts with GoPubMed is useful as it shows definitions of GO terms without the need for further look up. GoPubMed is online at www.gopubmed.org. Querying is currently limited to 100 papers per query. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Doms A."
                    },
                    {
                        "name": "Schroeder M."
                    }
                ],
                "citationCount": 351,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GoPubMed: Exploring PubMed with the gene ontology"
            },
            "pmid": "15980585"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}