{
    "name": "Fangorn Forest (F2)", 
    "description": "Machine learning approach to classify genes and genera in the family Geminiviridae.", 
    "homepage": "http://www.geminivirus.org:8080/geminivirusdw/discoveryGeminivirus.jsp", 
    "biotoolsID": "fangorn_forest", 
    "biotoolsCURIE": "biotools:fangorn_forest", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2421", 
                    "term": "Database search"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2995", 
                    "term": "Sequence classification"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Database portal"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3474", 
            "term": "Machine learning"
        }, 
        {
            "uri": "http://edamontology.org/topic_0219", 
            "term": "Data submission, annotation and curation"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.geminivirus.org:8080/geminivirusdw/information.jsp", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-017-1839-x", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Fangorn forest (F2): A machine learning approach to classify genes and genera in the family Geminiviridae", 
                "abstract": "© 2017 The Author(s).Background: Geminiviruses infect a broad range of cultivated and non-cultivated plants, causing significant economic losses worldwide. The studies of the diversity of species, taxonomy, mechanisms of evolution, geographic distribution, and mechanisms of interaction of these pathogens with the host have greatly increased in recent years. Furthermore, the use of rolling circle amplification (RCA) and advanced metagenomics approaches have enabled the elucidation of viromes and the identification of many viral agents in a large number of plant species. As a result, determining the nomenclature and taxonomically classifying geminiviruses turned into complex tasks. In addition, the gene responsible for viral replication (particularly, the viruses belonging to the genus Mastrevirus) may be spliced due to the use of the transcriptional/splicing machinery in the host cells. However, the current tools have limitations concerning the identification of introns. Results: This study proposes a new method, designated Fangorn Forest (F2), based on machine learning approaches to classify genera using an ab initio approach, i.e., using only the genomic sequence, as well as to predict and classify genes in the family Geminiviridae. In this investigation, nine genera of the family Geminiviridae and their related satellite DNAs were selected. We obtained two training sets, one for genus classification, containing attributes extracted from the complete genome of geminiviruses, while the other was made up to classify geminivirus genes, containing attributes extracted from ORFs taken from the complete genomes cited above. Three ML algorithms were applied on those datasets to build the predictive models: support vector machines, using the sequential minimal optimization training approach, random forest (RF), and multilayer perceptron. RF demonstrated a very high predictive power, achieving 0.966, 0.964, and 0.995 of precision, recall, and area under the curve (AUC), respectively, for genus classification. For gene classification, RF could reach 0.983, 0.983, and 0.998 of precision, recall, and AUC, respectively. Conclusions: Therefore, Fangorn Forest is proven to be an efficient method for classifying genera of the family Geminiviridae with high precision and effective gene prediction and classification. The method is freely accessible at www.geminivirus.org:8080/geminivirusdw/discoveryGeminivirus.jsp.", 
                "date": "2017-09-30T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Silva J.C.F."
                    }, 
                    {
                        "name": "Carvalho T.F.M."
                    }, 
                    {
                        "name": "Fontes E.P.B."
                    }, 
                    {
                        "name": "Cerqueira F.R."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Elizabeth P. B. Fontes", 
            "email": "bbfontes@ufv.br", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Fabio R. Cerqueira", 
            "email": "frcerqueira@id.uff.br", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "migle_sur", 
    "additionDate": "2018-08-05T09:24:59Z", 
    "lastUpdate": "2018-12-10T12:59:01Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}