{
    "additionDate": "2021-01-18T08:47:37Z",
    "biotoolsCURIE": "biotools:edpr",
    "biotoolsID": "edpr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "geir.halnes@nmbu.no",
            "name": "Geir Halnes",
            "orcidid": "https://orcid.org/0000-0002-4721-1599",
            "typeEntity": "Person"
        }
    ],
    "description": "The electrodiffusive Pinsky-Rinzel (edPR) model is multicompartmental neuron model that accounts for electrodiffusive ion concentration dynamics in a way that ensures a biophysically consistent relationship between ion concentrations, electrical charge, and electrical potentials in both the intra- and extracellular space.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Ion counting",
                    "uri": "http://edamontology.org/operation_3704"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CINPLA/EDPRmodel_analysis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-05T15:53:33Z",
    "name": "edPR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007661",
            "metadata": {
                "abstract": "© 2020 Sætra et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In most neuronal models, ion concentrations are assumed to be constant, and effects of concentration variations on ionic reversal potentials, or of ionic diffusion on electrical potentials are not accounted for. Here, we present the electrodiffusive Pinsky-Rinzel (edPR) model, which we believe is the first multicompartmental neuron model that accounts for electrodiffusive ion concentration dynamics in a way that ensures a biophysically consistent relationship between ion concentrations, electrical charge, and electrical potentials in both the intra- and extracellular space. The edPR model is an expanded version of the two-compartment Pinsky-Rinzel (PR) model of a hippocampal CA3 neuron. Unlike the PR model, the edPR model includes homeostatic mechanisms and ion-specific leakage currents, and keeps track of all ion concentrations (Na+, K+, Ca2+, and Cl−), electrical potentials, and electrical conductivities in the intra- and extracellular space. The edPR model reproduces the membrane potential dynamics of the PR model for moderate firing activity. For higher activity levels, or when homeostatic mechanisms are impaired, the homeostatic mechanisms fail in maintaining ion concentrations close to baseline, and the edPR model diverges from the PR model as it accounts for effects of concentration changes on neuronal firing. We envision that the edPR model will be useful for the field in three main ways. Firstly, as it relaxes commonly made modeling assumptions, the edPR model can be used to test the validity of these assumptions under various firing conditions, as we show here for a few selected cases. Secondly, the edPR model should supplement the PR model when simulating scenarios where ion concentrations are expected to vary over time. Thirdly, being applicable to conditions with failed homeostasis, the edPR model opens up for simulating a range of pathological conditions, such as spreading depression or epilepsy.",
                "authors": [
                    {
                        "name": "Saetra M.J."
                    },
                    {
                        "name": "Einevoll G.T."
                    },
                    {
                        "name": "Halnes G."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "An electrodiffusive, ion conserving Pinsky-Rinzel model with homeostatic mechanisms"
            },
            "pmcid": "PMC7213750",
            "pmid": "32348299"
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}