{
    "additionDate": "2020-01-14T20:17:51Z",
    "biotoolsCURIE": "biotools:mlst_f",
    "biotoolsID": "mlst_f",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leonid@sfu.ca",
            "name": "Leonid Chindelevitch",
            "typeEntity": "Person"
        }
    ],
    "description": "Deconvoluting the diversity of within-host pathogen strains in a multi-locus sequence typing framework.\n\nDeconvoluting the Diversity of Within-host Pathogen Strain in a MLST Framework.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WGS-TB/MLST",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-14T08:14:27Z",
    "name": "MLST_F",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3204-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Bacterial pathogens exhibit an impressive amount of genomic diversity. This diversity can be informative of evolutionary adaptations, host-pathogen interactions, and disease transmission patterns. However, capturing this diversity directly from biological samples is challenging. Results: We introduce a framework for understanding the within-host diversity of a pathogen using multi-locus sequence types (MLST) from whole-genome sequencing (WGS) data. Our approach consists of two stages. First we process each sample individually by assigning it, for each locus in the MLST scheme, a set of alleles and a proportion for each allele. Next, we associate to each sample a set of strain types using the alleles and the strain proportions obtained in the first step. We achieve this by using the smallest possible number of previously unobserved strains across all samples, while using those unobserved strains which are as close to the observed ones as possible, at the same time respecting the allele proportions as closely as possible. We solve both problems using mixed integer linear programming (MILP). Our method performs accurately on simulated data and generates results on a real data set of Borrelia burgdorferi genomes suggesting a high level of diversity for this pathogen. Conclusions: Our approach can apply to any bacterial pathogen with an MLST scheme, even though we developed it with Borrelia burgdorferi, the etiological agent of Lyme disease, in mind. Our work paves the way for robust strain typing in the presence of within-host heterogeneity, overcoming an essential challenge currently not addressed by any existing methodology for pathogen genomics.",
                "authors": [
                    {
                        "name": "Chauve C."
                    },
                    {
                        "name": "Chindelevitch L."
                    },
                    {
                        "name": "Gan G.L."
                    },
                    {
                        "name": "Willie E."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Deconvoluting the diversity of within-host pathogen strains in a multi-locus sequence typing framework"
            },
            "pmcid": "PMC6915855",
            "pmid": "31842753"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
