{
    "name": "Plumed", 
    "description": "PLUMED is a plugin that works with a large number of molecular dynamics codes (Codes interfaced with PLUMED ). It can be used to analyse features of the dynamics on-the-fly or to perform a wide variety of free energy methods. PLUMED can also work as a Command Line Tools to perform analysis on trajectories saved in most of the existing formats.", 
    "homepage": "https://plumed.github.io/doc-v2.4/user-doc/html/index.html", 
    "biotoolsID": "plumed", 
    "biotoolsCURIE": "biotools:plumed", 
    "version": [
        "2.4.1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2415", 
                    "term": "Protein folding analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0250", 
                    "term": "Protein property calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Plug-in"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_1317", 
            "term": "Structural biology"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://plumed.github.io/doc-v2.4/user-doc/html/_installation.html", 
            "type": "Manual", 
            "note": "Installation"
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.cpc.2013.09.018", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "PLUMED 2: New feathers for an old bird", 
                "abstract": "Enhancing sampling and analyzing simulations are central issues in molecular simulation. Recently, we introduced PLUMED, an open-source plug-in that provides some of the most popular molecular dynamics (MD) codes with implementations of a variety of different enhanced sampling algorithms and collective variables (CVs). The rapid changes in this field, in particular new directions in enhanced sampling and dimensionality reduction together with new hardware, require a code that is more flexible and more efficient. We therefore present PLUMED 2 here - a complete rewrite of the code in an object-oriented programming language (C++). This new version introduces greater flexibility and greater modularity, which both extends its core capabilities and makes it far easier to add new methods and CVs. It also has a simpler interface with the MD engines and provides a single software library containing both tools and core facilities. Ultimately, the new code better serves the ever-growing community of users and contributors in coping with the new challenges arising in the field. © 2013 Elsevier B.V. All rights reserved.", 
                "date": "2014-02-01T00:00:00Z", 
                "citationCount": 556, 
                "authors": [
                    {
                        "name": "Tribello G.A."
                    }, 
                    {
                        "name": "Bonomi M."
                    }, 
                    {
                        "name": "Branduardi D."
                    }, 
                    {
                        "name": "Camilloni C."
                    }, 
                    {
                        "name": "Bussi G."
                    }
                ], 
                "journal": "Computer Physics Communications"
            }
        }, 
        {
            "doi": "10.1016/j.cpc.2009.05.011", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "PLUMED: A portable plugin for free-energy calculations with molecular dynamics", 
                "abstract": "Here we present a program aimed at free-energy calculations in molecular systems. It consists of a series of routines that can be interfaced with the most popular classical molecular dynamics (MD) codes through a simple patching procedure. This leaves the possibility for the user to exploit many different MD engines depending on the system simulated and on the computational resources available. Free-energy calculations can be performed as a function of many collective variables, with a particular focus on biological problems, and using state-of-the-art methods such as metadynamics, umbrella sampling and Jarzynski-equation based steered MD. The present software, written in ANSI-C language, can be easily interfaced with both Fortran and C/C++ codes. Program summary: Program title: PLUMED. Catalogue identifier: AEEE_v1_0. Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AEEE_v1_0.html. Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland. Licensing provisions: Lesser GPL. No. of lines in distributed program, including test data, etc.: 107 505. No. of bytes in distributed program, including test data, etc.: 2 052 759. Distribution format: tar.gz. Programming language: ANSI-C. Computer: Any computer capable of running an executable produced by GCC compiler. Operating system: Linux/Unix. RAM: Depending on the number of atoms, the method chosen and the collective variables used. Classification: 23. External routines: Must be interfaced with a MD code (such as GROMACS, NAMD, DL_POLY or SANDER). Nature of problem: Calculation of free-energy surfaces for biological and condensed matter systems. Solution method: Implementation of various enhanced sampling techniques. Unusual features: PLUMED is not a stand-alone program but it must be interfaced with a MD code (such as GROMACS, NAMD, DL_POLY or SANDER) that needs to be recompiled. Each interface is provided in a patch form. Running time: Depending on the number of atoms, the method chosen and the collective variables used. © 2009 Elsevier B.V. All rights reserved.", 
                "date": "2009-10-01T00:00:00Z", 
                "citationCount": 757, 
                "authors": [
                    {
                        "name": "Bonomi M."
                    }, 
                    {
                        "name": "Branduardi D."
                    }, 
                    {
                        "name": "Bussi G."
                    }, 
                    {
                        "name": "Camilloni C."
                    }, 
                    {
                        "name": "Provasi D."
                    }, 
                    {
                        "name": "Raiteri P."
                    }, 
                    {
                        "name": "Donadio D."
                    }, 
                    {
                        "name": "Marinelli F."
                    }, 
                    {
                        "name": "Pietrucci F."
                    }, 
                    {
                        "name": "Broglia R.A."
                    }, 
                    {
                        "name": "Parrinello M."
                    }
                ], 
                "journal": "Computer Physics Communications"
            }
        }
    ], 
    "credit": [
        {
            "name": "ELIXIR-ITA", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": null, 
            "typeRole": [], 
            "note": null
        }, 
        {
            "name": "Carlo Camilloni", 
            "email": "carlo.camilloni@unimi.it", 
            "url": "http://sites.unimi.it/camilloni/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "MatteoC", 
    "additionDate": "2018-03-30T08:18:05Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}