{
    "additionDate": "2018-07-24T10:47:29Z",
    "biotoolsCURIE": "biotools:i-tasser-mr",
    "biotoolsID": "i-tasser-mr",
    "credit": [
        {
            "email": "yangzhanglab@umich.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated molecular replacement for distant-homology proteins using iterative fragment assembly and progressive sequence truncation",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://zhanglab.ccmb.med.umich.edu/I-TASSER-MR/example/index.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://zhanglab.ccmb.med.umich.edu/I-TASSER-MR/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular replacement",
                    "uri": "http://edamontology.org/operation_3455"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://zhanglab.ccmb.med.umich.edu/I-TASSER-MR",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "I-TASSER-MR",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gkx349",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.Molecular replacement (MR) is one of the most common techniques used for solving the phase problem in X-ray crystal diffraction. The success rate of MR however drops quickly when the sequence identity between query and templates is reduced, while the I-TASSER-MR server is designed to solve the phase problem for proteins that lack close homologous templates. Starting from a sequence, it first generates full-length models using I-TASSER by iterative structural fragment reassembly. A progressive sequence truncation procedure is then used for editing the models based on local variations of the structural assembly simulations. Next, the edited models are submitted to MR-REX to search for optimal placements in the crystal unit-cells through replica-exchange Monte Carlo simulations, with the phasing results used by CNS for final atomic model refinement and selection. The I-TASSER-MR algorithm was tested in large-scale benchmark datasets and solved 36% more targets compared to using the best threading templates. The server takes primary sequence and raw crystal diffraction data as input, with output containing annotated phase information and refined structure models. It also allows users to choose between different methods for setting B-factors and the number of models used for phasing.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Virtanen J."
                    },
                    {
                        "name": "Xue Z."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 21,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "I-TASSER-MR: Automated molecular replacement for distant-homology proteins using iterative fragment assembly and progressive sequence truncation"
            },
            "pmcid": "PMC5793832",
            "pmid": "28472524",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ],
    "validated": 1
}