{
    "accessibility": "Open access",
    "additionDate": "2024-04-11T11:02:57.280432Z",
    "biotoolsCURIE": "biotools:vcell",
    "biotoolsID": "vcell",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vcell_support@uchc.edu",
            "name": "Virtual Cell team",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://vcell.org/support"
        },
        {
            "name": "R24 GM137787 NIH/NIGMS",
            "typeEntity": "Funding agency"
        }
    ],
    "description": "VCell (Virtual Cell) is a software for modeling and simulation of cell biological systems.  It is built on a central database and disseminated as a web application. It includes \n deterministic (compartmental ODE or reaction-diffusion-advection PDE with support for 2D kinematics), stochastic (SSA solvers), spatial stochastic (reaction-diffusion with Smoldyn), hybrid deterministic/stochastic and network-free agent-based simulations. There is support for rule-based modeling (BioNetGen and NFSim), spatial features such as membrane flux, lateral membrane diffusion, electrophysiology, geometries from 2D or 3D microscope images or analytical expressions.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://vcell.org/support"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://vcell.org/webstart/VCell_Tutorials/VCell_Help/index.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://vcell.org/run-vcell-software"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Kinetic model",
                        "uri": "http://edamontology.org/data_3241"
                    },
                    "format": [
                        {
                            "term": "COMBINE OMEX",
                            "uri": "http://edamontology.org/format_3686"
                        },
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        },
                        {
                            "term": "SED-ML",
                            "uri": "http://edamontology.org/format_3685"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "COMBINE OMEX",
                            "uri": "http://edamontology.org/format_3686"
                        },
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        },
                        {
                            "term": "SED-ML",
                            "uri": "http://edamontology.org/format_3685"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Kinetic model",
                        "uri": "http://edamontology.org/data_3241"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        },
                        {
                            "term": "SED-ML",
                            "uri": "http://edamontology.org/format_3685"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Simulation",
                        "uri": "http://edamontology.org/data_3869"
                    },
                    "format": [
                        {
                            "term": "COMBINE OMEX",
                            "uri": "http://edamontology.org/format_3686"
                        },
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        },
                        {
                            "term": "SED-ML",
                            "uri": "http://edamontology.org/format_3685"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://vcell.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T14:04:41.294622Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Discussion forum"
            ],
            "url": "https://groups.google.com/g/vcell-discuss"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/virtualcell/vcell"
        }
    ],
    "maturity": "Mature",
    "name": "VCell",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mblinov",
    "publication": [
        {
            "doi": "10.1016/j.bpj.2017.08.022",
            "metadata": {
                "abstract": "In rule-based modeling, molecular interactions are systematically specified in the form of reaction rules that serve as generators of reactions. This provides a way to account for all the potential molecular complexes and interactions among multivalent or multistate molecules. Recently, we introduced rule-based modeling into the Virtual Cell (VCell) modeling framework, permitting graphical specification of rules and merger of networks generated automatically (using the BioNetGen modeling engine) with hand-specified reaction networks. VCell provides a number of ordinary differential equation and stochastic numerical solvers for single-compartment simulations of the kinetic systems derived from these networks, and agent-based network-free simulation of the rules. In this work, compartmental and spatial modeling of rule-based models has been implemented within VCell. To enable rule-based deterministic and stochastic spatial simulations and network-free agent-based compartmental simulations, the BioNetGen and NFSim engines were each modified to support compartments. In the new rule-based formalism, every reactant and product pattern and every reaction rule are assigned locations. We also introduce the rule-based concept of molecular anchors. This assures that any species that has a molecule anchored to a predefined compartment will remain in this compartment. Importantly, in addition to formulation of compartmental models, this now permits VCell users to seamlessly connect reaction networks derived from rules to explicit geometries to automatically generate a system of reaction-diffusion equations. These may then be simulated using either the VCell partial differential equations deterministic solvers or the Smoldyn stochastic simulator.",
                "authors": [
                    {
                        "name": "Blinov M.L."
                    },
                    {
                        "name": "Bloom J.E."
                    },
                    {
                        "name": "Loew L.M."
                    },
                    {
                        "name": "Moraru I.I."
                    },
                    {
                        "name": "Schaff J.C."
                    },
                    {
                        "name": "Vasilescu D."
                    }
                ],
                "citationCount": 31,
                "date": "2017-10-03T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "Compartmental and Spatial Rule-Based Modeling with Virtual Cell"
            },
            "note": "Rule-based Models",
            "pmcid": "PMC5627391",
            "pmid": "28978431",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1371/journal.pcbi.1005236",
            "metadata": {
                "abstract": "Hybrid deterministic-stochastic methods provide an efficient alternative to a fully stochastic treatment of models which include components with disparate levels of stochasticity. However, general-purpose hybrid solvers for spatially resolved simulations of reaction-diffusion systems are not widely available. Here we describe fundamentals of a general-purpose spatial hybrid method. The method generates realizations of a spatially inhomogeneous hybrid system by appropriately integrating capabilities of a deterministic partial differential equation solver with a popular particle-based stochastic simulator, Smoldyn. Rigorous validation of the algorithm is detailed, using a simple model of calcium ‘sparks’ as a testbed. The solver is then applied to a deterministic-stochastic model of spontaneous emergence of cell polarity. The approach is general enough to be implemented within biologist-friendly software frameworks such as Virtual Cell.",
                "authors": [
                    {
                        "name": "Gao F."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Novak I.L."
                    },
                    {
                        "name": "Schaff J.C."
                    },
                    {
                        "name": "Slepchenko B.M."
                    }
                ],
                "citationCount": 22,
                "date": "2016-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Numerical Approach to Spatial Deterministic-Stochastic Models Arising in Cell Biology"
            },
            "note": "Spatial Hybrid Deterministic-Stochastic Models",
            "pmcid": "PMC5154471",
            "pmid": "27959915",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1016/S0006-3495(97)78146-3",
            "metadata": {
                "abstract": "The 'Virtual Cell' provides a general system for testing cell biological mechanisms and creates a framework for encapsulating the burgeoning knowledge base comprising the distribution and dynamics of intracellular biochemical processes. It approaches the problem by associating biochemical and electrophysiological data describing individual reactions with experimental microscopic image data describing their subcellular localizations. Individual processes are collected within a physical end computational infrastructure that accommodates any molecular mechanism expressible as rate equations or membrane fluxes. An illustration of the method is provided by a dynamic simulation of IP3-mediated Ca2+ release from endoplasmic reticulum in a neuronal cell. The results can be directly compared to experimental observations and provide insight into the role of experimentally inaccessible components of the overall mechanism.",
                "authors": [
                    {
                        "name": "Carson J.H."
                    },
                    {
                        "name": "Fink C.C."
                    },
                    {
                        "name": "Loew L.M."
                    },
                    {
                        "name": "Schaff J."
                    },
                    {
                        "name": "Slepchenko B."
                    }
                ],
                "citationCount": 215,
                "date": "1997-01-01T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "A general computational framework for modeling cellular structure and function"
            },
            "pmcid": "PMC1181013",
            "pmid": "9284281",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1016/b978-0-12-388403-9.00008-4",
            "metadata": {
                "abstract": "The shape of a cell, the sizes of subcellular compartments, and the spatial distribution of molecules within the cytoplasm can all control how molecules interact to produce a cellular behavior. This chapter describes how these spatial features can be included in mechanistic mathematical models of cell signaling. The Virtual Cell computational modeling and simulation software is used to illustrate the considerations required to build a spatial model. An explanation of how to appropriately choose between physical formulations that implicitly or explicitly account for cell geometry and between deterministic versus stochastic formulations for molecular dynamics is provided, along with a discussion of their respective strengths and weaknesses. As a first step toward constructing a spatial model, the geometry needs to be specified and associated with the molecules, reactions, and membrane flux processes of the network. Initial conditions, diffusion coefficients, velocities, and boundary conditions complete the specifications required to define the mathematics of the model. The numerical methods used to solve reaction-diffusion problems both deterministically and stochastically are then described and some guidance is provided in how to set up and run simulations. A study of cAMP signaling in neurons ends the chapter, providing an example of the insights that can be gained in interpreting experimental results through the application of spatial modeling. © 2012 Elsevier Inc.",
                "authors": [
                    {
                        "name": "Cowan A.E."
                    },
                    {
                        "name": "Loew L.M."
                    },
                    {
                        "name": "Moraru I.I."
                    },
                    {
                        "name": "Schaff J.C."
                    },
                    {
                        "name": "Slepchenko B.M."
                    }
                ],
                "citationCount": 102,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Methods in Cell Biology",
                "title": "Spatial Modeling of Cell Signaling Networks"
            },
            "pmcid": "PMC3519356",
            "pmid": "22482950",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "bionetgen",
            "type": "uses"
        },
        {
            "biotoolsID": "biosimulators",
            "type": "usedBy"
        },
        {
            "biotoolsID": "copasi",
            "type": "uses"
        },
        {
            "biotoolsID": "libsbml",
            "type": "uses"
        },
        {
            "biotoolsID": "runbiosimulations",
            "type": "usedBy"
        },
        {
            "biotoolsID": "smoldyn",
            "type": "uses"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
