{
    "accessibility": "Open access",
    "additionDate": "2022-08-29T08:11:19.086585Z",
    "biotoolsCURIE": "biotools:disopred3",
    "biotoolsID": "disopred3",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "d.t.jones@ucl.ac.uk",
            "name": "David T. Jones"
        }
    ],
    "description": "DISOPRED3 represents the latest release of our successful machine-learning based approach to the detection of intrinsically disordered regions.",
    "editPermission": {
        "authors": [
            "damiano.piovesan",
            "tlazar"
        ],
        "type": "group"
    },
    "homepage": "http://bioinf.cs.ucl.ac.uk/disopred",
    "language": [
        "C",
        "C++",
        "Perl"
    ],
    "lastUpdate": "2022-08-29T08:29:46.279326Z",
    "license": "Freeware",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/psipred/disopred"
        }
    ],
    "name": "DISOPRED3",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniela.mereuta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu744",
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: A sizeable fraction of eukaryotic proteins contain intrinsically disordered regions (IDRs), which act in unfolded states or by undergoing transitions between structured and unstructured conformations. Over time, sequence-based classifiers of IDRs have become fairly accurate and currently a major challenge is linking IDRs to their biological roles from the molecular to the systems level. Results: We describe DISOPRED3, which extends its predecessor with new modules to predict IDRs and protein-binding sites within them. Based on recent CASP evaluation results, DISOPRED3 can be regarded as state of the art in the identification of IDRs, and our self-assessment shows that it significantly improves over DISOPRED2 because its predictions are more specific across the whole board and more sensitive to IDRs longer than 20 amino acids. Predicted IDRs are annotated as protein binding through a novel SVM based classifier, which uses profile data and additional sequence-derived features. Based on benchmarking experiments with full cross-validation, we show that this predictor generates precise assignments of disordered protein binding regions and that it compares well with other publicly available tools. Availability and implementation: http://bioinf.cs.ucl.ac.uk/disopred.",
                "authors": [
                    {
                        "name": "Cozzetto D."
                    },
                    {
                        "name": "Jones D.T."
                    }
                ],
                "citationCount": 457,
                "date": "2015-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DISOPRED3: Precise disordered region predictions with annotated protein-binding activity"
            },
            "pmcid": "PMC4380029",
            "pmid": "25391399",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "version": [
        "3.1"
    ]
}
