{
    "additionDate": "2017-12-18T00:09:36Z",
    "biotoolsCURIE": "biotools:mutpred",
    "biotoolsID": "mutpred",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.mooneygroup.org/"
        }
    ],
    "description": "MutPred is a web application tool developed to classify an amino acid substitution as disease-associated or neutral in human. In addition, it predicts molecular cause of disease.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mutpred.mutdb.org/about.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://mutpred.mutdb.org/",
    "lastUpdate": "2021-04-22T06:46:38Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mutpred-predicting-whether-an-amino-acid-substitution-in-a-protein-is-deleterious-or-neutral.html"
        }
    ],
    "name": "MutPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_010778"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp528",
            "metadata": {
                "abstract": "Motivation: Advances in high-throughput genotyping and next generation sequencing have generated a vast amount of human genetic variation data. Single nucleotide substitutions within protein coding regions are of particular importance owing to their potential to give rise to amino acid substitutions that affect protein structure and function which may ultimately lead to a disease state. Over the last decade, a number of computational methods have been developed to predict whether such amino acid substitutions result in an altered phenotype. Although these methods are useful in practice, and accurate for their intended purpose, they are not well suited for providing probabilistic estimates of the underlying disease mechanism. Results: We have developed a new computational model, MutPred, that is based upon protein sequence, and which models changes of structural features and functional sites between wild-type and mutant sequences. These changes, expressed as probabilities of gain or loss of structure and function, can provide insight into the specific molecular mechanism responsible for the disease state. MutPred also builds on the established SIFT method but offers improved classification accuracy with respect to human disease mutations. Given conservative thresholds on the predicted disruption of molecular function, we propose that MutPred can generate accurate and reliable hypotheses on the molecular basis of disease for ∼11% of known inherited disease-causing mutations. We also note that the proportion of changes of functionally relevant residues in the sets of cancer-associated somatic mutations is higher than for the inherited lesions in the Human Gene Mutation Database which are instead predicted to be characterized by disruptions of protein structure. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Krishnan V.G."
                    },
                    {
                        "name": "Mort M.E."
                    },
                    {
                        "name": "Xin F."
                    },
                    {
                        "name": "Kamati K.K."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Mooney S.D."
                    },
                    {
                        "name": "Radivojac P."
                    }
                ],
                "citationCount": 517,
                "date": "2009-11-09T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Automated inference of molecular mechanisms of disease from amino acid substitutions"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Disease",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}