
{
    "credit": [
        {
            "email": "info@occ-data.org",
            "name": "General",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "support@opensciencedatacloud.org",
            "name": "For support questions",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Workbench"
        ],
        "topic": [
            {
                "term": "Data governance",
                "uri": "http://edamontology.org/topic_3571"
            },
            {
                "term": "Data integration and warehousing",
                "uri": "http://edamontology.org/topic_3366"
            },
            {
                "term": "Data architecture, analysis and design",
                "uri": "http://edamontology.org/topic_3365"
            },
            {
                "term": "Data mining",
                "uri": "http://edamontology.org/topic_3473"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background As large genomics and phenotypic datasets are becoming more common, it is increasingly difficult for most researchers to access, manage, and analyze them. One possible approach is to provide the research community with several petabyte-scale cloudbased computing platforms containing these data, along with tools and resources to analyze it. Methods Bionimbus is an open source cloudcomputing platform that is based primarily upon OpenStack, which manages on-demand virtual machines that provide the required computational resources, and GlusterFS, which is a high-performance clustered file system. Bionimbus also includes Tukey, which is a portal, and associated middleware that provides a single entry point and a single sign on for the various Bionimbus resources; and Yates, which automates the installation, configuration, and maintenance of the software infrastructure required. Results Bionimbus is used by a variety of projects to process genomics and phenotypic data. For example, it is used by an acute myeloid leukemia resequencing project at the University of Chicago. The project requires several computational pipelines, including pipelines for quality control, alignment, variant calling, and annotation. For each sample, the alignment step requires eight CPUs for about 12 h. BAM file sizes ranged from 5 GB to 10 GB for each sample. Conclusions Most members of the research community have difficulty downloading large genomics datasets and obtaining sufficient storage and computer resources to manage and analyze the data. Cloud computing platforms, such as Bionimbus, with data commons that contain large genomics datasets, are one choice for broadening access to research data in genomics.",
            "authors": [
                "Heath A.P.",
                "Greenway M.",
                "Powell R.",
                "Spring J.",
                "Suarez R.",
                "Hanley D.",
                "Bandlamudi C.",
                "McNerney M.E.",
                "White K.P.",
                "Grossman R.L."
            ],
            "cit_count": 41,
            "doi": "10.1136/amiajnl-2013-002155",
            "journal": "Journal of the American Medical Informatics Association",
            "title": "Bionimbus: A cloud for managing, analyzing and sharing large genomics datasets",
            "type": "Primary",
            "year": "2014-01-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bionimbus",
        "biotoolsID": "bionimbus",
        "description": "Cloud environment accessing, managing and analyzing large genomics and phenotypic datasets.",
        "homepage": "http://bionimbus.opensciencedatacloud.org/",
        "name": "Bionimbus"
    }
}