{
    "additionDate": "2017-12-18T00:07:41Z",
    "biotoolsCURIE": "biotools:hydrophobicity",
    "biotoolsID": "hydrophobicity",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://athena.bioc.uvic.ca/about-us/"
        }
    ],
    "description": "Hydrophobicity Grapher graphs the hydrophobicity/hydrophilicity of a sequence of amino acids, using a sliding window. The window size can be specified by the user, and several hydrophobicity scales can be used to determine the plot.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://virology.uvic.ca/help/tool-help/how-to/hydrophobicity-grapher-how-to/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://athena.bioc.uvic.ca/virology-ca-tools/hydrophobicity/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/hydrophobicity-display-hydropathic-character-protein.html"
        }
    ],
    "name": "Hydrophobicity",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A computer program that progressively evaluates the hydrophilicity and hydrophobicity of a protein along its amino acid sequence has been devised. For this purpose, a hydropathy scale has been composed wherein the hydrophilic and hydrophobic properties of each of the 20 amino acid side-chains is taken into consideration. The scale is based on an amalgam of experimental observations derived from the literature. The program uses a moving-segment approach that continuously determines the average hydropathy within a segment of predetermined length as it advances through the sequence. The consecutive scores are plotted from the amino to the carboxy terminus. At the same time, a midpoint line is printed that corresponds to the grand average of the hydropathy of the amino acid compositions found in most of the sequenced proteins. In the case of soluble, globular proteins there is a remarkable correspondence between the interior portions of their sequence and the regions appearing on the hydrophobic side of the midpoint line, as well as the exterior portions and the regions on the hydrophilic side. The correlation was demonstrated by comparisons between the plotted values and known structures determined by crystallography. In the case of membrane-bound proteins, the portions of their sequences that are located within the lipid bilayer are also clearly delineated by large uninterrupted areas on the hydrophobic side of the midpoint line. As such, the membrane-spanning segments of these proteins can be identified by this procedure. Although the method is not unique and embodies principles that have long been appreciated, its simplicity and its graphic nature make it a very useful tool for the evaluation of protein structures. © 1982.",
                "authors": [
                    {
                        "name": "Kyte J."
                    },
                    {
                        "name": "Doolittle R.F."
                    }
                ],
                "citationCount": 16432,
                "date": "1982-05-05T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "A simple method for displaying the hydropathic character of a protein"
            },
            "pmid": "7108955",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}