{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T12:53:41.357820Z",
    "biotoolsCURIE": "biotools:dqagui",
    "biotoolsID": "dqagui",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jonathan.mang@uk-erlangen.de",
            "name": "Jonathan M. Mang",
            "typeEntity": "Person"
        }
    ],
    "description": "A graphical user interface for the MIRACUM data quality assessment tool.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/miracum/dqa-dqastats/wiki/DQAgui_intro"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/miracum/dqa-dqagui",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-09T12:53:41.360464Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/DQAgui/index.html"
        }
    ],
    "name": "DQAgui",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12911-022-01961-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: With the growing impact of observational research studies, there is also a growing focus on data quality (DQ). As opposed to experimental study designs, observational research studies are performed using data mostly collected in a non-research context (secondary use). Depending on the number of data elements to be analyzed, DQ reports of data stored within research networks can grow very large. They might be cumbersome to read and important information could be overseen quickly. To address this issue, a DQ assessment (DQA) tool with a graphical user interface (GUI) was developed and provided as a web application. Methods: The aim was to provide an easy-to-use interface for users without prior programming knowledge to carry out DQ checks and to present the results in a clearly structured way. This interface serves as a starting point for a more detailed investigation of possible DQ irregularities. A user-centered development process ensured the practical feasibility of the interactive GUI. The interface was implemented in the R programming language and aligned to Kahn et al.’s DQ categories conformance, completeness and plausibility. Results: With DQAgui, an R package with a web-app frontend for DQ assessment was developed. The GUI allows users to perform DQ analyses of tabular data sets and to systematically evaluate the results. During the development of the GUI, additional features were implemented, such as analyzing a subset of the data by defining time periods and restricting the analyses to certain data elements. Conclusions: As part of the MIRACUM project, DQAgui is now being used at ten German university hospitals for DQ assessment and to provide a central overview of the availability of important data elements in a datamap over 2 years. Future development efforts should focus on design optimization and include a usability evaluation.",
                "authors": [
                    {
                        "name": "Gulden C."
                    },
                    {
                        "name": "Kapsner L.A."
                    },
                    {
                        "name": "Kraska D."
                    },
                    {
                        "name": "Mang J.M."
                    },
                    {
                        "name": "Prokosch H.-U."
                    },
                    {
                        "name": "Schild S."
                    },
                    {
                        "name": "Seuchter S.A."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "DQAgui: a graphical user interface for the MIRACUM data quality assessment tool"
            },
            "pmcid": "PMC9367129",
            "pmid": "35953813"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
