
{
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/home/about/contact/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.dcode.org/about.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Comparative genomics provides the means to demarcate functional regions in anonymous DNA sequences. The successful application of this method to identifying novel genes is currently shifting to deciphering the non-coding encryption of gene regulation across genomes. To facilitate the practical application of comparative sequence analysis to genetics and genomics, we have developed several analytical and visualization tools for the analysis of arbitrary sequences and whole genomes. These tools include two alignment tools, zPicture and Mulan; a phylogenetic shadowing tool, eShadow for identifying lineage- and species-specific functional elements; two evolutionary conserved transcription factor analysis tools, rVista and multiTF; a tool for extracting cis-regulatory modules governing the expression of co-regulated genes, Creme 2.0; and a dynamic portal to multiple vertebrate and invertebrate genome alignments, the ECR Browser. Here, we briefly describe each one of these tools and provide specific examples on their practical applications. All the tools are publicly available at the http://www.dcode.org/website. © 2005 Oxford University Press.",
            "authors": [
                "Loots G.G.",
                "Ovcharenko I."
            ],
            "cit_count": 26,
            "journal": "Nucleic Acids Research",
            "pmid": "15980535",
            "title": "Dcode.org anthology of comparative genomic tools",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dcode.org",
        "biotoolsID": "dcode.org",
        "description": "This website provides access to tools for comparative genomic analyses developed by the Comparative Genomics Center at the Lawerence Livermore National Laboratory. Tools include: zPicture, Mulan, eShadow, rVista, CREME, and the ECR Browser.",
        "homepage": "http://www.dcode.org/",
        "name": "DCODE.ORG"
    }
}