{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T13:29:18.792224Z",
    "biotoolsCURIE": "biotools:fogframe",
    "biotoolsID": "fogframe",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "o.skarlat@infosys.tuwien.ac.at",
            "name": "Olena Skarlat",
            "orcidid": "https://orcid.org/0000-0003-2754-7770",
            "typeEntity": "Person"
        }
    ],
    "description": "FogFrame-2.0 provides a framework to create a testbed for fog computing based on Raspberry Pi computers.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/softls/FogFrame-2.0",
    "language": [
        "Java",
        "Shell"
    ],
    "lastUpdate": "2021-11-28T13:29:18.795551Z",
    "license": "Apache-2.0",
    "name": "FogFrame",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7717/PEERJ-CS.588",
            "metadata": {
                "abstract": "© 2021 Skarlat and SchulteRecently, a multitude of conceptual architectures and theoretical foundations for fog computing have been proposed. Despite this, there is still a lack of concrete frameworks to setup real-world fog landscapes. In this work, we design and implement the fog computing framework FogFrame—a system able to manage and monitor edge and cloud resources in fog landscapes and to execute Internet of Things (IoT) applications. FogFrame provides communication and interaction as well as application management within a fog landscape, namely, decentralized service placement, deployment and execution. For service placement, we formalize a system model, define an objective function and constraints, and solve the problem implementing a greedy algorithm and a genetic algorithm. The framework is evaluated with regard to Quality of Service parameters of IoT applications and the utilization of fog resources using a real-world operational testbed. The evaluation shows that the service placement is adapted according to the demand and the available resources in the fog landscape. The greedy placement leads to the maximum utilization of edge devices keeping at the edge as many services as possible, while the placement based on the genetic algorithm keeps devices from overloads by balancing between the cloud and edge. When comparing edge and cloud deployment, the service deployment time at the edge takes 14% of the deployment time in the cloud. If fog resources are utilized at maximum capacity, and a new application request arrives with the need of certain sensor equipment, service deployment becomes impossible, and the application needs to be delegated to other fog resources. The genetic algorithm allows to better accommodate new applications and keep the utilization of edge devices at about 50% CPU. During the experiments, the framework successfully reacts to runtime events: (i) services are recovered when devices disappear from the fog landscape; (ii) cloud resources and highly utilized devices are released by migrating services to new devices; (iii) and in case of overloads, services are migrated in order to release resources.",
                "authors": [
                    {
                        "name": "Skarlat O."
                    },
                    {
                        "name": "Schulte S."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "PeerJ Computer Science",
                "title": "FogFrame: a framework for IoT application execution in the fog"
            },
            "pmcid": "PMC8279146",
            "pmid": "34307857"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ]
}