{
    "accessibility": "Restricted access",
    "additionDate": "2021-06-14T12:48:40Z",
    "biotoolsCURIE": "biotools:bwdat",
    "biotoolsID": "bwdat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "castromarino@eshcc.eur.nl",
            "name": "Deborah Castro",
            "typeEntity": "Person"
        }
    ],
    "description": "BWDAT (Binge-watching Data Analysis Tool) is a research tool for analyzing the consumption of video-on-demand content at home.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/JoseDAssisCordeiro/BWDAT",
    "lastUpdate": "2021-08-18T10:37:19Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/JoseDAssisCordeiro/BWDAT/issues"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://web.ist.utl.pt/ist178614/"
        }
    ],
    "name": "BWDAT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.ABREP.2020.100336",
            "metadata": {
                "abstract": "© 2021 The AuthorsIntroduction: New approaches to the study of the binge-watching phenomenon require new technology, leading to the development of a non-intrusive and low-cost analytical research software that facilitates a holistic understanding of binge-watching in an uncontrolled environment remotely (e.g., the home). BWDAT was developed to allow the collection of three types of data: users’ physiological data gathered from a smartwatch, users’ interactions from video-on-demand interfaces, and self-reported data. This tool offers the possibility to generate automatic data analysis reports, facilitating researchers’ data analysis tasks. Methods: Two trial studies and a long-term study were used to evaluate the design and the technical implementation of the BWDAT tool. The metrics used were the BWDAT smartwatch's App data coverage of the viewing sessions, and the data's reliability of the viewer's interactions with the Netflix interface, collected by the BWDAT Chrome Extension. Results: High percentages of data coverage and content coverage were verified in the sessions collecting the smartwatch's data. The reporting system developed proved to be useful in the collection and synchronization of physiological and users’ interaction data with Netflix interface, both generated in uncontrolled environments. Furthermore, the BWDAT tool facilitated the analysis of a large amount of nuanced data. Conclusion: The results obtained confirm the reliability, accuracy, and usability of BWDAT. This tool has the potential to help researchers shed new light on the field of media and audience studies, and in particular on binge-watching.",
                "authors": [
                    {
                        "name": "Castro D."
                    },
                    {
                        "name": "Cordeiro J.A."
                    },
                    {
                        "name": "Nisi V."
                    },
                    {
                        "name": "Nunes N.J."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "Addictive Behaviors Reports",
                "title": "BWDAT: A research tool for analyzing the consumption of VOD content at home"
            },
            "pmcid": "PMC7889796",
            "pmid": "33644293"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
