{
    "additionDate": "2018-07-21T15:27:53Z",
    "biotoolsCURIE": "biotools:axonpacking",
    "biotoolsID": "axonpacking",
    "credit": [
        {
            "email": "jcohen@polymtl.ca",
            "name": "Julien Cohen-Adad",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simulator of White Matter Axons Arrangement.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/neuropoly/axonpacking"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/neuropoly/axonpacking",
    "language": [
        "MATLAB",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "AxonPacking",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.3389/fninf.2017.00005",
            "metadata": {
                "abstract": "© 2017 Mingasson, Duval, Stikov and Cohen-Adad.Quantitative Magnetic Resonance Imaging (MRI) can provide parameters that describe white matter microstructure, such as the fiber volume fraction (FVF), the myelin volume fraction (MVF) or the axon volume fraction (AVF) via the fraction of restricted water (fr). While already being used for clinical application, the complex interplay between these parameters requires thorough validation via simulations. These simulations required a realistic, controlled and adaptable model of the white matter axons with the surrounding myelin sheath. While there already exist useful algorithms to perform this task, none of them combine optimisation of axon packing, presence of myelin sheath and availability as free and open source software. Here, we introduce a novel disk packing algorithm that addresses these issues. The performance of the algorithm is tested in term of reproducibility over 50 runs, resulting density, and stability over iterations. This tool was then used to derive multiple values of FVF and to study the impact of this parameter on fr and MVF in light of the known microstructure based on histology sample. The standard deviation of the axon density over runs was lower than 10−3 and the expected hexagonal packing for monodisperse disks was obtained with a density close to the optimal density (obtained: 0.892, theoretical: 0.907). Using an FVF ranging within [0.58, 0.82] and a mean inter-axon gap ranging within [0.1, 1.1] μm, MVF ranged within [0.32, 0.44] and fr ranged within [0.39, 0.71], which is consistent with the histology. The proposed algorithm is implemented in the open-source software AxonPacking (https://github.com/neuropoly/axonpacking) and can be useful for validating diffusion models as well as for enabling researchers to study the interplay between microstructure parameters when evaluating qMRI methods",
                "authors": [
                    {
                        "name": "Mingasson T."
                    },
                    {
                        "name": "Duval T."
                    },
                    {
                        "name": "Stikov N."
                    },
                    {
                        "name": "Cohen-Adad J."
                    }
                ],
                "citationCount": 6,
                "date": "2017-01-31T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "AxonPacking: An open-source software to simulate arrangements of axons in white matter"
            },
            "pmcid": "PMC5281605",
            "pmid": "28197091"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}