{
    "accessibility": "Open access",
    "additionDate": "2022-01-20T01:00:22.520710Z",
    "biotoolsCURIE": "biotools:hemonet",
    "biotoolsID": "hemonet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fayyazafsar@gmail.com",
            "name": "Fayyaz Minhas"
        },
        {
            "name": "Imran Amin"
        },
        {
            "name": "Adiba Yaseen"
        },
        {
            "name": "Sadaf Gull"
        },
        {
            "name": "Naeem Akhtar"
        }
    ],
    "description": "Predicting Hemolytic Activity with Integrated Feature Learning A neural network that perdict hemolytic activity classification of a peptide sequence along with inforamtion of N/C terminal modifications.This network captures context of amino acid with SeqVec embedding, Circular Fingerprint repersatation of N/C terminal modification's SMILES.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/adibayaseen/HemoNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-20T01:00:22.523256Z",
    "license": "Not licensed",
    "name": "HemoNet",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1142/S0219720021500219",
            "metadata": {
                "abstract": "© 2021 World Scientific Publishing Europe Ltd.Quantifying the hemolytic activity of peptides is a crucial step in the discovery of novel therapeutic peptides. Computational methods are attractive in this domain due to their ability to guide wet-lab experimental discovery or screening of peptides based on their hemolytic activity. However, existing methods are unable to accurately model various important aspects of this predictive problem such as the role of N/C-terminal modifications, D- and L- amino acids, etc. In this work, we have developed a novel neural network-based approach called HemoNet for predicting the hemolytic activity of peptides. The proposed method captures the contextual importance of different amino acids in a given peptide sequence using a specialized feature embedding in conjunction with SMILES-based fingerprint representation of N/C-terminal modifications. We have analyzed the predictive performance of the proposed method using stratified cross-validation in comparison with previous methods, non-redundant cross-validation as well as validation on external peptides and clinical antimicrobial peptides. Our analysis shows the proposed approach achieves significantly better predictive performance (AUC-ROC of 88%) in comparison to previous approaches (HemoPI and HemoPred with AUC-ROC of 73%). HemoNet can be a useful tool in the search for novel therapeutic peptides. The python implementation of the proposed method is available at the URL: https://github.com/adibayaseen/HemoNet.",
                "authors": [
                    {
                        "name": "Yaseen A."
                    },
                    {
                        "name": "Gull S."
                    },
                    {
                        "name": "Akhtar N."
                    },
                    {
                        "name": "Amin I."
                    },
                    {
                        "name": "Minhas F."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "HemoNet: Predicting hemolytic activity of peptides with integrated feature learning"
            },
            "pmid": "34353244"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}