
{
    "credit": [
        {
            "email": "zhufeng.ns@gmail.com",
            "name": "Feng Zhu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bidd.nus.edu.sg/group/personal/zf/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Quadruplex formation site detection",
                    "uri": "http://edamontology.org/operation_0429"
                },
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            },
            {
                "term": "Drug development",
                "uri": "http://edamontology.org/topic_3373"
            },
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Increasing numbers of proteins, nucleic acids and other molecular entities have been explored as therapeutic targets, hundreds of which are targets of approved and clinical trial drugs. Knowledge of these targets and corresponding drugs, particularly those in clinical uses and trials, is highly useful for facilitating drug discovery. Therapeutic Target Database (TTD) has been developed to provide information about therapeutic targets and corresponding drugs. In order to accommodate increasing demand for comprehensive knowledge about the primary targets of the approved, clinical trial and experimental drugs, numerous improvements and updates have been made to TTD. These updates include information about 348 successful, 292 clinical trial and 1254 research targets, 1514 approved, 1212 clinical trial and 2302 experimental drugs linked to their primary targets (3382 small molecule and 649 antisense drugs with available structure and sequence), new ways to access data by drug mode of action, recursive search of related targets or drugs, similarity target and drug searching, customized and whole data download, standardized target ID, and significant increase of data (1894 targets, 560 diseases and 5028 drugs compared with the 433 targets, 125 diseases and 809 drugs in the original release described in previous paper). This database can be accessed at http://bidd.nus.edu.sg/group/cjttd/TTD.asp. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Zhu F.",
                "Han B.",
                "Kumar P.",
                "Liu X.",
                "Ma X.",
                "Wei X.",
                "Huang L.",
                "Guo Y.",
                "Han L.",
                "Zheng C.",
                "Chen Y."
            ],
            "cit_count": 139,
            "journal": "Nucleic Acids Research",
            "pmid": "19933260",
            "title": "Update of TTD: Therapeutic Target Database",
            "year": "2009-11-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ttd",
        "biotoolsID": "ttd",
        "description": "Therapeutic Target Database (TTD) has been developed to provide information about therapeutic targets and corresponding drugs. TTD includes information about successful, clinical trial and research targets, approved, clinical trial and experimental drugs linked to their primary targets, new ways to access data by drug mode of action, recursive search of related targets or drugs, similarity target and drug searching, customized and whole data download, and standardized target ID.",
        "homepage": "http://bidd.nus.edu.sg/group/cjttd/",
        "name": "TTD"
    }
}