{
    "additionDate": "2021-01-18T11:16:17Z",
    "biotoolsCURIE": "biotools:pimd",
    "biotoolsID": "pimd",
    "confidence_flag": "tool",
    "description": "An Integrative Approach for Drug Repositioning Using Multiple Characterization Fusion.\n\n“PIMD: An Integrative Approach for Drug Repositioning Using Multiple Characterization Fusion”.\n\nAbstract：The accumulation of various types of drug informatics data and computational approaches for drug repositioning can accelerate pharmaceutical research and development.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sepstar/PIMD/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-23T16:25:55Z",
    "name": "PIMD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.GPB.2018.10.012",
            "metadata": {
                "abstract": "© 2020The accumulation of various types of drug informatics data and computational approaches for drug repositioning can accelerate pharmaceutical research and development. However, the integration of multi-dimensional drug data for precision repositioning remains a pressing challenge. Here, we propose a systematic framework named PIMD to predict drug therapeutic properties by integrating multi-dimensional data for drug repositioning. In PIMD, drug similarity networks (DSNs) based on chemical, pharmacological, and clinical data are fused into an integrated DSN (iDSN) composed of many clusters. Rather than simple fusion, PIMD offers a systematic way to annotate clusters. Unexpected drugs within clusters and drug pairs with a high iDSN similarity score are therefore identified to predict novel therapeutic uses. PIMD provides new insights into the universality, individuality, and complementarity of different drug properties by evaluating the contribution of each property data. To test the performance of PIMD, we use chemical, pharmacological, and clinical properties to generate an iDSN. Analyses of the contributions of each drug property indicate that this iDSN was driven by all data types and performs better than other DSNs. Within the top 20 recommended drug pairs, 7 drugs have been reported to be repurposed. The source code for PIMD is available at https://github.com/Sepstar/PIMD/.",
                "authors": [
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Wen Y."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Bo X."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "PIMD: An Integrative Approach for Drug Repositioning Using Multiple Characterization Fusion"
            },
            "pmid": "33075523"
        }
    ],
    "topic": [
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ],
    "validated": 1
}