{
    "additionDate": "2017-12-18T00:03:15Z",
    "biotoolsCURIE": "biotools:andes",
    "biotoolsID": "andes",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jcvi.org/"
        }
    ],
    "description": "The fundamental data structure underlying, is the position profile, which contains the nucleotide distributions for each genomic position resultant from a multiple sequence alignment. They include the root mean square deviation plot and the computation of base conversion frequencies, variation, inter-sample clustering and visualization, threshold-driven consensus sequence generation and polymorphism detection, and the estimation of empirically determined sequencing quality values.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://andestools.sourceforge.net/OnlineManual.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Conversion",
                    "uri": "http://edamontology.org/operation_3434"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Comparison",
                    "uri": "http://edamontology.org/operation_2424"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence generation",
                    "uri": "http://edamontology.org/operation_0230"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Generation",
                    "uri": "http://edamontology.org/operation_3429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://andestools.sourceforge.net/",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/andes-20100709-analysis-deep-sequencing.html"
        }
    ],
    "name": "ANDES",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1756-0500-3-199",
            "metadata": {
                "abstract": "Background: The advancements in DNA sequencing technologies have allowed researchers to progress from the analyses of a single organism towards the deep sequencing of a sample of organisms. With sufficient sequencing depth, it is now possible to detect subtle variations between members of the same species, or between mixed species with shared biomarkers, such as the 16S rRNA gene. However, traditional sequencing analyses of samples from largely homogeneous populations are often still based on multiple sequence alignments (MSA), where each sequence is placed along a separate row and similarities between aligned bases can be followed down each column. While this visual format is intuitive for a small set of aligned sequences, the representation quickly becomes cumbersome as sequencing depths cover loci hundreds or thousands of reads deep. Findings: We have developed ANDES, a software library and a suite of applications, written in Perl and R, for the statistical ANalyses of DEep Sequencing. The fundamental data structure underlying ANDES is the position profile, which contains the nucleotide distributions for each genomic position resultant from a multiple sequence alignment (MSA). Tools include the root mean square deviation (RMSD) plot, which allows for the visual comparison of multiple samples on a position-by-position basis, and the computation of base conversion frequencies (transition/transversion rates), variation (Shannon entropy), inter-sample clustering and visualization (dendrogram and multidimensional scaling (MDS) plot), threshold-driven consensus sequence generation and polymorphism detection, and the estimation of empirically determined sequencing quality values. Conclusions: As new sequencing technologies evolve, deep sequencing will become increasingly cost-efficient and the inter and intra-sample comparisons of largely homogeneous sequences will become more common. We have provided a software package and demonstrated its application on various empirically-derived datasets. Investigators may download the software from Sourceforge at https://sourceforge.net/projects/andestools. © 2010 Li et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Venter E."
                    },
                    {
                        "name": "Yooseph S."
                    },
                    {
                        "name": "Stockwell T.B."
                    },
                    {
                        "name": "Eckerle L.D."
                    },
                    {
                        "name": "Denison M.R."
                    },
                    {
                        "name": "Spiro D.J."
                    },
                    {
                        "name": "Methe B.A."
                    }
                ],
                "citationCount": 16,
                "date": "2010-08-27T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "ANDES: Statistical tools for the analyses of deep sequencing"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1,
    "version": [
        "20120225"
    ]
}