{"credit":[],"function":[{"operation":[{"term":"Binding site prediction","uri":"http://edamontology.org/operation_2575"},{"term":"Variant effect prediction","uri":"http://edamontology.org/operation_0331"},{"term":"Phasing","uri":"http://edamontology.org/operation_3454"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"topic":[{"term":"Biophysics","uri":"http://edamontology.org/topic_3306"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Protein folding, stability and design","uri":"http://edamontology.org/topic_0130"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"}]},"publication":[{"abstract":"© 2019 American Chemical Society.Knowledge about the structure and stability of protein-protein interactions is vital to decipher the behavior of protein systems. Prediction of protein complexes' stability is an interesting topic in the field of structural biology. There are some promising published computational approaches that predict the affinity between subunits of protein dimers using 3D structures of both subunits. In the current study, we classify protein complexes with experimentally measured affinities into distinct classes with different mean affinities. By predicting the mechanical stiffness of the protein binding patch (PBP) region on a single subunit, we successfully predict the assigned affinity class of the PBP in the classification step. Now to predict the experimentally measured affinity between protein monomers in solution, we just need the 3D structure of the suggested PBP on one subunit of the proposed dimer. We designed the SEPAS software and have made the software freely available for academic non-commercial research purposes at \"http://biophysics.ir/affinity\". SEPAS predicts the stability of the intended dimer in a classwise manner by utilizing the computed mechanical stiffness of the introduced binding site on one subunit with the minimum accuracy of 0.72.","authors":["Hadi-Alijanvand H."],"cit_count":0,"doi":"10.1021/ACS.JPROTEOME.9B00594","journal":"Journal of Proteome Research","pmid":"31795635","title":"Complex Stability is Encoded in Binding Patch Softness: A Monomer-Based Approach to Predict Inter-Subunit Affinity of Protein Dimers","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:biophysics","biotoolsID":"biophysics","description":"a Monomer-Based Approach to Predict Inter-Subunit Affinity of Protein Dimers.\n\nSEPAS performs the predictions using 3D structure of just one monomer.\n\nExecutable version 1.0 for running in Linux x86_64.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Complex Stability Encoded Binding Patch Softness', 'SEPAS', 'PBP'","homepage":"http://biophysics.ir/affinity","name":"biophysics"}}