{
    "additionDate": "2017-12-18T00:08:06Z",
    "biotoolsCURIE": "biotools:kvarq",
    "biotoolsID": "kvarq",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.swisstph.ch/kvarq"
        }
    ],
    "description": "This program performs rapid in silico genotyping for selected loci (e.g. phylogenetic SNPs, drug resistance mutations) in bacterial genome sequences in FastQ format. Mapping to a whole-genome reference sequence or de novo assembly or the short reads is not necessary.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://kvarq.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://www.swisstph.ch/en/about/mpi/tuberculosis-research/kvarq-targeted-and-direct-variant-calling-in-fastq-reads-of-bacterial-genomes/",
    "language": [
        "Python",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/kvarq-0-12-2-targeted-and-direct-variant-calling-in-fastq-reads-of-bacterial-genomes.html"
        }
    ],
    "name": "KvarQ",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-881",
            "metadata": {
                "abstract": "© 2014 Steiner et al.; licensee BioMed Central Ltd.Background: High-throughput DNA sequencing produces vast amounts of data, with millions of short reads that usually have to be mapped to a reference genome or newly assembled. Both reference-based mapping and de novo assembly are computationally intensive, generating large intermediary data files, and thus require bioinformatics skills that are often lacking in the laboratories producing the data. Moreover, many research and practical applications in microbiology require only a small fraction of the whole genome data.Results: We developed KvarQ, a new tool that directly scans fastq files of bacterial genome sequences for known variants, such as single nucleotide polymorphisms (SNP), bypassing the need of mapping all sequencing reads to a reference genome and de novo assembly. Instead, KvarQ loads \" testsuites\" that define specific SNPs or short regions of interest in a reference genome, and directly synthesizes the relevant results based on the occurrence of these markers in the fastq files. KvarQ has a versatile command line interface and a graphical user interface. KvarQ currently ships with two \" testsuites\" for Mycobacterium tuberculosis, but new \" testsuites\" for other organisms can easily be created and distributed. In this article, we demonstrate how KvarQ can be used to successfully detect all main drug resistance mutations and phylogenetic markers in 880 bacterial whole genome sequences. The average scanning time per genome sequence was two minutes. The variant calls of a subset of these genomes were validated with a standard bioinformatics pipeline and revealed >99% congruency.Conclusion: KvarQ is a user-friendly tool that directly extracts relevant information from fastq files. This enables researchers and laboratory technicians with limited bioinformatics expertise to scan and analyze raw sequencing data in a matter of minutes. KvarQ is open-source, and pre-compiled packages with a graphical user interface are available at http://www.swisstph.ch/kvarq.",
                "authors": [
                    {
                        "name": "Steiner A."
                    },
                    {
                        "name": "Stucki D."
                    },
                    {
                        "name": "Coscolla M."
                    },
                    {
                        "name": "Borrell S."
                    },
                    {
                        "name": "Gagneux S."
                    }
                ],
                "citationCount": 64,
                "date": "2014-10-09T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "KvarQ: Targeted and direct variant calling from fastq reads of bacterial genomes"
            },
            "pmcid": "PMC4197298",
            "pmid": "25297886",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "0.12.2"
    ]
}