{
    "name": "GB-eaSy", 
    "description": "Bioinformatics pipeline to process genotyping-by-sequencing (GBS) data.", 
    "homepage": "https://github.com/dpwickland/GB-eaSy", 
    "biotoolsID": "gb-easy", 
    "biotoolsCURIE": "biotools:gb-easy", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3227", 
                    "term": "Variant calling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3196", 
                    "term": "Genotyping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "DNA polymorphism"
        }, 
        {
            "uri": "http://edamontology.org/topic_3516", 
            "term": "Genotyping experiment"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Shell", 
        "Java"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/dpwickland/GB-eaSy/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-017-2000-6", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A comparison of genotyping-by-sequencing analysis methods on low-coverage crop datasets shows advantages of a new workflow, GB-eaSy", 
                "abstract": "© 2017 The Author(s). Background: Genotyping-by-sequencing (GBS), a method to identify genetic variants and quickly genotype samples, reduces genome complexity by using restriction enzymes to divide the genome into fragments whose ends are sequenced on short-read sequencing platforms. While cost-effective, this method produces extensive missing data and requires complex bioinformatics analysis. GBS is most commonly used on crop plant genomes, and because crop plants have highly variable ploidy and repeat content, the performance of GBS analysis software can vary by target organism. Here we focus our analysis on soybean, a polyploid crop with a highly duplicated genome, relatively little public GBS data and few dedicated tools. Results: We compared the performance of five GBS pipelines using low-coverage Illumina sequence data from three soybean populations. To address issues identified with existing methods, we developed GB-eaSy, a GBS bioinformatics workflow that incorporates widely used genomics tools, parallelization and automation to increase the accuracy and accessibility of GBS data analysis. Compared to other GBS pipelines, GB-eaSy rapidly and accurately identified the greatest number of SNPs, with SNP calls closely concordant with whole-genome sequencing of selected lines. Across all five GBS analysis platforms, SNP calls showed unexpectedly low convergence but generally high accuracy, indicating that the workflows arrived at largely complementary sets of valid SNP calls on the low-coverage data analyzed. Conclusions: We show that GB-eaSy is approximately as good as, or better than, other leading software solutions in the accuracy, yield and missing data fraction of variant calling, as tested on low-coverage genomic data from soybean. It also performs well relative to other solutions in terms of the run time and disk space required. In addition, GB-eaSy is built from existing open-source, modular software packages that are regularly updated and commonly used, making it straightforward to install and maintain. While GB-eaSy outperformed other individual methods on the datasets analyzed, our findings suggest that a comprehensive approach integrating the results from multiple GBS bioinformatics pipelines may be the optimal strategy to obtain the largest, most highly accurate SNP yield possible from low-coverage polyploid sequence data.", 
                "date": "2017-12-28T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Wickland D.P."
                    }, 
                    {
                        "name": "Battu G."
                    }, 
                    {
                        "name": "Hudson K.A."
                    }, 
                    {
                        "name": "Diers B.W."
                    }, 
                    {
                        "name": "Hudson M.E."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Matthew E. Hudson", 
            "email": "mhudson@illinois.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "migle_sur", 
    "additionDate": "2018-07-14T10:05:43Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}