{
    "additionDate": "2019-11-14T18:21:22Z",
    "biotoolsCURIE": "biotools:interface-CancerDAP",
    "biotoolsID": "interface-CancerDAP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lixia@hrbmu.edu.cn",
            "name": "Xia Li",
            "typeEntity": "Person"
        },
        {
            "email": "zyp19871208@126.com",
            "name": "Yunpeng Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying subpathway signatures for individualized anticancer drug response by integrating multi-omics data | CancerDAP is a database molecularly characterizing subpathways involved in cellular response to 191 anticancer drugs | 1 Prospect the detailed information of each subpathway related to corresponding anticancer drug; 2 | CancerDAP has been formally launched and is freely available at:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bio-bigdata.hrbmu.edu.cn/CancerDAP/",
    "lastUpdate": "2020-12-14T12:43:59Z",
    "name": "interface-CancerDAP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12967-019-2010-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Individualized drug response prediction is vital for achieving personalized treatment of cancer and moving precision medicine forward. Large-scale multi-omics profiles provide unprecedented opportunities for precision cancer therapy. Methods: In this study, we propose a pipeline to identify subpathway signatures for anticancer drug response of individuals by integrating the comprehensive contributions of multiple genetic and epigenetic (gene expression, copy number variation and DNA methylation) alterations. Results: Totally, 46 subpathway signatures associated with individual responses to different anticancer drugs were identified based on five cancer-drug response datasets. We have validated the reliability of subpathway signatures in two independent datasets. Furthermore, we also demonstrated these multi-omics subpathway signatures could significantly improve the performance of anticancer drug response prediction. In-depth analysis of these 46 subpathway signatures uncovered the essential roles of three omics types and the functional associations underlying different anticancer drug responses. Patient stratification based on subpathway signatures involved in anticancer drug response identified subtypes with different clinical outcomes, implying their potential roles as prognostic biomarkers. In addition, a landscape of subpathways associated with cellular responses to 191 anticancer drugs from CellMiner was provided and the mechanism similarity of drug action was accurately unclosed based on these subpathways. Finally, we constructed a user-friendly web interface-CancerDAP (http://bio-bigdata.hrbmu.edu.cn/CancerDAP/) available to explore 2751 subpathways relevant with 191 anticancer drugs response. Conclusions: Taken together, our study identified and systematically characterized subpathway signatures for individualized anticancer drug response prediction, which may promote the precise treatment of cancer and the study for molecular mechanisms of drug actions.",
                "authors": [
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Hu C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Shang D."
                    },
                    {
                        "name": "Zheng X."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Shao M."
                    },
                    {
                        "name": "Meng M."
                    },
                    {
                        "name": "Xiong Z."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 4,
                "date": "2019-08-06T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Identifying subpathway signatures for individualized anticancer drug response by integrating multi-omics data"
            },
            "pmcid": "PMC6685260",
            "pmid": "31387579"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}