
{
    "credit": [
        {
            "name": "ExPASy helpdesk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.expasy.org/support"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://glycoproteome.expasy.org/glycositealign/searchBy"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Structural genomics",
                "uri": "http://edamontology.org/topic_0122"
            },
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 American Chemical Society. GlycoSiteAlign is a tool designed to align amino acid sequences of variable length surrounding glycosylation sites depending on the knowledge of glycan structure. It is an exploratory resource intended for the identification of characteristic amino acid patterns of unique glycan-protein interactions. GlycoSiteAlign uses data from the UniCarbKB and UniProtKB databases, and it is hosted on ExPASy, the Swiss Institute of Bioinformatics resource portal. The user can select either specific or general glycan features, set the length of the protein fragments, and trigger an alignment with the option of including 90% homologous proteins. The tool previews and downloads alignments that may reveal amino acid patterns corresponding to selected features (e.g., \"fucosylated\" versus \"non-fucosylated\"). GlycoSiteAlign will integrate new data as they become available to confirm and expand results. It is presented as a promising tool for assessing and refining the knowledge about the constraints that link a particular glycan structure to a particular glycosite, and in the long term, this application could help improve prediction tools.",
            "authors": [
                "Gastaldello A.",
                "Alocci D.",
                "Baeriswyl J.-L.",
                "Mariethoz J.",
                "Lisacek F."
            ],
            "cit_count": 2,
            "doi": "10.1021/acs.jproteome.6b00481",
            "journal": "Journal of Proteome Research",
            "title": "GlycoSiteAlign: Glycosite Alignment Based on Glycan Structure",
            "type": "Primary",
            "year": "2016-10-07"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:glycositealign",
        "biotoolsID": "glycositealign",
        "description": "Selectively align amino acid sequences surrounding glycosylation sites (by default, 20 positions on each side of the glycosylated residue) depending on structural properties of the glycan attached to the site. These properties are either general (e.g., \"fucosylated\") or specific, such as precise composition, and are proposed in a drop-down list.",
        "homepage": "http://glycoproteome.expasy.org/glycositealign/",
        "name": "GlycoSiteAlign"
    }
}