{
    "additionDate": "2020-01-14T20:18:38Z",
    "biotoolsCURIE": "biotools:ctmmweb",
    "biotoolsID": "ctmmweb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "NoonanM@si.edu",
            "name": "Michael J. Noonan",
            "typeEntity": "Person"
        }
    ],
    "description": "A web application for scale-insensitive estimation of speed and distance traveled from animal tracking data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "http://ctmm.shinyapps.io/ctmmweb/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-18T18:10:29Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=ctmm"
        }
    ],
    "name": "ctmmweb",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/2020.05.11.087932"
        },
        {
            "doi": "10.1186/S40462-019-0177-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Speed and distance traveled provide quantifiable links between behavior and energetics, and are among the metrics most routinely estimated from animal tracking data. Researchers typically sum over the straight-line displacements (SLDs) between sampled locations to quantify distance traveled, while speed is estimated by dividing these displacements by time. Problematically, this approach is highly sensitive to the measurement scale, with biases subject to the sampling frequency, the tortuosity of the animal's movement, and the amount of measurement error. Compounding the issue of scale-sensitivity, SLD estimates do not come equipped with confidence intervals to quantify their uncertainty. Methods: To overcome the limitations of SLD estimation, we outline a continuous-time speed and distance (CTSD) estimation method. An inherent property of working in continuous-time is the ability to separate the underlying continuous-time movement process from the discrete-time sampling process, making these models less sensitive to the sampling schedule when estimating parameters. The first step of CTSD is to estimate the device's error parameters to calibrate the measurement error. Once the errors have been calibrated, model selection techniques are employed to identify the best fit continuous-time movement model for the data. A simulation-based approach is then employed to sample from the distribution of trajectories conditional on the data, from which the mean speed estimate and its confidence intervals can be extracted. Results: Using simulated data, we demonstrate how CTSD provides accurate, scale-insensitive estimates with reliable confidence intervals. When applied to empirical GPS data, we found that SLD estimates varied substantially with sampling frequency, whereas CTSD provided relatively consistent estimates, with often dramatic improvements over SLD. Conclusions: The methods described in this study allow for the computationally efficient, scale-insensitive estimation of speed and distance traveled, without biases due to the sampling frequency, the tortuosity of the animal's movement, or the amount of measurement error. In addition to being robust to the sampling schedule, the point estimates come equipped with confidence intervals, permitting formal statistical inference. All the methods developed in this study are now freely available in the ctmm R package or the ctmmweb point-and-click web based graphical user interface.",
                "authors": [
                    {
                        "name": "Akre T.S."
                    },
                    {
                        "name": "Calabrese J.M."
                    },
                    {
                        "name": "Drescher-Lehman J."
                    },
                    {
                        "name": "Fleming C.H."
                    },
                    {
                        "name": "Gurarie E."
                    },
                    {
                        "name": "Harrison A.-L."
                    },
                    {
                        "name": "Kays R."
                    },
                    {
                        "name": "Noonan M.J."
                    }
                ],
                "citationCount": 10,
                "date": "2019-11-15T00:00:00Z",
                "journal": "Movement Ecology",
                "title": "Scale-insensitive estimation of speed and distance traveled from animal tracking data"
            },
            "pmcid": "PMC6858693",
            "pmid": "31788314"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
