{
    "additionDate": "2020-01-14T20:12:36Z",
    "biotoolsCURIE": "biotools:hepatotoxicity",
    "biotoolsID": "hepatotoxicity",
    "confidence_flag": "tool",
    "description": "Predicting drug-induced hepatotoxicity based on biological feature maps and diverse classification strategies.\n\ndeal_with_data_tg_invitro.R plays the code for feature selection of open_tggate_liver_single_rat_invitro.\n\ndeal_with_data_tg_invivo.R plays the code for feature selection of open_tggate_liver_single_rat_invivo.\n\ndeal_with_data_dm_invivo.R plays the code for feature selection of drug_matrix.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RanSuLab/Hepatotoxicity",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-10T08:07:39Z",
    "name": "Hepatotoxicity",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ165",
            "metadata": {
                "abstract": "© 2019 The authors.Identifying hepatotoxicity as early as possible is significant in drug development. In this study, we developed a drug-induced hepatotoxicity prediction model taking account of both the biological context and the computational efficacy based on toxicogenomics data. Specifically, we proposed a novel gene selection algorithm considering gene's participation, named BioCB, to choose the discriminative genes and make more efficient prediction. Then instead of using the raw gene expression levels to characterize each drug, we developed a two-dimensional biological process feature pattern map to represent each drug. Then we employed two strategies to handle the maps and identify the hepatotoxicity, the direct use of maps, named Two-dim branch, and vectorization of maps, named One-dim branch. The two strategies subsequently used the deep convolutional neural networks and LightGBM as predictors, respectively. Additionally, we here for the first time proposed a stacked vectorized gene matrix, which was more predictive than the raw gene matrix. Results validated on both in vivo and in vitro data from two public data sets, the TG-GATES and DrugMatrix, show that the proposed One-dim branch outperforms the deep framework, the Two-dim branch, and has achieved high accuracy and efficiency. The implementation of the proposed method is available at https://github.com/RanSuLab/Hepatotoxicity.",
                "authors": [
                    {
                        "name": "Su R."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wei L."
                    }
                ],
                "citationCount": 10,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Predicting drug-induced hepatotoxicity based on biological feature maps and diverse classification strategies"
            },
            "pmid": "31838506"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        }
    ],
    "validated": 1
}