{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T21:11:02.737288Z",
    "biotoolsCURIE": "biotools:polyatailor",
    "biotoolsID": "polyatailor",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xhwu@suda.edu.cn",
            "name": "Xiaohui Wu",
            "typeEntity": "Person"
        },
        {
            "name": "Linlin Hao"
        },
        {
            "name": "Mengfei Liu"
        },
        {
            "name": "Sien Yang"
        }
    ],
    "description": "A user-friendly R package for measuring poly(A) tail length from NGS-based short-read and PacBio-based long-read sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BMILAB/PolyAtailor",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-04T21:11:02.739993Z",
    "license": "Not licensed",
    "name": "PolyAtailor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC271",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The poly(A) tail is a dynamic addition to the eukaryotic mRNA and the change in its length plays an essential role in regulating gene expression through affecting nuclear export, mRNA stability and translation. Only recently high-Throughput strategies began to emerge for transcriptome-wide profiling of poly(A) tail length in diverse developmental stages and organisms. However, there is currently no easy-To-use and universal tool for measuring poly(A) tails in data from different protocols. Here we established PolyAtailor, a unified and efficient framework, for identifying and analyzing poly(A) tails from PacBio-based long reads or next generation short reads. PolyAtailor provides two core functions for measuring poly(A) tails, namely Tail-map and Tail-scan, which can be used for profiling tails with or without using a reference genome. Particularly, PolyAtailor can identify all potential tails in a read, providing users with detailed information such as tail position, tail length, tail sequence and tail type. Moreover, PolyAtailor integrates rich functions for poly(A) tail and poly(A) site analyses, such as differential poly(A) length analysis, poly(A) site identification and annotation, and statistics and visualization of base composition in tails. We compared PolyAtailor with three latest methods, FLAMAnalysis, FLEPSeq and PAIsoSeqAnalysis, using data from three protocols in HeLa samples and Arabidopsis. Results show that PolyAtailor is effective in measuring poly(A) tail length and detecting significance of differential poly(A) length, which achieves much higher sensitivity and accuracy than competing methods. PolyAtailor is available at https://github.com/BMILAB/PolyAtailor.",
                "authors": [
                    {
                        "name": "Hao L."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Yang S."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "PolyAtailor: Measuring poly(A) tail length from short-read and long-read data"
            },
            "pmid": "35769001"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
