{
    "additionDate": "2017-03-27T07:56:21Z",
    "biotoolsCURIE": "biotools:camp",
    "biotoolsID": "camp",
    "credit": [
        {
            "email": "camp@bicnirrh.in",
            "name": "Biomedical Informatics Centre",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Collection of Anti-Microbial Peptides is a free online database that is manually curated and currently holds 3782 antimicrobial sequences. These sequences are divided into experimentally validated and predicted datasets based on their reference literature. Information like source organism, activity, reference literature, target and non-target organisms of AMPs are captured in the database. Prediction and sequence analysis tools, including BLAST, are integrated in the database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.camp.bicnirrh.res.in/campHelp.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "homepage": "http://bicnirrh.res.in/antimicrobial",
    "language": [
        "PHP",
        "JavaScript",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "CAMP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Antimicrobial peptides (AMPs) are gaining popularity as better substitute to antibiotics. These peptides are shown to be active against several bacteria, fungi, viruses, protozoa and cancerous cells. Understanding the role of primary structure of AMPs in their specificity and activity is essential for their rational design as drugs. Collection of Anti-Microbial Peptides (CAMP) is a free online database that has been developed for advancement of the present understanding on antimicrobial peptides. It is manually curated and currently holds 3782 antimicrobial sequences. These sequences are divided into experimentally validated (patents and non-patents: 2766) and predicted (1016) datasets based on their reference literature. Information like source organism, activity (MIC values), reference literature, target and non-target organisms of AMPs are captured in the database. The experimentally validated dataset has been further used to develop prediction tools for AMPs based on the machine learning algorithms like Random Forests (RF), Support Vector Machines (SVM) and Discriminant Analysis (DA). The prediction models gave accuracies of 93.2% (RF), 91.5% (SVM) and 87.5% (DA) on the test datasets. The prediction and sequence analysis tools, including BLAST, are integrated in the database. CAMP will be a useful database for study of sequence-activity and-specificity relationships in AMPs. CAMP is freely available at . http://www.bicnirrh.res.in/antimicrobial. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Thomas S."
                    },
                    {
                        "name": "Karnik S."
                    },
                    {
                        "name": "Barai R.S."
                    },
                    {
                        "name": "Jayaraman V.K."
                    },
                    {
                        "name": "Idicula-Thomas S."
                    }
                ],
                "citationCount": 181,
                "date": "2009-11-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CAMP: A useful resource for research on antimicrobial peptides"
            },
            "pmid": "19923233"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}