{
    "additionDate": "2019-11-14T19:31:52Z",
    "biotoolsCURIE": "biotools:GMrepo",
    "biotoolsID": "GMrepo",
    "confidence_flag": "tool",
    "description": "a database of curated and consistently annotated human gut metagenomes | GMrepo (data repository for Gut Microbiota) is a database of curated and consistently annotated human gut metagenomes. Its main purpose is to facilitate the reusability and accessibility of the rapidly growing human metagenomic data. This is achieved by consistently annotating the microbial contents of collected samples using state-of-art toolsets and by manual curation of the meta-data of the corresponding human hosts. GMrepo organizes the collected samples according to their associated phenotypes and includes all possible related meta-data such as age, sex, country, body-mass-index (BMI) and recent antibiotics usage. To make relevant information easier to access, GMrepo is equipped with a graphical query builder, enabling users to make customized, complex and biologically relevant queries",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://gmrepo.humangut.info",
    "lastUpdate": "2020-12-03T12:09:40Z",
    "name": "GMrepo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ764",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.GMrepo (data repository for Gut Microbiota) is a database of curated and consistently annotated human gut metagenomes. Its main purpose is to facilitate the reusability and accessibility of the rapidly growing human metagenomic data. This is achieved by consistently annotating the microbial contents of collected samples using state-of-art toolsets and by manual curation of the meta-data of the corresponding human hosts. GMrepo organizes the collected samples according to their associated phenotypes and includes all possible related meta-data such as age, sex, country, body-mass-index (BMI) and recent antibiotics usage. To make relevant information easier to access, GMrepo is equipped with a graphical query builder, enabling users to make customized, complex and biologically relevant queries. For example, to find (1) samples from healthy individuals of 18 to 25 years old with BMIs between 18.5 and 24.9, or (2) projects that are related to colorectal neoplasms, with each containing >100 samples and both patients and healthy controls. Precomputed species/genus relative abundances, prevalence within and across phenotypes, and pairwise co-occurrence information are all available at the website and accessible through programmable interfaces. So far, GMrepo contains 58 903 human gut samples/runs (including 17 618 metagenomes and 41 285 amplicons) from 253 projects concerning 92 phenotypes. GMrepo is freely available at: Https://gmrepo.humangut.info.",
                "authors": [
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Sun C."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Jia L."
                    },
                    {
                        "name": "Lai S."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Luo P."
                    },
                    {
                        "name": "Dai D."
                    },
                    {
                        "name": "Yang Y.-Q."
                    },
                    {
                        "name": "Luo Q."
                    },
                    {
                        "name": "Gao N.L."
                    },
                    {
                        "name": "Ning K."
                    },
                    {
                        "name": "He L.-J."
                    },
                    {
                        "name": "Zhao X.-M."
                    },
                    {
                        "name": "Chen W.-H."
                    }
                ],
                "citationCount": 11,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GMrepo: A database of curated and consistently annotated human gut metagenomes"
            },
            "pmid": "31504765"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}