{
    "additionDate": "2018-04-27T11:35:09Z",
    "biotoolsCURIE": "biotools:pathrings",
    "biotoolsID": "pathrings",
    "credit": [
        {
            "name": "Admin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/ivcl"
        }
    ],
    "description": "A web-based tool for exploration of ortholog and expression data in biological pathways.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ivcl/PathRings"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://raven.anr.udel.edu/~sunliang/PathRings/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "PathRings",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0585-1",
            "metadata": {
                "abstract": "© 2015 Zhu et al.; licensee BioMed Central.Background: High-throughput methods are generating biological data on a vast scale. In many instances, genomic, transcriptomic, and proteomic data must be interpreted in the context of signaling and metabolic pathways to yield testable hypotheses. Since humans can interpret visual information rapidly, a means for interactive visual exploration that lets biologists interpret such data in a comprehensive and exploratory manner would be invaluable. However, humans have limited memory capacity. Current visualization tools have limited viewing and manipulation capabilities to address complex data analysis problems, and visual exploratory tools are needed to reduce the high mental workload imposed on biologists. Results: We present PathRings, a new interactive web-based, scalable biological pathway visualization tool for biologists to explore and interpret biological pathways. PathRings integrates metabolic and signaling pathways from Reactome in a single compound graph visualization, and uses color to highlight genes and pathways affected by input data. Pathways are available for multiple species and analysis of user-defined species or input is also possible. PathRings permits an overview of the impact of gene expression data on all pathways to facilitate visual pattern finding. Detailed pathways information can be opened in new visualizations while maintaining the overview, that form a visual exploration provenance. A dynamic multi-view bubbles interface is designed to support biologists' analytical tasks by letting users construct incremental views that further reflect biologists' analytical process. This approach decomposes complex tasks into simpler ones and automates multi-view management. Conclusions: PathRings has been designed to accommodate interactive visual analysis of experimental data in the context of pathways defined by Reactome. Our new approach to interface design can effectively support comparative tasks over substantially larger collection than existing tools. The dynamic interaction among multi-view dataset visualization improves the data exploration. PathRings is available free at http://raven.anr.udel.edu/~sunliang/PathRingsand the source code is hosted on Github: https://github.com/ivcl/PathRings.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Fang J."
                    },
                    {
                        "name": "Garbarino A."
                    },
                    {
                        "name": "Schmidt C."
                    },
                    {
                        "name": "Sun L."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "citationCount": 6,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PathRings: A web-based tool for exploration of ortholog and expression data in biological pathways"
            },
            "pmcid": "PMC4436019",
            "pmid": "25982732"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
