{
    "additionDate": "2020-01-09T17:40:58Z",
    "biotoolsCURIE": "biotools:PPR-SSM",
    "biotoolsID": "PPR-SSM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alamurias@lasige.di.fc.ul.pt",
            "name": "Andre Lamurias",
            "orcidid": "https://orcid.org/0000-0001-7965-6536",
            "typeEntity": "Person"
        }
    ],
    "description": "personalized PageRank and semantic similarity measures for entity linking.\n\nBACKGROUND:Biomedical literature concerns a wide range of concepts, requiring controlled vocabularies to maintain a consistent terminology across different research groups. However, as new concepts are introduced, biomedical literature is prone to ambiguity, specifically in fields that are advancing more rapidly, for example, drug design and development. Entity linking is a text mining task that aims at linking entities mentioned in the literature to concepts in a knowledge base. For example, entity linking can help finding all documents that mention the same concept and improve relation extraction methods. Existing approaches focus on the local similarity of each entity and the global coherence of all entities in a document, but do not take into account the semantics of the domain. RESULTS:We propose a method, PPR-SSM, to link entities found in documents to concepts from domain-specific ontologies",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lasigeBioTM/PPRSSM",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2020-12-05T14:35:13Z",
    "name": "PPR-SSM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3157-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Biomedical literature concerns a wide range of concepts, requiring controlled vocabularies to maintain a consistent terminology across different research groups. However, as new concepts are introduced, biomedical literature is prone to ambiguity, specifically in fields that are advancing more rapidly, for example, drug design and development. Entity linking is a text mining task that aims at linking entities mentioned in the literature to concepts in a knowledge base. For example, entity linking can help finding all documents that mention the same concept and improve relation extraction methods. Existing approaches focus on the local similarity of each entity and the global coherence of all entities in a document, but do not take into account the semantics of the domain. Results: We propose a method, PPR-SSM, to link entities found in documents to concepts from domain-specific ontologies. Our method is based on Personalized PageRank (PPR), using the relations of the ontology to generate a graph of candidate concepts for the mentioned entities. We demonstrate how the knowledge encoded in a domain-specific ontology can be used to calculate the coherence of a set of candidate concepts, improving the accuracy of entity linking. Furthermore, we explore weighting the edges between candidate concepts using semantic similarity measures (SSM). We show how PPR-SSM can be used to effectively link named entities to biomedical ontologies, namely chemical compounds, phenotypes, and gene-product localization and processes. Conclusions: We demonstrated that PPR-SSM outperforms state-of-the-art entity linking methods in four distinct gold standards, by taking advantage of the semantic information contained in ontologies. Moreover, PPR-SSM is a graph-based method that does not require training data. Our method improved the entity linking accuracy of chemical compounds by 0.1385 when compared to a method that does not use SSMs.",
                "authors": [
                    {
                        "name": "Lamurias A."
                    },
                    {
                        "name": "Ruas P."
                    },
                    {
                        "name": "Couto F.M."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PPR-SSM: Personalized PageRank and semantic similarity measures for entity linking"
            },
            "pmcid": "PMC6819326",
            "pmid": "31664891"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1
}