{
    "additionDate": "2020-01-14T09:35:11Z",
    "biotoolsCURIE": "biotools:Manhattan",
    "biotoolsID": "Manhattan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anuj.goel@well.ox.ac.uk",
            "name": "Anuj Goel",
            "orcidid": "https://orcid.org/0000-0003-2307-4021",
            "typeEntity": "Person"
        }
    ],
    "description": "Displaying genome-wide association summary statistics with multiple annotation layers.\n\nA useful way to summarize genome-wide association data is with a Manhattan plot. This type of plot has a point for every SNP or location tested with the position in the genome along the x-axis and the -log10 p-value on the y-axis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://genome.sph.umich.edu/wiki/Code_Sample:_Generating_Manhattan_Plots_in_R",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-22T14:24:10Z",
    "name": "Manhattan",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3201-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Over the last 10 years, there have been over 3300 genome-wide association studies (GWAS). Almost every GWAS study provides a Manhattan plot either as a main figure or in the supplement. Several software packages can generate a Manhattan plot, but they are all limited in the extent to which they can annotate gene-names, allele frequencies, and variants having high impact on gene function or provide any other added information or flexibility. Furthermore, in a conventional Manhattan plot, there is no way of distinguishing a locus identified due to a single variant with very significant p-value from a locus with multiple variants which appear to be in a haplotype block having very similar p-values. Results: Here we present a software tool written in R, which generates a transposed Manhattan plot along with additional features like variant consequence and minor allele frequency to annotate the plot and addresses these limitations. The software also gives flexibility on how and where the user wants to display the annotations. The software can be downloaded from CRAN repository and also from the GitHub project page. Conclusions: We present a major step up to the existing conventional Manhattan plot generation tools. We hope this form of display along with the added annotations will bring more insight to the reader from this new Manhattan++ plot.",
                "authors": [
                    {
                        "name": "Farrall M."
                    },
                    {
                        "name": "Goel A."
                    },
                    {
                        "name": "Grace C."
                    },
                    {
                        "name": "Watkins H."
                    }
                ],
                "date": "2019-11-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Manhattan++: Displaying genome-wide association summary statistics with multiple annotation layers"
            },
            "pmcid": "PMC6882345",
            "pmid": "31775616"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
