{
    "additionDate": "2018-07-02T23:46:57Z",
    "biotoolsCURIE": "biotools:dbcan2",
    "biotoolsID": "dbcan2",
    "collectionID": [
        "HMMER"
    ],
    "credit": [
        {
            "email": "yanbin.yin@gmail.com",
            "name": "Yanbin Yin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated Carbohydrate-active enzyme ANnotation. Three state-of-the-art tools for CAZome (all CAZymes of a genome) annotation: (i) HMMER search against the dbCAN HMM (hidden Markov model) database; (ii) DIAMOND search against the CAZy pre-annotated CAZyme sequence database and (iii) Hotpep search against the conserved CAZyme short peptide database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cys.bios.niu.edu/dbCAN2/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://cys.bios.niu.edu/dbCAN2/",
    "lastUpdate": "2019-03-13T13:00:37Z",
    "name": "dbCAN2",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky418",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Complex carbohydrates of plants are the main food sources of animals and microbes, and serve as promising renewable feedstock for biofuel and biomaterial production. Carbohydrate active enzymes (CAZymes) are the most important enzymes for complex carbohydrate metabolism. With an increasing number of plant and plant-associated microbial genomes and metagenomes being sequenced, there is an urgent need of automatic tools for genomic data mining of CAZymes. We developed the dbCAN web server in 2012 to provide a public service for automated CAZyme annotation for newly sequenced genomes. Here, dbCAN2 (http://cys.bios.niu.edu/dbCAN2) is presented as an updated meta server, which integrates three state-of-the-art tools for CAZome (all CAZymes of a genome) annotation: (i) HMMER search against the dbCAN HMM (hidden Markov model) database; (ii) DIAMOND search against the CAZy pre-annotated CAZyme sequence database and (iii) Hotpep search against the conserved CAZyme short peptide database. Combining the three outputs and removing CAZymes found by only one tool can significantly improve the CAZome annotation accuracy. In addition, dbCAN2 now also accepts nucleotide sequence submission, and offers the service to predict physically linked CAZyme gene clusters (CGCs), which will be a very useful online tool for identifying putative polysaccharide utilization loci (PULs) in microbial genomes or metagenomes.",
                "authors": [
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Yohe T."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Entwistle S."
                    },
                    {
                        "name": "Wu P."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Busk P.K."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 427,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DbCAN2: A meta server for automated carbohydrate-active enzyme annotation"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}