{
    "accessibility": "Open access",
    "additionDate": "2022-06-11T22:45:55.430876Z",
    "biotoolsCURIE": "biotools:regcnn",
    "biotoolsID": "regcnn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "thyangza1025@nuk.edu.tw",
            "name": "Tzu-Hsien Yang",
            "typeEntity": "Person"
        },
        {
            "name": "Kai-Chi Tu"
        },
        {
            "name": "Ya-Chiao Yang"
        }
    ],
    "description": "Identifying Drosophila genome-wide cis-regulatory modules via integrating the local patterns between epigenetic marks and TF binding motifs",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://cobisHSS0.im.nuk.edu.tw/regCNN/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-11T22:45:55.433309Z",
    "name": "regCNN",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.12.015",
            "metadata": {
                "abstract": "© 2021 The AuthorsTranscription regulation in metazoa is controlled by the binding events of transcription factors (TFs) or regulatory proteins on specific modular DNA regulatory sequences called cis-regulatory modules (CRMs). Understanding the distributions of CRMs on a genomic scale is essential for constructing the metazoan transcriptional regulatory networks that help diagnose genetic disorders. While traditional reporter-assay CRM identification approaches can provide an in-depth understanding of functions of some CRM, these methods are usually cost-inefficient and low-throughput. It is generally believed that by integrating diverse genomic data, reliable CRM predictions can be made. Hence, researchers often first resort to computational algorithms for genome-wide CRM screening before specific experiments. However, current existing in silico methods for searching potential CRMs were restricted by low sensitivity, poor prediction accuracy, or high computation time from TFBS composition combinatorial complexity. To overcome these obstacles, we designed a novel CRM identification pipeline called regCNN by considering the base-by-base local patterns in TF binding motifs and epigenetic profiles. On the test set, regCNN shows an accuracy/auROC of 84.5%/92.5% in CRM identification. And by further considering local patterns in epigenetic profiles and TF binding motifs, it can accomplish 4.7% (92.5%–87.8%) improvement in the auROC value over the average value-based pure multi-layer perceptron model. We also demonstrated that regCNN outperforms all currently available tools by at least 11.3% in auROC values. Finally, regCNN is verified to be robust against its resizing window hyperparameter in dealing with the variable lengths of CRMs. The model of regCNN can be downloaded athttp://cobisHSS0.im.nuk.edu.tw/regCNN/.",
                "authors": [
                    {
                        "name": "Tu K.-C."
                    },
                    {
                        "name": "Yang T.-H."
                    },
                    {
                        "name": "Yang Y.-C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "regCNN: identifying Drosophila genome-wide cis-regulatory modules via integrating the local patterns in epigenetic marks and transcription factor binding motifs"
            },
            "pmcid": "PMC8724954",
            "pmid": "35035784"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
