
{
    "credit": [
        {
            "email": "szoellne@umich.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://web.stanford.edu/group/pritchardlab/treeld/TreeLD.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "Shell"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Quantitative genetics",
                "uri": "http://edamontology.org/topic_3055"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We outline a general coalescent framework for using genotype data in linkage disequilibrium-based mapping studies. Our approach unifies two main goals of gene mapping that have generally been treated separately in the past: detecting association (i.e., significance testing) and estimating the location of the causative variation. To tackle the problem, we separate the inference into two stages. First, we use Markov chain Monte Carlo to sample from the posterior distribution of coalescent genealogies of all the sampled chromosomes without regard to phenotype. Then, averaging across genealogies, we estimate the likelihood of the phenotype data under various models for mutation and penetrance at an unobserved disease locus. The essential signal that these models look for is that in the presence of disease susceptibility variants in a region, there is nonrandom clustering of the chromosomes on the tree according to phenotype. The extent of nonrandom clustering is captured by the likelihood and can be used to construct significance tests or Bayesian posterior distributions for location. A novelty of our framework is that it can naturally accommodate quantitative data. We describe applications of the method to simulated data and to data from a Mendelian locus (CFTR, responsible for cystic fibrosis) and from a proposed complex trait locus (calpain-10, implicated in type 2 diabetes). Copyright © 2005 by the Genetics Society of America.",
            "authors": [
                "Zollner S.",
                "Pritchard J.K."
            ],
            "cit_count": 91,
            "doi": "10.1534/genetics.104.031799",
            "journal": "Genetics",
            "title": "Coalescent-based association mapping and fine mapping of complex trait loci",
            "type": "Primary",
            "year": "2005-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:treeld",
        "biotoolsID": "treeld",
        "description": "Performs a multipoint LD-analysis by inferring the ancestry of a genomic region and analyzing this ancestry for signals of disease mutations. The generated likelihoods can be used to test for the presence of a disease locus and to fine-map its location.",
        "homepage": "https://sph.umich.edu/csg/software_pages/treeld.html",
        "name": "TreeLD"
    }
}