{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.csc.kth.se/~arve"}],"documentation":[{"type":"GENERAL","url":"http://excap.sbc.su.se"}],"function":[{"operation":[{"term":"Search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/excap-2-0-choose-informative-markers-dna-sequences.html"}],"publication":[{"abstract":"Genetic markers, defined as variable regions of DNA, can be utilized for distinguishing individuals or populations. As long as markers are independent, it is easy to combine the information they provide. For nonrecombinant sequences like mtDNA, choosing the right set of markers for forensic applications can be difficult and requires careful consideration. In particular, one wants to maximize the utility of the markers. Until now, this has mainly been done by hand. We propose an algorithm that finds the most informative subset of a set of markers. The algorithm uses a depth first search combined with a branch-and-bound approach. Since the worst case complexity is exponential, we also propose some data-reduction techniques and a heuristic. We implemented the algorithm and applied it to two forensic caseworks using mitochondrial DNA, which resulted in marker sets with significantly improved haplotypic diversity compared to previous suggestions. Additionally, we evaluated the quality of the estimation with an artificial dataset of mtDNA. The heuristic is shown to provide extensive speedup at little cost in accuracy. © 2013 Kahles et al.","authors":["Kahles A.","Sarqume F.","Savolainen P.","Arvestad L."],"cit_count":0,"doi":"10.1371/journal.pone.0079012","journal":"PLoS ONE","title":"Excap: Maximization of haplotypic diversity of linked markers","type":"Primary","year":"2013-11-07"}],"summary":{"biotoolsCURIE":"biotools:excap","biotoolsID":"excap","description":"Finding an informative subset of a set of markers.Genetic markers, defined as variable regions of DNA, can be utilized for distinguishing individuals or populations. As long as markers are independent, it is easy to combine the information they provide.\nIt uses a depth-first search combined with a branch-and-bound approach to search the space of marker sets of a given size.","homepage":"http://excap.sbc.su.se/","name":"Excap","version":["2.0"]}}