{
    "accessibility": "Open access",
    "additionDate": "2022-07-14T06:03:16.645664Z",
    "biotoolsCURIE": "biotools:autocov",
    "biotoolsID": "autocov",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sunkim.bioinfo@snu.ac.kr",
            "name": "Sun Kim",
            "orcidid": "https://orcid.org/0000-0001-5385-9546",
            "typeEntity": "Person"
        }
    ],
    "description": "AutoCoV, a deep learning method with multiple loss object, that can track the early spread of COVID-19 in terms of spatial and temporal patterns until the disease is fully spread over the world in July 2020.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/smaster7/AutoCoV",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:55:25.381436Z",
    "license": "Not licensed",
    "name": "AutoCoV",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04679-x",
            "metadata": {
                "abstract": "Background: The widely spreading coronavirus disease (COVID-19) has three major spreading properties: pathogenic mutations, spatial, and temporal propagation patterns. We know the spread of the virus geographically and temporally in terms of statistics, i.e., the number of patients. However, we are yet to understand the spread at the level of individual patients. As of March 2021, COVID-19 is wide-spread all over the world with new genetic variants. One important question is to track the early spreading patterns of COVID-19 until the virus has got spread all over the world. Results: In this work, we proposed AutoCoV, a deep learning method with multiple loss object, that can track the early spread of COVID-19 in terms of spatial and temporal patterns until the disease is fully spread over the world in July 2020. Performances in learning spatial or temporal patterns were measured with two clustering measures and one classification measure. For annotated SARS-CoV-2 sequences from the National Center for Biotechnology Information (NCBI), AutoCoV outperformed seven baseline methods in our experiments for learning either spatial or temporal patterns. For spatial patterns, AutoCoV had at least 1.7-fold higher clustering performances and an F1 score of 88.1%. For temporal patterns, AutoCoV had at least 1.6-fold higher clustering performances and an F1 score of 76.1%. Furthermore, AutoCoV demonstrated the robustness of the embedding space with an independent dataset, Global Initiative for Sharing All Influenza Data (GISAID). Conclusions: In summary, AutoCoV learns geographic and temporal spreading patterns successfully in experiments on NCBI and GISAID datasets and is the first of its kind that learns virus spreading patterns from the genome sequences, to the best of our knowledge. We expect that this type of embedding method will be helpful in characterizing fast-evolving pandemics.",
                "authors": [
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Pak M."
                    },
                    {
                        "name": "Shin Y."
                    },
                    {
                        "name": "Sung I."
                    }
                ],
                "citationCount": 2,
                "date": "2022-03-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AutoCoV: tracking the early spread of COVID-19 in terms of the spatial and temporal patterns from embedding space by K-mer based deep learning"
            },
            "pmcid": "PMC9036508",
            "pmid": "35468739"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
