{
    "additionDate": "2019-11-14T20:00:03Z",
    "biotoolsCURIE": "biotools:GTDB",
    "biotoolsID": "GTDB",
    "confidence_flag": "tool",
    "description": "Selection of representative genomes for 24,706 bacterial and archaeal species clusters provide a complete genome-based taxonomy | Toolkit for establishing, updating, and validating GTDB species clusters",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://gtdb.ecogenomic.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-05T13:04:31.627155Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Ecogenomics/gtdb-species-clusters"
        }
    ],
    "name": "GTDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/771964"
        },
        {
            "doi": "10.1093/nar/gkab776",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.The Genome Taxonomy Database (GTDB; https://gtdb.ecogenomic.org) provides a phylogenetically consistent and rank normalized genome-based taxonomy for prokaryotic genomes sourced from the NCBI Assembly database. GTDB R06-RS202 spans 254 090 bacterial and 4316 archaeal genomes, a 270% increase since the introduction of the GTDB in November, 2017. These genomes are organized into 45 555 bacterial and 2339 archaeal species clusters which is a 200% increase since the integration of species clusters into the GTDB in June, 2019. Here, we explore prokaryotic diversity from the perspective of the GTDB and highlight the importance of metagenome-assembled genomes in expanding available genomic representation. We also discuss improvements to the GTDB website which allow tracking of taxonomic changes, easy assessment of genome assembly quality, and identification of genomes assembled from type material or used as species representatives. Methodological updates and policy changes made since the inception of the GTDB are then described along with the procedure used to update species clusters in the GTDB. We conclude with a discussion on the use of average nucleotide identities as a pragmatic approach for delineating prokaryotic species.",
                "authors": [
                    {
                        "name": "Chaumeil P.-A."
                    },
                    {
                        "name": "Chuvochina M."
                    },
                    {
                        "name": "Hugenholtz P."
                    },
                    {
                        "name": "Mussig A.J."
                    },
                    {
                        "name": "Parks D.H."
                    },
                    {
                        "name": "Rinke C."
                    }
                ],
                "citationCount": 20,
                "date": "2022-01-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GTDB: An ongoing census of bacterial and archaeal diversity through a phylogenetically consistent, rank normalized and complete genome-based taxonomy"
            },
            "pmcid": "PMC8728215",
            "pmid": "34520557"
        },
        {
            "doi": "10.1038/s41564-021-00918-8",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature Limited.The accrual of genomic data from both cultured and uncultured microorganisms provides new opportunities to develop systematic taxonomies based on evolutionary relationships. Previously, we established a bacterial taxonomy through the Genome Taxonomy Database. Here, we propose a standardized archaeal taxonomy that is derived from a 122-concatenated-protein phylogeny that resolves polyphyletic groups and normalizes ranks based on relative evolutionary divergence. The resulting archaeal taxonomy, which forms part of the Genome Taxonomy Database, is stable for a range of phylogenetic variables including marker gene selection, inference methods, corrections for rate heterogeneity and compositional bias, tree rooting scenarios and expansion of the genome database. Rank normalization is shown to robustly correct for substitution rates varying up to 30-fold using simulated datasets. Taxonomic curation follows the rules of the International Code of Nomenclature of Prokaryotes while taking into account proposals to formally recognize the rank of phylum and to use genome sequences as type material. This taxonomy is based on 2,392 archaeal genomes, 93.3% of which required one or more changes to their existing taxonomy, mainly owing to incomplete classification. We identify 16 archaeal phyla and reclassify 3 major monophyletic units from the former Euryarchaeota and one phylum that unites the Thaumarchaeota–Aigarchaeota–Crenarchaeota–Korarchaeota (TACK) superphylum into a single phylum.",
                "authors": [
                    {
                        "name": "Chaumeil P.-A."
                    },
                    {
                        "name": "Chuvochina M."
                    },
                    {
                        "name": "Davin A.A."
                    },
                    {
                        "name": "Hugenholtz P."
                    },
                    {
                        "name": "Mussig A.J."
                    },
                    {
                        "name": "Parks D.H."
                    },
                    {
                        "name": "Rinke C."
                    },
                    {
                        "name": "Waite D.W."
                    },
                    {
                        "name": "Whitman W.B."
                    }
                ],
                "citationCount": 25,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Nature Microbiology",
                "title": "A standardized archaeal taxonomy for the Genome Taxonomy Database"
            },
            "pmid": "34155373"
        },
        {
            "doi": "10.1038/s41587-020-0501-8",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature America, Inc.The Genome Taxonomy Database is a phylogenetically consistent, genome-based taxonomy that provides rank-normalized classifications for ~150,000 bacterial and archaeal genomes from domain to genus. However, almost 40% of the genomes in the Genome Taxonomy Database lack a species name. We address this limitation by using commonly accepted average nucleotide identity criteria to set bounds on species and propose species clusters that encompass all publicly available bacterial and archaeal genomes. Unlike previous average nucleotide identity studies, we chose a single representative genome to serve as the effective nomenclatural ‘type’ defining each species. Of the 24,706 proposed species clusters, 8,792 are based on published names. We assigned placeholder names to the remaining 15,914 species clusters to provide names to the growing number of genomes from uncultivated species. This resource provides a complete domain-to-species taxonomic framework for bacterial and archaeal genomes, which will facilitate research on uncultivated species and improve communication of scientific results.",
                "authors": [
                    {
                        "name": "Chaumeil P.-A."
                    },
                    {
                        "name": "Chuvochina M."
                    },
                    {
                        "name": "Hugenholtz P."
                    },
                    {
                        "name": "Mussig A.J."
                    },
                    {
                        "name": "Parks D.H."
                    },
                    {
                        "name": "Rinke C."
                    }
                ],
                "citationCount": 295,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "A complete domain-to-species taxonomy for Bacteria and Archaea"
            },
            "pmid": "32341564"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
