{
    "accessibility": "Open access",
    "additionDate": "2022-02-07T22:47:17.895942Z",
    "biotoolsCURIE": "biotools:pyhi",
    "biotoolsID": "pyhi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xuewu.zhang@utsouthwestern.edu",
            "name": "Xuewu Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "A graphical user interface program for finding symmetry of helical assembly through Fourier-Bessel indexing of electron microscopic data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Diffraction data reduction",
                    "uri": "http://edamontology.org/operation_3447"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xuewuzhang-UTSW/PyHI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:12:20.480800Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.youtube.com/watch?v=KxAeo90CIt4&ab_channel=XuewuZhang"
        }
    ],
    "name": "PyHI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/pro.4186",
            "metadata": {
                "abstract": "Many macromolecules form helical assemblies to carry out their functions. Helical reconstruction from electron microscopic images is a powerful approach for solving high-resolution structures of such assemblies. Determination of the symmetry parameters of the helical assemblies is a prerequisite step in helical reconstruction. The most widely used method for deducing the symmetry is through Fourier–Bessel indexing the diffraction pattern of the helical assemblies. This method, however, often leads to incorrect solutions, due to intrinsic ambiguities in indexing helical diffraction patterns. Here, we present Python-based Helix Indexer (PyHI), which provides a graphical user interface (GUI) to guide the users through the process of symmetry determination. Diffraction patterns can be read into the program directly or calculated on the fly from two-dimensional class averages of helical assemblies. PyHI allows deducing the Bessel orders of diffraction peaks by using both the amplitudes and phases of the diffraction data. Based on the Bessel orders of two unit vectors, the Fourier space lattice is constructed with minimal user inputs. The program then uses a refinement algorithm to optimize the Fourier space lattice, and subsequently generate the helical assembly in real space. The program provides both a publication-quality graphic representation of the helical assembly and the symmetry parameters required for subsequent helical reconstruction steps.",
                "authors": [
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 10,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Python-based Helix Indexer: A graphical user interface program for finding symmetry of helical assembly through Fourier–Bessel indexing of electron microscopic data"
            },
            "pmcid": "PMC8740834",
            "pmid": "34529294"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
