{"credit":[{"email":"darui.xu@utsouthwestern.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www4.utsouthwestern.edu/chooklab/contactus.htm"}],"documentation":[{"type":"GENERAL","url":"http://prodata.swmed.edu/LRNes/predictNES/documentation.php"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"language":["PHP"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/locnes-locating-classical-ness-in-crm1-cargo-proteins.html"}],"publication":[{"abstract":"© 2014 The Author. Published by Oxford University Press. Motivation: Classical nuclear export signals (NESs) are short cognate peptides that direct proteins out of the nucleus via the CRM1-mediated export pathway. CRM1 regulates the localization of hundreds of macromolecules involved in various cellular functions and diseases. Due to the diverse and complex nature of NESs, reliable prediction of the signal remains a challenge despite several attempts made in the last decade. Results: We present a new NES predictor, LocNES. LocNES scans query proteins for NES consensus-fitting peptides and assigns these peptides probability scores using Support Vector Machine model, whose feature set includes amino acid sequence, disorder propensity, and the rank of position-specific scoring matrix score. LocNES demonstrates both higher sensitivity and precision over existing NES prediction tools upon comparative analysis using experimentally identified NESs.","authors":["Xu D.","Marquis K.","Pei J.","Fu S.-C.","Catatay T.","Grishin N.V.","Chook Y.M."],"cit_count":34,"journal":"Bioinformatics","pmid":"25515756","title":"LocNES: A computational tool for locating classical NESs in CRM1 cargo proteins","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:locnes","biotoolsID":"locnes","description":"Support Vector Machine (SVM) predictor that locates classical nuclear export signals (NESs) in CRM1 cargoes. Export-Karyopherinβ CRM1 recognizes hundreds of broadly functioning proteins. Most CRM1 cargoes contain the classical NES (also known as leucine-rich NESs), a peptide with 8-15 amino acids, regularly spaced with conserved hydrophobic residues.","homepage":"http://prodata.swmed.edu/LocNES/LocNES.php","name":"LocNES"}}