{
    "additionDate": "2020-01-14T19:38:47Z",
    "biotoolsCURIE": "biotools:DeepShape",
    "biotoolsID": "DeepShape",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zengjy321@tsinghua.edu.cn",
            "name": "Jianyang Zeng",
            "typeEntity": "Person"
        },
        {
            "email": "tingchen@tsinghua.edu.cn",
            "name": "Ting Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Estimating isoform-level ribosome abundance and distribution with Ribo-seq data.\nFor the estimation of Isoform-Level Ribosome Abundance and Distribution Accurately which needs Ribo-seq data only.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cuihf06/DeepShape",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-20T11:41:59Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cuihf06/DeepShape/issues"
        }
    ],
    "name": "DeepShape",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3244-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Ribosome profiling brings insight to the process of translation. A basic step in profile construction at transcript level is to map Ribo-seq data to transcripts, and then assign a huge number of multiple-mapped reads to similar isoforms. Existing methods either discard the multiple mapped-reads, or allocate them randomly, or assign them proportionally according to transcript abundance estimated from RNA-seq data. Results: Here we present DeepShape, an RNA-seq free computational method to estimate ribosome abundance of isoforms, and simultaneously compute their ribosome profiles using a deep learning model. Our simulation results demonstrate that DeepShape can provide more accurate estimations on both ribosome abundance and profiles when compared to state-of-the-art methods. We applied DeepShape to a set of Ribo-seq data from PC3 human prostate cancer cells with and without PP242 treatment. In the four cell invasion/metastasis genes that are translationally regulated by PP242 treatment, different isoforms show very different characteristics of translational efficiency and regulation patterns. Transcript level ribosome distributions were analyzed by \"Codon Residence Index (CRI)\" proposed in this study to investigate the relative speed that a ribosome moves on a codon compared to its synonymous codons. We observe consistent CRI patterns in PC3 cells. We found that the translation of several codons could be regulated by PP242 treatment. Conclusion: In summary, we demonstrate that DeepShape can serve as a powerful tool for Ribo-seq data analysis.",
                "authors": [
                    {
                        "name": "Cui H."
                    },
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Zeng J."
                    },
                    {
                        "name": "Chen T."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeepShape: Estimating isoform-level ribosome abundance and distribution with Ribo-seq data"
            },
            "pmcid": "PMC6923924",
            "pmid": "31861979"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}