{
    "accessibility": "Open access",
    "additionDate": "2023-02-10T14:31:08.029654Z",
    "biotoolsCURIE": "biotools:tssnote-cyaprombert",
    "biotoolsID": "tssnote-cyaprombert",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "eunylee@khu.ac.kr",
            "name": "Eun Yeol Lee",
            "typeEntity": "Person"
        },
        {
            "name": "Dung Hoang Anh Mai"
        },
        {
            "name": "Linh Thanh Nguyen"
        }
    ],
    "description": "A repo containing supplemental data for TSSNote-CyaPromBERT an integrated pipeline for constructing curated promoter prediction tools using SOTA BERT through public dRNA-seq datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hanepira/TSSnote-CyaPromBert",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-10T14:31:08.032330Z",
    "license": "Not licensed",
    "name": "TSSNote-CyaPromBERT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.1067562",
            "metadata": {
                "abstract": "Copyright © 2022 Mai, Nguyen and Lee.Since the introduction of the first transformer model with a unique self-attention mechanism, natural language processing (NLP) models have attained state-of-the-art (SOTA) performance on various tasks. As DNA is the blueprint of life, it can be viewed as an unusual language, with its characteristic lexicon and grammar. Therefore, NLP models may provide insights into the meaning of the sequential structure of DNA. In the current study, we employed and compared the performance of popular SOTA NLP models (i.e., XLNET, BERT, and a variant DNABERT trained on the human genome) to predict and analyze the promoters in freshwater cyanobacterium Synechocystis sp. PCC 6803 and the fastest growing cyanobacterium Synechococcus elongatus sp. UTEX 2973. These freshwater cyanobacteria are promising hosts for phototrophically producing value-added compounds from CO2. Through a custom pipeline, promoters and non-promoters from Synechococcus elongatus sp. UTEX 2973 were used to train the model. The trained model achieved an AUROC score of 0.97 and F1 score of 0.92. During cross-validation with promoters from Synechocystis sp. PCC 6803, the model achieved an AUROC score of 0.96 and F1 score of 0.91. To increase accessibility, we developed an integrated platform (TSSNote-CyaPromBERT) to facilitate large dataset extraction, model training, and promoter prediction from public dRNA-seq datasets. Furthermore, various visualization tools have been incorporated to address the “black box” issue of deep learning and feature analysis. The learning transfer ability of large language models may help identify and analyze promoter regions for newly isolated strains with similar lineages.",
                "authors": [
                    {
                        "name": "Lee E.Y."
                    },
                    {
                        "name": "Mai D.H.A."
                    },
                    {
                        "name": "Nguyen L.T."
                    }
                ],
                "date": "2022-11-29T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "TSSNote-CyaPromBERT: Development of an integrated platform for highly accurate promoter prediction and visualization of Synechococcus sp. and Synechocystis sp. through a state-of-the-art natural language processing model BERT"
            },
            "pmcid": "PMC9745317",
            "pmid": "36523764"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
