{
    "accessibility": "Open access",
    "additionDate": "2023-03-15T16:42:23.287361Z",
    "biotoolsCURIE": "biotools:ctc_5",
    "biotoolsID": "ctc_5",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ffrenchg@tcd.ie",
            "name": "B. Ffrench",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel digital pathology approach to characterise circulating tumour cell biodiversity.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CTC5/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2023-03-15T16:42:23.291487Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.tcd.ie/medicine/histopathology/research/ctc-5/index.php"
        }
    ],
    "name": "CTC-5",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.HELIYON.2023.E13044",
            "metadata": {
                "abstract": "Metastatic progression and tumor evolution complicates the clinical management of cancer patients. Circulating tumor cell (CTC) characterization is a growing discipline that aims to elucidate tumor metastasis and evolution processes. CTCs offer the clinical potential to monitor cancer patients for therapy response, disease relapse, and screen ‘at risk' groups for the onset of malignancy. However, such clinical utility is currently limited to breast, prostate, and colorectal cancer patients. Further understanding of the basic CTC biology of other malignancies is required to progress them towards clinical utility. Unfortunately, such basic clinical research is often limited by restrictive characterization methods and high-cost barrier to entry for CTC isolation and imaging infrastructure. As experimental clinical results on applications of CTC are accumulating, it is becoming clear that a two-tier system of CTC isolation and characterization is required. The first tier is to facilitate basic research into CTC characterization. This basic research then informs a second tier specialised in clinical prognostic and diagnostic testing. This study presented in this manuscript describes the development and application of a low-cost, CTC isolation and characterization pipeline; CTC-5. This approach uses an established ‘isolation by size’ approach (ScreenCell Cyto) and combines histochemical morphology stains and multiparametric immunofluorescence on the same isolated CTCs. This enables capture and characterization of CTCs independent of biomarker-based pre-selection and accommodates both single CTCs and clusters of CTCs. Additionally, the developed open-source software is provided to facilitate the synchronization of microscopy data from multiple sources (https://github.com/CTC5/). This enables high parameter histochemical and immunofluorescent analysis of CTCs with existing microscopy infrastructure without investment in CTC specific imaging hardware. Our approach confirmed by the number of successful tests represents a potential major advance towards highly accessible low-cost technology aiming at the basic research tier of CTC isolation and characterization. The biomarker independent approach facilitates closing the gap between malignancies with poorly, and well-defined CTC phenotypes. As is currently the case for some of the most commonly occurring breast, prostate and colorectal cancers, such advances will ultimately benefit the patient, as early detection of relapse or onset of malignancy strongly correlates with their prognosis.",
                "authors": [
                    {
                        "name": "AbuSaadeh F."
                    },
                    {
                        "name": "Brooks D.A."
                    },
                    {
                        "name": "Brooks R.D."
                    },
                    {
                        "name": "Charmsaz S."
                    },
                    {
                        "name": "Cocchiglia S."
                    },
                    {
                        "name": "Ffrench B."
                    },
                    {
                        "name": "Flavin R."
                    },
                    {
                        "name": "Gallagher M."
                    },
                    {
                        "name": "Gleeson N."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Kamran W."
                    },
                    {
                        "name": "Kashdan E."
                    },
                    {
                        "name": "Martin C."
                    },
                    {
                        "name": "O'Brien C."
                    },
                    {
                        "name": "O'Leary J.J."
                    },
                    {
                        "name": "O'Riain C."
                    },
                    {
                        "name": "O'Toole S.A."
                    },
                    {
                        "name": "Scholz D."
                    },
                    {
                        "name": "Selemidis S."
                    },
                    {
                        "name": "Spillane C.D."
                    },
                    {
                        "name": "Vareslija D."
                    },
                    {
                        "name": "Young L."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Heliyon",
                "title": "CTC-5: A novel digital pathology approach to characterise circulating tumour cell biodiversity"
            },
            "pmcid": "PMC9898658",
            "pmid": "36747925"
        }
    ],
    "relation": [
        {
            "biotoolsID": "fiji",
            "type": "uses"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
