
{
    "credit": [
        {
            "email": "k.hiller@tu-bs.de",
            "name": "K. Hiller",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.jvirgel.de/faq.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein molecular weight calculation",
                    "uri": "http://edamontology.org/operation_0398"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein isoelectric point calculation",
                    "uri": "http://edamontology.org/operation_0403"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We developed JVirGel, a collection of tools for the simulation and analysis of proteomics data. The software creates and visualizes virtual two-dimensional (2D) protein gels based on the migration behaviour of proteins in dependence of their theoretical molecular weights in combination with their calculated isoelectric points. The utilization of all proteins of an organism of interest deduced from genes of the corresponding genome project in combination with the elimination of obvious membrane proteins permits the creation of an optimized calculated proteome map. The electrophoretic separation behaviour of single proteins is accessible interactively in a Java™ applet (small application in a web browser) by selecting a pI/MW range and an electrophoretic timescale of interest. The calculated pattern of protein spots helps to identify unknown proteins and to localize known proteins during experimental proteomics approaches. Differences between the experimentally observed and the calculated migration behaviour of certain proteins provide first indications for potential protein modification events. When possible, the protein spots are directly linked via a mouse click to the public databases SWISS-PROT and PRODORIC. Additionally, we provide tools for the serial calculation and visualization of specific protein properties like pH dependent charge curves and hydrophobicity profiles. These values are helpful for the rational establishment of protein purification procedures. The proteomics tools are available on the World Wide Web at http://prodoric.tu-bs.de/proteomics.php.",
            "authors": [
                "Hiller K.",
                "Schobert M.",
                "Hundertmark C.",
                "Jahn D.",
                "Munch R."
            ],
            "cit_count": 58,
            "journal": "Nucleic Acids Research",
            "pmid": "12824438",
            "title": "JVirGel: Calculation of virtual two-dimensional protein gels",
            "year": "2003-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jvirgel",
        "biotoolsID": "jvirgel",
        "description": "Creates a virtual 2-D gel based on theoretical molecular weights and calculated isoelectric points from a set of input proteins or proteomes.",
        "homepage": "http://www.jvirgel.de/",
        "name": "JVirGel"
    }
}