{
    "additionDate": "2021-12-13T13:49:34.002800Z",
    "biotoolsCURIE": "biotools:virtualtaste",
    "biotoolsID": "virtualtaste",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "robert.preissner@charite.de",
            "name": "Robert Preissner",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "priyanka.banerjee@charite.de",
            "name": "Priyanka Banerjee",
            "orcidid": "https://orcid.org/0000-0001-8072-5594",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "VirtualTaste is a web server for the prediction of organoleptic properties of chemical compounds. The taste of a chemical compound present in food stimulates us to take in nutrients and avoid poisons. Many active ingredients present in drugs taste bitter and thus are aversive to children as well as many adults. Bitterness of medicines presents compliance problems and early flagging of potential bitterness of a drug candidate may help its further development. Taste prediction of a compound is of large interest for the food industry.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://virtualtaste.charite.de/VirtualTaste",
    "lastUpdate": "2021-12-13T13:49:34.005490Z",
    "name": "VirtualTaste",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB292",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Taste is one of the crucial organoleptic properties involved in the perception of food by humans. Taste of a chemical compound present in food stimulates us to take in food and avoid poisons. Bitter taste of drugs presents compliance problems and early flagging of potential bitterness of a drug candidate may help with its further development. Similarly, the taste of chemicals present in food is important for evaluation of food quality in the industry. In this work, we have implemented machine learning models to predict three different taste endpoints-sweet, bitter and sour. The VirtualTaste models achieved an overall accuracy of 90% and an AUC of 0.98 in 10-fold cross-validation and in an independent test set. The web server takes a two-dimensional chemical structure as input and reports the chemical's taste profile for three tastes-using molecular fingerprints along with confidence scores, including information on similar compounds with known activity from the training set and an overall radar chart. Additionally, insights into 25 bitter receptors are also provided via target prediction for the predicted bitter compounds. VirtualTaste, to the best of our knowledge, is the first freely available web-based platform for the prediction of three different tastes of compounds. It is accessible via http://virtualtaste.charite.de/VirtualTaste/without any login requirements and is free to use.",
                "authors": [
                    {
                        "name": "Fritz F."
                    },
                    {
                        "name": "Preissner R."
                    },
                    {
                        "name": "Banerjee P."
                    }
                ],
                "date": "2021-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VirtualTaste: A web server for the prediction of organoleptic properties of chemical compounds"
            },
            "pmid": "33905509",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ]
}