{
    "additionDate": "2021-01-18T08:57:01Z",
    "biotoolsCURIE": "biotools:pacvr",
    "biotoolsID": "pacvr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.gruenstaeudl@fu-berlin.de",
            "name": "Michael Gruenstaeudl",
            "orcidid": "https://orcid.org/0000-0002-1666-1773",
            "typeEntity": "Person"
        }
    ],
    "description": "plastome assembly coverage visualization in R.\n\n\nVisualizes the coverage depth of a complete plastid genome as well as the equality of its inverted repeat regions in relation to the circular, quadripartite genome structure and the location of individual genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence assembly visualisation",
                    "uri": "http://edamontology.org/operation_3184"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=PACVr",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-03-15T14:33:11Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/michaelgruenstaeudl/PACVr"
        }
    ],
    "name": "PACVr",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3475-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Plastid genomes typically display a circular, quadripartite structure with two inverted repeat regions, which challenges automatic assembly procedures. The correct assembly of plastid genomes is a prerequisite for the validity of subsequent analyses on genome structure and evolution. The average coverage depth of a genome assembly is often used as an indicator of assembly quality. Visualizing coverage depth across a draft genome is a critical step, which allows users to inspect the quality of the assembly and, where applicable, identify regions of reduced assembly confidence. Despite the interplay between genome structure and assembly quality, no contemporary, user-friendly software tool can visualize the coverage depth of a plastid genome assembly while taking its quadripartite genome structure into account. A software tool is needed that fills this void. Results: We introduce 'PACVr', an R package that visualizes the coverage depth of a plastid genome assembly in relation to the circular, quadripartite structure of the genome as well as the individual plastome genes. By using a variable window approach, the tool allows visualizations on different calculation scales. It also confirms sequence equality of, as well as visualizes gene synteny between, the inverted repeat regions of the input genome. As a tool for plastid genomics, PACVr provides the functionality to identify regions of coverage depth above or below user-defined threshold values and helps to identify non-identical IR regions. To allow easy integration into bioinformatic workflows, PACVr can be invoked from a Unix shell, facilitating its use in automated quality control. We illustrate the application of PACVr on four empirical datasets and compare visualizations generated by PACVr with those of alternative software tools. Conclusions: PACVr provides a user-friendly tool to visualize (a) the coverage depth of a plastid genome assembly on a circular, quadripartite plastome map and in relation to individual plastome genes, and (b) gene synteny across the inverted repeat regions. It contributes to optimizing plastid genome assemblies and increasing the reliability of publicly available plastome sequences. The software, example datasets, technical documentation, and a tutorial are available with the package at https://cran.r-project.org/package=PACVr.",
                "authors": [
                    {
                        "name": "Gruenstaeudl M."
                    },
                    {
                        "name": "Jenke N."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PACVr: Plastome assembly coverage visualization in R"
            },
            "pmcid": "PMC7245912",
            "pmid": "32448146"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
