{
    "additionDate": "2021-01-18T07:05:10Z",
    "biotoolsCURIE": "biotools:prap",
    "biotoolsID": "prap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xmshi@sjtu.edu.cn",
            "name": "Xianming Shi",
            "orcidid": "https://orcid.org/0000-0002-8929-4054",
            "typeEntity": "Person"
        }
    ],
    "description": "Pan Resistome analysis pipeline.\n\nPRAP is a platform independent Python3 tool used to analyze pan-resistome characteristics for multiple genomes. It accepts various format of sequence files as input files. The identification of antibiotic resistance genes is mainly based on the Comprehensive Antibiotic Resistance Database (CARD) and ResFinder database.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/syyrjx-hyc/PRAP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-27T16:30:22Z",
    "license": "GPL-3.0",
    "name": "PRAP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3335-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Antibiotic resistance genes (ARGs) can spread among pathogens via horizontal gene transfer, resulting in imparities in their distribution even within the same species. Therefore, a pan-genome approach to analyzing resistomes is necessary for thoroughly characterizing patterns of ARGs distribution within particular pathogen populations. Software tools are readily available for either ARGs identification or pan-genome analysis, but few exist to combine the two functions. Results: We developed Pan Resistome Analysis Pipeline (PRAP) for the rapid identification of antibiotic resistance genes from various formats of whole genome sequences based on the CARD or ResFinder databases. Detailed annotations were used to analyze pan-resistome features and characterize distributions of ARGs. The contribution of different alleles to antibiotic resistance was predicted by a random forest classifier. Results of analysis were presented in browsable files along with a variety of visualization options. We demonstrated the performance of PRAP by analyzing the genomes of 26 Salmonella enterica isolates from Shanghai, China. Conclusions: PRAP was effective for identifying ARGs and visualizing pan-resistome features, therefore facilitating pan-genomic investigation of ARGs. This tool has the ability to further excavate potential relationships between antibiotic resistance genes and their phenotypic traits.",
                "authors": [
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Deng X."
                    },
                    {
                        "name": "Gehring A."
                    },
                    {
                        "name": "Ou H."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Shi X."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PRAP: Pan Resistome analysis pipeline"
            },
            "pmcid": "PMC6964052",
            "pmid": "31941435"
        }
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}