{
    "additionDate": "2017-08-03T18:44:51Z",
    "biotoolsCURIE": "biotools:gunifrac",
    "biotoolsID": "gunifrac",
    "credit": [
        {
            "email": "hongzhe@upenn.edu",
            "name": "Hongzhe Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://statgene.med.upenn.edu/people.htm"
        }
    ],
    "description": "Software which implements a generalized UniFrac distance for analysis of microbiome data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/GUniFrac/GUniFrac.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/GUniFrac/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gunifrac-1-0-generalized-unifrac-distances.html"
        }
    ],
    "name": "GUniFrac",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The human microbiome plays an important role in human disease and health. Identification of factors that affect the microbiome composition can provide insights into disease mechanism as well as suggest ways to modulate the microbiome composition for therapeutical purposes. Distance-based statistical tests have been applied to test the association of microbiome composition with environmental or biological covariates. The unweighted and weighted UniFrac distances are the most widely used distance measures. However, these two measures assign too much weight either to rare lineages or to most abundant lineages, which can lead to loss of power when the important composition change occurs in moderately abundant lineages.Results: We develop generalized UniFrac distances that extend the weighted and unweighted UniFrac distances for detecting a much wider range of biologically relevant changes. We evaluate the use of generalized UniFrac distances in associating microbiome composition with environmental covariates using extensive Monte Carlo simulations. Our results show that tests using the unweighted and weighted UniFrac distances are less powerful in detecting abundance change in moderately abundant lineages. In contrast, the generalized UniFrac distance is most powerful in detecting such changes, yet it retains nearly all its power for detecting rare and highly abundant lineages. The generalized UniFrac distance also has an overall better power than the joint use of unweighted/weighted UniFrac distances. Application to two real microbiome datasets has demonstrated gains in power in testing the associations between human microbiome and diet intakes and habitual smoking. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Bittinger K."
                    },
                    {
                        "name": "Charlson E.S."
                    },
                    {
                        "name": "Hoffmann C."
                    },
                    {
                        "name": "Lewis J."
                    },
                    {
                        "name": "Wu G.D."
                    },
                    {
                        "name": "Collman R.G."
                    },
                    {
                        "name": "Bushman F.D."
                    },
                    {
                        "name": "Li H."
                    }
                ],
                "citationCount": 414,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Associating microbiome composition with environmental covariates using generalized UniFrac distances"
            },
            "pmid": "22711789"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}