{"collectionID": ["BioConductor"], "accessibility": [], "topic": [{"term": "Function analysis", "uri": "http://edamontology.org/topic_1775"}], "owner": "bioconductor_import", "cost": null, "relation": [], "download": [{"url": "http://bioconductor/packages/release/bioc/src/contrib/EWCE_1.2.0.tar.gz", "note": null, "version": null, "type": "Source code"}], "validated": 1, "publication": [{"doi": "10.3389/fnins.2016.00016", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Identification of vulnerable cell types in major brain disorders using single cell transcriptomes and expression weighted cell type enrichment", "abstract": "© 2016 Skene and Grant.The cell types that trigger the primary pathology in many brain diseases remain largely unknown. One route to understanding the primary pathological cell type for a particular disease is to identify the cells expressing susceptibility genes. Although this is straightforward for monogenic conditions where the causative mutation may alter expression of a cell type specific marker, methods are required for the common polygenic disorders. We developed the Expression Weighted Cell Type Enrichment (EWCE) method that uses single cell transcriptomes to generate the probability distribution associated with a gene list having an average level of expression within a cell type. Following validation, we applied EWCE to human genetic data from cases of epilepsy, Schizophrenia, Autism, Intellectual Disability, Alzheimer's disease, Multiple Sclerosis and anxiety disorders. Genetic susceptibility primarily affected microglia in Alzheimer's and Multiple Sclerosis; was shared between interneurons and pyramidal neurons in Autism and Schizophrenia; while intellectual disabilities and epilepsy were attributable to a range of cell-types, with the strongest enrichment in interneurons. We hypothesized that the primary cell type pathology could trigger secondary changes in other cell types and these could be detected by applying EWCE to transcriptome data from diseased tissue. In Autism, Schizophrenia and Alzheimer's disease we find evidence of pathological changes in all of the major brain cell types. These findings give novel insight into the cellular origins and progression in common brain disorders. The methods can be applied to any tissue and disorder and have applications in validating mouse models.", "citationCount": 20, "authors": [{"name": "Skene N.G."}, {"name": "Grant S.G.N."}], "date": "2016-01-01T00:00:00Z", "journal": "Frontiers in Neuroscience"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": "Nathan Skene", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "nathan.skene@gmail.com"}], "biotoolsCURIE": "biotools:ewce", "elixirPlatform": [], "elixirNode": [], "version": ["1.2.0"], "elixir_badge": 0, "homepage": "http://bioconductor.org/packages/release/bioc/html/EWCE.html", "function": [{"note": null, "input": [], "operation": [{"term": "Gene-set enrichment analysis", "uri": "http://edamontology.org/operation_2436"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-11T18:53:51Z", "otherID": [], "description": "Used to determine which cell types are enriched within gene lists. The package provides tools for testing enrichments within simple gene lists (such as human disease associated genes) and those resulting from differential expression studies. The package does not depend upon any particular Single Cell Transcriptome dataset and user defined datasets can be loaded in and used in the analyses.", "toolType": ["Command-line tool", "Library"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "ewce", "additionDate": "2017-01-17T14:59:09Z", "name": "EWCE", "license": "Artistic-2.0", "documentation": [{"url": "http://bioconductor.org/packages/release/bioc/html/EWCE.html", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": []}