{
    "additionDate": "2021-01-18T09:37:24Z",
    "biotoolsCURIE": "biotools:raptranker",
    "biotoolsID": "raptranker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mhamada@waseda.jp",
            "name": "Michiaki Hamada",
            "orcidid": "https://orcid.org/0000-0001-9466-1034",
            "typeEntity": "Person"
        }
    ],
    "description": "in silico RNA aptamer selection from HT-SELEX experiment based on local sequence and structure information.\n\nPlease see the wiki for detail usage.\n\nRaptRanker is a software for RNA aptamer selection from HT-SELEX experiment data based on local sequence and structure information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hmdlab/RaptRanker",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-03T14:41:57Z",
    "license": "MIT",
    "name": "RaptRanker",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA484",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Aptamers are short single-stranded RNA/DNA molecules that bind to specific target molecules. Aptamers with high binding-affinity and target specificity are identified using an in vitro procedure called high throughput systematic evolution of ligands by exponential enrichment (HT-SELEX). However, the development of aptamer affinity reagents takes a considerable amount of time and is costly because HT-SELEX produces a large dataset of candidate sequences, some of which have insufficient binding-affinity. Here, we present RNA aptamer Ranker (RaptRanker), a novel in silico method for identifying high binding-affinity aptamers from HT-SELEX data by scoring and ranking. RaptRanker analyzes HT-SELEX data by evaluating the nucleotide sequence and secondary structure simultaneously, and by ranking according to scores reflecting local structure and sequence frequencies. To evaluate the performance of RaptRanker, we performed two new HT-SELEX experiments, and evaluated binding affinities of a part of sequences that include aptamers with low binding-affinity. In both datasets, the performance of RaptRanker was superior to Frequency, Enrichment and MPBind. We also confirmed that the consideration of secondary structures is effective in HT-SELEX data analysis, and that RaptRanker successfully predicted the essential subsequence motifs in each identified sequence.",
                "authors": [
                    {
                        "name": "Ishida R."
                    },
                    {
                        "name": "Adachi T."
                    },
                    {
                        "name": "Yokota A."
                    },
                    {
                        "name": "Yoshihara H."
                    },
                    {
                        "name": "Aoki K."
                    },
                    {
                        "name": "Nakamura Y."
                    },
                    {
                        "name": "Hamada M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-20T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RaptRanker: In silico RNA aptamer selection from HT-SELEX experiment based on local sequence and structure information"
            },
            "pmcid": "PMC7641312",
            "pmid": "32537639"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}