{
    "additionDate": "2022-07-04T14:39:20.644374Z",
    "biotoolsCURIE": "biotools:hifiasm",
    "biotoolsID": "hifiasm",
    "description": "Hifiasm: a haplotype-resolved assembler for accurate Hifi reads",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://hifiasm.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chhylp123/hifiasm",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2022-07-04T14:39:20.647494Z",
    "license": "MIT",
    "name": "Hifiasm",
    "owner": "alexcorm",
    "publication": [
        {
            "doi": "10.1038/s41592-020-01056-5",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature America, Inc.Haplotype-resolved de novo assembly is the ultimate solution to the study of sequence variations in a genome. However, existing algorithms either collapse heterozygous alleles into one consensus copy or fail to cleanly separate the haplotypes to produce high-quality phased assemblies. Here we describe hifiasm, a de novo assembler that takes advantage of long high-fidelity sequence reads to faithfully represent the haplotype information in a phased assembly graph. Unlike other graph-based assemblers that only aim to maintain the contiguity of one haplotype, hifiasm strives to preserve the contiguity of all haplotypes. This feature enables the development of a graph trio binning algorithm that greatly advances over standard trio binning. On three human and five nonhuman datasets, including California redwood with a ~30-Gb hexaploid genome, we show that hifiasm frequently delivers better assemblies than existing tools and consistently outperforms others on haplotype-resolved assembly.",
                "authors": [
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Concepcion G.T."
                    },
                    {
                        "name": "Feng X."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 120,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Haplotype-resolved de novo assembly using phased assembly graphs with hifiasm"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
