{
    "accessibility": "Open access",
    "additionDate": "2022-02-20T15:43:37.701032Z",
    "biotoolsCURIE": "biotools:marr",
    "biotoolsID": "marr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tusharkanti.ghosh@cuanschutz.edu",
            "name": "Tusharkanti Ghosh",
            "typeEntity": "Person"
        },
        {
            "name": "Daisy Philtron"
        },
        {
            "name": "Debashis Ghosh"
        },
        {
            "name": "Katerina Kechris"
        },
        {
            "name": "Weiming Zhang"
        }
    ],
    "description": "This app provides a user interface for the open-source R package marr, which implements the method Maximum Rank Reproducibility (MaRR), a nonparametric approach that detects reproducible signals using a maximal rank statistic for high-dimensional biological data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/manuals/marr/man/marr.pdf"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/vignettes/marr/inst/doc/MarrVignette.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://maxmcgrath.shinyapps.io/marr/",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2022-02-20T15:43:37.703505Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/html/marr.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Ghoshlab/marr"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Ghoshlab/marr_paper_evaluations"
        }
    ],
    "name": "MaRR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04336-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Assessing the reproducibility of measurements is an important first step for improving the reliability of downstream analyses of high-throughput metabolomics experiments. We define a metabolite to be reproducible when it demonstrates consistency across replicate experiments. Similarly, metabolites which are not consistent across replicates can be labeled as irreproducible. In this work, we introduce and evaluate the use (Ma)ximum (R)ank (R)eproducibility (MaRR) to examine reproducibility in mass spectrometry-based metabolomics experiments. We examine reproducibility across technical or biological samples in three different mass spectrometry metabolomics (MS-Metabolomics) data sets. Results: We apply MaRR, a nonparametric approach that detects the change from reproducible to irreproducible signals using a maximal rank statistic. The advantage of using MaRR over model-based methods that it does not make parametric assumptions on the underlying distributions or dependence structures of reproducible metabolites. Using three MS Metabolomics data sets generated in the multi-center Genetic Epidemiology of Chronic Obstructive Pulmonary Disease (COPD) study, we applied the MaRR procedure after data processing to explore reproducibility across technical or biological samples. Under realistic settings of MS-Metabolomics data, the MaRR procedure effectively controls the False Discovery Rate (FDR) when there was a gradual reduction in correlation between replicate pairs for less highly ranked signals. Simulation studies also show that the MaRR procedure tends to have high power for detecting reproducible metabolites in most situations except for smaller values of proportion of reproducible metabolites. Bias (i.e., the difference between the estimated and the true value of reproducible signal proportions) values for simulations are also close to zero. The results reported from the real data show a higher level of reproducibility for technical replicates compared to biological replicates across all the three different datasets. In summary, we demonstrate that the MaRR procedure application can be adapted to various experimental designs, and that the nonparametric approach performs consistently well. Conclusions: This research was motivated by reproducibility, which has proven to be a major obstacle in the use of genomic findings to advance clinical practice. In this paper, we developed a data-driven approach to assess the reproducibility of MS-Metabolomics data sets. The methods described in this paper are implemented in the open-source R package marr, which is freely available from Bioconductor at http://bioconductor.org/packages/marr.",
                "authors": [
                    {
                        "name": "Ghosh D."
                    },
                    {
                        "name": "Ghosh T."
                    },
                    {
                        "name": "Kechris K."
                    },
                    {
                        "name": "Philtron D."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Reproducibility of mass spectrometry based metabolomics data"
            },
            "pmcid": "PMC8424977",
            "pmid": "34493210"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
