{
    "additionDate": "2024-01-29T10:37:22.778005Z",
    "biotoolsCURIE": "biotools:metanovo",
    "biotoolsID": "metanovo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jonathan.blackburn@uct.ac.za",
            "name": "Jonathan M. Blackburn",
            "orcidid": "https://orcid.org/0000-0001-8988-9595",
            "typeEntity": "Person"
        },
        {
            "email": "nicola.mulder@uct.ac.za",
            "name": "Nicola J. Mulder",
            "typeEntity": "Person"
        }
    ],
    "description": "An open-source pipeline for probabilistic peptide discovery in complex metaproteomic datasets.",
    "editPermission": {
        "type": "public"
    },
    "elixirCommunity": [
        "Galaxy"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/uct-cbio/proteomics-pipelines/blob/master/MetaNovo.md",
    "lastUpdate": "2024-11-24T14:10:18.488773Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://anaconda.org/bioconda/metanovo"
        }
    ],
    "name": "MetaNovo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1011163",
            "metadata": {
                "abstract": "Background Microbiome research is providing important new insights into the metabolic interactions of complex microbial ecosystems involved in fields as diverse as the pathogenesis of human diseases, agriculture and climate change. Poor correlations typically observed between RNA and protein expression datasets make it hard to accurately infer microbial protein synthesis from metagenomic data. Additionally, mass spectrometry-based metaproteomic analyses typically rely on focused search sequence databases based on prior knowledge for protein identification that may not represent all the proteins present in a set of samples. Metagenomic 16S rRNA sequencing only targets the bacterial component, while whole genome sequencing is at best an indirect measure of expressed proteomes. Here we describe a novel approach, MetaNovo, that combines existing open-source software tools to perform scalable de novo sequence tag matching with a novel algorithm for probabilistic optimization of the entire UniProt knowledgebase to create tailored sequence databases for target-decoy searches directly at the proteome level, enabling metaproteomic analyses without prior expectation of sample composition or metagenomic data generation and compatible with standard downstream analysis pipelines. Results We compared MetaNovo to published results from the MetaPro-IQ pipeline on 8 human mucosal-luminal interface samples, with comparable numbers of peptide and protein identifications, many shared peptide sequences and a similar bacterial taxonomic distribution compared to that found using a matched metagenome sequence database—but simultaneously identified many more non-bacterial peptides than the previous approaches. MetaNovo was also benchmarked on samples of known microbial composition against matched metagenomic and whole genomic sequence database workflows, yielding many more MS/ MS identifications for the expected taxa, with improved taxonomic representation, while also highlighting previously described genome sequencing quality concerns for one of the organisms, and identifying an experimental sample contaminant without prior expectation. Conclusions By estimating taxonomic and peptide level information directly on microbiome samples from tandem mass spectrometry data, MetaNovo enables the simultaneous identification of peptides from all domains of life in metaproteome samples, bypassing the need for curated sequence databases to search. We show that the MetaNovo approach to mass spectrometry metaproteomics is more accurate than current gold standard approaches of tailored or matched genomic sequence database searches, can identify sample contaminants without prior expectation and yields insights into previously unidentified metaproteomic signals, building on the potential for complex mass spectrometry metaproteomic data to speak for itself.",
                "authors": [
                    {
                        "name": "Blackburn J.M."
                    },
                    {
                        "name": "Fortuin S."
                    },
                    {
                        "name": "Garnett S."
                    },
                    {
                        "name": "Mulder N.J."
                    },
                    {
                        "name": "Nel A.J.M."
                    },
                    {
                        "name": "Potgieter M.G."
                    },
                    {
                        "name": "Tabb D.L."
                    },
                    {
                        "name": "Wendoh J.M."
                    }
                ],
                "citationCount": 7,
                "date": "2023-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "MetaNovo: An open-source pipeline for probabilistic peptide discovery in complex metaproteomic datasets"
            },
            "pmcid": "PMC10310047",
            "pmid": "37327214"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
