{
    "additionDate": "2021-03-19T08:32:56Z",
    "biotoolsCURIE": "biotools:pub2tools2021__fmodb",
    "biotoolsID": "pub2tools2021__fmodb",
    "confidence_flag": "tool",
    "description": "The World's First Database of Quantum Mechanical Calculations for Biomacromolecules Based on the Fragment Molecular Orbital Method.\n\nFMODB: The database of quantum mechanical data based on the FMO method.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://drugdesign.riken.jp/FMODB/",
    "lastUpdate": "2021-03-22T12:00:57Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://fmodd.jp/"
        }
    ],
    "name": "FMODB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C01062",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.We developed the world's first web-based public database for the storage, management, and sharing of fragment molecular orbital (FMO) calculation data sets describing the complex interactions between biomacromolecules, named FMO Database (https://drugdesign.riken.jp/FMODB/). Each entry in the database contains relevant background information on how the data was compiled as well as the total energy of each molecular system and interfragment interaction energy (IFIE) and pair interaction energy decomposition analysis (PIEDA) values. Currently, the database contains more than 13 600 FMO calculation data sets, and a comprehensive search function implemented at the front-end. The procedure for selecting target proteins, preprocessing the experimental structures, construction of the database, and details of the database front-end were described. Then, we demonstrated a use of the FMODB by comparing IFIE value distributions of hydrogen bond, ion-pair, and XH/πinteractions obtained by FMO method to those by molecular mechanics approach. From the comparison, the statistical analysis of the data provided standard reference values for the three types of interactions that will be useful for determining whether each interaction in a given system is relatively strong or weak compared to the interactions contained within the data in the FMODB. In the final part, we demonstrate the use of the database to examine the contribution of halogen atoms to the binding affinity between human cathepsin L and its inhibitors. We found that the electrostatic term derived by PIEDA greatly correlated with the binding affinities of the halogen containing cathepsin L inhibitors, indicating the importance of QM calculation for quantitative analysis of halogen interactions. Thus, the FMO calculation data in FMODB will be useful for conducting statistical analyses to drug discovery, for conducting molecular recognition studies in structural biology, and for other studies involving quantum mechanics-based interactions.",
                "authors": [
                    {
                        "name": "Fukuzawa K."
                    },
                    {
                        "name": "Honma T."
                    },
                    {
                        "name": "Kamisaka K."
                    },
                    {
                        "name": "Kawashita N."
                    },
                    {
                        "name": "Kurita N."
                    },
                    {
                        "name": "Moriwaki H."
                    },
                    {
                        "name": "Nagase S."
                    },
                    {
                        "name": "Okiyama Y."
                    },
                    {
                        "name": "Ozawa T."
                    },
                    {
                        "name": "Sato T."
                    },
                    {
                        "name": "Takaba K."
                    },
                    {
                        "name": "Takagi T."
                    },
                    {
                        "name": "Takaya D."
                    },
                    {
                        "name": "Takimoto-Kamimura M."
                    },
                    {
                        "name": "Tanaka S."
                    },
                    {
                        "name": "Watanabe C."
                    },
                    {
                        "name": "Yagi Y."
                    },
                    {
                        "name": "Yuki H."
                    }
                ],
                "citationCount": 3,
                "date": "2021-02-22T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "FMODB: The World's First Database of Quantum Mechanical Calculations for Biomacromolecules Based on the Fragment Molecular Orbital Method"
            },
            "pmid": "33511845"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
