{
    "additionDate": "2017-02-14T09:35:22Z",
    "biotoolsCURIE": "biotools:splitpocket",
    "biotoolsID": "splitpocket",
    "credit": [
        {
            "email": "ytseng3@uchicago.edu",
            "name": "Yan Y. Tseng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SplitPocket is a web server for identification of functional surfaces of proteins from their structure coordinates. Identification is based on the geometric concept of a split pocket, which is a pocket split by a binding ligand. &gt,26,000 structures in PDB have been found to have split pockets.",
    "documentation": [
        {
            "type": "General",
            "url": "http://pocket.med.wayne.edu/patch/tut/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface analysis",
                    "uri": "http://edamontology.org/operation_3351"
                },
                {
                    "term": "Protein structural motif recognition",
                    "uri": "http://edamontology.org/operation_0245"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://pocket.med.wayne.edu/patch/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "SplitPocket",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "SplitPocket (http://pocket.uchicago.edu/) is a web server to identify functional surfaces of protein from structure coordinates. Using the Alpha Shape Theory, we previously developed an analytical approach to identify protein functional surfaces by the geometric concept of a split pocket, which is a pocket split by a binding ligand. Our geometric approach extracts site-specific spatial information from coordinates of structures. To reduce the search space, probe radii are designed according to the physicochemical textures of molecules. The method uses the weighted Delaunay triangulation and the discrete flow algorithm to obtain geometric measurements and spatial patterns for each predicted pocket. It can also measure the hydrophobicity on a surface patch. Furthermore, we quantify the evolutionary conservation of surface patches by an index derived from the entropy scores in HSSP (homology-derived secondary structure of proteins). We have used the method to examine ∼ 1.16 million potential pockets and identified the split pockets in > 26 000 structures in the Protein Data Bank. This integrated web server of functional surfaces provides a source of spatial patterns to serve as templates for predicting the functional surfaces of unbound structures involved in binding activities. These spatial patterns should also be useful for protein functional inference, structural evolution and drug design.",
                "authors": [
                    {
                        "name": "Tseng Y.Y."
                    },
                    {
                        "name": "Dupree C."
                    },
                    {
                        "name": "Chen Z.J."
                    },
                    {
                        "name": "Li W.-H."
                    }
                ],
                "citationCount": 27,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SplitPocket: Identification of protein functional surfaces and characterization of their spatial patterns"
            },
            "pmid": "19406922"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}