
{
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mud.tau.ac.il/quickHelp.php"
        }
    ],
    "function": [
        {
            "note": "The discrimination between functionally-neutral amino acid substitutions and deleterious mutations that harm protein function is of major importance to our understanding of diseases in molecular details. The rapidly growing amount of experimental data enables the development of computational tools to facilitate the annotation of these substitutions. To this end, we estalished MuD (Mutation Detector). MuD utilizes structural- and sequence-based features with a Random Forests classifier to assess the impact of a given substitution on the protein's function and/or structure. MuD was benchmarked using a cross-validation process on a subset of the Bromberg and Rost dataset and achieved Mathew's correlation coefficient of 0.49 which is as good as current tools.",
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Instruct"
        ],
        "cost": "Free of charge",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The discrimination between functionally neutral amino acid substitutions and non-neutral mutations, affecting protein function, is very important for our understanding of diseases. The rapidly growing amounts of experimental data enable the development of computational tools to facilitate the annotation of these substitutions. Here, we describe a Random Forests-based classifier, named Mutation Detector (MuD) that utilizes structural and sequence-derived features to assess the impact of a given substitution on the protein function. In its automatic mode, MuD is comparable to alternative tools in performance. However, the uniqueness of MuD is that user-reported protein-specific structural and functional information can be added at run-time, thereby enhancing the prediction accuracy further. The MuD server, available at http://mud.tau.ac.il, assigns a reliability score to every prediction, thus offering a useful tool for the prioritization of substitutions in proteins with an available 3D structure. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Wainreb G.",
                "Ashkenazy H.",
                "Bromberg Y.",
                "Starovolsky-Shitrit A.",
                "Haliloglu T.",
                "Ruppin E.",
                "Avraham K.B.",
                "Rost B.",
                "Ben-Tal N."
            ],
            "cit_count": 26,
            "doi": "10.1093/nar/gkq528",
            "journal": "Nucleic Acids Research",
            "title": "MuD: An interactive web server for the prediction of non-neutral substitutions using protein structural data",
            "type": "Primary",
            "year": "2010-06-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mud",
        "biotoolsID": "mud",
        "description": "A server for predicting the affect of missense mutations on protein function using sequence and structural features.",
        "homepage": "http://mud.tau.ac.il/",
        "name": "MuD",
        "version": [
            "1"
        ]
    }
}