{
    "accessibility": [],
    "additionDate": "2017-08-03T19:00:26Z",
    "biotoolsCURIE": "biotools:spreg",
    "biotoolsID": "spreg",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dlin.web.unc.edu/contact/"
        }
    ],
    "description": "A computer program for performing regression analysis of secondary phenotype data in case-control association studies. Secondary phenotypes are quantitative or qualitative traits other than the case-control status. Because the case-control sample is not a random sample of the general population, standard statistical analysis of secondary phenotype data can yield very misleading results.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://dlin.web.unc.edu/software/spreg-2/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://dlin.web.unc.edu/software/spreg/",
    "homepage_status": 0,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/spreg-2-0-regression-analysis-secondary-phenotype-data-case-control-association-studies.html"
        }
    ],
    "maturity": null,
    "name": "SPREG",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Case-control association studies often collect extensive information on secondary phenotypes, which are quantitative or qualitative traits other than the case-control status. Exploring secondary phenotypes can yield valuable insights into biological pathways and identify genetic variants influencing phenotypes of direct interest. All publications on secondary phenotypes have used standard statistical methods, such as least-squares regression for quantitative traits. Because of unequal selection probabilities between cases and controls, the case-control sample is not a random sample from the general population. As a result, standard statistical analysis of secondary phenotype data can be extremely misleading. Although one may avoid the sampling bias by analyzing cases and controls separately or by including the case-control status as a covariate in the model, the associations between a secondary phenotype and a genetic variant in the case and control groups can be quite different from the association in the general population. In this article, we present novel statistical methods that properly reflect the case-control sampling in the analysis of secondary phenotype data. The new methods provide unbiased estimation of genetic effects and accurate control of false-positive rates while maximizing statistical power. We demonstrate the pitfalls of the standard methods and the advantages of the new methods both analytically and numerically. The relevant software is available at our website. © 2008 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Lin D.Y."
                    },
                    {
                        "name": "Zeng D."
                    }
                ],
                "citationCount": 77,
                "date": "2009-06-08T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Proper analysis of secondary phenotype data in case-control association studies"
            },
            "note": null,
            "pmcid": null,
            "pmid": "19051285",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": []
}