
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://csb.cs.tut.fi/"
        }
    ],
    "documentation": [
        {
            "url": "http://www.cs.tut.fi/sgn/csb/mamodel/userguide.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Algorithms",
                "uri": "http://edamontology.org/topic_3372"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mamodel-20060511-microarray-simulator.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Microarray technologies have become common tools in biological research. As a result, a need for effective computational methods for data analysis has emerged. Numerous different algorithms have been proposed for analyzing-the data. However, an objective evaluation of the proposed algorithms is not possible due to the lack of biological ground truth information. To overcome this fundamental problem, the use of simulated microarray data for algorithm validation has been proposed. Results: We present a microarray simulation model which can be used to validate different kinds of data analysis algorithms. The proposed model is unique in the sense that it includes all the steps that affect the quality of real microarray data. These steps include the simulation of biological ground truth data, applying biological and measurement technology specific error models, and finally simulating the microarray slide manufacturing and hybridization. After all these steps are taken into account, the simulated data has realistic biological and statistical characteristics. The applicability of the proposed model is demonstrated by several examples. Conclusion: The koposed microarray simulation model is modular and can be used in different kinds of applications. It includes several error models that have been proposed earlier and it can be used with different types of input data. The model can be used to simulate both spotted two- channel and oligonucleotide based single-channel microarrays. All this makes the model a valuable tool for example in validation of data analysis algorithms. © 2006 Nykter et al; licensee BioMed Central Ltd.",
            "authors": [
                "Nykter M.",
                "Aho T.",
                "Ahdesmaki M.",
                "Ruusuvuori P.",
                "Lehmussola A.",
                "Yli-Harja O."
            ],
            "cit_count": 42,
            "doi": "10.1186/1471-2105-7-349",
            "journal": "BMC Bioinformatics",
            "title": "Simulation of microarray data with realistic characteristics",
            "type": "Primary",
            "year": "2006-07-18"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mamodel",
        "biotoolsID": "mamodel",
        "description": "It is a microarray simulation model which can be used to validate different kinds of data analysis algorithms. The proposed model is unique in the sense that it includes all the steps that affect the quality of real microarray data. These steps include the simulation of biological ground truth data, applying biological and measurement technology specific error models, and finally simulating the microarray slide manufacturing and hybridization.",
        "homepage": "http://www.cs.tut.fi/sgn/csb/mamodel/",
        "name": "MAmodel",
        "version": [
            "20060511"
        ]
    }
}