{
    "additionDate": "2018-05-26T10:10:01Z",
    "biotoolsCURIE": "biotools:vecuum",
    "biotoolsID": "vecuum",
    "credit": [
        {
            "email": "swkim@yuhs.ac",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identifies vector-originated reads by inspecting the clipping patterns at exon junctions and False variant calls are further detected based on the biased distribution of mutant alleles to vector-originated reads.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/vecuum/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/vecuum/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "Vecuum",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw383",
            "metadata": {
                "abstract": "© The Author 2016.Motivation: Advances in sequencing technologies have remarkably lowered the detection limit of somatic variants to a low frequency. However, calling mutations at this range is still confounded by many factors including environmental contamination. Vector contamination is a continuously occurring issue and is especially problematic since vector inserts are hardly distinguishable from the sample sequences. Such inserts, which may harbor polymorphisms and engineered functional mutations, can result in calling false variants at corresponding sites. Numerous vector-screening methods have been developed, but none could handle contamination from inserts because they are focusing on vector backbone sequences alone. Results: We developed a novel method - Vecuum - that identifies vector-originated reads and resultant false variants. Since vector inserts are generally constructed from intron-less cDNAs, Vecuum identifies vector-originated reads by inspecting the clipping patterns at exon junctions. False variant calls are further detected based on the biased distribution of mutant alleles to vector-originated reads. Tests on simulated and spike-in experimental data validated that Vecuum could detect 93% of vector contaminants and could remove up to 87% of variant-like false calls with 100% precision. Application to public sequence datasets demonstrated the utility of Vecuum in detecting false variants resulting from various types of external contamination.",
                "authors": [
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Maeng J.H."
                    },
                    {
                        "name": "Lim J.S."
                    },
                    {
                        "name": "Son H."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Lee J.H."
                    },
                    {
                        "name": "Kim S."
                    }
                ],
                "citationCount": 4,
                "date": "2016-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Vecuum: Identification and filtration of false somatic variants caused by recombinant vector contamination"
            },
            "pmid": "27334474"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.1"
    ]
}