{
    "additionDate": "2021-01-18T10:54:31Z",
    "biotoolsCURIE": "biotools:popf",
    "biotoolsID": "popf",
    "confidence_flag": "tool",
    "description": "Risk prediction platform for pancreatic fistula after pancreatoduodenectomy using artificial intelligence.\n\nRisk Prediction Platform for Postoperative Pancreatic Fistula (POPF).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://popfrisk.smchbp.org",
    "lastUpdate": "2021-01-24T15:07:39Z",
    "name": "POPF",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3748/WJG.V26.I30.4453",
            "metadata": {
                "abstract": "© 2020 Baishideng Publishing Group Co., Limited. All rights reserved.BACKGROUND Despite advancements in operative technique and improvements in postoperative managements, postoperative pancreatic fistula (POPF) is a life-threatening complication following pancreatoduodenectomy (PD). There are some reports to predict POPF preoperatively or intraoperatively, but the accuracy of those is questionable. Artificial intelligence (AI) technology is being actively used in the medical field, but few studies have reported applying it to outcomes after PD. AIM To develop a risk prediction platform for POPF using an AI model. METHODS Medical records were reviewed from 1769 patients at Samsung Medical Center who underwent PD from 2007 to 2016. A total of 38 variables were inserted into AI-driven algorithms. The algorithms tested to make the risk prediction platform were random forest (RF) and a neural network (NN) with or without recursive feature elimination (RFE). The median imputation method was used for missing values. The area under the curve (AUC) was calculated to examine the discriminative power of algorithm for POPF prediction. RESULTS The number of POPFs was 221 (12.5%) according to the International Study Group of Pancreatic Fistula definition 2016. After median imputation, AUCs using 38 variables were 0.68 ± 0.02 with RF and 0.71 ± 0.02 with NN. The maximal AUC using NN with RFE was 0.74. Sixteen risk factors for POPF were identified by AI algorithm: Pancreatic duct diameter, body mass index, preoperative serum albumin, lipase level, amount of intraoperative fluid infusion, age, platelet count, extrapancreatic location of tumor, combined venous resection, co-existing pancreatitis, neoadjuvant radiotherapy, American Society of Anesthesiologists’ score, sex, soft texture of the pancreas, underlying heart disease, and preoperative endoscopic biliary decompression. We developed a web-based POPF prediction platform, and this application is freely available at http://popfrisk.smchbp.org. CONCLUSION This study is the first to predict POPF with multiple risk factors using AI. This platform is reliable (AUC 0.74), so it could be used to select patients who need especially intense therapy and to preoperatively establish an effective treatment strategy.",
                "authors": [
                    {
                        "name": "Cho B.H."
                    },
                    {
                        "name": "Cho K."
                    },
                    {
                        "name": "Choi D.W."
                    },
                    {
                        "name": "Chung M.J."
                    },
                    {
                        "name": "Han I.W."
                    },
                    {
                        "name": "Heo J.S."
                    },
                    {
                        "name": "Kwon O.C."
                    },
                    {
                        "name": "Ryu Y."
                    },
                    {
                        "name": "Shin S.H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-14T00:00:00Z",
                "journal": "World Journal of Gastroenterology",
                "title": "Risk prediction platform for pancreatic fistula after pancreatoduodenectomy using artificial intelligence"
            },
            "pmcid": "PMC7438201",
            "pmid": "32874057"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
