{
    "additionDate": "2022-03-28T13:18:53.126764Z",
    "biotoolsCURIE": "biotools:cirpred",
    "biotoolsID": "cirpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "WadeLo@nctu.edu.tw",
            "name": "Wei-Cheng Lo",
            "orcidid": "https://orcid.org/0000-0001-8865-5113",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CirPred is a structure modeling and linker design system for circularly permuted proteins. It is a protein engineering techniques based on a structural rearrangement phenomenon called circular permutation (CP), equivalent to connecting the native termini of a protein followed by creating new termini at another site. Although CP has been applied in many fields, its implementation is still costly because of inevitable trials and errors. Compared with state-of-the-art protein structure modeling methods, CirPred is the only one fully capable of both circularly-permuted modeling and traditional co-linear modeling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein design",
                    "uri": "http://edamontology.org/operation_4008"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://140.113.120.231/~lab/CirPred/srv/",
    "lastUpdate": "2022-03-28T13:18:53.129419Z",
    "name": "CirPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04403-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: This work aims to help develop new protein engineering techniques based on a structural rearrangement phenomenon called circular permutation (CP), equivalent to connecting the native termini of a protein followed by creating new termini at another site. Although CP has been applied in many fields, its implementation is still costly because of inevitable trials and errors. Results: Here we present CirPred, a structure modeling and termini linker design method for circularly permuted proteins. Compared with state-of-the-art protein structure modeling methods, CirPred is the only one fully capable of both circularly-permuted modeling and traditional co-linear modeling. CirPred performs well when the permutant shares low sequence identity with the native protein and even when the permutant adopts a different conformation from the native protein because of three-dimensional (3D) domain swapping. Linker redesign experiments demonstrated that the linker design algorithm of CirPred achieved subangstrom accuracy. Conclusions: The CirPred system is capable of (1) predicting the structure of circular permutants, (2) designing termini linkers, (3) performing traditional co-linear protein structure modeling, and (4) identifying the CP-induced occurrence of 3D domain swapping. This method is supposed helpful for broadening the application of CP, and its web server is available at http://10.life.nctu.edu.tw/CirPred/ and http://lo.life.nctu.edu.tw/CirPred/.",
                "authors": [
                    {
                        "name": "Chen C.-C."
                    },
                    {
                        "name": "Chen T.-R."
                    },
                    {
                        "name": "Huang Y.-W."
                    },
                    {
                        "name": "Lin Y.-C."
                    },
                    {
                        "name": "Lo W.-C."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CirPred, the first structure modeling and linker design system for circularly permuted proteins"
            },
            "pmcid": "PMC8513176",
            "pmid": "34641789",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
