{
    "additionDate": "2017-03-30T16:57:04Z",
    "biotoolsCURIE": "biotools:3d-footprint",
    "biotoolsID": "3d-footprint",
    "credit": [
        {
            "email": "compbio@eead.csic.es",
            "name": "3D-Footprint Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "3D-footprint provides estimates of binding specificity for all protein-DNA complexes available at the Protein Data Bank. The web interface allows the user to: (i) browse DNA-binding proteins by keyword; (ii) find proteins that recognize a similar DNA motif and (iii) BLAST similar DNA-binding proteins, highlighting interface residues in the resulting alignments. Comparisons with expert-curated databases RegulonDB and TRANSFAC support the quality of structure-based estimates of specificity.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://floresta.eead.csic.es/3dfootprint/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "Protein comparison",
                    "uri": "http://edamontology.org/operation_2997"
                },
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://floresta.eead.csic.es/3dfootprint",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "3D-Footprint",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "3D-footprint is a living database, updated and curated on a weekly basis, which provides estimates of binding specificity for all protein-DNA complexes available at the Protein Data Bank. The web interface allows the user to: (i) browse DNA-binding proteins by keyword; (ii) find proteins that recognize a similar DNA motif and (iii) BLAST similar DNA-binding proteins, highlighting interface residues in the resulting alignments. Each complex in the database is dissected to draw interface graphs and footprint logos, and two complementary algorithms are employed to characterize binding specificity. Moreover, oligonucleotide sequences extracted from literature abstracts are reported in order to show the range of variant sites bound by each protein and other related proteins. Benchmark experiments, including comparisons with expert-curated databases RegulonDB and TRANSFAC, support the quality of structure-based estimates of specificity. The relevant content of the database is available for download as flat files and it is also possible to use the 3D-footprint pipeline to analyze protein coordinates input by the user. 3D-footprint is available at http://floresta.eead.csic.es/3dfootprint with demo buttons and a comprehensive tutorial that illustrates the main uses of this resource. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Contreras-Moreira B."
                    }
                ],
                "citationCount": 48,
                "date": "2009-09-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "3D-footprint: A database for the structural analysis of protein DNA complexes"
            },
            "pmid": "19767616"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}