{
    "additionDate": "2017-01-17T14:56:30Z",
    "biotoolsCURIE": "biotools:oppar",
    "biotoolsID": "oppar",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "hediyehzadeh.s@wehi.edu.au",
            "name": "Soroor Hediyeh zadeh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The R implementation of mCOPA package. This package provides methods for Cancer Outlier Profile Analysis. Although initially developed to detect outlier genes in cancer studies, its methods can be used for outlier profile analysis in general. In addition, tools are provided for gene set enrichment and pathway analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/oppar.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/oppar_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/oppar.html",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2019-01-09T16:19:33Z",
    "license": "GPL-2.0",
    "name": "oppar",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/2043-9113-2-22",
            "metadata": {
                "abstract": "© 2012 Wang et al.; licensee BioMed Central Ltd.Background: Cancer outlier profile analysis (COPA) has proven to be an effective approach to analyzing cancer expression data, leading to the discovery of the TMPRSS2 and ETS family gene fusion events in prostate cancer. However, the original COPA algorithm did not identify down-regulated outliers, and the currently available R package implementing the method is similarly restricted to the analysis of over-expressed outliers. Here we present a modified outlier detection method, mCOPA, which contains refinements to the outlier-detection algorithm, identifies both over- and under-expressed outliers, is freely available, and can be applied to any expression dataset. Results: We compare our method to other feature-selection approaches, and demonstrate that mCOPA frequently selects more-informative features than do differential expression or variance-based feature selection approaches, and is able to recover observed clinical subtypes more consistently. We demonstrate the application of mCOPA to prostate cancer expression data, and explore the use of outliers in clustering, pathway analysis, and the identification of tumour suppressors. We analyse the under-expressed outliers to identify known and novel prostate cancer tumour suppressor genes, validating these against data in Oncomine and the Cancer Gene Index. We also demonstrate how a combination of outlier analysis and pathway analysis can identify molecular mechanisms disrupted in individual tumours. Conclusions: We demonstrate that mCOPA offers advantages, compared to differential expression or variance, in selecting outlier features, and that the features so selected are better able to assign samples to clinically annotated subtypes. Further, we show that the biology explored by outlier analysis differs from that uncovered in differential expression or variance analysis. mCOPA is an important new tool for the exploration of cancer datasets and the discovery of new cancer subtypes, and can be combined with pathway and functional analysis approaches to discover mechanisms underpinning heterogeneity in cancers.",
                "authors": [
                    {
                        "name": "Davis M.J."
                    },
                    {
                        "name": "Maetschke S.R."
                    },
                    {
                        "name": "Nelson C.C."
                    },
                    {
                        "name": "Ragan M.A."
                    },
                    {
                        "name": "Taciroglu A."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "citationCount": 16,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Journal of Clinical Bioinformatics",
                "title": "mCOPA: Analysis of heterogeneous features in cancer expression data"
            },
            "pmcid": "PMC3553066",
            "pmid": "23216803",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.0"
    ]
}
