{
    "name": "PERGA", 
    "description": "Novel sequence reads guided de novo assembly approach which adopts greedy-like prediction strategy for assembling reads to contigs and scaffolds.", 
    "homepage": "https://github.com/hitbio/PERGA", 
    "biotoolsID": "perga", 
    "biotoolsCURIE": "biotools:perga", 
    "version": [
        "0.5.03.02"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0310", 
                    "term": "Sequence assembly"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0196", 
            "term": "Sequence assembly"
        }, 
        {
            "uri": "http://edamontology.org/topic_0077", 
            "term": "Nucleic acids"
        }, 
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/perga-0-5-03-01-paired-end-reads-guided-assembler.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/hitbio/PERGA", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0114253", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "PERGA: A paired-end read guided de novo assembler for extending contigs using SVM and look ahead approach", 
                "abstract": "© 2014 Zhu et al. Since the read lengths of high throughput sequencing (HTS) technologies are short, de novo assembly which plays significant roles in many applications remains a great challenge. Most of the state-of-the-art approaches base on de Bruijn graph strategy and overlap-layout strategy. However, these approaches which depend on k-mers or read overlaps do not fully utilize information of paired-end and single-end reads when resolving branches. Since they treat all single-end reads with overlapped length larger than a fix threshold equally, they fail to use the more confident long overlapped reads for assembling and mix up with the relative short overlapped reads. Moreover, these approaches have not been special designed for handling tandem repeats (repeats occur adjacently in the genome) and they usually break down the contigs near the tandem repeats. We present PERGA (Paired-End Reads Guided Assembler), a novel sequence-reads-guided de novo assembly approach, which adopts greedy-like prediction strategy for assembling reads to contigs and scaffolds using paired-end reads and different read overlap size ranging from Omax to Omin to resolve the gaps and branches. By constructing a decision model using machine learning approach based on branch features, PERGA can determine the correct extension in 99.7% of cases. When the correct extension cannot be determined, PERGA will try to extend the contig by all feasible extensions and determine the correct extension by using look-ahead approach. Many difficult-resolved branches are due to tandem repeats which are close in the genome. PERGA detects such different copies of the repeats to resolve the branches to make the extension much longer and more accurate. We evaluated PERGA on both Illumina real and simulated datasets ranging from small bacterial genomes to large human chromosome, and it constructed longer and more accurate contigs and scaffolds than other state-of-the-art assemblers. PERGA can be freely downloaded at https://github.com/hitbio/PERGA.", 
                "date": "2014-12-02T00:00:00Z", 
                "citationCount": 7, 
                "authors": [
                    {
                        "name": "Zhu X."
                    }, 
                    {
                        "name": "Leung H.C.M."
                    }, 
                    {
                        "name": "Chin F.Y.L."
                    }, 
                    {
                        "name": "Yiu S.M."
                    }, 
                    {
                        "name": "Quan G."
                    }, 
                    {
                        "name": "Liu B."
                    }, 
                    {
                        "name": "Wang Y."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "https://github.com/hitbio/PERGA", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:10:15Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}