{"credit":[{"email":"iadzhubey@rics.bwh.harvard.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://genetics.bwh.harvard.edu/genetics/labs/Sunyaev/index.html"}],"documentation":[{"url":"http://genetics.bwh.harvard.edu/msblast/MS_BLAST_TIPS.html"}],"function":[{"operation":[{"term":"Local alignment","uri":"http://edamontology.org/operation_0495"}]}],"labels":{"collectionID":["BLAST"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/ms-blast-mass-spectrometry-driven-blast.html"}],"publication":[{"abstract":"MALDI-quadrupole time-of-flight mass spectrometry was applied to identify proteins from organisms whose genomes are still unknown. The identification was carried out by successively searching a sequence database - first with a peptide mass fingerprint, then with a packet of noninterpreted MS/MS spectra, and finally with peptide sequences obtained by automated interpretation of the MS/MS spectra. A \"MS BLAST\" homology searching protocol was developed to overcome specific limitations imposed by mass spectrometric data, such as the limited accuracy of de novo sequence predictions. This approach was tested in a small-scale proteomic project involving the identification of 15 bands of gel-separated proteins from the methylotrophic yeast Pichia pastoris, whose genome has not yet been sequenced and which is only distantly related to other fungi.","authors":["Shevchenko A.","Sunyaev S.","Loboda A.","Shevchenko A.","Bork P.","Ens W.","Standing K.G."],"cit_count":500,"journal":"Analytical Chemistry","pmid":"11354471","title":"Charting the proteomes of organisms with unsequenced genomes by MALDI-quadrupole time-of-flight mass spectrometry and BLAST homology searching","year":"2001-05-01"}],"summary":{"biotoolsCURIE":"biotools:ms-blast","biotoolsID":"ms-blast","description":"Specialised BLAST –based protocol developed for identification of proteins by sequence similarity searches using peptide sequences produced by the interpretation of tandem mass spectra.","homepage":"http://genetics.bwh.harvard.edu/msblast/","name":"MS-BLAST"}}