{
    "additionDate": "2020-01-09T17:49:22Z",
    "biotoolsCURIE": "biotools:los_hospitales_de_bajo_valor",
    "biotoolsID": "los_hospitales_de_bajo_valor",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "vuj@med.umich.edu",
            "name": "Joceline V. Vu",
            "typeEntity": "Person"
        }
    ],
    "description": "Preventing Complications or Improving Efficiency.\n\nBACKGROUND:There is increased focus on the value of surgical care. Postoperative complications decrease value, but it is unknown whether high-value hospitals spend less than low-value hospitals in cases without complications. Previous studies have not evaluated both expenditures and validated outcomes in the same patients, limiting the understanding of interactions between clinical performance, efficient utilization of services, and costliness of surgical episodes. OBJECTIVE:This study aimed to identify payment differences between low- and high-value hospitals in colectomy cases without adverse outcomes using a linked data set of multipayer claims and validated clinical outcomes. DESIGN:This is a retrospective observational cohort study.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'los hospitales de alto valor', 'hospitales de bajo valor', 'bajo valor con casos sin', 'valor con casos sin resultados'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31633600",
    "lastUpdate": "2020-01-09T17:49:22Z",
    "name": "los hospitales de bajo valor",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/DCR.0000000000001523",
            "metadata": {
                "abstract": "BACKGROUND: There is increased focus on the value of surgical care. Postoperative complications decrease value, but it is unknown whether high-value hospitals spend less than low-value hospitals in cases without complications. Previous studies have not evaluated both expenditures and validated outcomes in the same patients, limiting the understanding of interactions between clinical performance, efficient utilization of services, and costliness of surgical episodes. OBJECTIVE: This study aimed to identify payment differences between low- and high-value hospitals in colectomy cases without adverse outcomes using a linked data set of multipayer claims and validated clinical outcomes. DESIGN: This is a retrospective observational cohort study. We assigned each hospital a value score (ratio of cases without adverse outcome to mean episode payment). We stratified hospitals into tertiles by value and used analysis of variance tests to compare payments between low- and high-value hospitals, first for all cases, and then cases without adverse outcome. SETTING: January 2012 to December 2016, this investigation used clinical registry data from 56 hospitals participating in the Michigan Surgical Quality Collaborative, linked with 30-day episode payments from the Michigan Value Collaborative. PATIENTS: A total of 2947 patients undergoing elective colectomy were selected. MAIN OUTCOME MEASURES: The primary outcome measured was risk-adjusted, price-standardized 30-day episode payments. RESULTS: The mean adjusted complication rate was 31% (±10.7%) at low-value hospitals and 14% (±4.6%) at high-value hospitals (p < 0.001). Low-value hospitals were paid $3807 (17%) more than high-value hospitals ($22,271 vs $18,464, p < 0.001). Among cases without adverse outcome, payments were still $2257 (11%) higher in low-value hospitals ($19,424 vs $17,167, p = 0.04). LIMITATIONS: This study focused on outcomes and did not consider processes of care as drivers of value. CONCLUSIONS: In elective colectomy, high-value hospitals achieve lower episode payments than low-value hospitals for cases without adverse outcome, indicating mechanisms for increasing value beyond reducing complications. Worthwhile targets to optimize value in elective colectomy may include enhanced recovery protocols or other interventions that increase efficiency in all phases of care. See Video Abstract at http://links.lww.com/DCR/B56. LOGRANDO LA COLECTOMÍA DE ALTO VALOR: PREVINIENDO COMPLICACIONES O MEJORANDO LA EFICIENCIA: Hay un mayor enfoque en el valor de la atención quirúrgica. Las complicaciones postoperatorias disminuyen el valor, pero se desconoce si en los casos sin complicaciones, los hospitales de alto valor gastan menos que los hospitales de bajo valor. Estudios anteriores no han evaluado ambos gastos y validado resultados en los mismos pacientes, limitando la comprensión de las interacciones entre el rendimiento clínico, utilización eficiente de los servicios y costos de los episodios quirúrgicos.Identificar las diferencias de pago entre los hospitales de alto y bajo valor, en casos de colectomía sin resultados adversos, utilizando un conjunto de datos vinculados de reclamos de pago múltiple y resultados clínicos validados.Estudio de cohorte observacional retrospectivo. Asignamos a cada hospital una puntuación de valor (proporción de casos sin resultado adverso al pago medio del episodio). Estratificamos los hospitales por valor en terciles y utilizamos el análisis de pruebas de varianza para comparar los pagos entre hospitales de bajo y alto valor, primero para todos los casos y luego casos sin resultados adversos.De enero del 2012 a diciembre del 2016, utilizando datos de registro clínico de 56 hospitales que participan en el Michigan Surgical Quality Collaborative, vinculado con pagos de episodios de 30 días, del Michigan Value Collaborative.Un total de 2947 pacientes con colectomía electiva.Pagos por episodio de 30 días, ajustados al riesgo y estandarizados por precio.La tasa media de complicación ajustada fue de 31% (±10.7%) en hospitales de bajo valor y 14% (±4.6%) en hospitales de alto valor (p < 0.001). A los hospitales de bajo valor se les pagó $3807 (17%) más que a los hospitales de alto valor ($22,271 frente a $18,464, p < 0.001). Entre los casos sin resultados adversos, los pagos fueron de $2257 (11%) más altos en hospitales de bajo valor ($19,424 vs $17,167, p = 0.04).Este estudio se centró en los resultados y no se consideraron a los procesos de atención, como impulsores de valor.En la colectomía electiva, los hospitales de alto valor logran pagos de episodios más bajos, que en los hospitales de bajo valor con casos sin resultados adversos, indicando mecanismos para aumentar el valor, más allá que la reducción de complicaciones. Objetivos valiosos para optimizar el valor de la colectomía electiva, pueden incluir mejoras en los protocolos de recuperación, así como otras intervenciones que aumenten la eficiencia en todas las fases de la atención. Vea el resumen del video en http://links.lww.com/DCR/B56.",
                "authors": [
                    {
                        "name": "Vu J.V.-T."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Likosky D.S."
                    },
                    {
                        "name": "Norton E.C."
                    },
                    {
                        "name": "Campbell D.A."
                    },
                    {
                        "name": "Regenbogen S.E."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Diseases of the colon and rectum",
                "title": "Achieving the High-Value Colectomy: Preventing Complications or Improving Efficiency"
            },
            "pmcid": "PMC6895391",
            "pmid": "31633600"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}