{
    "accessibility": "Open access",
    "additionDate": "2022-09-06T22:22:18.212124Z",
    "biotoolsCURIE": "biotools:markerml",
    "biotoolsID": "markerml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bhupesh Taneja"
        },
        {
            "name": "Rohan Singh"
        },
        {
            "name": "Sharmila S. Mande"
        },
        {
            "name": "Sunil Nagpal"
        }
    ],
    "description": "Marker Feature Identification in Metagenomic Datasets Using Interpretable Machine Learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://microbiome.igib.res.in/markerml/",
    "lastUpdate": "2022-09-06T22:22:18.214383Z",
    "name": "MarkerML",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2022.167589",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdIdentification of environment specific marker-features is one of the key objectives of many metagenomic studies. It aims to identify such features in microbiome datasets that may serve as markers of the contrasting or comparable states. Hypothesis testing and black-box machine learnt models which are conventionally used for identification of these features are generally not exhaustive, especially because they generally do-not provide any quantifiable relevance (context) of/between the identified features. We present MarkerML web-server, that seeks to leverage the emergence of interpretable machine learning for facilitating the contextual discovery of metagenomic features of interest. It does so through a comprehensive and automated application of the concept of Shapley Additive Explanations in companionship to the compositionality accounted hypothesis testing for the multi-variate microbiome datasets. MarkerML not only helps in identification of marker-features, but also enables insights into the role and inter-dependence of the identified features in driving the decision making of the supervised machine learnt model. Generation of high quality and intuitive visualizations spanning prediction effect plots, model performance reports, feature dependency plots, Shapley and abundance informed cladograms (Sungrams), hypothesis tested violin plots along-with necessary provisions for excluding the participant bias and ensuring reproducibility of results, further seek to make the platform a useful asset for the scientists in the field of microbiome (and even beyond). The MarkerML web-server is freely available for the academic community at https://microbiome.igib.res.in/markerml/.",
                "authors": [
                    {
                        "name": "Mande S.S."
                    },
                    {
                        "name": "Nagpal S."
                    },
                    {
                        "name": "Singh R."
                    },
                    {
                        "name": "Taneja B."
                    }
                ],
                "citationCount": 1,
                "date": "2022-06-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "MarkerML – Marker Feature Identification in Metagenomic Datasets Using Interpretable Machine Learning"
            },
            "pmid": "35662460"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
