{
    "accessibility": [],
    "additionDate": "2017-02-10T14:14:28Z",
    "biotoolsCURIE": "biotools:ef-seek",
    "biotoolsID": "ef-seek",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "nbdc-kikaku@jst.go.jp",
            "gridid": null,
            "name": "eF-seek Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "eF-seek predicts protein functional sites by searching for similar electrostatic potential and molecular surface shapes against eF-site, a database of electrostatic surfaces for representative ligand binding sites.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://pdbj.org/eF-site/wiki/eF-seek_Help#How_to_use"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Molecular surface analysis",
                    "uri": "http://edamontology.org/operation_3351"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Molecular surface comparison",
                    "uri": "http://edamontology.org/operation_3666"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://ef-site.hgc.jp/eF-seek/index.jsp",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "eF-seek",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Identification of protein biochemical functions based on their three-dimensional structures is now required in the post-genome-sequencing era. Ligand binding is one of the major biochemical functions of proteins, and thus the identification of ligands and their binding sites is the starting point for the function identification. Previously we reported our first trial on structure-based function prediction, based on the similarity searches of molecular surfaces against the functional site database. Here we describe the extension of our first trial by expanding the search database to whole heteroatom binding sites appearing within the Protein Data Bank (PDB) with the new analysis protocol. In addition, we have determined the similarity threshold line, by using 10 structure pairs with solved free and complex structures. Finally, we extensively applied our method to newly determined hypothetical proteins, including some without annotations, and evaluated the performance of our methods.",
                "authors": [
                    {
                        "name": "Kinoshita K."
                    },
                    {
                        "name": "Nakamura H."
                    }
                ],
                "citationCount": 67,
                "date": "2005-03-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Identification of the ligand binding sites on the molecular surface of proteins"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15689509",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "The identification of protein biochemical functions based on their three-dimensional structures is strongly required in the post-genome-sequencing era. We have developed a new method to identify and predict protein biochemical functions using the similarity information of molecular surface geometries and electrostatic potentials on the surfaces. Our prediction system consists of a similarity search method based on a clique search algorithm and the molecular surface database eF-site (electrostatic surface of functional-site in proteins). Using this system, functional sites similar to those of phosphoenoylpyruvate carboxy kinase were detected in several mononucleotide-binding proteins, which have different folds. We also applied our method to a hypothetical protein, MJ0226 from Methanococcus jannaschii, and detected the mononucleotide binding site from the similarity to other proteins having different folds.",
                "authors": [
                    {
                        "name": "Kinoshita K."
                    },
                    {
                        "name": "Nakamura H."
                    }
                ],
                "citationCount": 129,
                "date": "2003-08-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Identification of protein biochemical functions by similarity search using the molecular surface database eF-site"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12876308",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "A bioinformatics method was developed to identify the protein surface around the functional site and to estimate the biochemical function, using a newly constructed molecular surface database named the eF-site (electrostatic surface of Functional site. Molecular surfaces of protein molecules were computed based on the atom coordinates, and the eF-site database was prepared by adding the physical properties on the constructed molecular surfaces. The electrostatic potential on each molecular surface was individually calculated solving the Poisson-Boltzmann equation numerically for the precise continuum model, and the hydrophobicity information of each residue was also included. The eF-site database is accessed by the internet (http://pi.protein.osaka-u.ac.jp/eF-site/). We have prepared four different databases, eF-site/antibody, eF-site/prosite, eF-site/P-site, and eF-site/ActiveSite, corresponding to the antigen binding sites of antibodies with the same orientations, the molecular surfaces for the individual motifs in PROSITE database, the phosphate binding sites, and the active site surfaces for the representatives of the individual protein family, respectively. An algorithm using the clique detection method as an applied graph theory was developed to search of the eF-site database, so as to recognize and discriminate the characteristic molecular surfaces of the proteins. The method identifies the active site having the similar function to those of the known proteins.",
                "authors": [
                    {
                        "name": "Kinoshita K."
                    },
                    {
                        "name": "Furui J."
                    },
                    {
                        "name": "Nakamura H."
                    }
                ],
                "citationCount": 100,
                "date": "2002-07-08T00:00:00Z",
                "journal": "Journal of Structural and Functional Genomics",
                "title": "Identification of protein functions from a molecular surface database, eF-site"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12836670",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "We have developed a method to predict ligandbinding sites in a new protein structure by searching for similar binding sites in the Protein Data Bank (PDB). The similarities are measured according to the shapes of the molecular surfaces and their electrostatic potentials. A new web server, eF-seek, provides an interface to our search method. It simply requires a coordinate file in the PDB format, and generates a prediction result as a virtual complex structure, with the putative ligands in a PDB format file as the output. In addition, the predicted interacting interface is displayed to facilitate the examination of the virtual complex structure on our own applet viewer with the web browser (URL: http://eF-site.hgc.jp/eF-seek). © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Kinoshita K."
                    },
                    {
                        "name": "Murakami Y."
                    },
                    {
                        "name": "Nakamura H."
                    }
                ],
                "citationCount": 45,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EF-seek: Prediction of the functional sites of proteins by searching for similar electrostatic potential and molecular surface shape"
            },
            "note": null,
            "pmcid": null,
            "pmid": "17567616",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Summary: The electrostatic-surface of functional site (eF-site) is a database for the molecular surfaces of protein functional sites. To enable browsing of each molecular surface along with the atomic model, we have developed a new three-dimensional interactive viewer, PDBjViewer, that can be used both as an applet and as a stand-alone program. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Kinoshita K."
                    },
                    {
                        "name": "Nakamura H."
                    }
                ],
                "citationCount": 86,
                "date": "2004-05-22T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "eF-site and PDBjViewer: Database and viewer for protein functional sites"
            },
            "note": null,
            "pmcid": null,
            "pmid": "14871866",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "The study of structural genomics and structural proteomics has determined the tertiary structures of many hypothetical proteins, whose molecular functions could not be understood using conventional methods. In order to infer the geometrical location of the functional site, the biochemical function and the biological function of the hypothetical protein, much effort has been made in protein informatics. The importance of heterogeneous databases and various descriptors of amino acid sequences, tertiary structures and pathways on the proteome scale has been emphasised.",
                "authors": [
                    {
                        "name": "Kinoshita K."
                    },
                    {
                        "name": "Nakamura H."
                    }
                ],
                "citationCount": 56,
                "date": "2003-06-01T00:00:00Z",
                "journal": "Current Opinion in Structural Biology",
                "title": "Protein informatics towards function identification"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12831893",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        }
    ],
    "validated": 1,
    "version": []
}