{
    "additionDate": "2017-05-16T13:43:31Z",
    "biotoolsCURIE": "biotools:tspred",
    "biotoolsID": "tspred",
    "credit": [
        {
            "email": "cospisupport@iiserpune.ac.in",
            "name": "COSPI Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TSpred is a web server for the rational design of temperature-sensitive mutants. Input is a protein sequence or structure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cospi.iiserpune.ac.in/TSpred/Help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://mspc.bii.a-star.edu.sg/TSpred/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "Tspred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1073/pnas.93.24.13908",
            "metadata": {
                "abstract": "Temperature-sensitive (Ts) mutants of a protein are an extremely powerful tool for studying protein function in vivo and in cell culture. We have devised a method to predict those residues in a protein sequence that, when appropriately mutated, are most likely to give rise to a Ts phenotype. Since substitutions of buried hydrophobic residues often result in significant destabilization of the protein, our method predicts those residues in the sequence that are likely to be buried in the protein structure. We also indicate a set of amino acid substitutions, which should be made to generate a Ts mutant of the protein. This method requires only the protein sequence. No structural information or homologous sequence information is required. This method was applied to a test data set of 30 nonhomologous protein structures from the Protein Data Bank. All of the residues predicted by the method to be ≤95% buried were, in fact, buried in the protein crystal structure. In contrast, only 50% of all hydrophobic residues in this data set were ≤95% buried. This method successfully predicts several known Ts and partially active mutants of T4 lysozyme, λ repressor, gene V protein, and staphylococcal nuclease. This method also correctly predicts residues that form part of the hydrophobic cores of λ repressor, myoglobin, and cytochrome b562.",
                "authors": [
                    {
                        "name": "Nagarajaram H.A."
                    },
                    {
                        "name": "Ramakrishnan C."
                    },
                    {
                        "name": "Varadarajan R."
                    }
                ],
                "citationCount": 43,
                "date": "1996-11-26T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "A procedure for the prediction of temperature-sensitive mutants of a globular protein based solely on the amino acid sequence"
            },
            "pmcid": "PMC19465",
            "pmid": "8943034"
        },
        {
            "doi": "10.1093/nar/gku319",
            "metadata": {
                "abstract": "Temperature sensitive (Ts) mutants of proteins provide experimentalists with a powerful and reversible way of conditionally expressing genes. The technique has been widely used in determining the role of gene and gene products in several cellular processes. Traditionally, Ts mutants are generated by random mutagenesis and then selected though laborious large-scale screening. Our web server, TSpred (http://mspc.bii.a-star.edu.sg/TSpred/), now enables users to rationally design Ts mutants for their proteins of interest. TSpred uses hydrophobicity and hydrophobic moment, deduced from primary sequence and residue depth, inferred from 3D structures to predict/identify buried hydrophobic residues. Mutating these residues leads to the creation of Ts mutants. Our method has been experimentally validated in 36 positions in six different proteins. It is an attractive proposition for Ts mutant engineering as it proposes a small number of mutations and with high precision. The accompanying web server is simple and intuitive to use and can handle proteins and protein complexes of different sizes. © 2014 The Author(s).",
                "authors": [
                    {
                        "name": "Khare S."
                    },
                    {
                        "name": "Madhusudhan M.S."
                    },
                    {
                        "name": "Tan K.P."
                    },
                    {
                        "name": "Varadarajan R."
                    }
                ],
                "citationCount": 6,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TSpred: A web server for the rational design of temperature-sensitive mutants"
            },
            "pmcid": "PMC4086094",
            "pmid": "24782523"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
