{"credit":[{"email":"kosinski@embl.de","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.beck.embl.de/contact.html"}],"documentation":[{"type":"GENERAL","url":"http://www.beck.embl.de/documentation.html"}],"function":[{"operation":[{"term":"Structure analysis","uri":"http://edamontology.org/operation_2480"}]}],"labels":{"operatingSystem":["Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/xlink-analyzer-visualizing-cross-links-on-3d-structures.html"}],"publication":[{"abstract":"© 2015 The Authors. Structural characterization of large multi-subunit protein complexes often requires integrating various experimental techniques. Cross-linking mass spectrometry (XL-MS) identifies proximal protein residues and thus is increasingly used to map protein interactions and determine the relative orientation of subunits within the structure of protein complexes. To fully adapt XL-MS as a structure characterization technique, we developed Xlink Analyzer, a software tool for visualization and analysis of XL-MS data in the context of the three-dimensional structures. Xlink Analyzer enables automatic visualization of cross-links, identifies cross-links violating spatial restraints, calculates violation statistics, maps chemically modified surfaces, and allows interactive manipulations that facilitate analysis of XL-MS data and aid designing new experiments. We demonstrate these features by mapping interaction sites within RNA polymerase I and the Rvb1/2 complex. Xlink Analyzer is implemented as a plugin to UCSF Chimera, a standard structural biology software tool, and thus enables seamless integration of XL-MS data with, e.g. fitting of X-ray structures to EM maps. Xlink Analyzer is available for download at http://www.beck.embl.de/XlinkAnalyzer.html.","authors":["Kosinski J.","von Appen A.","Ori A.","Karius K.","Muller C.W.","Beck M."],"cit_count":39,"journal":"Journal of Structural Biology","pmid":"25661704","title":"Xlink analyzer: Software for analysis and visualization of cross-linking data in the context of three-dimensional structures","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:xlink_analyzer","biotoolsID":"xlink_analyzer","description":"Interactive software for visualizing cross-links on structures and analyzing how the structures agree with the cross-links.","homepage":"http://www.beck.embl.de/XlinkAnalyzer.html","name":"Xlink Analyzer"}}