{
    "additionDate": "2021-01-18T07:59:34Z",
    "biotoolsCURIE": "biotools:moaims",
    "biotoolsID": "moaims",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mhamada@waseda.jp",
            "name": "Michiaki Hamada",
            "orcidid": "https://orcid.org/0000-0001-9466-1034",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient software for detection of enriched regions of MeRIP-Seq.\n\nMethylated RNA immunoprecipitation sequencing (MeRIP-Seq) is a popular sequencing method for studying RNA modifications and, in particular, for N6-methyladenosine (m6A), the most abundant RNA methylation modification found in various species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rreybeyb/MoAIMS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-26T09:06:53Z",
    "name": "MoAIMS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3430-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Methylated RNA immunoprecipitation sequencing (MeRIP-Seq) is a popular sequencing method for studying RNA modifications and, in particular, for N6-methyladenosine (m6A), the most abundant RNA methylation modification found in various species. The detection of enriched regions is a main challenge of MeRIP-Seq analysis, however current tools either require a long time or do not fully utilize features of RNA sequencing such as strand information which could cause ambiguous calling. On the other hand, with more attention on the treatment experiments of MeRIP-Seq, biologists need intuitive evaluation on the treatment effect from comparison. Therefore, efficient and user-friendly software that can solve these tasks must be developed. Results: We developed a software named \"model-based analysis and inference of MeRIP-Seq (MoAIMS)\" to detect enriched regions of MeRIP-Seq and infer signal proportion based on a mixture negative-binomial model. MoAIMS is designed for transcriptome immunoprecipitation sequencing experiments; therefore, it is compatible with different RNA sequencing protocols. MoAIMS offers excellent processing speed and competitive performance when compared with other tools. When MoAIMS is applied to studies of m6A, the detected enriched regions contain known biological features of m6A. Furthermore, signal proportion inferred from MoAIMS for m6A treatment datasets (perturbation of m6A methyltransferases) showed a decreasing trend that is consistent with experimental observations, suggesting that the signal proportion can be used as an intuitive indicator of treatment effect. Conclusions: MoAIMS is efficient and easy-to-use software implemented in R. MoAIMS can not only detect enriched regions of MeRIP-Seq efficiently but also provide intuitive evaluation on treatment effect for MeRIP-Seq treatment datasets.",
                "authors": [
                    {
                        "name": "Hamada M."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 5,
                "date": "2020-03-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MoAIMS: Efficient software for detection of enriched regions of MeRIP-Seq"
            },
            "pmcid": "PMC7071693",
            "pmid": "32171255"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
