{
    "additionDate": "2021-01-18T07:41:09Z",
    "biotoolsCURIE": "biotools:dicer-mri",
    "biotoolsID": "dicer-mri",
    "confidence_flag": "tool",
    "description": "Diiffuse Cluster Estimation and Regression (DiCER) is a tool for Identifying and removing widespread signal deflections from fMRI data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BMHLab/DiCER",
    "language": [
        "Shell",
        "Python",
        "MATLAB"
    ],
    "lastUpdate": "2021-03-01T08:45:09Z",
    "license": "Apache-2.0",
    "name": "DiCER",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2020.116614",
            "metadata": {
                "abstract": "© 2020 The AuthorsOne of the most controversial procedures in the analysis of resting-state functional magnetic resonance imaging (rsfMRI) data is global signal regression (GSR): the removal, via linear regression, of the mean signal averaged over the entire brain. On one hand, the global mean signal contains variance associated with respiratory, scanner-, and motion-related artifacts, and its removal via GSR improves various quality-control metrics, enhances the anatomical specificity of functional-connectivity patterns, and can increase the behavioral variance explained by such patterns. On the other hand, GSR alters the distribution of regional signal correlations in the brain, can induce artifactual anticorrelations, may remove real neural signal, and can distort case-control comparisons of functional-connectivity measures. Global signal fluctuations can be identified visually from a matrix of colour-coded signal intensities, called a carpet plot, in which rows represent voxels and columns represent time. Prior to GSR, large, periodic bands of coherent signal changes that affect most of the brain are often apparent; after GSR, these apparently global changes are greatly diminished. Here, using three independent datasets, we show that reordering carpet plots to emphasize cluster structure in the data reveals a greater diversity of spatially widespread signal deflections (WSDs) than previously thought. Their precise form varies across time and participants, and GSR is only effective in removing specific kinds of WSDs. We present an alternative, iterative correction method called Diffuse Cluster Estimation and Regression (DiCER), that identifies representative signals associated with large clusters of coherent voxels. DiCER is more effective than GSR at removing diverse WSDs as visualized in carpet plots, reduces correlations between functional connectivity and head-motion estimates, reduces inter-individual variability in global correlation structure, and results in comparable or improved identification of canonical functional-connectivity networks. Using task fMRI data across 47 contrasts from 7 tasks in the Human Connectome Project, we also present evidence that DiCER is more successful than GSR in preserving the spatial structure of expected task-related activation patterns. Our findings indicate that care must be exercised when examining WSDs (and their possible removal) in rsfMRI data, and that DiCER is a viable alternative to GSR for removing anatomically widespread and temporally coherent signals. All code for implementing DiCER and replicating our results is available at https://github.com/BMHLab/DiCER.",
                "authors": [
                    {
                        "name": "Aquino K.M."
                    },
                    {
                        "name": "Fulcher B.D."
                    },
                    {
                        "name": "Parkes L."
                    },
                    {
                        "name": "Sabaroedin K."
                    },
                    {
                        "name": "Fornito A."
                    }
                ],
                "citationCount": 13,
                "date": "2020-05-15T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Identifying and removing widespread signal deflections from fMRI data: Rethinking the global signal regression problem"
            },
            "pmid": "32084564"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}