{
    "additionDate": "2017-08-03T19:02:44Z",
    "biotoolsCURIE": "biotools:theme",
    "biotoolsID": "theme",
    "credit": [
        {
            "email": "ichsu@mx.nthu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://metadb.bmes.nthu.edu.tw/theme/contact.php"
        }
    ],
    "description": "The tool is designed for biologists to identify Differentially Expressed Genes (DEG) from loop-design microarray experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://metadb.bmes.nthu.edu.tw/theme/about.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://metadb.bmes.nthu.edu.tw/theme/home.php",
    "language": [
        "C",
        "MATLAB",
        "PHP",
        "R"
    ],
    "lastUpdate": "2024-11-25T14:19:12.987114Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/theme-web-tool-for-loop-design-microarray-data-analysis.html"
        }
    ],
    "name": "THEME",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2011.11.012",
            "metadata": {
                "abstract": "A number of recent studies have shown that loop-design is more efficient than reference control design. Data analysis for loop-design microarray experiments is commonly undertaken using linear models and statistical tests. These techniques require specialized knowledge in statistical programming. However, limited loop-design web-based tools are available. We have developed the THEME (Tsing Hua Engine of Microarray Experiment) that exploits all necessary data analysis tools for loop-design microarray studies. THEME allows users to construct linear models and to apply multiple user-defined statistical tests of hypotheses for detection of DEG (differentially expressed genes). Users can modify entries of design matrix for experimental design as well as that of contrast matrix for statistical tests of hypotheses. The output of multiple user-defined statistical tests of hypotheses, DEG lists, can be cross-validated. The web platform provides data assessment and visualization tools that significantly assist users when evaluating the performance of microarray experimental procedures. THEME is also a MIAME (Minimal Information About a Microarray Experiment) compliant system, which enables users to export formatted files for GEO (Gene Expression Omnibus) submission. THEME offers comprehensive web services to biologists for data analysis of loop-design microarray experiments. This web-based resource is especially useful for core facility service as well as collaboration projects when researchers are not at the same site. Data analysis procedures, starting from uploading raw data files to retrieving DEG lists, can be flexibly operated with natural workflows. These features make THEME a reliable and powerful on-line system for data analysis of loop-design microarrays. The THEME server is available at http://metadb.bmes.nthu.edu.tw/theme/. © 2011 Elsevier Ltd.",
                "authors": [
                    {
                        "name": "Chen C.-R."
                    },
                    {
                        "name": "Cheng W.-C."
                    },
                    {
                        "name": "Hsu I.C."
                    },
                    {
                        "name": "Shu W.-Y."
                    },
                    {
                        "name": "Tsai M.-L."
                    }
                ],
                "citationCount": 9,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "THEME: A web tool for loop-design microarray data analysis"
            },
            "pmid": "22188791"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
