{
    "additionDate": "2019-11-14T18:19:22Z",
    "biotoolsCURIE": "biotools:OSkirc",
    "biotoolsID": "OSkirc",
    "confidence_flag": "high",
    "description": "> HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'KIRC' | a web tool for identifying prognostic biomarkers in kidney renal clear cell carcinoma | Aim: To develop a free and quick analysis online tool that allows users to easily investigate the prognostic potencies of interesting genes in kidney renal clear cell carcinoma (KIRC). Patients & methods: A total of 629 KIRC cases with gene expression profiling data and clinical follow-up information are collected from public Gene Expression Omnibus and The Cancer Genome Atlas databases. Results: One web application called Online consensus Survival analysis for KIRC (OSkirc) that can be used for exploring the prognostic implications of interesting genes in KIRC was constructed. By OSkirc, users could simply input the gene symbol to receive the Kaplan-Meier survival plot with hazard ratio and log-rank p-value",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31368353",
    "lastUpdate": "2019-11-14T18:19:22Z",
    "name": "OSkirc",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2217/FON-2019-0296",
            "metadata": {
                "abstract": "© 2019 Future Medicine Ltd.Aim: To develop a free and quick analysis online tool that allows users to easily investigate the prognostic potencies of interesting genes in kidney renal clear cell carcinoma (KIRC). Patients & methods: A total of 629 KIRC cases with gene expression profiling data and clinical follow-up information are collected from public Gene Expression Omnibus and The Cancer Genome Atlas databases. Results: One web application called Online consensus Survival analysis for KIRC (OSkirc) that can be used for exploring the prognostic implications of interesting genes in KIRC was constructed. By OSkirc, users could simply input the gene symbol to receive the Kaplan-Meier survival plot with hazard ratio and log-rank p-value. Conclusion: OSkirc is extremely valuable for basic and translational researchers to screen and validate the prognostic potencies of genes for KIRC, publicly accessible at http://bioinfo.henu.edu.cn/KIRC/KIRCList.jsp</ext-link.",
                "authors": [
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Dang Y."
                    },
                    {
                        "name": "Ge L."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Guo X."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Future Oncology",
                "title": "OSkirc: A web tool for identifying prognostic biomarkers in kidney renal clear cell carcinoma"
            },
            "pmid": "31368353"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}