{
    "additionDate": "2021-01-18T11:36:02Z",
    "biotoolsCURIE": "biotools:bosniak-calculator",
    "biotoolsID": "bosniak-calculator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "satheeshkrishna.jeyaraj@utoronto.ca",
            "name": "Satheesh Krishna MD",
            "typeEntity": "Person"
        }
    ],
    "description": "Determination of Bosniak grade for cystic renal masses using MRI.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://bosniak-calculator.herokuapp.com/",
    "lastUpdate": "2021-02-04T18:37:32Z",
    "name": "Bosniak Calculator",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/JMRI.27364",
            "metadata": {
                "abstract": "© 2020 International Society for Magnetic Resonance in MedicineIncidental cystic renal masses are common, usually benign, and almost always indolent. Since 1986, the Bosniak classification has been used to express the risk of malignancy in a cystic renal mass detected at imaging. Historically, magnetic resonance imaging (MRI) was not included in that classification. The proposed Bosniak v.2019 update has formally incorporated MRI, included definitions of imaging terms designed to improve interobserver agreement and specificity for malignancy, and incorporated a variety of masses that were incompletely defined or not included in the original classification. For example, at unenhanced MRI, homogeneous masses markedly hyperintense at T2-weighted imaging (similar to cerebrospinal fluid) and homogeneous masses markedly hyperintense at fat suppressed T1-weighted imaging (approximately ≥2.5 times more intense than adjacent renal parenchyma) are classified as Bosniak II and may be safely ignored, even when they have not been imaged with a complete renal mass MRI protocol. MRI has specific advantages and is recommended to evaluate masses that at computed tomography (CT) 1) have abundant thick or nodular calcifications; 2) are homogeneous, hyperattenuating, ≥3 cm, and nonenhancing; or 3) are heterogeneous and nonenhancing. Although MRI is generally excellent for characterizing cystic renal masses, there are unique weaknesses of MRI that bear consideration. These details and others related to MRI of cystic renal masses are described in this review, with an emphasis on Bosniak v.2019. A website (https://bosniak-calculator.herokuapp.com/) and mobile phone apps named “Bosniak Calculator” have been developed for ease of assignment of Bosniak classes. Level of Evidence: 5. Technical Efficacy Stage: 3.",
                "authors": [
                    {
                        "name": "Baroni R.H."
                    },
                    {
                        "name": "Davenport M.S."
                    },
                    {
                        "name": "Hindman N."
                    },
                    {
                        "name": "Krishna S."
                    },
                    {
                        "name": "Pedrosa I."
                    },
                    {
                        "name": "Schieda N."
                    },
                    {
                        "name": "Silverman S.G."
                    }
                ],
                "citationCount": 1,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Journal of Magnetic Resonance Imaging",
                "title": "Update on MRI of Cystic Renal Masses Including Bosniak Version 2019"
            },
            "pmid": "33009722"
        }
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
