{
    "additionDate": "2018-09-03T03:10:32Z",
    "biotoolsCURIE": "biotools:biorepository_portal_toolkit",
    "biotoolsID": "biorepository_portal_toolkit",
    "credit": [
        {
            "email": "cbmisupport@email.chop.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A set of tools that allow for data integration while protecting patient privacy. This modular approach allows data and specimens to be associated with a biorepository subject at any time point asynchronously.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/chop-dbhi/biorepo-portal/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://eig.research.chop.edu/brptoolkit/",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/chop-dbhi/biorepo-portal"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/chop-dbhi/biorepo-portal/issues"
        }
    ],
    "name": "Biorepository Portal Toolkit",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12864-016-2797-9",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: High throughput molecular sequencing and increased biospecimen variety have introduced significant informatics challenges for research biorepository infrastructures. We applied a modular system integration approach to develop an operational biorepository management system. This method enables aggregation of the clinical, specimen and genomic data collected for biorepository resources. Methods: We introduce an electronic Honest Broker (eHB) and Biorepository Portal (BRP) open source project that, in tandem, allow for data integration while protecting patient privacy. This modular approach allows data and specimens to be associated with a biorepository subject at any time point asynchronously. This lowers the bar to develop new research projects based on scientific merit without institutional review for a proposal. Results: By facilitating the automated de-identification of specimen and associated clinical and genomic data we create a future proofed specimen set that can withstand new workflows and be connected to new associated information over time. Thus facilitating collaborative advanced genomic and tissue research. Conclusions: As of Janurary of 2016 there are 23 unique protocols/patient cohorts being managed in the Biorepository Portal (BRP). There are over 4000 unique subject records in the electronic honest broker (eHB), over 30,000 specimens accessioned and 8 institutions participating in various biobanking activities using this tool kit. We specifically set out to build rich annotation of biospecimens with longitudinal clinical data; BRP/REDCap integration for multi-institutional repositories; EMR integration; further annotated specimens with genomic data specific to a domain; build application hooks for experiments at the specimen level integrated with analytic software; while protecting privacy per the Office of Civil Rights (OCR) and HIPAA.",
                "authors": [
                    {
                        "name": "Felmeister A.S."
                    },
                    {
                        "name": "Masino A.J."
                    },
                    {
                        "name": "Rivera T.J."
                    },
                    {
                        "name": "Resnick A.C."
                    },
                    {
                        "name": "Pennington J.W."
                    }
                ],
                "citationCount": 5,
                "date": "2016-08-18T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "The biorepository portal toolkit: An honest brokered, modular service oriented software tool set for biospecimen-driven translational research"
            },
            "pmcid": "PMC5001241",
            "pmid": "27535360",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        }
    ],
    "validated": 1
}