{
    "additionDate": "2019-11-14T18:19:47Z",
    "biotoolsCURIE": "biotools:GRAM",
    "biotoolsID": "GRAM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mark@gersteinlab.org",
            "name": "Mark Gerstein",
            "typeEntity": "Person"
        }
    ],
    "description": "A GeneRAlized Model to predict the molecular effect of a non-coding variant in a cell-type specific manner | GRAM: A GeneRAlized Model to predict the molecular effect of a non-coding variant in a cell type-specific manner",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gersteinlab/GRAM",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2020-12-03T12:47:57Z",
    "name": "GRAM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PGEN.1007860",
            "metadata": {
                "abstract": "© 2019 Lou et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.There has been much effort to prioritize genomic variants with respect to their impact on \"function\". However, function is often not precisely defined: sometimes it is the disease association of a variant; on other occasions, it reflects a molecular effect on transcription or epigenetics. Here, we coupled multiple genomic predictors to build GRAM, a GeneRAlized Model, to predict a well-defined experimental target: the expression-modulating effect of a non-coding variant on its associated gene, in a transferable, cell-specific manner. Firstly, we performed feature engineering: using LASSO, a regularized linear model, we found transcription factor (TF) binding most predictive, especially for TFs that are hubs in the regulatory network; in contrast, evolutionary conservation, a popular feature in many other variantimpact predictors, has almost no contribution. Moreover, TF binding inferred from in vitro SELEX is as effective as that from in vivo ChIP-Seq. Second, we implemented GRAM integrating only SELEX features and expression profiles; thus, the program combines a universal regulatory score with an easily obtainable modifier reflecting the particular cell type. We benchmarked GRAM on large-scale MPRA datasets, achieving AUROC scores of 0.72 in GM12878 and 0.66 in a multi-cell line dataset. We then evaluated the performance of GRAM on targeted regions using luciferase assays in the MCF7 and K562 cell lines. We noted that changing the insertion position of the construct relative to the reporter gene gave very different results, highlighting the importance of carefully defining the exact prediction target of the model. Finally, we illustrated the utility of GRAM in fine-mapping causal variants and developed a practical software pipeline to carry this out. In particular, we demonstrated in specific examples how the pipeline could pinpoint variants that directly modulate gene expression within a larger linkage-disequilibrium block associated with a phenotype of interest (e.g., for an eQTL).",
                "authors": [
                    {
                        "name": "Cohen S."
                    },
                    {
                        "name": "Cotter K.A."
                    },
                    {
                        "name": "Gerstein M."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Lou S."
                    },
                    {
                        "name": "Mohsen H."
                    },
                    {
                        "name": "Rubin M.A."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "GRAM: A GeneRAlized Model to predict the molecular effect of a non-coding variant in a cell-type specific manner"
            },
            "pmcid": "PMC6742416",
            "pmid": "31469829"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
