
{
    "credit": [
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/hemberg-lab/D3E/wiki/User-Guide"
        },
        {
            "type": "TRAINING_MATERIAL",
            "url": "https://github.com/hemberg-lab/D3E/wiki/Example"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/hemberg-lab/D3E"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression matrix",
                        "uri": "http://edamontology.org/data_3112"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Delmans and Hemberg. Background: The advent of high throughput RNA-seq at the single-cell level has opened up new opportunities to elucidate the heterogeneity of gene expression. One of the most widespread applications of RNA-seq is to identify genes which are differentially expressed between two experimental conditions. Results: We present a discrete, distributional method for differential gene expression (D3E), a novel algorithm specifically designed for single-cell RNA-seq data. We use synthetic data to evaluate D3E, demonstrating that it can detect changes in expression, even when the mean level remains unchanged. Since D3E is based on an analytically tractable stochastic model, it provides additional biological insights by quantifying biologically meaningful properties, such as the average burst size and frequency. We use D3E to investigate experimental data, and with the help of the underlying model, we directly test hypotheses about the driving mechanism behind changes in gene expression. Conclusion: Evaluation using synthetic data shows that D3E performs better than other methods for identifying differentially expressed genes since it is designed to take full advantage of the information available from single-cell RNA-seq experiments. Moreover, the analytical model underlying D3E makes it possible to gain additional biological insights.",
            "authors": [
                "Delmans M.",
                "Hemberg M."
            ],
            "cit_count": 17,
            "doi": "10.1186/s12859-016-0944-6",
            "journal": "BMC Bioinformatics",
            "title": "Discrete distributional differential expression (D3E) - a tool for gene expression analysis of single-cell RNA-seq data",
            "type": "Primary",
            "year": "2016-02-29"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:D3E",
        "biotoolsID": "D3E",
        "description": "Identification of differentially-expressed genes in single-cell RNA sequencing data.",
        "homepage": "https://www.sanger.ac.uk/science/tools/discrete-distributional-differential-expression-d3e",
        "name": "D3E"
    }
}