{
    "accessibility": "Open access",
    "additionDate": "2025-03-11T14:55:53.492167Z",
    "biotoolsCURIE": "biotools:molgenis_european_health_research_data_and_sample_catalogue",
    "biotoolsID": "molgenis_european_health_research_data_and_sample_catalogue",
    "cost": "Free of charge",
    "description": "A collaborative effort to integrate the catalogues of diverse EU research projects and networks to accelerate reuse and improve citizens health.",
    "editPermission": {
        "authors": [
            "EleanorHyde",
            "mswertz"
        ],
        "type": "group"
    },
    "homepage": "https://data-catalogue.molgeniscloud.org/",
    "lastUpdate": "2025-03-19T15:08:24.036904Z",
    "name": "European Health Research Data and Sample Catalogue",
    "owner": "EleanorHyde",
    "publication": [
        {
            "doi": "10.1055/s-0042-1742522",
            "metadata": {
                "abstract": "Objectives: Existing individual-level human data cover large populations on many dimensions such as lifestyle, demography, laboratory measures, clinical parameters, etc. Recent years have seen large investments in data catalogues to FAIRify data descriptions to capitalise on this great promise, i.e. make catalogue contents more Findable, Accessible, Interoperable and Reusable. However, their valuable diversity also created heterogeneity, which poses challenges to optimally exploit their richness. Methods: In this opinion review, we analyse catalogues for human subject research ranging from cohort studies to surveillance, administrative and healthcare records. Results: We observe that while these catalogues are heterogeneous, have various scopes, and use different terminologies, still the underlying concepts seem potentially harmonizable. We propose a unified framework to enable catalogue data sharing, with catalogues of multi-center cohorts nested as a special case in catalogues of real-world data sources. Moreover, we list recommendations to create an integrated community of metadata catalogues and an open catalogue ecosystem to sustain these efforts and maximise impact. Conclusions: We propose to embrace the autonomy of motivated catalogue teams and invest in their collaboration via minimal standardisation efforts such as clear data licensing, persistent identifiers for linking same records between catalogues, minimal metadata 'common data elements' using shared ontologies, symmetric architectures for data sharing (push/pull) with clear provenance tracks to process updates and acknowledge original contributors. And most importantly, we encourage the creation of environments for collaboration and resource sharing between catalogue developers, building on international networks such as OpenAIRE and research data alliance, as well as domain specific ESFRIs such as BBMRI and ELIXIR.",
                "authors": [
                    {
                        "name": "Bergeron J."
                    },
                    {
                        "name": "Cunnington M."
                    },
                    {
                        "name": "Fortier I."
                    },
                    {
                        "name": "Gini R."
                    },
                    {
                        "name": "Goncalves G."
                    },
                    {
                        "name": "Hyde E."
                    },
                    {
                        "name": "Kellmann A."
                    },
                    {
                        "name": "Marcon Y."
                    },
                    {
                        "name": "Nybo Andersen A.-M."
                    },
                    {
                        "name": "Oliveira J.L."
                    },
                    {
                        "name": "Pahoueshnja R."
                    },
                    {
                        "name": "Sturkenboom M."
                    },
                    {
                        "name": "Swertz M."
                    },
                    {
                        "name": "Thurin N.H."
                    },
                    {
                        "name": "Van Enckevort E."
                    }
                ],
                "citationCount": 9,
                "date": "2022-12-04T00:00:00Z",
                "journal": "Yearbook of Medical Informatics",
                "title": "Towards an Interoperable Ecosystem of Research Cohort and Real-world Data Catalogues Enabling Multi-center Studies"
            },
            "pmcid": "PMC9719789",
            "pmid": "36463884"
        }
    ],
    "toolType": [
        "Database portal"
    ]
}
