{
    "name": "TMARG", 
    "description": "It is a program that takes SNP population haplotypes and case/control phenotypes to identify disease associated sites. It takes the approach of inferring genealogical history (in the form of ancestral recombination graph or ARG) and then using the ARGs to map the trait.", 
    "homepage": "http://www.engr.uconn.edu/~ywu/TMARG.html", 
    "biotoolsID": "tmarg", 
    "biotoolsCURIE": "biotools:tmarg", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2429", 
                    "term": "Mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "SNP"
        }, 
        {
            "uri": "http://edamontology.org/topic_0634", 
            "term": "Disease"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0102", 
            "term": "Mapping"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/tmarg-1-0-association-mapping-tool-identifying-disease-sites.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.engr.uconn.edu/~ywu/TMARG/README.txt", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1089/cmb.2007.0116", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Association mapping of complex diseases with ancestral recombination graphs: Models and efficient algorithms", 
                "abstract": "Association, or linkage disequilibrium (LD), mapping is an intensely studied approach to gene mapping (genome-wide or in candidate regions) that is widely hoped to be able to efficiently locate genes influencing both complex and Mendelian traits. The logic underlying association mapping implies that the best possible mapping results would be obtained if the genealogical history of the sampled individuals were explicitly known. Such a history would be in the form of an ancestral recombination graph (ARG). But despite the conceptual importance of genealogical histories to association mapping, few practical association mapping methods have explicitly used derived genealogical aspects of ARGs. In this paper, we develop an association mapping method that explicitly constructs and samples minARGs (ARGs that minimize the number of recombinations). We develop an ARG sampling method that provably samples minARGs uniformly at random, and that is practical for moderate sized datasets. We also develop a different, faster, ARG sampling method that still samples from a well-defined subspace of ARGs, and that is practical for larger sized datasets. We present novel results on extensions of the \"phenotype likelihood\" problem, a key step in a previous method. Finally, we put all of these results into practice, and examine how well the implemented methods perform, compared to previous results. The empirical results show great speed ups, and definite but sometimes small, improvements in mapping accuracy. Speed is particularly important in doing genome-wide scans for causative mutations. © Mary Ann Liebert, Inc. 2008.", 
                "date": "2008-09-01T00:00:00Z", 
                "citationCount": 6, 
                "authors": [
                    {
                        "name": "Wu Y."
                    }
                ], 
                "journal": "Journal of Computational Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.engr.uconn.edu/~ywu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:13:35Z", 
    "lastUpdate": "2018-12-10T12:58:58Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}