{
    "additionDate": "2024-07-24T10:58:07.066490Z",
    "biotoolsCURIE": "biotools:mrslpred",
    "biotoolsID": "mrslpred",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr. Gajendra P. S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/"
        }
    ],
    "description": "MRSLpred - A tool for mRNA subcellular localization prediction",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://webs.iiitd.edu.in/raghava/mrslpred/",
    "lastUpdate": "2024-11-24T13:50:04.379000Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/mrslpred/"
        }
    ],
    "name": "MRSLpred",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.3389/fbinf.2024.1341479",
            "metadata": {
                "abstract": "In the past, several methods have been developed for predicting the single-label subcellular localization of messenger RNA (mRNA). However, only limited methods are designed to predict the multi-label subcellular localization of mRNA. Furthermore, the existing methods are slow and cannot be implemented at a transcriptome scale. In this study, a fast and reliable method has been developed for predicting the multi-label subcellular localization of mRNA that can be implemented at a genome scale. Machine learning-based methods have been developed using mRNA sequence composition, where the XGBoost-based classifier achieved an average area under the receiver operator characteristic (AUROC) of 0.709 (0.668–0.732). In addition to alignment-free methods, we developed alignment-based methods using motif search techniques. Finally, a hybrid technique that combines the XGBoost model and the motif-based approach has been developed, achieving an average AUROC of 0.742 (0.708–0.816). Our method—MRSLpred—outperforms the existing state-of-the-art classifier in terms of performance and computation efficiency. A publicly accessible webserver and a standalone tool have been developed to facilitate researchers (webserver: https://webs.iiitd.edu.in/raghava/mrslpred/).",
                "authors": [
                    {
                        "name": "Bajiya N."
                    },
                    {
                        "name": "Choudhury S."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 1,
                "date": "2024-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "MRSLpred—a hybrid approach for predicting multi-label subcellular localization of mRNA at the genome scale"
            },
            "pmcid": "PMC10877048",
            "pmid": "38379813"
        }
    ]
}
