{
    "additionDate": "2017-08-20T15:57:31Z",
    "biotoolsCURIE": "biotools:ibdseq",
    "biotoolsID": "ibdseq",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "browning@uw.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software program for detecting segments of identity-by-descent (IBD) and homozygosity-by-descent (HBD) in unphased genetic sequence data. IBDseq can analyze large data sets with thousands of individuals, and it can analyze data with multi-allelic markers.",
    "documentation": [
        {
            "type": "General",
            "url": "http://faculty.washington.edu/browning/ibdseq.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://faculty.washington.edu/browning/ibdseq.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-09-04T08:38:11Z",
    "license": "Apache-2.0",
    "name": "IBDseq",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1016/j.ajhg.2013.09.014",
            "metadata": {
                "abstract": "Existing methods for identity by descent (IBD) segment detection were designed for SNP array data, not sequence data. Sequence data have a much higher density of genetic variants and a different allele frequency distribution, and can have higher genotype error rates. Consequently, best practices for IBD detection in SNP array data do not necessarily carry over to sequence data. We present a method,IBDseq, for detecting IBD segments in sequence data and a method, SEQERR, for estimating genotype error rates at low-frequency variants by using detected IBD. The IBDseq method estimates probabilities of genotypes observed with error for each pair of individuals under IBD and non-IBD models. The ratio of estimated probabilities under the two models gives a LOD score for IBD.We evaluate several IBD detection methods that are fast enough for application to sequence data (IBDseq, Beagle Refined IBD, PLINK, and GERMLINE) under multiple parameter settings, and we show that IBDseq achieves high power and accuracy for IBD detection in sequence data. The SEQERR method estimates genotype error rates by comparing observed and expected rates of pairs of homozygote and heterozygote genotypes at low-frequency variants in IBD segments. We demonstrate the accuracy of SEQERR in simulated data, and we apply the method to estimate genotype error rates in sequence data from the UK10K and 1000 Genomes projects. © 2013 by The American Society of Human Genetics. All rights reserved.",
                "authors": [
                    {
                        "name": "Browning B.L."
                    },
                    {
                        "name": "Browning S.R."
                    }
                ],
                "citationCount": 41,
                "date": "2013-11-07T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Detecting identity by descent and estimating genotype error rates in sequence data"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}