{
    "additionDate": "2021-03-19T08:31:57Z",
    "biotoolsCURIE": "biotools:dstg",
    "biotoolsID": "dstg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "su1@iu.edu",
            "name": "Qianqian Song",
            "orcidid": "https://orcid.org/0000-0002-4455-5302",
            "typeEntity": "Person"
        },
        {
            "email": "qsong@wakehealth.edu",
            "name": "Jing Su",
            "typeEntity": "Person"
        }
    ],
    "description": "DSTG is a tool for deconvoluting spatial transcriptomics data through graph-based artificial intelligence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Su-informatics-lab/DSTG",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:37:21.945651Z",
    "license": "MIT",
    "name": "DSTG",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bib/bbaa414",
            "metadata": {
                "abstract": "Recent development of spatial transcriptomics (ST) is capable of associating spatial information at different spots in the tissue section with RNA abundance of cells within each spot, which is particularly important to understand tissue cytoarchitectures and functions. However, for such ST data, since a spot is usually larger than an individual cell, gene expressions measured at each spot are from a mixture of cells with heterogenous cell types. Therefore, ST data at each spot needs to be disentangled so as to reveal the cell compositions at that spatial spot. In this study, we propose a novel method, named deconvoluting spatial transcriptomics data through graph-based convolutional networks (DSTG), to accurately deconvolute the observed gene expressions at each spot and recover its cell constitutions, thus achieving high-level segmentation and revealing spatial architecture of cellular heterogeneity within tissues. DSTG not only demonstrates superior performance on synthetic spatial data generated from different protocols, but also effectively identifies spatial compositions of cells in mouse cortex layer, hippocampus slice and pancreatic tumor tissues. In conclusion, DSTG accurately uncovers the cell states and subpopulations based on spatial localization. DSTG is available as a ready-To-use open source software (https://github.com/Su-informatics-lab/DSTG) for precise interrogation of spatial organizations and functions in tissues.",
                "authors": [
                    {
                        "name": "Song Q."
                    },
                    {
                        "name": "Su J."
                    }
                ],
                "citationCount": 109,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "DSTG: Deconvoluting spatial transcriptomics data through graph-based artificial intelligence"
            },
            "pmcid": "PMC8425268",
            "pmid": "33480403"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
