{
    "additionDate": "2017-12-18T00:05:52Z",
    "biotoolsCURIE": "biotools:discriminative_hmms",
    "biotoolsID": "discriminative_hmms",
    "credit": [
        {
            "email": "thlin@microsoft.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Discriminative HMMs (Hidden Markov models) predicts localizations using motifs that are present in a compartment but absent in other, nearby, compartments by utilizing an hierarchical structure that mimics the protein sorting mechanism.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://murphylab.cbi.cmu.edu/software/2009_TCBB_motif/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/discriminative-hmms-find-discriminative-motif-predict-protein-subcellular-localization.html"
        }
    ],
    "name": "Discriminative HMMs",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1109/TCBB.2009.82",
            "metadata": {
                "abstract": "Many methods have been described to predict the subcellular location of proteins from sequence information. However, most of these methods either rely on global sequence properties or use a set of known protein targeting motifs to predict protein localization. Here, we develop and test a novel method that identifies potential targeting motifs using a discriminative approach based on hidden Markov models (discriminative HMMs). These models search for motifs that are present in a compartment but absent in other, nearby, compartments by utilizing an hierarchical structure that mimics the protein sorting mechanism. We show that both discriminative motif finding and the hierarchical structure improve localization prediction on a benchmark data set of yeast proteins. The motifs identified can be mapped to known targeting motifs and they are more conserved than the average protein sequence. Using our motif-based predictions, we can identify potential annotation errors in public databases for the location of some of the proteins. A software implementation and the data set described in this paper are available from http://murphylab.web.cmu.edu/software/2009- TCBB-motif/. © 2011 IEEE.",
                "authors": [
                    {
                        "name": "Lin T.-H."
                    },
                    {
                        "name": "Murphy R.F."
                    },
                    {
                        "name": "Bar-Joseph Z."
                    }
                ],
                "citationCount": 26,
                "date": "2011-02-10T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Discriminative motif finding for predicting protein subcellular localization"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "HMMs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein sorting",
            "uri": "http://edamontology.org/topic_0140"
        }
    ],
    "validated": 1
}