{
    "additionDate": "2021-01-18T12:06:03Z",
    "biotoolsCURIE": "biotools:ppgsynth",
    "biotoolsID": "ppgsynth",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "moe.elgendi@gmail.com",
            "name": "Mohamed Elgendi",
            "typeEntity": "Person"
        }
    ],
    "description": "An Innovative Toolbox for Synthesizing Regular and Irregular Photoplethysmography Waveforms.\n\nPhotoplethysmography (PPG) is increasingly used in digital health, exceptionally in smartwatches. The PPG signal contains valuable information about heart activity, and there is lots of research interest in its means and analysis for cardiovascular diseases. Unfortunately, to our knowledge, there is no arrhythmic PPG dataset publicly available-this paper attempt to provide a toolbox that can generate synthesized arrhythmic PPG signals. The model of a single PPG pulse in this toolbox utilizes two combined Gaussian functions. This toolbox supports synthesizing PPG waveform with regular heartbeats and three irregular heartbeats: compensation, interpolation, and reset",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/Elgendi/PPG-Synthesis/tree/master/code",
    "lastUpdate": "2021-01-27T16:11:01Z",
    "name": "PPGSynth",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FMED.2020.597774",
            "metadata": {
                "abstract": "© Copyright © 2020 Tang, Chen, Allen, Alian, Menon, Ward and Elgendi.Photoplethysmography (PPG) is increasingly used in digital health, exceptionally in smartwatches. The PPG signal contains valuable information about heart activity, and there is lots of research interest in its means and analysis for cardiovascular diseases. Unfortunately, to our knowledge, there is no arrhythmic PPG dataset publicly available—this paper attempt to provide a toolbox that can generate synthesized arrhythmic PPG signals. The model of a single PPG pulse in this toolbox utilizes two combined Gaussian functions. This toolbox supports synthesizing PPG waveform with regular heartbeats and three irregular heartbeats: compensation, interpolation, and reset. The user can generate a large amount of PPG data with a certain irregularity, with different sampling frequency, time length, and a range of noise types (Gaussian noise and multi-frequency noise) can be added to the synthesized PPG which can all be modified from the interface, and different types of arrhythmic PPGs (as calculated by the model) generated. The generation for large PPG datasets that simulate PPG collected from real humans could be used for testing the robustness of developed algorithms that are targeting arrhythmic PPG signals. Our PPG synthesis tool is publicly available.",
                "authors": [
                    {
                        "name": "Tang Q."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Allen J."
                    },
                    {
                        "name": "Alian A."
                    },
                    {
                        "name": "Menon C."
                    },
                    {
                        "name": "Ward R."
                    },
                    {
                        "name": "Elgendi M."
                    }
                ],
                "date": "2020-11-02T00:00:00Z",
                "journal": "Frontiers in Medicine",
                "title": "PPGSynth: An Innovative Toolbox for Synthesizing Regular and Irregular Photoplethysmography Waveforms"
            },
            "pmcid": "PMC7668389",
            "pmid": "33224967"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}