{
    "additionDate": "2019-11-14T19:35:13Z",
    "biotoolsCURIE": "biotools:ePath",
    "biotoolsID": "ePath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pxu@vcu.edu",
            "name": "Ping Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "An online database towards comprehensive essential gene annotation for prokaryotes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://www.pubapps.vcu.edu/epath/",
    "lastUpdate": "2020-12-25T14:43:51Z",
    "name": "ePath",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-49098-W",
            "metadata": {
                "abstract": "© 2019, The Author(s).Experimental techniques for identification of essential genes (EGs) in prokaryotes are usually expensive, time-consuming and sometimes unrealistic. Emerging in silico methods provide alternative methods for EG prediction, but often possess limitations including heavy computational requirements and lack of biological explanation. Here we propose a new computational algorithm for EG prediction in prokaryotes with an online database (ePath) for quick access to the EG prediction results of over 4,000 prokaryotes (https://www.pubapps.vcu.edu/epath/). In ePath, gene essentiality is linked to biological functions annotated by KEGG Ortholog (KO). Two new scoring systems, namely, E_score and P_score, are proposed for each KO as the EG evaluation criteria. E_score represents appearance and essentiality of a given KO in existing experimental results of gene essentiality, while P_score denotes gene essentiality based on the principle that a gene is essential if it plays a role in genetic information processing, cell envelope maintenance or energy production. The new EG prediction algorithm shows prediction accuracy ranging from 75% to 91% based on validation from five new experimental studies on EG identification. Our overall goal with ePath is to provide a comprehensive and reliable reference for gene essentiality annotation, facilitating the study of those prokaryotes without experimentally derived gene essentiality information.",
                "authors": [
                    {
                        "name": "Donghai H."
                    },
                    {
                        "name": "El-Rami F.E."
                    },
                    {
                        "name": "Ge X."
                    },
                    {
                        "name": "Kong X."
                    },
                    {
                        "name": "Stone V.N."
                    },
                    {
                        "name": "Xu P."
                    },
                    {
                        "name": "Zhu B."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "ePath: an online database towards comprehensive essential gene annotation for prokaryotes"
            },
            "pmcid": "PMC6737131",
            "pmid": "31506471"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
