{
    "accessibility": "Open access",
    "additionDate": "2021-11-06T16:27:58.224864Z",
    "biotoolsCURIE": "biotools:ml-sim",
    "biotoolsID": "ml-sim",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cfk23@cam.ac.uk",
            "name": "Clemens F. Kaminski",
            "typeEntity": "Person"
        },
        {
            "name": "Edward N. Ward"
        },
        {
            "name": "Meng Lu"
        },
        {
            "name": "Pietro Lio"
        },
        {
            "name": "Charles N. Christensen",
            "orcidid": "https://orcid.org/0000-0002-5355-1063"
        }
    ],
    "description": "Universal reconstruction of structured illumination microscopy images using transfer learning",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "http://ML-SIM.github.io",
    "language": [
        "JavaScript",
        "Other",
        "Python"
    ],
    "lastUpdate": "2021-11-06T16:32:58.487345Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/charlesnchr/ML-SIM"
        }
    ],
    "name": "ML-SIM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1364/BOE.414680",
            "metadata": {
                "abstract": "© 2021 OSA - The Optical Society. All rights reserved.Structured illumination microscopy (SIM) has become an important technique for optical super-resolution imaging because it allows a doubling of image resolution at speeds compatible with live-cell imaging. However, the reconstruction of SIM images is often slow, prone to artefacts, and requires multiple parameter adjustments to reflect different hardware or experimental conditions. Here, we introduce a versatile reconstruction method, ML-SIM, which makes use of transfer learning to obtain a parameter-free model that generalises beyond the task of reconstructing data recorded by a specific imaging system for a specific sample type. We demonstrate the generality of the model and the high quality of the obtained reconstructions by application of ML-SIM on raw data obtained for multiple sample types acquired on distinct SIM microscopes. ML-SIM is an end-to-end deep residual neural network that is trained on an auxiliary domain consisting of simulated images, but is transferable to the target task of reconstructing experimental SIM images. By generating the training data to reflect challenging imaging conditions encountered in real systems, ML-SIM becomes robust to noise and irregularities in the illumination patterns of the raw SIM input frames. Since ML-SIM does not require the acquisition of experimental training data, the method can be efficiently adapted to any specific experimental SIM implementation. We compare the reconstruction quality enabled by ML-SIM with current state-of-the-art SIM reconstruction methods and demonstrate advantages in terms of generality and robustness to noise for both simulated and experimental inputs, thus making ML-SIM a useful alternative to traditional methods for challenging imaging conditions. Additionally, reconstruction of a SIM stack is accomplished in less than 200 ms on a modern graphics processing unit, enabling future applications for real-time imaging.",
                "authors": [
                    {
                        "name": "CHRISTENSEN C.N."
                    },
                    {
                        "name": "KAMINSKI C.F."
                    },
                    {
                        "name": "LIO P."
                    },
                    {
                        "name": "LU M."
                    },
                    {
                        "name": "WARD E.N."
                    }
                ],
                "citationCount": 2,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Biomedical Optics Express",
                "title": "ML-SIM: Universal reconstruction of structured illumination microscopy images using transfer learning"
            },
            "pmcid": "PMC8176814",
            "pmid": "34123499"
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
