{
    "additionDate": "2021-01-18T11:58:03Z",
    "biotoolsCURIE": "biotools:mdmapr",
    "biotoolsID": "mdmapr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ryoung04@uoguelph.ca",
            "name": "Robert G. Young",
            "typeEntity": "Person"
        }
    ],
    "description": "Molecular Detection Mapping and Analysis Platform for R (MDMAPR) facilitating the standardization, analysis, visualization, and sharing of qPCR data and metadata.\n\nThe Molecular Detection Mapping and Analysis Platform for R (MDMAPR) is an open-source bioinformatics tool for researchers to merge raw qPCR fluorescence data with associated metadata into a standard format and geospatially visualizing the distribution of the data and relative intensity of the qPCR results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://hannerlab.shinyapps.io/MDMAPR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-20T17:41:24Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/HannerLab/MDMAPR"
        }
    ],
    "name": "MDMAPR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.7717/PEERJ.9974",
            "metadata": {
                "abstract": "© Copyright 2020 Yu et al.Quantitative polymerase chain reaction (qPCR) has been used as a standard molecular detection tool in many scientific fields. Unfortunately, there is no standard method for managing published qPCR data, and those currently used generally focus on only managing raw fluorescence data. However, associated with qPCR experiments are extensive sample and assay metadata, often under-examined and under-reported. Here, we present the Molecular Detection Mapping and Analysis Platform for R (MDMAPR), an open-source and fully scalable informatics tool for researchers to merge raw qPCR fluorescence data with associated metadata into a standard format, while geospatially visualizing the distribution of the data and relative intensity of the qPCR results. The advance of this approach is in the ability to use MDMAPR to store varied qPCR data. This includes pathogen and environmental qPCR species detection studies ideally suited to geographical visualization. However, it also goes beyond these and can be utilized with other qPCR data including gene expression studies, quantification studies used in identifying health dangers associated with food and water bacteria, and the identification of unknown samples. In addition, MDMAPR's novel centralized management and geospatial visualization of qPCR data can further enable cross-discipline large-scale qPCR data standardization and accessibility to support research spanning multiple fields of science and qPCR applications.",
                "authors": [
                    {
                        "name": "Deeth L.E."
                    },
                    {
                        "name": "Hanner R.H."
                    },
                    {
                        "name": "Young R.G."
                    },
                    {
                        "name": "Yu J."
                    }
                ],
                "date": "2020-10-23T00:00:00Z",
                "journal": "PeerJ",
                "title": "Molecular detection mapping and analysis platform for R (MDMAPR) facilitating the standardization, analysis, visualization, and sharing of qPCR data and metadata"
            },
            "pmcid": "PMC7587055",
            "pmid": "33150057"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
