{
    "additionDate": "2017-02-10T14:14:57Z",
    "biotoolsCURIE": "biotools:gc-profile",
    "biotoolsID": "gc-profile",
    "credit": [
        {
            "email": "ctzhang@tju.edu.cn",
            "name": "C.T. Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GC-Profile is a web-based tool for visualizing and analyzing the variation of GC content in genomic sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "http://tubic.tju.edu.cn/GC-Profile/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://tubic.tju.edu.cn/GC-Profile/",
    "homepage_status": 1,
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "GC-Profile",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A new measure, to quantify the difference between two probability distributions, called the quadratic divergence, has been proposed. Based on the quadratic divergence, a new segmentation algorithm to partition a given genome or DNA sequence into compositionally distinct domains is put forward. The new algorithm has been applied to segment the 24 human chromosome sequences, and the boundaries of isochores for each chromosome were obtained. Compared with the results obtained by using the entropic segmentation algorithm based on the Jensen-Shannon divergence, both algorithms resulted in all identical coordinates of segmentation points. An explanation of the equivalence of the two segmentation algorithms is presented. The new algorithm has a number of advantages. Particularly, it is much simpler and faster than the entropy-based method. Therefore, the new algorithm is more suitable for analyzing long genome sequences, such as human and other newly sequenced eukaryotic genome sequences. © 2005 The American Physical Society.",
                "authors": [
                    {
                        "name": "Zhang C.-T."
                    },
                    {
                        "name": "Gao F."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "citationCount": 20,
                "date": "2005-10-01T00:00:00Z",
                "journal": "Physical Review E - Statistical, Nonlinear, and Soft Matter Physics",
                "title": "Segmentation algorithm for DNA sequences"
            },
            "pmid": "16383430"
        },
        {
            "metadata": {
                "abstract": "In order to understand the evolution, structure and function of genomes, it is important to know the general compositional features ofDNAsequences. Based on the quadratic divergence, a new segmentation algorithm to partition a given genome or DNA sequence into compositionally distinct domains has been put forward. With the aid of the technique of cumulative GC profile, the distribution of segmentation points can be displayed intuitively. We have therefore developed them into GC-Profile, an interactive web-ba{ed software system, which can be used to segment prokaryotic and eukaryotic genomes. GC-Profile provides a quantitative and qualitative view of genome organization. Based on the obtained results, the relationships between the G+C content and other genomic features, such as distributions of genes and CpG islands, can be analyzed in a perceivable manner. It shows that GC-Profile would be an appropriate starting point for analyzing the isochore structure of higher eukaryotic genomes, and an intuitive tool for identifying genomic islands in prokaryotic genomes. GC-Profile is freely available at the website http://tubic.tju.edu.cn/GC-Profile/. In addition, precompiled binaries, together with examples and documentation, can also be freely downloaded for a local execution. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Gao F."
                    },
                    {
                        "name": "Zhang C.-T."
                    }
                ],
                "citationCount": 94,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GC-Profile: A web-based tool for visualizing and analyzing the variation of GC content in genomic sequences"
            },
            "pmid": "16845098"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}