{
    "accessibility": "Open access",
    "additionDate": "2024-05-06T11:36:31.549546Z",
    "biotoolsCURIE": "biotools:ccml",
    "biotoolsID": "ccml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "asa.wheelock@ki.se",
            "name": "Åsa M Wheelock",
            "orcidid": "https://orcid.org/0000-0002-8013-2745",
            "typeEntity": "Person"
        },
        {
            "email": "zhoumeng@wmu.edu.cn",
            "name": "Meng Zhou",
            "orcidid": "https://orcid.org/0000-0001-9987-9024",
            "typeEntity": "Person"
        }
    ],
    "description": "Consensus clustering tool for multi-omics integrative prediction in cohorts with unequal sample coverage.\nConsensus clustering, also called meta-clustering or cluster ensembles, has been increasingly used in clinical data. Current consensus clustering methods tend to ensemble a number of different clusters from mathematical replicates with similar sample coverage. As the fact of common variety of sample coverage in the real-world data, a new consensus clustering strategy dealing with such biological replicates is required. This is a two-step consensus clustering package, which is used to input multiple predictive labels with different sample coverage (missing labels).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=ccml",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:01:21.815263Z",
    "license": "GPL-2.0",
    "name": "ccml",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbad501",
            "metadata": {
                "abstract": "Multi-omics data integration is a complex and challenging task in biomedical research. Consensus clustering, also known as meta-clustering or cluster ensembles, has become an increasingly popular downstream tool for phenotyping and endotyping using multiple omics and clinical data. However, current consensus clustering methods typically rely on ensembling clustering outputs with similar sample coverages (mathematical replicates), which may not reflect real-world data with varying sample coverages (biological replicates). To address this issue, we propose a new consensus clustering with missing labels (ccml) strategy termed ccml, an R protocol for two-step consensus clustering that can handle unequal missing labels (i.e. multiple predictive labels with different sample coverages). Initially, the regular consensus weights are adjusted (normalized) by sample coverage, then a regular consensus clustering is performed to predict the optimal final cluster. We applied the ccml method to predict molecularly distinct groups based on 9-omics integration in the Karolinska COSMIC cohort, which investigates chronic obstructive pulmonary disease, and 24-omics handprint integrative subgrouping of adult asthma patients of the U-BIOPRED cohort. We propose ccml as a downstream toolkit for multi-omics integration analysis algorithms such as Similarity Network Fusion and robust clustering of clinical data to overcome the limitations posed by missing data, which is inevitable in human cohorts consisting of multiple data modalities. The ccml tool is available in the R language (https://CRAN.R-project.org/package=ccml, https://github.com/pulmonomics-lab/ccml, or https://github.com/ZhoulabCPH/ccml).",
                "authors": [
                    {
                        "name": "Adcock I.M."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Li C.-X."
                    },
                    {
                        "name": "Skold C.M."
                    },
                    {
                        "name": "Wheelock A.M."
                    },
                    {
                        "name": "Zhou M."
                    },
                    {
                        "name": "Zounemat-Kermani N."
                    }
                ],
                "citationCount": 1,
                "date": "2024-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Consensus clustering with missing labels (ccml): a consensus clustering tool for multi-omics integrative prediction in cohorts with unequal sample coverage"
            },
            "pmcid": "PMC10782800",
            "pmid": "38205966"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}
