{
    "name": "msCentipede", 
    "description": "Algorithm for accurately inferring transcription factor binding sites using chromatin accessibility data.", 
    "homepage": "https://github.com/rajanil/msCentipede", 
    "biotoolsID": "mscentipede", 
    "biotoolsCURIE": "biotools:mscentipede", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0445", 
                    "term": "Transcription factor binding site prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0749", 
            "term": "Transcription factors and regulatory sites"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": "MIT", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/rajanil/msCentipede/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0138030", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Mscentipede: Modeling heterogeneity across genomic sites and replicates improves accuracy in the inference of transcription factor binding", 
                "abstract": "© 2015 Raj et al. Understanding global gene regulation depends critically on accurate annotation of regulatory elements that are functional in a given cell type. CENTIPEDE, a powerful, probabilistic framework for identifying transcription factor binding sites from tissue-specific DNase I cleavage patterns and genomic sequence content, leverages the hypersensitivity of factorbound chromatin and the information in the DNase I spatial cleavage profile characteristic of each DNA binding protein to accurately infer functional factor binding sites. However, the model for the spatial profile in this framework fails to account for the substantial variation in the DNase I cleavage profiles across different binding sites. Neither does it account for variation in the profiles at the same binding site across multiple replicate DNase I experiments, which are increasingly available. In this work, we introduce new methods, based on multiscale models for inhomogeneous Poisson processes, to account for such variation in DNase I cleavage patterns both within and across binding sites. These models account for the spatial structure in the heterogeneity in DNase I cleavage patterns for each factor. Using DNase-seq measurements assayed in a lymphoblastoid cell line, we demonstrate the improved performance of this model for several transcription factors by comparing against the Chip-seq peaks for those factors. Finally, we explore the effects of DNase I sequence bias on inference of factor binding using a simple extension to our framework that allows for a more flexible background model. The proposed model can also be easily applied to paired-end ATAC-seq and DNase-seq data. msCentipede, a Python implementation of our algorithm, is available at http://rajanil.github.io/msCentipede.", 
                "date": "2015-09-25T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Raj A."
                    }, 
                    {
                        "name": "Shim H."
                    }, 
                    {
                        "name": "Gilad Y."
                    }, 
                    {
                        "name": "Pritchard J.K."
                    }, 
                    {
                        "name": "Stephens M."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "mstephens@uchicago.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2017-08-20T16:23:24Z", 
    "lastUpdate": "2019-09-04T08:38:18Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}