{
    "additionDate": "2018-05-22T21:32:58Z",
    "biotoolsCURIE": "biotools:t-bas",
    "biotoolsID": "t-bas",
    "credit": [
        {
            "email": "icarbon@ncsu.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tree-Based Alignment Selector toolkit for phylogenetic-based placement, alignment downloads and metadata visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "https://vclv99-239.hpc.ncsu.edu:8080/start",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "T-BAS",
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTW808",
            "metadata": {
                "abstract": "© 2016 The Author. Published by Oxford University Press. All rights reserved.Motivation: High-quality phylogenetic placement of sequence data has the potential to greatly accelerate studies of the diversity, systematics, ecology and functional biology of diverse groups. We developed the Tree-Based Alignment Selector (T-BAS) toolkit to allow evolutionary placement and visualization of diverse DNA sequences representing unknown taxa within a robust phylogenetic context, and to permit the downloading of highly curated, single- and multi-locus alignments for specific clades. Results: In its initial form, T-BAS v1.0 uses a core phylogeny of 979 taxa (including 23 outgroup taxa, as well as 61 orders, 175 families and 496 genera) representing all 13 classes of largest subphylum of Fungi - Pezizomycotina (Ascomycota) - based on sequence alignments for six loci (nr5.8S, nrLSU, nrSSU, mtSSU, RPB1, RPB2). T-BAS v1.0 has three main uses: (i) Users may download alignments and voucher tables for members of the Pezizomycotina directly from the reference tree, facilitating systematics studies of focal clades. (ii) Users may upload sequence files with reads representing unknown taxa and place these on the phylogeny using either BLAST or phylogeny-based approaches, and then use the displayed tree to select reference taxa to include when downloading alignments. The placement of unknowns can be performed for large numbers of Sanger sequences obtained from fungal cultures and for alignable, short reads of environmental amplicons. (iii) User-customizable metadata can be visualized on the tree.",
                "authors": [
                    {
                        "name": "Carbone I."
                    },
                    {
                        "name": "White J.B."
                    },
                    {
                        "name": "Miadlikowska J."
                    },
                    {
                        "name": "Arnold A.E."
                    },
                    {
                        "name": "Miller M.A."
                    },
                    {
                        "name": "Kauff F."
                    },
                    {
                        "name": "U'Ren J.M."
                    },
                    {
                        "name": "May G."
                    },
                    {
                        "name": "Lutzoni F."
                    }
                ],
                "citationCount": 30,
                "date": "2017-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "T-BAS: Tree-Based Alignment Selector toolkit for phylogenetic-based placement, alignment downloads and metadata visualization: An example with the Pezizomycotina tree of life"
            },
            "pmid": "28003260"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}