
{
    "credit": [
        {
            "email": "tin@wayne.edu",
            "name": "Tin Nguyen",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/manuals/BLMA/man/BLMA.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor.org/packages/release/bioc/vignettes/BLMA/inst/doc/BLMA.pdf"
        },
        {
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/BLMA_1.4.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library",
            "Suite"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://git.bioconductor.org/packages/BLMA"
        },
        {
            "type": "MIRROR",
            "url": "http://bioconductor.org/packages/BLMA/"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: The accumulation of high-throughput data in public repositories creates a pressing need for integrative analysis of multiple datasets from independent experiments. However, study heterogeneity, study bias, outliers and the lack of power of available methods present real challenge in integrating genomic data. One practical drawback of many P-value-based meta-analysis methods, including Fisher's, Stouffer's, minP and maxP, is that they are sensitive to outliers. Another drawback is that, because they perform just one statistical test for each individual experiment, they may not fully exploit the potentially large number of samples within each study. Results: We propose a novel bi-level meta-analysis approach that employs the additive method and the Central Limit Theorem within each individual experiment and also across multiple experiments. We prove that the bi-level framework is robust against bias, less sensitive to outliers than other methods, and more sensitive to small changes in signal. For comparative analysis, we demonstrate that the intra-experiment analysis has more power than the equivalent statistical test performed on a single large experiment. For pathway analysis, we compare the proposed framework versus classical meta-analysis approaches (Fisher's, Stouffer's and the additive method) as well as against a dedicated pathway meta-analysis package (MetaPath), using 1252 samples from 21 datasets related to three human diseases, acute myeloid leukemia (9 datasets), type II diabetes (5 datasets) and Alzheimer's disease (7 datasets). Our framework outperforms its competitors to correctly identify pathways relevant to the phenotypes. The framework is sufficiently general to be applied to any type of statistical meta-analysis.",
            "authors": [
                "Nguyen T.",
                "Tagett R.",
                "Donato M.",
                "Mitrea C.",
                "Draghici S."
            ],
            "cit_count": 6,
            "doi": "10.1093/bioinformatics/btv588",
            "journal": "Bioinformatics",
            "title": "A novel bi-level meta-analysis approach: Applied to biological pathway analysis",
            "type": "Primary",
            "year": "2015-04-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:blma",
        "biotoolsID": "blma",
        "description": "Suit of tools for bi-level meta-analysis. The package can be used in a wide range of applications, including general hypothesis testings, differential expression analysis, functional analysis, and pathway analysis.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/BLMA.html",
        "name": "BLMA",
        "version": [
            "1.4.0"
        ]
    }
}