{
    "additionDate": "2021-01-18T09:00:19Z",
    "biotoolsCURIE": "biotools:macsnvdb",
    "biotoolsID": "macsnvdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jing Li",
            "typeEntity": "Person"
        },
        {
            "email": "zxfan@scu.edu.cn",
            "name": "Zhenxin Fan",
            "typeEntity": "Person"
        }
    ],
    "description": "A high-quality SNV database for interspecies genetic divergence investigation among macaques.\n\nA database for genetic divergence investigation among macaques.\n\nMACSNVdb is an open-access SNV database comprising ~74.51 million high-quality non-redundant SNVs called from 20 macaques that may assist researchers to investigate interspecies genetic divergence between macaques.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "http://big.cdu.edu.cn/macsnvdb/",
    "lastUpdate": "2021-02-19T08:30:00Z",
    "name": "MACSNVdb",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA027",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Macaques are the most widely used non-human primates in biomedical research. The genetic divergence between these animal models is responsible for their phenotypic differences in response to certain diseases. However, the macaque single nucleotide polymorphism resources mainly focused on rhesus macaque (Macaca mulatta), which hinders the broad research and biomedical application of other macaques. In order to overcome these limitations, we constructed a database named MACSNVdb that focuses on the interspecies genetic diversity among macaque genomes. MACSNVdb is a web-enabled database comprising ~74.51 million high-quality non-redundant single nucleotide variants (SNVs) identified among 20 macaque individuals from six species groups (muttla, fascicularis, sinica, arctoides, silenus, sylvanus). In addition to individual SNVs, MACSNVdb also allows users to browse and retrieve groups of user-defined SNVs. In particular, users can retrieve non-synonymous SNVs that may have deleterious effects on protein structure or function within macaque orthologs of human disease and drug-target genes. Besides position, alleles and flanking sequences, MACSNVdb integrated additional genomic information including SNV annotations and gene functional annotations. MACSNVdb will facilitate biomedical researchers to discover molecular mechanisms of diverse responses to diseases as well as primatologist to perform population genetic studies. We will continue updating MACSNVdb with newly available sequencing data and annotation to keep the resource up to date. Database URL: http://big.cdu.edu.cn/macsnvdb/.",
                "authors": [
                    {
                        "name": "Du L."
                    },
                    {
                        "name": "Guo T."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Xing J."
                    },
                    {
                        "name": "Yue B."
                    },
                    {
                        "name": "Fan Z."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "MACSNVdb: A high-quality SNV database for interspecies genetic divergence investigation among macaques"
            },
            "pmcid": "PMC7198316",
            "pmid": "32367112"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        }
    ]
}