{
    "additionDate": "2021-11-01T10:35:09.355559Z",
    "biotoolsCURIE": "biotools:papolarity",
    "biotoolsID": "papolarity",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sergey.dmitriev@belozersky.msu.ru",
            "name": "Sergey E. Dmitriev",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Papolarity is a Python package for analysis of transcript-level short read coverage profiles. For a single sample, for each transcript papolarity allows for computing the classic polarity metric which, in the case of Ribo-Seq, reflects ribosome positional preferences. For comparison versus a control sample, papolarity estimates an improved metric, the relative linear regression slope of coverage along transcript length. This involves de-noising by profile segmentation with a Poisson model (using pasio), and aggregation of Ribo-Seq coverage within segments, thus achieving reliable estimates of the regression slope.",
    "editPermission": {
        "authors": [
            "ivan.kulakovskiy"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/autosome-ru/papolarity",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T15:37:23.405174Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/autosome-ru/papolarity/issues"
        }
    ],
    "name": "Papolarity",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-1150-0_13",
            "metadata": {
                "abstract": "During translation, the rate of ribosome movement along mRNA varies. This leads to a non-uniform ribosome distribution along the transcript, depending on local mRNA sequence, structure, tRNA availability, and translation factor abundance, as well as the relationship between the overall rates of initiation, elongation, and termination. Stress, antibiotics, and genetic perturbations affecting composition and properties of translation machinery can alter the ribosome positional distribution dramatically. Here, we offer a computational protocol for analyzing positional distribution profiles using ribosome profiling (Ribo-Seq) data. The protocol uses papolarity, a new Python toolkit for the analysis of transcript-level short read coverage profiles. For a single sample, for each transcript papolarity allows for computing the classic polarity metric which, in the case of Ribo-Seq, reflects ribosome positional preferences. For comparison versus a control sample, papolarity estimates an improved metric, the relative linear regression slope of coverage along transcript length. This involves de-noising by profile segmentation with a Poisson model and aggregation of Ribo-Seq coverage within segments, thus achieving reliable estimates of the regression slope. The papolarity software and the associated protocol can be conveniently used for Ribo-Seq data analysis in the command-line Linux environment. Papolarity package is available through Python pip package manager. The source code is available at https://github.com/autosome-ru/papolarity.",
                "authors": [
                    {
                        "name": "Anisimova A.S."
                    },
                    {
                        "name": "Dmitriev S.E."
                    },
                    {
                        "name": "Egorov A.A."
                    },
                    {
                        "name": "Eliseeva I.A."
                    },
                    {
                        "name": "Gladyshev V.N."
                    },
                    {
                        "name": "Kulakovskiy I.V."
                    },
                    {
                        "name": "Makeev V.J."
                    },
                    {
                        "name": "Vorontsov I.E."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Assessing Ribosome Distribution Along Transcripts with Polarity Scores and Regression Slope Estimates"
            },
            "pmid": "33765281",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
