{
    "additionDate": "2023-01-25T14:41:28.047137Z",
    "biotoolsCURIE": "biotools:bestdeg",
    "biotoolsID": "bestdeg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "unitsa.s@psu.ac.th",
            "name": "Unitsa Sangket",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based application automatically combines various tools to precisely predict differentially expressed genes (DEGs) from RNA-Seq data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://unitsa.shinyapps.io/bestDEG",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2023-01-25T14:41:28.049477Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/unitsa-sangket/bestDEG"
        }
    ],
    "name": "bestDEG",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7717/PEERJ.14344",
            "metadata": {
                "abstract": "Copyright © 2022 Sangket et al.Background. Differential gene expression analysis using RNA sequencing technology (RNA-Seq) has become the most popular technique in transcriptome research. Although many R packages have been developed to analyze differentially expressed genes (DEGs), several evaluations have shown that no single DEG analysis method outperforms all others. The validity of DEG identification could be increased by using multiple methods and producing the consensus results. However, DEG analysis methods are complex and most of them require prior knowledge of a programming language or command-line shell. Users who do not have this knowledge need to invest time and effort to acquire it. Methods. We developed a novel web application called ''bestDEG'' to automatically analyze DEGs with different tools and compare the results. A differential expression (DE) analysis pipeline was created combining the edgeR, DESeq2, NOISeq, and EBSeq packages; selected because they use different statistical methods to identify DEGs. bestDEG was evaluated on human datasets from the MicroArray Quality Control (MAQC) project. Results. The performance of the bestDEG web application with the human datasets showed excellent results, and the consensus method outperformed the other DE analysis methods in terms of precision (94.71%) and specificity (97.01%). bestDEG is a rapid and efficient tool to analyze DEGs. With bestDEG, users can select DE analysis methods and parameters in the user-friendly web interface. bestDEG also provides a Venn diagram and a table of results. Moreover, the consensus method of this tool can maximize the precision or minimize the false discovery rate (FDR), which reduces the cost of gene expression validation by minimizing wet-lab experiments.",
                "authors": [
                    {
                        "name": "Nuanpirom J."
                    },
                    {
                        "name": "Sangket U."
                    },
                    {
                        "name": "Sathapondecha P."
                    },
                    {
                        "name": "Yodsawat P."
                    }
                ],
                "date": "2022-11-10T00:00:00Z",
                "journal": "PeerJ",
                "title": "bestDEG: a web-based application automatically combines various tools to precisely predict differentially expressed genes (DEGs) from RNA-Seq data"
            },
            "pmcid": "PMC9657178",
            "pmid": "36389403"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
