{
    "additionDate": "2019-11-14T19:27:45Z",
    "biotoolsCURIE": "biotools:SalMotifDB",
    "biotoolsID": "SalMotifDB",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "torgeir.r.hvidsten@nmbu.no",
            "name": "Torgeir R. Hvidsten",
            "orcidid": "https://orcid.org/0000-0001-6097-2539",
            "typeEntity": "Person"
        }
    ],
    "description": "a tool for analyzing putative transcription factor binding sites in salmonid genomes | SalMotifDB: cis-regulatory motif database for salmonids | We're getting there, it's worth the wait",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "https://salmobase.org/apps/SalMotifDB/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T19:27:45Z",
    "name": "SalMotifDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6051-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recently developed genome resources in Salmonid fish provides tools for studying the genomics underlying a wide range of properties including life history trait variation in the wild, economically important traits in aquaculture and the evolutionary consequences of whole genome duplications. Although genome assemblies now exist for a number of salmonid species, the lack of regulatory annotations are holding back our mechanistic understanding of how genetic variation in non-coding regulatory regions affect gene expression and the downstream phenotypic effects. Results: We present SalMotifDB, a database and associated web and R interface for the analysis of transcription factors (TFs) and their cis-regulatory binding sites in five salmonid genomes. SalMotifDB integrates TF-binding site information for 3072 non-redundant DNA patterns (motifs) assembled from a large number of metazoan motif databases. Through motif matching and TF prediction, we have used these multi-species databases to construct putative regulatory networks in salmonid species. The utility of SalMotifDB is demonstrated by showing that key lipid metabolism regulators are predicted to regulate a set of genes affected by different lipid and fatty acid content in the feed, and by showing that our motif database explains a significant proportion of gene expression divergence in gene duplicates originating from the salmonid specific whole genome duplication. Conclusions: SalMotifDB is an effective tool for analyzing transcription factors, their binding sites and the resulting gene regulatory networks in salmonid species, and will be an important tool for gaining a better mechanistic understanding of gene regulation and the associated phenotypes in salmonids. SalMotifDB is available at https://salmobase.org/apps/SalMotifDB.",
                "authors": [
                    {
                        "name": "Mulugeta T.D."
                    },
                    {
                        "name": "Nome T."
                    },
                    {
                        "name": "To T.-H."
                    },
                    {
                        "name": "Gundappa M.K."
                    },
                    {
                        "name": "MacQueen D.J."
                    },
                    {
                        "name": "Vage D.I."
                    },
                    {
                        "name": "Sandve S.Ro."
                    },
                    {
                        "name": "Hvidsten T.R."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-02T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "SalMotifDB: A tool for analyzing putative transcription factor binding sites in salmonid genomes"
            },
            "pmcid": "PMC6720087",
            "pmid": "31477007"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ]
}