{"credit":[{"email":"suyash+mstruct@cs.cmu.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.sailing.cs.cmu.edu/main/?page_id=400"}],"documentation":[{"type":"GENERAL","url":"http://www.sailing.cs.cmu.edu/main/?page_id=399"}],"function":[{"operation":[{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mstruct-population-genetic-analysis-microsatellite-data.html"}],"publication":[{"abstract":"Traditional methods for analyzing population structure, such as the Structure program, ignore the influence of the effect of allele mutations between the ancestral and current alleles of genetic markers, which can dramatically influence the accuracy of the structural estimation of current populations. Studying these effects can also reveal additional information about population evolution such as the divergence time and migration history of admixed populations. We propose mStruct, an admixture of population-specific mixtures of inheritance models that addresses the task of structure inference and mutation estimation jointly through a hierarchical Bayesian framework, and a variational algorithm for inference. We validated our method on synthetic data and used it to analyze the Human Genome Diversity Project-Centre d'Etude du Polymorphisme Humain (HGDP-CEPH) cell line panel of microsatellites and HGDP single-nucleotide polymorphism (SNP) data. A comparison of the structural maps of world populations estimated by mStruct and Structure is presented, and we also report potentially interesting mutation patterns in world populations estimated by mStruct. Copyright © 2009 by the Genetics Society of America.","authors":["Shringarpure S.","Xing E.P."],"cit_count":15,"journal":"Genetics","pmid":"19363128","title":"mStruct: Inference of population structure in light of both genetic admixing and allele mutations","year":"2009-06-01"}],"summary":{"biotoolsCURIE":"biotools:mstruct","biotoolsID":"mstruct","description":"Software for detection of population structure in the presence of admixing and mutations from multi-locus genotype data. It is a mixed membership model (also referred to as an admixture model) which incorporates a mutation process on the observed genetic markers.","homepage":"http://www.sailing.cs.cmu.edu/main/?page_id=399","name":"mStruct"}}