{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-01T12:11:54.616225Z",
    "biotoolsCURIE": "biotools:enngene",
    "biotoolsID": "enngene",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "panagiotis.alexiou@ceitec.muni.cz",
            "name": "Panagiotis Alexiou",
            "orcidid": "https://orcid.org/0000-0003-3437-7482",
            "typeEntity": "Person"
        },
        {
            "name": "Eliška Chalupová"
        }
    ],
    "description": "ENNGene is an application that simplifies the local training of custom Convolutional Neural Network models on Genomic data via an easy to use Graphical User Interface.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ML-Bioinfo-CEITEC/ENNGene",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:51:06.113462Z",
    "license": "AGPL-3.0",
    "name": "ENNGene",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12864-022-08414-x",
            "metadata": {
                "abstract": "Background: The recent big data revolution in Genomics, coupled with the emergence of Deep Learning as a set of powerful machine learning methods, has shifted the standard practices of machine learning for Genomics. Even though Deep Learning methods such as Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNNs) are becoming widespread in Genomics, developing and training such models is outside the ability of most researchers in the field. Results: Here we present ENNGene—Easy Neural Network model building tool for Genomics. This tool simplifies training of custom CNN or hybrid CNN-RNN models on genomic data via an easy-to-use Graphical User Interface. ENNGene allows multiple input branches, including sequence, evolutionary conservation, and secondary structure, and performs all the necessary preprocessing steps, allowing simple input such as genomic coordinates. The network architecture is selected and fully customized by the user, from the number and types of the layers to each layer's precise set-up. ENNGene then deals with all steps of training and evaluation of the model, exporting valuable metrics such as multi-class ROC and precision-recall curve plots or TensorBoard log files. To facilitate interpretation of the predicted results, we deploy Integrated Gradients, providing the user with a graphical representation of an attribution level of each input position. To showcase the usage of ENNGene, we train multiple models on the RBP24 dataset, quickly reaching the state of the art while improving the performance on more than half of the proteins by including the evolutionary conservation score and tuning the network per protein. Conclusions: As the role of DL in big data analysis in the near future is indisputable, it is important to make it available for a broader range of researchers. We believe that an easy-to-use tool such as ENNGene can allow Genomics researchers without a background in Computational Sciences to harness the power of DL to gain better insights into and extract important information from the large amounts of data available in the field.",
                "authors": [
                    {
                        "name": "Alexiou P."
                    },
                    {
                        "name": "Chalupova E."
                    },
                    {
                        "name": "Jozefov F."
                    },
                    {
                        "name": "Majtner T."
                    },
                    {
                        "name": "Polacek J."
                    },
                    {
                        "name": "Vaculik O."
                    }
                ],
                "citationCount": 6,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ENNGene: an Easy Neural Network model building tool for Genomics"
            },
            "pmcid": "PMC8973509",
            "pmid": "35361122"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
