{
    "additionDate": "2020-01-24T09:34:31Z",
    "biotoolsCURIE": "biotools:SEPAS",
    "biotoolsID": "SEPAS",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "hhadi@iasbs.ac.ir",
            "name": "Hamid Hadi-Alijanvand",
            "note": "Assistant Professor at\nDepartment of Biological Sciences, Institute for Advanced Studies in Basic Sciences (IASBS), Zankan, Iran.",
            "orcidid": "http://orcid.org/0000-0001-8289-2214",
            "typeEntity": "Person",
            "url": "https://iasbs.ac.ir/personalpage?id=555559&staff=0"
        }
    ],
    "description": "Now to predict the experimentally measured affinity between protein monomers in solution, we just need the 3D structure of the suggested PBP on one subunit of the proposed dimer.",
    "documentation": [
        {
            "type": "Other",
            "url": "http://biophysics.ir/affinity"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "http://biophysics.ir/affinity"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein atom",
                        "uri": "http://edamontology.org/data_1755"
                    },
                    "format": [
                        {
                            "term": "PDB database entry format",
                            "uri": "http://edamontology.org/format_1475"
                        }
                    ]
                }
            ],
            "note": "After preparation of input file (it introduces the 3D file of monomer and the residue IDs of protein binding patch to SEPAS) just run the code in linux terminal.",
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Text data",
                        "uri": "http://edamontology.org/data_2526"
                    }
                }
            ]
        }
    ],
    "homepage": "http://biophysics.ir/affinity",
    "language": [
        "Other"
    ],
    "lastUpdate": "2020-01-24T09:38:31Z",
    "link": [
        {
            "note": "It guides you the software description and link page",
            "type": "Software catalogue",
            "url": "http://biophysics.ir/affinity"
        }
    ],
    "name": "SEPAS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "h2a",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.9b00594",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Knowledge about the structure and stability of protein-protein interactions is vital to decipher the behavior of protein systems. Prediction of protein complexes' stability is an interesting topic in the field of structural biology. There are some promising published computational approaches that predict the affinity between subunits of protein dimers using 3D structures of both subunits. In the current study, we classify protein complexes with experimentally measured affinities into distinct classes with different mean affinities. By predicting the mechanical stiffness of the protein binding patch (PBP) region on a single subunit, we successfully predict the assigned affinity class of the PBP in the classification step. Now to predict the experimentally measured affinity between protein monomers in solution, we just need the 3D structure of the suggested PBP on one subunit of the proposed dimer. We designed the SEPAS software and have made the software freely available for academic non-commercial research purposes at \"http://biophysics.ir/affinity\". SEPAS predicts the stability of the intended dimer in a classwise manner by utilizing the computed mechanical stiffness of the introduced binding site on one subunit with the minimum accuracy of 0.72.",
                "authors": [
                    {
                        "name": "Hadi-Alijanvand H."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Complex Stability is Encoded in Binding Patch Softness: A Monomer-Based Approach to Predict Inter-Subunit Affinity of Protein Dimers"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1080/07391102.2019.1662328",
            "metadata": {
                "abstract": "© 2019, © 2019 Informa UK Limited, trading as Taylor & Francis Group.By having knowledge about the characteristics of protein interaction interfaces, we will be able to manipulate protein complexes for therapies. Dimer state is considered as the primary alphabet of the most proteins’ quaternary structure. The properties of binding interface between subunits and of noninterface region define the specificity and stability of the intended protein complex. Considering some topological properties and amino acids’ affinity for binding in interfaces of protein dimers, we construct the interface-specific recurrence plots. The data obtained from recurrence quantitative analysis, and accessibility-related metrics help us to classify the protein dimers into four distinct classes. Some mechanical properties of binding interfaces are computed for each predefined class of the dimers. The computed mechanical characteristics of binding patch region are compared with those of nonbinding region of proteins. Our observations indicate that the mechanical properties of protein binding sites have a decisive impact on determining the dimer stability. We introduce a new concept in analyzing protein structure by considering mechanical properties of protein structure. We conclude that the interface region between subunits of stable dimers is usually mechanically softer than the interface of unstable protein dimers. AbbreviationsAAB average affinity for bindingANM anisotropic network modelAPC affinity propagation clusteringASA accessible surface areaCCD inter residues distanceCSC complex stability codeDM distance matrixΔGdiss PISA-computed dissociation free energyGNM Gaussian normal mode analysisNMA normal mode analysisPBP protein binding patchPISA proteins, interfaces, structures and assembliesrASA relative accessible area in respect to unfolded state of residuesRM recurrence matrixrP relative protrusionRP recurrence plotRQA recurrence quantitative analysisSEM standard error of mean Communicated by Ramaswamy H. Sarma.",
                "authors": [
                    {
                        "name": "Hadi-Alijanvand H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Biomolecular Structure and Dynamics",
                "title": "Soft regions of protein surface are potent for stable dimer formation"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "version": [
        "SEPAS_V1, Dec 2019"
    ]
}