{
    "additionDate": "2017-01-17T14:59:42Z",
    "biotoolsCURIE": "biotools:dexus",
    "biotoolsID": "dexus",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "klambauer@bioinf.jku.at",
            "name": "Guenter Klambauer",
            "orcidid": "http://orcid.org/0000-0003-2861-5552",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This tool identifies differentially expressed genes in RNA-seq data under all possible study designs such as studies without replicates, without sample groups, and with unknown conditions, but also for known conditions, for example for RNA-Seq data with two or multiple conditions. It works as an statistical model that is selected in a Bayesian framework by an EM algorithm.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/dexus.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/dexus_1.14.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/dexus.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T04:07:41Z",
    "license": "GPL-2.0",
    "name": "dexus",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt834",
            "metadata": {
                "abstract": "Detection of differential expression in RNA-Seq data is currently limited to studies in which two or more sample conditions are known a priori. However, these biological conditions are typically unknown in cohort, cross-sectional and nonrandomized controlled studies such as the HapMap, the ENCODE or the 1000 Genomes project. We present DEXUS for detecting differential expression in RNASeq data for which the sample conditions are unknown. DEXUS models read counts as a finite mixture of negative binomial distributions in which eachmixture component corresponds to a condition. A transcript is considered differentially expressed if modeling of its read counts requires more than one condition. DEXUS decomposes read count variation into variation due to noise and variation due to differential expression. Evidence of differential expression is measured by the informative/noninformative (I/NI) value, which allows differentially expressed transcripts to be extracted at a desired specificity (significance level) or sensitivity (power). DEXUS performed excellently in identifying differentially expressed transcripts in data with unknown conditions. On 2400 simulated data sets, I/NI value thresholds of 0.025, 0.05 and 0.1 yielded average specificities of 92, 97 and 99% at sensitivities of 76, 61 and 38%, respectively. On real-world data sets, DEXUS was able to detect differentially expressed transcripts related to sex, species, tissue, structural variants or quantitative trait loci. The DEXUS R package is publicly available from Bioconductor and the scripts for all experiments are available at http://www.bioinf.jku.at/software/dexus/. © The Author(s) 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Klambauer G."
                    },
                    {
                        "name": "Unterthiner T."
                    },
                    {
                        "name": "Hochreiter S."
                    }
                ],
                "citationCount": 14,
                "date": "2013-11-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DEXUS: Identifying differential expression in RNA-Seq studies with unknown conditions"
            },
            "pmcid": "PMC3834838",
            "pmid": "24049071",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.0"
    ]
}