{
    "additionDate": "2015-01-21T15:12:19Z",
    "biotoolsCURIE": "biotools:biomaj",
    "biotoolsID": "biomaj",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "GenOuest",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Olivier Sallou",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "support@genouest.org",
            "name": "GenOuest platform",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.genouest.org"
        }
    ],
    "description": "BioMAJ is a workflow engine dedicated to data synchronization and processing. The Software automates the update cycle and the supervision of the locally mirrored databank repository.",
    "documentation": [
        {
            "type": "General",
            "url": "http://biomaj.readthedocs.io/en/latest/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/genouest/biomaj"
        },
        {
            "note": "Help concerning the installation process available at https://biomaj.genouest.org/with-docker/",
            "type": "Container file",
            "url": "https://hub.docker.com/r/osallou/biomaj-docker/"
        }
    ],
    "editPermission": {
        "authors": [
            "olivier.collin@irisa.fr"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "URL",
                        "uri": "http://edamontology.org/data_1052"
                    }
                }
            ],
            "note": "Automatic biological databank monitoring, retrieval and formatting",
            "operation": [
                {
                    "term": "Indexing",
                    "uri": "http://edamontology.org/operation_0227"
                },
                {
                    "term": "Conversion",
                    "uri": "http://edamontology.org/operation_3434"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data index",
                        "uri": "http://edamontology.org/data_0955"
                    }
                }
            ]
        }
    ],
    "homepage": "http://biomaj.genouest.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:42Z",
    "license": "AGPL-3.0",
    "maturity": "Mature",
    "name": "BioMAJ",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "GenOuest",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn325",
            "metadata": {
                "abstract": "Large- and medium-scale computational molecular biology projects require accurate bioinformatics software and numerous heterogeneous biological databanks, which are distributed around the world. BioMAJ provides a flexible, robust, fully automated environment for managing such massive amounts of data. The JAVA application enables automation of the data update cycle process and supervision of the locally mirrored data repository. We have developed workflows that handle some of the most commonly used bioinformatics databases. A set of scripts is also available for post-synchronization data treatment consisting of indexation or format conversion (for NCBI blast, SRS, EMBOSS, GCG, etc.). BioMAJ can be easily extended by personal homemade processing scripts. Source history can be kept via html reports containing statements of locally managed databanks. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Filangi O."
                    },
                    {
                        "name": "Beausse Y."
                    },
                    {
                        "name": "Assi A."
                    },
                    {
                        "name": "Legrand L."
                    },
                    {
                        "name": "Larre J.-M."
                    },
                    {
                        "name": "Martin V."
                    },
                    {
                        "name": "Collin O."
                    },
                    {
                        "name": "Caron C."
                    },
                    {
                        "name": "Leroy H."
                    },
                    {
                        "name": "Allouche D."
                    }
                ],
                "citationCount": 7,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BioMAJ: A flexible framework for databanks synchronization and processing"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1186/s13742-015-0063-8",
            "metadata": {
                "abstract": "© 2015 Bretaudeau et al. Background: Many bioinformatics tools use reference data, such as genome assemblies or sequence databanks. Galaxy offers multiple ways to give access to this data through its web interface. However, the process of adding new reference data was customarily manual and time consuming, even more so when this data needed to be indexed in a variety of formats (e.g. Blast, Bowtie, BWA, or 2bit). BioMAJ is a widely used and stable software that is designed to automate the download and transformation of data from various sources. This data can be used directly from the command line, in more complex systems, such as Mobyle, or by using a REST API. Findings: To ease the process of giving access to reference data in Galaxy, we have developed the BioMAJ2Galaxy module, which enables the gap between BioMAJ and Galaxy to be bridged. With this module, it is now possible to configure BioMAJ to automatically download some reference data, to then convert and/or index it in various formats, and then make this data available in a Galaxy server using data libraries or data managers. Conclusions: The developments presented in this paper allow us to integrate the reference data in Galaxy in an automatic, reliable, and diskspace-saving way. The code is freely available on the GenOuest GitHub account (https://github.com/genouest/biomaj2galaxy).",
                "authors": [
                    {
                        "name": "Bretaudeau A."
                    },
                    {
                        "name": "Monjeaud C."
                    },
                    {
                        "name": "Bras Y.L."
                    },
                    {
                        "name": "Legeai F."
                    },
                    {
                        "name": "Collin O."
                    }
                ],
                "citationCount": 1,
                "date": "2015-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "BioMAJ2Galaxy: Automatic update of reference data in Galaxy using BioMAJ"
            }
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "3.1.3"
    ]
}