
{
    "credit": [
        {
            "email": "shandar@nibiohn.go.jp",
            "name": "Shandar Ahmad",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mizuguchilab.org/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mizuguchilab.org/netasa/srcpred/introduction.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/srcpred-predict-specific-protein-rna-contacts.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Regulation of gene expression, protein synthesis, replication and assembly of many viruses involve RNA-protein interactions. Although some successful computational tools have been reported to recognize RNA binding sites in proteins, the problem of specificity remains poorly investigated. After the nucleotide base composition, the dinucleotide is the smallest unit of RNA sequence information and many RNA-binding proteins simply bind to regions enriched in one dinucleotide. Interaction preferences of protein subsequences and dinucleotides can be inferred from protein-RNA complex structures, enabling a training-based prediction approach.Results: We analyzed basic statistics of amino acid-dinucleotide contacts in protein-RNA complexes and found their pairing preferences could be identified. Using a standard approach to represent protein subsequences by their evolutionary profile, we trained neural networks to predict multiclass target vectors corresponding to 16 possible contacting dinucleotide subsequences. In the cross-validation experiments, the accuracies of the optimum network, measured as areas under the curve (AUC) of the receiver operating characteristic (ROC) graphs, were in the range of 65-80%.Conclusions: Dinucleotide-specific contact predictions have also been extended to the prediction of interacting protein and RNA fragment pairs, which shows the applicability of this method to predict targets of RNA-binding proteins. A web server predicting the 16-dimensional contact probability matrix directly from a user-defined protein sequence was implemented and made available at: http://tardis.nibio.go.jp/netasa/srcpred. © 2011 Fernandez et al; licensee BioMed Central Ltd.",
            "authors": [
                "Fernandez M.",
                "Kumagai Y.",
                "Standley D.M. .",
                "Sarai A.",
                "Mizuguchi K.",
                "Ahmad S."
            ],
            "cit_count": 23,
            "journal": "BMC Bioinformatics",
            "pmid": "22373260",
            "title": "Prediction of dinucleotide-specific RNA-binding sites in proteins",
            "year": "2011-11-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:srcpred",
        "biotoolsID": "srcpred",
        "description": "SRCPred predicts the RNA dinucleotide contacts in protein using evolutionary information in the form of PSSM using Neural Networks.",
        "homepage": "http://mizuguchilab.org/netasa/srcpred/",
        "name": "SRCPred"
    }
}