{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T13:54:39.521028Z",
    "biotoolsCURIE": "biotools:gaemda",
    "biotoolsID": "gaemda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zwli@cumt.edu.cn",
            "name": "Zhengwei Li"
        }
    ],
    "description": "A graph auto-encoder model for miRNA-disease associations prediction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chimianbuhetang/GAEMDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-28T13:54:39.525249Z",
    "name": "GAEMDA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA240",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Emerging evidence indicates that the abnormal expression of miRNAs involves in the evolution and progression of various human complex diseases. Identifying disease-related miRNAs as new biomarkers can promote the development of disease pathology and clinical medicine. However, designing biological experiments to validate disease-related miRNAs is usually time-consuming and expensive. Therefore, it is urgent to design effective computational methods for predicting potential miRNA-disease associations. Inspired by the great progress of graph neural networks in link prediction, we propose a novel graph auto-encoder model, named GAEMDA, to identify the potential miRNA-disease associations in an end-to-end manner. More specifically, the GAEMDA model applies a graph neural networks-based encoder, which contains aggregator function and multi-layer perceptron for aggregating nodes' neighborhood information, to generate the low-dimensional embeddings of miRNA and disease nodes and realize the effective fusion of heterogeneous information. Then, the embeddings of miRNA and disease nodes are fed into a bilinear decoder to identify the potential links between miRNA and disease nodes. The experimental results indicate that GAEMDA achieves the average area under the curve of 93.56 ± 0.44% under 5-fold cross-validation. Besides, we further carried out case studies on colon neoplasms, esophageal neoplasms and kidney neoplasms. As a result, 48 of the top 50 predicted miRNAs associated with these diseases are confirmed by the database of differentially expressed miRNAs in human cancers and microRNA deregulation in human disease database, respectively. The satisfactory prediction performance suggests that GAEMDA model could serve as a reliable tool to guide the following researches on the regulatory role of miRNAs. Besides, the source codes are available at https://github.com/chimianbuhetang/GAEMDA.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Nie R."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Bao W."
                    }
                ],
                "citationCount": 3,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "A graph auto-encoder model for miRNA-disease associations prediction"
            },
            "pmid": "34293850"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}