{
    "additionDate": "2017-01-13T13:15:47Z",
    "biotoolsCURIE": "biotools:pash",
    "biotoolsID": "pash",
    "credit": [
        {
            "email": "amilosav@bcm.tmc.edu",
            "name": "Aleksandar Milosavljevic",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "elken@bcm.tmc.edu",
            "name": "Elke Norwig-Eastaugh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pash 3.0 performs sequence comparison and read mapping and can be employed as a module within diverse configurable analysis pipelines, including ChIP-seq and methylome mapping by whole-genome bisulfite sequencing",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.brl.bcm.tmc.edu/pash/pashDownload.rhtml",
    "lastUpdate": "2021-04-26T08:49:28Z",
    "name": "PASH",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_004078"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Massively parallel sequencing readouts of epigenomic assays are enabling integrative genome-wide analyses of genomic and epigenomic variation. Pash 3.0 performs sequence comparison and read mapping and can be employed as a module within diverse configurable analysis pipelines, including ChIP-Seq and methylome mapping by whole-genome bisulfite sequencing.Results: Pash 3.0 generally matches the accuracy and speed of niche programs for fast mapping of short reads, and exceeds their performance on longer reads generated by a new generation of massively parallel sequencing technologies. By exploiting longer read lengths, Pash 3.0 maps reads onto the large fraction of genomic DNA that contains repetitive elements and polymorphic sites, including indel polymorphisms.Conclusions: We demonstrate the versatility of Pash 3.0 by analyzing the interaction between CpG methylation, CpG SNPs, and imprinting based on publicly available whole-genome shotgun bisulfite sequencing data. Pash 3.0 makes use of gapped k-mer alignment, a non-seed based comparison method, which is implemented using multi-positional hash tables. This allows Pash 3.0 to run on diverse hardware platforms, including individual computers with standard RAM capacity, multi-core hardware architectures and large clusters. © 2010 Coarfa et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Coarfa C."
                    },
                    {
                        "name": "Harris R.A."
                    },
                    {
                        "name": "Miller C.A."
                    },
                    {
                        "name": "Milosavljevic A."
                    },
                    {
                        "name": "Yu F."
                    }
                ],
                "citationCount": 39,
                "date": "2010-11-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Pash 3.0: A versatile software package for read mapping and integrative analysis of genomic and epigenomic variation using massively parallel DNA sequencing"
            },
            "pmid": "21092284"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        }
    ],
    "validated": 1
}
