{
    "additionDate": "2017-08-03T19:02:39Z",
    "biotoolsCURIE": "biotools:tesla",
    "biotoolsID": "tesla",
    "credit": [
        {
            "email": "amahmed@cs.cmu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A software for estimating time-varying network from time-series of nodal attributes. It stems from the acronym TESLLOR, which stands for TEmporally Smoothed 11-regularized Logistic Regression. It represents a novel extension of the well-known lasso-style sparse structure recovery technique.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.sailing.cs.cmu.edu/main/?page_id=444"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.sailing.cs.cmu.edu/main/?page_id=444",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tesla-recovering-time-varying-networks-dependencies-biological-studies.html"
        }
    ],
    "name": "TESLA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A plausible representation of the relational information among entities in dynamic systems such as a living cell or a social community is a stochastic network that is topologically rewiring and semantically evolving over time. Although there is a rich literature in modeling static or temporally invariant networks, little has been done toward recovering the network structure when the networks are not observable in a dynamic context. In this article, we present a machine learning method called TESLA, which builds on a temporally smoothedl1-regularized logistic regression formalism that can be cast as a standard convex-optimization problem and solved efficiently by using generic solvers scalable to large networks. We report promising results on recovering simulated timevarying networks and on reverse engineering the latent sequence of temporally rewiring political and academic social networks from longitudinal data, and the evolving gene networks over >4,000 genes during the life cycle of Drosophila melanogaster from a microarray time course at a resolution limited only by sample frequency.",
                "authors": [
                    {
                        "name": "Ahmed A."
                    },
                    {
                        "name": "Xing E.P."
                    }
                ],
                "citationCount": 149,
                "date": "2009-07-21T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Recovering time-varying networks of dependencies in social and biological studies"
            },
            "pmid": "19570995"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}