{
    "additionDate": "2017-12-18T00:10:05Z",
    "biotoolsCURIE": "biotools:pbm",
    "biotoolsID": "pbm",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://thebrain.bwh.harvard.edu/index.html"
        }
    ],
    "description": "PBM Analysis Suite provides the in-house tools and the procedural methods used in the analysis of universal protein binding microarrays (PBMs) synthesized by Agilent Techonologies",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://thebrain.bwh.harvard.edu/PBMAnalysisSuite/PBM_analysis_overview_9-8-08b.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://thebrain.bwh.harvard.edu/PBMAnalysisSuite/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pbm-universal-protein-binding-microarray-analysis-suite.html"
        }
    ],
    "name": "PBM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt152",
            "metadata": {
                "abstract": "Motivation: Sequence-specific transcription factors (TFs) regulate the expression of their target genes through interactions with specific DNA-binding sites in the genome. Data on TF-DNA binding specificities are essential for understanding how regulatory specificity is achieved.Results: Numerous studies have used universal protein-binding microarray (PBM) technology to determine the in vitro binding specificities of hundreds of TFs for all possible 8 bp sequences (8mers). We have developed a Bayesian analysis of variance (ANOVA) model that decomposes these 8mer data into background noise, TF familywise effects and effects due to the particular TF. Adjusting for background noise improves PBM data quality and concordance with in vivo TF binding data. Moreover, our model provides simultaneous identification of TF subclasses and their shared sequence preferences, and also of 8mers bound preferentially by individual members of TF subclasses. Such results may aid in deciphering cis-regulatory codes and determinants of protein-DNA binding specificity. © The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Bulyk M.L."
                    },
                    {
                        "name": "Jiang B."
                    },
                    {
                        "name": "Liu J.S."
                    }
                ],
                "citationCount": 10,
                "date": "2013-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Bayesian hierarchical model of protein-binding microarray k-mer data reduces noise and identifies transcription factor subclasses and preferred k-mers"
            }
        },
        {
            "doi": "10.1038/nprot.2008.195",
            "metadata": {
                "abstract": "Protein-binding microarray (PBM) technology provides a rapid, high-throughput means of characterizing the in vitro DNA-binding specificities of transcription factors (TFs). Using high-density, custom-designed microarrays containing all 10-mer sequence variants, one can obtain comprehensive binding-site measurements for any TF, regardless of its structural class or species of origin. Here, we present a protocol for the examination and analysis of TF-binding specificities at high resolution using such 'all 10-mer' universal PBMs. This procedure involves double-stranding a commercially synthesized DNA oligonucleotide array, binding a TF directly to the double-stranded DNA microarray and labeling the protein-bound microarray with a fluorophore-conjugated antibody. We describe how to computationally extract the relative binding preferences of the examined TF for all possible contiguous and gapped 8-mers over the full range of affinities, from highest affinity sites to nonspecific sites. Multiple proteins can be tested in parallel in separate chambers on a single microarray, enabling the processing of a dozen or more TFs in a single day. © 2009 Macmillan Publishers Limited. All rights reserved.",
                "authors": [
                    {
                        "name": "Berger M.F."
                    },
                    {
                        "name": "Bulyk M.L."
                    }
                ],
                "citationCount": 232,
                "date": "2009-01-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Universal protein-binding microarrays for the comprehensive characterization of the dna-binding specificities of transcription factors"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microarrays",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}
