{
    "additionDate": "2018-06-02T08:03:40Z",
    "biotoolsCURIE": "biotools:bigstatsr",
    "biotoolsID": "bigstatsr",
    "credit": [
        {
            "email": "florian.prive@univ-grenoble-alpes.fr",
            "name": "Florian Privé",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "michael.blum@univ-grenoble-alpes.fr",
            "name": "Michael G B Blum",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast statistical analysis of large-scale data encoded as matrices.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://privefl.github.io/bigstatsr/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://privefl.github.io/bigstatsr/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "bigstatsr",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty185",
            "metadata": {
                "abstract": "© The Author(s) 2018. Motivation: Genome-wide datasets produced for association studies have dramatically increased in size over the past few years, with modern datasets commonly including millions of variants measured in dozens of thousands of individuals. This increase in data size is a major challenge severely slowing down genomic analyses, leading to some software becoming obsolete and researchers having limited access to diverse analysis tools. Results: Here we present two R packages, bigstatsr and bigsnpr, allowing for the analysis of large scale genomic data to be performed within R. To address large data size, the packages use memory-mapping for accessing data matrices stored on disk instead of in RAM. To perform data pre-processing and data analysis, the packages integrate most of the tools that are commonly used, either through transparent system calls to existing software, or through updated or improved implementation of existing methods. In particular, the packages implement fast and accurate computations of principal component analysis and association studies, functions to remove single nucleotide polymorphisms in linkage disequilibrium and algorithms to learn polygenic risk scores on millions of single nucleotide polymorphisms. We illustrate applications of the two R packages by analyzing a case-control genomic dataset for celiac disease, performing an association study and computing polygenic risk scores. Finally, we demonstrate the scalability of the R packages by analyzing a simulated genome-wide dataset including 500 000 individuals and 1 million markers on a single desktop computer.",
                "authors": [
                    {
                        "name": "Prive F."
                    },
                    {
                        "name": "Aschard H."
                    },
                    {
                        "name": "Ziyatdinov A."
                    },
                    {
                        "name": "Blum M.G.B."
                    }
                ],
                "citationCount": 2,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Efficient analysis of large-scale genome-wide data with two R packages: Bigstatsr and bigsnpr"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Pure mathematics",
            "uri": "http://edamontology.org/topic_3570"
        }
    ],
    "validated": 1
}