
{
    "credit": [
        {
            "email": "taehyung.kim@utoronto.ca",
            "name": "TaeHyung Simon Kim",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.kimlab.org/"
        },
        {
            "email": "marc.tyndel@utoronto.ca",
            "name": "Marc Tyndel",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "david.gfeller@isb-sib.ch",
            "name": "David Gfeller",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "pi@kimlab.org",
            "name": "Philip M. Kim",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.kimlab.org/software/musi"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/musi-multiple-specificity-identifier.html"
        }
    ],
    "publication": [
        {
            "abstract": "Peptide recognition domains and transcription factors play crucial roles in cellular signaling. They bind linear stretches of amino acids or nucleotides, respectively, with high specificity. Experimental techniques that assess the binding specificity of these domains, such as microarrays or phage display, can retrieve thousands of distinct ligands, providing detailed insight into binding specificity. In particular, the advent of next-generation sequencing has recently increased the throughput of such methods by several orders of magnitude. These advances have helped reveal the presence of distinct binding specificity classes that co-exist within a set of ligands interacting with the same target. Here, we introduce a software system called MUSI that can rapidly analyze very large data sets of binding sequences to determine the relevant binding specificity patterns. Our pipeline provides two major advances. First, it can detect previously unrecognized multiple specificity patterns in any data set. Second, it offers integrated processing of very large data sets from next-generation sequencing machines. The results are visualized as multiple sequence logos describing the different binding preferences of the protein under investigation. We demonstrate the performance of MUSI by analyzing recent phage display data for human SH3 domains as well as microarray data for mouse transcription factors. © 2011 The Author(s).",
            "authors": [
                "Kim T.",
                "Tyndel M.S.",
                "Huang H.",
                "Sidhu S.S.",
                "Bader G.D.",
                "Gfeller D.",
                "Kim P.M."
            ],
            "cit_count": 27,
            "journal": "Nucleic Acids Research",
            "pmid": "22210894",
            "title": "MUSI: An integrated system for identifying multiple specificity from very large peptide or nucleic acid data sets",
            "year": "2012-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:musi-bind",
        "biotoolsID": "musi-bind",
        "description": "Tool for uncovering multiple peptides and nucleic acids binding specificities from sequence data. MUSI provides a simple interface for processing short peptides or nucleic acid sequence data. Starting from a set of sequences observed to bind to a given target, it automatically generates an optimal number of motifs based on the different specificity patterns present in the data.",
        "homepage": "http://www.kimlab.org/software/musi",
        "name": "MUSI"
    }
}