{
    "additionDate": "2021-01-18T11:20:22Z",
    "biotoolsCURIE": "biotools:chewie-ns",
    "biotoolsID": "chewie-ns",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ramirez@fm.ul.pt",
            "name": "Mário Ramirez",
            "typeEntity": "Person"
        }
    ],
    "description": "Chewie Nomenclature Server (chewie-NS) is a web server that allows users to share genome-based gene-by-gene typing schemas and to maintain a common nomenclature, simplifying the comparison of results. The combination between local analyses and a public repository of allelic data strikes a balance between potential confidentiality issues and the need to compare results.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://chewie-ns.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                }
            ]
        }
    ],
    "homepage": "https://github.com/B-UMMI/Chewie-NS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T15:47:57Z",
    "license": "GPL-3.0",
    "name": "chewie-NS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA889",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Chewie Nomenclature Server (chewie-NS, https://chewbbaca.online/) allows users to share genome-based gene-by-gene typing schemas and to maintain a common nomenclature, simplifying the comparison of results. The combination between local analyses and a public repository of allelic data strikes a balance between potential confidentiality issues and the need to compare results. The possibility of deploying private instances of chewie-NS facilitates the creation of nomenclature servers with a restricted user base to allow compliance with the strictest data policies. Chewie-NS allows users to easily share their own schemas and to explore publicly available schemas, including informative statistics on schemas and loci presented in interactive charts and tables. Users can retrieve all the information necessary to run a schema locally or all the alleles identified at a particular locus. The integration with the chewBBACA suite enables users to directly upload new schemas to chewie-NS, download existing schemas and synchronize local and remote schemas from chewBBACA command line version, allowing an easier integration into high-throughput analysis pipelines. The same REST API linking chewie-NS and the chewBBACA suite supports the interaction of other interfaces or pipelines with the databases available at chewie-NS, facilitating the reusability of the stored data.",
                "authors": [
                    {
                        "name": "Carrico J.A."
                    },
                    {
                        "name": "Mamede R."
                    },
                    {
                        "name": "Ramirez M."
                    },
                    {
                        "name": "Silva M."
                    },
                    {
                        "name": "Vila-Cerqueira P."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Chewie nomenclature server (chewie-NS): A deployable nomenclature server for easy sharing of core and whole genome MLST schemas"
            },
            "pmid": "33068420"
        }
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
