{
    "additionDate": "2018-10-18T10:38:11Z",
    "biotoolsCURIE": "biotools:proteinhistorian",
    "biotoolsID": "proteinhistorian",
    "credit": [
        {
            "email": "proteinhistorian@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identifies enrichment for proteins of different phylogenetic ages in protein sets of interest. Over thirty eukaryotic species are currently supported and other protein attributes can be uploaded to combine with the protein age analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lighthouse.ucsf.edu/ProteinHistorian/faq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://lighthouse.ucsf.edu/ProteinHistorian/downloads.html"
        },
        {
            "type": "Biological data",
            "url": "http://lighthouse.ucsf.edu/ProteinHistorian/downloads.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                }
            ]
        }
    ],
    "homepage": "http://lighthouse.ucsf.edu/ProteinHistorian/",
    "language": [
        "JavaScript",
        "R",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-1.0",
    "name": "ProteinHistorian",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1002567",
            "metadata": {
                "abstract": "The evolutionary history of a protein reflects the functional history of its ancestors. Recent phylogenetic studies identified distinct evolutionary signatures that characterize proteins involved in cancer, Mendelian disease, and different ontogenic stages. Despite the potential to yield insight into the cellular functions and interactions of proteins, such comparative phylogenetic analyses are rarely performed, because they require custom algorithms. We developed ProteinHistorian to make tools for performing analyses of protein origins widely available. Given a list of proteins of interest, ProteinHistorian estimates the phylogenetic age of each protein, quantifies enrichment for proteins of specific ages, and compares variation in protein age with other protein attributes. ProteinHistorian allows flexibility in the definition of protein age by including several algorithms for estimating ages from different databases of evolutionary relationships. We illustrate the use of ProteinHistorian with three example analyses. First, we demonstrate that proteins with high expression in human, compared to chimpanzee and rhesus macaque, are significantly younger than those with human-specific low expression. Next, we show that human proteins with annotated regulatory functions are significantly younger than proteins with catalytic functions. Finally, we compare protein length and age in many eukaryotic species and, as expected from previous studies, find a positive, though often weak, correlation between protein age and length. ProteinHistorian is available through a web server with an intuitive interface and as a set of command line tools; this allows biologists and bioinformaticians alike to integrate these approaches into their analysis pipelines. ProteinHistorian's modular, extensible design facilitates the integration of new datasets and algorithms. The ProteinHistorian web server, source code, and pre-computed ages for 32 eukaryotic genomes are freely available under the GNU public license at http://lighthouse.ucsf.edu/ProteinHistorian/. © 2012 Capra et al.",
                "authors": [
                    {
                        "name": "Capra J.A."
                    },
                    {
                        "name": "Williams A.G."
                    },
                    {
                        "name": "Pollard K.S."
                    }
                ],
                "citationCount": 45,
                "date": "2012-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Proteinhistorian: Tools for the comparative analysis of eukaryote protein origin"
            },
            "pmcid": "PMC3386163",
            "pmid": "22761559",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}