
{
    "credit": [
        {
            "email": "mpellegri@berkeley.edu",
            "name": "Maurizio Pellegrino",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/Harshlight.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/Harshlight_1.46.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://asterion.rockefeller.edu/Harshlight/"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Microscopists are familiar with many blemishes that fluorescence images can have due to dust and debris, glass flaws, uneven distribution of fluids or surface coatings, etc. Microarray scans do show similar artifacts, which might affect subsequent analysis. Although all but the starkest blemishes are hard to find by the unaided eye, particularly in high-density oligonucleotide arrays (HDONAs), few tols are available to help with the detection of those defects. Results: We develop a novel tool, Harshlight, for the automatic detection and masking of blemishes in HDONA microarray chips. Harshlight uses a combination of statistic and image processing methods to identify three different types of defects: localized blemishes affecting a few probes, diffuse defects affecting larger areas, and extended defects which may invalidate an entire chip. Conclusions: We demonstrate the use of Harshlight can materially improve analysis of HDONA chips, especially for experiments with subtle changes between samples. For the widely used MAS5 algorithm, we show that compact blemishes cause an average of 8 gene expression values per chip to change by more than 50%, two of them by more than twofold; our masking algorithm restores about two thirds of this damage. Large-scale artifacts are successfully detected and eliminated. © 2005 Suarez-Farinas et al., licensee BioMed Central Ltd.",
            "authors": [
                "Suarez-Farinas M.",
                "Pellegrino M.",
                "Wittkowski K.M.",
                "Magnasco M.O."
            ],
            "cit_count": 62,
            "doi": "10.1186/1471-2105-6-294",
            "journal": "BMC Bioinformatics",
            "title": "Harshlight: A \"corrective make-up\" program for microarray chips",
            "type": "Primary",
            "year": "2005-12-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:harshlight",
        "biotoolsID": "harshlight",
        "description": "The package is used to detect extended, diffuse and compact blemishes on microarray chips. It automatically marks the areas in a collection of chips (affybatch objects) and a corrected AffyBatch object is returned, in which the defected areas are substituted with NAs or the median of the values of the same probe in the other chips in the collection. The new version handle the substitute value as whole matrix to solve the memory problem.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/Harshlight.html",
        "name": "Harshlight",
        "version": [
            "1.46.0"
        ]
    }
}