{
    "additionDate": "2017-12-18T00:10:26Z",
    "biotoolsCURIE": "biotools:ppi-ps",
    "biotoolsID": "ppi-ps",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://faculty.uaeu.ac.ae/nzaki/"
        }
    ],
    "description": "The PPI-PS method consists of a representation of each protein sequence by a vector of pairwise similarities against large subsequences of amino acids created by a shifting window which passes over concatenated protein training sequences.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.biomedcentral.com/1471-2105/10/150"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://faculty.uaeu.ac.ae/nzaki/PPI_PS.htm",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ppi-ps-protein-protein-interaction-based-pairwise-similarity.html"
        }
    ],
    "name": "PPI-PS",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-150",
            "metadata": {
                "abstract": "Background: Protein-protein interaction (PPI) is essential to most biological processes. Abnormal interactions may have implications in a number of neurological syndromes. Given that the association and dissociation of protein molecules is crucial, computational tools capable of effectively identifying PPI are desirable. In this paper, we propose a simple yet effective method to detect PPI based on pairwise similarity and using only the primary structure of the protein. The PPI based on Pairwise Similarity (PPI-PS) method consists of a representation of each protein sequence by a vector of pairwise similarities against large subsequences of amino acids created by a shifting window which passes over concatenated protein training sequences. Each coordinate of this vector is typically the E-value of the Smith-Waterman score. These vectors are then used to compute the kernel matrix which will be exploited in conjunction with support vector machines. Results: To assess the ability of the proposed method to recognize the difference between \"interacted\" and \"non-interacted\" proteins pairs, we applied it on different datasets from the available yeast saccharomyces cerevisiae protein interaction. The proposed method achieved reasonable improvement over the existing state-of-the-art methods for PPI prediction. Conclusion: Pairwise similarity score provides a relevant measure of similarity between protein sequences. This similarity incorporates biological knowledge about proteins and it is extremely powerful when combined with support vector machine to predict PPI. © 2009 Zaki et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Zaki N."
                    },
                    {
                        "name": "Lazarova-Molnar S."
                    },
                    {
                        "name": "El-Hajj W."
                    },
                    {
                        "name": "Campbell P."
                    }
                ],
                "citationCount": 45,
                "date": "2009-05-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Protein-protein interaction based on pairwise similarity"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Amino acids",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}