{"credit":[{"email":"Jean-Loup.Faulon@univ-evry.fr","name":"Jean-Loup Faulon","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.issb.genopole.fr/~faulon/contact.php"}],"documentation":[{"type":"GENERAL","url":"http://xtms.issb.genopole.fr/about/"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"language":["Perl","Python","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/xtms-pathway-design-in-an-extended-metabolic-space.html"}],"publication":[{"abstract":"As metabolic engineering and synthetic biology progress toward reaching the goal of a more sustainable use of biological resources, the need of increasing the number of value-added chemicals that can be produced in industrial organisms becomes more imperative. Exploring, however, the vast possibility of pathways amenable to engineering through heterologous genes expression in a chassis organism is complex and unattainable manually. Here, we present XTMS, a web-based pathway analysis platform available at http://xtms.issb.genopole.fr, which provides full access to the set of pathways that can be imported into a chassis organism such as Escherichia coli through the application of an Extended Metabolic Space modeling framework. The XTMS approach consists on determining the set of biochemical transformations that can potentially be processed in vivo as modeled by molecular signatures, a specific coding system for derivation of reaction rules for metabolic reactions and enumeration of all the corresponding substrates and products. Most promising routes are described in terms of metabolite exchange, maximum allowable pathway yield, toxicity and enzyme efficiency. By answering such critical design points, XTMS not only paves the road toward the rationalization of metabolic engineering, but also opens new processing possibilities for non-natural metabolites and novel enzymatic transformations. © 2014 The Author(s).","authors":["Carbonell P.","Parutto P.","Herisson J.","Pandit S.B.","Faulon J.-L."],"cit_count":49,"journal":"Nucleic Acids Research","pmid":"24792156","title":"XTMS: Pathway design in an eXTended metabolic space","year":"2014-07-01"}],"summary":{"biotoolsCURIE":"biotools:xtms","biotoolsID":"xtms","description":"Web-based pathway analysis platform ,which provides full access to the set of pathways that can be imported into a chassis organism such as E. coli through the application of an Extended Metabolic Space modeling framework.","homepage":"http://xtms.issb.genopole.fr/","name":"XTMS"}}