{
    "additionDate": "2021-01-18T11:26:09Z",
    "biotoolsCURIE": "biotools:eccdia",
    "biotoolsID": "eccdia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ying_yu@fudan.edu.cn",
            "name": "Ying Yu",
            "typeEntity": "Person"
        },
        {
            "email": "lemingshi@fudan.edu.cn",
            "name": "Leming Shi",
            "typeEntity": "Person"
        }
    ],
    "description": "The Esophageal Cancer Clinical Data Interactive Analysis (ECCDIA) is an interactive web tool for the comprehensive analysis of clinical and survival data of esophageal cancer patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://webapps.3steps.cn/ECCDIA/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-05T15:19:52Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/clinico-omics/ECCDIA"
        }
    ],
    "name": "ECCDIA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12885-020-07479-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Esophageal cancer (EC) is considered as one of the deadliest malignancies with respect to incidence and mortality rate, and numerous risk factors may affect the prognosis of EC patients. For better understanding of the risk factors associated with the onset and prognosis of this malignancy, we develop an interactive web-based tool for the convenient analysis of clinical and survival characteristics of EC patients. Methods: The clinical data were obtained from The Surveillance, Epidemiology, and End Results (SEER) database. Seven analysis and visualization modules were built with Shiny. Results: The Esophageal Cancer Clinical Data Interactive Analysis (ECCDIA, http://webapps.3steps.cn/ECCDIA/) was developed to provide basic data analysis, visualization, survival analysis, and nomogram of the overall group and subgroups of 77,273 EC patients recorded in SEER. The basic data analysis modules contained distribution analysis of clinical factor ratios, Sankey plot analysis for relationships between clinical factors, and a map for visualizing the distribution of clinical factors. The survival analysis included Kaplan-Meier (K-M) analysis and Cox analysis for different subgroups of EC patients. The nomogram module enabled clinicians to precisely predict the survival probability of different subgroups of EC patients. Conclusion: ECCDIA provides clinicians with an interactive prediction and visualization tool for visualizing invaluable clinical and prognostic information of individual EC patients, further providing useful information for better understanding of esophageal cancer.",
                "authors": [
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Shang J."
                    },
                    {
                        "name": "Song Q."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Shi L."
                    }
                ],
                "date": "2020-10-12T00:00:00Z",
                "journal": "BMC Cancer",
                "title": "ECCDIA: An interactive web tool for the comprehensive analysis of clinical and survival data of esophageal cancer patients"
            },
            "pmcid": "PMC7552344",
            "pmid": "33046018"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}