{
    "accessibility": "Open access",
    "additionDate": "2021-10-21T23:46:16.920945Z",
    "biotoolsCURIE": "biotools:ribose-map",
    "biotoolsID": "ribose-map",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Alli L. Gombolay",
            "orcidid": "https://orcid.org/0000-0002-4065-8670"
        },
        {
            "name": "Francesca Storici",
            "orcidid": "https://orcid.org/0000-0003-4640-3350"
        }
    ],
    "description": "Ribose-Map is a user-friendly, standardized bioinformatics toolkit for the comprehensive analysis of ribonucleotide (rNMP) sequencing experiments. It can be applied to data generated using any high-throughput ribonucleotide sequencing technique, including ribose-seq, emRiboSeq, RHII-HydEn-seq, Alk-HydEn-seq, and Pu-seq.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                },
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/agombolay/ribose-map",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:17:37.779177Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/agombolay/ribose-map.git"
        }
    ],
    "name": "Ribose-Map",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/s41596-021-00553-x",
            "metadata": {
                "abstract": "The most common nonstandard nucleotides found in genomic DNA are ribonucleotides. Although ribonucleotides are frequently incorporated into DNA by replicative DNA polymerases, very little is known about the distribution and signatures of ribonucleotides incorporated into DNA. Recent advances in high-throughput ribonucleotide sequencing can capture the exact locations of ribonucleotides in genomic DNA. Ribose-Map is a user-friendly, standardized bioinformatics toolkit for the comprehensive analysis of ribonucleotide sequencing experiments. It allows researchers to map the locations of ribonucleotides in DNA to single-nucleotide resolution and identify biological signatures of ribonucleotide incorporation. In addition, it can be applied to data generated using any currently available high-throughput ribonucleotide sequencing technique, thus standardizing the analysis of ribonucleotide sequencing experiments and allowing direct comparisons of results. This protocol describes in detail how to use Ribose-Map to analyze ribonucleotide sequencing data, including preparing the reads for analysis, locating the genomic coordinates of ribonucleotides, exploring the genome-wide distribution of ribonucleotides, determining the nucleotide sequence context of ribonucleotides and identifying hotspots of ribonucleotide incorporation. Ribose-Map does not require background knowledge of ribonucleotide sequencing analysis and assumes only basic command-line skills. The protocol requires less than 3 h of computing time for most datasets and ~30 min of hands-on time. Ribose-Map is available at https://github.com/agombolay/ribose-map.",
                "authors": [
                    {
                        "name": "Gombolay A.L."
                    },
                    {
                        "name": "Storici F."
                    }
                ],
                "citationCount": 5,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Mapping ribonucleotides embedded in genomic DNA to single-nucleotide resolution using Ribose-Map"
            },
            "pmcid": "PMC9444191",
            "pmid": "34089018"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
