
{
    "credit": [
        {
            "name": "J. Gonzalez-Vallinas",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "upf.edu",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "pyicoteo@googlegroups.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://bitbucket.org/regulatorygenomicsupf/pyicoteo/overview"
        },
        {
            "email": "eduardo.eyras@upf.edu",
            "name": "Eduardo Eyras",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://regulatorygenomics.upf.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://bitbucket.org/regulatorygenomicsupf/pyicoteo/wiki/Home"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "license": "GPL-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: High-throughput sequencing (HTS) has revolutionized gene regulation studies and is now fundamental for the detection of protein-DNA and protein-RNA binding, as well as for measuring RNA expression. With increasing variety and sequencing depth of HTS datasets, the need for more flexible and memory-efficient tools to analyse them is growing.Results: We describe Pyicos, a powerful toolkit for the analysis of mapped reads from diverse HTS experiments: ChIP-Seq, either punctuated or broad signals, CLIP-Seq and RNA-Seq. We prove the effectiveness of Pyicos to select for significant signals and show that its accuracy is comparable and sometimes superior to that of methods specifically designed for each particular type of experiment. Pyicos facilitates the analysis of a variety of HTS datatypes through its flexibility and memory efficiency, providing a useful framework for data integration into models of regulatory genomics. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Althammer S.",
                "Gonzalez-vallinas J.",
                "Ballare C.",
                "Beato M.",
                "Eyras E."
            ],
            "cit_count": 55,
            "doi": "10.1093/bioinformatics/btr570",
            "journal": "Bioinformatics",
            "title": "Pyicos: A versatile toolkit for the analysis of high-throughput sequencing data",
            "type": "Primary",
            "year": "2011-12-01"
        },
        {
            "abstract": "The epigenetic regulation of gene expression involves multiple factors. The synergistic or antagonistic action of these factors has suggested the existence of an epigenetic code for gene regulation. Highthroughput sequencing (HTS) provides an opportunity to explore this code and to build quantitative models of gene regulation based on epigenetic differences between specific cellular conditions. We describe a new computational framework that facilitates the systematic integration of HTS epigenetic data. Our method relates epigenetic signals to expression by comparing two conditions. We show its effectiveness by building a model that predicts with high accuracy significant expression differences between two cell lines, using epigenetic data from the ENCODE project. Our analyses provide evidence for a degenerate epigenetic code, which involves multiple genic regions. In particular, signal changes at the 1st exon, 1st intron, and downstream of the polyadenylation site are found to associate strongly with expression regulation. Our analyses also show a different epigenetic code for intron-less and intron-containing genes. Our work provides a general methodology to do integrative analysis of epigenetic differences between cellular conditions that can be applied to other studies, like cell differentiation or carcinogenesis. © 2012 Sonja Althammer et al.",
            "authors": [
                "Althammer S.",
                "Pages A.",
                "Eyras E."
            ],
            "cit_count": 7,
            "doi": "10.1155/2012/284786",
            "journal": "Comparative and Functional Genomics",
            "title": "Predictive models of gene regulation from high-throughput epigenomics data",
            "type": "Other",
            "year": "2012-09-17"
        },
        {
            "abstract": "© 2015 Agirre et al.; licensee BioMed Central.Background: Alternative splicing is primarily controlled by the activity of splicing factors and by the elongation of the RNA polymerase II (RNAPII). Recent experiments have suggested a new complex network of splicing regulation involving chromatin, transcription and multiple protein factors. In particular, the CCCTC-binding factor (CTCF), the Argonaute protein AGO1, and members of the heterochromatin protein 1 (HP1) family have been implicated in the regulation of splicing associated with chromatin and the elongation of RNAPII. These results raise the question of whether these proteins may associate at the chromatin level to modulate alternative splicing. Results: Using chromatin immunoprecipitation sequencing (ChIP-Seq) data for CTCF, AGO1, HP1aα, H3K27me3, H3K9me2, H3K36me3, RNAPII, total H3 and 5metC and alternative splicing arrays from two cell lines, we have analyzed the combinatorial code of their binding to chromatin in relation to the alternative splicing patterns between two cell lines, MCF7 and MCF10. Using Machine Learning techniques, we identified the changes in chromatin signals that are most significantly associated with splicing regulation between these two cell lines. Moreover, we have built a map of the chromatin signals on the pre-mRNA, that is, a chromatin-based RNA-map, which can explain 606 (68.55%) of the regulated events between MCF7 and MCF10. This chromatin code involves the presence of HP1aα, CTCF, AGO1, RNAPII and histone marks around regulated exons and can differentiate patterns of skipping and inclusion. Additionally, we found a significant association of HP1aα and CTCF activities around the regulated exons and a putative DNA binding site for HP1aα. Conclusions: Our results show that a considerable number of alternative splicing events could have a chromatin-dependent regulation involving the association of HP1aα and CTCF near regulated exons. Additionally, we find further evidence for the involvement of HP1aα and AGO1 in chromatin-related splicing regulation.",
            "authors": [
                "Agirre E.",
                "Bellora N.",
                "Allo M.",
                "Pages A.",
                "Bertucci P.",
                "Kornblihtt A.R.",
                "Eyras E."
            ],
            "cit_count": 20,
            "doi": "10.1186/s12915-015-0141-5",
            "journal": "BMC Biology",
            "title": "A chromatin code for alternative splicing involving a putative association between CTCF and HP1aα proteins",
            "type": "Other",
            "year": "2015-12-12"
        },
        {
            "abstract": "© 2015 Gonzalez-Vallinas et al. Background: Transcriptional enhancers are generally known to regulate gene transcription from afar. Their activation involves a series of changes in chromatin marks and recruitment of protein factors. These enhancers may also occur inside genes, but how many may be active in human cells and their effects on the regulation of the host gene remains unclear. Results: We describe a novel semi-supervised method based on the relative enrichment of chromatin signals between 2 conditions to predict active enhancers. We applied this method to the tumoral K562 and the normal GM12878 cell lines to predict enhancers that are differentially active in one cell type. These predictions show enhancer-like properties according to positional distribution, correlation with gene expression and production of enhancer RNAs. Using this model, we predict 10,365 and 9777 intragenic active enhancers in K562 and GM12878, respectively, and relate the differential activation of these enhancers to expression and splicing differences of the host genes. Conclusions: We propose that the activation or silencing of intragenic transcriptional enhancers modulate the regulation of the host gene by means of a local change of the chromatin and the recruitment of enhancer-related factors that may interact with the RNA directly or through the interaction with RNA binding proteins. Predicted enhancers are available at http://regulatorygenomics.upf.edu/Projects/enhancers.html.",
            "authors": [
                "Gonzalez-Vallinas J.",
                "Pages A.",
                "Singh B.",
                "Eyras E."
            ],
            "cit_count": 2,
            "doi": "10.1186/s12864-015-1704-0",
            "journal": "BMC Genomics",
            "title": "A semi-supervised approach uncovers thousands of intragenic enhancers differentially activated in human cells",
            "type": "Other",
            "year": "2015-07-14"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pyicoteo",
        "biotoolsID": "pyicoteo",
        "description": "Suite of tools for the analysis of high-throughput sequencing data. It can be used to analyzed CLIP-seq and ChIP-seq data, as well as to calculate the differential enrichment of CLIP-seq, ChIP-seq and other types of datasets between two conditions, with or without replicates. It also includes a number of useful tools for the transformation and manipulation of genomic-based datasets.",
        "homepage": "https://bitbucket.org/regulatorygenomicsupf/pyicoteo",
        "name": "Pyicoteo",
        "version": [
            "2.0.7"
        ]
    }
}