{
    "additionDate": "2021-01-18T08:36:30Z",
    "biotoolsCURIE": "biotools:schema-health",
    "biotoolsID": "schema-health",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.shatte@federation.edu.au",
            "name": "Adrian B. R. Shatte",
            "orcidid": "https://orcid.org/0000-0002-6225-9697",
            "typeEntity": "Person"
        }
    ],
    "description": "an open-source, distributed mobile platform for deploying mHealth research tools and interventions.\n\nschema is a cross-platform mobile application for deploying mHealth monitoring and intervention studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/schema-app/schema",
    "lastUpdate": "2021-02-11T17:56:32Z",
    "license": "MIT",
    "name": "schema",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12874-020-00973-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Mobile applications for health, also known as 'mHealth apps', have experienced increasing popularity over the past ten years. However, most publicly available mHealth apps are not clinically validated, and many do not utilise evidence-based strategies. Health researchers wishing to develop and evaluate mHealth apps may be impeded by cost and technical skillset barriers. As traditionally lab-based methods are translated onto mobile platforms, robust and accessible tools are needed to enable the development of quality, evidence-based programs by clinical experts. Results: This paper introduces schema, an open-source, distributed, app-based platform for researchers to deploy behavior monitoring and health interventions onto mobile devices. The architecture and design features of the platform are discussed, including flexible scheduling, randomisation, a wide variety of survey and media elements, and distributed storage of data. The platform supports a range of research designs, including cross-sectional surveys, ecological momentary assessment, randomised controlled trials, and micro-randomised just-in-time adaptive interventions. Use cases for both researchers and participants are considered to demonstrate the flexibility and usefulness of the platform for mHealth research. Conclusions: The paper concludes by considering the strengths and limitations of the platform, and a call for support from the research community in areas of technical development and evaluation. To get started with schema, please visit the GitHub repository: Https://github.com/schema-app/schema.",
                "authors": [
                    {
                        "name": "Shatte A.B.R."
                    },
                    {
                        "name": "Teague S.J."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-25T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "schema: An open-source, distributed mobile platform for deploying mHealth research tools and interventions"
            },
            "pmcid": "PMC7183633",
            "pmid": "32334522"
        }
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
