{
    "accessibility": "Open access",
    "additionDate": "2019-12-23T00:50:02Z",
    "biotoolsCURIE": "biotools:PASTEClassifier",
    "biotoolsID": "PASTEClassifier",
    "collectionID": [
        "PlantBioinfoPF",
        "REPET",
        "URGI"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "urgi-repet@inrae.fr",
            "name": "URGI",
            "typeEntity": "Institute",
            "typeRole": [
                "Contributor",
                "Developer",
                "Documentor",
                "Maintainer",
                "Provider",
                "Support"
            ],
            "url": "https://urgi.versailles.inrae.fr/"
        }
    ],
    "description": "The PASTEClassifier (Pseudo Agent System for Transposable Elements Classification) is a transposable element (TE) classifier searching for structural features. It browses the whole spectrum of possible classifications at order level using Wicker hierarchical system. It is also able to automatically classify other repeated elements like SSR (Simple Sequence Repeats), rDNA or potential repeated host genes. The output is designed to facilitate manual curation by providing to the biologist all characteristics that have been found on each TE sequence.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://urgi.versailles.inra.fr/Tools/PASTEClassifier/PASTEClassifier-tuto"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://urgi.versailles.inrae.fr/download/repet/PASTEC_linux-x64-2.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "cmichotey",
            "johann_confais"
        ],
        "type": "group"
    },
    "elixirNode": [
        "France"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://urgi.versailles.inra.fr/Tools/PASTEClassifier",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2025-07-29T13:42:37.224114Z",
    "license": "CECILL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://urgi.versailles.inrae.fr/download/repet/"
        }
    ],
    "maturity": "Legacy",
    "name": "PASTEClassifier",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "fruitshuang",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0091929",
            "metadata": {
                "abstract": "Summary: The classification of transposable elements (TEs) is key step towards deciphering their potential impact on the genome. However, this process is often based on manual sequence inspection by TE experts. With the wealth of genomic sequences now available, this task requires automation, making it accessible to most scientists. We propose a new tool, PASTEC, which classifies TEs by searching for structural features and similarities. This tool outperforms currently available software for TE classification. The main innovation of PASTEC is the search for HMM profiles, which is useful for inferring the classification of unknown TE on the basis of conserved functional domains of the proteins. In addition, PASTEC is the only tool providing an exhaustive spectrum of possible classifications to the order level of the Wicker hierarchical TE classification system. It can also automatically classify other repeated elements, such as SSR (Simple Sequence Repeats), rDNA or potential repeated host genes. Finally, the output of this new tool is designed to facilitate manual curation by providing to biologists with all the evidence accumulated for each TE consensus. Availability: PASTEC is available as a REPET module or standalone software (http://urgi.versailles.inra.fr/download/repet/REPET-linux-x64-2.2.tar. gz). It requires a Unix-like system. There are two standalone versions: one of which is parallelized (requiring Sun grid Engine or Torque), and the other of which is not. © 2014 Hoede et al.",
                "authors": [
                    {
                        "name": "Arnoux S."
                    },
                    {
                        "name": "Chaumier T."
                    },
                    {
                        "name": "Hoede C."
                    },
                    {
                        "name": "Inizan O."
                    },
                    {
                        "name": "Jamilloux V."
                    },
                    {
                        "name": "Moisset M."
                    },
                    {
                        "name": "Quesneville H."
                    }
                ],
                "citationCount": 207,
                "date": "2014-05-02T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PASTEC: An automatic transposable element classification tool"
            },
            "pmcid": "PMC4008368",
            "pmid": "24786468",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
