{"credit":[{"email":"jared.simpson@oicr.on.ca","name":"Jared Simpson","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/jts/sga/tree/master/src#readme"}],"function":[{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]}],"labels":{"language":["C++"],"license":"GPL-3.0","maturity":"Mature","operatingSystem":["Linux"],"toolType":["Suite"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Whole genome sequencing","uri":"http://edamontology.org/topic_3673"}]},"publication":[{"abstract":"We present a concept and formalism, the string graph, which represents all that is inferable about a DNA sequence from a collection of shotgun sequencing reads collected from it. We give time and space efficient algorithms for constructing a string graph given the collection of overlaps between the reads and, in particular, present a novel linear expected time algorithm for transitive reduction in this context. The result demonstrates that the decomposition of reads into kmers employed in the de Bruijn graph approach described earlier is not essential, and exposes its close connection to the unitig approach we developed at Celera. This paper is a preliminary piece giving the basic algorithm and results that demonstrate the efficiency and scalability of the method. These ideas are being used to build a next-generation whole genome assembler called BOA (Berkeley Open Assembler) that will easily scale to mammalian genomes. © The Author 2005. Published by Oxford University Press. All rights reserved.","authors":["Myers E.W."],"cit_count":178,"journal":"Bioinformatics","pmid":"16204131","title":"The fragment assembly string graph","year":"2005-09-01"}],"summary":{"biotoolsCURIE":"biotools:sga","biotoolsID":"sga","description":"SGA is a de novo assembler designed to assemble large genomes from high coverage short read data.","homepage":"https://github.com/jts/sga","name":"SGA"}}