{
    "additionDate": "2020-01-09T17:36:33Z",
    "biotoolsCURIE": "biotools:CytoNorm",
    "biotoolsID": "CytoNorm",
    "collectionID": [
        "VIB",
        "UGent",
        "BIG N2N"
    ],
    "confidence_flag": "tool",
    "description": "A Normalization Algorithm for Cytometry Data. A R library to normalize cytometry data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://rdrr.io/github/saeyslab/CytoNorm/man/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/saeyslab/CytoNorm",
            "version": "0.0.5"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/saeyslab/CytoNorm",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-17T12:21:15Z",
    "license": "GPL-2.0",
    "link": [
        {
            "note": "Scripts to replicate the figures reported in the CytofNorm publication.",
            "type": [
                "Other"
            ],
            "url": "http://www.github.com/saeyslab/CytoNorm_Figures"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/saeyslab/CytoNorm/issues"
        }
    ],
    "name": "CytoNorm",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/CYTO.A.23904",
            "metadata": {
                "abstract": "© 2019 The Authors. Cytometry Part A published by Wiley Periodicals, Inc. on behalf of International Society for Advancement of Cytometry.High-dimensional flow cytometry has matured to a level that enables deep phenotyping of cellular systems at a clinical scale. The resulting high-content data sets allow characterizing the human immune system at unprecedented single cell resolution. However, the results are highly dependent on sample preparation and measurements might drift over time. While various controls exist for assessment and improvement of data quality in a single sample, the challenges of cross-sample normalization attempts have been limited to aligning marker distributions across subjects. These approaches, inspired by bulk genomics and proteomics assays, ignore the single-cell nature of the data and risk the removal of biologically relevant signals. This work proposes CytoNorm, a normalization algorithm to ensure internal consistency between clinical samples based on shared controls across various study batches. Data from the shared controls is used to learn the appropriate transformations for each batch (e.g., each analysis day). Importantly, some sources of technical variation are strongly influenced by the amount of protein expressed on specific cell types, requiring several population-specific transformations to normalize cells from a heterogeneous sample. To address this, our approach first identifies the overall cellular distribution using a clustering step, and calculates subset-specific transformations on the control samples by computing their quantile distributions and aligning them with splines. These transformations are then applied to all other clinical samples in the batch to remove the batch-specific variations. We evaluated the algorithm on a customized data set with two shared controls across batches. One control sample was used for calculation of the normalization transformations and the second control was used as a blinded test set and evaluated with Earth Mover's distance. Additional results are provided using two real-world clinical data sets. Overall, our method compared favorably to standard normalization procedures. The algorithm is implemented in the R package “CytoNorm” and available via the following link: www.github.com/saeyslab/CytoNorm © 2019 The Authors. Cytometry Part A published by Wiley Periodicals, Inc. on behalf of International Society for Advancement of Cytometry.",
                "authors": [
                    {
                        "name": "Van Gassen S."
                    },
                    {
                        "name": "Gaudilliere B."
                    },
                    {
                        "name": "Angst M.S."
                    },
                    {
                        "name": "Saeys Y."
                    },
                    {
                        "name": "Aghaeepour N."
                    }
                ],
                "citationCount": 9,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Cytometry Part A",
                "title": "CytoNorm: A Normalization Algorithm for Cytometry Data"
            },
            "pmcid": "PMC7078957",
            "pmid": "31633883"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        }
    ],
    "validated": 1,
    "version": [
        "0.0.5"
    ]
}