{
    "additionDate": "2021-01-18T09:26:31Z",
    "biotoolsCURIE": "biotools:ppai",
    "biotoolsID": "ppai",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lijianwei@hebut.edu.cn",
            "name": "Jianwei Li",
            "orcidid": "https://orcid.org/0000-0002-9795-2635",
            "typeEntity": "Person"
        }
    ],
    "description": "PPAI is a web server for predicting protein-aptamer interactions.\n\nThe interactions between proteins and aptamers are prevalent in organisms and play an important role in various life activities. Thanks to the rapid accumulation of protein-aptamer interaction data, it is very important and feasible to construct an accurate computational model to predict protein-aptamer interactions, which is benefit for understanding mechanisms of protein-aptamer interactions and improving aptamer-based therapies.\n\nPPAI is a novel web-server to predict aptamers and protein-aptamer interactions with sequence features of proteins/aptamers and machine learning framework which integrated Adaboost and Random Forest. PPAI not only provides more accurate prediction functions, but also provides the protein aptamer information to the user for query.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://39.96.85.9/PPAI",
    "lastUpdate": "2025-03-20T07:27:32.204279Z",
    "name": "PPAI",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.21203/RS.3.RS-27174/V2"
        },
        {
            "doi": "10.1186/S12859-020-03574-7",
            "metadata": {
                "abstract": "Background: The interactions between proteins and aptamers are prevalent in organisms and play an important role in various life activities. Thanks to the rapid accumulation of protein-aptamer interaction data, it is necessary and feasible to construct an accurate and effective computational model to predict aptamers binding to certain interested proteins and protein-aptamer interactions, which is beneficial for understanding mechanisms of protein-aptamer interactions and improving aptamer-based therapies. Results: In this study, a novel web server named PPAI is developed to predict aptamers and protein-aptamer interactions with key sequence features of proteins/aptamers and a machine learning framework integrated adaboost and random forest. A new method for extracting several key sequence features of both proteins and aptamers is presented, where the features for proteins are extracted from amino acid composition, pseudo-amino acid composition, grouped amino acid composition, C/T/D composition and sequence-order-coupling number, while the features for aptamers are extracted from nucleotide composition, pseudo-nucleotide composition (PseKNC) and normalized Moreau-Broto autocorrelation coefficient. On the basis of these feature sets and balanced the samples with SMOTE algorithm, we validate the performance of PPAI by the independent test set. The results demonstrate that the Area Under Curve (AUC) is 0.907 for prediction of aptamer, while the AUC reaches 0.871 for prediction of protein-aptamer interactions. Conclusion: These results indicate that PPAI can query aptamers and proteins, predict aptamers and predict protein-aptamer interactions in batch mode precisely and efficiently, which would be a novel bioinformatics tool for the research of protein-aptamer interactions. PPAI web-server is freely available at http://39.96.85.9/PPAI.",
                "authors": [
                    {
                        "name": "Gu J."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Ma X."
                    }
                ],
                "citationCount": 14,
                "date": "2020-06-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PPAI: A web server for predicting protein-aptamer interactions"
            },
            "pmcid": "PMC7285591",
            "pmid": "32517696"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
