{
    "additionDate": "2022-06-25T14:11:22.410772Z",
    "biotoolsCURIE": "biotools:fanet",
    "biotoolsID": "fanet",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Nikhil Kumar Tomar"
        }
    ],
    "description": "A Feedback Attention Network for Improved Biomedical Image Segmentation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nikhilroxtomar/FANet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T16:01:06.333070Z",
    "license": "Not licensed",
    "name": "FANet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tnnls.2022.3159394",
            "metadata": {
                "abstract": "The increase of available large clinical and experimental datasets has contributed to a substantial amount of important contributions in the area of biomedical image analysis. Image segmentation, which is crucial for any quantitative analysis, has especially attracted attention. Recent hardware advancement has led to the success of deep learning approaches. However, although deep learning models are being trained on large datasets, existing methods do not use the information from different learning epochs effectively. In this work, we leverage the information of each training epoch to prune the prediction maps of the subsequent epochs. We propose a novel architecture called feedback attention network (FANet) that unifies the previous epoch mask with the feature map of the current training epoch. The previous epoch mask is then used to provide hard attention to the learned feature maps at different convolutional layers. The network also allows rectifying the predictions in an iterative fashion during the test time. We show that our proposed feedback attention model provides a substantial improvement on most segmentation metrics tested on seven publicly available biomedical imaging datasets demonstrating the effectiveness of FANet. The source code is available at https://github.com/nikhilroxtomar/FANet.",
                "authors": [
                    {
                        "name": "Ali S."
                    },
                    {
                        "name": "Halvorsen P."
                    },
                    {
                        "name": "Jha D."
                    },
                    {
                        "name": "Johansen D."
                    },
                    {
                        "name": "Johansen H.D."
                    },
                    {
                        "name": "Riegler M.A."
                    },
                    {
                        "name": "Rittscher J."
                    },
                    {
                        "name": "Tomar N.K."
                    }
                ],
                "citationCount": 52,
                "date": "2023-11-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "FANet: A Feedback Attention Network for Improved Biomedical Image Segmentation"
            },
            "pmid": "35333723"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
