{
    "additionDate": "2024-06-17T18:53:33.083130Z",
    "biotoolsCURIE": "biotools:depicter_deep",
    "biotoolsID": "depicter_deep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "eduard.chelebian@it.uu.se",
            "name": "Eduard Chelebian",
            "orcidid": "https://orcid.org/0000-0001-6852-6605",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep representation clustering for histology annotation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Box-Whisker plot plotting",
                    "uri": "http://edamontology.org/operation_2943"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eduardchelebian/depicter",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:55:02.733965Z",
    "name": "DEPICTER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2024.108026",
            "metadata": {
                "abstract": "Automatic segmentation of histopathology whole-slide images (WSI) usually involves supervised training of deep learning models with pixel-level labels to classify each pixel of the WSI into tissue regions such as benign or cancerous. However, fully supervised segmentation requires large-scale data manually annotated by experts, which can be expensive and time-consuming to obtain. Non-fully supervised methods, ranging from semi-supervised to unsupervised, have been proposed to address this issue and have been successful in WSI segmentation tasks. But these methods have mainly been focused on technical advancements in algorithmic performance rather than on the development of practical tools that could be used by pathologists or researchers in real-world scenarios. In contrast, we present DEPICTER (Deep rEPresentatIon ClusTERing), an interactive segmentation tool for histopathology annotation that produces a patch-wise dense segmentation map at WSI level. The interactive nature of DEPICTER leverages self- and semi-supervised learning approaches to allow the user to participate in the segmentation producing reliable results while reducing the workload. DEPICTER consists of three steps: first, a pretrained model is used to compute embeddings from image patches. Next, the user selects a number of benign and cancerous patches from the multi-resolution image. Finally, guided by the deep representations, label propagation is achieved using our novel seeded iterative clustering method or by directly interacting with the embedding space via feature space gating. We report both real-time interaction results with three pathologists and evaluate the performance on three public cancer classification dataset benchmarks through simulations. The code and demos of DEPICTER are publicly available at https://github.com/eduardchelebian/depicter.",
                "authors": [
                    {
                        "name": "Avenel C."
                    },
                    {
                        "name": "Chelebian E."
                    },
                    {
                        "name": "Ciompi F."
                    },
                    {
                        "name": "Wahlby C."
                    }
                ],
                "date": "2024-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DEPICTER: Deep representation clustering for histology annotation"
            },
            "pmid": "38308865"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
