{
    "additionDate": "2021-03-19T09:07:06Z",
    "biotoolsCURIE": "biotools:pics2",
    "biotoolsID": "pics2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kim.taylor@ucsf.edu",
            "name": "Kimberly E Taylor",
            "typeEntity": "Person"
        }
    ],
    "description": "Next-generation fine mapping via probabilistic identification of causal SNPs.\n\nLD-based PICS Probabilities for Index SNPs.\n\nOriginal PICS functionality extended with batch processing; result file download; 1000 Genomes Reference data for ALL, EUR, EAS, SAS, AFR, and AMR populations; and GRCh38 positions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "https://pics2.ucsf.edu",
    "lastUpdate": "2024-11-24T20:38:16.894040Z",
    "name": "PICS2",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab122",
            "metadata": {
                "abstract": "Summary: The Probabilistic Identification of Causal SNPs (PICS) algorithm and web application was developed as a fine-mapping tool to determine the likelihood that each single nucleotide polymorphism (SNP) in LD with a reported index SNP is a true causal polymorphism. PICS is notable for its ability to identify candidate causal SNPs within a locus using only the index SNP, which are widely available from published GWAS, whereas other methods require full summary statistics or full genotype data. However, the original PICS web application operates on a single SNP at a time, with slow performance, severely limiting its usability. We have developed a next-generation PICS tool, PICS2, which enables performance of PICS analyses of large batches of index SNPs with much faster performance. Additional updates and extensions include use of LD reference data generated from 1000 Genomes phase 3; annotation of variant consequences; annotation of GTEx eQTL genes and downloadable PICS SNPs from GTEx eQTLs; the option of generating PICS probabilities from experimental summary statistics; and generation of PICS SNPs from all SNPs of the GWAS catalog, automatically updated weekly. These free and easy-to-use resources will enable efficient determination of candidate loci for biological studies to investigate the true causal variants underlying disease processes.",
                "authors": [
                    {
                        "name": "Criswell L.A."
                    },
                    {
                        "name": "Farh K.K.-H."
                    },
                    {
                        "name": "Mark Ansel K."
                    },
                    {
                        "name": "Marson A."
                    },
                    {
                        "name": "Taylor K.E."
                    }
                ],
                "citationCount": 19,
                "date": "2021-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PICS2: next-generation fine mapping via probabilistic identification of causal SNPs"
            },
            "pmcid": "PMC8528038",
            "pmid": "33624747"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
