{
    "additionDate": "2015-01-22T11:35:47Z",
    "biotoolsCURIE": "biotools:svm2",
    "biotoolsID": "svm2",
    "credit": [
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "david.horner@unimi.it",
            "name": "David Horner",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "matteo.chiara@unimi.it",
            "name": "Matteo Chiara",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Detection and characterization of genomic structural variation (SV) from ultra high-throughput genome resequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "http://159.149.160.53/pub/svm2",
    "homepage_status": 1,
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "CC-BY-NC-3.0",
    "maturity": "Mature",
    "name": "SVM2",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-ITA-MILANO",
    "publication": [
        {
            "doi": "10.1093/nar/gks606",
            "metadata": {
                "abstract": "Several bioinformatics methods have been proposed for the detection and characterization of genomic structural variation (SV) from ultra highthroughput genome resequencing data. Recent surveys show that comprehensive detection of SV events of different types between an individual resequenced genome and a reference sequence is best achieved through the combination of methods based on different principles (split mapping, reassembly, read depth, insert size, etc.). The improvement of individual predictors is thus an important objective. In this study, we propose a new method that combines deviations from expected library insert sizes and additional information from local patterns of read mapping and uses supervised learning to predict the position and nature of structural variants. We show that our approach provides greatly increased sensitivity with respect to other tools based on paired end read mapping at no cost in specificity, and it makes reliable predictions of very short insertions and deletions in repetitive and low-complexity genomic contexts that can confound tools based on split mapping of reads. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Chiara M."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Horner D.S."
                    }
                ],
                "citationCount": 10,
                "date": "2012-10-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SVM2: An improved paired-end-based tool for the detection of small genomic structural variations using high-throughput single-genome resequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}