{
    "additionDate": "2021-10-25T07:40:56.429160Z",
    "biotoolsCURIE": "biotools:nhkcr",
    "biotoolsID": "nhkcr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jiangning.Song@monash.edu",
            "name": "Guoguang Ying",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "chenzhen-win2009@163.com",
            "name": "Zhen Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yingguoguang@gmail.com",
            "name": "Jiangning Song",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "nhKcr is a bioinformatics tool for predicting crotonylation sites on human nonhistone proteins based on deep learning. Lysine crotonylation (Kcr) is a newly discovered type of protein post-translational modification and has been reported to be involved in various pathophysiological processes. High-resolution mass spectrometry is the primary approach for identification of Kcr sites. However, experimental approaches for identifying Kcr sites are often time-consuming and expensive when compared with computational approaches. To date, several predictors for Kcr site prediction have been developed, most of which are capable of predicting crotonylation sites on either histones alone or mixed histone and nonhistone proteins together. These methods exhibit high diversity in their algorithms, encoding schemes, feature selection techniques and performance assessment strategies. However, none of them were designed for predicting Kcr sites on nonhistone proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://nhkcr.erc.monash.edu/index.php?page=help"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://nhkcr.erc.monash.edu/index.php?page=download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://nhkcr.erc.monash.edu/",
    "lastUpdate": "2024-11-24T20:17:28.778839Z",
    "name": "nhKcr",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bib/bbab146",
            "metadata": {
                "abstract": "Lysine crotonylation (Kcr) is a newly discovered type of protein post-translational modification and has been reported to be involved in various pathophysiological processes. High-resolution mass spectrometry is the primary approach for identification of Kcr sites. However, experimental approaches for identifying Kcr sites are often time-consuming and expensive when compared with computational approaches. To date, several predictors for Kcr site prediction have been developed, most of which are capable of predicting crotonylation sites on either histones alone or mixed histone and nonhistone proteins together. These methods exhibit high diversity in their algorithms, encoding schemes, feature selection techniques and performance assessment strategies. However, none of them were designed for predicting Kcr sites on nonhistone proteins. Therefore, it is desirable to develop an effective predictor for identifying Kcr sites from the large amount of nonhistone sequence data. For this purpose, we first provide a comprehensive review on six methods for predicting crotonylation sites. Second, we develop a novel deep learning-based computational framework termed as CNNrgb for Kcr site prediction on nonhistone proteins by integrating different types of features. We benchmark its performance against multiple commonly used machine learning classifiers (including random forest, logitboost, naïve Bayes and logistic regression) by performing both 10-fold cross-validation and independent test. The results show that the proposed CNNrgb framework achieves the best performance with high computational efficiency on large datasets. Moreover, to facilitate users' efforts to investigate Kcr sites on human nonhistone proteins, we implement an online server called nhKcr and compare it with other existing tools to illustrate the utility and robustness of our method. The nhKcr web server and all the datasets utilized in this study are freely accessible at http://nhKcr.erc.monash.edu/.",
                "authors": [
                    {
                        "name": "Chen Y.-Z."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Z.-Z."
                    },
                    {
                        "name": "Ying G."
                    }
                ],
                "citationCount": 37,
                "date": "2021-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "nhKcr: A new bioinformatics tool for predicting crotonylation sites on human nonhistone proteins based on deep learning"
            },
            "pmcid": "PMC8768455",
            "pmid": "34002774",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
