{"credit":[{"name":"upf.edu","typeEntity":"Institute","typeRoles":["Provider"]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.intogen.org/about"}],"documentation":[{"type":"GENERAL","url":"https://www.intogen.org/about"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"© 2015 Elsevier Inc. Large efforts dedicated to detect somatic alterations across tumor genomes/exomes are expected to produce significant improvements in precision cancer medicine. However, high inter-tumor heterogeneity is a major obstacle to developing and applying therapeutic targeted agents to treat most cancer patients. Here, we offer a comprehensive assessment of the scope of targeted therapeutic agents in a large pan-cancer cohort. We developed an insilico prescription strategy based on identification of the driver alterations in each tumor and their druggability options. Although relatively few tumors are tractable by approved agents following clinical guidelines (5.9%), up to 40.2% could benefit from different repurposing options, and up to 73.3% considering treatments currently under clinical investigation. We also identified 80 therapeutically targetable cancer genes.","authors":["Rubio-Perez C.","Tamborero D.","Schroeder M.P.","Antolin A.A.","Deu-Pons J.","Perez-Llamas C.","Mestres J.","Gonzalez-Perez A.","Lopez-Bigas N."],"cit_count":136,"doi":"10.1016/j.ccell.2015.02.007","journal":"Cancer Cell","title":"In Silico Prescription of Anticancer Drugs to Cohorts of 28 Tumor Types Reveals Targeting Opportunities","type":"Primary","year":"2015-01-01"},{"abstract":"The IntOGen-mutations platform (http://www.intogen.org/mutations/) summarizes somatic mutations, genes and pathways involved in tumorigenesis. It identifies and visualizes cancer drivers, analyzing 4,623 exomes from 13 cancer sites. It provides support to cancer researchers, aids the identification of drivers across tumor cohorts and helps rank mutations for better clinical decision-making. © 2013 Nature America, Inc. All rights reserved.","authors":["Gonzalez-Perez A.","Perez-Llamas C.","Deu-Pons J.","Tamborero D.","Schroeder M.P.","Jene-Sanz A.","Santos A.","Lopez-Bigas N."],"cit_count":179,"doi":"10.1038/nmeth.2642","journal":"Nature Methods","title":"IntOGen-mutations identifies cancer drivers across tumor types","type":"Other","year":"2013-11-01"}],"summary":{"biotoolsCURIE":"biotools:intogen","biotoolsID":"intogen","description":"Collect and analyse somatic mutations in thousands of tumor genomes to identify cancer driver genes.","homepage":"http://www.intogen.org/","name":"Intogen"}}