{
    "additionDate": "2022-07-20T06:43:01.325216Z",
    "biotoolsCURIE": "biotools:deep6mapred",
    "biotoolsID": "deep6mapred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guohuahhn@163.com",
            "name": "Guohua Huang"
        },
        {
            "name": "Xingyu Tang"
        }
    ],
    "description": "A CNN and Bi-LSTM-based deep learning method for predicting DNA N6-methyladenosine sites across plant species.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://106.13.196.152:7001/",
    "lastUpdate": "2024-11-24T15:54:08.523498Z",
    "license": "Not licensed",
    "name": "Deep6mAPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ymeth.2022.04.011",
            "metadata": {
                "abstract": "DNA N6-methyladenine (6mA) is a key DNA modification, which plays versatile roles in the cellular processes, including regulation of gene expression, DNA repair, and DNA replication. DNA 6mA is closely associated with many diseases in the mammals and with growth as well as development of plants. Precisely detecting DNA 6mA sites is of great importance to exploration of 6mA functions. Although many computational methods have been presented for DNA 6mA prediction, there is still a wide gap in the practical application. We presented a convolution neural network (CNN) and bi-directional long-short term memory (Bi-LSTM)-based deep learning method (Deep6mAPred) for predicting DNA 6mA sites across plant species. The Deep6mAPred stacked the CNNs and the Bi-LSTMs in a paralleling manner instead of a series-connection manner. The Deep6mAPred also employed the attention mechanism for improving the representations of sequences. The Deep6mAPred reached an accuracy of 0.9556 over the independent rice dataset, far outperforming the state-of-the-art methods. The tests across plant species showed that the Deep6mAPred is of a remarkable advantage over the state of the art methods. We developed a user-friendly web application for DNA 6mA prediction, which is freely available at http://106.13.196.152:7001/ for all the scientific researchers. The Deep6mAPred would enrich tools to predict DNA 6mA sites and speed up the exploration of DNA modification.",
                "authors": [
                    {
                        "name": "Huang G."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Tang X."
                    },
                    {
                        "name": "Wei D.-Q."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Zheng P."
                    }
                ],
                "citationCount": 22,
                "date": "2022-08-01T00:00:00Z",
                "journal": "Methods",
                "title": "Deep6mAPred: A CNN and Bi-LSTM-based deep learning method for predicting DNA N6-methyladenosine sites across plant species"
            },
            "pmid": "35477057"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
