{
    "additionDate": "2018-06-30T20:42:18Z",
    "biotoolsCURIE": "biotools:vesiclepedia",
    "biotoolsID": "vesiclepedia",
    "credit": [
        {
            "email": "hadi.valadi@gu.se",
            "name": "Hadi Valadi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Manually curated compendium of molecular data (lipid, RNA and protein) identified in different classes of extracellular vesicles.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "http://microvesicles.org/credits"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://microvesicles.org/index.html",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "Vesiclepedia",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0195969",
            "metadata": {
                "abstract": "© 2018 Statello et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The RNA that is packaged into exosomes is termed as exosomal-shuttle RNA (esRNA); however, the players, which take this subset of RNA (esRNA) into exosomes, remain largely unknown. We hypothesized that RNA binding proteins (RBPs) could serve as key players in this mechanism, by making complexes with RNAs and transporting them into exosomes during the biosynthesis of exosomes. Here, we demonstrate the presence of 30 RBPs in exosomes that were shown to form RNA–RBP complexes with both cellular RNA and exosomal-RNA species. To assess the involvement of these RBPs in RNA-transfer into exosomes, the gene transcripts encoding six of the proteins identified in exosomes (HSP90AB1, XPO5, hnRNPH1, hnRNPM, hnRNPA2B1, and MVP) were silenced by siRNA and subsequent effect on esRNA was assessed. A significant reduction of total esRNA was observed by post-transcriptional silencing of MVP, compared to other RBPs. Furthermore, to confirm the binding of MVP with esRNA, a biotinylated-MVP was transiently expressed in HEK293F cells. Higher levels of esRNA were recovered from MVP that was eluted from exosomes of transfected cells, as compared to those of non-transfected cells. Our data indicate that these RBPs could end up in exosomes together with RNA molecules in the form of RNA–ribonu-cleoprotein complexes, which could be important for the transport of RNAs into exosomes and the maintenance of RNAs inside exosomes. This type of maintenance may favor the shuttling of RNAs from exosomes to recipient cells in the form of stable complexes.",
                "authors": [
                    {
                        "name": "Statello L."
                    },
                    {
                        "name": "Maugeri M."
                    },
                    {
                        "name": "Garre E."
                    },
                    {
                        "name": "Nawaz M."
                    },
                    {
                        "name": "Wahlgren J."
                    },
                    {
                        "name": "Papadimitriou A."
                    },
                    {
                        "name": "Lundqvist C."
                    },
                    {
                        "name": "Lindfors L."
                    },
                    {
                        "name": "Collen A."
                    },
                    {
                        "name": "Sunnerhagen P."
                    },
                    {
                        "name": "Ragusa M."
                    },
                    {
                        "name": "Purrello M."
                    },
                    {
                        "name": "Pietro C.D."
                    },
                    {
                        "name": "Tigue N."
                    },
                    {
                        "name": "Valadi H."
                    }
                ],
                "citationCount": 54,
                "date": "2018-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Identification of RNA-binding proteins in exosomes capable of interacting with different types of RNA: RBP-facilitated transport of RNAs into exosomes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}