{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T16:20:35Z",
    "biotoolsCURIE": "biotools:Comorbidity4j",
    "biotoolsID": "Comorbidity4j",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fr.ronzano@gmail.com",
            "name": "Francesco Ronzano",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for interactive analysis of disease comorbidities over large patient datasets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://comorbidity4j.readthedocs.io/en/latest/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/fra82/comorbidity4j/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://comorbidity.eu/comorbidity4web/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/fra82/comorbidity4j/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/fra82/comorbidity4j"
        }
    ],
    "maturity": "Mature",
    "name": "Comorbidity4j",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz061",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Pushed by the growing availability of Electronic Health Records for data mining, the identification of relevant patterns of co-occurring diseases over a population of individuals - referred to as comorbidity analysis - has become a common practice due to its great impact on life expectancy, quality of life and healthcare costs. In this scenario, the availability of scalable, easy-to-use software frameworks tailored to support the study of comorbidities over large datasets of patients is essential. We introduce Comorbidity4j, an open-source Java tool to perform systematic analyses of comorbidities by generating interactive Web visualizations to explore and refine results. Comorbidity4j processes user-provided clinical data by identifying significant disease co-occurrences and computing a comprehensive set of comorbidity indices. Patients can be stratified by sex, age and user-defined criteria. Comorbidity4j supports the analysis of the temporal directionality and the sex ratio of diseases. The incremental upload and validation of clinical input data and the customization of comorbidity analyses are performed by an interactive Web interface. With a Web browser, the results of such analyses can be filtered with respect to comorbidity indexes and disease names and explored by means of heat maps and network charts of disease associations. Comorbidity4j is optimized to efficiently process large datasets of clinical data. Besides a software tool for local execution, we provide Comorbidity4j as a Web service to enable users to perform online comorbidity analyses. Availability and implementation: Doc: http://comorbidity4j.readthedocs.io/; Source code: https://github.com/fra82/comorbidity4j, Web tool: http://comorbidity.eu/comorbidity4web/.",
                "authors": [
                    {
                        "name": "Furlong L.I."
                    },
                    {
                        "name": "Gutierrez-Sacristan A."
                    },
                    {
                        "name": "Ronzano F."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comorbidity4j: A tool for interactive analysis of disease comorbidities over large patient datasets"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}
