{"credit":[{"email":"gdevailly@hotmail.com","name":"Guillaume Devailly","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/manuals/scFeatureFilter/man/scFeatureFilter.pdf"}],"download":[{"url":"http://bioconductor.org/packages/release/bioc/src/contrib/scFeatureFilter_1.0.0.tar.gz"}],"function":[{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"collectionID":["BioConductor"],"cost":"Free of charge","language":["R"],"license":"MIT","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"}]},"link":[{"type":"MIRROR","url":"http://bioconductor.org/packages/scFeatureFilter/"}],"publication":[{"abstract":"© 2018, Springer International Publishing AG, part of Springer Nature. Single cell RNA sequencing is becoming increasingly popular due to rapidly evolving technology, decreasing costs and its wide applicability. However, the technology suffers from high drop-out rate and high technical noise, mainly due to the low starting material. This hinders the extraction of biological variability, or signal, from the data. One of the first steps in the single cell analysis pipelines is, therefore, to filter the data to keep the most informative features only. This filtering step is often done by arbitrarily selecting a threshold. In order to establish a data-driven approach for the feature filtering step, we developed an R package, scFeatureFilter, which uses the lack of correlation between features as a proxy for the presence of high technical variability. As a result, the tool filters the input data, selecting for the features where the biological variability is higher than technical noise.","authors":["Arzalluz-Luque A.","Devailly G.","Joshi A."],"cit_count":0,"doi":"10.1007/978-3-319-78723-7_31","journal":"Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)","title":"scFeatureFilter: Correlation-based feature filtering for single-cell RNAseq","type":"Primary","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:scfeaturefilter","biotoolsID":"scfeaturefilter","description":"An R implementation of the correlation-based method developed in the Joshi laboratory to analyse and filter processed single-cell RNAseq data. It returns a filtered version of the data containing only genes expression values unaffected by systematic noise.","homepage":"http://bioconductor.org/packages/release/bioc/html/scFeatureFilter.html","name":"scFeatureFilter","version":["1.0.0"]}}