{
    "additionDate": "2021-01-18T11:04:10Z",
    "biotoolsCURIE": "biotools:expath",
    "biotoolsID": "expath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sbchang@mail.ncku.edu.tw",
            "name": "Song-Bin Chang",
            "typeEntity": "Person"
        },
        {
            "email": "sarah321@mail.ncku.edu.tw",
            "name": "Wen-Chi Chang",
            "typeEntity": "Person"
        }
    ],
    "description": "EXPath is a database resource that collects and utilizes expression profiles derived from microarray under various conditions to infer metabolic pathways for six model plants: Arabidopsis thaliana, Oryza sativa, Zea mays, Solanum lycopersicum, Glycine max, and Medicago truncatula. Five main functions in EXPath are as follows.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://EXPath.itps.ncku.edu.tw",
    "lastUpdate": "2021-03-08T10:28:26Z",
    "name": "EXPath",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/PCP/PCAA115",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Co-expressed genes tend to have regulatory relationships and participate in similar biological processes. Construction of gene correlation networks from microarray or RNA-seq expression data has been widely applied to study transcriptional regulatory mechanisms and metabolic pathways under specific conditions. Furthermore, since transcription factors (TFs) are critical regulators of gene expression, it is worth investigating TFs on the promoters of co-expressed genes. Although coexpressed genes and their related metabolic pathways can be easily identified from previous resources, such as EXPath and EXPath Tool, this information is not simultaneously available to identify their regulatory TFs. EXPath 2.0 is an updated database for the investigation of regulatory mechanisms in various plant metabolic pathways with 1,881 microarray and 978 RNA-seq samples. There are six significant improvements in EXPath 2.0: (i) the number of species has been extended from three to six to include Arabidopsis, rice, maize, Medicago, soybean and tomato; (ii) gene expression at various developmental stages have been added; (iii) construction of correlation networks according to a group of genes is available; (iv) hierarchical figures of the enriched Gene Ontology (GO) terms are accessible; (v) promoter analysis of genes in a metabolic pathway or correlation network is provided; and (vi) user's gene expression data can be uploaded and analyzed. Thus, EXPath 2.0 is an updated platform for investigating gene expression profiles and metabolic pathways under specific conditions. It facilitates users to access the regulatory mechanisms of plant biological processes. The new version is available at http://EXPath.itps.ncku.edu.tw.",
                "authors": [
                    {
                        "name": "Tseng K.-C."
                    },
                    {
                        "name": "Li G.-Z."
                    },
                    {
                        "name": "Hung Y.-C."
                    },
                    {
                        "name": "Chow C.-N."
                    },
                    {
                        "name": "Wu N.-Y."
                    },
                    {
                        "name": "Chie Y.-Y."
                    },
                    {
                        "name": "Zheng H.-Q."
                    },
                    {
                        "name": "Lee T.-Y."
                    },
                    {
                        "name": "Kuo P.-L."
                    },
                    {
                        "name": "Chang S.-B."
                    },
                    {
                        "name": "Chang W.-C."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Plant and Cell Physiology",
                "title": "EXPath 2.0: An Updated Database for Integrating High-Throughput Gene Expression Data with Biological Pathways"
            },
            "pmid": "32898258",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        },
        {
            "doi": "10.1186/1471-2164-16-S2-S6",
            "metadata": {
                "abstract": "© 2015 Chien et al.; licensee BioMed Central Ltd.Background: In general, the expression of gene alters conditionally to catalyze a specific metabolic pathway. Microarray-based datasets have been massively produced to monitor gene expression levels in parallel with numerous experimental treatments. Although several studies facilitated the linkage of gene expression data and metabolic pathways, none of them are amassed for plants. Moreover, advanced analysis such as pathways enrichment or how genes express under different conditions is not rendered.Description: Therefore, EXPath was developed to not only comprehensively congregate the public microarray expression data from over 1000 samples in biotic stress, abiotic stress, and hormone secretion but also allow the usage of this abundant resource for coexpression analysis and differentially expression genes (DEGs) identification, finally inferring the enriched KEGG pathways and gene ontology (GO) terms of three model plants: Arabidopsis thaliana, Oryza sativa, and Zea mays. Users can access the gene expression patterns of interest under various conditions via five main functions (Gene Search, Pathway Search, DEGs Search, Pathways/GO Enrichment, and Coexpression analysis) in EXPath, which are presented by a user-friendly interface and valuable for further research.Conclusions: In conclusion, EXPath, freely available at http://expath.itps.ncku.edu.tw, is a database resource that collects and utilizes gene expression profiles derived from microarray platforms under various conditions to infer metabolic pathways for plants.",
                "authors": [
                    {
                        "name": "Chien C.-H."
                    },
                    {
                        "name": "Chow C.-N."
                    },
                    {
                        "name": "Wu N.-Y."
                    },
                    {
                        "name": "Chiang-Hsieh Y.-F."
                    },
                    {
                        "name": "Hou P.-F."
                    },
                    {
                        "name": "Chang W.-C."
                    }
                ],
                "citationCount": 25,
                "date": "2015-01-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "EXPath: A database of comparative expression analysis inferring metabolic pathways for plants"
            },
            "pmcid": "PMC4331720",
            "pmid": "25708775",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "version": [
        "2.0"
    ]
}