{
    "additionDate": "2023-03-17T17:24:20.701026Z",
    "biotoolsCURIE": "biotools:deepad",
    "biotoolsID": "deepad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "krishdesaiedu@gmail.com",
            "name": "Krish Desai",
            "typeEntity": "Person"
        },
        {
            "email": "sumaddurycollege2024@gmail.com",
            "name": "Sucheer Maddury",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning application for predicting amyloid standardized uptake value ratio through PET for Alzheimer's prognosis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://deepad.herokuapp.com/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-17T17:24:20.705901Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sumaddury/Amyloid-PET-SUVR-Quantification"
        }
    ],
    "name": "DeepAD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FRAI.2023.1091506",
            "metadata": {
                "abstract": "Introduction: Amyloid deposition is a vital biomarker in the process of Alzheimer's diagnosis. 18F-florbetapir PET scans can provide valuable imaging data to determine cortical amyloid quantities. However, the process is labor and doctor intensive, requiring extremely specialized education and resources that may not be accessible to everyone, making the amyloid calculation process inefficient. Deep learning is a rising tool in Alzheimer's research which could be used to determine amyloid deposition. Materials and methods: Using data from the Alzheimer's Disease Neuroimaging Initiative, we identified 2,980 patients with PET imaging, clinical, and genetic data. We tested various ResNet, EfficientNet, and RegNet convolutional neural networks and later combined the best performing model with Gradient Boosting Decision Tree algorithms to predict standardized uptake value ratio (SUVR) of amyloid in each patient session. We tried several configurations to find the best model tuning for regression-to-SUVR. Results: We found that the RegNet X064 architecture combined with a grid search-tuned Gradient Boosting Decision Tree with 3 axial input slices and clinical and genetic data achieved the lowest loss. Using the mean-absolute-error metric, the loss converged to an MAE of 0.0441, equating to 96.4% accuracy across the 596-patient test set. Discussion: We showed that this method is more consistent and accessible in comparison to human readers from previous studies, with lower margins of error and substantially faster calculation times. We implemented our deep learning model on to a web application named DeepAD which allows our diagnostic tool to be accessible. DeepAD could be used in hospitals and clinics with resource limitations for amyloid deposition and shows promise for more imaging tasks as well.",
                "authors": [
                    {
                        "name": "Desai K."
                    },
                    {
                        "name": "Maddury S."
                    }
                ],
                "date": "2023-02-06T00:00:00Z",
                "journal": "Frontiers in Artificial Intelligence",
                "title": "DeepAD: A deep learning application for predicting amyloid standardized uptake value ratio through PET for Alzheimer's prognosis"
            },
            "pmcid": "PMC9939778",
            "pmid": "36815006"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
