{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T21:16:56.455664Z",
    "biotoolsCURIE": "biotools:rdmaster",
    "biotoolsID": "rdmaster",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hmli@zju.edu.cn",
            "name": "Haomin Li",
            "orcidid": "https://orcid.org/0000-0002-6420-7719",
            "typeEntity": "Person"
        },
        {
            "name": "Jian Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel phenotype-oriented dialogue system supporting differential diagnosis of rare disease.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://rdmaster.nbscn.org/",
    "lastUpdate": "2024-11-24T13:52:49.790896Z",
    "name": "RDmaster",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2024.107924",
            "metadata": {
                "abstract": "Background: Clinicians often lack the necessary expertise to differentially diagnose multiple underlying rare diseases (RDs) due to their complex and overlapping clinical features, leading to misdiagnoses and delayed treatments. The aim of this study is to develop a novel electronic differential diagnostic support system for RDs. Method: Through integrating two Bayesian diagnostic methods, a candidate list was generated with enhance clinical interpretability for the further Q&A based differential diagnosis (DDX). To achieve an efficient Q&A dialogue strategy, we introduce a novel metric named the adaptive information gain and Gini index (AIGGI) to evaluate the expected gain of interrogated phenotypes within real-time diagnostic states. Results: This DDX tool called RDmaster has been implemented as a web-based platform (http://rdmaster.nbscn.org/). A diagnostic trial involving 238 published RD patients revealed that RDmaster outperformed existing RD diagnostic tools, as well as ChatGPT, and was shown to enhance the diagnostic accuracy through its Q&A system. Conclusions: The RDmaster offers an effective multi-omics differential diagnostic technique and outperforms existing tools and popular large language models, particularly enhancing differential diagnosis in collecting diagnostically beneficial phenotypes.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Duan H."
                    },
                    {
                        "name": "Han M."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Pan J."
                    },
                    {
                        "name": "Shu L."
                    },
                    {
                        "name": "Shu Q."
                    },
                    {
                        "name": "Tan L."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Yuan T."
                    }
                ],
                "citationCount": 1,
                "date": "2024-02-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "RDmaster: A novel phenotype-oriented dialogue system supporting differential diagnosis of rare disease"
            },
            "pmid": "38181610"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
