{
    "additionDate": "2021-01-18T11:03:30Z",
    "biotoolsCURIE": "biotools:ictc-raac",
    "biotoolsID": "ictc-raac",
    "confidence_flag": "tool",
    "description": "An improved web predictor for identifying the types of ion channel-targeted conotoxins by using reduced amino acid cluster descriptors.\n\nIdentifying the ion channel-targeted conotoxins using reduced amino acid alphabet composition.\n\nConotoxins are small peptide toxins which are rich in disulfide and have the unique diversity of sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://bioinfor.imu.edu.cn/ictcraac",
    "lastUpdate": "2021-02-02T07:37:43Z",
    "name": "ICTC-RAAC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2020.107371",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdConotoxins are small peptide toxins which are rich in disulfide and have the unique diversity of sequences. It is significant to correctly identify the types of ion channel-targeted conotoxins because that they are considered as the optimal pharmacological candidate medicine in drug design owing to their ability specifically binding to ion channels and interfering with neural transmission. Comparing with other feature extracting methods, the reduced amino acid cluster (RAAC) better resolved in simplifying protein complexity and identifying functional conserved regions. Thus, in our study, 673 RAACs generated from 74 types of reduced amino acid alphabet were comprehensively assessed to establish a state-of-the-art predictor for predicting ion channel-targeted conotoxins. The results showed Type 20, Cluster 9 (T = 20, C = 9) in the tripeptide composition (N = 3) achieved the best accuracy, 89.3%, which was based on the algorithm of amino acids reduction of variance maximization. Further, the ANOVA with incremental feature selection (IFS) was used for feature selection to improve prediction performance. Finally, the cross-validation results showed that the best overall accuracy we calculated was 96.4% and 1.8% higher than the best accuracy of previous studies. Based on the predictor we proposed, a user-friendly webserver was established and can be friendly accessed at http://bioinfor.imu.edu.cn/ictcraac.",
                "authors": [
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Zheng L."
                    },
                    {
                        "name": "Liang P."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Zuo Y."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "ICTC-RAAC: An improved web predictor for identifying the types of ion channel-targeted conotoxins by using reduced amino acid cluster descriptors"
            },
            "pmid": "32950852"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}