{
    "accessibility": "Open access",
    "additionDate": "2019-05-21T07:30:56Z",
    "biotoolsCURIE": "biotools:CERENKOV2",
    "biotoolsID": "CERENKOV2",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "stephen.ramsey@oregonstate.edu",
            "name": "Stephen Ramsey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software pipeline and associated machine-learning framework for identifying regulatory single nucleotide polymorphisms (rSNPs) in the noncoding genome for post-analysis of genetic regions identified in genome-wide association studies (GWAS).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ramseylab/cerenkov",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Apache-2.0",
    "maturity": "Emerging",
    "name": "CERENKOV2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2637-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: We previously reported on CERENKOV, an approach for identifying regulatory single nucleotide polymorphisms (rSNPs) that is based on 246 annotation features. CERENKOV uses the xgboost classifier and is designed to be used to find causal noncoding SNPs in loci identified by genome-wide association studies (GWAS). We reported that CERENKOV has state-of-the-art performance (by two traditional measures and a novel GWAS-oriented measure, AVGRANK) in a comparison to nine other tools for identifying functional noncoding SNPs, using a comprehensive reference SNP set (OSU17, 15,331 SNPs). Given that SNPs are grouped within loci in the reference SNP set and given the importance of the data-space manifold geometry for machine-learning model selection, we hypothesized that within-locus inter-SNP distances would have class-based distributional biases that could be exploited to improve rSNP recognition accuracy. We thus defined an intralocus SNP \"radius\" as the average data-space distance from a SNP to the other intralocus neighbors, and explored radius likelihoods for five distance measures. Results: We expanded the set of reference SNPs to 39,083 (the OSU18 set) and extracted CERENKOV SNP feature data. We computed radius empirical likelihoods and likelihood densities for rSNPs and control SNPs, and found significant likelihood differences between rSNPs and control SNPs. We fit parametric models of likelihood distributions for five different distance measures to obtain ten log-likelihood features that we combined with the 248-dimensional CERENKOV feature matrix. On the OSU18 SNP set, we measured the classification accuracy of CERENKOV with and without the new distance-based features, and found that the addition of distance-based features significantly improves rSNP recognition performance as measured by AUPVR, AUROC, and AVGRANK. Along with feature data for the OSU18 set, the software code for extracting the base feature matrix, estimating ten distance-based likelihood ratio features, and scoring candidate causal SNPs, are released as open-source software CERENKOV2. Conclusions: Accounting for the locus-specific geometry of SNPs in data-space significantly improved the accuracy with which noncoding rSNPs can be computationally identified.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Ramsey S.A."
                    },
                    {
                        "name": "Wei Q."
                    },
                    {
                        "name": "Yao Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-02-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CERENKOV2: Improved detection of functional noncoding SNPs using data-space geometric features"
            },
            "pmcid": "PMC6364436",
            "pmid": "30727967",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1,
    "version": [
        "v0.1-alpha"
    ]
}
