{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sandberg.cmb.ki.se/contact/"}],"documentation":[{"type":"GENERAL","url":"http://sandberg.cmb.ki.se/genomeclass/"}],"function":[{"operation":[{"term":"Sequence classification","uri":"http://edamontology.org/operation_2995"},{"term":"Sequence comparison","uri":"http://edamontology.org/operation_2451"}]}],"labels":{"language":["Python","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Mathematics","uri":"http://edamontology.org/topic_3315"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/genome-classifier-genomic-signature-classifier.html"}],"publication":[{"abstract":"Bacterial genomes have diverged during evolution, resulting in clearcut differences in their nucleotide composition, such as their GC content. The analysis of complete sequences of bacterial genomes also reveals the presence of nonrandom sequence variation, manifest in the frequency profile of specific short oligonucleotides. These frequency profiles constitute highly specific genomic signatures. Based on these differences in oligonucleotide frequency between bacterial genomes, we investigated the possibility of predicting the genome of origin for a specific genomic sequence. To this end, we developed a naïve Bayesian classifier and systematically analyzed 28 eubacterial and archaeal genomes. We found that sequences as short as 400 bases could be correctly classified with an accuracy of 85%. We then applied the classifier to the identification of horizontal gene transfer events in whole-genome sequences and demonstrated the validity of our approach by correctly predicting the transfer of both the superoxide dismutase (sodC) and the bioC gene from Haemophilus influenzae to Neisseria meningitis, correctly identifying both the donor and recipient species. We believe that this classification methodology could be a valuable tool in biodiversity studies.","authors":["Sandberg R.","Winberg G.","Branden C.-I.","Kaske A.","Ernberg I.","Coster J."],"cit_count":142,"journal":"Genome Research","pmid":"11483581","title":"Capturing whole-genome characteristics in short sequences using a naïve Bayesian classifier","year":"2001-09-01"}],"summary":{"biotoolsCURIE":"biotools:genome_classifier","biotoolsID":"genome_classifier","description":"Python/pyrex implementation of the Bayesian classifier of genomic signatures.","homepage":"http://sandberg.cmb.ki.se/genomeclass/","name":"Genome Classifier"}}