
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The Author(s)Purpose: DNA mismatch repair (MMR) genes play important roles in maintaining genome stability. Mutations in MMR genes disrupt their mismatch repair function, cause genome instability and lead to increased risk of cancer in the mutation carriers as represented by Lynch Syndrome. Studies have identified a large number of MMR variants, mostly in the Caucasian population, whereas data from non-Caucasian populations remain poorly illustrated. With the population size of 1.4 billion, knowledge of MMR variants in the Chinese population can be valuable in understanding the roles of ethnic MMR variation and cancer and to further guide clinical applications in MMR-related cancer prevention and treatment in the Chinese population. In this study, we systematically analysed the MMR variants from the Chinese population. Experimental design: We performed a comprehensive MMR data mining and collected all the MMR variation data reported from 33,998 Chinese individuals consisting of 23,938 cancer and 10,060 non-cancer cases between January 1997 to May 2019. For the collected data, we performed standardisation following Human Genome Variation Society nomenclature and reannotated the MMR variant data following American College of Medical Genetics and Genomics guidelines and comparing with non-Chinese MMR data on various aspects. Results: We identified a total of 540 MMR variants in the Chinese population, including 194 in MLH1, 181 in MSH2, 59 in MSH6, 53 in PMS2 single-base/indel changes and 53 large deletions/duplications in MLH1, MSH2, MSH6 and PMS2, respectively. We determined that the pathogenic/likely pathogenic carrier rate in the Chinese population was 1.6%. Comparative analysis in variant spectrum, variant types, clinical classification and founder mutations showed substantial differences of MMR variation between Chinese and non-Chinese populations and the fact that over 90% of the variants were only present in the Chinese ethnicity reveals the highly ethnic-specific nature of the Chinese MMR variation . We also developed an open-access database, dbMMR-Chinese, to host all data (https://dbMMR-chinese.fhs.um.edu.mo). The rich MMR data from a large non-Caucasian population should be valuable to study MMR variation and its relationship with cancer and provide a valuable reference resource for MMR-related cancer prevention and treatment. Conclusion: Our study provides the largest MMR data set from a single non-Caucasian population and reveals that MMR variation in the humans can be highly ethnic-specific.",
            "authors": [
                "Zhang L.",
                "Bhaskaran S.P.",
                "Huang T.",
                "Dong H.",
                "Chandratre K.",
                "Wu X.",
                "Qin Z.",
                "Wang X.",
                "Cao W.",
                "Chen T.",
                "Lynch H.",
                "Wang S.M."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.EJCA.2019.11.004",
            "journal": "European Journal of Cancer",
            "pmid": "31830689",
            "title": "Variants of DNA mismatch repair genes derived from 33,998 Chinese individuals with and without cancer reveal their highly ethnic-specific nature",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dbMMR-Chinese",
        "biotoolsID": "dbMMR-Chinese",
        "description": "Variants of DNA mismatch repair genes derived from 33,998 Chinese individuals with and without cancer reveal their highly ethnic-specific nature.\n\nAn open-access database of DNA mismatch repair (MMR) gene variants in Chinese population.\n\nDNA mismatch repair (MMR) genes play an important role in maintaining genomic stability",
        "homepage": "https://dbMMR-chinese.fhs.um.edu.mo",
        "name": "dbMMR-Chinese"
    }
}