{
    "additionDate": "2020-01-14T19:41:24Z",
    "biotoolsCURIE": "biotools:EDTA",
    "biotoolsID": "EDTA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jiangn@msu.edu",
            "name": "Ning Jiang",
            "typeEntity": "Person"
        },
        {
            "email": "cnhirsch@umn.edu",
            "name": "Candice N. Hirsch",
            "typeEntity": "Person"
        },
        {
            "email": "mhufford@iastate.edu",
            "name": "Matthew B. Hufford",
            "orcidid": "https://orcid.org/0000-0003-3945-1143",
            "typeEntity": "Person"
        }
    ],
    "description": "The EDTA package was designed to filter out false discoveries in raw TE candidates and generate a high-quality non-redundant TE library for whole-genome TE annotations. Selection of initial search programs were based on benckmarkings on the annotation performance using a manually curated TE library in the rice genome.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://github.com/oushujun/EDTA",
    "language": [
        "Perl",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2020-12-25T12:02:54Z",
    "name": "The Extensive de novo TE Annotator (EDTA)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13059-019-1905-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Sequencing technology and assembly algorithms have matured to the point that high-quality De novo assembly is possible for large, repetitive genomes. Current assemblies traverse transposable elements (TEs) and provide an opportunity for comprehensive annotation of TEs. Numerous methods exist for annotation of each class of TEs, but their relative performances have not been systematically compared. Moreover, a comprehensive pipeline is needed to produce a non-redundant library of TEs for species lacking this resource to generate whole-genome TE annotations. Results: We benchmark existing programs based on a carefully curated library of rice TEs. We evaluate the performance of methods annotating long terminal repeat (LTR) retrotransposons, terminal inverted repeat (TIR) transposons, short TIR transposons known as miniature inverted transposable elements (MITEs), and Helitrons. Performance metrics include sensitivity, specificity, accuracy, precision, FDR, and F 1. Using the most robust programs, we create a comprehensive pipeline called Extensive de-novo TE Annotator (EDTA) that produces a filtered non-redundant TE library for annotation of structurally intact and fragmented elements. EDTA also deconvolutes nested TE insertions frequently found in highly repetitive genomic regions. Using other model species with curated TE libraries (maize and Drosophila), EDTA is shown to be robust across both plant and animal species. Conclusions: The benchmarking results and pipeline developed here will greatly facilitate TE annotation in eukaryotic genomes. These annotations will promote a much more in-depth understanding of the diversity and evolution of TEs at both intra- and inter-species levels. EDTA is open-source and freely available: https://github.com/oushujun/EDTA.",
                "authors": [
                    {
                        "name": "Ou S."
                    },
                    {
                        "name": "Su W."
                    },
                    {
                        "name": "Liao Y."
                    },
                    {
                        "name": "Chougule K."
                    },
                    {
                        "name": "Agda J.R.A."
                    },
                    {
                        "name": "Hellinga A.J."
                    },
                    {
                        "name": "Lugo C.S.B."
                    },
                    {
                        "name": "Elliott T.A."
                    },
                    {
                        "name": "Ware D."
                    },
                    {
                        "name": "Peterson T."
                    },
                    {
                        "name": "Jiang N."
                    },
                    {
                        "name": "Hirsch C.N."
                    },
                    {
                        "name": "Hufford M.B."
                    }
                ],
                "citationCount": 23,
                "date": "2019-12-16T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Benchmarking transposable element annotation methods for creation of a streamlined, comprehensive pipeline"
            },
            "pmcid": "PMC6913007",
            "pmid": "31843001"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}