
{
    "credit": [
        {
            "email": "vishwesh.venkatraman@ntnu.no",
            "name": "Vishwesh Venkatraman",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.dyedb.com/s/about/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "license": "CC-BY-4.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Chemistry",
                "uri": "http://edamontology.org/topic_3314"
            },
            {
                "term": "Physics",
                "uri": "http://edamontology.org/topic_3318"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018, The Author(s). Background: Dye-sensitized solar cells (DSSCs) have garnered a lot of attention in recent years. The solar energy to power conversion efficiency of a DSSC is influenced by various components of the cell such as the dye, electrolyte, electrodes and additives among others leading to varying experimental configurations. A large number of metal-based and metal-free dye sensitizers have now been reported and tools using such data to indicate new directions for design and development are on the rise. Description: DSSCDB, the first of its kind dye-sensitized solar cell database, aims to provide users with up-to-date information from publications on the molecular structures of the dyes, experimental details and reported measurements (efficiencies and spectral properties) and thereby facilitate a comprehensive and critical evaluation of the data. Currently, the DSSCDB contains over 4000 experimental observations spanning multiple dye classes such as triphenylamines, carbazoles, coumarins, phenothiazines, ruthenium and porphyrins. Conclusion: The DSSCDB offers a web-based, comprehensive source of property data for dye sensitized solar cells. Access to the database is available through the following URL: www.dyedb.com.",
            "authors": [
                "Venkatraman V.",
                "Raju R.",
                "Oikonomopoulos S.P.",
                "Alsberg B.K."
            ],
            "cit_count": 2,
            "doi": "10.1186/s13321-018-0272-0",
            "journal": "Journal of Cheminformatics",
            "title": "The dye-sensitized solar cell database",
            "year": "2018-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dyedb",
        "biotoolsID": "dyedb",
        "description": "First of its kind dye-sensitized solar cell database, aims to provide users with up-to-date information from publications on the molecular structures of the dyes, experimental details and reported measurements (efficiencies and spectral properties) and thereby facilitate a comprehensive and critical evaluation of the data.",
        "homepage": "https://www.dyedb.com/",
        "name": "Dye Sensitized Solar Cell Database"
    }
}