{
    "accessibility": [],
    "additionDate": "2017-02-10T14:14:43Z",
    "biotoolsCURIE": "biotools:opossum",
    "biotoolsID": "opossum",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "opossum@cmmt.ubc.ca",
            "gridid": null,
            "name": "Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "oPOSSUM is a web-based system for the detection of over-represented transcription factor binding sites in the promoters of sets of genes.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.cisreg.ca/oPOSSUM/",
    "homepage_status": 0,
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "oPOSSUM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Targeted transcript profiling studies can identify sets of co-expressed genes; however, identification of the underlying functional mechanism(s) is a significant challenge. Established methods for the analysis of gene annotations, particularly those based on the Gene Ontology, can identify functional linkages between genes. Similar methods for the identification of over-represented transcription factor binding sites (TFBSs) have been successful in yeast, but extension to human genomics has largely proved ineffective. Creation of a system for the efficient identification of common regulatory mechanisms in a subset of co-expressed human genes promises to break a roadblock in functional genomics research. We have developed an integrated system that searches for evidence of co-regulation by one or more transcription factors (TFs). oPOSSUM combines a pre-computed database of conserved TFBSs in human and mouse promoters with statistical methods for identification of sites over-represented in a set of co-expressed genes. The algorithm successfully identified mediating TFs in control sets of tissue-specific genes and in sets of co-expressed genes from three transcript profiling studies. Simulation studies indicate that oPOSSUM produces few false positives using empirically defined thresholds and can tolerate up to 50% noise in a set of co-expressed genes. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Ho Sui S.J."
                    },
                    {
                        "name": "Mortimer J.R."
                    },
                    {
                        "name": "Arenillas D.J."
                    },
                    {
                        "name": "Brumm J."
                    },
                    {
                        "name": "Walsh C.J."
                    },
                    {
                        "name": "Kennedy B.P."
                    },
                    {
                        "name": "Wasserman W.W."
                    }
                ],
                "citationCount": 249,
                "date": "2005-09-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "oPOSSUM: Identification of over-represented transcription factor binding sites in co-expressed genes"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15933209",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "The identification of over-represented transcription factor binding sites from sets of co-expressed genes provides insights into the mechanisms of regulation for diverse biological contexts. oPOSSUM, an internet-based system for such studies of regulation, has been improved and expanded in this new release. New features include a worm-specific version for investigating binding sites conserved between Caenorhabditis elegans and C. briggsae, as well as a yeast-specific version for the analysis of co-expressed sets of Saccharomyces cerevisiae genes. The human and mouse applications feature improvements in ortholog mapping, sequence alignments and the delineation of multiple alternative promoters. oPOSSUM2, introduced for the analysis of overrepresented combinations of motifs in human and mouse genes, has been integrated with the original oPOSSUM system. Analysis using user-defined background gene sets is now supported. The transcription factor binding site models have been updated to include new profiles from the JASPAR database. oPOSSUM is available at http://www. cisreg.ca/oPOSSUM/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Sui Ho S.J."
                    },
                    {
                        "name": "Fulton D.L."
                    },
                    {
                        "name": "Arenillas D.J."
                    },
                    {
                        "name": "Kwon A.T."
                    },
                    {
                        "name": "Wasserman W.W."
                    }
                ],
                "citationCount": 109,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OPOSSUM: Integrated tools for analysis of regulatory motif over-representation"
            },
            "note": null,
            "pmcid": null,
            "pmid": "17576675",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1,
    "version": []
}