{
    "additionDate": "2017-02-14T09:35:34Z",
    "biotoolsCURIE": "biotools:psrnatarget",
    "biotoolsID": "psrnatarget",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://plantgrn.noble.org/psRNATarget/email"
        }
    ],
    "description": "psRNATarget is a plant small RNA target analysis server which features reverse complementary matching between small RNA and target transcript, and target site accessibility evaluation. It is designed for high-throughput analysis of next generation data, and outputs a comprehensive list of small RNA-target pairs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://plantgrn.noble.org/psRNATarget/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "homepage": "http://plantgrn.noble.org/psRNATarget/.",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "psRNATarget",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Plant endogenous non-coding short small RNAs (20-24 nt), including microRNAs (miRNAs) and a subset of small interfering RNAs (ta-siRNAs), play important role in gene expression regulatory networks (GRNs). For example, many transcription factors and development-related genes have been reported as targets of these regulatory small RNAs. Although a number of miRNA target prediction algorithms and programs have been developed, most of them were designed for animal miRNAs which are significantly different from plant miRNAs in the target recognition process. These differences demand the development of separate plant miRNA (and ta-siRNA) target analysis tool(s). We present psRNATarget, a plant small RNA target analysis server, which features two important analysis functions: (i) reverse complementary matching between small RNA and target transcript using a proven scoring schema, and (ii) target-site accessibility evaluation by calculating unpaired energy (UPE) required to 'open' secondary structure around small RNA's target site on mRNA. The psRNATarget incorporates recent discoveries in plant miRNA target recognition, e.g. it distinguishes translational and post-transcriptional inhibition, and it reports the number of small RNA/target site pairs that may affect small RNA binding activity to target transcript. The psRNATarget server is designed for high-throughput analysis of next-generation data with an efficient distributed computing back-end pipeline that runs on a Linux cluster. The server front-end integrates three simplified user-friendly interfaces to accept user-submitted or preloaded small RNAs and transcript sequences; and outputs a comprehensive list of small RNA/target pairs along with the online tools for batch downloading, key word searching and results sorting. The psRNATarget server is freely available at http://plantgrn.noble.org/psRNATarget/. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Dai X."
                    },
                    {
                        "name": "Zhao P.X."
                    }
                ],
                "citationCount": 1130,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PsRNATarget: A plant small RNA target analysis server"
            },
            "pmid": "21622958"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}