{
    "additionDate": "2018-07-26T15:27:52Z",
    "biotoolsCURIE": "biotools:graftm",
    "biotoolsID": "graftm",
    "credit": [
        {
            "email": "g.tyson@uq.edu.au",
            "name": "Gene W Tyson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Scalable, phylogenetically informed classification of genes within metagenomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://pypi.org/project/graftm/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/graftm/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "GraftM",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/nar/gky174",
            "metadata": {
                "abstract": "Large-scale metagenomic datasets enable the recovery of hundreds of population genomes from environmental samples. However, these genomes do not typically represent the full diversity of complex microbial communities. Gene-centric approaches can be used to gain a comprehensive view of diversity by examining each read independently, but traditional pairwise comparison approaches typically over-classify taxonomy and scale poorly with increasing metagenome and database sizes. Here we introduce GraftM, a tool that uses gene specific packages to rapidly identify gene families in metagenomic data using hidden Markov models (HMMs) or DIAMOND databases, and classifies these sequences using placement into pre-constructed gene trees. The speed and accuracy of GraftM was benchmarked with in silico and in vitro mock communities using taxonomic markers, and was found to have higher accuracy at the family level with a processing time 2.0-3.7× faster than currently available software. Exploration of a wetland metagenome using 16S rRNA- and methyl-coenzyme M reductase (McrA)-specific gpkgs revealed taxonomic and functional shifts across a depth gradient. Analysis of the NCBI nr database using the McrA gpkg allowed the detection of novel sequences belonging to phylum-level lineages. A growing collection of gpkgs is available online (https://github.com/geronimp/graftM_gpkgs), where curated packages can be uploaded and exchanged.",
                "authors": [
                    {
                        "name": "Boyd J.A."
                    },
                    {
                        "name": "Woodcroft B.J."
                    },
                    {
                        "name": "Tyson G.W."
                    }
                ],
                "citationCount": 35,
                "date": "2018-06-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "GraftM: a tool for scalable, phylogenetically informed classification of genes within metagenomes"
            },
            "pmcid": "PMC6007438",
            "pmid": "29562347"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}