{
    "additionDate": "2021-10-09T17:54:18.338080Z",
    "biotoolsCURIE": "biotools:mclean",
    "biotoolsID": "mclean",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "daniel.alcaide@kuleuven.be",
            "name": "Daniel Alcaide",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MCLEAN (Multilevel CLustering Exploration As Network) proposes a visual analytics clustering methodology for guiding the user in the exploration and detection of clusters. We thereby combine a graphical representation of the clustered dataset as a network with the community finding algorithms into one coherent framework. Our approach entails displaying the results of the heuristics to users, providing a setting from which to start the exploration and data analysis. This is considered multilevel because allows the user to have an overview and detailed of the merging of elements into clusters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/vda-lab/mclean",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-09T17:54:18.341342Z",
    "name": "MCLEAN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ-CS.145",
            "metadata": {
                "abstract": "© 2018 Alcaide and Aerts.Finding useful patterns in datasets has attracted considerable interest in the field of visual analytics. One of the most common tasks is the identification and representation of clusters. However, this is non-trivial in heterogeneous datasets since the data needs to be analyzed from different perspectives. Indeed, highly variable patterns may mask underlying trends in the dataset. Dendrograms are graphical representations resulting from agglomerative hierarchical clustering and provide a framework for viewing the clustering at different levels of detail. However, dendrograms become cluttered when the dataset gets large, and the single cut of the dendrogram to demarcate different clusters can be insufficient in heterogeneous datasets. In this work, we propose a visual analytics methodology called MCLEAN that offers a general approach for guiding the user through the exploration and detection of clusters. Powered by a graph- based transformation of the relational data, it supports a scalable environment for representation of heterogeneous datasets by changing the spatialization. We thereby combine multilevel representations of the clustered dataset with community finding algorithms. Our approach entails displaying the results of the heuristics to users, providing a setting from which to start the exploration and data analysis. To evaluate our proposed approach, we conduct a qualitative user study, where participants are asked to explore a heterogeneous dataset, comparing the results obtained by MCLEAN with the dendrogram. These qualitative results reveal that MCLEAN is an effective way of aiding users in the detection of clusters in heterogeneous datasets. The proposed methodology is implemented in an R package available at https://bitbucket.org/vda-lab/mclean.",
                "authors": [
                    {
                        "name": "Alcaide D."
                    },
                    {
                        "name": "Aerts J."
                    }
                ],
                "citationCount": 3,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PeerJ Computer Science",
                "title": "MCLEAN: Multilevel clustering exploration as network"
            },
            "pmcid": "PMC7924466",
            "pmid": "33816801",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}