{
    "accessibility": [],
    "additionDate": "2017-08-20T15:33:04Z",
    "biotoolsCURIE": "biotools:dissco",
    "biotoolsID": "dissco",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "xuzheng@email.unc.edu",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "DISSCO is a JAVA application for direct imputation of summary statistics allowing for covariates.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.unc.edu/~yunmli/DISSCO/tutorial.php#whatYouNeed"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://yunliweb.its.unc.edu/DISSCO",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-09-04T08:38:01Z",
    "license": "GPL-3.0",
    "link": [],
    "maturity": null,
    "name": "DISSCO",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv168",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Background: Imputation of individual level genotypes at untyped markers using an external reference panel of genotyped or sequenced individuals has become standard practice in genetic association studies. Direct imputation of summary statistics can also be valuable, for example in meta-analyses where individual level genotype data are not available. Two methods (DIST and ImpG-Summary/LD), that assume a multivariate Gaussian distribution for the association summary statistics, have been proposed for imputing association summary statistics. However, both methods assume that the correlations between association summary statistics are the same as the correlations between the corresponding genotypes. This assumption can be violated in the presence of confounding covariates. Methods: We analytically show that in the absence of covariates, correlation among association summary statistics is indeed the same as that among the corresponding genotypes, thus serving as a theoretical justification for the recently proposed methods. We continue to prove that in the presence of covariates, correlation among association summary statistics becomes the partial correlation of the corresponding genotypes controlling for covariates. We therefore develop direct imputation of summary statistics allowing covariates (DISSCO). Results: We consider two real-life scenarios where the correlation and partial correlation likely make practical difference: (i) association studies in admixed populations; (ii) association studies in presence of other confounding covariate(s). Application of DISSCO to real datasets under both scenarios shows at least comparable, if not better, performance compared with existing correlation-based methods, particularly for lower frequency variants. For example, DISSCO can reduce the absolute deviation from the truth by 3.9-15.2% for variants with minor allele frequency <5%.",
                "authors": [
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Duan Q."
                    },
                    {
                        "name": "Yan S."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Lange E."
                    },
                    {
                        "name": "Li Y."
                    }
                ],
                "citationCount": 10,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DISSCO: Direct imputation of summary statistics allowing covariates"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ],
    "validated": 1,
    "version": []
}