{
    "additionDate": "2021-01-18T10:04:35Z",
    "biotoolsCURIE": "biotools:scibut",
    "biotoolsID": "scibut",
    "confidence_flag": "tool",
    "description": "An open-source toolbox for measuring dynamic video framerates and synchronizing video stimuli with neural and behavioral responses.\n\nThe Schultz Cigarette Burn Toolbox is a series of Python, MATLAB, and Arduino scripts designed to measure veridical video framerates and onset times. It uses visual markers (\"Cigarette Burns\") on the corners of the screen which can be synchronized with EEG and/or response data using an analog input box or an Arduino microcontroller (or similar).",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.band-lab.com/scibut",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-13T14:04:32Z",
    "name": "SCiBuT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JNEUMETH.2020.108830",
            "metadata": {
                "abstract": "© 2020 The Author(s)Background: Researchers rely on the specified capabilities of their hardware and software even though, in reality, these capabilities are often not achieved. Considering that the number of experiments examining neural oscillations has increased steadily, easy-to-implement tools for testing the capabilities of hardware and software are necessary. New method: We present an open-source MATLAB toolbox, the Schultz Cigarette Burn Toolbox (SCiBuT) that allows users to benchmark the capabilities of their visual display devices and align neural and behavioral responses with veridical timing of visual stimuli. Specifically, the toolbox marks the corners of the display with black or white squares to indicate the timing of the onset of static images and the timing of frame changes within videos. Using basic hardware (i.e., a photodiode, an Arduino microcontroller, and an analogue input box), the light changes in the corner of the screen can be captured and synchronized with EEG recordings and/or behavioral responses. Results: We demonstrate that the SCiBuT is sensitive to framerate inconsistencies and provide examples of hardware setups that are suboptimal for measuring fine timing. Finally, we show that inconsistencies in framerate during video presentation can affect EEG oscillations. Conclusions: The SCiBuT provides tools to benchmark framerates and frame changes and to synchronize frame changes with neural and behavioral signals. This is the first open-source toolbox that can perform these functions. The SCiBuT can be freely downloaded (www.band-lab.com/scibut) and be used during experimental trials to improve the accuracy and precision of timestamps to ensure videos are presented at the intended framerate.",
                "authors": [
                    {
                        "name": "Schultz B.G."
                    },
                    {
                        "name": "Biau E."
                    },
                    {
                        "name": "Kotz S.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "An open-source toolbox for measuring dynamic video framerates and synchronizing video stimuli with neural and behavioral responses"
            },
            "pmid": "32603812"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}