{
    "additionDate": "2019-11-14T18:16:12Z",
    "biotoolsCURIE": "biotools:iq-ghost",
    "biotoolsID": "iq-ghost",
    "confidence_flag": "high",
    "description": "Recovering Historical Signal from Heterotachously-evolved Sequence Alignments | Molecular sequence data that have evolved under the influence of heterotachous evolutionary processes are known to mislead phylogenetic inference. We introduce the General Heterogeneous evolution On a Single Topology (GHOST) model of sequence evolution, implemented under a maximum-likelihood framework in the phylogenetic program IQ-TREE (http: www.iqtree.org).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ]
        }
    ],
    "homepage": "http://www.iqtree.org",
    "lastUpdate": "2020-12-03T11:21:07.469431Z",
    "name": "iq-GHOST",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/SYSBIO/SYZ051",
            "metadata": {
                "abstract": "© 2019 The Author(s). All rights reserved.Molecular sequence data that have evolved under the influence of heterotachous evolutionary processes are known to mislead phylogenetic inference. We introduce the General Heterogeneous evolution On a Single Topology (GHOST) model of sequence evolution, implemented under a maximum-likelihood framework in the phylogenetic program IQ-TREE (http://www.iqtree.org). Simulations show that using the GHOST model, IQ-TREE can accurately recover the tree topology, branch lengths, and substitution model parameters from heterotachously evolved sequences. We investigate the performance of the GHOST model on empirical data by sampling phylogenomic alignments of varying lengths from a plastome alignment. We then carry out inference under the GHOST model on a phylogenomic data set composed of 248 genes from 16 taxa, where we find the GHOST model concurs with the currently accepted view, placing turtles as a sister lineage of archosaurs, in contrast to results obtained using traditional variable rates-across-sites models. Finally, we apply the model to a data set composed of a sodium channel gene of 11 fish taxa, finding that the GHOST model is able to elucidate a subtle component of the historical signal, linked to the previously established convergent evolution of the electric organ in two geographically distinct lineages of electric fish. We compare inference under the GHOST model to partitioning by codon position and show that, owing to the minimization of model constraints, the GHOST model offers unique biological insights when applied to empirical data.",
                "authors": [
                    {
                        "name": "Crotty S.M."
                    },
                    {
                        "name": "Minh B.Q."
                    },
                    {
                        "name": "Bean N.G."
                    },
                    {
                        "name": "Holland B.R."
                    },
                    {
                        "name": "Tuke J."
                    },
                    {
                        "name": "Jermiin L.S."
                    },
                    {
                        "name": "Haeseler A.V."
                    }
                ],
                "citationCount": 11,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "GHOST: Recovering Historical Signal from Heterotachously Evolved Sequence Alignments"
            },
            "pmid": "31364711"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}