{
    "additionDate": "2021-01-18T09:45:10Z",
    "biotoolsCURIE": "biotools:ms-dart-seq",
    "biotoolsID": "ms-dart-seq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gpappas@unb.br",
            "name": "Georgios Joannis Pappas",
            "typeEntity": "Person"
        }
    ],
    "description": "A cost-effective approach to DNA methylation detection by Methyl Sensitive DArT sequencing.\n\nThis repository contains the analytical code necessary to reproduce the results described in the paper: \"A cost-effective approach to DNA methylation detection by Methyl Sensitive DArT sequencing.\".",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Methylation calling",
                    "uri": "http://edamontology.org/operation_3919"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wendelljpereira/ms-dart-seq",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:47:53Z",
    "name": "MS-DArT-seq",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0233800",
            "metadata": {
                "abstract": "© 2020 Pereira et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Several studies suggest the relation of DNA methylation to diseases in humans and important phenotypes in plants drawing attention to this epigenetic mark as an important source of variability. In the last decades, several methodologies were developed to assess the methylation state of a genome. However, there is still a lack of affordable and precise methods for genome wide analysis in large sample size studies. Methyl sensitive double digestion MS-DArT sequencing method emerges as a promising alternative for methylation profiling. We developed a computational pipeline for the identification of DNA methylation using MS-DArT-seq data and carried out a pilot study using the Eucalyptus grandis tree sequenced for the species reference genome. Using a statistic framework as in differential expression analysis, 72,515 genomic sites were investigated and 5,846 methylated sites identified, several tissue specific, distributed along the species 11 chromosomes. We highlight a bias towards identification of DNA methylation in genic regions and the identification of 2,783 genes and 842 transposons containing methylated sites. Comparison with WGBS, DNA sequencing after treatment with bisulfite, data demonstrated a precision rate higher than 95% for our approach. The availability of a reference genome is useful for determining the genomic context of methylated sites but not imperative, making this approach suitable for any species. Our approach provides a cost effective, broad and reliable examination of DNA methylation profile on MspI/HpaII restriction sites, is fully reproducible and the source code is available on GitHub (https://github.com/wendelljpereira/ms-dart-seq).",
                "authors": [
                    {
                        "name": "Pereira W.J."
                    },
                    {
                        "name": "De Castro Rodrigues Pappas M."
                    },
                    {
                        "name": "Grattapaglia D."
                    },
                    {
                        "name": "Pappas G.J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A cost-effective approach to DNA methylation detection by methyl sensitive DArT sequencing"
            },
            "pmcid": "PMC7272069",
            "pmid": "32497070"
        }
    ],
    "toolType": [
        "Library",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ]
}