{
    "additionDate": "2020-01-14T09:12:41Z",
    "biotoolsCURIE": "biotools:VARUS",
    "biotoolsID": "VARUS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mario.stanke@uni-greifswald.de",
            "name": "Mario Stanke",
            "orcidid": "https://orcid.org/0000-0001-8696-0384",
            "typeEntity": "Person"
        }
    ],
    "description": "sampling complementary RNA reads from the sequence read archive.\n\nVARUS: Drawing Diverse Samples from RNA-Seq Libraries.\n\nVARUS was originally written by Willy Bruhn as a Bachelors' thesis supervised by Mario Stanke. This repository is a copy of https://github.com/WillyBruhn/VARUS made in November 2018 and contains many bugfixes, an incremental intron database feature and an extension for using HISAT al alternative alignment program",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Gaius-Augustus/VARUS",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2021-01-02T11:34:55Z",
    "name": "VARUS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3182-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Vast amounts of next generation sequencing RNA data has been deposited in archives, accompanying very diverse original studies. The data is readily available also for other purposes such as genome annotation or transcriptome assembly. However, selecting a subset of available experiments, sequencing runs and reads for this purpose is a nontrivial task and complicated by the inhomogeneity of the data. Results: This article presents the software VARUS that selects, downloads and aligns reads from NCBI's Sequence Read Archive, given only the species' binomial name and genome. VARUS automatically chooses runs from among all archived runs to randomly select subsets of reads. The objective of its online algorithm is to cover a large number of transcripts adequately when network bandwidth and computing resources are limited. For most tested species VARUS achieved both a higher sensitivity and specificity with a lower number of downloaded reads than when runs were manually selected. At the example of twelve eukaryotic genomes, we show that RNA-Seq that was sampled with VARUS is well-suited for fully-automatic genome annotation with BRAKER. Conclusions: With VARUS, genome annotation can be automatized to the extent that not even the selection and quality control of RNA-Seq has to be done manually. This introduces the possibility to have fully automatized genome annotation loops over potentially many species without incurring a loss of accuracy over a manually supervised annotation process.",
                "authors": [
                    {
                        "name": "Stanke M."
                    },
                    {
                        "name": "Bruhn W."
                    },
                    {
                        "name": "Becker F."
                    },
                    {
                        "name": "Hoff K.J."
                    }
                ],
                "date": "2019-11-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VARUS: sampling complementary RNA reads from the sequence read archive"
            },
            "pmcid": "PMC6842140",
            "pmid": "31703556"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}