{
    "additionDate": "2020-01-14T09:08:35Z",
    "biotoolsCURIE": "biotools:pathDIP",
    "biotoolsID": "pathDIP",
    "confidence_flag": "tool",
    "description": "An extended pathway annotations and enrichment analysis resource for human, model organisms and domesticated species.\n\nSearch Genes Search miRNAs Search Pathways API Download Statistics Documentation Publications Team Contact.\n\npathDIP is an annotated database of signaling cascades in human and non-human organisms, comprising core pathways from major curated pathways databases, and pathways predicted based on orthology, and by using physical protein interactions. Data integration and predictions increase coverage of pathway annotations for human proteome to 92%. pathDIP annotates 122,131 unique proteins in 6,401 pathways in 17 organisms (including 18,454 human proteins), annotates 36,216 pathway orphans (including 5,366 human proteins), and provides multiple query, analysis and output options.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://ophid.utoronto.ca/pathDIP",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:50:38.644472Z",
    "name": "pathDIP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/nar/gkz989",
            "metadata": {
                "abstract": "PathDIP was introduced to increase proteome coverage of literature-curated human pathway databases. PathDIP 4 now integrates 24 major databases. To further reduce the number of proteins with no curated pathway annotation, pathDIP integrates pathways with physical protein-protein interactions (PPIs) to predict significant physical associations between proteins and curated pathways. For human, it provides pathway annotations for 5366 pathway orphans. Integrated pathway annotation now includes six model organisms and ten domesticated animals. A total of 6401 core and ortholog pathways have been curated from the literature or by annotating orthologs of human proteins in the literature-curated pathways. Extended pathways are the result of combining these pathways with protein-pathway associations that are predicted using organism-specific PPIs. Extended pathways expand proteome coverage from 81 088 to 120 621 proteins, making pathDIP 4 the largest publicly available pathway database for these organisms and providing a necessary platform for comprehensive pathway-enrichment analysis. PathDIP 4 users can customize their search and analysis by selecting organism, identifier and subset of pathways. Enrichment results and detailed annotations for input list can be obtained in different formats and views. To support automated bioinformatics workflows, Java, R and Python APIs are available for batch pathway annotation and enrichment analysis. PathDIP 4 is publicly available at http://ophid.utoronto.ca/pathDIP.",
                "authors": [
                    {
                        "name": "Abovsky M."
                    },
                    {
                        "name": "Chandran V."
                    },
                    {
                        "name": "Cumbaa C.A."
                    },
                    {
                        "name": "Jurisica I."
                    },
                    {
                        "name": "Kotlyar M."
                    },
                    {
                        "name": "Lu R."
                    },
                    {
                        "name": "Pastrello C."
                    },
                    {
                        "name": "Rahman P."
                    },
                    {
                        "name": "Rahmati S."
                    }
                ],
                "citationCount": 54,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PathDIP 4: An extended pathway annotations and enrichment analysis resource for human, model organisms and domesticated species"
            },
            "pmcid": "PMC7145646",
            "pmid": "31733064"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
