{
    "additionDate": "2019-11-14T18:05:44Z",
    "biotoolsCURIE": "biotools:EK-DRD",
    "biotoolsID": "EK-DRD",
    "confidence_flag": "tool",
    "description": "A Comprehensive Database for Drug Repositioning Inspired by Experimental Knowledge | Drug Repositioning Drug repositioning, or the identification of new indications for approved therapeutic drugs, has gained substantial traction with both academics and pharmaceutical companies because it reduces the cost and duration of the drug development pipeline and the likelihood of unforeseen adverse events. To date there has not been a systematic effort to identify such opportunities, in part because of the lack of a comprehensive resource for an enormous amount of unsystematic drug repositioning information to support scientists who could benefit from this endeavor | Experimental Knowledge-Based Drug Repositioning Database (EK-DRD) provides a versatile resource for the display, search and analysis of structure, function, pathway, disease, network and related experimentally-validated drug repositioning annotation for 1861 FDA-approved and 102 withdrawn small molecule drugs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.idruglab.com/drd/index.php",
    "lastUpdate": "2020-12-25T12:15:26Z",
    "name": "EK-DRD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00365",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Drug repositioning, or the identification of new indications for approved therapeutic drugs, has gained substantial traction with both academics and pharmaceutical companies because it reduces the cost and duration of the drug development pipeline and the likelihood of unforeseen adverse events. To date there has not been a systematic effort to identify such opportunities, in part because of the lack of a comprehensive resource for an enormous amount of unsystematic drug repositioning information to support scientists who could benefit from this endeavor. To address this challenge, we developed a new database, the Experimental Knowledge-Based Drug Repositioning Database (EK-DRD), by using text and data mining as well as manual curation. EK-DRD contains experimentally validated drug repositioning annotation for 1861 FDA-approved and 102 withdrawn small-molecule drugs. Annotation was done at four levels using 30 944 target assay records, 3999 cell assay records, 585 organism assay records, and 8889 clinical trial records. Additionally, approximately 1799 repositioning protein or target sequences coupled with 856 related diseases and 1332 pathways are linked to the drug entries. Our web-based software displays a network of integrative relationships between drugs, their repositioning targets, and related diseases. The database is fully searchable and supports extensive text, sequence, chemical structure, and relational query searches. EK-DRD is freely accessible at http://www.idruglab.com/drd/index.php.",
                "authors": [
                    {
                        "name": "Zhao C."
                    },
                    {
                        "name": "Dai X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Guo Q."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "EK-DRD: A Comprehensive Database for Drug Repositioning Inspired by Experimental Knowledge"
            },
            "pmid": "31433187"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}