{
    "additionDate": "2020-01-14T08:57:49Z",
    "biotoolsCURIE": "biotools:Link-HD",
    "biotoolsID": "Link-HD",
    "confidence_flag": "tool",
    "description": "a versatile framework to explore and integrate heterogeneous microbial communities.\n\na versatile approach to integrate heterogeneous datasets.\n\nLinkHD: a versatile framework to explore and integrate heterogeneous data.\n\nHere we present Link-HD, an approach to integrate heterogeneous datasets, as a generalization of STATIS-ACT (“Structuration des Tableaux A Trois Indices de la Statistique Analyse Conjointe de Tableaux”), a family of methods to join and compare information from multiple subspaces.\n\nLaura Zingaretti & Yuliaxis Ramayo Caldas.\n\nLaura M Zingaretti, Gilles Renand, Diego P Morgavi, Yuliaxis Ramayo-Caldas, Link-HD: a versatile framework to explore and integrate heterogeneous microbial communities, Bioinformatics, https://doi.org/10.1093/bioinformatics/btz862",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lauzingaretti/LinkHD",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-22T10:57:36Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://lauzingaretti.github.io/LinkHD/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/html/LinkHD.html"
        }
    ],
    "name": "Link-HD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ862",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: We present Link-HD, an approach to integrate multiple datasets. Link-HD is a generalization of 'Structuration des Tableaux A Trois Indices de la Statistique-Analyse Conjointe de Tableaux', a family of methods designed to integrate information from heterogeneous data. Here, we extend the classical approach to deal with broader datasets (e.g. compositional data), methods for variable selection and taxon-set enrichment analysis. Results: The methodology is demonstrated by integrating rumen microbial communities from cows for which methane yield (CH4y) was individually measured. Our approach reproduces the significant link between rumen microbiota structure and CH4 emission. When analyzing the TARA's ocean data, Link-HD replicates published results, highlighting the relevance of temperature with members of phyla Proteobacteria on the structure and functionality of this ecosystem.",
                "authors": [
                    {
                        "name": "Morgavi D.P."
                    },
                    {
                        "name": "Ramayo-Caldas Y."
                    },
                    {
                        "name": "Renand G."
                    },
                    {
                        "name": "Zingaretti L.M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Link-HD: A versatile framework to explore and integrate heterogeneous microbial communities"
            },
            "pmid": "31738392"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
