
{
    "credit": [
        {
            "email": "lifeworks.song@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://osslab.lifesci.warwick.ac.uk/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://oss-lab.github.io/biojazz/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/biojazz-evolve-and-design-biochemical-reaction-networks.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research. Systems biologists aim to decipher the structure and dynamics of signaling and regulatory networks underpinning cellular responses; synthetic biologists can use this insight to alter existing networks or engineer de novo ones. Both tasks will benefit from an understanding of which structural and dynamic features of networks can emerge from evolutionary processes, through which intermediary steps these arise, and whether they embody general design principles. As natural evolution at the level of network dynamics is difficult to study, in silico evolution of network models can provide important insights. However, current tools used for in silico evolution of network dynamics are limited to ad hoc computer simulations and models. Here we introduce BioJazz, an extendable, user-friendly tool for simulating the evolution of dynamic biochemical networks. Unlike previous tools for in silico evolution, BioJazz allows for the evolution of cellular networks with unbounded complexity by combining rule-based modeling with an encoding of networks that is akin to a genome. We show that BioJazz can be used to implement biologically realistic selective pressures and allows exploration of the space of network architectures and dynamics that implement prescribed physiological functions. BioJazz is provided as an open-source tool to facilitate its further development and use. Source code and user manuals are available at: http://oss-lab.github.io/biojazz and http://osslab.lifesci.warwick.ac.uk/BioJazz.aspx.",
            "authors": [
                "Feng S.",
                "Ollivier J.F.",
                "Swain P.S.",
                "Soyer O.S."
            ],
            "cit_count": 9,
            "journal": "Nucleic Acids Research",
            "pmid": "26101250",
            "title": "BioJazz: In silico evolution of cellular networks with unbounded complexity using rule-based modeling",
            "year": "2015-10-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:biojazz",
        "biotoolsID": "biojazz",
        "description": "Tool for evolving and designing biochemical reaction networks using genetic algorithm (GA).",
        "homepage": "http://oss-lab.github.io/biojazz",
        "name": "BioJazz"
    }
}