{
    "accessibility": "Open access",
    "additionDate": "2022-09-16T13:21:14.321946Z",
    "biotoolsCURIE": "biotools:gridscore",
    "biotoolsID": "gridscore",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sebastian.raubach@hutton.ac.uk",
            "name": "Sebastian Raubach",
            "orcidid": "https://orcid.org/0000-0001-5659-247X",
            "typeEntity": "Person"
        },
        {
            "name": "Miriam Schreiber"
        },
        {
            "name": "Paul D. Shaw"
        }
    ],
    "description": "A tool for accurate, cross-platform phenotypic data collection and visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://ics.hutton.ac.uk/gridscore/",
    "lastUpdate": "2022-09-16T13:21:14.325076Z",
    "name": "GridScore",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04755-2",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Plant breeding and crop research rely on experimental phenotyping trials. These trials generate data for large numbers of traits and plant varieties that needs to be captured efficiently and accurately to support further research and downstream analysis. Traditionally scored by hand, phenotypic data is nowadays collected using spreadsheets or specialized apps. While many solutions exist, which increase efficiency and reduce errors, none offer the same familiarity as printed field plans which have been used for decades and offer an intuitive overview over the trial setup, previously recorded data and plots still requiring scoring. Results: We introduce GridScore which utilizes cutting-edge web technologies to reproduce the familiarity of printed field plans while enhancing the phenotypic data collection process by adding advanced features like georeferencing, image tagging and speech recognition. GridScore is a cross-platform open-source plant phenotyping app that combines barcode-based systems with a guided data collection approach while offering a top-down view onto the data collected in a field layout. GridScore is compared to existing tools across a wide spectrum of criteria including support for barcodes, multiple platforms, and visualizations. Conclusion: Compared to its competition, GridScore shows strong performance across the board offering a complete manual phenotyping experience.",
                "authors": [
                    {
                        "name": "Raubach S."
                    },
                    {
                        "name": "Schreiber M."
                    },
                    {
                        "name": "Shaw P.D."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GridScore: a tool for accurate, cross-platform phenotypic data collection and visualization"
            },
            "pmcid": "PMC9169276",
            "pmid": "35668357"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
