{
    "accessibility": "Open access",
    "additionDate": "2022-04-24T10:39:46.896149Z",
    "biotoolsCURIE": "biotools:comm-ssup4_sup",
    "biotoolsID": "comm-ssup4_sup",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gmsyany@nus.edu.sg",
            "name": "Yi Yang"
        },
        {
            "email": "jin.liu@duke-nus.edu.sg",
            "name": "Jin Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Collaborative mixed model to dissecting genetic contributions to complex traits by leveraging regulatory information.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gordonliu810822/CoMM",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2022-04-24T10:39:46.898799Z",
    "name": "CoMM-Ssup4 sup",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.704538",
            "metadata": {
                "abstract": "© Copyright © 2021 Yang, Yeung and Liu.Motivation: Genome-wide association studies (GWAS) have achieved remarkable success in identifying SNP-trait associations in the last decade. However, it is challenging to identify the mechanisms that connect the genetic variants with complex traits as the majority of GWAS associations are in non-coding regions. Methods that integrate genomic and transcriptomic data allow us to investigate how genetic variants may affect a trait through their effect on gene expression. These include CoMM and CoMM-S2, likelihood-ratio-based methods that integrate GWAS and eQTL studies to assess expression-trait association. However, their reliance on individual-level eQTL data render them inapplicable when only summary-level eQTL results, such as those from large-scale eQTL analyses, are available. Result: We develop an efficient probabilistic model, CoMM-S4, to explore the expression-trait association using summary-level eQTL and GWAS datasets. Compared with CoMM-S2, which uses individual-level eQTL data, CoMM-S4 requires only summary-level eQTL data. To test expression-trait association, an efficient variational Bayesian EM algorithm and a likelihood ratio test were constructed. We applied CoMM-S4 to both simulated and real data. The simulation results demonstrate that CoMM-S4 can perform as well as CoMM-S2 and S-PrediXcan, and analyses using GWAS summary statistics from Biobank Japan and eQTL summary statistics from eQTLGen and GTEx suggest novel susceptibility loci for cardiovascular diseases and osteoporosis. Availability and implementation: The developed R package is available at https://github.com/gordonliu810822/CoMM.",
                "authors": [
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Yeung K.-F."
                    }
                ],
                "date": "2021-09-20T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "CoMM-S4: A Collaborative Mixed Model Using Summary-Level eQTL and GWAS Datasets in Transcriptome-Wide Association Studies"
            },
            "pmcid": "PMC8488198",
            "pmid": "34616426"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
