{
    "name": "GenVision", 
    "description": "Genomic visualization software package that is fully integrated with Lasergene and is designed to support easy generation of publication quality graphics and maps.", 
    "homepage": "http://www.dnastar.com/t-products-genvision.aspx", 
    "biotoolsID": "genvision", 
    "biotoolsCURIE": "biotools:genvision", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0337", 
                    "term": "Visualisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }
    ], 
    "operatingSystem": [
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.dnastar.com/t-support-tutorials.aspx", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1751-0473-2-1", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Review", 
            "version": null, 
            "metadata": {
                "title": "Genome display tool: Visualizing features in complex data sets", 
                "abstract": "Background: The enormity of the information contained in large data sets makes it difficult to develop intuitive understanding. It would be useful to have software that allows visualization of possible correlations between properties that can be associated with a core data set. In the case of bacterial genomes, existing visualization tools focus on either global properties such as variations in composition or detailed local displays of the features that comprise the annotation. It is not easy to visualize other information in the context of this core information. Results: A Java based software known as the Genome Display Tool (GDT), allows the user to simultaneously view the distribution of multiple attributes pertaining to genes and intragenic regions in a single bacterial genome using different colours and shapes on a single screen. The display represents each gene by small boxes that correlate with physical position in the genome. The size of the boxes is dynamically allocated based on the number of genes and a zoom feature allows close-up inspection of regions of interest. The display is interfaced with a MS-Access relational database and can display any feature in the database that can be represented by discrete values. Data is readily added to the database from an MS-Excel spread sheet. The functionality of GDT is demonstrated by comparing the results of two predictions of recent horizontal transfer events in the genome of Synechocystis PCC-6803. The resulting display allows the user to immediately see how much agreement exists between the two methods and also visualize how genes in various categories (e.g. predicted in both methods, one method etc) are distributed in the genome. Conclusion: The GDT software provides the user with a powerful tool that allows development of an intuitive understanding of the relative distribution of features in a large data set. As additional features are added to the data set, the number of possible correlations that can be visualized grows rapidly. Although described here for use in bacterial genomics, the principle is general and similar software might be useful in other contexts such as patient studies. © 2007 Viswanath et al; licensee BioMed Central Ltd.", 
                "date": "2007-02-14T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Viswanath L."
                    }, 
                    {
                        "name": "Lu Y."
                    }, 
                    {
                        "name": "Fox G.E."
                    }
                ], 
                "journal": "Source Code for Biology and Medicine"
            }
        }
    ], 
    "credit": [
        {
            "name": "Contact Form", 
            "email": null, 
            "url": "https://www.dnastar.com/f-tech-submit.aspx?&process=submit", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:14:54Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0
}