{
    "accessibility": "Open access",
    "additionDate": "2021-11-15T20:15:40.674324Z",
    "biotoolsCURIE": "biotools:torchio",
    "biotoolsID": "torchio",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Sébastien Ourselin"
        },
        {
            "name": "Fernando Pérez-García",
            "orcidid": "https://orcid.org/0000-0001-9090-3024"
        },
        {
            "name": "Rachel Sparks",
            "orcidid": "https://orcid.org/0000-0003-1553-7903"
        }
    ],
    "description": "A Python library for efficient loading, preprocessing, augmentation and patch-based sampling of medical images in deep learning.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/fepegar/torchio/tree/main/tutorials"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://torchio.rtfd.io/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-15T20:17:46.947471Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://torchio.rtfd.io/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/fepegar/torchio"
        }
    ],
    "name": "TorchIO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2021.106236",
            "metadata": {
                "abstract": "© 2021 The Author(s)Background and objective: Processing of medical images such as MRI or CT presents different challenges compared to RGB images typically used in computer vision. These include a lack of labels for large datasets, high computational costs, and the need of metadata to describe the physical properties of voxels. Data augmentation is used to artificially increase the size of the training datasets. Training with image subvolumes or patches decreases the need for computational power. Spatial metadata needs to be carefully taken into account in order to ensure a correct alignment and orientation of volumes. Methods: We present TorchIO, an open-source Python library to enable efficient loading, preprocessing, augmentation and patch-based sampling of medical images for deep learning. TorchIO follows the style of PyTorch and integrates standard medical image processing libraries to efficiently process images during training of neural networks. TorchIO transforms can be easily composed, reproduced, traced and extended. Most transforms can be inverted, making the library suitable for test-time augmentation and estimation of aleatoric uncertainty in the context of segmentation. We provide multiple generic preprocessing and augmentation operations as well as simulation of MRI-specific artifacts. Results: Source code, comprehensive tutorials and extensive documentation for TorchIO can be found at http://torchio.rtfd.io/. The package can be installed from the Python Package Index (PyPI) running pip install torchio. It includes a command-line interface which allows users to apply transforms to image files without using Python. Additionally, we provide a graphical user interface within a TorchIO extension in 3D Slicer to visualize the effects of transforms. Conclusion: TorchIO was developed to help researchers standardize medical image processing pipelines and allow them to focus on the deep learning experiments. It encourages good open-science practices, as it supports experiment reproducibility and is version-controlled so that the software can be cited precisely. Due to its modularity, the library is compatible with other frameworks for deep learning with medical images.",
                "authors": [
                    {
                        "name": "Ourselin S."
                    },
                    {
                        "name": "Perez-Garcia F."
                    },
                    {
                        "name": "Sparks R."
                    }
                ],
                "citationCount": 5,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "TorchIO: A Python library for efficient loading, preprocessing, augmentation and patch-based sampling of medical images in deep learning"
            },
            "pmcid": "PMC8542803",
            "pmid": "34311413"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
