{
    "additionDate": "2020-01-09T17:55:24Z",
    "biotoolsCURIE": "biotools:CrystaLattE",
    "biotoolsID": "CrystaLattE",
    "confidence_flag": "tool",
    "description": "Automated computation of lattice energies of organic crystals exploiting the many-body expansion to achieve dual-level parallelism.\n\nSet of scripts to automate the calculation of crystal lattice energies.\n\nAutomated calculation of crystal lattice energies with the many-body expansion.\n\nCrystaLattE has an interface with the quantum chemistry package PSI4. To run, the code requires a crystallographic information file containing structural information of the crystal and an input file specifying execution details. Work continues in the creation of a CrystaLattE pip package. So, for the moment, the instructions to download and install CrystaLattE and to create a conda environment that includes PSI4 are presented below.\n\nCyrstaLattE is a software that automates the computation of crystal lattice energies using the many-body cluster expansion",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/carlosborca/CrystaLattE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-19T21:54:30Z",
    "license": "LGPL-3.0",
    "name": "CrystaLattE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1063/1.5120520",
            "metadata": {
                "abstract": "© 2019 Author(s).We present an algorithm to compute the lattice energies of molecular crystals based on the many-body cluster expansion. The required computations on dimers, trimers, etc., within the crystal are independent of each other, leading to a naturally parallel approach. The algorithm exploits the long-range three-dimensional periodic order of crystals to automatically detect and avoid redundant or unnecessary computations. For this purpose, Coulomb-matrix descriptors from machine learning applications are found to be efficient in determining whether two N-mers are identical. The algorithm is implemented as an open-source Python program, CrystaLattE, that uses some of the features of the Quantum Chemistry Common Driver and Databases library. CrystaLattE is initially interfaced with the quantum chemistry package Psi4. With CrystaLattE, we have applied the fast, dispersion-corrected Hartree-Fock method HF-3c to the lattice energy of crystalline benzene. Including all 73 symmetry-unique dimers and 7130 symmetry-unique trimers that can be formed from molecules within a 15 Å cutoff from a central reference monomer, HF-3c plus an Axilrod-Teller-Muto estimate of three-body dispersion exhibits an error of only -1.0 kJ mol-1 vs the estimated 0 K experimental lattice energy of -55.3 ± 2.2 kJ mol-1. The convergence of the HF-3c two- and three-body contributions to the lattice energy as a function of intermonomer distance is examined.",
                "authors": [
                    {
                        "name": "Borca C.H."
                    },
                    {
                        "name": "Bakr B.W."
                    },
                    {
                        "name": "Burns L.A."
                    },
                    {
                        "name": "Sherrill C.D."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-14T00:00:00Z",
                "journal": "Journal of Chemical Physics",
                "title": "CrystaLattE: Automated computation of lattice energies of organic crystals exploiting the many-body expansion to achieve dual-level parallelism"
            },
            "pmid": "31615262"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}