{
    "additionDate": "2019-11-14T18:27:58Z",
    "biotoolsCURIE": "biotools:QuantumATK",
    "biotoolsID": "QuantumATK",
    "confidence_flag": "tool",
    "description": "an integrated platform of electronic and atomic-scale modelling tools | QuantumATK is an integrated set of atomic-scale modelling tools developed since 2003 by professional software engineers in collaboration with academic researchers. While different aspects and individual modules of the platform have been previously presented, the purpose of this paper is to give a general overview of the platform. The QuantumATK simulation engines enable electronic-structure calculations using density functional theory or tight-binding model Hamiltonians, and also offers bonded or reactive empirical force fields in many different parametrizations. Density functional theory is implemented using either a plane-wave basis or expansion of electronic states in a linear combination of atomic orbitals",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://docs.quantumatk.com/index.html",
    "lastUpdate": "2020-12-11T15:07:22Z",
    "name": "QuantumATK",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1088/1361-648X/AB4007",
            "metadata": {
                "abstract": "© 2019 IOP Publishing Ltd.QuantumATK is an integrated set of atomic-scale modelling tools developed since 2003 by professional software engineers in collaboration with academic researchers. While different aspects and individual modules of the platform have been previously presented, the purpose of this paper is to give a general overview of the platform. The QuantumATK simulation engines enable electronic-structure calculations using density functional theory or tight-binding model Hamiltonians, and also offers bonded or reactive empirical force fields in many different parametrizations. Density functional theory is implemented using either a plane-wave basis or expansion of electronic states in a linear combination of atomic orbitals. The platform includes a long list of advanced modules, including Green's-function methods for electron transport simulations and surface calculations, first-principles electron-phonon and electron-photon couplings, simulation of atomic-scale heat transport, ion dynamics, spintronics, optical properties of materials, static polarization, and more. Seamless integration of the different simulation engines into a common platform allows for easy combination of different simulation methods into complex workflows. Besides giving a general overview and presenting a number of implementation details not previously published, we also present four different application examples. These are calculations of the phonon-limited mobility of Cu, Ag and Au, electron transport in a gated 2D device, multi-model simulation of lithium ion drift through a battery cathode in an external electric field, and electronic-structure calculations of the composition-dependent band gap of SiGe alloys.",
                "authors": [
                    {
                        "name": "Smidstrup S."
                    },
                    {
                        "name": "Markussen T."
                    },
                    {
                        "name": "Vancraeyveld P."
                    },
                    {
                        "name": "Wellendorff J."
                    },
                    {
                        "name": "Schneider J."
                    },
                    {
                        "name": "Gunst T."
                    },
                    {
                        "name": "Verstichel B."
                    },
                    {
                        "name": "Stradi D."
                    },
                    {
                        "name": "Khomyakov P.A."
                    },
                    {
                        "name": "Vej-Hansen U.G."
                    },
                    {
                        "name": "Lee M.-E."
                    },
                    {
                        "name": "Chill S.T."
                    },
                    {
                        "name": "Rasmussen F."
                    },
                    {
                        "name": "Penazzi G."
                    },
                    {
                        "name": "Corsetti F."
                    },
                    {
                        "name": "Ojanpera A."
                    },
                    {
                        "name": "Jensen K."
                    },
                    {
                        "name": "Palsgaard M.L.N."
                    },
                    {
                        "name": "Martinez U."
                    },
                    {
                        "name": "Blom A."
                    },
                    {
                        "name": "Brandbyge M."
                    },
                    {
                        "name": "Stokbro K."
                    }
                ],
                "citationCount": 138,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Physics Condensed Matter",
                "title": "QuantumATK: An integrated platform of electronic and atomic-scale modelling tools"
            },
            "pmid": "31470430"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}