
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Python"
        ],
        "license": "GPL-3.0",
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 American Chemical Society.Metagenomic approaches focus on taxonomy or gene annotation but lack power in defining functionality of gut microbiota. Therefore, metaproteomics approaches have been introduced to overcome this limitation. However, the common metaproteomics approach uses data-dependent acquisition mass spectrometry, which is known to have limited reproducibility when analyzing samples with complex microbial composition. In this work, we provide a proof of concept for data-independent acquisition (DIA) metaproteomics. To this end, we analyze metaproteomes using DIA mass spectrometry and introduce an open-source data analysis software package, diatools, which enables accurate and consistent quantification of DIA metaproteomics data. We demonstrate the feasibility of our approach in gut microbiota metaproteomics using laboratory-assembled microbial mixtures as well as human fecal samples.",
            "authors": [
                "Aakko J.",
                "Pietila S.",
                "Suomi T.",
                "Mahmoudian M.",
                "Toivonen R.",
                "Kouvonen P.",
                "Rokka A.",
                "Hanninen A.",
                "Elo L.L."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JPROTEOME.9B00606",
            "journal": "Journal of Proteome Research",
            "pmid": "31755272",
            "title": "Data-Independent Acquisition Mass Spectrometry in Metaproteomics of Gut Microbiota - Implementation and Computational Analysis",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:diatools",
        "biotoolsID": "diatools",
        "description": "Data-Independent Acquisition Mass Spectrometry in Metaproteomics of Gut Microbiota-Implementation and Computational Analysis.\n\nDiatools is a software package for analyzing mass-spectrometer data acquired using data independent acquisition (DIA) mode. Currently, diatools consists of a single workflow for building a spectral library from data dependent aquisition mode (DDA) data and for analyzing DIA samples with the spectral library. The spectral library is built according to the protocol described in Schubert et al. 2015. The DIA data analysis is done with OpenSWATH software and the end result is a peptide intensity matrix. Optionally, a differential expression analysis of sample groups is performed.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'metaproteomics'",
        "homepage": "https://github.com/elolab/diatools",
        "name": "diatools"
    }
}