{
    "accessibility": [],
    "additionDate": "2017-12-18T00:12:35Z",
    "biotoolsCURIE": "biotools:snp2hla",
    "biotoolsID": "snp2hla",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://immunogenomics.hms.harvard.edu/"
        }
    ],
    "description": "Impute amino acid polymorphisms and single nucleotide polymorphisms in human luekocyte antigenes (HLA) within the major histocompatibility complex (MHC) region in chromosome 6.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://software.broadinstitute.org/mpg/snp2hla/snp2hla_manual.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.broadinstitute.org/mpg/snp2hla/",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/snp2hla-1-0-1-imputation-of-amino-acid-polymorphisms-in-human-leukocyte-antigens.html"
        }
    ],
    "maturity": null,
    "name": "SNP2HLA",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0064683",
            "metadata": {
                "abstract": "DNA sequence variation within human leukocyte antigen (HLA) genes mediate susceptibility to a wide range of human diseases. The complex genetic structure of the major histocompatibility complex (MHC) makes it difficult, however, to collect genotyping data in large cohorts. Long-range linkage disequilibrium between HLA loci and SNP markers across the major histocompatibility complex (MHC) region offers an alternative approach through imputation to interrogate HLA variation in existing GWAS data sets. Here we describe a computational strategy, SNP2HLA, to impute classical alleles and amino acid polymorphisms at class I (HLA-A, -B, -C) and class II (-DPA1, -DPB1, -DQA1, -DQB1, and -DRB1) loci. To characterize performance of SNP2HLA, we constructed two European ancestry reference panels, one based on data collected in HapMap-CEPH pedigrees (90 individuals) and another based on data collected by the Type 1 Diabetes Genetics Consortium (T1DGC, 5,225 individuals). We imputed HLA alleles in an independent data set from the British 1958 Birth Cohort (N = 918) with gold standard four-digit HLA types and SNPs genotyped using the Affymetrix GeneChip 500 K and Illumina Immunochip microarrays. We demonstrate that the sample size of the reference panel, rather than SNP density of the genotyping platform, is critical to achieve high imputation accuracy. Using the larger T1DGC reference panel, the average accuracy at four-digit resolution is 94.7% using the low-density Affymetrix GeneChip 500 K, and 96.7% using the high-density Illumina Immunochip. For amino acid polymorphisms within HLA genes, we achieve 98.6% and 99.3% accuracy using the Affymetrix GeneChip 500 K and Illumina Immunochip, respectively. Finally, we demonstrate how imputation and association testing at amino acid resolution can facilitate fine-mapping of primary MHC association signals, giving a specific example from type 1 diabetes. © 2013 Jia et al.",
                "authors": [
                    {
                        "name": "Jia X."
                    },
                    {
                        "name": "Han B."
                    },
                    {
                        "name": "Onengut-Gumuscu S."
                    },
                    {
                        "name": "Chen W.-M."
                    },
                    {
                        "name": "Concannon P.J."
                    },
                    {
                        "name": "Rich S.S."
                    },
                    {
                        "name": "Raychaudhuri S."
                    },
                    {
                        "name": "de Bakker P.I.W."
                    }
                ],
                "citationCount": 254,
                "date": "2013-06-06T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Imputing Amino Acid Polymorphisms in Human Leukocyte Antigens"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.3"
    ]
}