{
    "additionDate": "2021-01-25T09:52:52Z",
    "biotoolsCURIE": "biotools:panoromics",
    "biotoolsID": "panoromics",
    "description": "The massive molecular profiling of thousands of cancer patients has led to the identification of many tumor type specific driver genes. However, only a few (or none) of them are present in each individual tumor and, to enable precision oncology, we need to interpret the alterations found in a single patient. Cancer PanorOmics (http://panoromics.irbbarcelona.org) is a web-based resource to contextualize genomic variations detected in a personal cancer genome within the body of clinical and scientific evidence available\u2028for 26 tumor types, offering complementary cohort and patient-centric views. Additionally, it explores the cellular environment of mutations by mapping them on the human interactome and providing quasiatomic structural details, whenever available. This ‘PanorOmic’ molecular view of individual tumors should contribute to the identification of actionable alterations ultimately guiding the clinical decision-making process.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://panoromics.irbbarcelona.org",
    "lastUpdate": "2021-01-25T09:53:33Z",
    "name": "PanorOmics",
    "owner": "ptck72",
    "publication": [
        {
            "doi": "10.1093/nar/gkx311",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.The massive molecular profiling of thousands of cancer patients has led to the identification of many tumor type specific driver genes. However, only a few (or none) of them are present in each individual tumor and, to enable precision oncology, we need to interpret the alterations found in a single patient. Cancer PanorOmics (http://panoromics.irbbarcelona.org) is a web-based resource to contextualize genomic variations detected in a personal cancer genome within the body of clinical and scientific evidence available for 26 tumor types, offering complementary cohort- and patient-centric views. Additionally, it explores the cellular environment of mutations by mapping them on the human interactome and providing quasi-atomic structural details, whenever available. This PanorOmic' molecular view of individual tumors, together with the appropriate genetic counselling and medical advice, should contribute to the identification of actionable alterations ultimately guiding the clinical decision-making process.",
                "authors": [
                    {
                        "name": "Mateo L."
                    },
                    {
                        "name": "Guitart-Pla O."
                    },
                    {
                        "name": "Pons C."
                    },
                    {
                        "name": "Duran-Frigola M."
                    },
                    {
                        "name": "Mosca R."
                    },
                    {
                        "name": "Aloy P."
                    }
                ],
                "citationCount": 5,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A PanorOmic view of personal cancer genomes"
            },
            "pmid": "28453651"
        }
    ],
    "validated": 1
}