
{
    "credit": [
        {
            "email": "zsh@amss.ac.cn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://page.amss.ac.cn/shihua.zhang/"
        }
    ],
    "documentation": [
        {
            "url": "http://page.amss.ac.cn/shihua.zhang/software.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Functional genomics",
                "uri": "http://edamontology.org/topic_0085"
            },
            {
                "term": "Applied mathematics",
                "uri": "http://edamontology.org/topic_3569"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/jnmf-discovery-of-combinatorial-patterns.html"
        }
    ],
    "publication": [
        {
            "abstract": "Recent technology has made it possible to simultaneously perform multi-platform genomic profiling (e.g. DNA methylation (DM) and gene expression (GE)) of biological samples, resulting in so-called 'multi-dimensional genomic data'. Such data provide unique opportunities to study the coordination between regulatory mechanisms on multiple levels. However, integrative analysis of multi-dimensional genomics data for the discovery of combinatorial patterns is currently lacking. Here, we adopt a joint matrix factorization technique to address this challenge. This method projects multiple types of genomic data onto a common coordinate system, in which heterogeneous variables weighted highly in the same projected direction form a multi-dimensional module (md-module). Genomic variables in such modules are characterized by significant correlations and likely functional associations. We applied this method to the DM, GE, and microRNA expression data of 385 ovarian cancer samples from the The Cancer Genome Atlas project. These md-modules revealed perturbed pathways that would have been overlooked with only a single type of data, uncovered associations between different layers of cellular activities and allowed the identification of clinically distinct patient subgroups. Our study provides an useful protocol for uncovering hidden patterns and their biological implications in multi-dimensional 'omic' data. © 2012 The Author(s).",
            "authors": [
                "Zhang S.",
                "Liu C.-C.",
                "Li W.",
                "Shen H.",
                "Laird P.W.",
                "Zhou X.J."
            ],
            "cit_count": 105,
            "journal": "Nucleic Acids Research",
            "pmid": "22879375",
            "title": "Discovery of multi-dimensional modules by integrative analysis of cancer genomic data",
            "year": "2012-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jnmf",
        "biotoolsID": "jnmf",
        "description": "Package which implemented the joint matrix factorization technique to integrating multi-dimensional genomics data for the discovery of combinatorial patterns.",
        "homepage": "http://page.amss.ac.cn/shihua.zhang/software.html",
        "name": "jNMF"
    }
}