{
    "additionDate": "2019-11-14T19:39:47Z",
    "biotoolsCURIE": "biotools:EvolClust",
    "biotoolsID": "EvolClust",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "confidence_flag": "tool",
    "description": "EvolClust predicts groups of genes that are conserved in terms of gene order across different species distinguishing it from the background gene order conservation found between species. We define a cluster as a group of homologous proteins that are found grouped together in at least two different genomes and which are more conserved than what is expected for the pair of genomes. The order of the genes inside the cluster is not necessarily conserved. Pairwise clusters are grouped into multi-species families.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://evolclustdb.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-17T15:27:20.835714Z",
    "name": "EvolClust",
    "owner": "Gabaldonlab",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ706",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: The evolution and role of gene clusters in eukaryotes is poorly understood. Currently, most studies and computational prediction programs limit their focus to specific types of clusters, such as those involved in secondary metabolism. Results: We present EvolClust, a python-based tool for the inference of evolutionary conserved gene clusters from genome comparisons, independently of the function or gene composition of the cluster. EvolClust predicts conserved gene clusters from pairwise genome comparisons and infers families of related clusters from multiple (all versus all) genome comparisons.",
                "authors": [
                    {
                        "name": "Gabaldon T."
                    },
                    {
                        "name": "Marcet-Houben M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EvolClust: Automated inference of evolutionary conserved gene clusters in eukaryotes"
            },
            "pmid": "31560365"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}
