{
    "additionDate": "2019-11-14T19:39:47Z",
    "biotoolsCURIE": "biotools:EvolClust",
    "biotoolsID": "EvolClust",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "confidence_flag": "tool",
    "description": "EvolClust predicts groups of genes that are conserved in terms of gene order across different species distinguishing it from the background gene order conservation found between species. We define a cluster as a group of homologous proteins that are found grouped together in at least two different genomes and which are more conserved than what is expected for the pair of genomes. The order of the genes inside the cluster is not necessarily conserved. Pairwise clusters are grouped into multi-species families.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://evolclustdb.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:49:15.851119Z",
    "name": "EvolClust",
    "owner": "Gabaldonlab",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz706",
            "metadata": {
                "abstract": "Motivation: The evolution and role of gene clusters in eukaryotes is poorly understood. Currently, most studies and computational prediction programs limit their focus to specific types of clusters, such as those involved in secondary metabolism. Results: We present EvolClust, a python-based tool for the inference of evolutionary conserved gene clusters from genome comparisons, independently of the function or gene composition of the cluster. EvolClust predicts conserved gene clusters from pairwise genome comparisons and infers families of related clusters from multiple (all versus all) genome comparisons.",
                "authors": [
                    {
                        "name": "Gabaldon T."
                    },
                    {
                        "name": "Marcet-Houben M."
                    }
                ],
                "citationCount": 12,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EvolClust: Automated inference of evolutionary conserved gene clusters in eukaryotes"
            },
            "pmcid": "PMC7703780",
            "pmid": "31560365",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1016/j.jmb.2023.168013",
            "metadata": {
                "abstract": "Conservation of gene neighbourhood over evolutionary distances is generally indicative of shared regulation or functional association among genes. This concept has been broadly exploited in prokaryotes but its use on eukaryotic genomes has been limited to specific functional classes, such as biosynthetic gene clusters. We here used an evolutionary-based gene cluster discovery algorithm (EvolClust) to pre-compute evolutionarily conserved gene neighbourhoods, which can be searched, browsed and downloaded in EvolClustDB. We inferred ∼35,000 cluster families in 882 different species in genome comparisons of five taxonomically broad clades: Fungi, Plants, Metazoans, Insects and Protists. EvolClustDB allows browsing through the cluster families, as well as searching by protein, species, identifier or sequence. Visualization allows inspecting gene order per species in a phylogenetic context, so that relevant evolutionary events such as gain, loss or transfer, can be inferred. EvolClustDB is freely available, without registration, at http://evolclustdb.org/.",
                "authors": [
                    {
                        "name": "Chorostecki U."
                    },
                    {
                        "name": "Collado-Cala I."
                    },
                    {
                        "name": "Fuentes-Palacios D."
                    },
                    {
                        "name": "Gabaldon T."
                    },
                    {
                        "name": "Garisoain-Zafra A."
                    },
                    {
                        "name": "Gomez A.D."
                    },
                    {
                        "name": "Marcet-Houben M."
                    },
                    {
                        "name": "Molina M."
                    }
                ],
                "citationCount": 5,
                "date": "2023-07-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "EvolClustDB: Exploring Eukaryotic Gene Clusters with Evolutionarily Conserved Genomic Neighbourhoods"
            },
            "pmid": "36806474",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
