{
    "additionDate": "2020-01-14T09:50:25Z",
    "biotoolsCURIE": "biotools:molprobity_3d",
    "biotoolsID": "molprobity_3d",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jsr@kinemage.biochem.duke.edu",
            "name": "Jane S. Richardson",
            "orcidid": "https://orcid.org/0000-0002-3311-2944",
            "typeEntity": "Person"
        }
    ],
    "description": "CaBLAM for CryoEM backbone, UnDowser to rethink \"waters,\" and NGL Viewer to recapture online 3D graphics.\n\nFile Upload/Retrieval (more options).\n\nCCTBX, which powers this version of MolProbity (4.2), requires stricter adherence to PDB format. If you are having trouble with version 4.2 try using MolProbity4 legacy version 4.02 at http://rutile.biochem.duke.edu. Note that not all features are supported on legacy 4.02 and we suggest repairing your PDB format instead.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                }
            ]
        }
    ],
    "homepage": "http://molprobity.manchester.ac.uk",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2020-12-29T10:50:49Z",
    "name": "MolProbity_3D",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/PRO.3786",
            "metadata": {
                "abstract": "© 2019 The Protein SocietyThe MolProbity web service provides macromolecular model validation to help correct local errors, for the structural biology community worldwide. Here we highlight new validation features, and also describe how we are fighting back against outside developments which compromise that mission. Our new tool called UnDowser analyzes the properties and context of clashing HOH “waters” to diagnose what they might actually represent; a dozen distinct scenarios are illustrated and described. We now treat alternate conformations more thoroughly, and switching to the Neo4j database (graphical rather than relational) enables cleaner, more comprehensive, and much larger reference datasets. A problematic outside change is that refinement software now increasingly restrains traditional validation criteria (geometry, clashes, rotamers, and even Ramachandran) in order to supplement the sparser experimental data at 3–4 Å resolutions typical of modern cryoEM. But unfortunately the broad density allows model optimization without fixing underlying problems, which means these structures often score much better on validation than they really are. CaBLAM, our tool designed for evaluating peptide orientations at lower resolutions, was described in the previous Tools issue, and here we demonstrate its effectiveness in diagnosing local errors even when other validation outliers have been artificially removed. Sophisticated hacking of the MolProbity server has required continual monitoring and various security measures short of restricting user access. The deprecation of Java applets now prevents KiNG interactive online display of outliers on the 3D model during a MolProbity run, but that important functionality has now been recaptured with a modified version of the Javascript NGL Viewer.",
                "authors": [
                    {
                        "name": "Prisant M.G."
                    },
                    {
                        "name": "Williams C.J."
                    },
                    {
                        "name": "Chen V.B."
                    },
                    {
                        "name": "Richardson J.S."
                    },
                    {
                        "name": "Richardson D.C."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "New tools in MolProbity validation: CaBLAM for CryoEM backbone, UnDowser to rethink “waters,” and NGL Viewer to recapture online 3D graphics"
            },
            "pmcid": "PMC6933861",
            "pmid": "31724275"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        }
    ],
    "validated": 1
}