{
    "additionDate": "2017-12-18T00:09:18Z",
    "biotoolsCURIE": "biotools:metamos",
    "biotoolsID": "metamos",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cbcb.umd.edu/"
        }
    ],
    "description": "MetAMOS is an open source and modular metagenomic assembly and analysis pipeline. MetAMOS represents an important step towards fully automated metagenomic analysis, starting with next-generation sequencing reads and producing genomic scaffolds, open-reading frames and taxonomic or functional annotations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://metamos.readthedocs.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Generation",
                    "uri": "http://edamontology.org/operation_3429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://cbcb.umd.edu/software/metAMOS",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2021-04-22T06:14:34Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/metamos-1-3-1-metagenomic-assembly-pipeline-amos.html"
        }
    ],
    "name": "MetAMOS",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_011914"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-126",
            "metadata": {
                "abstract": "Background: The continued democratization of DNA sequencing has sparked a new wave of development of genome assembly and assembly validation methods. As individual research labs, rather than centralized centers, begin to sequence the majority of new genomes, it is important to establish best practices for genome assembly. However, recent evaluations such as GAGE and the Assemblathon have concluded that there is no single best approach to genome assembly. Instead, it is preferable to generate multiple assemblies and validate them to determine which is most useful for the desired analysis; this is a labor-intensive process that is often impossible or unfeasible.Results: To encourage best practices supported by the community, we present iMetAMOS, an automated ensemble assembly pipeline; iMetAMOS encapsulates the process of running, validating, and selecting a single assembly from multiple assemblies. iMetAMOS packages several leading open-source tools into a single binary that automates parameter selection and execution of multiple assemblers, scores the resulting assemblies based on multiple validation metrics, and annotates the assemblies for genes and contaminants. We demonstrate the utility of the ensemble process on 225 previously unassembled Mycobacterium tuberculosis genomes as well as a Rhodobacter sphaeroides benchmark dataset. On these real data, iMetAMOS reliably produces validated assemblies and identifies potential contamination without user intervention. In addition, intelligent parameter selection produces assemblies of R. sphaeroides comparable to or exceeding the quality of those from the GAGE-B evaluation, affecting the relative ranking of some assemblers.Conclusions: Ensemble assembly with iMetAMOS provides users with multiple, validated assemblies for each genome. Although computationally limited to small or mid-sized genomes, this approach is the most effective and reproducible means for generating high-quality assemblies and enables users to select an assembly best tailored to their specific needs. © 2014 Koren et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Koren S."
                    },
                    {
                        "name": "Treangen T.J."
                    },
                    {
                        "name": "Hill C.M."
                    },
                    {
                        "name": "Pop M."
                    },
                    {
                        "name": "Phillippy A.M."
                    }
                ],
                "citationCount": 38,
                "date": "2014-05-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Automated ensemble assembly and validation of microbial genomes"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/gb-2013-14-1-r2",
            "metadata": {
                "abstract": "© 2013 Treangen et al.We describe MetAMOS, an open source and modular metagenomic assembly and analysis pipeline. MetAMOS represents an important step towards fully automated metagenomic analysis, starting with next-generation sequencing reads and producing genomic scaffolds, open-reading frames and taxonomic or functional annotations. MetAMOS can aid in reducing assembly errors, commonly encountered when assembling metagenomic samples, and improves taxonomic assignment accuracy while also reducing computational cost. MetAMOS can be downloaded from: https://github.com/treangen/MetAMOS.",
                "authors": [
                    {
                        "name": "Treangen T.J."
                    },
                    {
                        "name": "Koren S."
                    },
                    {
                        "name": "Sommer D.D."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Astrovskaya I."
                    },
                    {
                        "name": "Ondov B."
                    },
                    {
                        "name": "Darling A.E."
                    },
                    {
                        "name": "Phillippy A.M."
                    },
                    {
                        "name": "Pop M."
                    }
                ],
                "citationCount": 120,
                "date": "2013-01-15T00:00:00Z",
                "journal": "Genome Biology",
                "title": "MetAMOS: A modular and open source metagenomic assembly and analysis pipeline"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.5rc3"
    ]
}