
{
    "credit": [
        {
            "email": "trevor.lithgow@monash.edu",
            "name": "Trevor Lithgow",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "jiangning.song@monash.edu",
            "name": "Jiangning Song",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://possum.erc.monash.edu/help.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Evolutionary information in the form of a Position-Specific Scoring Matrix (PSSM) is a widely used and highly informative representation of protein sequences. Accordingly, PSSM-based feature descriptors have been successfully applied to improve the performance of various predictors of protein attributes. Even though a number of algorithms have been proposed in previous studies, there is currently no universal web server or toolkit available for generating this wide variety of descriptors. Here, we present POSSUM (Position-Specific Scoring matrix-based feature generator for machine learning), a versatile toolkit with an online web server that can generate 21 types of PSSMbased feature descriptors, thereby addressing a crucial need for bioinformaticians and computational biologists. We envisage that this comprehensive toolkit will be widely used as a powerful tool to facilitate feature extraction, selection, and benchmarking of machine learning-based models, thereby contributing to a more effective analysis and modeling pipeline for bioinformatics research. VC The Author 2017. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Wang J.",
                "Yang B.",
                "Revote J.",
                "Leier A.",
                "Marquez-Lago T.T.",
                "Webb G.",
                "Song J.",
                "Chou K.-C.",
                "Lithgow T."
            ],
            "cit_count": 31,
            "doi": "10.1093/bioinformatics/btx302",
            "journal": "Bioinformatics",
            "title": "POSSUM: A bioinformatics toolkit for generating numerical sequence feature descriptors based on PSSM profiles",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:possum-pssm",
        "biotoolsID": "possum-pssm",
        "description": "Bioinformatics toolkit for generating numerical sequence feature descriptors based on PSSM profiles.",
        "homepage": "http://possum.erc.monash.edu/",
        "name": "POSSUM"
    }
}