{
    "additionDate": "2020-01-14T19:45:40Z",
    "biotoolsCURIE": "biotools:MIRIA",
    "biotoolsID": "MIRIA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shuaicli@cityu.edu.hk",
            "name": "Shuai Cheng Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A webserver for statistical, visual and meta-analysis of RNA editing data in mammals.\n\nBACKGROUND:Adenosine-to-inosine RNA editing can markedly diversify the transcriptome, leading to a variety of critical molecular and biological processes in mammals. Over the past several years, researchers have developed several new pipelines and software packages to identify RNA editing sites with a focus on downstream statistical analysis and functional interpretation. RESULTS:Here, we developed a user-friendly public webserver named MIRIA that integrates statistics and visualization techniques to facilitate the comprehensive analysis of RNA editing sites data identified by the pipelines and software packages.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://mammal.deepomics.org/",
    "lastUpdate": "2020-12-29T09:04:08Z",
    "name": "MIRIA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3242-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Adenosine-to-inosine RNA editing can markedly diversify the transcriptome, leading to a variety of critical molecular and biological processes in mammals. Over the past several years, researchers have developed several new pipelines and software packages to identify RNA editing sites with a focus on downstream statistical analysis and functional interpretation. Results: Here, we developed a user-friendly public webserver named MIRIA that integrates statistics and visualization techniques to facilitate the comprehensive analysis of RNA editing sites data identified by the pipelines and software packages. MIRIA is unique in that provides several analytical functions, including RNA editing type statistics, genomic feature annotations, editing level statistics, genome-wide distribution of RNA editing sites, tissue-specific analysis and conservation analysis. We collected high-throughput RNA sequencing (RNA-seq) data from eight tissues across seven species as the experimental data for MIRIA and constructed an example result page. Conclusion: MIRIA provides both visualization and analysis of mammal RNA editing data for experimental biologists who are interested in revealing the functions of RNA editing sites. MIRIA is freely available at https://mammal.deepomics.org.",
                "authors": [
                    {
                        "name": "Feng X."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li S.C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MIRIA: A webserver for statistical, visual and meta-analysis of RNA editing data in mammals"
            },
            "pmcid": "PMC6923819",
            "pmid": "31861975"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}