{
    "additionDate": "2018-05-18T14:40:01Z",
    "biotoolsCURIE": "biotools:frama",
    "biotoolsID": "frama",
    "credit": [
        {
            "email": "mbens@fli-leibniz.de",
            "name": "Bens M",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "szafrans@fli-leibniz.de",
            "name": "Szafranski K",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A transcriptome assembly and mRNA annotation pipeline, which utilizies external and newly developed software components.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/gengit/FRAMA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gengit/FRAMA",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "FRAMA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-015-2349-8",
            "metadata": {
                "abstract": "© 2016 Bens et al.Background: Advances in second-generation sequencing of RNA made a near-complete characterization of transcriptomes affordable. However, the reconstruction of full-length mRNAs via de novo RNA-seq assembly is still difficult due to the complexity of eukaryote transcriptomes with highly similar paralogs and multiple alternative splice variants. Here, we present FRAMA, a genome-independent annotation tool for de novo mRNA assemblies that addresses several post-assembly tasks, such as reduction of contig redundancy, ortholog assignment, correction of misassembled transcripts, scaffolding of fragmented transcripts and coding sequence identification. Results: We applied FRAMA to assemble and annotate the transcriptome of the naked mole-rat and assess the quality of the obtained compilation of transcripts with the aid of publicy available naked mole-rat gene annotations. Based on a de novo transcriptome assembly (Trinity), FRAMA annotated 21,984 naked mole-rat mRNAs (12,100 full-length CDSs), corresponding to 16,887 genes. The scaffolding of 3488 genes increased the median sequence information 1.27-fold. In total, FRAMA detected and corrected 4774 misassembled genes, which were predominantly caused by fusion of genes. A comparison with three different sources of naked mole-rat transcripts reveals that FRAMA's gene models are better supported by RNA-seq data than any other transcript set. Further, our results demonstrate the competitiveness of FRAMA to state of the art genome-based transcript reconstruction approaches. Conclusion: FRAMA realizes the de novo construction of a low-redundant transcript catalog for eukaryotes, including the extension and refinement of transcripts. Thereby, results delivered by FRAMA provide the basis for comprehensive downstream analyses like gene expression studies or comparative transcriptomics. FRAMA is available at https://github.com/gengit/FRAMA.",
                "authors": [
                    {
                        "name": "Bens M."
                    },
                    {
                        "name": "Sahm A."
                    },
                    {
                        "name": "Groth M."
                    },
                    {
                        "name": "Jahn N."
                    },
                    {
                        "name": "Morhart M."
                    },
                    {
                        "name": "Holtze S."
                    },
                    {
                        "name": "Hildebrandt T.B."
                    },
                    {
                        "name": "Platzer M."
                    },
                    {
                        "name": "Szafranski K."
                    }
                ],
                "citationCount": 15,
                "date": "2016-01-14T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "FRAMA: From RNA-seq data to annotated mRNA assemblies"
            },
            "pmcid": "PMC4712544",
            "pmid": "26763976"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}