{
    "additionDate": "2017-12-18T00:07:04Z",
    "biotoolsCURIE": "biotools:gclust",
    "biotoolsID": "gclust",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://nsato4.c.u-tokyo.ac.jp/indexE.html"
        }
    ],
    "description": "Gclust software was developed to make clusters of protein sequences from all predicted protein sequences in a selected set of genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gclust.c.u-tokyo.ac.jp/help/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://gclust.c.u-tokyo.ac.jp/",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gclust-3-5-5z3-genome-wide-clustering.html"
        }
    ],
    "name": "Gclust",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp047",
            "metadata": {
                "abstract": "Motivation: Trans -kingdom protein clustering remained difficult because of large sequence divergence between eukaryotes and prokaryotes and the presence of a transit sequence in organellar proteins. A large-scale protein clustering including such divergent organisms needs a heuristic to efficiently select similar proteins by setting a proper threshold for homologs of each protein. Here a method is described using two similarity measures and organism count. Results: The Gclust software constructs minimal homolog groups using all-against-all BLASTP results by single-linkage clustering. Major points include (i) estimation of domain structure of proteins; (ii) exclusion of multi-domain proteins; (iii) explicit consideration of transit peptides; and (iv) heuristic estimation of a similarity threshold for homologs of each protein by entropy-optimized organism count method. The resultant clusters were evaluated in the light of power law. The software was used to construct protein clusters for up to 95 organisms. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Sato N."
                    }
                ],
                "citationCount": 34,
                "date": "2009-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Gclust: Trans-kingdom classification of proteins using automatic individual threshold setting"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "3.5.5z3"
    ]
}
