{"credit":[],"function":[{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"},{"term":"Sequence motif recognition","uri":"http://edamontology.org/operation_0239"},{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"},{"term":"Filtering","uri":"http://edamontology.org/operation_3695"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Virology","uri":"http://edamontology.org/topic_0781"},{"term":"Animals","uri":"http://edamontology.org/topic_3500"},{"term":"Plants","uri":"http://edamontology.org/topic_0780"},{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"Insignia is a web application for the rapid identification of unique DNA signatures. DNA signatures are distinct nucleotide sequences that can be used to detect the presence of certain organisms and to distinguish those organisms from all other species. These signatures can be used as the basis for diagnostic assays to detect and genotype microbes in both environmental and clinical samples. Insignia identifies an exhaustive set of accurate DNA signatures for any set of target genomes, and screens these signatures against a comprehensive background that includes all sequenced bacteria and viruses, the human genome, and many other animals and plants. Identified signatures may be browsed by genomic location or proximal genes, filtered by composition, viewed in a genome browser or directly downloaded. Integrated PCR primer design is also provided for each signature. The Insignia website (http://insignia.cbcb.umd.edu) is free and open to all users and there is no login requirement. In addition, the source code for the computational pipeline is freely available.","authors":["Phillippy A.M.","Ayanbule K.","Edwards N.J.","Salzberg S.L."],"cit_count":25,"journal":"Nucleic Acids Research","pmid":"19417071","title":"Insignia: A DNA signature search web server for diagnostic assay development","year":"2009-08-04"}],"summary":{"biotoolsCURIE":"biotools:insignia","biotoolsID":"insignia","description":"Web interface for identifying unique genomic signatures from a database of all current bacterial and viral genomic sequences. Input is any set of target and background genomes.","homepage":"http://insignia.cbcb.umd.edu","name":"Insignia"}}