{
    "additionDate": "2021-01-18T12:31:06Z",
    "biotoolsCURIE": "biotools:couplecoc",
    "biotoolsID": "couplecoc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhixianglin@cuhk.edu.hk",
            "name": "Zhixiang Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "Coupled co-clustering-based unsupervised transfer learning algorithm (coupleCoC) for the integrative analysis of multimodal single-cell data.  coupleCoC builds upon the information theoretic co-clustering framework. In co-clustering, both the cells and the genomic features are simultaneously clustered. Clustering similar genomic features reduces the noise in single-cell data and facilitates transfer of knowledge across single-cell datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cuhklinlab/coupleCoC",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-17T16:26:35Z",
    "name": "coupleCoC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA347",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Unsupervised methods, such as clustering methods, are essential to the analysis of single-cell genomic data. The most current clustering methods are designed for one data type only, such as single-cell RNA sequencing (scRNA-seq), single-cell ATAC sequencing (scATAC-seq) or sc-methylation data alone, and a few are developed for the integrative analysis of multiple data types. The integrative analysis of multimodal single-cell genomic data sets leverages the power in multiple data sets and can deepen the biological insight. In this paper, we propose a coupled co-clustering-based unsupervised transfer learning algorithm (coupleCoC) for the integrative analysis of multimodal single-cell data. Our proposed coupleCoC builds upon the information theoretic co-clustering framework. In co-clustering, both the cells and the genomic features are simultaneously clustered. Clustering similar genomic features reduces the noise in single-cell data and facilitates transfer of knowledge across single-cell datasets. We applied coupleCoC for the integrative analysis of scATAC-seq and scRNA-seq data, sc-methylation and scRNA-seq data and scRNA-seq data from mouse and human. We demonstrate that coupleCoC improves the overall clustering performance and matches the cell subpopulations across multimodal single-cell genomic datasets. Our method coupleCoC is also computationally efficient and can scale up to large datasets. Availability: The software and datasets are available at https://github.com/cuhklinlab/coupleCoC.",
                "authors": [
                    {
                        "name": "Lin Z."
                    },
                    {
                        "name": "Wangwu J."
                    },
                    {
                        "name": "Zeng P."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Coupled co-clustering-based unsupervised transfer learning for the integrative analysis of single-cell genomic data"
            },
            "pmid": "33279962"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
