{
    "additionDate": "2020-01-14T08:51:57Z",
    "biotoolsCURIE": "biotools:Meta-iAVP",
    "biotoolsID": "Meta-iAVP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong",
            "orcidid": "https://orcid.org/0000-0002-3394-8709",
            "typeEntity": "Person"
        }
    ],
    "description": "A Sequence-Based Meta-Predictor for Improving the Prediction of Antiviral Peptides Using Effective Feature Representation.\n\nIn spite of the large-scale production and widespread distribution of vaccines and antiviral drugs, viruses remain a prominent human disease. Recently, the discovery of antiviral peptides (AVPs) has become an influential antiviral agent due to their extraordinary advantages. With the avalanche of newly-found peptide sequences in the post-genomic era, there is a great demand to develop a sequence-based predictor for timely identifying AVPs as this information is very useful for both basic research and drug development. In this study, we propose a novel sequence-based meta-predictor with an effective feature representation, called Meta-iAVP, for the accurate prediction of AVPs from given peptide sequences. Herein, the effective feature representation was extracted from a set of prediction scores derived from various machine learning algorithms and types of features",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "http://codes.bio/meta-iavp/",
    "lastUpdate": "2020-12-23T08:55:12Z",
    "name": "Meta-iAVP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/IJMS20225743",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.In spite of the large-scale production and widespread distribution of vaccines and antiviral drugs, viruses remain a prominent human disease. Recently, the discovery of antiviral peptides (AVPs) has become an influential antiviral agent due to their extraordinary advantages. With the avalanche of newly-found peptide sequences in the post-genomic era, there is a great demand to develop a sequence-based predictor for timely identifying AVPs as this information is very useful for both basic research and drug development. In this study, we propose a novel sequence-based meta-predictor with an effective feature representation, called Meta-iAVP, for the accurate prediction of AVPs from given peptide sequences. Herein, the effective feature representation was extracted from a set of prediction scores derived from various machine learning algorithms and types of features. To the best of our knowledge, the model proposed herein represents the first meta-based approach for the prediction of AVPs. An overall accuracy and Matthews correlation coefficient of 95.20% and 0.90, respectively, was achieved from the independent test set on an objective benchmark dataset. Comparative analysis suggested that Meta-iAVP was superior to that of existing methods and therefore represents a useful tool for AVP prediction. Finally, in an effort to facilitate high-throughput prediction of AVPs, the model was deployed as the Meta-iAVP web server and is made freely available online at http://codes.bio/meta-iavp/ where users can submit query peptide sequences for determining the likelihood of whether or not these peptides are AVPs.",
                "authors": [
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Prachayasittikul V."
                    },
                    {
                        "name": "Schaduangrat N."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 30,
                "date": "2019-11-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Meta-iavp: A sequence-based meta-predictor for improving the prediction of antiviral peptides using effective feature representation"
            },
            "pmcid": "PMC6888698",
            "pmid": "31731751"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
