{
    "additionDate": "2017-08-03T18:48:05Z",
    "biotoolsCURIE": "biotools:ligap",
    "biotoolsID": "ligap",
    "credit": [
        {
            "email": "tarmo.aijo@gmail.com",
            "name": "Tarmo Äijö",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://users.ics.aalto.fi/tare/"
        }
    ],
    "description": "Allows integrative analysis and visualization of multiple lineages over whole time-course profiles.",
    "documentation": [
        {
            "type": "General",
            "url": "http://research.ics.aalto.fi/csb/software/ligap/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                }
            ]
        }
    ],
    "homepage": "http://research.ics.aalto.fi/csb/software/ligap/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ligap-20130505-identify-conditionlineage-specific-time-course-profiles.html"
        }
    ],
    "name": "LIGAP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: A proper balance between different T helper (Th) cell subsets is necessary for normal functioning of the adaptive immune system. Revealing key genes and pathways driving the differentiation to distinct Th cell lineages provides important insight into underlying molecular mechanisms and new opportunities for modulating the immune response. Previous computational methods to quantify and visualize kinetic differential expression data of three or more lineages to identify reciprocally regulated genes have relied on clustering approaches and regression methods which have time as a factor, but have lacked methods which explicitly model temporal behavior.Results: We studied transcriptional dynamics of human umbilical cord blood T helper cells cultured in absence and presence of cytokines promoting Th1 or Th2 differentiation. To identify genes that exhibit distinct lineage commitment dynamics and are specific for initiating differentiation to different Th cell subsets, we developed a novel computational methodology (LIGAP) allowing integrative analysis and visualization of multiple lineages over whole time-course profiles. Applying LIGAP to time-course data from multiple Th cell lineages, we identified and experimentally validated several differentially regulated Th cell subset specific genes as well as reciprocally regulated genes. Combining differentially regulated transcriptional profiles with transcription factor binding site and pathway information, we identified previously known and new putative transcriptional mechanisms involved in Th cell subset differentiation. All differentially regulated genes among the lineages together with an implementation of LIGAP are provided as an open-source resource.Conclusions: The LIGAP method is widely applicable to quantify differential time-course dynamics of many types of datasets and generalizes to any number of conditions. It summarizes all the time-course measurements together with the associated uncertainty for visualization and manual assessment purposes. Here we identified novel human Th subset specific transcripts as well as regulatory mechanisms important for the initiation of the Th cell subset differentiation. © 2012 Äijö et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Aijo T."
                    },
                    {
                        "name": "Edelman S.M."
                    },
                    {
                        "name": "Lonnberg T."
                    },
                    {
                        "name": "Larjo A."
                    },
                    {
                        "name": "Kallionpaa H."
                    },
                    {
                        "name": "Tuomela S."
                    },
                    {
                        "name": "Engstrom E."
                    },
                    {
                        "name": "Lahesmaa R."
                    },
                    {
                        "name": "Lahdesmaki H."
                    }
                ],
                "citationCount": 13,
                "date": "2012-10-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "An integrative computational systems biology approach identifies differentially regulated dynamic transcriptome signatures which drive the initiation of human T helper cell differentiation"
            },
            "pmid": "23110343"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        }
    ],
    "validated": 1
}