{
    "additionDate": "2017-08-03T18:49:08Z",
    "biotoolsCURIE": "biotools:mdloc",
    "biotoolsID": "mdloc",
    "credit": [
        {
            "email": "shatkay@cis.udel.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.eecis.udel.edu/~compbio/"
        }
    ],
    "description": "Dependency-Based Protein Subcellular Location Predictor.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://128.4.31.235/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://128.4.31.235/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mdloc-a-dependency-based-protein-subcellular-location-predictor.html"
        }
    ],
    "name": "MDLoc",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: Proteins are responsible for a multitude of vital tasks in all living organisms. Given that a protein's function and role are strongly related to its subcellular location, protein location prediction is an important research area. While proteins move from one location to another and can localize to multiple locations, most existing location prediction systems assign only a single location per protein. A few recent systems attempt to predict multiple locations for proteins, however, their performance leaves much room for improvement. Moreover, such systems do not capture dependencies among locations and usually consider locations as independent. We hypothesize that a multi-location predictor that captures location inter-dependencies can improve location predictions for proteins. Results: We introduce a probabilistic generative model for protein localization, and develop a system based on it - which we call MDLoc - that utilizes inter-dependencies among locations to predict multiple locations for proteins. The model captures location inter-dependencies using Bayesian networks and represents dependency between features and locations using a mixture model. We use iterative processes for learning model parameters and for estimating protein locations. We evaluate our classifier MDLoc, on a dataset of single- and multi-localized proteins derived from the DBMLoc dataset, which is the most comprehensive protein multi-localization dataset currently available. Our results, obtained by using MDLoc, significantly improve upon results obtained by an initial simpler classifier, as well as on results reported by other top systems.",
                "authors": [
                    {
                        "name": "Simha R."
                    },
                    {
                        "name": "Briesemeister S."
                    },
                    {
                        "name": "Kohlbacher O."
                    },
                    {
                        "name": "Shatkay H."
                    }
                ],
                "citationCount": 7,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Protein (multi-)location prediction: Utilizing interdependencies via a generative model"
            },
            "pmid": "26072505"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}