{
    "additionDate": "2018-10-11T17:43:25Z",
    "biotoolsCURIE": "biotools:repgenhmm",
    "biotoolsID": "repgenhmm",
    "credit": [
        {
            "email": "elhanati@lpt.ens.fr",
            "name": "Yuval Elthanati",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "repgenHMM is a dynamic programming tool to infer the rules of immune receptor generation from sequence data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/yuvalel/repgenhmm/src"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/yuvalel/repgenhmm/overview",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "repgenHMM",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw112",
            "metadata": {
                "abstract": "© The Author 2016.Motivation: The diversity of the immune repertoire is initially generated by random rearrangements of the receptor gene during early T and B cell development. Rearrangement scenarios are composed of random events-choices of gene templates, base pair deletions and insertions-described by probability distributions. Not all scenarios are equally likely, and the same receptor sequence may be obtained in several different ways. Quantifying the distribution of these rearrangements is an essential baseline for studying the immune system diversity. Inferring the properties of the distributions from receptor sequences is a computationally hard problem, requiring enumerating every possible scenario for every sampled receptor sequence. Results: We present a Hidden Markov model, which accounts for all plausible scenarios that can generate the receptor sequences. We developed and implemented a method based on the Baum-Welch algorithm that can efficiently infer the parameters for the different events of the rearrangement process. We tested our software tool on sequence data for both the alpha and beta chains of the T cell receptor. To test the validity of our algorithm, we also generated synthetic sequences produced by a known model, and confirmed that its parameters could be accurately inferred back from the sequences. The inferred model can be used to generate synthetic sequences, to calculate the probability of generation of any receptor sequence, as well as the theoretical diversity of the repertoire. We estimate this diversity to be ≈1023 for human T cells. The model gives a baseline to investigate the selection and dynamics of immune repertoires.",
                "authors": [
                    {
                        "name": "Elhanati Y."
                    },
                    {
                        "name": "Marcou Q."
                    },
                    {
                        "name": "Mora T."
                    },
                    {
                        "name": "Walczak A.M."
                    }
                ],
                "citationCount": 19,
                "date": "2016-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RepgenHMM: A dynamic programming tool to infer the rules of immune receptor generation from sequence data"
            },
            "pmcid": "PMC4920122",
            "pmid": "27153709",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1
}