{
    "additionDate": "2021-03-19T08:27:05Z",
    "biotoolsCURIE": "biotools:propedia",
    "biotoolsID": "propedia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raquelcm@dcc.ufmg.br",
            "name": "Raquel C. de Melo-Minardi",
            "typeEntity": "Person"
        }
    ],
    "description": "a database for protein-peptide identification based on a hybrid clustering algorithm.\n\nPROPEDIA is a database of peptide-protein complexes clusterized in three methodologies: (i) peptide sequences; (ii) structure interface; and (iii) binding sites. PROPEDIA main goal is to give new insights into peptide design of biotechnological interests.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://bioinfo.dcc.ufmg.br/propedia/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo.dcc.ufmg.br/propedia",
    "lastUpdate": "2021-03-30T12:26:03Z",
    "name": "Propedia",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03881-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Protein–peptide interactions play a fundamental role in a wide variety of biological processes, such as cell signaling, regulatory networks, immune responses, and enzyme inhibition. Peptides are characterized by low toxicity and small interface areas; therefore, they are good targets for therapeutic strategies, rational drug planning and protein inhibition. Approximately 10% of the ethical pharmaceutical market is protein/peptide-based. Furthermore, it is estimated that 40% of protein interactions are mediated by peptides. Despite the fast increase in the volume of biological data, particularly on sequences and structures, there remains a lack of broad and comprehensive protein–peptide databases and tools that allow the retrieval, characterization and understanding of protein–peptide recognition and consequently support peptide design. Results: We introduce Propedia, a comprehensive and up-to-date database with a web interface that permits clustering, searching and visualizing of protein–peptide complexes according to varied criteria. Propedia comprises over 19,000 high-resolution structures from the Protein Data Bank including structural and sequence information from protein–peptide complexes. The main advantage of Propedia over other peptide databases is that it allows a more comprehensive analysis of similarity and redundancy. It was constructed based on a hybrid clustering algorithm that compares and groups peptides by sequences, interface structures and binding sites. Propedia is available through a graphical, user-friendly and functional interface where users can retrieve, and analyze complexes and download each search data set. We performed case studies and verified that the utility of Propedia scores to rank promissing interacting peptides. In a study involving predicting peptides to inhibit SARS-CoV-2 main protease, we showed that Propedia scores related to similarity between different peptide complexes with SARS-CoV-2 main protease are in agreement with molecular dynamics free energy calculation. Conclusions: Propedia is a database and tool to support structure-based rational design of peptides for special purposes. Protein–peptide interactions can be useful to predict, classifying and scoring complexes or for designing new molecules as well. Propedia is up-to-date as a ready-to-use webserver with a friendly and resourceful interface and is available at: https://bioinfo.dcc.ufmg.br/propedia",
                "authors": [
                    {
                        "name": "Bastos L.L."
                    },
                    {
                        "name": "Fischer P.H.C."
                    },
                    {
                        "name": "Gomes I.S."
                    },
                    {
                        "name": "Mariano D."
                    },
                    {
                        "name": "Martins P.M."
                    },
                    {
                        "name": "Oliveira M.G.A."
                    },
                    {
                        "name": "Queiroz F.C."
                    },
                    {
                        "name": "Rocha R.E.O."
                    },
                    {
                        "name": "Santos L.H."
                    },
                    {
                        "name": "Silveira S.A."
                    },
                    {
                        "name": "de Lima L.H.F."
                    },
                    {
                        "name": "de Magalhaes M.T.Q."
                    },
                    {
                        "name": "de Melo-Minardi R.C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Propedia: a database for protein–peptide identification based on a hybrid clustering algorithm"
            },
            "pmcid": "PMC7776311",
            "pmid": "33388027"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
