{
    "additionDate": "2017-12-18T00:10:49Z",
    "biotoolsCURIE": "biotools:peakfinder",
    "biotoolsID": "peakfinder",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://efg2.com/"
        }
    ],
    "description": "PeakFinder program was developed to find cohesin binding sites represented by the peaks in yeast chromatin immunoprecipitation (ChIP) microarray data, but can be applied to plot any measurement against a parameter such as genome coordinate, to interactively analyze the measurement plot, and to annotate the peaks on the basis of local properties of the curve.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://research.stowers.org/gertonlab/peakfinder/PeakFinderUsersGuide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://research.stowers-institute.org/gertonlab/peakfinder/",
    "homepage_status": 1,
    "language": [
        "Delphi"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/peakfinder-1-0-find-cohesin-binding-sites-yeast-chip-microarray-data.html"
        }
    ],
    "name": "PeakFinder",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pbio.0020259",
            "metadata": {
                "abstract": "In eukaryotic cells, cohesin holds sister chromatids together until they separate into daughter cells during mitosis. We have used chromatin immunoprecipitation coupled with microarray analysis (ChIP chip) to produce a genome-wide description of cohesin binding to meiotic and mitotic chromosomes of Saccharomyces cerevisiae. A computer program, PeakFinder, enables flexible, automated identification and annotation of cohesin binding peaks in ChIP chip data. Cohesin sites are highly conserved in meiosis and mitosis, suggesting that chromosomes share a common underlying structure during different developmental programs. These sites occur with a semiperiodic spacing of 11 kb that correlates with AT content. The number of sites correlates with chromosome size; however, binding to neighboring sites does not appear to be cooperative. We observed a very strong correlation between cohesin sites and regions between convergent transcription units. The apparent incompatibility between transcription and cohesin binding exists in both meiosis and mitosis. Further experiments reveal that transcript elongation into a cohesin-binding site removes cohesin. A negative correlation between cohesin sites and meiotic recombination sites suggests meiotic exchange is sensitive to the chromosome structure provided by cohesin. The genome-wide view of mitotic and meiotic cohesin binding provides an important framework for the exploration of cohesins and cohesion in other genomes.",
                "authors": [
                    {
                        "name": "Glynn E.F."
                    },
                    {
                        "name": "Megee P.C."
                    },
                    {
                        "name": "Yu H.-G."
                    },
                    {
                        "name": "Mistrot C."
                    },
                    {
                        "name": "Unal E."
                    },
                    {
                        "name": "Koshland D.E."
                    },
                    {
                        "name": "DeRisi J.L."
                    },
                    {
                        "name": "Gerton J.L."
                    }
                ],
                "citationCount": 322,
                "date": "2004-09-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "Genome-wide mapping of the cohesin complex in the yeast Saccharomyces cerevisiae"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "ChiP",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Chromatin immunoprecipitation",
            "uri": "http://edamontology.org/topic_3656"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}