{
    "additionDate": "2021-01-18T11:19:05Z",
    "biotoolsCURIE": "biotools:repahr",
    "biotoolsID": "repahr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liaoxingyu@csu.edu.cn",
            "name": "Xingyu Liao",
            "orcidid": "https://orcid.org/0000-0002-0061-1317",
            "typeEntity": "Person"
        }
    ],
    "description": "an improved approach for de novo repeat identification by assembly of the high-frequency reads.\n\nRepAHR is used to identify repeats(repetitive sequences) in genome using Next-Generation Sequencing reads.\n\nBefore running RepAHR, need to edit 2 configure files: parameter_config_file and reads_config_file. Some parameters need to be set in the parameter_config_file.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinfomaticsCSU/RepAHR",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-02-06T13:04:16Z",
    "name": "RepAHR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03779-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Repetitive sequences account for a large proportion of eukaryotes genomes. Identification of repetitive sequences plays a significant role in many applications, such as structural variation detection and genome assembly. Many existing de novo repeat identification pipelines or tools make use of assembly of the high-frequency k-mers to obtain repeats. However, a certain degree of sequence coverage is required for assemblers to get the desired assemblies. On the other hand, assemblers cut the reads into shorter k-mers for assembly, which may destroy the structure of the repetitive regions. For the above reasons, it is difficult to obtain complete and accurate repetitive regions in the genome by using existing tools. Results: In this study, we present a new method called RepAHR for de novo repeat identification by assembly of the high-frequency reads. Firstly, RepAHR scans next-generation sequencing (NGS) reads to find the high-frequency k-mers. Secondly, RepAHR filters the high-frequency reads from whole NGS reads according to certain rules based on the high-frequency k-mer. Finally, the high-frequency reads are assembled to generate repeats by using SPAdes, which is considered as an outstanding genome assembler with NGS sequences. Conlusions: We test RepAHR on five data sets, and the experimental results show that RepAHR outperforms RepARK and REPdenovo for detecting repeats in terms of N50, reference alignment ratio, coverage ratio of reference, mask ratio of Repbase and some other metrics.",
                "authors": [
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Liao X."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RepAHR: an improved approach for de novo repeat identification by assembly of the high-frequency reads"
            },
            "pmcid": "PMC7574428",
            "pmid": "33076827"
        }
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
