{
    "additionDate": "2021-01-18T08:07:59Z",
    "biotoolsCURIE": "biotools:spherecon",
    "biotoolsID": "spherecon",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alexander.gress@helmholtz-hips.de",
            "name": "Alexander Gress",
            "typeEntity": "Person"
        }
    ],
    "description": "method for precise estimation of residue relative solvent accessible area from limited structural information.\n\nThis tool calculates an approximate values for relative solvent accessible area for single residues or whole amino acid chains in a PDB file. The method is based on calculating or estimating the number of atoms around a given amino acid residue that are located within a sphere with a cut-out cone.\n\nspherecon.py -i /Path/To/Input/File [-o /Path/To/Output/File] [-c chain] [-r residues] [--ca] [--bb] [--dm] -i: Path to an input file in PDB (Protein Data Bank) file format or distance matrix file in case of --dm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kalininalab/spherecon",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-21T13:50:41Z",
    "license": "LGPL-3.0",
    "name": "SphereCon",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA159",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: In proteins, solvent accessibility of individual residues is a factor contributing to their importance for protein function and stability. Hence one might wish to calculate solvent accessibility in order to predict the impact of mutations, their pathogenicity and for other biomedical applications. A direct computation of solvent accessibility is only possible if all atoms of a protein three-dimensional structure are reliably resolved. Results: We present SphereCon, a new precise measure that can estimate residue relative solvent accessibility (RSA) from limited data. The measure is based on calculating the volume of intersection of a sphere with a cone cut out in the direction opposite of the residue with surrounding atoms. We propose a method for estimating the position and volume of residue atoms in cases when they are not known from the structure, or when the structural data are unreliable or missing. We show that in cases of reliable input structures, SphereCon correlates almost perfectly with the directly computed RSA, and outperforms other previously suggested indirect methods. Moreover, SphereCon is the only measure that yields accurate results when the identities of amino acids are unknown. A significant novel feature of SphereCon is that it can estimate RSA from inter-residue distance and contact matrices, without any information about the actual atom coordinates. Contact: alexander.gress@helmholtz-hips.de",
                "authors": [
                    {
                        "name": "Gress A."
                    },
                    {
                        "name": "Kalinina O.V."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SphereCon - A method for precise estimation of residue relative solvent accessible area from limited structural information"
            },
            "pmid": "32154837"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ]
}