{
    "accessibility": "Open access",
    "additionDate": "2022-08-18T23:00:48.363162Z",
    "biotoolsCURIE": "biotools:phagecocktail",
    "biotoolsID": "phagecocktail",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Felipe Molina",
            "orcidid": "https://orcid.org/0000-0002-9167-7097"
        },
        {
            "name": "María Victoria Díaz-Galián",
            "orcidid": "https://orcid.org/0000-0003-2543-6081"
        },
        {
            "name": "Miguel A. Vega-Rodríguez",
            "orcidid": "https://orcid.org/0000-0002-3003-758X"
        }
    ],
    "description": "An R package to design phage cocktails from experimental phage-bacteria infection networks.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/PhageCocktail/PhageCocktail.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://cran.r-project.org/web/packages/PhageCocktail/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-18T23:00:48.365835Z",
    "license": "GPL-3.0",
    "name": "PhageCocktail",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2022.106865",
            "metadata": {
                "abstract": "© 2022 The AuthorsBackground and objective: Phage therapy is a resurgent strategy used in medicine and the food industry to lyse bacteria that cause damage to health or spoil a food product. Frequently, phage-bacteria infection networks have a large size, making it impossible to manually study all possible phage cocktails. Thus, this article presents an R package called PhageCocktail to automatically design efficient phage cocktails from phage-bacteria infection networks. Methods: This R package includes four different methods for designing phage cocktails: ExhaustiveSearch, ExhaustivePhi, ClusteringSearch, and ClusteringPhi. These four methods are explained in detail and are evaluated using 13 empirical phage-bacteria infection networks. More specifically, runtime and expected success (fraction of lysed bacteria) are analyzed. Results: The four methods have variations in terms of runtime and quality of the results. ExhaustiveSearch always provides the best possible phage cocktail, but its runtime could be long. ExhaustivePhi only focuses on one cocktail size, the one estimated as the best; thus, its runtime is less than ExhaustiveSearch, but it can produce cocktails with more phages than necessary. ClusteringSearch and ClusteringPhi are very fast (generally, less than one millisecond), providing always immediate results due to clustering techniques, but their accuracies can be lower, yielding cocktails with lower expected successes. Conclusions: The larger the phage-bacteria infection network is, the more complex its analysis is. Thus, this tool eases this task for scientists and other users while designing phage cocktails of good quality. This R package includes four different methods; therefore, users may choose among them, considering their preferences in speed and accuracy of results.",
                "authors": [
                    {
                        "name": "Diaz-Galian M.V."
                    },
                    {
                        "name": "Molina F."
                    },
                    {
                        "name": "Vega-Rodriguez M.A."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "PhageCocktail: An R package to design phage cocktails from experimental phage-bacteria infection networks"
            },
            "pmid": "35576688"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1
}
