{
    "accessibility": "Open access",
    "additionDate": "2022-10-30T21:10:43.331114Z",
    "biotoolsCURIE": "biotools:taar1",
    "biotoolsID": "taar1",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "John M Kane"
        }
    ],
    "description": "Targeting Trace Amine-Associated Receptor 1 (TAAR1) in Schizophrenia.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "https://www.cmesurvey.site/TAAR1",
    "lastUpdate": "2022-10-30T21:11:13.089795Z",
    "name": "TAAR1",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1097/JCP.0000000000001596",
            "metadata": {
                "abstract": "© Wolters Kluwer Health, Inc. All rights reserved.This continuing education supplement is jointly provided by Medical Education Resources and CMEology. The supplement is supported by an independent educational grant from Sunovion Pharmaceuticals Inc. It was edited and peer reviewed by the Journal of Clinical Psychopharmacology. After reviewing the learning objectives and reading the supplement, please complete the Activity Evaluation/Credit Request form online at https://www.cmesurvey.site/TAAR1. Abstract All currently available antipsychotics work via essentially the same mechanism: by antagonizing the dopamine D2 receptor. However, schizophrenia is an extremely heterogeneous condition, and antipsychotics do not adequately control symptoms for all patients. Negative and cognitive symptoms are especially difficult to manage with existing medications. Therefore, antipsychotic agents with novel mechanisms of action are urgently needed. Recently, a phase 2 clinical trial and extension study demonstrated that, relative to placebo, the trace amine-associated receptor 1 (TAAR1) agonist ulotaront was effective at controlling the positive, negative, and cognitive symptoms of schizophrenia. In addition, ulotaront seems to lack the weight gain, metabolic issues, and extrapyramidal symptoms associated with traditional antipsychotics. This agent is currently undergoing multiple phase 3 trials for the treatment of schizophrenia. Another TAAR1 agonist, ralmitaront, is being investigated for the treatment of schizophrenia and schizoaffective disorders. Two phase 2 clinical trials are underway, evaluating ralmitaront both as a monotherapy and an add-on therapy to traditional antipsychotics. In this supplement, we review the biologic, preclinical, and clinical data available for TAAR1 agonists, so that if and when they are approved for the treatment of schizophrenia, psychiatry specialists will be ready to use them to optimize patient outcomes. We also briefly review other emerging therapies in late-stage development for the treatment of schizophrenia.",
                "authors": [
                    {
                        "name": "Kane J.M."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Journal of Clinical Psychopharmacology",
                "title": "A New Treatment Paradigm: Targeting Trace Amine-Associated Receptor 1 (TAAR1) in Schizophrenia"
            },
            "pmid": "36099402"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ],
    "validated": 1
}
