{
    "additionDate": "2021-01-18T08:06:43Z",
    "biotoolsCURIE": "biotools:slicerdmri",
    "biotoolsID": "slicerdmri",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fzhang@bwh.harvard.edu",
            "name": "Fan Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Diffusion MRI and Tractography Research Software for Brain Cancer Surgery Planning and Visualization.\nSlicerDMRI, an open-source software suite that enables research using diffusion magnetic resonance imaging (dMRI), the only modality that can map the white matter connections of the living human brain. SlicerDMRI enables analysis and visualization of dMRI data and is aimed at the needs of clinical research users. SlicerDMRI is built upon and deeply integrated with 3D Slicer, a National Institutes of Health-supported open-source platform for medical image informatics, image processing, and three-dimensional visualization. Integration with 3D Slicer provides many features of interest to cancer researchers, such as real-time integration with neuronavigation equipment, intraoperative imaging modalities, and multimodal data fusion",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://dmri.slicer.org/",
    "lastUpdate": "2021-02-19T15:42:30Z",
    "name": "SlicerDMRI",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1200/CCI.19.00141",
            "metadata": {
                "abstract": "Copyright © 2020 American Society of Clinical Oncology. All rights reserved.PURPOSE We present SlicerDMRI, an open-source software suite that enables research using diffusion magnetic resonance imaging (dMRI), the only modality that can map the white matter connections of the living human brain. SlicerDMRI enables analysis and visualization of dMRI data and is aimed at the needs of clinical research users. SlicerDMRI is built upon and deeply integrated with 3D Slicer, a National Institutes of Health–supported open-source platform for medical image informatics, image processing, and three-dimensional visualization. Integration with 3D Slicer provides many features of interest to cancer researchers, such as real-time integration with neuronavigation equipment, intraoperative imaging modalities, and multimodal data fusion. One key application of SlicerDMRI is in neurosurgery research, where brain mapping using dMRI can provide patient-specific maps of critical brain connections as well as insight into the tissue microstructure that surrounds brain tumors. PATIENTS AND METHODS In this article, we focus on a demonstration of SlicerDMRI as an informatics tool to enable end-to-end dMRI analyses in two retrospective imaging data sets from patients with high-grade glioma. Analyses demonstrated here include conventional diffusion tensor analysis, advanced multifiber tractography, automated identification of critical fiber tracts, and integration of multimodal imagery with dMRI. RESULTS We illustrate the ability of SlicerDMRI to perform both conventional and advanced dMRI analyses as well as to enable multimodal image analysis and visualization. We provide an overview of the clinical rationale for each analysis along with pointers to the SlicerDMRI tools used in each. CONCLUSION SlicerDMRI provides open-source and clinician-accessible research software tools for dMRI analysis. SlicerDMRI is available for easy automated installation through the 3D Slicer Extension Manager.",
                "authors": [
                    {
                        "name": "Frisken S.F."
                    },
                    {
                        "name": "Golby A.J."
                    },
                    {
                        "name": "Johnson H.J."
                    },
                    {
                        "name": "Jose Estepar R.S."
                    },
                    {
                        "name": "Juvekar P."
                    },
                    {
                        "name": "Kapur T."
                    },
                    {
                        "name": "Kikinis R."
                    },
                    {
                        "name": "Kindlmann G."
                    },
                    {
                        "name": "Noh T."
                    },
                    {
                        "name": "Norton I."
                    },
                    {
                        "name": "O'Donnell L.J."
                    },
                    {
                        "name": "Pieper S."
                    },
                    {
                        "name": "Pujol S."
                    },
                    {
                        "name": "Rathi Y."
                    },
                    {
                        "name": "Rigolo L."
                    },
                    {
                        "name": "Wassermann D."
                    },
                    {
                        "name": "Wells W."
                    },
                    {
                        "name": "Westin C.-F."
                    },
                    {
                        "name": "Yarmarkovich A."
                    },
                    {
                        "name": "Zhang F."
                    }
                ],
                "citationCount": 8,
                "date": "2019-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "SlicerDMRI: Diffusion MRI and Tractography Research Software for Brain Cancer Surgery Planning and Visualization"
            },
            "pmcid": "PMC7113081",
            "pmid": "32216636"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
