{
    "additionDate": "2018-06-04T15:26:17Z",
    "biotoolsCURIE": "biotools:fswm",
    "biotoolsID": "fswm",
    "credit": [
        {
            "email": "chris.leimeister@stud.uni-goettingen.de",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast and accurate phylogeny reconstruction using filtered spaced-word matches.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fswm.gobics.de/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://fswm.gobics.de/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "FSWM",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw776",
            "metadata": {
                "abstract": "© The Author 2016. Published by Oxford University Press.Motivation: Word-based or 'alignment-free' algorithms are increasingly used for phylogeny reconstruction and genome comparison, since they are much faster than traditional approaches that are based on full sequence alignments. Existing alignment-free programs, however, are less accurate than alignment-based methods. Results: We propose Filtered Spaced Word Matches (FSWM), a fast alignment-free approach to estimate phylogenetic distances between large genomic sequences. For a pre-defined binary pattern of match and don't-care positions, FSWM rapidly identifies spaced word-matches between input sequences, i.e. gap-free local alignments with matching nucleotides at the match positions and with mismatches allowed at the don't-care positions. We then estimate the number of nucleotide substitutions per site by considering the nucleotides aligned at the don't-care positions of the identified spaced-word matches. To reduce the noise from spurious random matches, we use a filtering procedure where we discard all spaced-word matches for which the overall similarity between the aligned segments is below a threshold. We show that our approach can accurately estimate substitution frequencies even for distantly related sequences that cannot be analyzed with existing alignment-free methods; phylogenetic trees constructed with FSWM distances are of high quality. A program run on a pair of eukaryotic genomes of a few hundred Mb each takes a few minutes. Availability and Implementation: The program source code for FSWM including a documentation, as well as the software that we used to generate artificial genome sequences are freely available at http://fswm.gobics.de/.",
                "authors": [
                    {
                        "name": "Leimeister C.-A."
                    },
                    {
                        "name": "Sohrabi-Jahromi S."
                    },
                    {
                        "name": "Morgenstern B."
                    }
                ],
                "citationCount": 26,
                "date": "2017-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fast and accurate phylogeny reconstruction using filtered spaced-word matches"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}