{
    "additionDate": "2020-01-14T09:52:17Z",
    "biotoolsCURIE": "biotools:red_clover",
    "biotoolsID": "red_clover",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Wenli.Li@usda.gov",
            "name": "Wenli Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of Single Nucleotide Polymorphism in Red Clover (Trifolium pratense L.) Using Targeted Genomic Amplicon Sequencing and RNA-seq.\n\nRed clover (Trifolium pratense L.) is a diploid, naturally cross-pollinated, cool-season species. As a perennial forage legume, red clover is mostly cultivated in temperate regions worldwide. Being a non-model crop species, genomic resources for red clover have been underdeveloped. Thus far, genomic analysis used in red clover has mainly relied on simple sequence repeat (SSR) markers. However, SSR markers are sparse in the genome and it is often difficult to unambiguously map them using short reads generated by next generation sequencing technology. Single nucleotide polymorphisms (SNPs) have been successfully applied in genomics assisted breeding in several agriculturally important species.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WLpython19/RedClover",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-01-15T19:06:25Z",
    "name": "red clover",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2019.01257",
            "metadata": {
                "abstract": "© Copyright © 2019 Li, Riday, Riehle, Edwards and Dinkins.Red clover (Trifolium pratense L.) is a diploid, naturally cross-pollinated, cool-season species. As a perennial forage legume, red clover is mostly cultivated in temperate regions worldwide. Being a non-model crop species, genomic resources for red clover have been underdeveloped. Thus far, genomic analysis used in red clover has mainly relied on simple sequence repeat (SSR) markers. However, SSR markers are sparse in the genome and it is often difficult to unambiguously map them using short reads generated by next generation sequencing technology. Single nucleotide polymorphisms (SNPs) have been successfully applied in genomics assisted breeding in several agriculturally important species. Due to increasing importance of legumes in forage production, there is a clear need to develop SNP based markers for red clover that can be applied in breeding applications. In this study, we first developed an analytical pipeline that can confidently identify SNPs in a set of 72 different red clover genotypes using sequences generated by targeted amplicon sequencing. Then, with the same filtering stringency used in this pipeline, we used sequences from publicly available RNA-seq data to identify confident SNPs in different red clover varieties. Using this strategy, we have identified a total of 69,975 SNPs across red clover varieties. Among these, 28% (19,116) of them are missense mutations. Using Medicago truncatula as the reference, we annotated the regions affected by these missense mutations. We identified 2,909 protein coding regions with missense mutations. Pathway analysis of these coding regions indicated several biological processes impacted by these mutations. Specifically, three domains (homeobox domain, pentatricopeptide repeat containing plant-like, and regulator of Vps4 activity) were identified with five or more missense SNPs. These domain might also be a functional contributor in the molecular mechanisms of self-incompatibility in red clover. Future in-depth sequence diversity analysis of these three genes may yield valuable insights into the molecular mechanism involved in self-incompatibility in red clover.",
                "authors": [
                    {
                        "name": "Dinkins R."
                    },
                    {
                        "name": "Edwards A."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Riday H."
                    },
                    {
                        "name": "Riehle C."
                    }
                ],
                "date": "2019-10-23T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "Identification of Single Nucleotide Polymorphism in Red Clover (Trifolium pratense L.) Using Targeted Genomic Amplicon Sequencing and RNA-seq"
            },
            "pmcid": "PMC6820467",
            "pmid": "31708937"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
