{"collectionID": [], "accessibility": [], "topic": [{"term": "Genotype and phenotype", "uri": "http://edamontology.org/topic_0625"}], "owner": "seqwiki_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "20861027", "type": null, "pmcid": null, "metadata": {"title": "SeqEM: An adaptive genotype-calling approach for next-generation sequencing studies", "abstract": "Motivation: Next-generation sequencing presents several statistical challenges, with one of the most fundamental being determining an individual's genotype from multiple aligned short read sequences at a position. Some simple approaches for genotype calling apply fixed filters, such as calling a heterozygote if more than a specified percentage of the reads have variant nucleotide calls. Other genotype-calling methods, such as MAQ and SOAPsnp, are implementations of Bayes classifiers in that they classify genotypes using posterior genotype probabilities.Results: Here, we propose a novel genotype-calling algorithm that, in contrast to the other methods, estimates parameters underlying the posterior probabilities in an adaptive way rather than arbitrarily specifying them a priori. The algorithm, which we call SeqEM, applies the well-known Expectation-Maximization algorithm to an appropriate likelihood for a sample of unrelated individuals with next-generation sequence data, leveraging information from the sample to estimate genotype probabilities and the nucleotide-read error rate. We demonstrate using analytic calculations and simulations that SeqEM results in genotype-call error rates as small as or smaller than filtering approaches and MAQ. We also apply SeqEM to exome sequence data in eight related individuals and compare the results to genotypes from an Illumina SNP array, showing that SeqEM behaves well in real data that deviates from idealized assumptions.Conclusion: SeqEM offers an improved, robust and flexible genotype-calling approach that can be widely applied in the next-generation sequencing studies. © The Author(s) 2010. Published by Oxford University Press.", "citationCount": 46, "authors": [{"name": "Martin E.R."}, {"name": "Kinnamon D.D."}, {"name": "Schmidt M.A."}, {"name": "Powell E.H."}, {"name": "Zuchner S."}, {"name": "Morris R.W."}], "date": "2010-11-01T00:00:00Z", "journal": "Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "M. Schmidt", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "mschmidt@med.miami.edu"}], "biotoolsCURIE": "biotools:seqem", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://hihg.med.miami.edu/software-download/seqem-version-1.0", "function": [{"note": null, "input": [], "operation": [{"term": "Genetic variation analysis", "uri": "http://edamontology.org/operation_3197"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:49Z", "otherID": [], "description": "Genotype-calling algorithm that estimates parameters underlying the posterior probabilities in an adaptive way rather than arbitrarily specifying them a priori. The algorithm applies the well-known EM algorithm to an appropriate likelihood for a sample of unrelated individuals with next-generation sequence data, leveraging information from the sample to estimate genotype probabilities and the nucleotide-read error rate.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "seqem", "additionDate": "2017-01-13T13:16:17Z", "name": "SeqEM", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}