{
    "accessibility": "Open access",
    "additionDate": "2022-06-14T07:36:37.193285Z",
    "biotoolsCURIE": "biotools:hrel",
    "biotoolsID": "hrel",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sarvani.ch@iiits.in",
            "name": "C.H. Sarvani"
        },
        {
            "email": "shabbeer.sh@dryvamigo.com",
            "name": "S.H. Shabbeer Basha"
        }
    ],
    "description": "Filter pruning based on High Relevance between activation maps and class labels.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sarvanichinthapalli/HRel",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-14T07:36:37.195805Z",
    "name": "HRel",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.NEUNET.2021.12.017",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdThis paper proposes an Information Bottleneck theory based filter pruning method that uses a statistical measure called Mutual Information (MI). The MI between filters and class labels, also called Relevance, is computed using the filter's activation maps and the annotations. The filters having High Relevance (HRel) are considered to be more important. Consequently, the least important filters, which have lower Mutual Information with the class labels, are pruned. Unlike the existing MI based pruning methods, the proposed method determines the significance of the filters purely based on their corresponding activation map's relationship with the class labels. Architectures such as LeNet-5, VGG-16, ResNet-56, ResNet-110 and ResNet-50 are utilized to demonstrate the efficacy of the proposed pruning method over MNIST, CIFAR-10 and ImageNet datasets. The proposed method shows the state-of-the-art pruning results for LeNet-5, VGG-16, ResNet-56, ResNet-110 and ResNet-50 architectures. In the experiments, we prune 97.98%, 84.85%, 76.89%, 76.95%, and 63.99% of Floating Point Operation (FLOP)s from LeNet-5, VGG-16, ResNet-56, ResNet-110, and ResNet-50 respectively. The proposed HRel pruning method outperforms recent state-of-the-art filter pruning methods. Even after pruning the filters from convolutional layers of LeNet-5 drastically (i.e., from 20, 50 to 2, 3, respectively), only a small accuracy drop of 0.52% is observed. Notably, for VGG-16, 94.98% parameters are reduced, only with a drop of 0.36% in top-1 accuracy. ResNet-50 has shown a 1.17% drop in the top-5 accuracy after pruning 66.42% of the FLOPs. In addition to pruning, the Information Plane dynamics of Information Bottleneck theory is analyzed for various Convolutional Neural Network architectures with the effect of pruning. The code is available at https://github.com/sarvanichinthapalli/HRel.",
                "authors": [
                    {
                        "name": "Basha S.H.S."
                    },
                    {
                        "name": "Dubey S.R."
                    },
                    {
                        "name": "Ghorai M."
                    },
                    {
                        "name": "Sarvani C.H."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Neural Networks",
                "title": "HRel: Filter pruning based on High Relevance between activation maps and class labels"
            },
            "pmid": "35042156"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
