{
    "additionDate": "2021-01-18T12:01:46Z",
    "biotoolsCURIE": "biotools:unilectin",
    "biotoolsID": "unilectin",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anne.imberty@cermav.cnrs.fr",
            "name": "Anne Imberty",
            "typeEntity": "Person"
        },
        {
            "email": "frederique.lisacek@sib.swiss",
            "name": "Frédérique Lisacek",
            "typeEntity": "Person"
        }
    ],
    "description": "Update of UniLectin for the discovery of carbohydrate-binding proteins based on a new lectin classification.\n\nUniLectin platform is a dedicated portal of databases and tools to study the lectins. Lectins are carbohydrate (glycan) binding proteins, macromolecules that are highly specific for sugars. Lectins perform biological recognition mechanisms involving cells, carbohydrates, and proteins. Lectins also bind bacteria and viruses to their targets.\n\nThe LectomeXplore database provides predicted lectin domains (reversible carbohydrate binding site) in all species proteomes (de novo translated genomes).",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://unilectin.eu/predict/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://www.unilectin.eu/",
    "lastUpdate": "2021-03-09T17:36:31Z",
    "name": "UniLectin",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1019",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Lectins are non-covalent glycan-binding proteins mediating cellular interactions but their annotation in newly sequenced organisms is lacking. The limited size of functional domains and the low level of sequence similarity challenge usual bioinformatics tools. The identification of lectin domains in proteomes requires the manual curation of sequence alignments based on structural folds. A new lectin classification is proposed. It is built on three levels: (i) 35 lectin domain folds, (ii) 109 classes of lectins sharing at least 20% sequence similarity and (iii) 350 families of lectins sharing at least 70% sequence similarity. This information is compiled in the UniLectin platform that includes the previously described UniLectin3D database of curated lectin 3D structures. Since its first release, UniLectin3D has been updated with 485 additional 3D structures. The database is now complemented by two additional modules: PropLec containing predicted β-propeller lectins and LectomeXplore including predicted lectins from sequences of the NBCI-nr and UniProt for every curated lectin class. UniLectin is accessible at https://www.unilectin.eu/",
                "authors": [
                    {
                        "name": "Bonnardel F."
                    },
                    {
                        "name": "Mariethoz J."
                    },
                    {
                        "name": "Perez S."
                    },
                    {
                        "name": "Imberty A."
                    },
                    {
                        "name": "Lisacek F."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LectomeXplore, an update of UniLectin for the discovery of carbohydrate-binding proteins based on a new lectin classification"
            },
            "pmid": "33174598"
        }
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}