{
    "additionDate": "2021-01-18T10:02:09Z",
    "biotoolsCURIE": "biotools:scb",
    "biotoolsID": "scb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kkryukov@gmail.com",
            "name": "Kirill Kryukov",
            "orcidid": "https://orcid.org/0000-0002-0286-0288",
            "typeEntity": "Person"
        }
    ],
    "description": "comprehensive evaluation of reference-free compressors for FASTA-formatted sequences.\n\nSequence Compression Benchmark (SCB).\n\nThis repository contains all code used for constructing Sequence Compression Benchmark.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://kirr.dyndns.org/sequence-compression-benchmark/",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2021-02-11T17:25:42Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/KirillKryukov/scb"
        }
    ],
    "name": "SCB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAA072",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Background: Nearly all molecular sequence databases currently use gzip for data compression. Ongoing rapid accumulation of stored data calls for a more efficient compression tool. Although numerous compressors exist, both specialized and general-purpose, choosing one of them was difficult because no comprehensive analysis of their comparative advantages for sequence compression was available. Findings: We systematically benchmarked 430 settings of 48 compressors (including 29 specialized sequence compressors and 19 general-purpose compressors) on representative FASTA-formatted datasets of DNA, RNA, and protein sequences. Each compressor was evaluated on 17 performance measures, including compression strength, as well as time and memory required for compression and decompression. We used 27 test datasets including individual genomes of various sizes, DNA and RNA datasets, and standard protein datasets. We summarized the results as the Sequence Compression Benchmark database (SCB database, http://kirr.dyndns.org/sequence-compression-benchmark/), which allows custom visualizations to be built for selected subsets of benchmark results. Conclusion: We found that modern compressors offer a large improvement in compactness and speed compared to gzip. Our benchmark allows compressors and their settings to be compared using a variety of performance measures, offering the opportunity to select the optimal compressor on the basis of the data type and usage scenario specific to a particular application.",
                "authors": [
                    {
                        "name": "Kryukov K."
                    },
                    {
                        "name": "Ueda M.T."
                    },
                    {
                        "name": "Nakagawa S."
                    },
                    {
                        "name": "Imanishi T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Sequence compression benchmark (SCB) database-A comprehensive evaluation of reference-free compressors for FASTA-formatted sequences"
            },
            "pmcid": "PMC7336184",
            "pmid": "32627830"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}