{
    "additionDate": "2022-11-06T13:30:23.637311Z",
    "biotoolsCURIE": "biotools:cpmcp",
    "biotoolsID": "cpmcp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jianliu@nankai.edu.cn",
            "name": "Jian Liu",
            "orcidid": "https://orcid.org/0000-0001-5516-0157",
            "typeEntity": "Person"
        },
        {
            "email": "weijm@nankai.edu.cn",
            "name": "Jin-Mao Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of Chinese patent medicine and compound prescription.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://cpmcp.top",
    "lastUpdate": "2022-11-06T13:30:23.639842Z",
    "license": "Other",
    "name": "CPMCP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC073",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.Although several traditional Chinese medicine (TCM)-related databases have emerged, they focus on researching single medicinal materials, which is far from sufficient for clinical research and application. In comparison, compound prescriptions are more informative and meaningful in TCM, for they embody the information on the compatibility of TCM besides the relatively isolated information about single medicinal materials. The compatibility information is essential in TCM because it conveys not only what components are involved to treat special diseases but also how to combine these single medical materials. We established a database of Chinese patent medicine and compound prescription (CPMCP). It demonstrates the prescription information of Chinese patent medicines (CPMs) and ancient Chinese medicine prescriptions (CMPs). CPMCP reports their comprehensive and standardized information such as the components, indications and contraindications. It is worth mentioning that we organized relevant experts and spent lots of time manually mapping the functions of compound prescriptions in ancient Chinese to the standardized TCM symptom vocabularies, obtaining a total of 71 414 associations between compound prescriptions and TCM symptoms. In this way, CPMCP established the associations between TCM and modern medicine (MM) according to the associations between TCM symptoms and MM symptoms. In addition, to further exhibit the compatibility mechanism of compound prescriptions, CPMCP summarizes a set of common drug combination principles by analyzing the existing prescriptions. We believe that CPMCP can promote the modernization of TCM and make greater contributions to MM. Database URL http://cpmcp.top.",
                "authors": [
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Sun C."
                    },
                    {
                        "name": "Tang R."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wei J.-M."
                    },
                    {
                        "name": "Yuan H."
                    }
                ],
                "date": "2022-08-25T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "CPMCP: a database of Chinese patent medicine and compound prescription"
            },
            "pmcid": "PMC9408024",
            "pmid": "36006844"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
