{
    "additionDate": "2019-11-14T18:31:19Z",
    "biotoolsCURIE": "biotools:GMpi",
    "biotoolsID": "GMpi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "MMabry44@gmail.com",
            "name": "Makenzie E. Mabry",
            "orcidid": "https://orcid.org/0000-0002-6139-9559",
            "typeEntity": "Person"
        }
    ],
    "description": "Affordable remote monitoring of plant growth in facilities using Raspberry Pi computers | A growth chamber sensing system using the Raspberry Pi as a platform | GMpi: A Growth Chamber Monitoring System Using the Raspberry Pi as a Platform | The GMpi is a cost-effective solution for monitoring the conditions of a growth chamber, greenhouse, or any other facility for which specific conditions (temperature, light, humidity, etc.) need to be maintained",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/BrandinGrindstaff/GMpi",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-03T12:06:48Z",
    "name": "GMpi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/APS3.11280",
            "metadata": {
                "abstract": "© 2019 Grindstaff et al. Applications in Plant Sciences is published by Wiley Periodicals, Inc. on behalf of the Botanical Society of AmericaPremise: Environmentally controlled facilities, such as growth chambers, are essential tools for experimental research. Automated, low-cost, remote-monitoring hardware can greatly improve both reproducibility and maintenance. Methods and Results: Using a Raspberry Pi computer, open-source software, environmental sensors, and a camera, we developed Growth Monitor pi (GMpi), a cost-effective system for monitoring growth chamber conditions. Coupled with our software, GMPi_Pack, our setup automates sensor readings, photography, and alerts when conditions fall out of range. Conclusions: GMpi offers access to environmental data logging, improving reproducibility of experiments and reinforcing the stability of controlled environmental facilities. The device is also flexible and scalable, allowing researchers the ability to customize and expand GMpi for their own needs.",
                "authors": [
                    {
                        "name": "Grindstaff B."
                    },
                    {
                        "name": "Mabry M.E."
                    },
                    {
                        "name": "Blischak P.D."
                    },
                    {
                        "name": "Quinn M."
                    },
                    {
                        "name": "Chris Pires J."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Applications in Plant Sciences",
                "title": "Affordable remote monitoring of plant growth in facilities using Raspberry Pi computers"
            },
            "pmcid": "PMC6711351",
            "pmid": "31467803"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ],
    "validated": 1
}