{
    "additionDate": "2020-01-14T20:05:32Z",
    "biotoolsCURIE": "biotools:PATOPA",
    "biotoolsID": "PATOPA",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "chi.wang@uky.edu",
            "name": "Chi Wang",
            "orcidid": "https://orcid.org/0000-0001-8984-4995",
            "typeEntity": "Person"
        }
    ],
    "description": "A probabilistic method for leveraging functional annotations to enhance estimation of the temporal order of pathway mutations during carcinogenesis.\n\n“rectal_table”: All the nonsynonymous mutations in TCGA rectal cancer dataset and its coresponding Polyphen-2 scores. The first column is the sample names, the second column is the mutated genes and the third column is the functional impact score corresponding to each mutations.\n\n“CoreGroup2Gene.txt”: contains the mapping of pathways to genes (genes entrez id). The first column is the name of pathways, the second column is genes included in the pathways.\n\nThe file \"example1.R” is an example of R codes which read the data file “rectal_table” and “CoreGroup2Gene.txt” and analyze the 9 pathways in “CoreGroup2Gene.txt” together. The file returns “pairprob.txt” which contains the probabilities of A>B, A<B and A=B for all pairs of pathways.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'CONCLUSIONS:PATOPA'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MarkeyBBSRF/PATOPA",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2020-01-14T20:05:32Z",
    "name": "PATOPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3218-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Cancer arises through accumulation of somatically acquired genetic mutations. An important question is to delineate the temporal order of somatic mutations during carcinogenesis, which contributes to better understanding of cancer biology and facilitates identification of new therapeutic targets. Although a number of statistical and computational methods have been proposed to estimate the temporal order of mutations, they do not account for the differences in the functional impacts of mutations and thus are likely to be obscured by the presence of passenger mutations that do not contribute to cancer progression. In addition, many methods infer the order of mutations at the gene level, which have limited power due to the low mutation rate in most genes. Results: In this paper, we develop a Probabilistic Approach for estimating the Temporal Order of Pathway mutations by leveraging functional Annotations of mutations (PATOPA). PATOPA infers the order of mutations at the pathway level, wherein it uses a probabilistic method to characterize the likelihood of mutational events from different pathways occurring in a certain order. The functional impact of each mutation is incorporated to weigh more on a mutation that is more integral to tumor development. A maximum likelihood method is used to estimate parameters and infer the probability of one pathway being mutated prior to another. Simulation studies and analysis of whole exome sequencing data from The Cancer Genome Atlas (TCGA) demonstrate that PATOPA is able to accurately estimate the temporal order of pathway mutations and provides new biological insights on carcinogenesis of colorectal and lung cancers. Conclusions: PATOPA provides a useful tool to estimate temporal order of mutations at the pathway level while leveraging functional annotations of mutations.",
                "authors": [
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Yu T."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Stromberg A.J."
                    },
                    {
                        "name": "Villano J.L."
                    },
                    {
                        "name": "Arnold S.M."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A probabilistic method for leveraging functional annotations to enhance estimation of the temporal order of pathway mutations during carcinogenesis"
            },
            "pmcid": "PMC6889196",
            "pmid": "31791231"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}