{
    "additionDate": "2021-01-18T09:05:18Z",
    "biotoolsCURIE": "biotools:timer",
    "biotoolsID": "timer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xsliu@ds.dfci.harvard.edu",
            "name": "X Shirley Liu",
            "orcidid": "https://orcid.org/0000-0003-4736-7339",
            "typeEntity": "Person"
        }
    ],
    "description": "TIMER2.0 for analysis of tumor-infiltrating immune cells.\n\nTumor progression and the efficacy of immunotherapy are strongly influenced by the composition and abundance of immune cells in the tumor microenvironment. Due to the limitations of direct measurement methods, computational algorithms are often used to infer immune cell composition from bulk tumor transcriptome profiles. These estimated tumor immune infiltrate populations have been associated with genomic and transcriptomic changes in the tumors, providing insight into tumor-immune interactions. However, such investigations on large-scale public data remain challenging. To lower the barriers for the analysis of complex tumor-immune interactions, we significantly improved our previous web platform TIMER",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "homepage": "http://timer.cistrome.org/",
    "lastUpdate": "2021-02-27T09:47:50Z",
    "name": "TIMER",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA407",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Tumor progression and the efficacy of immunotherapy are strongly influenced by the composition and abundance of immune cells in the tumor microenvironment. Due to the limitations of direct measurement methods, computational algorithms are often used to infer immune cell composition from bulk tumor transcriptome profiles. These estimated tumor immune infiltrate populations have been associated with genomic and transcriptomic changes in the tumors, providing insight into tumor-immune interactions. However, such investigations on large-scale public data remain challenging. To lower the barriers for the analysis of complex tumor-immune interactions, we significantly improved our previous web platform TIMER. Instead of just using one algorithm, TIMER2.0 (http://timer.cistrome.org/) provides more robust estimation of immune infiltration levels for The Cancer Genome Atlas (TCGA) or user-provided tumor profiles using six state-of-the-art algorithms. TIMER2.0 provides four modules for investigating the associations between immune infiltrates and genetic or clinical features, and four modules for exploring cancer-related associations in the TCGA cohorts. Each module can generate a functional heatmap table, enabling the user to easily identify significant associations in multiple cancer types simultaneously. Overall, the TIMER2.0 web server provides comprehensive analysis and visualization functions of tumor infiltrating immune cells.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Cohen D."
                    },
                    {
                        "name": "Fu J."
                    },
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Liu X.S."
                    },
                    {
                        "name": "Zeng Z."
                    }
                ],
                "citationCount": 220,
                "date": "2020-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TIMER2.0 for analysis of tumor-infiltrating immune cells"
            },
            "pmcid": "PMC7319575",
            "pmid": "32442275"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "version": [
        "2.0"
    ]
}
