{
    "additionDate": "2021-03-19T09:07:03Z",
    "biotoolsCURIE": "biotools:samt",
    "biotoolsID": "samt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "orlando.lamgordillo@flinders.edu.au",
            "name": "Orlando Lam‐Gordillo",
            "orcidid": "https://orcid.org/0000-0001-6805-6260",
            "typeEntity": "Person"
        }
    ],
    "description": "Establishing the South Australian Macrobenthic Traits (SAMT) database.\n\nThe South Australian Macrobenthic Traits.\n\nSAMT is an R package that contains different functions to manipulate and analyse trait information of marine macrobenthic fauna (SAMT database).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OrlandoLam/SAMT",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-03T14:29:56Z",
    "name": "SAMT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/ECE3.7040",
            "metadata": {
                "abstract": "© 2020 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Trait-based approaches are increasingly used as a proxy for understanding the relationship between biodiversity and ecosystem functioning. Macrobenthic fauna are considered one of the major providers of ecosystem functions in marine soft sediments; however, several gaps persist in the knowledge of their trait classification, limiting the potential use of functional assessments. While trait databases are available for the well-studied North Atlantic benthic fauna, no such trait classification system exists for Australia. Here, we present the South Australian Macrobenthic Traits (SAMT) database, the first comprehensive assessment of macrobenthic fauna traits in temperate Australian waters. The SAMT database includes 13 traits and 54 trait-modalities (e.g., life history, morphology, physiology, and behavior), and is based on records of macrobenthic fauna from South Australia. We provide trait information for more than 250 macrobenthic taxa, including outcomes from a fuzzy coding procedure, as well as an R package for using and analyzing the SAMT database. The establishment of the SAMT constitutes the foundation for a comprehensive macrobenthic trait database for the wider southern Australian region that could facilitate future research on functional perspectives, such as assessments of functional diversity and changes to ecosystem functioning.",
                "authors": [
                    {
                        "name": "Lam-Gordillo O."
                    },
                    {
                        "name": "Baring R."
                    },
                    {
                        "name": "Dittmann S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "Establishing the South Australian Macrobenthic Traits (SAMT) database: A trait classification for functional assessments"
            },
            "pmcid": "PMC7771161",
            "pmid": "33552471"
        }
    ],
    "toolType": [
        "Library",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        }
    ]
}