{
    "name": "BASILISK", 
    "description": "Probabilistic model of the conformational space of amino acid side chains in proteins. It models the chi angles in continuous space, including the influence of the protein's backbone.", 
    "homepage": "http://sourceforge.net/projects/basilisk-dbn/", 
    "biotoolsID": "basilisk", 
    "biotoolsCURIE": "biotools:basilisk", 
    "version": [
        "0.1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0477", 
                    "term": "Protein modelling"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2814", 
            "term": "Protein structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://sourceforge.net/projects/basilisk-dbn/files/Documentation/basilisk_manual.pdf/download", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-306", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Beyond rotamers: A generative, probabilistic model of side chains in proteins", 
                "abstract": "Background: Accurately covering the conformational space of amino acid side chains is essential for important applications such as protein design, docking and high resolution structure prediction. Today, the most common way to capture this conformational space is through rotamer libraries - discrete collections of side chain conformations derived from experimentally determined protein structures. The discretization can be exploited to efficiently search the conformational space. However, discretizing this naturally continuous space comes at the cost of losing detailed information that is crucial for certain applications. For example, rigorously combining rotamers with physical force fields is associated with numerous problems.Results: In this work we present BASILISK: a generative, probabilistic model of the conformational space of side chains that makes it possible to sample in continuous space. In addition, sampling can be conditional upon the protein's detailed backbone conformation, again in continuous space - without involving discretization.Conclusions: A careful analysis of the model and a comparison with various rotamer libraries indicates that the model forms an excellent, fully continuous model of side chain conformational space. We also illustrate how the model can be used for rigorous, unbiased sampling with a physical force field, and how it improves side chain prediction when used as a pseudo-energy term. In conclusion, BASILISK is an important step forward on the way to a rigorous probabilistic description of protein structure in continuous space and in atomic detail. © 2010 Harder et al; licensee BioMed Central Ltd.", 
                "date": "2010-05-05T00:00:00Z", 
                "citationCount": 32, 
                "authors": [
                    {
                        "name": "Harder T."
                    }, 
                    {
                        "name": "Boomsma W."
                    }, 
                    {
                        "name": "Paluszewski M."
                    }, 
                    {
                        "name": "Frellsen J."
                    }, 
                    {
                        "name": "Johansson K.E."
                    }, 
                    {
                        "name": "Hamelryck T."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "binf.ku.dk", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Thomas Hamelryck", 
            "email": "thamelry@binf.ku.dk", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2015-07-27T12:48:00Z", 
    "lastUpdate": "2019-09-04T08:37:30Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}