{
    "additionDate": "2017-02-07T13:18:21Z",
    "biotoolsCURIE": "biotools:goblet",
    "biotoolsID": "goblet",
    "collectionID": [
        "JIB.tools"
    ],
    "credit": [
        {
            "email": "dgroth@mpimp-golm.mpg.de",
            "name": "Detlef Groth",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BLAST one or more protein or nucleotide sequences against databases that have sequences mapped to Gene Ontology (GO) terms.  Results can be viewed for individual sequences, or as survey statistics for the group if more than one sequence is submitted.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://goblet.molgen.mpg.de/cgi-bin/goblet2008/goblet.cgi?menu=Help"
        }
    ],
    "editPermission": {
        "authors": [
            "bjsommer"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Sequence tagged site (STS) mapping",
                    "uri": "http://edamontology.org/operation_2871"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://goblet.molgen.mpg.de/",
    "lastUpdate": "2019-09-18T18:28:36Z",
    "link": [
        {
            "note": "GOblet@JIB.tools - a web registry of tools published in the Journal of Integrative Bioinformatics",
            "type": [
                "Software catalogue"
            ],
            "url": "https://jib.tools/details.php?id=53"
        }
    ],
    "name": "GOblet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "GOblet is a comprehensive web server application providing the annotation of anonymous sequence data with Gene Ontology (GO) terms. It uses a variety of different protein databases (human, murines, invertebrates, plants, sp-trembl) and their respective GO mappings. The user selects the appropriate database and alignment threshold and thereafter submits single or multiple nucleotide or protein sequences. Results are shown in different ways, e.g. as survey statistics for the main GO categories for all sequences or as detailed results for each single sequence that has been submitted. In its newest version, GOblet allows the batch submission of sequences and provides an improved display of results with the aid of Java applets. All output data, together with the Java applet, are packed to a downloadable archive for local installation and analysis. GOblet can be accessed freely at http://goblet.molgen.mpg.de. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Groth D."
                    },
                    {
                        "name": "Lehrach H."
                    },
                    {
                        "name": "Hennig S."
                    }
                ],
                "citationCount": 71,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GOblet: A platform for Gene Ontology annotation of anonymous sequence data"
            },
            "pmid": "15215401"
        },
        {
            "metadata": {
                "abstract": "Gene Ontology (GO) is the most widely accepted attempt to construct a unified and structured vocabulary for the description of genes and their products in any organism. Annotation by GO terms is performed in most of the current genome projects, which besides generality has the advantage of being very convenient for computer based classification methods. However, direct use of GO in small sequencing projects is not easy, especially for species not commonly represented in public databases. We present a software package (GOblet), which performs annotation based on GO terms for anonymous cDNA or protein sequences. It uses the species independent GO structure and vocabulary together with a series of protein databases collected from various sites, to perform a detailed GO annotation by sequence similarity searches. The sensitivity and the reference protein sets can be selected by the user. GOblet runs automatically and is available as a public service on our web server. The paper also addresses the reliability of automated GO annotations by using a reference set of more than 6000 human proteins. The GOblet server is accessible at http://goblet.molgen.mpg.de.",
                "authors": [
                    {
                        "name": "Hennig S."
                    },
                    {
                        "name": "Groth D."
                    },
                    {
                        "name": "Lehrach H."
                    }
                ],
                "citationCount": 76,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Automated gene ontology annotation for anonymous sequence data"
            },
            "pmid": "12824400"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}