{
    "additionDate": "2021-03-19T09:07:23Z",
    "biotoolsCURIE": "biotools:polyboost",
    "biotoolsID": "polyboost",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dparente@kumc.edu",
            "name": "Daniel J. Parente",
            "typeEntity": "Person"
        }
    ],
    "description": "An enhanced genomic variant classifier using extreme gradient boosting.\n\nPolyBoost is a post-analysis tool for the batch processing output of PolyPhen-2 that replaces the naive Bayes classifier with an extreme gradient boosting XGBoost classifier.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://github.com/djparente/polyboost",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-03-28T12:45:34Z",
    "license": "BSD-3-Clause",
    "name": "PolyBoost",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/PRCA.201900124",
            "metadata": {
                "abstract": "© 2021 Wiley-VCH GmbHPurpose: Human exome sequences contain 15,000–20,000 variants but many variants have unknown clinical impact. In silico predictive classifiers are recognized by the American College of Medical Genetics as a resource for interpreting these “variants of uncertain significance.” Many in silico classifiers have been developed, of which PolyPhen-2 is highly successful and widely used. PolyPhen-2 uses a naïve Bayes model to synthesize sequence, structural and genomic information. I investigated whether predictive performance could be improved by replacing PolyPhen-2′s naïve Bayes model with alternative machine learning methods. Experimental design: Classifiers using the PolyPhen-2 feature set were retrained using extreme gradient boosting (XGBoost), random forests, artificial neural networks, and support vector machines. Classifiers were externally validated on “pathogenic” and “benign” ClinVar variants absent from the training datasets. Software is implemented in Python and is freely available at https://github.com/djparente/polyboost and the Python Package Index (PyPI) under the BSD license. Results: An XGBoost-based classifier—designated PolyBoost (PolyPhen-2 Booster)—improves discriminative performance and calibration relative to PolyPhen-2 in external validation on ClinVar. Conclusions and clinical relevance: PolyBoost analyzes PolyPhen-2 output and can be incorporated into existing bioinformatics workflows as a post-analysis method to improve interpretation of clinical exome sequences obtained to identify monogenic disease.",
                "authors": [
                    {
                        "name": "Parente D.J."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "Proteomics - Clinical Applications",
                "title": "PolyBoost: An enhanced genomic variant classifier using extreme gradient boosting"
            },
            "pmid": "33586368"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
