{"collectionID": [], "accessibility": [], "topic": [{"term": "Assembly", "uri": "http://edamontology.org/topic_0196"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-12-354", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Parallelized short read assembly of large genomes using de Bruijn graphs", "abstract": "Background: Next-generation sequencing technologies have given rise to the explosive increase in DNA sequencing throughput, and have promoted the recent development of de novo short read assemblers. However, existing assemblers require high execution times and a large amount of compute resources to assemble large genomes from quantities of short reads.Results: We present PASHA, a parallelized short read assembler using de Bruijn graphs, which takes advantage of hybrid computing architectures consisting of both shared-memory multi-core CPUs and distributed-memory compute clusters to gain efficiency and scalability. Evaluation using three small-scale real paired-end datasets shows that PASHA is able to produce more contiguous high-quality assemblies in shorter time compared to three leading assemblers: Velvet, ABySS and SOAPdenovo. PASHA's scalability for large genome datasets is demonstrated with human genome assembly. Compared to ABySS, PASHA achieves competitive assembly quality with faster execution speed on the same compute resources, yielding an NG50 contig size of 503 with the longest correct contig size of 18,252, and an NG50 scaffold size of 2,294. Moreover, the human assembly is completed in about 21 hours with only modest compute resources.Conclusions: Developing parallel assemblers for large genomes has been garnering significant research efforts due to the explosive size growth of high-throughput short read datasets. By employing hybrid parallelism consisting of multi-threading on multi-core CPUs and message passing on compute clusters, PASHA is able to assemble the human genome with high quality and in reasonable time using modest compute resources. © 2011 Liu et al; licensee BioMed Central Ltd.", "citationCount": 47, "authors": [{"name": "Liu Y."}, {"name": "Schmidt B."}, {"name": "Maskell D.L."}], "date": "2011-08-25T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "https://sites.google.com/site/yongchaosoftware/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:pasha", "elixirPlatform": [], "elixirNode": [], "version": ["1.0.10"], "elixir_badge": 0, "homepage": "http://pasha.sourceforge.net/", "function": [{"note": null, "input": [], "operation": [{"term": "Sequence assembly", "uri": "http://edamontology.org/operation_0310"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "De-novo assembly", "uri": "http://edamontology.org/operation_0524"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:59Z", "otherID": [], "description": "It is a parallel short read assembler for large genomes using de Bruijn graphs. Taking advantage of both shared-memory multi-core CPUs and distributed-memory compute clusters, it has demonstrated its potential to perform high-quality de-novo assembly of large genomes in reasonable time with modest computing resources.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/pasha-1-0-5-parallelized-short-read-assembly.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "pasha", "additionDate": "2017-12-18T00:10:03Z", "name": "PASHA", "license": null, "documentation": [{"url": "http://pasha.sourceforge.net/homepage.htm#installation", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}