{
    "additionDate": "2021-01-18T09:18:12Z",
    "biotoolsCURIE": "biotools:cvid-image",
    "biotoolsID": "cvid-image",
    "confidence_flag": "tool",
    "description": "Conditional Variational Image Deraining (CVID) network for better deraining performance, leveraging the exclusive generative ability of Conditional Variational Auto-Encoder (CVAE) on providing diverse predictions for the rainy image. To perform spatially adaptive deraining, we propose a spatial density estimation (SDE) module to estimate a rain density map for each image. Since rain density varies across different color channels, we also propose a channel-wise (CW) deraining scheme.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Yingjun-Du/VID",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T18:52:40Z",
    "name": "CVID",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.2990606",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.Image deraining is an important yet challenging image processing task. Though deterministic image deraining methods are developed with encouraging performance, they are infeasible to learn flexible representations for probabilistic inference and diverse predictions. Besides, rain intensity varies both in spatial locations and across color channels, making this task more difficult. In this paper, we propose a Conditional Variational Image Deraining (CVID) network for better deraining performance, leveraging the exclusive generative ability of Conditional Variational Auto-Encoder (CVAE) on providing diverse predictions for the rainy image. To perform spatially adaptive deraining, we propose a spatial density estimation (SDE) module to estimate a rain density map for each image. Since rain density varies across different color channels, we also propose a channel-wise (CW) deraining scheme. Experiments on synthesized and real-world datasets show that the proposed CVID network achieves much better performance than previous deterministic methods on image deraining. Extensive ablation studies validate the effectiveness of the proposed SDE module and CW scheme in our CVID network. The code is available at https://github.com/Yingjun-Du/VID.",
                "authors": [
                    {
                        "name": "Cheng M.-M."
                    },
                    {
                        "name": "Du Y."
                    },
                    {
                        "name": "Shao L."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhen X."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Conditional Variational Image Deraining"
            },
            "pmid": "32365032"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
