{"credit":[{"email":"wmchen@virginia.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://people.virginia.edu/~wc9c/home.html"}],"documentation":[{"type":"GENERAL","url":"http://people.virginia.edu/~wc9c/TDTPC/Download.htm"}],"function":[{"note":"Computing the Statistical Power of the\nTransmission Disequilibrium Test","operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/tdt-power-calculator-1-2-1-power-calculation-tdt.html"}],"publication":[{"abstract":"Transmission disequilibrium test (TDT) is a nuclear family-based analysis that can test linkage in the presence of association. It has gained extensive attention in theoretical investigation and in practical application; in both cases, the accuracy and generality of the power computation of the TDT are crucial. Despite extensive investigations, previous approaches for computing the statistical power of the TDT are neither accurate nor general. In this paper, we develop a general and highly accurate approach to analytically compute the power of the TDT. We compare the results from our approach with those from several other recent papers, all against the results obtained from computer simulations. We show that the results computed from our approach are more accurate than or at least the same as those from other approaches. More importantly, our approach can handle various situations, which include (1) families that consist of one or more children and that have any configuration of affected and nonaffected sibs; (2) families ascertained through the affection status of parent(s); (3) any mixed sample with different types of families in (1) and (2); (4) the marker locus is not a disease susceptibility locus; and (5) existence of allelic heterogeneity. We implement this approach in a user-friendly computer program: TDT Power Calculator. Its applications are demonstrated. The approach and the program developed here should be significant for theoreticians to accurately investigate the statistical power of the TDT in various situations, and for empirical geneticists to plan efficient studies using the TDT. © Wiley-Liss, Inc.","authors":["Chen W.-M.","Deng H.-W."],"cit_count":76,"journal":"Genetic Epidemiology","pmid":"11443734","title":"A general and accurate approach for computing the statistical power of the transmission disequilibrium test for complex disease genes","year":"2001-07-18"}],"summary":{"biotoolsCURIE":"biotools:tdt_power_calculator","biotoolsID":"tdt_power_calculator","description":"A software for Power Calculation for the TDT (Transmission disequilibrium test).","homepage":"http://people.virginia.edu/~wc9c/TDTPC/Download.htm","name":"TDT Power Calculator"}}