{
    "accessibility": "Open access",
    "additionDate": "2021-10-26T13:45:17.505422Z",
    "biotoolsCURIE": "biotools:ppdb",
    "biotoolsID": "ppdb",
    "confidence_flag": "tool",
    "cost": "Commercial",
    "credit": [
        {
            "email": "paochoa@utpl.edu.ec",
            "name": "Pablo A. Ochoa-Cueva",
            "orcidid": "https://orcid.org/0000-0003-2230-1026",
            "typeEntity": "Person"
        },
        {
            "name": "Alan S. Kolok"
        },
        {
            "name": "Ana P. Arévalo"
        },
        {
            "name": "Juan Arteaga",
            "orcidid": "https://orcid.org/0000-0001-8066-6248"
        }
    ],
    "description": "The PPDB is a comprehensive relational database of pesticide chemical identity, physicochemical, human health and ecotoxicological data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://sitem.herts.ac.uk/aeru/ppdb/en/index.htm",
    "lastUpdate": "2021-10-26T13:45:17.507834Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://sitem.herts.ac.uk/aeru/ppdb/en/index.htm"
        }
    ],
    "name": "PPDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/IEAM.4470",
            "metadata": {
                "abstract": "© 2021 SETACThe potential risk of pesticide exposure in developing countries needs further study as data are limited and simple tools to assess the risks on human health and the environment caused by pesticides are lacking. This article introduces a potential pesticides exposure index (PPEI) as a modeling tool to assess the risk of human and environmental pesticide exposure in agricultural basins. The PPEI is based on a number of factors including: human population centers and their proximity to agricultural crops, the toxicological properties of pesticides, and their application frequency. The index was applied to a region in southern Ecuador (approximately 7200 km2) where corn, rice, and sugarcane are the predominant crops, and where hot spots with the highest vulnerability to pesticide residues were identified. Of the total of 5326 neighborhoods for the entire study area, 1030 had high, 1124 had medium, and 1009 had low PPEI scores. Among the practical uses of PPEI are to help to assist regulatory agencies and academics evaluate the effects of land use policies on pesticide vulnerability. Also, it can be easily expanded to include other parameters, such as data from other agricultural crops, or frequency of pesticide application. The PPEI can be a valuable indicator of risk of pesticide exposure, as it is reliable and applicable to developing countries, where data and resources are limited. Integr Environ Assess Manag 2021;00:1–11. © 2021 SETAC.",
                "authors": [
                    {
                        "name": "Arevalo A.P."
                    },
                    {
                        "name": "Arteaga J."
                    },
                    {
                        "name": "Kolok A.S."
                    },
                    {
                        "name": "Ochoa-Cueva P.A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Integrated Environmental Assessment and Management",
                "title": "A potential pesticides exposure index (PPEI) for developing countries: Applied in a transboundary basin"
            },
            "pmid": "34061455"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
