{
    "additionDate": "2015-05-04T12:25:52Z",
    "biotoolsCURIE": "biotools:nutrichem",
    "biotoolsID": "nutrichem",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "irene@cbs.dtu.dk",
            "name": "Irene Kouskoumvekaki",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Database generated by text mining of 21 million MEDLINE abstracts, with information that links plant-based foods with their small molecule components and human disease phenotypes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbs.dtu.dk/services/NutriChem-1.0/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Compound name",
                        "uri": "http://edamontology.org/data_0990"
                    },
                    "format": [
                        {
                            "term": "SMILES",
                            "uri": "http://edamontology.org/format_1196"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Disease ID",
                        "uri": "http://edamontology.org/data_1150"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "note": "Information that links plant-based foods with their small molecule components and human disease phenotypes",
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network identifier",
                        "uri": "http://edamontology.org/data_1082"
                    },
                    "format": [
                        {
                            "term": "Binary format",
                            "uri": "http://edamontology.org/format_2333"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.cbs.dtu.dk/services/NutriChem-1.0",
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "NutriChem",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1093/nar/gku724",
            "metadata": {
                "abstract": "© The Author(s) 2014.There is rising evidence of an inverse association between chronic diseases and diets characterized by rich fruit and vegetable consumption. Dietary components may act directly or indirectly on the human genome and modulate multiple processes involved in disease risk and disease progression. However, there is currently no exhaustive resource on the health benefits associated to specific dietary interventions, or a resource covering the broad molecular content of food. Here we present the first release of NutriChem, available at http://cbs.dtu.dk/services/NutriChem-1.0, a database generated by text mining of 21 million MEDLINE abstracts for information that links plant-based foods with their small molecule components and human disease phenotypes. NutriChem contains text-mined data for 18478 pairs of 1772 plant-based foods and 7898 phytochemicals, and 6242 pairs of 1066 plant-based foods and 751 diseases. In addition, it includes predicted associations for 548 phytochemicals and 252 diseases. To the best of our knowledge this database is the only resource linking the chemical space of plant-based foods with human disease phenotypes and provides a foundation for understanding mechanistically the consequences of eating behaviors on health.",
                "authors": [
                    {
                        "name": "Jensen K."
                    },
                    {
                        "name": "Kouskoumvekaki I."
                    },
                    {
                        "name": "Panagiotou G."
                    }
                ],
                "citationCount": 21,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NutriChem: A systems chemical biology resource to explore the medicinal value of plant-based foods"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1371/journal.pcbi.1003432",
            "metadata": {
                "abstract": "Awareness that disease susceptibility is not only dependent on genetic make up, but can be affected by lifestyle decisions, has brought more attention to the role of diet. However, food is often treated as a black box, or the focus is limited to few, well-studied compounds, such as polyphenols, lipids and nutrients. In this work, we applied text mining and Naïve Bayes classification to assemble the knowledge space of food-phytochemical and food-disease associations, where we distinguish between disease prevention/amelioration and disease progression. We subsequently searched for frequently occurring phytochemical-disease pairs and we identified 20,654 phytochemicals from 16,102 plants associated to 1,592 human disease phenotypes. We selected colon cancer as a case study and analyzed our results in three directions; i) one stop legacy knowledge-shop for the effect of food on disease, ii) discovery of novel bioactive compounds with drug-like properties, and iii) discovery of novel health benefits from foods. This works represents a systematized approach to the association of food with health effect, and provides the phytochemical layer of information for nutritional systems biology research. © 2014 Jensen et al.",
                "authors": [
                    {
                        "name": "Jensen K."
                    },
                    {
                        "name": "Kouskoumvekaki I."
                    },
                    {
                        "name": "Panagiotou G."
                    }
                ],
                "citationCount": 30,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Integrated Text Mining and Chemoinformatics Analysis Associates Diet to Health Benefit at Molecular Level"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        }
    ],
    "validated": 1
}
