{
    "additionDate": "2018-07-14T10:26:31Z",
    "biotoolsCURIE": "biotools:16spip",
    "biotoolsID": "16spip",
    "credit": [
        {
            "email": "zhangwen@icdc.cn",
            "name": "Wen Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive analysis pipeline for rapid pathogen detection in clinical samples based on 16S metagenomic sequencing.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://16spip.mypathogen.cn/docs/Manual-16sPIP.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://16spip.mypathogen.cn/",
    "language": [
        "Perl",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-25T14:33:11.783719Z",
    "name": "16sPIP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1975-3",
            "metadata": {
                "abstract": "Background: Pathogen detection in clinical samples based on 16S metagenomic sequencing technology in microbiology laboratories is an important strategy for clinical diagnosis, public health surveillance, and investigations of outbreaks. However, the implementation of the technology is limited by its accuracy and the time required for bioinformatics analysis. Therefore, a simple, standardized, and rapid analysis pipeline from the receipt of clinical samples to the generation of a test report is needed to increase the use of metagenomic analyses in clinical settings. Results: We developed a comprehensive bioinformatics analysis pipeline for the identification of pathogens in clinical samples based on 16S metagenomic sequencing data, named 16SPIP. This pipeline offers two analysis modes (fast and sensitive mode) for the rapid conversion of clinical 16S metagenomic data to test reports for pathogen detection. The pipeline includes tools for data conversion, quality control, merging of paired-end reads, alignment, and pathogen identification. We validated the feasibility and accuracy of the pipeline using a combination of culture and whole-genome shotgun (WGS) metagenomic analyses. Conclusions: 16SPIP may be effective for the analysis of 16S metagenomic sequencing data for real-time, rapid, and unbiased pathogen detection in clinical samples.",
                "authors": [
                    {
                        "name": "Han N."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Miao J."
                    },
                    {
                        "name": "Qiang Y."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 58,
                "date": "2017-12-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "16SPIP: A comprehensive analysis pipeline for rapid pathogen detection in clinical samples based on 16S metagenomic sequencing"
            },
            "pmcid": "PMC5751400",
            "pmid": "29297318",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
