{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T22:08:20.111802Z",
    "biotoolsCURIE": "biotools:rnmf",
    "biotoolsID": "rnmf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Haihua Liang"
        },
        {
            "name": "Shaoan Zhang"
        },
        {
            "name": "Wen Luo"
        },
        {
            "name": "Zhenzhang Li"
        }
    ],
    "description": "A practical framework RNMF for exploring the association between mutational signatures and genes using gene cumulative contribution abundance.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/zhenzhang-li/RNMF",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-17T22:08:20.115225Z",
    "license": "Not licensed",
    "name": "RNMF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/CAM4.4717",
            "metadata": {
                "abstract": "© 2022 The Authors. Cancer Medicine published by John Wiley & Sons Ltd.Background: Mutational signatures are somatic mutation patterns enriching operational mutational processes, which can provide abundant information about the mechanism of cancer. However, understanding of the pathogenic biological processes is still limited, such as the association between mutational signatures and genes. Methods: We developed a simple and practical R package called RNMF (https://github.com/zhenzhang-li/RNMF) for mutational signature analysis, including a key model of cumulative contribution abundance (CCA), which was designed to highlight the association between mutational signatures and genes and then applying it to a meta-analysis of 1073 individuals with esophageal squamous cell carcinoma (ESCC). Results: We revealed a number of known and previously undescribed SBS or ID signatures, and we found that APOBEC signatures (SBS2* and SBS13*) were closely associated with PIK3CA mutation, especially the E545k mutation. Furthermore, we found that age signature is closely related to the frequent mutation of TP53, of which R342* is highlighted due to strongly linked to age signature. In addition, the CCA matrix image data of genes in the signatures New, SBS3*, and SBS17b* were helpful for the preliminary evaluation of shortened survival outcome. These results can be extended to estimate the distribution of mutations or features, and study the potential impact of clinical factors. Conclusions: In a word, RNMF can successfully achieve the correlation analysis of mutational signatures and genes, proving a strong theoretical basis for the study of mutational processes during tumor development.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Liang H."
                    },
                    {
                        "name": "Luo W."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Cancer Medicine",
                "title": "A practical framework RNMF for exploring the association between mutational signatures and genes using gene cumulative contribution abundance"
            },
            "pmid": "35575002"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
