
{
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "comin@dei.unipd.it",
            "name": "Matteo Comin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~ciompin/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.dei.unipd.it/~ciompin/main/qcluster.html"
        }
    ],
    "function": [
        {
            "note": "Assembly booster, reads clustering",
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "license": "Other",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The data volume generated by Next-Generation Sequencing (NGS) technologies is growing at a pace that is now challenging the storage and data processing capacities of modern computer systems. In this context an important aspect is the reduction of data complexity by collapsing redundant reads in a single cluster to improve the run time, memory requirements, and quality of post-processing steps like assembly and error correction. Several alignment-free measures, based on k-mers counts, have been used to cluster reads. Quality scores produced by NGS platforms are fundamental for various analysis of NGS data like reads mapping and error detection. Moreover future-generation sequencing platforms will produce long reads but with a large number of erroneous bases (up to 15%). Thus it will be fundamental to exploit quality value information within the alignment-free framework. In this paper we present a family of alignment-free measures, called D q -type, that incorporate quality value information and k-mers counts for the comparison of reads data. A set of experiments on simulated and real reads data confirms that the new measures are superior to other classical alignment-free statistics, especially when erroneous reads are considered. These measures are implemented in a software called QCluster (http://www.dei.unipd.it/∼ciompin/main/ qcluster.html). © 2014 Springer-Verlag Berlin Heidelberg.",
            "authors": [
                "Comin M.",
                "Leoni A.",
                "Schimd M."
            ],
            "cit_count": 5,
            "doi": "10.1007/978-3-662-44753-6_1",
            "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
            "title": "QCluster: Extending alignment-free measures with quality values for reads clustering",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:qcluster",
        "biotoolsID": "qcluster",
        "description": "NGS reads clustering",
        "homepage": "http://www.dei.unipd.it/~ciompin/main/qcluster.html",
        "name": "QCluster",
        "version": [
            "1"
        ]
    }
}