{
    "additionDate": "2018-06-02T07:57:13Z",
    "biotoolsCURIE": "biotools:mechrna",
    "biotoolsID": "mechrna",
    "credit": [
        {
            "email": "agawrons@sfu.ca",
            "name": "Alexander R Gawronski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "backofen@informatik.uni-freiburg.de",
            "name": "Rolf Backofen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "cenksahi@indiana.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Prediction of lncRNA mechanisms from RNA–RNA and RNA–protein interactions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/compbio/mechrna"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/compbio/mechrna",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "MechRNA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty208",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press.Motivation: Long non-coding RNAs (lncRNAs) are defined as transcripts longer than 200 nt that do not get translated into proteins. Often these transcripts are processed (spliced, capped and polyadenylated) and some are known to have important biological functions. However, most lncRNAs have unknown or poorly understood functions. Nevertheless, because of their potential role in cancer, lncRNAs are receiving a lot of attention, and the need for computational tools to predict their possible mechanisms of action is more than ever. Fundamentally, most of the known lncRNA mechanisms involve RNA–RNA and/or RNA–protein interactions. Through accurate predictions of each kind of interaction and integration of these predictions, it is possible to elucidate potential mechanisms for a given lncRNA. Results: Here, we introduce MechRNA, a pipeline for corroborating RNA–RNA interaction prediction and protein binding prediction for identifying possible lncRNA mechanisms involving specific targets or on a transcriptome-wide scale. The first stage uses a version of IntaRNA2 with added functionality for efficient prediction of RNA–RNA interactions with very long input sequences, allowing for large-scale analysis of lncRNA interactions with little or no loss of optimality. The second stage integrates protein binding information pre-computed by GraphProt, for both the lncRNA and the target. The final stage involves inferring the most likely mechanism for each lncRNA/target pair. This is achieved by generating candidate mechanisms from the predicted interactions, the relative locations of these interactions and correlation data, followed by selection of the most likely mechanistic explanation using a combined P-value. We applied MechRNA on a number of recently identified cancer-related lncRNAs (PCAT1, PCAT29 and ARLnc1) and also on two well-studied lncRNAs (PCA3 and 7SL). This led to the identification of hundreds of high confidence potential targets for each lncRNA and corresponding mechanisms. These predictions include the known competitive mechanism of 7SL with HuR for binding on the tumor suppressor TP53, as well as mechanisms expanding what is known about PCAT1 and ARLn1 and their targets BRCA2 and AR, respectively. For PCAT1-BRCA2, the mechanism involves competitive binding with HuR, which we confirmed using HuR immunoprecipitation assays.",
                "authors": [
                    {
                        "name": "Backofen R."
                    },
                    {
                        "name": "Chinnaiyan A.M."
                    },
                    {
                        "name": "Collins C.C."
                    },
                    {
                        "name": "Feng F."
                    },
                    {
                        "name": "Gawronski A.R."
                    },
                    {
                        "name": "Lin Y.-Y."
                    },
                    {
                        "name": "Malik R."
                    },
                    {
                        "name": "Niknafs Y.S."
                    },
                    {
                        "name": "Ramnarine V.R."
                    },
                    {
                        "name": "Sahinalp S.C."
                    },
                    {
                        "name": "Uhl M."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 25,
                "date": "2018-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MechRNA: Prediction of lncRNA mechanisms from RNA–RNA and RNA–protein interactions"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
