{
    "additionDate": "2021-01-18T09:05:42Z",
    "biotoolsCURIE": "biotools:sdn2go",
    "biotoolsID": "sdn2go",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leideng@csu.edu.cn",
            "name": "Lei Deng",
            "typeEntity": "Person"
        }
    ],
    "description": "An Integrated Deep Learning Model for Protein Function Prediction.\n\nA Deep Learning Model for Protein Function Prediction.\n\nSDNGO is a deep learning model for predicting protein functions using protein sequences, protein domains, and protein-protein interaction (PPI) networks.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/Charrick/SDN2GO/tree/master/data"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Charrick/SDN2GO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-13T17:09:10Z",
    "name": "SDN2GO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00391",
            "metadata": {
                "abstract": "© 2020 Cai, Wang and Deng.The assignment of function to proteins at a large scale is essential for understanding the molecular mechanism of life. However, only a very small percentage of the more than 179 million proteins in UniProtKB have Gene Ontology (GO) annotations supported by experimental evidence. In this paper, we proposed an integrated deep-learning-based classification model, named SDN2GO, to predict protein functions. SDN2GO applies convolutional neural networks to learn and extract features from sequences, protein domains, and known PPI networks, and then utilizes a weight classifier to integrate these features and achieve accurate predictions of GO terms. We constructed the training set and the independent test set according to the time-delayed principle of the Critical Assessment of Function Annotation (CAFA) and compared it with two highly competitive methods and the classic BLAST method on the independent test set. The results show that our method outperforms others on each sub-ontology of GO. We also investigated the performance of using protein domain information. We learned from the Natural Language Processing (NLP) to process domain information and pre-trained a deep learning sub-model to extract the comprehensive features of domains. The experimental results demonstrate that the domain features we obtained are much improved the performance of our model. Our deep learning models together with the data pre-processing scripts are publicly available as an open source software at https://github.com/Charrick/SDN2GO.",
                "authors": [
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "SDN2GO: An integrated deep learning model for protein function prediction"
            },
            "pmcid": "PMC7201018",
            "pmid": "32411695"
        }
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
