{
    "accessibility": "Open access",
    "additionDate": "2022-07-06T14:26:38.200962Z",
    "biotoolsCURIE": "biotools:pdbl",
    "biotoolsID": "pdbl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guoqiang Han"
        },
        {
            "name": "Jiatai Lin"
        },
        {
            "name": "Xipeng Pan"
        },
        {
            "name": "Zaiyi Liu"
        }
    ],
    "description": "Improving Histopathological Tissue Classification with Plug-and-Play Pyramidal Deep-Broad Learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/linjiatai/PDBL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-06T14:26:38.203562Z",
    "license": "Not licensed",
    "name": "PDBL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3161787",
            "metadata": {
                "abstract": "AuthorHistopathological tissue classification is a simpler way to achieve semantic segmentation for the whole slide images, which can alleviate the requirement of pixel-level dense annotations. Existing works mostly leverage the popular CNN classification backbones in computer vision to achieve histopathological tissue classification. In this paper, we propose a super lightweight plug-and-play module, named Pyramidal Deep-Broad Learning (PDBL), for any well-trained classification backbone to improve the classification performance without a re-training burden. For each patch, we construct a multi-resolution image pyramid to obtain the pyramidal contextual information. For each level in the pyramid, we extract the multi-scale deep-broad features by our proposed Deep-Broad block (DB-block). We equip PDBL in three popular classification backbones, ShuffLeNetV2, EfficientNetb0, and ResNet50 to evaluate the effectiveness and efficiency of our proposed module on two datasets (Kather Multiclass Dataset and the LC25000 Dataset). Experimental results demonstrate the proposed PDBL can steadily improve the tissue-level classification performance for any CNN backbones, especially for the lightweight models when given a small among of training samples (less than 10%). It greatly saves the computational resources and annotation efforts. The source code is available at: https://github.com/linjiatai/PDBL.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Han C."
                    },
                    {
                        "name": "Han G."
                    },
                    {
                        "name": "Jia X."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liang C."
                    },
                    {
                        "name": "Liang L."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Shi Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "PDBL: Improving Histopathological Tissue Classification with Plug-and-Play Pyramidal Deep-Broad Learning"
            },
            "pmid": "35320093"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
