{"credit":[{"email":"webmaster@ms-utils.org","typeEntity":"Person","typeRoles":["Documentor"],"url":"http://ms-utils.org"}],"documentation":[{"type":"GENERAL","url":"https://proteomics.ucsd.edu/ProteoSAFe/help.jsp"}],"download":[{"type":"Source code","url":"https://web.archive.org/web/20070706084404/http://peptide.ucsd.edu/ftprepos.html"}],"function":[{"operation":[{"term":"de Novo sequencing","uri":"http://edamontology.org/operation_3644"}]}],"labels":{"collectionID":["ms-utils","Proteomics"],"language":["Python","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://ms-utils.org"}],"publication":[{"abstract":"Filtration techniques in the form of rapid elimination of candidate sequences while retaining the true one are key ingredients of database searches in genomics. Although SEQUEST and Mascot perform a conceptually similar task to the tool BLAST, the key algorithmic idea of BLAST (filtration) was never implemented in these tools. As a result MS/MS protein identification tools are becoming too time-consuming for many applications including search for post-translationally modified peptides. Moreover, matching millions of spectra against all known proteins will soon make these tools too slow in the same way that \"genome vs genome\" comparisons instantly made BLAST too slow. We describe the development of filters for MS/MS database searches that dramatically reduce the running time and effectively remove the bottlenecks in searching the huge space of protein modifications. Our approach, based on a probability model for determining the accuracy of sequence tags, achieves superior results compared to GutenTag, a popular tag generation algorithm. Our tag generating algorithm along with our de novo sequencing algorithm PepNovo can be accessed via the URL http://peptide.ucsd.edu/. © 2005 American Chemical Society.","authors":["Frank A.","Tanner S.","Bafna V.","Pevzner P."],"cit_count":103,"journal":"Journal of Proteome Research","pmid":"16083278","title":"Peptide sequence tags for fast database search in mass-spectrometry","year":"2005-07-01"}],"summary":{"biotoolsCURIE":"biotools:proteosafe","biotoolsID":"proteosafe","description":"Blind spectral search of tandem mass spectra of peptides.","homepage":"http://proteomics.ucsd.edu/ProteoSAFe/","name":"ProteoSAFe"}}