{"credit":[{"email":"evaksianov@gmail.com","name":"Evgeniy Aksianov","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://mouse.belozersky.msu.ru/~evgeniy/cgi-bin/proton/proton.php?subproj=archip&page=help&data=alldocs"}],"function":[{"operation":[{"term":"Protein secondary structure assignment","uri":"http://edamontology.org/operation_0319"}]}],"labels":{"collectionID":["Proteomics"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/archip-2-1-detecting-architectures-of-all-β-and-αβ-classes.html"}],"publication":[{"abstract":"The description of a protein fold is a hard problem due to significant variability of main structural units, β-sheets and α-helixes, and their mutual arrangements. An adequate description of the structural units is an important step in objective protein structure classification, which to date is based on expert judgment in a number of cases. Explicit determination and description of structural units is more complicated for β-sheets than for α-helixes due to β-sheets variability both in composition and geometry. We have developed an algorithm that can significantly modify β-sheets detected by commonly used DSSP and Stride algorithms and represent the result as a \"β-sheet map,\" a table describing certain β-sheet features. In our approach, β-sheets (rather than β-strands) are considered as holistic objects. Both hydrogen bonds and geometrical restrains are explored for the determination of β-sheets. The algorithm is implemented in SheeP program. It was tested for prediction architectures of domains from 93 well-defined all-β and α/β SCOP protein domain families, and showed 93% of correct results. The Web-service allows to detect β-sheets in a given protein structure, visualize β-sheet maps, as well as input three-dimensional structures with highlighted β-sheets and their structural features. © 2012 Imperial College Press.","authors":["Aksianov E.","Alexeevski A."],"cit_count":2,"journal":"Journal of Bioinformatics and Computational Biology","pmid":"22809339","title":"Sheep: A tool for description of β-sheets in protein 3D structures","year":"2012-04-01"}],"summary":{"biotoolsCURIE":"biotools:archip","biotoolsID":"archip","description":"This tool detects architectures of all-β and α/β-classes","homepage":"http://mouse.belozersky.msu.ru/~evgeniy/cgi-bin/proton/proton.php?subproj=archip","name":"ArchiP"}}