{
    "name": "PPB", 
    "description": "web-based multi-fingerprint target prediction tool using ChEMBL bioactivity data.", 
    "homepage": "http://gdbtools.unibe.ch:8080/PPB/", 
    "biotoolsID": "PPB", 
    "biotoolsCURIE": "biotools:PPB", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0482", 
                    "term": "Virtual ligand screening"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2258", 
            "term": "Cheminformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0202", 
            "term": "Pharmacology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0154", 
            "term": "Small molecules"
        }, 
        {
            "uri": "http://edamontology.org/topic_3343", 
            "term": "Compound libraries and screening"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://gdbtools.unibe.ch:8080/PPB/help.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s13321-017-0199-x", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The polypharmacology browser: a web-based multi-fingerprint target prediction tool using ChEMBL bioactivity data", 
                "abstract": "© 2017 The Author(s).Background: Several web-based tools have been reported recently which predict the possible targets of a small molecule by similarity to compounds of known bioactivity using molecular fingerprints (fps), however predictions in each case rely on similarities computed from only one or two fps. Considering that structural similarity and therefore the predicted targets strongly depend on the method used for comparison, it would be highly desirable to predict targets using a broader set of fps simultaneously. Results: Herein, we present the polypharmacology browser (PPB), a web-based platform which predicts possible targets for small molecules by searching for nearest neighbors using ten different fps describing composition, substructures, molecular shape and pharmacophores. PPB searches through 4613 groups of at least 10 same target annotated bioactive molecules from ChEMBL and returns a list of predicted targets ranked by consensus voting scheme and p value. A validation study across 670 drugs with up to 20 targets showed that combining the predictions from all 10 fps gives the best results, with on average 50% of the known targets of a drug being correctly predicted with a hit rate of 25%. Furthermore, when profiling a new inhibitor of the calcium channel TRPV6 against 24 targets taken from a safety screen panel, we observed inhibition in 5 out of 5 targets predicted by PPB and in 7 out of 18 targets not predicted by PPB. The rate of correct (5/12) and incorrect (0/12) predictions for this compound by PPB was comparable to that of other web-based prediction tools. Conclusion: PPB offers a versatile platform for target prediction based on multi-fingerprint comparisons, and is freely accessible at www.gdb.unibe.ch as a valuable support for drug discovery.", 
                "date": "2017-02-21T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Awale M."
                    }, 
                    {
                        "name": "Reymond J.-L."
                    }
                ], 
                "journal": "Journal of Cheminformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Jean-Louis Reymond", 
            "email": "jean-louis.reymond@dcb.unibe.ch", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-09-01T10:01:32Z", 
    "lastUpdate": "2018-12-10T12:59:01Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}