{
    "accessibility": "Open access",
    "additionDate": "2019-05-21T07:49:03Z",
    "biotoolsCURIE": "biotools:Shambhala",
    "biotoolsID": "Shambhala",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/oncobox-admin"
        }
    ],
    "description": "Platform-agnostic data harmonizer for gene expression data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "https://github.com/oncobox-admin/harmony",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Shambhala",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2641-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Harmonization techniques make different gene expression profiles and their sets compatible and ready for comparisons. Here we present a new bioinformatic tool termed Shambhala for harmonization of multiple human gene expression datasets obtained using different experimental methods and platforms of microarray hybridization and RNA sequencing. Results: Unlike previously published methods enabling good quality data harmonization for only two datasets, Shambhala allows conversion of multiple datasets into the universal form suitable for further comparisons. Shambhala harmonization is based on the calibration of gene expression profiles using the auxiliary standardization dataset. Each profile is transformed to make it similar to the output of microarray hybridization platform Affymetrix Human Gene. This platform was chosen because it has the biggest number of human gene expression profiles deposited in public databases. We evaluated Shambhala ability to retain biologically important features after harmonization. The same four biological samples taken in multiple replicates were profiled independently using three and four different experimental platforms, respectively, then Shambhala-harmonized and investigated by hierarchical clustering. Conclusion: Our results showed that unlike other frequently used methods: quantile normalization and DESeq/DESeq2 normalization, Shambhala harmonization was the only method supporting sample-specific and platform-independent biologically meaningful clustering for the data obtained from multiple experimental platforms.",
                "authors": [
                    {
                        "name": "Borisov N."
                    },
                    {
                        "name": "Shabalina I."
                    },
                    {
                        "name": "Tkachev V."
                    },
                    {
                        "name": "Sorokin M."
                    },
                    {
                        "name": "Garazha A."
                    },
                    {
                        "name": "Pulin A."
                    },
                    {
                        "name": "Eremin I.I."
                    },
                    {
                        "name": "Buzdin A."
                    }
                ],
                "citationCount": 15,
                "date": "2019-02-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Shambhala: A platform-agnostic data harmonizer for gene expression data 06 Biological Sciences 0604 Genetics"
            },
            "pmcid": "PMC6366102",
            "pmid": "30727942",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}