
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Urology and nephrology",
                "uri": "http://edamontology.org/topic_3422"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019Background: The primary approach for defining disease in observational healthcare databases is to construct phenotype algorithms (PAs), rule-based heuristics predicated on the presence, absence, and temporal logic of clinical observations. However, a complete evaluation of PAs, i.e., determining sensitivity, specificity, and positive predictive value (PPV), is rarely performed. In this study, we propose a tool (PheValuator) to efficiently estimate a complete PA evaluation. Methods: We used 4 administrative claims datasets: OptumInsight's de-identified Clinformatics™ Datamart (Eden Prairie,MN); IBM MarketScan Multi-State Medicaid); IBM MarketScan Medicare Supplemental Beneficiaries; and IBM MarketScan Commercial Claims and Encounters from 2000 to 2017. Using PheValuator involves (1) creating a diagnostic predictive model for the phenotype, (2) applying the model to a large set of randomly selected subjects, and (3) comparing each subject's predicted probability for the phenotype to inclusion/exclusion in PAs. We used the predictions as a ‘probabilistic gold standard’ measure to classify positive/negative cases. We examined 4 phenotypes: myocardial infarction, cerebral infarction, chronic kidney disease, and atrial fibrillation. We examined several PAs for each phenotype including 1-time (1X) occurrence of the diagnosis code in the subject's record and 1-time occurrence of the diagnosis in an inpatient setting with the diagnosis code as the primary reason for admission (1X-IP-1stPos). Results: Across phenotypes, the 1X PA showed the highest sensitivity/lowest PPV among all PAs. 1X-IP-1stPos yielded the highest PPV/lowest sensitivity. Specificity was very high across algorithms. We found similar results between algorithms across datasets. Conclusion: PheValuator appears to show promise as a tool to estimate PA performance characteristics.",
            "authors": [
                "Swerdel J.N.",
                "Hripcsak G.",
                "Ryan P.B."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.JBI.2019.103258",
            "journal": "Journal of Biomedical Informatics",
            "pmid": "31369862",
            "title": "PheValuator: Development and evaluation of a phenotype algorithm evaluator",
            "year": "2019-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:PheValuator",
        "biotoolsID": "PheValuator",
        "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | Development and evaluation of a phenotype algorithm evaluator | BACKGROUND:The primary approach for defining disease in observational healthcare databases is to construct phenotype algorithms (PAs), rule-based heuristics predicated on the presence, absence, and temporal logic of clinical observations. However, a complete evaluation of PAs, i.e., determining sensitivity, specificity, and positive predictive value (PPV), is rarely performed. In this study, we propose a tool (PheValuator) to efficiently estimate a complete PA evaluation. METHODS:We used 4 administrative claims datasets: OptumInsight's de-identified Clinformatics™ Datamart (Eden Prairie,MN); IBM MarketScan Multi-State Medicaid); IBM MarketScan Medicare Supplemental Beneficiaries; and IBM MarketScan Commercial Claims and Encounters from 2000 to 2017",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31369862",
        "name": "PheValuator"
    }
}