{
    "accessibility": "Open access",
    "additionDate": "2019-11-14T18:26:38Z",
    "biotoolsCURIE": "biotools:PheValuator",
    "biotoolsID": "PheValuator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jswerdel@its.jns.com",
            "name": "Joel N. Swerdel"
        },
        {
            "name": "Patrick B. Ryan"
        }
    ],
    "description": "PheValuator is a phenotype algorithm evaluator.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://ohdsi.github.io/PheValuator/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OHDSI/PheValuator",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:27:44.633361Z",
    "license": "Apache-2.0",
    "name": "PheValuator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.jbi.2019.103258",
            "metadata": {
                "abstract": "Background: The primary approach for defining disease in observational healthcare databases is to construct phenotype algorithms (PAs), rule-based heuristics predicated on the presence, absence, and temporal logic of clinical observations. However, a complete evaluation of PAs, i.e., determining sensitivity, specificity, and positive predictive value (PPV), is rarely performed. In this study, we propose a tool (PheValuator) to efficiently estimate a complete PA evaluation. Methods: We used 4 administrative claims datasets: OptumInsight's de-identified Clinformatics™ Datamart (Eden Prairie,MN); IBM MarketScan Multi-State Medicaid); IBM MarketScan Medicare Supplemental Beneficiaries; and IBM MarketScan Commercial Claims and Encounters from 2000 to 2017. Using PheValuator involves (1) creating a diagnostic predictive model for the phenotype, (2) applying the model to a large set of randomly selected subjects, and (3) comparing each subject's predicted probability for the phenotype to inclusion/exclusion in PAs. We used the predictions as a ‘probabilistic gold standard’ measure to classify positive/negative cases. We examined 4 phenotypes: myocardial infarction, cerebral infarction, chronic kidney disease, and atrial fibrillation. We examined several PAs for each phenotype including 1-time (1X) occurrence of the diagnosis code in the subject's record and 1-time occurrence of the diagnosis in an inpatient setting with the diagnosis code as the primary reason for admission (1X-IP-1stPos). Results: Across phenotypes, the 1X PA showed the highest sensitivity/lowest PPV among all PAs. 1X-IP-1stPos yielded the highest PPV/lowest sensitivity. Specificity was very high across algorithms. We found similar results between algorithms across datasets. Conclusion: PheValuator appears to show promise as a tool to estimate PA performance characteristics.",
                "authors": [
                    {
                        "name": "Hripcsak G."
                    },
                    {
                        "name": "Ryan P.B."
                    },
                    {
                        "name": "Swerdel J.N."
                    }
                ],
                "citationCount": 26,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "PheValuator: Development and evaluation of a phenotype algorithm evaluator"
            },
            "pmcid": "PMC7736922",
            "pmid": "31369862"
        },
        {
            "doi": "10.1016/j.jbi.2022.104177",
            "metadata": {
                "abstract": "Purpose: Phenotype algorithms are central to performing analyses using observational data. These algorithms translate the clinical idea of a health condition into an executable set of rules allowing for queries of data elements from a database. PheValuator, a software package in the Observational Health Data Sciences and Informatics (OHDSI) tool stack, provides a method to assess the performance characteristics of these algorithms, namely, sensitivity, specificity, and positive and negative predictive value. It uses machine learning to develop predictive models for determining a probabilistic gold standard of subjects for assessment of cases and non-cases of health conditions. PheValuator was developed to complement or even replace the traditional approach of algorithm validation, i.e., by expert assessment of subject records through chart review. Results in our first PheValuator paper suggest a systematic underestimation of the PPV compared to previous results using chart review. In this paper we evaluate modifications made to the method designed to improve its performance. Methods: The major changes to PheValuator included allowing all diagnostic conditions, clinical observations, drug prescriptions, and laboratory measurements to be included as predictors within the modeling process whereas in the prior version there were significant restrictions on the included predictors. We also have allowed for the inclusion of the temporal relationships of the predictors in the model. To evaluate the performance of the new method, we compared the results from the new and original methods against results found from the literature using traditional validation of algorithms for 19 phenotypes. We performed these tests using data from five commercial databases. Results: In the assessment aggregating all phenotype algorithms, the median difference between the PheValuator estimate and the gold standard estimate for PPV was reduced from −21 (IQR −34, −3) in Version 1.0 to 4 (IQR −3, 15) using Version 2.0. We found a median difference in specificity of 3 (IQR 1, 4.25) for Version 1.0 and 3 (IQR 1, 4) for Version 2.0. The median difference between the two versions of PheValuator and the gold standard for estimates of sensitivity was reduced from −39 (-51, −20) to −16 (-34, −6). Conclusion: PheValuator 2.0 produces estimates for the performance characteristics for phenotype algorithms that are significantly closer to estimates from traditional validation through chart review compared to version 1.0. With this tool in researcher's toolkits, methods, such as quantitative bias analysis, may now be used to improve the reliability and reproducibility of research studies using observational data.",
                "authors": [
                    {
                        "name": "Murray G."
                    },
                    {
                        "name": "Ryan P.B."
                    },
                    {
                        "name": "Schuemie M."
                    },
                    {
                        "name": "Swerdel J.N."
                    }
                ],
                "citationCount": 5,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "PheValuator 2.0: Methodological improvements for the PheValuator approach to semi-automated phenotype algorithm evaluation"
            },
            "pmid": "35995107"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
