{
    "additionDate": "2019-11-14T20:11:44Z",
    "biotoolsCURIE": "biotools:FFPE_autogenerated",
    "biotoolsID": "FFPE_autogenerated",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "wang.chen@mayo.edu",
            "name": "Chen Wang",
            "orcidid": "https://orcid.org/0000-0003-2638-3081",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > HOMEPAGE MISSING! | > NAME (FFPE) SIMILAR TO (PUB. DIFFERENT) bio.tools/ffpe (ffpe) | Bioinformatics and DNA-extraction strategies to reliably detect genetic variants from FFPE breast tissue samples | BACKGROUND:Archived formalin fixed paraffin embedded (FFPE) samples are valuable clinical resources to examine clinically relevant morphology features and also to study genetic changes. However, DNA quality and quantity of FFPE samples are often sub-optimal, and resulting NGS-based genetics variant detections are prone to false positives. Evaluations of wet-lab and bioinformatics approaches are needed to optimize variant detection from FFPE samples. RESULTS:As a pilot study, we designed within-subject triplicate samples of DNA derived from paired FFPE and fresh frozen breast tissues to highlight FFPE-specific artifacts",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31477010",
    "lastUpdate": "2019-11-14T20:11:44Z",
    "name": "FFPE_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6056-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Archived formalin fixed paraffin embedded (FFPE) samples are valuable clinical resources to examine clinically relevant morphology features and also to study genetic changes. However, DNA quality and quantity of FFPE samples are often sub-optimal, and resulting NGS-based genetics variant detections are prone to false positives. Evaluations of wet-lab and bioinformatics approaches are needed to optimize variant detection from FFPE samples. Results: As a pilot study, we designed within-subject triplicate samples of DNA derived from paired FFPE and fresh frozen breast tissues to highlight FFPE-specific artifacts. For FFPE samples, we tested two FFPE DNA extraction methods to determine impact of wet-lab procedures on variant calling: QIAGEN QIAamp DNA Mini Kit (\"QA\"), and QIAGEN GeneRead DNA FFPE Kit (\"QGR\"). We also used negative-control (NA12891) and positive control samples (Horizon Discovery Reference Standard FFPE). All DNA sample libraries were prepared for NGS according to the QIAseq Human Breast Cancer Targeted DNA Panel protocol and sequenced on the HiSeq 4000. Variant calling and filtering were performed using QIAGEN Gene Globe Data Portal. Detailed variant concordance comparisons and mutational signature analysis were performed to investigate effects of FFPE samples compared to paired fresh frozen samples, along with different DNA extraction methods. In this study, we found that five times or more variants were called with FFPE samples, compared to their paired fresh-frozen tissue samples even after applying molecular barcoding error-correction and default bioinformatics filtering recommended by the vendor. We also found that QGR as an optimized FFPE-DNA extraction approach leads to much fewer discordant variants between paired fresh frozen and FFPE samples. Approximately 92% of the uniquely called FFPE variants were of low allelic frequency range (< 5%), and collectively shared a \"C > T|G > A\" mutational signature known to be representative of FFPE artifacts resulting from cytosine deamination. Based on control samples and FFPE-frozen replicates, we derived an effective filtering strategy with associated empirical false-discovery estimates. Conclusions: Through this study, we demonstrated feasibility of calling and filtering genetic variants from FFPE tissue samples using a combined strategy with molecular barcodes, optimized DNA extraction, and bioinformatics methods incorporating genomics context such as mutational signature and variant allelic frequency.",
                "authors": [
                    {
                        "name": "Bhagwate A.V."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Winham S.J."
                    },
                    {
                        "name": "McDonough S.J."
                    },
                    {
                        "name": "Stallings-Mann M.L."
                    },
                    {
                        "name": "Heinzen E.P."
                    },
                    {
                        "name": "Davila J.I."
                    },
                    {
                        "name": "Vierkant R.A."
                    },
                    {
                        "name": "Hoskin T.L."
                    },
                    {
                        "name": "Frost M."
                    },
                    {
                        "name": "Carter J.M."
                    },
                    {
                        "name": "Radisky D.C."
                    },
                    {
                        "name": "Cunningham J.M."
                    },
                    {
                        "name": "Degnim A.C."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-02T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Bioinformatics and DNA-extraction strategies to reliably detect genetic variants from FFPE breast tissue samples"
            },
            "pmcid": "PMC6720378",
            "pmid": "31477010"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}