{
    "additionDate": "2018-07-22T09:13:52Z",
    "biotoolsCURIE": "biotools:tspmap",
    "biotoolsID": "tspmap",
    "credit": [
        {
            "email": "monroejg@colostate.edu",
            "name": "J. Grey Monroe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Method which implements both approximate and exact Traveling Salesperson Problem solvers to generate linkage maps.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/mckaylab/TSPmap"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mckaylab/TSPmap",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "TSPmap",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13040-017-0158-0",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Recent advances in nucleic acid sequencing technologies have led to a dramatic increase in the number of markers available to generate genetic linkage maps. This increased marker density can be used to improve genome assemblies as well as add much needed resolution for loci controlling variation in ecologically and agriculturally important traits. However, traditional genetic map construction methods from these large marker datasets can be computationally prohibitive and highly error prone. Results: We present TSPmap, a method which implements both approximate and exact Traveling Salesperson Problem solvers to generate linkage maps. We demonstrate that for datasets with large numbers of genomic markers (e.g. 10,000) and in multiple population types generated from inbred parents, TSPmap can rapidly produce high quality linkage maps with low sensitivity to missing and erroneous genotyping data compared to two other benchmark methods, JoinMap and MSTmap. TSPmap is open source and freely available as an R package. Conclusions: With the advancement of low cost sequencing technologies, the number of markers used in the generation of genetic maps is expected to continue to rise. TSPmap will be a useful tool to handle such large datasets into the future, quickly producing high quality maps using a large number of genomic markers.",
                "authors": [
                    {
                        "name": "Monroe J.G."
                    },
                    {
                        "name": "Allen Z.A."
                    },
                    {
                        "name": "Tanger P."
                    },
                    {
                        "name": "Mullen J.L."
                    },
                    {
                        "name": "Lovell J.T."
                    },
                    {
                        "name": "Moyers B.T."
                    },
                    {
                        "name": "Whitley D."
                    },
                    {
                        "name": "McKay J.K."
                    }
                ],
                "citationCount": 6,
                "date": "2017-12-19T00:00:00Z",
                "journal": "BioData Mining",
                "title": "TSPmap, a tool making use of traveling salesperson problem solvers in the efficient and accurate construction of high-density genetic linkage maps"
            },
            "pmcid": "PMC5735504",
            "pmid": "29270228"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}