{
    "additionDate": "2024-06-19T06:43:41.131895Z",
    "biotoolsCURIE": "biotools:shinymba",
    "biotoolsID": "shinymba",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zmatson@cdc.gov",
            "name": "Zachary Matson",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel R shiny application for quality control of the multiplex bead assay for serosurveillance studies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CDCgov/shinyMBA",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:52:31.442617Z",
    "license": "APSL-2.0",
    "name": "shinyMBA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41598-024-57652-4",
            "metadata": {
                "abstract": "The multiplex bead assay (MBA) based on Luminex xMAP technology can be used as a tool to measure seroprevalence as part of population immunity evaluations to multiple antigens in large-scale serosurveys. However, multiplexing several antigens presents challenges for quality control (QC) assessments of the data because multiple parameters must be evaluated for each antigen. MBA QC parameters include monitoring bead counts and median fluorescence intensity (MFI) for each antigen in plate wells, and performance of assay controls included on each plate. Analyzing these large datasets to identify plates failing QC standards presents challenges for many laboratories. We developed a novel R Shiny application, shinyMBA, to expedite the MBA QC processes and reduce the risk of user error. The app allows users to rapidly merge multi-plate assay outputs to evaluate bead count, MFI, and performance of assay controls using statistical process control charts for all antigen targets simultaneously. The utility of the shinyMBA application and its various outputs are demonstrated using data from 32 synthetic xPONENT files with 3 multiplex antigens and two population serosurveillance studies that evaluated 1200 and 3871 samples, respectively, for 20 multiplexed antigens. The shinyMBA open-source code is available for download and modification at https://github.com/CDCgov/shinyMBA. Incorporation of shinyMBA into Luminex serosurveillance workflows can vastly improve the speed and accuracy of QC processes.",
                "authors": [
                    {
                        "name": "Bankamp B."
                    },
                    {
                        "name": "Cooley G."
                    },
                    {
                        "name": "Coughlin M.M."
                    },
                    {
                        "name": "Matson Z."
                    },
                    {
                        "name": "Parameswaran N."
                    },
                    {
                        "name": "Simon A."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "shinyMBA: a novel R shiny application for quality control of the multiplex bead assay for serosurveillance studies"
            },
            "pmcid": "PMC10978933",
            "pmid": "38548772"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
