{
    "additionDate": "2020-01-09T17:53:57Z",
    "biotoolsCURIE": "biotools:Myo-REG",
    "biotoolsID": "Myo-REG",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "alessandro.palma@moleculargenetics.uniroma2.it",
            "name": "Alessandro Palma",
            "typeEntity": "Person"
        },
        {
            "email": "cesareni@uniroma2.it",
            "name": "Gianni Cesareni",
            "typeEntity": "Person"
        }
    ],
    "description": "A Portal for Signaling Interactions in Muscle Regeneration.\n\nmyogenesis and regeneration portal.\n\nMyo-REG offers easy access to signaling information in the context of muscle regeneration.\n\nMyogenesis & REGeneration Portal.\n\nMyo-REG offers easy access to signaling information in the context of muscle regeneration. The information is organized in two layers: the first concerns cell-cell interactions, while the second layer describes the most relevant signaling pathways underlying the crosstalk between the cell types participating in muscle regeneration. A user-friendly interface allows users to explore, via an interactive model, cell and pathway crosstalk",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://myoreg.uniroma2.it",
    "lastUpdate": "2020-01-09T17:53:57Z",
    "name": "Myo-REG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPHYS.2019.01216",
            "metadata": {
                "abstract": "© 2019 Palma, Cerquone Perpetuini, Ferrentino, Fuoco, Gargioli, Giuliani, Iannuccelli, Licata, Micarelli, Paoluzi, Perfetto, Petrilli, Reggio, Rosina, Sacco, Vumbaca, Zuccotti, Castagnoli and Cesareni.Muscle regeneration is a complex process governed by the interplay between several muscle-resident mononuclear cell populations. Following acute or chronic damage these cell populations are activated, communicate via cell–cell interactions and/or paracrine signals, influencing fate decisions via the activation or repression of internal signaling cascades. These are highly dynamic processes, occurring with distinct temporal and spatial kinetics. The main challenge toward a system level description of the muscle regeneration process is the integration of this plethora of inter-and intracellular interactions. We integrated the information on muscle regeneration in a web portal. The scientific content annotated in this portal is organized into two information layers representing relationships between different cell types and intracellular signaling-interactions, respectively. The annotation of the pathways governing the response of each cell type to a variety of stimuli/perturbations occurring during muscle regeneration takes advantage of the information stored in the SIGNOR database. Additional curation efforts have been carried out to increase the coverage of molecular interactions underlying muscle regeneration and to annotate cell–cell interactions. To facilitate the access to information on cell and molecular interactions in the context of muscle regeneration, we have developed Myo-REG, a web portal that captures and integrates published information on skeletal muscle regeneration. The muscle-centered resource we provide is one of a kind in the myology field. A friendly interface allows users to explore, approximately 100 cell interactions or to analyze intracellular pathways related to muscle regeneration. Finally, we discuss how data can be extracted from this portal to support in silico modeling experiments.",
                "authors": [
                    {
                        "name": "Palma A."
                    },
                    {
                        "name": "Perpetuini A.C."
                    },
                    {
                        "name": "Ferrentino F."
                    },
                    {
                        "name": "Fuoco C."
                    },
                    {
                        "name": "Gargioli C."
                    },
                    {
                        "name": "Giuliani G."
                    },
                    {
                        "name": "Iannuccelli M."
                    },
                    {
                        "name": "Licata L."
                    },
                    {
                        "name": "Micarelli E."
                    },
                    {
                        "name": "Paoluzi S."
                    },
                    {
                        "name": "Perfetto L."
                    },
                    {
                        "name": "Petrilli L.L."
                    },
                    {
                        "name": "Reggio A."
                    },
                    {
                        "name": "Rosina M."
                    },
                    {
                        "name": "Sacco F."
                    },
                    {
                        "name": "Vumbaca S."
                    },
                    {
                        "name": "Zuccotti A."
                    },
                    {
                        "name": "Castagnoli L."
                    },
                    {
                        "name": "Cesareni G."
                    }
                ],
                "citationCount": 2,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Frontiers in Physiology",
                "title": "Myo-REG: A portal for signaling interactions in muscle regeneration"
            },
            "pmcid": "PMC6776608",
            "pmid": "31611808"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ]
}