
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ibi.zju.edu.cn/"
        },
        {
            "email": "jian.yang@uq.edu.au",
            "name": "Jian Yang",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://ibi.zju.edu.cn/software/qtlnetwork/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/qtlnetwork-2-1-map-qtl-epistatic-qe-interaction-effects-experimental-populations.html"
        }
    ],
    "publication": [
        {
            "abstract": "Summary: Understanding how interactions among set of genes affect diverse phenotypes is having a greater impact on biomedical research, agriculture and evolutionary biology. Mapping and characterizing the isolated effects of single quantitative trait locus (QTL) is a first step, but we also need to assemble networks of QTLs and define non-additive interactions (epistasis) together with a host of potential environmental modulators. In this article, we present a full-QTL model with which to explore the genetic architecture of complex trait in multiple environments. Our model includes the effects of multiple QTLs, epistasis, QTL-by-environment interactions and epistasis-by-environment interactions. A new mapping strategy, including marker interval selection, detection of marker interval interactions and genome scans, is used to evaluate putative locations of multiple QTLs and their interactions. All the mapping procedures are performed in the framework of mixed linear model that are flexible to model environmental factors regardless of fix or random effects being assumed. An F-statistic based on Henderson method III is used for hypothesis tests. This method is less computationally greedy than corresponding likelihood ratio test. In each of the mapping procedures, permutation testing is exploited to control for genome-wide false positive rate, and model selection is used to reduce ghost peaks in F-statistic profile. Parameters of the full-QTL model are estimated using a Bayesian method via Gibbs sampling. Monte Carlo simulations help define the reliability and efficiency of the method. Two real-world phenotypes (BXD mouse olfactory bulb weight data and rice yield data) are used as exemplars to demonstrate our methods. © The Author 2007. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Yang J.",
                "Zhu J.",
                "Williams R.W."
            ],
            "cit_count": 221,
            "doi": "10.1093/bioinformatics/btm143",
            "journal": "Bioinformatics",
            "pmid": "17459962",
            "title": "Mapping the genetic architecture of complex traits in experimental populations",
            "type": "Primary",
            "year": "2007-06-15"
        },
        {
            "abstract": "QTLNetwork is a software package for mapping and visualizing the genetic architecture underlying complex traits for experimental populations derived from a cross between two inbred lines. It can simultaneously map quantitative trait loci (QTL) with individual effects, epistasis and QTL-environment interaction. Currently, it is able to handle data from F2, backcross, recombinant inbred lines and double-haploid populations, as well as populations from specific mating designs (immortalized F2 and BCnFn populations). The Windows version of QTLNetwork was developed with a graphical user interface. Alternatively, the command-line versions have the facility to be run in other prevalent operating systems, such as Linux, Unix and MacOS. © The Author 2008. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Yang J.",
                "Hu C.",
                "Hu H.",
                "Yu R.",
                "Xia Z.",
                "Ye X.",
                "Zhu J."
            ],
            "cit_count": 262,
            "doi": "10.1093/bioinformatics/btm494",
            "journal": "Bioinformatics",
            "title": "QTLNetwork: Mapping and visualizing genetic architecture of complex traits in experimental populations",
            "year": "2008-03-01"
        },
        {
            "abstract": "Methods were developed for predicting two kinds of superior genotypes (superior line and superior hybrid) based on quantative trait locus (QTL) effects including epistatic and QTL × environment interaction effects. Formulae were derived for predicting the total genetic effect of any individual with known QTLs genotype derived from the mapping population in a specific environment. Two algorithms, enumeration algorithm and stepwise tuning algorithm, were used to select the best multi-locus combination of all the putative QTLs. Grain weight per plant (GW) in rice was analyzed as a working example to demonstrate the proposed methods. Results showed that the predicted superior lines and superior hybrids had great superiorities over the F 1 hybrid, indicating large breeding potential remained for further improvement on GW. Results also showed that epistatic effects and their interaction with environments largely contributed to the superiorities of the predicted superior lines and superior hybrids. User-friendly software, QTLNetwork, version 1.0, was developed based on the methods in the present paper. © Springer-Verlag 2005.",
            "authors": [
                "Yang J.",
                "Zhu J."
            ],
            "cit_count": 93,
            "doi": "10.1007/s00122-005-1963-2",
            "journal": "Theoretical and Applied Genetics",
            "title": "Methods for predicting superior genotypes under multiple environments based on QTL effects",
            "year": "2005-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:qtlnetwork",
        "biotoolsID": "qtlnetwork",
        "description": "QTLNetwork is a software package for mapping and visualizing the genetic architecture underlying complex traits for experimental populations derived from a cross between two inbred lines.",
        "homepage": "http://ibi.zju.edu.cn/software/qtlnetwork/",
        "name": "QTLNETWORK",
        "version": [
            "2.1"
        ]
    }
}