{
    "accessibility": "Open access",
    "additionDate": "2022-06-13T09:40:37.882849Z",
    "biotoolsCURIE": "biotools:domarchive",
    "biotoolsID": "domarchive",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "estrauss@ab.mpg.de",
            "name": "Eli D. Strauss",
            "orcidid": "https://orcid.org/0000-0003-3413-1642",
            "typeEntity": "Person"
        }
    ],
    "description": "DomArchive is a data package compiling dominance interaction data published over a century of research. The goal of the package is to facilitate comparative research on the structure and function of dominance hierarchies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DomArchive/DomArchive",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-13T09:40:37.885427Z",
    "license": "Not licensed",
    "name": "DomArchive",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1098/RSTB.2020.0436",
            "metadata": {
                "abstract": "Dominance behaviours have been collected for many groups of animals since 1922 and serve as a foundation for research on social behaviour and social structure. Despite a wealth of data from the last century of research on dominance hierarchies, these data are only rarely used for comparative insight. Here, we aim to facilitate comparative studies of the structure and function of dominance hierarchies by compiling published dominance interaction datasets from the last 100 years of work. This compiled archive includes 436 datasets from 190 studies of 367 unique groups (mean group size 13.8, s.d. = 13.4) of 135 different species, totalling over 243 000 interactions. These data are presented in an R package alongside relevant metadata and a tool for subsetting the archive based on biological or methodological criteria. In this paper, we explain how to use the archive, discuss potential limitations of the data, and reflect on best practices in publishing dominance data based on our experience in assembling this dataset. This archive will serve as an important resource for future comparative studies and will promote the development of general unifying theories of dominance in behavioural ecology that can be grounded in testing with empirical data. This article is part of the theme issue 'The centennial of the pecking order: current state and future prospects for the study of dominance hierarchies'.",
                "authors": [
                    {
                        "name": "Curley J.P."
                    },
                    {
                        "name": "DeCasien A.R."
                    },
                    {
                        "name": "Galindo G."
                    },
                    {
                        "name": "Hobson E.A."
                    },
                    {
                        "name": "Shizuka D."
                    },
                    {
                        "name": "Strauss E.D."
                    }
                ],
                "date": "2022-02-28T00:00:00Z",
                "journal": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences",
                "title": "DomArchive: a century of published dominance data"
            },
            "pmcid": "PMC8743893",
            "pmid": "35000444"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
