{
    "additionDate": "2018-10-20T15:03:06Z",
    "biotoolsCURIE": "biotools:fretbursts",
    "biotoolsID": "fretbursts",
    "credit": [
        {
            "email": "ingargiola.antonino@gmail.com",
            "name": "Antonino Ingargiola",
            "orcidid": "http://orcid.org/0000-0002-9348-1397",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FRETBursts is an open source software for analysis of freely-diffusing single-molecule Förster Resonance Energy Transfer (smFRET) data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://fretbursts.readthedocs.io/en/latest/reference_manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://tritemio.github.io/FRETBursts/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-01-13T17:15:43Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/OpenSMFS/FRETBursts/issues"
        }
    ],
    "name": "FRETBursts",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0160716",
            "metadata": {
                "abstract": "© 2016 Ingargiola et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Single-molecule Förster Resonance Energy Transfer (smFRET) allows probing intermolecular interactions and conformational changes in biomacromolecules, and represents an invaluable tool for studying cellular processes at the molecular scale. smFRET experiments can detect the distance between two fluorescent labels (donor and acceptor) in the 3-10 nm range. In the commonly employed confocal geometry, molecules are free to diffuse in solution. When a molecule traverses the excitation volume, it emits a burst of photons, which can be detected by single-photon avalanche diode (SPAD) detectors. The intensities of donor and acceptor fluorescence can then be related to the distance between the two fluorophores. While recent years have seen a growing number of contributions proposing improvements or new techniques in smFRET data analysis, rarely have those publications been accompanied by software implementation. In particular, despite the widespread application of smFRET, no complete software package for smFRET burst analysis is freely available to date. In this paper, we introduce FRETBursts, an open source software for analysis of freely-diffusing smFRET data. FRETBursts allows executing all the fundamental steps of smFRET bursts analysis using state-of-the-art as well as novel techniques, while providing an open, robust and well-documented implementation. Therefore, FRETBursts represents an ideal platform for comparison and development of new methods in burst analysis. We employ modern software engineering principles in order to minimize bugs and facilitate long-term maintainability. Furthermore, we place a strong focus on reproducibility by relying on Jupyter notebooks for FRETBursts execution. Notebooks are executable documents capturing all the steps of the analysis (including data files, input parameters, and results) and can be easily shared to replicate complete smFRET analyzes. Notebooks allow beginners to execute complex workflows and advanced users to customize the analysis for their own needs. By bundling analysis description, code and results in a single document, FRET-Bursts allows to seamless share analysis workflows and results, encourages reproducibility and facilitates collaboration among researchers in the single-molecule community.",
                "authors": [
                    {
                        "name": "Ingargiola A."
                    },
                    {
                        "name": "Lerner E."
                    },
                    {
                        "name": "Chung S."
                    },
                    {
                        "name": "Weiss S."
                    },
                    {
                        "name": "Michalet X."
                    }
                ],
                "citationCount": 23,
                "date": "2016-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FRETBursts: An open source toolkit for analysis of freely-diffusing Single-molecule FRET"
            },
            "pmcid": "PMC4988647",
            "pmid": "27532626",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}