{
    "accessibility": "Open access",
    "additionDate": "2022-03-13T12:08:44.636942Z",
    "biotoolsCURIE": "biotools:stable-abppred",
    "biotoolsID": "stable-abppred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sameer.shrivastava@icar.gov.in",
            "name": "Sameer Shrivastava",
            "typeEntity": "Person"
        },
        {
            "email": "sks.cse@iitbhu.ac.in",
            "name": "Sanjay Kumar Singh",
            "typeEntity": "Person"
        },
        {
            "name": "Abhinav Kumar"
        },
        {
            "name": "Sonal Saxena"
        },
        {
            "name": "Vishakha Singh"
        }
    ],
    "description": "A stacked ensemble predictor based on biLSTM and attention mechanism for accelerated discovery of antibacterial peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein hydrophobic moment plotting",
                    "uri": "http://edamontology.org/operation_0407"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://stable-abppred.anvil.app",
    "lastUpdate": "2022-03-13T12:08:44.639682Z",
    "name": "StaBle-ABPpred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB439",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Due to the rapid emergence of multi-drug resistant (MDR) bacteria, existing antibiotics are becoming ineffective. So, researchers are looking for alternatives in the form of antibacterial peptides (ABPs) based medicines. The discovery of novel ABPs using wet-lab experiments is time-consuming and expensive. Many machine learning models have been proposed to search for new ABPs, but there is still scope to develop a robust model that has high accuracy and precision. In this work, we present StaBle-ABPpred, a stacked ensemble technique-based deep learning classifier that uses bidirectional long-short term memory (biLSTM) and attention mechanism at base-level and an ensemble of random forest, gradient boosting and logistic regression at meta-level to classify peptides as antibacterial or otherwise. The performance of our model has been compared with several state-of-the-art classifiers, and results were subjected to analysis of variance (ANOVA) test and its post hoc analysis, which proves that our model performs better than existing classifiers. Furthermore, a web app has been developed and deployed at https://stable-abppred.anvil.app to identify novel ABPs in protein sequences. Using this app, we identified novel ABPs in all the proteins of the Streptococcus phage T12 genome. These ABPs have shown amino acid similarities with experimentally tested antimicrobial peptides (AMPs) of other organisms. Hence, they could be chemically synthesized and experimentally validated for their activity against different bacteria. The model and app developed in this work can be further utilized to explore the protein diversity for identifying novel ABPs with broad-spectrum activity, especially against MDR bacterial pathogens.",
                "authors": [
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Kumar Singh S."
                    },
                    {
                        "name": "Saxena S."
                    },
                    {
                        "name": "Shrivastava S."
                    },
                    {
                        "name": "Singh V."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-17T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "StaBle-ABPpred: a stacked ensemble predictor based on biLSTM and attention mechanism for accelerated discovery of antibacterial peptides"
            },
            "pmid": "34750606"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
