{
    "accessibility": "Open access",
    "additionDate": "2022-04-19T22:36:44.693607Z",
    "biotoolsCURIE": "biotools:moai",
    "biotoolsID": "moai",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kan890043@gmail.com",
            "name": "Jung-Yu Kan"
        },
        {
            "name": "Chih-Po Chiang"
        },
        {
            "name": "Sin-Hua Moi"
        },
        {
            "name": "Yi-Chen Lee"
        },
        {
            "name": "Yu-Da Lin",
            "orcidid": "https://orcid.org/0000-0001-5100-6072"
        }
    ],
    "description": "A multi-outcome interaction identification approach",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://drive.google.com/file/d/1mBn3qK04Cr7Ds37FvjOcReTg_EWf8ggM/view"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/view/moaitool/home",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-04-19T22:36:44.696132Z",
    "license": "Not licensed",
    "name": "MOAI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB427",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Identifying and characterizing the interaction between risk factors for multiple outcomes (multi-outcome interaction) has been one of the greatest challenges faced by complex multifactorial diseases. However, the existing approaches have several limitations in identifying the multi-outcome interaction. To address this issue, we proposed a multi-outcome interaction identification approach called MOAI. MOAI was motivated by the limitations of estimating the interaction simultaneously occurring in multi-outcomes and by the success of Pareto set filter operator for identifying multi-outcome interaction. MOAI permits the identification for the interaction of multiple outcomes and is applicable in population-based study designs. Our experimental results exhibited that the existing approaches are not effectively used to identify the multi-outcome interaction, whereas MOAI obviously exhibited superior performance in identifying multi-outcome interaction. We applied MOAI to identify the interaction between risk factors for colorectal cancer (CRC) in both metastases and mortality prognostic outcomes. An interaction between vaspin and carcinoembryonic antigen (CEA) was found, and the interaction indicated that patients with CRC characterized by higher vaspin (≥30%) and CEA (≥5) levels could simultaneously increase both metastases and mortality risk. The immunostaining evidence revealed that determined multi-outcome interaction could effectively identify the difference between non-metastases/survived and metastases/deceased patients, which offers multi-prognostic outcome risk estimation for CRC. To our knowledge, this is the first report of a multi-outcome interaction associated with a complex multifactorial disease. MOAI is freely available at https://sites.google.com/view/moaitool/home.",
                "authors": [
                    {
                        "name": "Chiang C.-P."
                    },
                    {
                        "name": "Kan J.-Y."
                    },
                    {
                        "name": "Lee Y.-C."
                    },
                    {
                        "name": "Lin Y.-D."
                    },
                    {
                        "name": "Moi S.-H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MOAI: A multi-outcome interaction identification approach reveals an interaction between vaspin and carcinoembryonic antigen on colorectal cancer prognosis"
            },
            "pmid": "34661627"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
