{
    "additionDate": "2017-08-03T18:45:18Z",
    "biotoolsCURIE": "biotools:genetree",
    "biotoolsID": "genetree",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stats.ox.ac.uk/~griff/"
        }
    ],
    "description": "Software for the estimation of mutation, migration and growth rates, and ancestral inference such as the time to the most recent common ancestor of a sample of DNA sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.stats.ox.ac.uk/~griff/software.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "http://www.stats.ox.ac.uk/~griff/software.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/genetree-9-0-software-ancestral-inference.html"
        }
    ],
    "name": "Genetree",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "This paper studies gene trees in subdivided populations which are constructed as perfect phylogenies from the pattern of mutations in a sample of DNA sequences and presents a new recursion for the probability distribution of such gene trees. The underlying evolutionary model is the coalescent process in a subdivided population. The infinitely-many-sites model of mutation is assumed. Ancestral inference questions that are discussed are maximum likelihood estimation of migration and mutation rates; detection of population growth by likelihood techniques; determining the distribution of the time to the most recent common ancestor of a sample of sequences; determining the distribution of the age of the mutations on the gene tree; determining in which subpopulation the most recent common ancestor of all the sequences was; determining subpopulation ancestors, where they were, and times to them; and determining in which subpopulations mutations occurred. A computational technique of Griffiths and Tavare used is a computer intensive Markov chain simulation, which simulates gene trees conditional on their topology implied by the mutation pattern in the sample of DNA sequences. The software GENETREE, which implements these ancestral inference techniques, is available. (C) 2000 Academic Press.",
                "authors": [
                    {
                        "name": "Bahlo M."
                    },
                    {
                        "name": "Griffiths R.C."
                    }
                ],
                "citationCount": 142,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Theoretical Population Biology",
                "title": "Inference from gene trees in a subdivided population"
            },
            "pmid": "10792974"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}