{
    "additionDate": "2017-01-17T14:57:09Z",
    "biotoolsCURIE": "biotools:swathxtend",
    "biotoolsID": "swathxtend",
    "collectionID": [
        "Proteomics",
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jwu@proteome.org.au",
            "name": "Jemma Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It contains utility functions for integrating spectral libraries for SWATH and statistical data analysis for SWATH generated data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/SwathXtend.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/SwathXtend_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/SwathXtend.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-03-26T08:40:21Z",
    "license": "GPL-2.0",
    "name": "SwathXtend",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1074/mcp.M115.055558",
            "metadata": {
                "abstract": "© 2016 by The American Society for Biochemistry and Molecular Biology, Inc.The use of data-independent acquisition methods such as SWATH for mass spectrometry based proteomics is usually performed with peptide MS/MS assay libraries which enable identification and quantitation of peptide peak areas. Reference assay libraries can be generated locally through information dependent acquisition, or obtained from community data repositories for commonly studied organisms. However, there have been no studies performed to systematically evaluate how locally generated or repository-based assay libraries affect SWATH performance for proteomic studies. To undertake this analysis, we developed a software workflow, SwathXtend, which generates extended peptide assay libraries by integration with a local seed library and delivers statistical analysis of SWATH-quantitative comparisons. We designed test samples using peptides from a yeast extract spiked into peptides from human K562 cell lysates at three different ratios to simulate protein abundance change comparisons. SWATH-MS performance was assessed using local and external assay libraries of varying complexities and proteome compositions. These experiments demonstrated that local seed libraries integrated with external assay libraries achieve better performance than local assay libraries alone, in terms of the number of identified peptides and proteins and the specificity to detect differentially abundant proteins. Our findings show that the performance of extended assay libraries is influenced by the MS/MS feature similarity of the seed and external libraries, while statistical analysis using multiple testing corrections increases the statistical rigor needed when searching against large extended assay libraries.",
                "authors": [
                    {
                        "name": "Wu J.X."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Pascovici D."
                    },
                    {
                        "name": "Zaw T."
                    },
                    {
                        "name": "Care N."
                    },
                    {
                        "name": "Krisp C."
                    },
                    {
                        "name": "Molloy M.P."
                    }
                ],
                "citationCount": 64,
                "date": "2016-07-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "SWATH mass spectrometry performance using extended peptide MS/MS assay libraries"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.0"
    ]
}