{
    "additionDate": "2024-02-09T10:33:34.133059Z",
    "biotoolsCURIE": "biotools:semtree",
    "biotoolsID": "semtree",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "barbara.tarantino@unipv.it",
            "name": "Barbara Tarantino",
            "orcidid": "https://orcid.org/0000-0001-6384-2561",
            "typeEntity": "Person"
        }
    ],
    "description": "Tree-based structure learning methods with structural equation models.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/fernandoPalluzzi/SEMgraph/tree/master/SEMtree"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://rdrr.io/cran/SEMgraph/man/SEMtree.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:17:00.643035Z",
    "name": "SEMtree",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad377",
            "metadata": {
                "abstract": "Motivation: With the exponential growth of expression and protein-protein interaction (PPI) data, the identification of functional modules in PPI networks that show striking changes in molecular activity or phenotypic signatures becomes of particular interest to reveal process-specific information that is correlated with cellular or disease states. This requires both the identification of network nodes with reliability scores and the availability of an efficient technique to locate the network regions with the highest scores. In the literature, a number of heuristic methods have been suggested. We propose SEMtree(), a set of tree-based structure discovery algorithms, combining graph and statistically interpretable parameters together with a user-friendly R package based on structural equation models framework. Results: Condition-specific changes from differential expression and gene-gene co-expression are recovered with statistical testing of node, directed edge, and directed path difference between groups. In the end, from a list of seed (i.e. disease) genes or gene P-values, the perturbed modules with undirected edges are generated with five state-of-the-art active subnetwork detection methods. The latter are supplied to causal additive trees based on Chu-Liu-Edmonds' algorithm (Chow and Liu, Approximating discrete probability distributions with dependence trees. IEEE Trans Inform Theory 1968;14:462-7) in SEMtree() to be converted in directed trees. This conversion allows to compare the methods in terms of directed active subnetworks. We applied SEMtree() to both Coronavirus disease (COVID-19) RNA-seq dataset (GEO accession: GSE172114) and simulated datasets with various differential expression patterns. Compared to existing methods, SEMtree() is able to capture biologically relevant subnetworks with simple visualization of directed paths, good perturbation extraction, and classifier performance.",
                "authors": [
                    {
                        "name": "Grassi M."
                    },
                    {
                        "name": "Tarantino B."
                    }
                ],
                "citationCount": 3,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SEMtree: tree-based structure learning methods with structural equation models"
            },
            "pmcid": "PMC10287946",
            "pmid": "37294820"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
