{
    "additionDate": "2020-01-14T19:28:40Z",
    "biotoolsCURIE": "biotools:FIREVAT",
    "biotoolsID": "FIREVAT",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "dwhong@ncc.re.kr",
            "name": "Dongwan Hong",
            "orcidid": "https://orcid.org/0000-0002-7816-1299",
            "typeEntity": "Person"
        }
    ],
    "description": "finding reliable variants without artifacts in human cancer samples using etiologically relevant mutational signatures.\n\nFInding REliable Variants without ArTifacts.\n\nFIREVAT (FInding REliable Variants without ArTifacts) is an R package that performs variant refinement on cancer sequencing data. FIREVAT uses mutational signatures to identify sequencing artifacts and low-quality variants",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cgab-ncc/FIREVAT",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T19:28:40Z",
    "license": "MIT",
    "name": "FIREVAT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-019-0695-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Accurate identification of real somatic variants is a primary part of cancer genome studies and precision oncology. However, artifacts introduced in various steps of sequencing obfuscate confidence in variant calling. Current computational approaches to variant filtering involve intensive interrogation of Binary Alignment Map (BAM) files and require massive computing power, data storage, and manual labor. Recently, mutational signatures associated with sequencing artifacts have been extracted by the Pan-cancer Analysis of Whole Genomes (PCAWG) study. These spectrums can be used to evaluate refinement quality of a given set of somatic mutations. Results: Here we introduce a novel variant refinement software, FIREVAT (FInding REliable Variants without ArTifacts), which uses known spectrums of sequencing artifacts extracted from one of the largest publicly available catalogs of human tumor samples. FIREVAT performs a quick and efficient variant refinement that accurately removes artifacts and greatly improves the precision and specificity of somatic calls. We validated FIREVAT refinement performance using orthogonal sequencing datasets totaling 384 tumor samples with respect to ground truth. Our novel method achieved the highest level of performance compared to existing filtering approaches. Application of FIREVAT on additional 308 The Cancer Genome Atlas (TCGA) samples demonstrated that FIREVAT refinement leads to identification of more biologically and clinically relevant mutational signatures as well as enrichment of sequence contexts associated with experimental errors. FIREVAT only requires a Variant Call Format file (VCF) and generates a comprehensive report of the variant refinement processes and outcomes for the user. Conclusions: In summary, FIREVAT facilitates a novel refinement strategy using mutational signatures to distinguish artifactual point mutations called in human cancer samples. We anticipate that FIREVAT results will further contribute to precision oncology efforts that rely on accurate identification of variants, especially in the context of analyzing mutational signatures that bear prognostic and therapeutic significance. FIREVAT is freely available at https://github.com/cgab-ncc/FIREVAT",
                "authors": [
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Lee A.J."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Chun H."
                    },
                    {
                        "name": "Ju Y.S."
                    },
                    {
                        "name": "Hong D."
                    }
                ],
                "date": "2019-12-17T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "FIREVAT: Finding reliable variants without artifacts in human cancer samples using etiologically relevant mutational signatures"
            },
            "pmcid": "PMC6916105",
            "pmid": "31847917"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}