{
    "additionDate": "2017-08-03T18:36:20Z",
    "biotoolsCURIE": "biotools:amphoravizu",
    "biotoolsID": "amphoravizu",
    "credit": [
        {
            "name": "PIT Bioinformatics Group",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://pitgroup.org/contact/"
        }
    ],
    "description": "Visualize outputs generated by the metagenomic and genomic analysis tool AMPHORA2 or its webserver implementation AmphoraNet.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://pitgroup.org/amphoravizu/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly visualisation",
                    "uri": "http://edamontology.org/operation_3184"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://pitgroup.org/amphoravizu/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/amphoravizu-chart-visualization-for-metagenomic-and-genomic-analysis-tools-amphora2-and-amphoranet.html"
        }
    ],
    "name": "AmphoraVizu",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014, Springer Science+Business Media New York.Low-cost DNA sequencing methods have given rise to an enormous development of metagenomics in the past few years. One basic— and difficult—task is the phylogenetic annotation of the metagenomic samples studied. The difficulty comes from the fact that the typical environmental sample contains hundreds of unknown and still uncharacterized microorganisms. There are several possible methods to assign at least partial phylogenetic information to these uncharacterized data. Originally, the 16S ribosomal RNA was used as phylogenetic marker, then genome sequence alignments and similarity measures between the unknown genome and the reference genomes were applied (e.g., in the MEGAN software), and more recently, phylogeny–based methods applying suitable sets of marker genes were suggested (AMPHORA, AMPHORA2, and the webserver implementation AmphoraNet). Here, we present a visual analysis tool that is capable of demonstrating the quantitative relations gained from the output of the AMPHORA2 program or the easy–to–use AmphoraNet webserver. Our web-based tool, the AmphoraVizu webserver, makes the phylogenetic distribution of the metagenomic sample clearly visible by using the native output format of AMPHORA2 or AmphoraNet. The user may set the phylogenetic resolution (i.e., superkingdom, phylum, class, order, family, genus, and species) along with the chart type and will receive the distribution data detailed for all relevant marker genes in the sample. For publication quality results, the chart labels can be customized by the user. The visualization webserver is available at the address http://amphoravizu.pitgroup.org. The AmphoraNet webserver is available at http://amphoranet.pitgroup.org. The open-source version of the AmphoraVizu program is available for download at http://pitgroup.org/apps/amphoravizu/AmphoraVizu.pl.",
                "authors": [
                    {
                        "name": "Kerepesi C."
                    },
                    {
                        "name": "Szalkai B."
                    },
                    {
                        "name": "Grolmusz V."
                    }
                ],
                "citationCount": 3,
                "date": "2015-04-01T00:00:00Z",
                "journal": "Microbial Ecology",
                "title": "Visual Analysis of the Quantitative Composition of Metagenomic Communities: the AmphoraVizu Webserver"
            },
            "pmid": "25296554"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ],
    "validated": 1
}