{
    "additionDate": "2019-11-14T18:19:36Z",
    "biotoolsCURIE": "biotools:QresFEP",
    "biotoolsID": "QresFEP",
    "confidence_flag": "tool",
    "description": "> HOMEPAGE MISSING! | An Automated Protocol for Free Energy Calculations of Protein Mutations in Q | Predicting the effect of single-point mutations on protein stability or protein-ligand binding is a major challenge in computational biology. Free energy calculations constitute the most rigorous approach to this problem, though the estimation of converged values for amino acid mutations remains challenging. To overcome this limitation, we developed tailored protocols to calculate free energy shifts associated with single-point mutations. We herein describe the QresFEP protocol, which includes an extension of our recent protocols to cover all amino acids mutations, based on the latest versions of the OPLS-AA force field. QresFEP is implemented in an application programming interface framework and the graphic interface QGui, for the molecular dynamics software Q",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qusers",
    "lastUpdate": "2020-12-11T14:38:43Z",
    "name": "QresFEP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.9B00538",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Predicting the effect of single-point mutations on protein stability or protein-ligand binding is a major challenge in computational biology. Free energy calculations constitute the most rigorous approach to this problem, though the estimation of converged values for amino acid mutations remains challenging. To overcome this limitation, we developed tailored protocols to calculate free energy shifts associated with single-point mutations. We herein describe the QresFEP protocol, which includes an extension of our recent protocols to cover all amino acids mutations, based on the latest versions of the OPLS-AA force field. QresFEP is implemented in an application programming interface framework and the graphic interface QGui, for the molecular dynamics software Q. The complete protocol is benchmarked in several model systems, optimizing a number of sampling parameters and the implementation of Zwanzig's exponential formula and Bennet's acceptance ratio methods. QresFEP shows an excellent performance on estimating the hydration free energies of amino acid side-chain mimics, including their charged analogues. We also examined its performance on a protein-ligand binding problem of pharmaceutical relevance, the antagonism of neuropeptide Y1 G protein-coupled receptor. Here, the calculations show very good agreement with the experimental effect of 16 mutations on the binding of antagonists BIBP3226, in line with our recent applications in this field. Finally, the characterization of 43 mutations of T4-lysozyme reveals the capacity of our protocol to assess variations of the thermal stability of proteins, achieving a similar performance to alternative free energy perturbation (FEP) approaches. In summary, QresFEP is a robust, versatile, and user-friendly computational FEP protocol to examine biochemical effects of single-point mutations with high accuracy.",
                "authors": [
                    {
                        "name": "Andberg T.A.H."
                    },
                    {
                        "name": "Aqvist J."
                    },
                    {
                        "name": "Brandsdal B.O."
                    },
                    {
                        "name": "Gutierrez-De-Teran H."
                    },
                    {
                        "name": "Isaksen G.V."
                    },
                    {
                        "name": "Jespers W."
                    },
                    {
                        "name": "Van Veen A."
                    },
                    {
                        "name": "Vasile S."
                    }
                ],
                "citationCount": 11,
                "date": "2019-10-08T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "QresFEP: An Automated Protocol for Free Energy Calculations of Protein Mutations in Q"
            },
            "pmid": "31436990"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
