{
    "accessibility": "Open access",
    "additionDate": "2024-03-27T20:40:19.258591Z",
    "biotoolsCURIE": "biotools:msphep",
    "biotoolsID": "msphep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lianlichi@sdu.edu.cn",
            "name": "Lianli Chi",
            "typeEntity": "Person"
        },
        {
            "name": "Changkai Bu",
            "typeEntity": "Person"
        },
        {
            "name": "John LaCava",
            "typeEntity": "Person"
        },
        {
            "name": "Shaoshuai Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "Online application for low molecular weight heparin rapid characterization based on liquid chromatography-tandem mass spectrometry.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://ngrc-glycan.shinyapps.io/MsPHep",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-03-27T20:40:19.261177Z",
    "name": "MsPHep",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CHROMA.2023.464179",
            "metadata": {
                "abstract": "Low-molecular-weight heparins (LMWHs) are important anticoagulants widely used in clinic. Since they are comprised of complex and heterogenous glycan chains, liquid chromatography-tandem mass spectrometry (LC-MS) is commonly used for structural analysis and quality control of LMWHs to ensure their safety and efficacy. Yet, the structural complexity arising from the parent heparin macromolecules, as well as the different depolymerization methods used for preparing LMWHs, makes processing and assigning the LC-MS data of LWMHs very tedious and challenging. We therefore developed, and here report, an open-source and easy-to-use web application, MsPHep, to facilitate the LMWH analysis based on LC-MS data. MsPHep is compatible with various LMWHs and chromatographic separation methods. With the HepQual function, MsPHep is capable of annotating both the LMWH compound and its isotopic distribution from mass spectra. Moreover, the HepQuant function enables automatic quantification of LMWH compositions without prior knowledge or any database generation. To demonstrate the reliability and system stability of MsPHep, we tested various types of LMWHs that were analyzed with different chromatographic methods coupled to MS. The results show that MsPHep has its own advantages compared to another public tool GlycReSoft for LMWH analysis, and it is available online under an open-source license at https://ngrc-glycan.shinyapps.io/MsPHep.",
                "authors": [
                    {
                        "name": "Bu C."
                    },
                    {
                        "name": "Chi L."
                    },
                    {
                        "name": "LaCava J."
                    },
                    {
                        "name": "Xie S."
                    }
                ],
                "date": "2023-08-30T00:00:00Z",
                "journal": "Journal of Chromatography A",
                "title": "MsPHep: An online application for low molecular weight heparin rapid characterization based on liquid chromatography-tandem mass spectrometry"
            },
            "pmid": "37419018"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
