{
    "additionDate": "2017-08-03T18:50:58Z",
    "biotoolsCURIE": "biotools:mettailor",
    "biotoolsID": "mettailor",
    "credit": [
        {
            "email": "hyung_won_choi@nuhs.edu.sg",
            "name": "Choi H",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/mettailor/"
        }
    ],
    "description": "Software package that performs post-extraction processing steps such as cross-sample realignment and data normalization that are specifically designed to account for the experimental factors from chromatographic separation and MS analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/mettailor/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/mettailor/",
    "lastUpdate": "2019-06-27T09:00:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mettailor-dynamic-block-summary-and-data-normalization-for-robust-analysis.html"
        }
    ],
    "name": "MetTailor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Accurate cross-sample peak alignment and reliable intensity normalization is a critical step for robust quantitative analysis in untargetted metabolomics since tandem mass spectrometry (MS/MS) is rarely used for compound identification. Therefore shortcomings in the data processing steps can easily introduce false positives due to misalignments and erroneous normalization adjustments in large sample studies. Results: In this work, we developed a software package MetTailor featuring two novel data preprocessing steps to remedy drawbacks in the existing processing tools. First, we propose a novel dynamic block summarization (DBS) method for correcting misalignments from peak alignment algorithms, which alleviates missing data problem due to misalignments. For the purpose of verifying correct re-alignments, we propose to use the cross-sample consistency in isotopic intensity ratios as a quality metric. Second, we developed a flexible intensity normalization procedure that adjusts normalizing factors against the temporal variations in total ion chromatogram (TIC) along the chromatographic retention time (RT). We first evaluated the DBS algorithm using a curated metabolomics dataset, illustrating that the algorithm identifies misaligned peaks and correctly realigns them with good sensitivity. We next demonstrated the DBS algorithm and the RT-based normalization procedure in a large-scale dataset featuring >100 sera samples in primary Dengue infection study. Although the initial alignment was successful for the majority of peaks, the DBS algorithm still corrected ∼7000 misaligned peaks in this data and many recovered peaks showed consistent isotopic patterns with the peaks they were realigned to. In addition, the RT-based normalization algorithm efficiently removed visible local variations in TIC along the RT, without sacrificing the sensitivity of detecting differentially expressed metabolites. Availability and implementation: The R package MetTailor is freely available at the SourceForge website http://mettailor.sourceforge.net/.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Choi H."
                    },
                    {
                        "name": "Cui L."
                    },
                    {
                        "name": "Ong C.N."
                    },
                    {
                        "name": "Tan C.S."
                    },
                    {
                        "name": "Teo G.S."
                    }
                ],
                "citationCount": 3,
                "date": "2015-05-25T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MetTailor: Dynamic block summary and intensity normalization for robust analysis of mass spectrometry data in metabolomics"
            },
            "pmid": "26220962"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
