{
    "accessibility": "Open access",
    "additionDate": "2022-04-10T11:02:15.190960Z",
    "biotoolsCURIE": "biotools:nucposdb",
    "biotoolsID": "nucposdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vteif@essex.ac.uk",
            "name": "Vladimir B. Teif",
            "typeEntity": "Person"
        },
        {
            "name": "Divya R. Jacob"
        },
        {
            "name": "Kristan V. Piroeva"
        },
        {
            "name": "Mariya Shtumpf"
        },
        {
            "name": "Shivam P. Agrawal"
        }
    ],
    "description": "A database of nucleosome positioning in vivo and nucleosomics of cell-free DNA.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Nucleosome position prediction",
                    "uri": "http://edamontology.org/operation_0432"
                }
            ]
        }
    ],
    "homepage": "https://generegulation.org/nucposdb/",
    "lastUpdate": "2022-04-10T11:02:15.193590Z",
    "name": "NucPosDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/s00412-021-00766-9",
            "metadata": {
                "abstract": "© 2022, The Author(s).Nucleosome positioning is involved in many gene regulatory processes happening in the cell, and it may change as cells differentiate or respond to the changing microenvironment in a healthy or diseased organism. One important implication of nucleosome positioning in clinical epigenetics is its use in the “nucleosomics” analysis of cell-free DNA (cfDNA) for the purpose of patient diagnostics in liquid biopsies. The rationale for this is that the apoptotic nucleases that digest chromatin of the dying cells mostly cut DNA between nucleosomes. Thus, the short pieces of DNA in body fluids reflect the positions of nucleosomes in the cells of origin. Here, we report a systematic nucleosomics database — NucPosDB — curating published nucleosome positioning datasets in vivo as well as datasets of sequenced cell-free DNA (cfDNA) that reflect nucleosome positioning in situ in the cells of origin. Users can select subsets of the database by a number of criteria and then obtain raw or processed data. NucPosDB also reports the originally determined regions with stable nucleosome occupancy across several individuals with a given condition. An additional section provides a catalogue of computational tools for the analysis of nucleosome positioning or cfDNA experiments and theoretical algorithms for the prediction of nucleosome positioning preferences from DNA sequence. We provide an overview of the field, describe the structure of the database in this context, and demonstrate data variability using examples of different medical conditions. NucPosDB is useful both for the analysis of fundamental gene regulation processes and the training of computational models for patient diagnostics based on cfDNA. The database currently curates ~ 400 publications on nucleosome positioning in cell lines and in situ as well as cfDNA from > 10,000 patients and healthy volunteers. For open-access cfDNA datasets as well as key MNase-seq datasets in human cells, NucPosDB allows downloading processed mapped data in addition to the regions with stable nucleosome occupancy. NucPosDB is available at https://generegulation.org/nucposdb/.",
                "authors": [
                    {
                        "name": "Agrawal S.P."
                    },
                    {
                        "name": "Jacob D.R."
                    },
                    {
                        "name": "Piroeva K.V."
                    },
                    {
                        "name": "Shtumpf M."
                    },
                    {
                        "name": "Teif V.B."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Chromosoma",
                "title": "NucPosDB: a database of nucleosome positioning in vivo and nucleosomics of cell-free DNA"
            },
            "pmcid": "PMC8776978",
            "pmid": "35061087"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA packaging",
            "uri": "http://edamontology.org/topic_3176"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}
