{
    "accessibility": "Open access",
    "additionDate": "2019-05-29T08:19:11Z",
    "biotoolsCURIE": "biotools:DOVE",
    "biotoolsID": "DOVE",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mitchalexbailey@gmail.com",
            "name": "Mitch Bailey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DMD Open-access Variant Explorer (DOVE) - web-based aid for DMD variant interpretation which additionally reports variant-specific predicted molecular eligibility for therapy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/mitchalexbailey/dmd-interpreter/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                }
            ]
        }
    ],
    "homepage": "http://www.dmd.nl/DOVE",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "DOVE",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1002/mgg3.510",
            "metadata": {
                "abstract": "© 2018 BioMarin Pharmaceutical Inc. Molecular Genetics & Genomic Medicine published by Wiley Periodicals, Inc.Background: Duchenne muscular dystrophy (Duchenne) is caused by pathogenic variants in the DMD gene. Antisense oligonucleotides (AONs) are one emerging precision medicine treatment for Duchenne. DMD molecular genetic testing results guide precision-therapy molecular eligibility, requiring healthcare providers to perform analyses currently uncommon in clinical laboratory and medical practices. Clear DMD variant notation and interpretation are key components of clinical care with the availability of precision medicine. Methods: The DMD Open-access Variant Explorer (DOVE) is a web-based aid for DMD variant interpretation which additionally reports variant-specific predicted molecular eligibility for therapy. DOVE was developed in Python and adapted to the Django Web framework, integrates existing open-access tools, and does not rely on previous variant report/classification. Results: DOVE [www.dmd.nl/DOVE] interprets colloquial and HGMD inputs of DMD variants to output HGMD variant nomenclature, theoretical molecular eligibility for therapy, and any predicted deleterious molecular consequences of therapy. DOVE relies on holistic in silico prediction of molecular eligibility for therapy in lieu of reference to an empirically defined, “variant-eligible” list. Examples illustrate the advantage and necessity for holistic variant interpretation. Conclusion: DOVE may prove useful for variant interpretation both at patient-level and in large-scale programs such as newborn screening and has broad application in concept to molecular genetic test result interpretation.",
                "authors": [
                    {
                        "name": "Bailey M."
                    },
                    {
                        "name": "Miller N."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomic Medicine",
                "title": "DMD Open-access Variant Explorer (DOVE): A scalable, open-access, web-based tool to aid in clinical interpretation of genetic variants in the DMD gene"
            },
            "pmcid": "PMC6382494",
            "pmid": "30450799",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Complementary medicine",
            "uri": "http://edamontology.org/topic_3423"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}