{
    "additionDate": "2018-07-28T08:48:03Z",
    "biotoolsCURIE": "biotools:clinical_ngs_db",
    "biotoolsID": "clinical_ngs_db",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://nishio470.wixsite.com/clinical-ngs-db/contact"
        }
    ],
    "description": "Tool for the Unified Management of Clinical Information and Genetic Variants to Accelerate Variant Pathogenicity Classification.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nishio470.wixsite.com/clinical-ngs-db/overview"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://nishio470.wixsite.com/clinical-ngs-db",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "Clinical NGS DB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1002/humu.23160",
            "metadata": {
                "abstract": "© 2016 The Authors. **Human Mutation published by Wiley Periodicals, Inc.Recent advances in next-generation sequencing (NGS) have given rise to new challenges due to the difficulties in variant pathogenicity interpretation and large dataset management, including many kinds of public population databases as well as public or commercial disease-specific databases. Here, we report a new database development tool, named the “Clinical NGS Database,” for improving clinical NGS workflow through the unified management of variant information and clinical information. This database software offers a two-feature approach to variant pathogenicity classification. The first of these approaches is a phenotype similarity-based approach. This database allows the easy comparison of the detailed phenotype of each patient with the average phenotype of the same gene mutation at the variant or gene level. It is also possible to browse patients with the same gene mutation quickly. The other approach is a statistical approach to variant pathogenicity classification based on the use of the odds ratio for comparisons between the case and the control for each inheritance mode (families with apparently autosomal dominant inheritance vs. control, and families with apparently autosomal recessive inheritance vs. control). A number of case studies are also presented to illustrate the utility of this database.",
                "authors": [
                    {
                        "name": "Nishio S.-Y."
                    },
                    {
                        "name": "Usami S.-I."
                    }
                ],
                "citationCount": 4,
                "date": "2017-03-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "The Clinical Next-Generation Sequencing Database: A Tool for the Unified Management of Clinical Information and Genetic Variants to Accelerate Variant Pathogenicity Classification"
            },
            "pmcid": "PMC5324660",
            "pmid": "28008688"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}