{
    "accessibility": "Open access",
    "additionDate": "2022-07-26T22:10:58.947471Z",
    "biotoolsCURIE": "biotools:mirkat-mc",
    "biotoolsID": "mirkat-mc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nzhao10@jhu.edu",
            "name": "Ni Zhao",
            "typeEntity": "Person"
        },
        {
            "email": "zhanx@bjmu.edu.cn",
            "name": "Xiang Zhan",
            "typeEntity": "Person"
        },
        {
            "name": "Jun Chen"
        },
        {
            "name": "Mengyu He"
        },
        {
            "name": "Zhiwen Jiang"
        }
    ],
    "description": "A Distance-Based Microbiome Kernel Association Test With Multi-Categorical Outcomes.MiRKAT-MC",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Zhiwen-Owen-Jiang/MiRKATMC",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-26T22:10:58.949909Z",
    "license": "GPL-3.0",
    "name": "MiRKAT-MC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.841764",
            "metadata": {
                "abstract": "Copyright © 2022 Jiang, He, Chen, Zhao and Zhan.Increasing evidence has elucidated that the microbiome plays a critical role in many human diseases. Apart from continuous and binary traits that measure the extent or presence of a disease, multi-categorical outcomes including variations/subtypes of a disease or ordinal levels of disease severity are commonly seen in clinical studies. On top of that, studies with clustered design (i.e., family-based and longitudinal studies) are popular alternatives to population-based ones as they are able to identify characteristics on both individual and population levels and to investigate the trajectory of traits of interest over time. However, existing methods for microbiome association analysis are inadequate to handle multi-categorical outcomes, neither independent nor clustered data. We propose a microbiome kernel association test with multi-categorical outcomes (MiRKAT-MC). Our method is versatile to deal with both nominal and ordinal outcomes for independent and clustered data. In addition, it incorporates multiple ecological distances to allow for different association patterns between outcomes and microbiome compositions to be incorporated. A computationally efficient pseudo-permutation strategy is used to evaluate the statistical significance. Comprehensive simulations show that MiRKAT-MC preserves the nominal type I error and increases statistical powers under various scenarios and data types. We also apply MiRKAT-MC to real data sets with nominal and ordinal outcomes to gain biological insights. MiRKAT-MC is easy to implement, and freely available via an R package at https://github.com/Zhiwen-Owen-Jiang/MiRKATMC with a Graphical User Interface through R Shinny also available.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "He M."
                    },
                    {
                        "name": "Jiang Z."
                    },
                    {
                        "name": "Zhan X."
                    },
                    {
                        "name": "Zhao N."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MiRKAT-MC: A Distance-Based Microbiome Kernel Association Test With Multi-Categorical Outcomes"
            },
            "pmcid": "PMC9010828",
            "pmid": "35432465"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
