{
    "additionDate": "2020-01-09T17:35:35Z",
    "biotoolsCURIE": "biotools:iATC-NRAKEL",
    "biotoolsID": "iATC-NRAKEL",
    "confidence_flag": "tool",
    "description": "An efficient multi-label classifier for recognizing anatomical therapeutic chemical (ATC) classes of drugs.\n\nRecognizing the Anatomical Therapeutic Chemical (ATC) classes of first level for given drugs.\n\nFunctions : Recognizing the Anatomical Therapeutic Chemical (ATC) classes of first level for given drugs.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/zhou256/iATC-NRAKEL",
    "language": [
        "MATLAB",
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-11T08:27:59Z",
    "license": "MIT",
    "name": "iATC-NRAKEL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ757",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: The anatomical therapeutic chemical (ATC) classification system plays an increasingly important role in drug repositioning and discovery. The correct identification of classes in each level of such system that a given drug may belong to is an essential problem. Several multi-label classifiers have been proposed in this regard. Although they provided satisfactory performance, the feature extraction procedures were still rough. More refined features may further improve the predicted quality. Results: In this article, we provide a novel multi-label classifier, called iATC-NRAKEL, to predict drug ATC classes in the first level. To obtain more informative drug features, we employed the drug association information in STITCH and KEGG, which was organized by seven drug networks. The powerful network embedding algorithm, Mashup, was adopted to extract informative drug features. The obtained features were fed into the RAndom k-labELsets (RAKEL) algorithm with support vector machine as the basic classification algorithm to construct the classifier. The 10-fold cross-validation of the benchmark dataset with 3883 drugs showed that the accuracy and absolute true were 76.56 and 74.51%, respectively. The comparison results indicated that iATC-NRAKEL was much superior to all previous reported classifiers. Finally, the contribution of each network was analyzed.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Guo Z.-H."
                    },
                    {
                        "name": "Zhou J.-P."
                    }
                ],
                "citationCount": 40,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IATC-NRAKEL: An efficient multi-label classifier for recognizing anatomical therapeutic chemical classes of drugs"
            },
            "pmid": "31593226"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
