{
    "accessibility": "Open access",
    "additionDate": "2022-01-04T11:27:44.822670Z",
    "biotoolsCURIE": "biotools:dqastats",
    "biotoolsID": "dqastats",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lorenz.kapsner@uk-erlangen.de",
            "name": "Lorenz A. Kapsner",
            "typeEntity": "Person"
        }
    ],
    "description": "The R package 'DQAstats' provides core functionalities to perform data quality assessment (DQA) of electronic health record data (EHR).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/miracum/dqa-dqastats",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-01-04T11:27:44.825960Z",
    "license": "GPL-3.0",
    "name": "DQAstats",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1055/S-0041-1733847",
            "metadata": {
                "abstract": "© 2021. Thieme. All rights reserved.Background Many research initiatives aim at using data from electronic health records (EHRs) in observational studies. Participating sites of the German Medical Informatics Initiative (MII) established data integration centers to integrate EHR data within research data repositories to support local and federated analyses. To address concerns regarding possible data quality (DQ) issues of hospital routine data compared with data specifically collected for scientific purposes, we have previously presented a data quality assessment (DQA) tool providing a standardized approach to assess DQ of the research data repositories at the MIRACUM consortium's partner sites. Objectives Major limitations of the former approach included manual interpretation of the results and hard coding of analyses, making their expansion to new data elements and databases time-consuming and error prone. We here present an enhanced version of the DQA tool by linking it to common data element definitions stored in a metadata repository (MDR), adopting the harmonized DQA framework from Kahn et al and its application within the MIRACUM consortium. Methods Data quality checks were consequently aligned to a harmonized DQA terminology. Database-specific information were systematically identified and represented in an MDR. Furthermore, a structured representation of logical relations between data elements was developed to model plausibility-statements in the MDR. Results The MIRACUM DQA tool was linked to data element definitions stored in a consortium-wide MDR. Additional databases used within MIRACUM were linked to the DQ checks by extending the respective data elements in the MDR with the required information. The evaluation of DQ checks was automated. An adaptable software implementation is provided with the R package DQAstats. Conclusion The enhancements of the DQA tool facilitate the future integration of new data elements and make the tool scalable to other databases and data models. It has been provided to all ten MIRACUM partners and was successfully deployed and integrated into their respective data integration center infrastructure.",
                "authors": [
                    {
                        "name": "Bathelt F."
                    },
                    {
                        "name": "Deppenwiese N."
                    },
                    {
                        "name": "Kadioglu D."
                    },
                    {
                        "name": "Kapsner L.A."
                    },
                    {
                        "name": "Kraska D."
                    },
                    {
                        "name": "Mang J.M."
                    },
                    {
                        "name": "Mate S."
                    },
                    {
                        "name": "Prokosch H.-U."
                    },
                    {
                        "name": "Seuchter S.A."
                    },
                    {
                        "name": "Vengadeswaran A."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Applied Clinical Informatics",
                "title": "Linking a Consortium-Wide Data Quality Assessment Tool with the MIRACUM Metadata Repository"
            },
            "pmcid": "PMC8387126",
            "pmid": "34433217"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
