{
    "additionDate": "2015-01-22T11:40:38Z",
    "biotoolsCURIE": "biotools:maxcounts",
    "biotoolsID": "maxcounts",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "francesca.finotello@dei.unipd.it",
            "name": "Francesca Finotello",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~finotell/"
        }
    ],
    "description": "Novel approach to estimate gene expression from RNA-seq data that reduces length bias. Once reads have been aligned to a reference genome or transcriptome, using any alignment tool, the expression of a genomic feature, such as a gene, transcript or exon, can be estimated as the maximum read coverage along its sequence. The method is available as a patch for bedtools.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sysbiobig.dei.unipd.it/?q=Software#MAXCOUNTS"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Maxcounts is a computational method to estimate expression levels from RNA-seq data.",
            "operation": [
                {
                    "term": "RNA-seq read count analysis",
                    "uri": "http://edamontology.org/operation_3563"
                }
            ]
        }
    ],
    "homepage": "http://sysbiobig.dei.unipd.it/?q=Software#MAXCOUNTS",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-2.0",
    "name": "Maxcounts",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-S1-S7",
            "metadata": {
                "abstract": "© 2014 Finotello et al.Background: In the last decade, Next-Generation Sequencing technologies have been extensively applied to quantitative transcriptomics, making RNA sequencing a valuable alternative to microarrays for measuring and comparing gene transcription levels. Although several methods have been proposed to provide an unbiased estimate of transcript abundances through data normalization, all of them are based on an initial count of the total number of reads mapping on each transcript. This procedure, in principle robust to random noise, is actually errorprone if reads are not uniformly distributed along sequences, as happens indeed due to sequencing errors and ambiguity in read mapping. Here we propose a new approach, called maxcounts, to quantify the expression assigned to an exon as the maximum of its per-base counts, and we assess its performance in comparison with the standard approach described above, which considers the total number of reads aligned to an exon. The two measures are compared using multiple data sets and considering several evaluation criteria: independence from gene-specific covariates, such as exon length and GC-content, accuracy and precision in the quantification of true concentrations and robustness of measurements to variations of alignments quality. Results: Both measures show high accuracy and low dependency on GC-content. However, maxcounts expression quantification is less biased towards long exons with respect to the standard approach. Moreover, it shows lower technical variability at low expressions and is more robust to variations in the quality of alignments. Conclusions: In summary, we confirm that counts computed with the standard approach depend on the length of the feature they are summarized on, and are sensitive to the non-uniform distribution of reads along transcripts. On the opposite, maxcounts are robust to biases due to the non-uniformity distribution of reads and are characterized by a lower technical variability. Hence, we propose maxcounts as an alternative approach for quantitative RNA-sequencing applications.",
                "authors": [
                    {
                        "name": "Finotello F."
                    },
                    {
                        "name": "Lavezzo E."
                    },
                    {
                        "name": "Bianco L."
                    },
                    {
                        "name": "Barzon L."
                    },
                    {
                        "name": "Mazzon P."
                    },
                    {
                        "name": "Fontana P."
                    },
                    {
                        "name": "Toppo S."
                    },
                    {
                        "name": "Di Camillo B."
                    }
                ],
                "citationCount": 22,
                "date": "2014-01-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Reducing bias in RNA sequencing data: A novel approach to compute counts"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.2"
    ]
}