{
    "additionDate": "2020-01-09T18:10:53Z",
    "biotoolsCURIE": "biotools:GESUR",
    "biotoolsID": "GESUR",
    "confidence_flag": "tool",
    "description": "Identification of transcriptional isoforms associated with survival in cancer patient.\n\nGESUR performs overall survival (OS) or disease free survival (DFS, also called relapse-free survival and RFS) analysis based on expression of a gene set. GESUR uses Log-rank test, a.k.a the Mantel–Cox test, for hypothesis test. Cohorts thresholds can be adjusted, and gene-pairs can be used. The cox proportional hazard ratio and the 95% confidence interval information can also be included in the survival plot.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://gesur.cancer-pku.cn/",
    "lastUpdate": "2021-01-14T08:47:00Z",
    "name": "GESUR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JGG.2019.08.003",
            "metadata": {
                "abstract": "© 2019 Institute of Genetics and Developmental Biology, Chinese Academy of Sciences, and Genetics Society of ChinaThe Cancer Genome Atlas (TCGA) project produced RNA-Seq data for tens of thousands of cancer and non-cancer samples with clinical survival information, providing an unprecedented opportunity for analyzing prognostic genes and their isoforms. In this study, we performed the first large-scale identification of transcriptional isoforms that are specifically associated with patient prognosis, even without gene-level association. These specific isoforms are defined as Transcripts Associated with Patient Prognosis (TAPPs). Although a group of TAPPs are the principal isoforms of their genes with intact functional protein domains, another group of TAPPs lack important protein domains found in their canonical gene isoforms. This dichotomy in the distribution of protein domains may indicate different patterns of TAPPs association with cancer. TAPPs in protein-coding genes, especially those with altered protein domains, are rich in known cancer driver genes. We further identified multiple types of cancer recurrent TAPPs, such as DCAF17-201, providing a new approach for the detection of cancer-associated events. In order to make the wide research community to study prognostic isoforms, we developed a portal named GESUR (http://gesur.cancer-pku.cn/), which illustrates the detailed prognostic characteristics of TAPPs and other isoforms. Overall, our integrated analysis of gene expression and clinical parameters provides a new perspective for understanding the applications of different gene isoforms in tumor progression.",
                "authors": [
                    {
                        "name": "Tang Z."
                    },
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Ren X."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-20T00:00:00Z",
                "journal": "Journal of Genetics and Genomics",
                "title": "Identification of transcriptional isoforms associated with survival in cancer patient"
            },
            "pmid": "31630971"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}