{"credit":[{"name":"ugent.be","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"klaas.vandepoele@psb.vib-ugent.be","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"input":[{"data":{"term":"Gene ID","uri":"http://edamontology.org/data_2295"}}],"operation":[{"term":"Phylogenetic tree analysis (gene family prediction)","uri":"http://edamontology.org/operation_0553"}],"output":[{"data":{"term":"Protein family identifier","uri":"http://edamontology.org/data_1075"}}]}],"labels":{"collectionID":["BIG N2N","VIB","Plant Systems Biology","UGent"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Workbench"],"topic":[{"term":"Evolutionary biology","uri":"http://edamontology.org/topic_3299"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"}]},"publication":[{"abstract":"Publicly available protein sequences represent only a small fraction of the full catalog of genes encoded by the genomes of different plants, such as green algae, mosses, gymnosperms, and angiosperms. By contrast, an enormous amount of expressed sequence tags (ESTs) exists for a wide variety of plant species, representing a substantial part of all transcribed plant genes. Integrating protein and EST sequences in comparative and evolutionary analyses is not straightforward because of the heterogeneous nature of both types of sequence data. By combining information from publicly available EST and protein sequences for 32 different plant species, we identified more than 250,000 plant proteins organized in more than 12,000 gene families. Approximately 60% of the proteins are absent from current sequence databases but provide important new information about plant gene families. Analysis of the distribution of gene families over different plant species through phylogenetic profiling reveals interesting insights into plant gene evolution, and identifies species- and lineage-specific gene families, orphan genes, and conserved core genes across the green plant lineage. We counted a similar number of approximately 9,500 gene families in monocotyledonous and eudicotyledonous plants and found strong evidence for the existence of at least 33,700 genes in rice (Oryza sativa). Interestingly, the larger number of genes in rice compared to Arabidopsis (Arabidopsis thaliana) can partially be explained by a larger amount of species-specific single-copy genes and species-specific gene families. In addition, a majority of large gene families, typically containing more than 50 genes, are bigger in rice than Arabidopsis, whereas the opposite seems true for small gene families. © 2005 American Society of Plant Biologists.","authors":["Vandepoele K.","Van De Peer Y."],"cit_count":31,"doi":"10.1104/pp.104.054700","journal":"Plant Physiology","title":"Exploring the plant transcriptome through phylogenetic profiling","type":"Primary","year":"2005-12-01"}],"summary":{"biotoolsCURIE":"biotools:sppg","biotoolsID":"sppg","description":"Sequence Platform for the phylogenetic analysis of Plant Genes.","homepage":"http://bioinformatics.psb.ugent.be/cgi-bin/SPPG/index.htpl","name":"SPPG","version":["1"]}}