
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "EST assembly",
                    "uri": "http://edamontology.org/operation_0526"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The analysis of expressed sequence tag (EST) datasets offers a rapid and cost-effective approach to elucidate the transcriptome of an organism, but requiring several computational methods for assembly and annotation. ESTExplorer is a comprehensive workflow system for EST data management and analysis. The pipeline uses a 'distributed control approach' in which the most appropriate bioinformatics tools are implemented over different dedicated processors. Species-specific repeat masking and conceptual translation are in-built. ESTExplorer accepts a set of ESTs in FASTA format which can be analysed using programs selected by the user. After pre-processing and assembly, the dataset is annotated at the nucleotide and protein levels, following conceptual translation. Users may optionally provide ESTExplorer with assembled contigs for annotation purposes. Functionally annotated contigs/ESTs can be analysed individually. The overall outputs are gene ontologies, protein functional identifications in terms of mapping to protein domains and metabolic pathways. ESTExplorer has been applied successfully to annotate large EST datasets from parasitic nematodes and to identify novel genes as potential targets for parasite intervention. ESTExplorer runs on a Linux cluster and is freely available for the academic community at http://estexplorer.biolinfo.org. © 2007 The Author(s).",
            "authors": [
                "Nagaraj S.H.",
                "Deshpande N.",
                "Gasser R.B.",
                "Ranganathan S."
            ],
            "cit_count": 48,
            "journal": "Nucleic Acids Research",
            "pmid": "17545197",
            "title": "ESTExplorer: An expressed sequence tag (EST) assembly and annotation platform",
            "year": "2007-07-01"
        },
        {
            "abstract": "Expressed sequence tag (EST) sequencing projects are underway for numerous organisms, generating millions of short, single-pass nucleotide sequence reads, accumulating in EST databases. Extensive computational strategies have been developed to organize and analyse both small- and large-scale EST data for gene discovery, transcript and single nucleotide polymorphism analysis as well as functional annotation of putative gene products. We provide an overview of the significance of ESTs in the genomic era, their properties and the applications of ESTs. Methods adopted for each step of EST analysis by various research groups have been compared. Challenges that lie ahead in organizing and analysing the ever increasing EST data have also been identified. The most appropriate software tools for EST pre-processing, clustering and assembly, database matching and functional annotation have been compiled (available online from http://biolinfo.org/EST). We propose a road map for EST analysis to accelerate the effective analyses of EST data sets. An investigation of EST analysis platforms reveals that they all terminate prior to downstream functional annotation including gene ontologies, motif/pattern analysis and pathway mapping. © 2007 Oxford University Press.",
            "authors": [
                "Nagaraj S.H.",
                "Gasser R.B.",
                "Ranganathan S."
            ],
            "cit_count": 190,
            "journal": "Briefings in Bioinformatics",
            "pmid": "16772268",
            "title": "A hitchhiker's guide to expressed sequence tag (EST) analysis",
            "year": "2007-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:estexplorer",
        "biotoolsID": "estexplorer",
        "description": "Automated suite of programs to pre-process, assemble and functionally annotate ESTs at both DNA and protein level.",
        "homepage": "http://estexplorer.biolinfo.org",
        "name": "ESTExplorer"
    }
}