{
    "additionDate": "2021-03-19T08:26:26Z",
    "biotoolsCURIE": "biotools:ratlesnetv2",
    "biotoolsID": "ratlesnetv2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "juanmiguel.valverde@uef.fi",
            "name": "Juan Miguel Valverde",
            "typeEntity": "Person"
        }
    ],
    "description": "A Fully Convolutional Network for Rodent Brain Lesion Segmentation.\n\nRatLesNetv2 is a convolutional neural network implemented in Python+Pytorch to segment rodent brain lesions. The code of RatLesNetv2 is simplified to make it readable and accessible to a wide audience.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/jmlipman/RatLesNetv2",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-31T12:53:26Z",
    "license": "MIT",
    "name": "RatLesNetv2",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FNINS.2020.610239",
            "metadata": {
                "abstract": "© Copyright © 2020 Valverde, Shatillo, De Feo, Gröhn, Sierra and Tohka.We present a fully convolutional neural network (ConvNet), named RatLesNetv2, for segmenting lesions in rodent magnetic resonance (MR) brain images. RatLesNetv2 architecture resembles an autoencoder and it incorporates residual blocks that facilitate its optimization. RatLesNetv2 is trained end to end on three-dimensional images and it requires no preprocessing. We evaluated RatLesNetv2 on an exceptionally large dataset composed of 916 T2-weighted rat brain MRI scans of 671 rats at nine different lesion stages that were used to study focal cerebral ischemia for drug development. In addition, we compared its performance with three other ConvNets specifically designed for medical image segmentation. RatLesNetv2 obtained similar to higher Dice coefficient values than the other ConvNets and it produced much more realistic and compact segmentations with notably fewer holes and lower Hausdorff distance. The Dice scores of RatLesNetv2 segmentations also exceeded inter-rater agreement of manual segmentations. In conclusion, RatLesNetv2 could be used for automated lesion segmentation, reducing human workload and improving reproducibility. RatLesNetv2 is publicly available at https://github.com/jmlipman/RatLesNetv2.",
                "authors": [
                    {
                        "name": "Valverde J.M."
                    },
                    {
                        "name": "Shatillo A."
                    },
                    {
                        "name": "De Feo R."
                    },
                    {
                        "name": "Grohn O."
                    },
                    {
                        "name": "Sierra A."
                    },
                    {
                        "name": "Tohka J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-22T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "RatLesNetv2: A Fully Convolutional Network for Rodent Brain Lesion Segmentation"
            },
            "pmcid": "PMC7783408",
            "pmid": "33414703"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library",
        "Workflow"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}