{
    "accessibility": "Open access",
    "additionDate": "2023-02-20T14:23:43.030542Z",
    "biotoolsCURIE": "biotools:myops-net",
    "biotoolsID": "myops-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Junyi Qiu"
        },
        {
            "name": "Shan Yang"
        },
        {
            "name": "Lei Li",
            "orcidid": "https://orcid.org/0000-0003-1281-6472"
        },
        {
            "name": "Xiahai Zhuang",
            "orcidid": "https://orcid.org/0000-0003-4351-4979"
        }
    ],
    "description": "Myocardial pathology segmentation with flexible combination of multi-sequence CMR images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QJYBall/MyoPS-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-20T14:23:43.033254Z",
    "license": "MIT",
    "name": "MyoPS-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2022.102694",
            "metadata": {
                "abstract": "© 2022 Elsevier B.V.Myocardial pathology segmentation (MyoPS) can be a prerequisite for the accurate diagnosis and treatment planning of myocardial infarction. However, achieving this segmentation is challenging, mainly due to the inadequate and indistinct information from an image. In this work, we develop an end-to-end deep neural network, referred to as MyoPS-Net, to flexibly combine five-sequence cardiac magnetic resonance (CMR) images for MyoPS. To extract precise and adequate information, we design an effective yet flexible architecture to extract and fuse cross-modal features. This architecture can tackle different numbers of CMR images and complex combinations of modalities, with output branches targeting specific pathologies. To impose anatomical knowledge on the segmentation results, we first propose a module to regularize myocardium consistency and localize the pathologies, and then introduce an inclusiveness loss to utilize relations between myocardial scars and edema. We evaluated the proposed MyoPS-Net on two datasets, i.e., a private one consisting of 50 paired multi-sequence CMR images and a public one from MICCAI2020 MyoPS Challenge. Experimental results showed that MyoPS-Net could achieve state-of-the-art performance in various scenarios. Note that in practical clinics, the subjects may not have full sequences, such as missing LGE CMR or mapping CMR scans. We therefore conducted extensive experiments to investigate the performance of the proposed method in dealing with such complex combinations of different CMR sequences. Results proved the superiority and generalizability of MyoPS-Net, and more importantly, indicated a practical clinical application. The code has been released via https://github.com/QJYBall/MyoPS-Net.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Qiu J."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Zhuang X."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "MyoPS-Net: Myocardial pathology segmentation with flexible combination of multi-sequence CMR images"
            },
            "pmid": "36495601"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
