{
    "additionDate": "2019-11-14T18:43:22Z",
    "biotoolsCURIE": "biotools:Swish",
    "biotoolsID": "Swish",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michaelisaiahlove@gmail.com",
            "name": "Michael I Love",
            "orcidid": "https://orcid.org/0000-0001-8401-0545",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | Nonparametric expression analysis using inferential replicate counts | R scripts used in the Swish paper",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/azhu513/swishPaper",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-02-10T15:24:06.936570Z",
    "name": "Swish",
    "owner": "mikelove",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ622",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.A primary challenge in the analysis of RNA-seq data is to identify differentially expressed genes or transcripts while controlling for technical biases. Ideally, a statistical testing procedure should incorporate the inherent uncertainty of the abundance estimates arising from the quantification step. Most popular methods for RNA-seq differential expression analysis fit a parametric model to the counts for each gene or transcript, and a subset of methods can incorporate uncertainty. Previous work has shown that nonparametric models for RNA-seq differential expression may have better control of the false discovery rate, and adapt well to new data types without requiring reformulation of a parametric model. Existing nonparametric models do not take into account inferential uncertainty, leading to an inflated false discovery rate, in particular at the transcript level. We propose a nonparametric model for differential expression analysis using inferential replicate counts, extending the existing SAMseq method to account for inferential uncertainty. We compare our method, Swish, with popular differential expression analysis methods. Swish has improved control of the false discovery rate, in particular for transcripts with high inferential uncertainty. We apply Swish to a single-cell RNA-seq dataset, assessing differential expression between sub-populations of cells, and compare its performance to the Wilcoxon test.",
                "authors": [
                    {
                        "name": "Ibrahim J.G."
                    },
                    {
                        "name": "Love M.I."
                    },
                    {
                        "name": "Patro R."
                    },
                    {
                        "name": "Srivastava A."
                    },
                    {
                        "name": "Zhu A."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-10T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Nonparametric expression analysis using inferential replicate counts"
            },
            "pmcid": "PMC6765120",
            "pmid": "31372651"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
