{
    "additionDate": "2018-07-28T09:21:03Z",
    "biotoolsCURIE": "biotools:cowpi",
    "biotoolsID": "cowpi",
    "credit": [
        {
            "email": "Toby.Wilkinson@ed.ac.uk",
            "name": "Toby J. Wilkinson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Rumen Microbiome Focussed Version of the PICRUSt Functional Inference Software.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.cowpi.org/p/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "https://www.cowpi.org/2018/03/welcome.html",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "CowPI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.3389/fmicb.2018.01095",
            "metadata": {
                "abstract": "© 2018 Wilkinson, Huws, Edwards, Kingston-Smith, Siu-Ting, Hughes, Rubino, Friedersdorffand Creevey.Metataxonomic 16S rDNA based studies are a commonplace and useful tool in the research of the microbiome, but they do not provide the full investigative power of metagenomics and metatranscriptomics for revealing the functional potential of microbial communities. However, the use of metagenomic and metatranscriptomic technologies is hindered by high costs and skills barrier necessary to generate and interpret the data. To address this, a tool for Phylogenetic Investigation of Communities by Reconstruction of Unobserved States (PICRUSt) was developed for inferring the functional potential of an observed microbiome profile, based on 16S data. This allows functional inferences to be made from metataxonomic 16S rDNA studies with little extra work or cost, but its accuracy relies on the availability of completely sequenced genomes of representative organisms from the community being investigated. The rumen microbiome is an example of a community traditionally underrepresented in genome and sequence databases, but recent efforts by projects such as the Global Rumen Census and Hungate 1000 have resulted in a wide sampling of 16S rDNA profiles and almost 500 fully sequenced microbial genomes from this environment. Using this information, we have developed \"CowPI,\" a focused version of the PICRUSt tool provided for use by the wider scientific community in the study of the rumen microbiome. We evaluated the accuracy of CowPI and PICRUSt using two 16S datasets from the rumen microbiome: one generated from rDNA and the other from rRNA where corresponding metagenomic and metatranscriptomic data was also available. We show that the functional profiles predicted by CowPI better match estimates for both the meta-genomic and transcriptomic datasets than PICRUSt, and capture the higher degree of genetic variation and larger pangenomes of rumen organisms. Nonetheless, whilst being closer in terms of predictive power for the rumen microbiome, there were differences when compared to both the metagenomic and metatranscriptome data and so we recommend, where possible, functional inferences from 16S data should not replace metagenomic and metatranscriptomic approaches. The tool can be accessed at http://www.cowpi.org and is provided to the wider scientific community for use in the study of the rumen microbiome.",
                "authors": [
                    {
                        "name": "Creevey C.J."
                    },
                    {
                        "name": "Edwards J.E."
                    },
                    {
                        "name": "Friedersdorff M."
                    },
                    {
                        "name": "Hughes M."
                    },
                    {
                        "name": "Huws S.A."
                    },
                    {
                        "name": "Kingston-Smith A.H."
                    },
                    {
                        "name": "Rubino F."
                    },
                    {
                        "name": "Siu-Ting K."
                    },
                    {
                        "name": "Wilkinson T.J."
                    }
                ],
                "citationCount": 45,
                "date": "2018-05-25T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "CowPI: A rumen microbiome focussed version of the PICRUSt functional inference software"
            },
            "pmcid": "PMC5981159",
            "pmid": "29887853"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
