{
    "additionDate": "2023-01-25T13:58:33.377715Z",
    "biotoolsCURIE": "biotools:ase-net",
    "biotoolsID": "ase-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Tao Lei"
        }
    ],
    "description": "Semi-supervised medical image segmentation using adversarial consistency learning and dynamic convolution network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SUST-reynole/ASE-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-25T13:58:33.381264Z",
    "license": "Not licensed",
    "name": "ASE-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3225687",
            "metadata": {
                "abstract": "AuthorPopular semi-supervised medical image segmentation networks often suffer from error supervision from unlabeled data since they usually use consistency learning under different data perturbations to regularize model training. These networks ignore the relationship between labeled and unlabeled data, and only compute single pixel-level consistency leading to uncertain prediction results. Besides, these networks often require a large number of parameters since their backbone networks are designed depending on supervised image segmentation tasks. Moreover, these networks often face a high over-fitting risk since a small number of training samples are popular for semi-supervised image segmentation. To address the above problems, in this paper, we propose a novel adversarial self-ensembling network using dynamic convolution (ASE-Net) for semi-supervised medical image segmentation. First, we use an adversarial consistency training strategy (ACTS) that employs two discriminators based on consistency learning to obtain prior relationships between labeled and unlabeled data. The ACTS can simultaneously compute pixel-level and image-level consistency of unlabeled data under different data perturbations to improve the prediction quality of labels. Second, we design a dynamic convolution-based bidirectional attention component (DyBAC) that can be embedded in any segmentation network, aiming at adaptively adjusting the weights of ASE-Net based on the structural information of input samples. This component effectively improves the feature representation ability of ASE-Net and reduces the overfitting risk of the network. The proposed ASE-Net has been extensively tested on three publicly available datasets, and experiments indicate that ASE-Net is superior to state-of-the-art networks, and reduces computational costs and memory overhead. The code is available at: https://github.com/SUST-reynole/ASE-Net.",
                "authors": [
                    {
                        "name": "Du X."
                    },
                    {
                        "name": "Lei T."
                    },
                    {
                        "name": "Nandi A.K."
                    },
                    {
                        "name": "Wan Y."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhang D."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Semi-supervised medical image segmentation using adversarial consistency learning and dynamic convolution network"
            },
            "pmid": "36449588"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
