{
    "accessibility": "Open access",
    "additionDate": "2023-01-27T15:00:19.694843Z",
    "biotoolsCURIE": "biotools:cordial",
    "biotoolsID": "cordial",
    "collectionID": [
        "gpcr"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "p.cutillas@qmul.ac.uk",
            "name": "Pedro R Cutillas",
            "orcidid": "https://orcid.org/0000-0002-3426-2274",
            "typeEntity": "Person"
        }
    ],
    "description": "A R package for convenient correlation analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CutillasLab/cordial",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:16:19.241918Z",
    "license": "MIT",
    "name": "cordial",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac769",
            "metadata": {
                "abstract": "Motivation: Pathway inference methods are important for annotating the genome, for providing insights into the mechanisms of biochemical processes and allow the discovery of signalling members and potential new drug targets. Here, we tested the hypothesis that genes with similar impact on cell viability across multiple cell lines belong to a common pathway, thus providing a conceptual basis for a pathway inference method based on correlated anti-proliferative gene properties. Methods: To test this concept, we used recently available large-scale RNAi screens to develop a method, termed functional pathway inference analysis (FPIA), to systemically identify correlated gene dependencies. Results: To assess FPIA, we initially focused on PI3K/AKT/MTOR signalling, a prototypic oncogenic pathway for which we have a good sense of ground truth. Dependencies for AKT1, MTOR and PDPK1 were among the most correlated with those for PIK3CA (encoding PI3Ka), as returned by FPIA, whereas negative regulators of PI3K/AKT/ MTOR signalling, such as PTEN were anti-correlated. Following FPIA, MTOR, PIK3CA and PIK3CB produced significantly greater correlations for genes in the PI3K-Akt pathway versus other pathways. Application of FPIA to two additional pathways (p53 and MAPK) returned expected associations (e.g. MDM2 and TP53BP1 for p53 and MAPK1 and BRAF for MEK1). Over-representation analysis of FPIA-returned genes enriched the respective pathway, and FPIA restricted to specific tumour lineages uncovered cell type-specific networks. Overall, our study demonstrates the ability of FPIA to identify members of pro-survival biochemical pathways in cancer cells.",
                "authors": [
                    {
                        "name": "Badshah I.I."
                    },
                    {
                        "name": "Cutillas P.R."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Systematic identification of biochemical networks in cancer cells by functional pathway inference analysis"
            },
            "pmcid": "PMC9805595",
            "pmid": "36448701"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
