{
    "additionDate": "2017-08-03T19:04:48Z",
    "biotoolsCURIE": "biotools:zclass",
    "biotoolsID": "zclass",
    "credit": [
        {
            "email": "richard.morris@uea.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.uea.ac.uk/biological-sciences/people/profile/richard-morris"
        }
    ],
    "description": "Python object that takes input from a Protein Databank (PDB) file and converts it to a voxelised image.  The voxelised image can then expressed in terms of an expansion in a basis set of Zernike polynomials which can be used to make rapid comparisons between different protein shapes.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.uea.ac.uk/computing/zclass-zernike-class-"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://www.uea.ac.uk/computing/zclass-zernike-class-",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/zclass-converts-pdb-file-voxelised-image.html"
        }
    ],
    "name": "ZClass",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Protein structures are not static entities consisting of equally well-determined atomic coordinates. Proteins undergo continuous motion, and as catalytic machines, these movements can be of high relevance for understanding function. In addition to this strong biological motivation for considering shape changes is the necessity to correctly capture different levels of detail and error in protein structures. Some parts of a structural model are often poorly defined, and the atomic displacement parameters provide an excellent means to characterize the confidence in an atom's spatial coordinates. A mathematical framework for studying these shape changes, and handling positional variance is therefore of high importance. We present an approach for capturing various protein structure properties in a concise mathematical framework that allows us to compare features in a highly efficient manner. We demonstrate how three-dimensional Zernike moments can be employed to describe functions, not only on the surface of a protein but throughout the entire molecule. A number of proof-of-principle examples are given which demonstrate how this approach may be used in practice for the representation of movement and uncertainty. © Mary Ann Liebert, Inc. 2009.",
                "authors": [
                    {
                        "name": "Grandison S."
                    },
                    {
                        "name": "Roberts C."
                    },
                    {
                        "name": "Morris R.J."
                    }
                ],
                "citationCount": 22,
                "date": "2009-03-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "The application of 3D zernike moments for the description of \"model-free\" molecular structure, functional motion, and structural reliability"
            },
            "pmid": "19254186"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}