{
    "additionDate": "2022-10-27T10:33:36.709571Z",
    "biotoolsCURIE": "biotools:bcscdb",
    "biotoolsID": "bcscdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ssaha4@jcbose.ac.in",
            "name": "Sudipto Saha",
            "orcidid": "https://orcid.org/0000-0001-9433-8894",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of biomarkers of cancer stem cells.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://dibresources.jcbose.ac.in/ssaha4/bcscdb",
    "lastUpdate": "2022-10-27T10:33:36.711778Z",
    "license": "Other",
    "name": "BCSCdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC082",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.Cancer stem cells (CSCs) are a small heterogeneous population present within the tumor cells exhibiting self-renewal properties. CSCs have been demonstrated to elicit an important role in cancer recurrence, metastasis and drug resistance. CSCs are distinguished from cancer cell populations based on their molecular profiling or expression of distinct CSC biomarker(s). Recently, a huge amount of omics data have been generated for the characterization of CSCs, which enables distinguishing CSCs in different cancers. Here, we report biomarkers of the Cancer Stem Cells database (BCSCdb), a repository of information about CSC biomarkers. BCSCdb comprises CSC biomarkers collected from PubMed literature where these are identified using high-throughput and low-throughput methods. Each biomarker is provided with two different scores: the first is a confidence score to give confidence to reported CSC biomarkers based on the experimental method of detection in CSCs. The second is the global score to identify the global CSC biomarkers across 10 different types of cancer. This database contains three tables containing information about experimentally validated CSC biomarkers or genes, therapeutic target genes of CSCs and CSC biomarkers interactions. It contains information on three types of markers: high-throughput marker (HTM-8307), high-throughput marker validated by the low-throughput method (283) and low-throughput marker (LTM-525). A total of 171 low-throughput biomarkers were identified in primary tissue referred to as clinical biomarkers. Moreover, it contains 445 target genes for CSC therapeutics, 10 biomarkers targeted by clinical trial drugs in CSCs and 5 different types of interaction data for CSC biomarkers. BCSCdb is an online resource for CSC biomarkers, which will be immensely helpful in the cancer research community and is freely available. Database URL: http://dibresources.jcbose.ac.in/ssaha4/bcscdb.",
                "authors": [
                    {
                        "name": "Firdous S."
                    },
                    {
                        "name": "Ghosh A."
                    },
                    {
                        "name": "Saha S."
                    }
                ],
                "date": "2022-09-28T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "BCSCdb: a database of biomarkers of cancer stem cells"
            },
            "pmcid": "PMC9517164",
            "pmid": "36169329"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
