{
    "additionDate": "2021-01-18T11:22:15Z",
    "biotoolsCURIE": "biotools:serac",
    "biotoolsID": "serac",
    "confidence_flag": "tool",
    "description": "an R package for ShortlivEd RAdionuclide chronology of recent sediment cores.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rosalieb/serac",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-16T15:09:02Z",
    "license": "MIT",
    "name": "serac",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JENVRAD.2020.106449",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdShort-lived radionuclides are measured in surface sediment to provide a geochronology for the past century. Age-depth models are produced from 210Pbex activity-derived sedimentation rates and corroborated by known events, such as 137Cs and 241Am activities that are result of fallout from nuclear weapon tests and the Chernobyl accident. Different methods of age depth modelling using such data require expertise in lake sedimentation processes. Here, we present a package, serac, that allows the user to compute an age-depth model and generate a graph, the age-depth correspondence in a text file, and metadata, using the free open-source statistical software R. serac ensures the reproducibility of age-depth or age-mass depth models and allows testing of several 210Pbex models (CFCS, CIC, CRS, CRS piecewise) and sedimentation hypotheses (changes in sedimentation rates, presence of instantaneous deposits, varved sedimentation, etc.). Using several case studies, including lakes and lagoon in different environments, we demonstrate the use of the program in diverse situations that may be encountered. The rising number of sediment cores in recent palaeo studies and the need to correlate them require reproducible methods. serac is a user-friendly code that enables age model computation for the past century and encourages the standardisation of outputs.",
                "authors": [
                    {
                        "name": "Bruel R."
                    },
                    {
                        "name": "Sabatier P."
                    }
                ],
                "citationCount": 10,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Environmental Radioactivity",
                "title": "serac: A R package for ShortlivEd RAdionuclide chronology of recent sediment cores"
            },
            "pmid": "33120029"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
