{
    "additionDate": "2020-01-14T19:45:35Z",
    "biotoolsCURIE": "biotools:VIO",
    "biotoolsID": "VIO",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yongqunh@med.umich.edu",
            "name": "Yongqun He",
            "typeEntity": "Person"
        }
    ],
    "description": "ontology classification and study of vaccine responses given various experimental and analytical conditions.\n\nVIO: Vaccine Investigation Ontology.\n\nStatistics of Vaccine Investigation Ontology.\n\nIRI: https://raw.githubusercontent.com/vaccineontology/VIO/master/src/ontology/vio.owl.\n\nVIO and its usage in studying Yellow Fever vaccine-induced host response were presented in the VDOS-2018 workshop: https://sites.google.com/site/vdosworkshop/VDOS-2018.\n\nNote: This version of statistics metrics does not include any instance data yet. This feature will be added in the future",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                }
            ]
        }
    ],
    "homepage": "http://www.ontobee.org/ontology/VIO",
    "lastUpdate": "2021-01-02T15:32:56Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/vaccineontology/VIO"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://bioportal.bioontology.org/ontologies/VIO"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://www.ontobee.org/ontostat/VIO"
        }
    ],
    "name": "VIO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3194-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Different human responses to the same vaccine were frequently observed. For example, independent studies identified overlapping but different transcriptomic gene expression profiles in Yellow Fever vaccine 17D (YF-17D) immunized human subjects. Different experimental and analysis conditions were likely contributed to the observed differences. To investigate this issue, we developed a Vaccine Investigation Ontology (VIO), and applied VIO to classify the different variables and relations among these variables systematically. We then evaluated whether the ontological VIO modeling and VIO-based statistical analysis would contribute to the enhanced vaccine investigation studies and a better understanding of vaccine response mechanisms. Results: Our VIO modeling identified many variables related to data processing and analysis such as normalization method, cut-off criteria, software settings including software version. The datasets from two previous studies on human responses to YF-17D vaccine, reported by Gaucher et al. (2008) and Querec et al. (2009), were re-analyzed. We first applied the same LIMMA statistical method to re-analyze the Gaucher data set and identified a big difference in terms of significantly differentiated gene lists compared to the original study. The different results were likely due to the LIMMA version and software package differences. Our second study re-analyzed both Gaucher and Querec data sets but with the same data processing and analysis pipeline. Significant differences in differential gene lists were also identified. In both studies, we found that Gene Ontology (GO) enrichment results had more overlapping than the gene lists and enriched pathway lists. The visualization of the identified GO hierarchical structures among the enriched GO terms and their associated ancestor terms using GOfox allowed us to find more associations among enriched but often different GO terms, demonstrating the usage of GO hierarchical relations enhance data analysis. Conclusions: The ontology-based analysis framework supports standardized representation, integration, and analysis of heterogeneous data of host responses to vaccines. Our study also showed that differences in specific variables might explain different results drawn from similar studies.",
                "authors": [
                    {
                        "name": "Ong E."
                    },
                    {
                        "name": "Sun P."
                    },
                    {
                        "name": "Berke K."
                    },
                    {
                        "name": "Zheng J."
                    },
                    {
                        "name": "Wu G."
                    },
                    {
                        "name": "He Y."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VIO: Ontology classification and study of vaccine responses given various experimental and analytical conditions"
            },
            "pmcid": "PMC6927110",
            "pmid": "31865910"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        }
    ],
    "validated": 1
}