{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:11:03Z",
    "biotoolsCURIE": "biotools:EPEE",
    "biotoolsID": "EPEE",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "murat.cobanoglu@utsouthwestern.edu",
            "name": "Murat Can Çobanoğlu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Effector and Perturbation Estimation Engine (EPEE) conducts differential analysis of transcription factor activity from gene expression data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Cobanoglu-Lab/EPEE/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Cobanoglu-Lab/EPEE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Cobanoglu-Lab/EPEE/issues"
        }
    ],
    "maturity": "Mature",
    "name": "EPEE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ398",
            "metadata": {
                "abstract": "© 2019 The Author(s).Motivation: Activity of transcriptional regulators is crucial in elucidating the mechanism of phenotypes. However regulatory activity hypotheses are difficult to experimentally test. Therefore, we need accurate and reliable computational methods for regulator activity inference. There is extensive work in this area, however, current methods have difficulty with one or more of the following: resolving activity of TFs with overlapping regulons, reflecting known regulatory relationships, or flexible modeling of TF activity over the regulon. Results: We present Effector and Perturbation Estimation Engine (EPEE), a method for differential analysis of transcription factor (TF) activity from gene expression data. EPEE addresses each of these principal challenges in the field. Firstly, EPEE collectively models all TF activity in a single multivariate model, thereby accounting for the intrinsic coupling among TFs that share targets, which is highly frequent. Secondly, EPEE incorporates context-specific TF-gene regulatory networks and therefore adapts the analysis to each biological context. Finally, EPEE can flexibly reflect different regulatory activity of a single TF among its potential targets. This allows the flexibility to implicitly recover other regulatory influences such as co-activators or repressors. We comparatively validated EPEE in 15 datasets from three well-studied contexts, namely immunology, cancer, and hematopoiesis. We show that addressing the aforementioned challenges enable EPEE to outperform alternative methods and reliably produce accurate results. Availability and implementation: https://github.com/Cobanoglu-Lab/EPEE. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Agac D."
                    },
                    {
                        "name": "Amin V."
                    },
                    {
                        "name": "Barnes S.D."
                    },
                    {
                        "name": "Cobanoglu M.C."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Accurate differential analysis of transcription factor activity from gene expression"
            },
            "pmid": "31099391",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
