{
    "additionDate": "2019-11-14T18:05:35Z",
    "biotoolsCURIE": "biotools:EPIFANY",
    "biotoolsID": "EPIFANY",
    "confidence_flag": "tool",
    "description": "EPIFANY is a protein inference engine based on a Bayesian network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "https://OpenMS.de/epifany",
    "lastUpdate": "2020-12-25T15:11:37Z",
    "name": "Efficient Bayesian protein inference (EPIFANY)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/734327"
        },
        {
            "doi": "10.1021/acs.jproteome.9b00566",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Accurate protein inference in the presence of shared peptides is still one of the key problems in bottom-up proteomics. Most protein inference tools employing simple heuristic inference strategies are efficient but exhibit reduced accuracy. More advanced probabilistic methods often exhibit better inference quality but tend to be too slow for large data sets. Here, we present a novel protein inference method, EPIFANY, combining a loopy belief propagation algorithm with convolution trees for efficient processing of Bayesian networks. We demonstrate that EPIFANY combines the reliable protein inference of Bayesian methods with significantly shorter runtimes. On the 2016 iPRG protein inference benchmark data, EPIFANY is the only tested method that finds all true-positive proteins at a 5% protein false discovery rate (FDR) without strict prefiltering on the peptide-spectrum match (PSM) level, yielding an increase in identification performance (+10% in the number of true positives and +14% in partial AUC) compared to previous approaches. Even very large data sets with hundreds of thousands of spectra (which are intractable with other Bayesian and some non-Bayesian tools) can be processed with EPIFANY within minutes. The increased inference quality including shared peptides results in better protein inference results and thus increased robustness of the biological hypotheses generated. EPIFANY is available as open-source software for all major platforms at https://OpenMS.de/epifany.",
                "authors": [
                    {
                        "name": "Dijkstra T.M.H."
                    },
                    {
                        "name": "Kohlbacher O."
                    },
                    {
                        "name": "Pfeuffer J."
                    },
                    {
                        "name": "Reinert K."
                    },
                    {
                        "name": "Sachsenberg T."
                    },
                    {
                        "name": "Serang O."
                    }
                ],
                "citationCount": 5,
                "date": "2020-03-06T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "EPIFANY: A Method for Efficient High-Confidence Protein Inference"
            },
            "pmcid": "PMC7583457",
            "pmid": "31975601"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
