{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2018-06-25T09:48:30Z",
    "biotoolsCURIE": "biotools:lailaps-qsm",
    "biotoolsID": "lailaps-qsm",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lange@ipk-gatersleben.de",
            "name": "Matthias Lange",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A machine learning approach for optimizing data searching and filtering from life-science databases. It is integrated in the LAILAPS search engine.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/ipk_bit_team/bioescorte-suggestion/overview"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://bitbucket.org/ipk_bit_team/bioescorte-suggestion/src"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/ipk_bit_team/bioescorte-suggestion",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-2.0",
    "maturity": "Emerging",
    "name": "LAILAPS-QSM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006058",
            "metadata": {
                "abstract": "© 2018 Chen et al.In order to access and filter content of life-science databases, full text search is a widely applied query interface. But its high flexibility and intuitiveness is paid for with potentially imprecise and incomplete query results. To reduce this drawback, query assistance systems suggest those combinations of keywords with the highest potential to match most of the relevant data records. Widespread approaches are syntactic query corrections that avoid misspelling and support expansion of words by suffixes and prefixes. Synonym expansion approaches apply thesauri, ontologies, and query logs. All need laborious curation and maintenance. Furthermore, access to query logs is in general restricted. Approaches that infer related queries by their query profile like research field, geographic location, co-authorship, affiliation etc. require user’s registration and its public accessibility that contradict privacy concerns. To overcome these drawbacks, we implemented LAILAPS-QSM, a machine learning approach that reconstruct possible linguistic contexts of a given keyword query. The context is referred from the text records that are stored in the databases that are going to be queried or extracted for a general purpose query suggestion from PubMed abstracts and UniProt data. The supplied tool suite enables the pre-processing of these text records and the further computation of customized distributed word vectors. The latter are used to suggest alternative keyword queries. An evaluated of the query suggestion quality was done for plant science use cases. Locally present experts enable a cost-efficient quality assessment in the categories trait, biological entity, taxonomy, affiliation, and metabolic function which has been performed using ontology term similarities. LAILAPS-QSM mean information content similarity for 15 representative queries is 0.70, whereas 34% have a score above 0.80. In comparison, the information content similarity for human expert made query suggestions is 0.90. The software is either available as tool set to build and train dedicated query suggestion services or as already trained general purpose RESTful web service. The service uses open interfaces to be seamless embeddable into database frontends. The JAVA implementation uses highly optimized data structures and streamlined code to provide fast and scalable response for web service calls.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Zhou R."
                    },
                    {
                        "name": "Lange M."
                    }
                ],
                "date": "2018-03-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "LAILAPS-QSM: A RESTful API and JAVA library for semantic query suggestions"
            }
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1
}