{"credit":[],"labels":{"topic":[{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Critical care medicine","uri":"http://edamontology.org/topic_3403"},{"term":"Physics","uri":"http://edamontology.org/topic_3318"}]},"publication":[{"abstract":"© 2019 American Society of Regional Anesthesia & Pain Medicine. Re-use permitted under CC BY-NC. No commercial re-use. Published by BMJ.Introduction: The utility of perioperative point-of-care ultrasound (P-POCUS) is rapidly growing. The successful implementation of a comprehensive P-POCUS curriculum, Focused PeriOperative Risk Evaluation Sonography Involving Gastro-abdominal, Hemodynamic, and Trans-thoracic Ultrasound (FORESIGHT), has been demonstrated. This project sought to further evaluate the utility of P-POCUS with the following aims: (1) to assess the ability to train the FORESIGHT curriculum via a free, open-access, online platform; (2) to launch a P-POCUS clinical service as a quality improvement (QI) initiative; (3) to evaluate the diagnostic accuracy of the P-POCUS examinations to formal diagnostic studies; and (4) to compare the P-POCUS diagnostic accuracy with the diagnostic accuracy of traditional assessment (TA). Methods: This study was launched as a QI project for the implementation of a P-POCUS service. A group of attending and resident anesthesiologists completed P-POCUS training supported by an online curriculum. After training, a P-POCUS service was launched. The P-POCUS service was available for any perioperative event, and specific triggers were also identified. All examinations were documented on a validated datasheet. The diagnostic accuracy of the two index tests, P-POCUS and TA, were compared with formal diagnostic testing. TA was defined as a combination of the anesthesiologist's bedside assessment and physical examination. The primary outcome marker was a comparison in the accuracy of new diagnosis detected by P-POCUS service versus the TA performed by the primary anesthesiologist. Results: A total of 686 P-POCUS examinations were performed with 466 examinations having formal diagnostic studies for comparison. Of these, 92 examinations were detected as having new diagnoses. Performance for detection of a new diagnosis demonstrated a statistically higher sensitivity for the P-POCUS examinations (p<0.0001). Performance comparison of all P-POCUS examinations that were matched to formal diagnostic studies (n=466) also demonstrated a significantly higher sensitivity. These findings were consistent across cardiovascular, pulmonary and abdominal P-POCUS categories (p<0.01). Additionally, multiple pathologies demonstrated complete agreement between the P-POCUS examination and the formal study. Conclusion: A P-POCUS service can be developed after training facilitated by an online curriculum. P-POCUS examinations can be performed by anesthesiologists with a high degree of accuracy to formal studies, which is superior to TA.","authors":["Ramsingh D.","Runyon A.","Gatling J.","Dorotta I.","Lauer R.","Wailes D.","Yang J.","Alschuler M.","Austin B.","Stier G.","Martin R."],"cit_count":1,"doi":"10.1136/RAPM-2019-100632","journal":"Regional Anesthesia and Pain Medicine","pmid":"31678962","title":"Improved diagnostic accuracy of pathology with the implementation of a perioperative point-of-care ultrasound service: Quality improvement initiative","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:P-POCUS","biotoolsID":"P-POCUS","description":"Improved diagnostic accuracy of pathology with the implementation of a perioperative point-of-care ultrasound service.\n\nINTRODUCTION:The utility of perioperative point-of-care ultrasound (P-POCUS) is rapidly growing. The successful implementation of a comprehensive P-POCUS curriculum, Focused PeriOperative Risk Evaluation Sonography Involving Gastro-abdominal, Hemodynamic, and Trans-thoracic Ultrasound (FORESIGHT), has been demonstrated.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'P-POCUS examinations'","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31678962","name":"P-POCUS"}}