{"credit":[{"email":"Samuel.Payne@pnnl.gov","name":"Samuel H. Payne","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/PNNL-Comp-Mass-Spec/bsf-py/blob/master/tutorial/tutorial.ipynb"}],"function":[{"operation":[{"term":"Comparison","uri":"http://edamontology.org/operation_2424"}]},{"operation":[{"term":"Filtering","uri":"http://edamontology.org/operation_3695"}]},{"operation":[{"term":"Document similarity calculation","uri":"http://edamontology.org/operation_3278"}]}],"labels":{"language":["C++","Python"],"license":"BSD-2-Clause","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Data mining","uri":"http://edamontology.org/topic_3473"}]},"link":[{"note":"The BSF code, written in C++","type":"MIRROR","url":"https://github.com/PNNL-Comp-Mass-Spec/bsf-core"}],"publication":[{"abstract":"© 2018 The Author(s). Background: Identifying similarities between datasets is a fundamental task in data mining and has become an integral part of modern scientific investigation. Whether the task is to identify co-expressed genes in large-scale expression surveys or to predict combinations of gene knockouts which would elicit a similar phenotype, the underlying computational task is often a multi-dimensional similarity test. As datasets continue to grow, improvements to the efficiency, sensitivity or specificity of such computation will have broad impacts as it allows scientists to more completely explore the wealth of scientific data. Results: The Blazing Signature Filter (BSF) is a highly efficient pairwise similarity algorithm which enables extensive data mining within a reasonable amount of time. The algorithm transforms datasets into binary metrics, allowing it to utilize the computationally efficient bit operators and provide a coarse measure of similarity. We demonstrate the utility of our algorithm using two common bioinformatics tasks: identifying data sets with similar gene expression profiles, and comparing annotated genomes. Conclusions: The BSF is a highly efficient pairwise similarity algorithm that can scale to billions of comparisons without the need for specialized hardware.","authors":["Lee J.-Y.","Fujimoto G.M.","Wilson R.","Wiley H.S.","Payne S.H."],"cit_count":0,"doi":"10.1186/s12859-018-2210-6","journal":"BMC Bioinformatics","title":"Blazing Signature Filter: A library for fast pairwise similarity comparisons","type":"Primary","year":"2018-06-11"}],"summary":{"biotoolsCURIE":"biotools:bsf","biotoolsID":"bsf","description":"The Blazing Signature Filter is a highly efficient pairwise similarity algorithm which enables extensive data mining within a reasonable amount of time. The algorithm transforms datasets into binary metrics, allowing it to utilize the computationally efficient bit operators and provide a coarse measure of similarity.","homepage":"https://github.com/PNNL-Comp-Mass-Spec/bsf-py","name":"BSF"}}