{
    "additionDate": "2020-01-14T20:17:56Z",
    "biotoolsCURIE": "biotools:expansion-network",
    "biotoolsID": "expansion-network",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "creda@ens-paris-saclay.fr",
            "name": "Clémence Réda"
        },
        {
            "name": "Bartek Wilczyński",
            "orcidid": "https://orcid.org/0000-0002-8134-0589"
        }
    ],
    "description": "Automated inference of gene regulatory networks using explicit regulatory modules.\n\nThis GitHub project provides the code for the network inference and model expansion procedures, along with all the related scripts used in the paper Automated Inference of Gene Regulatory Networks Using Explicit Regulatory Modules (non published).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "https://github.com/regulomics/expansion-network",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-28T15:09:39Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/regulomics/expansion-network/issues"
        }
    ],
    "name": "expansion-network",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JTBI.2019.110091",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdGene regulatory networks are a popular tool for modelling important biological phenomena, such as cell differentiation or oncogenesis. Efficient identification of the causal connections between genes, their products and regulating transcription factors, is key to understanding how defects in their function may trigger diseases. Modelling approaches should keep up with the ever more detailed descriptions of the biological phenomena at play, as provided by new experimental findings and technical improvements. In recent years, we have seen great improvements in mapping of specific binding sites of many transcription factors to distinct regulatory regions. Recent gene regulatory network models use binding measurements; but usually only to define gene-to-gene interactions, ignoring regulatory module structure. Moreover, current huge amount of transcriptomic data, and exploration of all possible cis-regulatory arrangements which can lead to the same transcriptomic response, makes manual model building both tedious and time-consuming. In our paper, we propose a method to specify possible regulatory connections in a given Boolean network, based on transcription factor binding evidence. This is implemented by an algorithm which expands a regular Boolean network model into a “cis-regulatory” Boolean network model. This expanded model explicitly defines regulatory regions as additional nodes in the network, and adds new, valuable biological insights to the system dynamics. The expanded model can automatically be compared with expression data. And, for each node, a regulatory function, consistent with the experimental data, can be found. The resulting models are usually more constrained (by biologically-motivated metadata), and can then be inspected in in silico simulations. The fully automated method for model identification has been implemented in Python, and the expansion algorithm in R. The method resorts to the Z3 Satisfiability Modulo Theories (SMT) solver, and is similar to the RE:IN application (Yordanov et al., 2016). It is available on https://github.com/regulomics/expansion-network.",
                "authors": [
                    {
                        "name": "Reda C."
                    },
                    {
                        "name": "Wilczynski B."
                    }
                ],
                "date": "2020-02-07T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "Automated inference of gene regulatory networks using explicit regulatory modules"
            },
            "pmid": "31790679"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}