{
    "additionDate": "2021-01-18T09:54:13Z",
    "biotoolsCURIE": "biotools:tableone",
    "biotoolsID": "tableone",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dmavridi@uoi.gr",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package that provides an easy way of exporting the descriptive table 1 that is commonly used in articles to a Word document for easy editing and copying to the article.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://esm.uoi.gr/shiny/tableone/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-25T13:17:44Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/agapiospanos/TableOne"
        }
    ],
    "name": "TableOne",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1136/EBMENTAL-2020-300162",
            "metadata": {
                "abstract": "© Author(s) (or their employer(s)) 2020. No commercial re-use. See rights and permissions. Published by BMJ.Objective To develop an easy-to-use R package and web application that summarises baseline characteristics across different arms of a clinical trial or different exposures. Methods Tables and figures are the efficient means of visualising, communicating and summarising data. It is common in comparative effectiveness research to provide a synopsis of characteristics and outcomes across the various treatment groups. The popularity of such a table has earned it a name and we simply call it the a € TableOne', as it is usually the first TableOne encounters looking at a published clinical trial. Such a table includes not only descriptive statistics for each group but also appropriate tests (p values and 95% CIs) for checking for differences across groups. We have developed an R package (called TableOne) (accessible through https://github.com/agapiospanos/TableOne) th at quickly summarises and compares results across different groups. We have also extended it to an online web application that is easily handled by the researcher. All computations are done in R and plots are produced using the plotly library. We provide a detailed description on how to use the web application. Results The application guides the user in a step by step format (wizard) and it is accessible through any browser in the following link (https://esm.uoi.gr/shiny/tableone/). Finally, appropriate interactive plots are provided for each variable. Conclusions This easy-to-use web application will help researchers quickly and easily to visualise differences across treatment groups or different exposures.",
                "authors": [
                    {
                        "name": "Mavridis D."
                    },
                    {
                        "name": "Panos A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Evidence-Based Mental Health",
                "title": "TableOne: An online web application and R package for summarising and visualising data"
            },
            "pmid": "32665250"
        }
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
