{
    "additionDate": "2021-01-18T08:48:05Z",
    "biotoolsCURIE": "biotools:olcs-ranker",
    "biotoolsID": "olcs-ranker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liangxijunsd@163.com",
            "name": "Xijun Liang",
            "orcidid": "https://orcid.org/0000-0002-6991-7162",
            "typeEntity": "Person"
        }
    ],
    "description": "A cost-sensitive online learning method for peptide identification.\n\nPost-database search is a key procedure in peptide identification with tandem mass spectrometry (MS MS) strategies for refining peptide-spectrum matches (PSMs) generated by database search engines. Although many statistical and machine learning-based methods have been developed to improve the accuracy of peptide identification, the challenge remains on large-scale datasets and datasets with a distribution of unbalanced PSMs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                }
            ]
        }
    ],
    "homepage": "http://161.6.5.181:8000/olcs-ranker/",
    "lastUpdate": "2021-03-13T19:03:31Z",
    "name": "OLCS-Ranker",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6693-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Post-database search is a key procedure in peptide identification with tandem mass spectrometry (MS/MS) strategies for refining peptide-spectrum matches (PSMs) generated by database search engines. Although many statistical and machine learning-based methods have been developed to improve the accuracy of peptide identification, the challenge remains on large-scale datasets and datasets with a distribution of unbalanced PSMs. A more efficient learning strategy is required for improving the accuracy of peptide identification on challenging datasets. While complex learning models have larger power of classification, they may cause overfitting problems and introduce computational complexity on large-scale datasets. Kernel methods map data from the sample space to high dimensional spaces where data relationships can be simplified for modeling. Results: In order to tackle the computational challenge of using the kernel-based learning model for practical peptide identification problems, we present an online learning algorithm, OLCS-Ranker, which iteratively feeds only one training sample into the learning model at each round, and, as a result, the memory requirement for computation is significantly reduced. Meanwhile, we propose a cost-sensitive learning model for OLCS-Ranker by using a larger loss of decoy PSMs than that of target PSMs in the loss function. Conclusions: The new model can reduce its false discovery rate on datasets with a distribution of unbalanced PSMs. Experimental studies show that OLCS-Ranker outperforms other methods in terms of accuracy and stability, especially on datasets with a distribution of unbalanced PSMs. Furthermore, OLCS-Ranker is 15-85 times faster than CRanker.",
                "authors": [
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Xia Z."
                    },
                    {
                        "name": "Jian L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Niu X."
                    },
                    {
                        "name": "Link A.J."
                    }
                ],
                "date": "2020-04-25T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A cost-sensitive online learning method for peptide identification"
            },
            "pmcid": "PMC7183122",
            "pmid": "32334531"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}