{
    "additionDate": "2017-05-01T17:17:26Z",
    "biotoolsCURIE": "biotools:facta_plus",
    "biotoolsID": "facta_plus",
    "credit": [
        {
            "email": "tsuruoka@jaist.ac.jp",
            "name": "Yoshimasa Tsuruoka",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Real-time text-mining system for finding and visualizing indirect associations between biomedical concepts from MEDLINE abstracts. The system can be used as a text search engine like PubMed, with additional features to help users to discover and visualize indirect associations between important biomedical concepts such as genes, diseases and chemical compounds.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://refine1-nactem.mc.man.ac.uk/facta/",
    "homepage_status": 1,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "name": "FACTA plus",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Discovering useful associations between biomedical concepts has been one of the main goals in biomedical text-mining, and understanding their biomedical contexts is crucial in the discovery process. Hence, we need a text-mining system that helps users explore various types of (possibly hidden) associations in an easy and comprehensible manner. Results: This article describes FACTA+, a real-time text-mining system for finding and visualizing indirect associations between biomedical concepts from MEDLINE abstracts. The system can be used as a text search engine like PubMed with additional features to help users discover and visualize indirect associations between important biomedical concepts such as genes, diseases and chemical compounds. FACTA+ inherits all functionality from its predecessor, FACTA, and extends it by incorporating three new features: (i) detecting biomolecular events in text using a machine learning model, (ii) discovering hidden associations using co-occurrence statistics between concepts, and (iii) visualizing associations to improve the interpretability of the output. To the best of our knowledge, FACTA+ is the first real-time web application that offers the functionality of finding concepts involving biomolecular events and visualizing indirect associations of concepts with both their categories and importance. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Tsuruoka Y."
                    },
                    {
                        "name": "Miwa M."
                    },
                    {
                        "name": "Hamamoto K."
                    },
                    {
                        "name": "Tsujii J."
                    },
                    {
                        "name": "Ananiadou S."
                    }
                ],
                "citationCount": 64,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Discovering and visualizing indirect associations between biomedical concepts"
            },
            "pmid": "21685059"
        },
        {
            "metadata": {
                "abstract": "FACTA is a text search engine for MEDLINE abstracts, which is designed particularly to help users browse biomedical concepts (e.g. genes/ proteins, diseases, enzymes and chemical compounds) appearing in the documents retrieved by the query. The concepts are presented to the user in a tabular format and ranked based on the co-occurrence statistics. Unlike existing systems that provide similar functionality, FACTA pre-indexes not only the words but also the concepts mentioned in the documents, which enables the user to issue a flexible query (e.g. free keywords or Boolean combinations of keywords/concepts) and receive the results immediately even when the number of the documents that match the query is very large. The user can also view snippets from MEDLINE to get textual evidence of associations between the query terms and the concepts. The concept IDs and their names/synonyms for building the indexes were collected from several biomedical databases and thesauri, such as UniProt, BioThesaurus, UMLS, KEGG and DrugBank. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Tsuruoka Y."
                    },
                    {
                        "name": "Tsujii J."
                    },
                    {
                        "name": "Ananiadou S."
                    }
                ],
                "citationCount": 108,
                "date": "2008-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FACTA: A text search engine for finding associated biomedical concepts"
            },
            "pmid": "18772154"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}