{
    "additionDate": "2020-01-09T18:00:32Z",
    "biotoolsCURIE": "biotools:bionev",
    "biotoolsID": "bionev",
    "confidence_flag": "tool",
    "description": "Methods, Applications, and Evaluations.\n\nGraph Embedding Evaluation / Code and Datasets for \"Graph Embedding on Biomedical Networks: Methods, Applications, and Evaluations\".\n\nBioNEV (Biomedical Network Embedding Evaluation).\n\nThis repository contains source code and datasets for paper \"Graph Embedding on Biomedical Networks: Methods, Applications, and Evaluations\" (accepted by Bioinformatics). This work aims to systematically evaluate recent advanced graph embedding techniques on biomedical tasks. We compile 5 benchmark datasets for 4 biomedical prediction tasks (see paper for details) and use them to evaluate 11 representative graph embedding methods selected from different categories:.\n\n5 matrix factorization-based: Laplacian Eigenmap, SVD, Graph Factorization, HOPE, GraRep.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xiangyue9607/BioNEV",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-11T09:29:18Z",
    "license": "MIT",
    "name": "BioNEV",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ718",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Graph embedding learning that aims to automatically learn low-dimensional node representations, has drawn increasing attention in recent years. To date, most recent graph embedding methods are evaluated on social and information networks and are not comprehensively studied on biomedical networks under systematic experiments and analyses. On the other hand, for a variety of biomedical network analysis tasks, traditional techniques such as matrix factorization (which can be seen as a type of graph embedding methods) have shown promising results, and hence there is a need to systematically evaluate the more recent graph embedding methods (e.g. random walk-based and neural network-based) in terms of their usability and potential to further the state-of-the-art. Results: We select 11 representative graph embedding methods and conduct a systematic comparison on 3 important biomedical link prediction tasks: drug-disease association (DDA) prediction, drug-drug interaction (DDI) prediction, protein-protein interaction (PPI) prediction; and 2 node classification tasks: medical term semantic type classification, protein function prediction. Our experimental results demonstrate that the recent graph embedding methods achieve promising results and deserve more attention in the future biomedical graph analysis. Compared with three state-of-the-art methods for DDAs, DDIs and protein function predictions, the recent graph embedding methods achieve competitive performance without using any biological features and the learned embeddings can be treated as complementary representations for the biological features. By summarizing the experimental results, we provide general guidelines for properly selecting graph embedding methods and setting their hyper-parameters for different biomedical tasks.",
                "authors": [
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Lin S.M."
                    },
                    {
                        "name": "Moosavinasab S."
                    },
                    {
                        "name": "Parthasarathy S."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Yue X."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 43,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Graph embedding on biomedical networks: Methods, applications and evaluations"
            },
            "pmid": "31584634"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
