{
    "additionDate": "2017-01-17T15:02:31Z",
    "biotoolsCURIE": "biotools:piano",
    "biotoolsID": "piano",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "piano.rpkg@gmail.com",
            "name": "Leif Varemo",
            "orcidid": "http://orcid.org/0000-0003-4153-5354",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Performs gene set analysis using various statistical methods, from different gene level statistics and a wide range of gene-set collections. Furthermore, this package contains functions for combining the results of multiple runs of gene set analyses.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/piano.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/piano_1.14.4.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/piano.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T16:37:58Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.sysbio.se/piano"
        }
    ],
    "name": "piano",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt111",
            "metadata": {
                "abstract": "Gene set analysis (GSA) is used to elucidate genome-wide data, in particular transcriptome data. A multitude of methods have been proposed for this step of the analysis, and many of them have been compared and evaluated. Unfortunately, there is no consolidated opinion regarding what methods should be preferred, and the variety of available GSA software and implementations pose a difficulty for the end-user who wants to try out different methods. To address this, we have developed the R package Piano that collects a range of GSA methods into the same system, for the benefit of the end-user. Further on we refine the GSA workflow by using modifications of the gene-level statistics. This enables us to divide the resulting gene set P-values into three classes, describing different aspects of gene expression directionality at gene set level. We use our fully implemented workflow to investigate the impact of the individual components of GSA by using microarray and RNA-seq data. The results show that the evaluated methods are globally similar and the major separation correlates well with our defined directionality classes. As a consequence of this, we suggest to use a consensus scoring approach, based on multiple GSA runs. In combination with the directionality classes, this constitutes a more thorough basis for an enriched biological interpretation. © 2013 The Author(s).",
                "authors": [
                    {
                        "name": "Nielsen J."
                    },
                    {
                        "name": "Nookaew I."
                    },
                    {
                        "name": "Varemo L."
                    }
                ],
                "citationCount": 351,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Enriching the gene set analysis of genome-wide data by incorporating directionality of gene expression and combining statistical hypotheses and methods"
            },
            "pmcid": "PMC3632109",
            "pmid": "23444143",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.4"
    ]
}
