{
    "additionDate": "2021-01-18T09:27:39Z",
    "biotoolsCURIE": "biotools:gibbsthur",
    "biotoolsID": "gibbsthur",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lvarona@unizar.es",
            "name": "Luis Varona",
            "orcidid": "https://orcid.org/0000-0001-6256-5478",
            "typeEntity": "Person"
        }
    ],
    "description": "Software for Estimating Variance Components and Predicting Breeding Values for Ranking Traits Based on a Thurstonian Model.\n\nBreeding evaluation and variance component estimation of ranking traits.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/lvaronaunizar/Gibbsthur",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2021-01-23T09:52:00Z",
    "name": "GIBBSTHUR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/ANI10061001",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.(1) Background: Ranking traits are used commonly for breeding purposes in several equine populations; however, implementation is complex, because the position of a horse in a competition event is discontinuous and is influenced by the performance of its competitors. One approach to overcoming these limitations is to assume an underlying Gaussian liability that represents a horse’s performance and dictates the observed classification in a competition event. That approach can be implemented using Montecarlo Markov Chain (McMC) techniques with a procedure known as the Thurstonian model. (2) Methods: We have developed software (GIBBSTHUR) that analyses ranking traits along with other continuous or threshold traits. The software implements a Gibbs Sampler scheme with a data‐augmentation step for the liability of the ranking traits and provides estimates of the variance and covariance components and predictions of the breeding values and the average performance of the competitors in competition events. (3) Results: The results of a simple example are presented, in which it is shown that the procedure can recover the simulated variance and covariance components. In addition, the correlation between the simulated and predicted breeding values and between the estimates of the event effects and the average additive genetic effect of the competitors demonstrates the ability of the software to produce useful predictions for breeding purposes. (4) Conclusions: the GIBBSTHUR software provides a useful tool for the breeding evaluation of ranking traits in horses and is freely available in a public repository (https://github.com/lvaronaunizar/Gibbsthur).",
                "authors": [
                    {
                        "name": "Legarra A."
                    },
                    {
                        "name": "Varona L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Animals",
                "title": "Gibbsthur: Software for estimating variance components and predicting breeding values for ranking traits based on a thurstonian model"
            },
            "pmcid": "PMC7341208",
            "pmid": "32521773"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
