{
    "additionDate": "2021-01-18T12:26:34Z",
    "biotoolsCURIE": "biotools:cdasor",
    "biotoolsID": "cdasor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chengqlu@csu.edu.cn",
            "name": "Chengqian Lu"
        },
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "CDASOR is a Python page for the algorithm of the same name for predicting circRNA-disease association using convolutional and recurrent neural networks. \nproving circRNA-disease association prediction by sequence and ontology representations with convolutional and recurrent neural networks.\n\nLicense either MIT, or GPLv3 or later",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsCSU/CDASOR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-10T11:57:49Z",
    "license": "Other",
    "name": "CDASOR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1077",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Emerging studies indicate that circular RNAs (circRNAs) are widely involved in the progression of human diseases. Due to its special structure which is stable, circRNAs are promising diagnostic and prognostic biomarkers for diseases. However, the experimental verification of circRNA-disease associations is expensive and limited to small-scale. Effective computational methods for predicting potential circRNA-disease associations are regarded as a matter of urgency. Although several models have been proposed, over-reliance on known associations and the absence of characteristics of biological functions make precise predictions are still challenging. Results: In this study, we propose a method for predicting CircRNA-disease associations based on sequence and ontology representations, named CDASOR, with convolutional and recurrent neural networks. For sequences of circRNAs, we encode them with continuous k-mers, get low-dimensional vectors of k-mers, extract their local feature vectors with 1D CNN and learn their long-term dependencies with bi-directional long short-term memory. For diseases, we serialize disease ontology into sentences containing the hierarchy of ontology, obtain low-dimensional vectors for disease ontology terms and get terms' dependencies. Furthermore, we get association patterns of circRNAs and diseases from known circRNA-disease associations with neural networks. After the above steps, we get circRNAs' and diseases' high-level representations, which are informative to improve the prediction. The experimental results show that CDASOR provides an accurate prediction. Importing the characteristics of biological functions, CDASOR achieves impressive predictions in the de novo test. In addition, 6 of the top-10 predicted results are verified by the published literature in the case studies.",
                "authors": [
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Zeng M."
                    }
                ],
                "date": "2020-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Improving circRNA-disease association prediction by sequence and ontology representations with convolutional and recurrent neural networks"
            },
            "pmid": "33367690"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
