{
    "additionDate": "2021-01-18T08:46:09Z",
    "biotoolsCURIE": "biotools:mats",
    "biotoolsID": "mats",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tiverstr@vub.be",
            "name": "Timothy Verstraeten",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-Agent Thompson Sampling for Bandit Applications with Sparse Neighbourhood Structures.\n\nAn efficient version of MATS that was used to perform the experiments in the article titled 'Multi-Agent Thompson Sampling for Bandit Applications with Sparse Neighbourhood Structures' (https://arxiv.org/abs/1911.10120).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/timo-verstraeten/mats-experiments",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-02-20T17:18:48Z",
    "name": "MATS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41598-020-62939-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Multi-agent coordination is prevalent in many real-world applications. However, such coordination is challenging due to its combinatorial nature. An important observation in this regard is that agents in the real world often only directly affect a limited set of neighbouring agents. Leveraging such loose couplings among agents is key to making coordination in multi-agent systems feasible. In this work, we focus on learning to coordinate. Specifically, we consider the multi-agent multi-armed bandit framework, in which fully cooperative loosely-coupled agents must learn to coordinate their decisions to optimize a common objective. We propose multi-agent Thompson sampling (MATS), a new Bayesian exploration-exploitation algorithm that leverages loose couplings. We provide a regret bound that is sublinear in time and low-order polynomial in the highest number of actions of a single agent for sparse coordination graphs. Additionally, we empirically show that MATS outperforms the state-of-the-art algorithm, MAUCE, on two synthetic benchmarks, and a novel benchmark with Poisson distributions. An example of a loosely-coupled multi-agent system is a wind farm. Coordination within the wind farm is necessary to maximize power production. As upstream wind turbines only affect nearby downstream turbines, we can use MATS to efficiently learn the optimal control mechanism for the farm. To demonstrate the benefits of our method toward applications we apply MATS to a realistic wind farm control task. In this task, wind turbines must coordinate their alignments with respect to the incoming wind vector in order to optimize power production. Our results show that MATS improves significantly upon state-of-the-art coordination methods in terms of performance, demonstrating the value of using MATS in practical applications with sparse neighbourhood structures.",
                "authors": [
                    {
                        "name": "Verstraeten T."
                    },
                    {
                        "name": "Bargiacchi E."
                    },
                    {
                        "name": "Libin P.J.K."
                    },
                    {
                        "name": "Helsen J."
                    },
                    {
                        "name": "Roijers D.M."
                    },
                    {
                        "name": "Nowe A."
                    }
                ],
                "citationCount": 3,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Multi-Agent Thompson Sampling for Bandit Applications with Sparse Neighbourhood Structures"
            },
            "pmcid": "PMC7174305",
            "pmid": "32317732"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}