{
    "additionDate": "2020-01-14T09:49:30Z",
    "biotoolsCURIE": "biotools:Pneumocystis",
    "biotoolsID": "Pneumocystis",
    "confidence_flag": "tool",
    "description": "Long-read sequencing based clinical metagenomics for the detection and confirmation of Pneumocystis jirovecii directly from clinical specimens.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Yiheng323/clinical_diagnosis_of_pneumocystis.git",
    "lastUpdate": "2021-01-13T17:06:06Z",
    "license": "MIT",
    "name": "Pneumocystis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/MMY/MYZ109",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of The International Society for Human and Animal Mycology.The advent of next generation sequencing technologies has enabled the characterization of the genetic content of entire communities of organisms, including those in clinical specimens, without prior culturing. The MinION from Oxford Nanopore Technologies offers real-time, direct sequencing of long DNA fragments directly from clinical samples. The aim of this study was to assess the ability of unbiased, genome-wide, long-read, shotgun sequencing using MinION to identify Pneumocystis jirovecii directly from respiratory tract specimens and to characterize the associated mycobiome. Pneumocystis pneumonia (PCP) is a life-threatening fungal disease caused by P. jirovecii. Currently, the diagnosis of PCP relies on direct microscopic or real-time quantitative polymerase chain reaction (PCR) examination of respiratory tract specimens, as P. jirovecii cannot be cultured readily in vitro. P. jirovecii DNA was detected in bronchoalveolar lavage (BAL) and induced sputum (IS) samples from three patients with confirmed PCP. Other fungi present in the associated mycobiome included known human pathogens (Aspergillus, Cryptococcus, Pichia) as well as commensal species (Candida, Malassezia, Bipolaris). We have established optimized sample preparation conditions for the generation of high-quality data, curated databases, and data analysis tools, which are key to the application of long-read MinION sequencing leading to a fundamental new approach in fungal diagnostics.",
                "authors": [
                    {
                        "name": "Irinyi L."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Hoang M.T.V."
                    },
                    {
                        "name": "Pasic L."
                    },
                    {
                        "name": "Halliday C."
                    },
                    {
                        "name": "Jayawardena M."
                    },
                    {
                        "name": "Basu I."
                    },
                    {
                        "name": "McKinney W."
                    },
                    {
                        "name": "Morris A.J."
                    },
                    {
                        "name": "Rathjen J."
                    },
                    {
                        "name": "Stone E."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Sorrell T.C."
                    },
                    {
                        "name": "Schwessinger B."
                    },
                    {
                        "name": "Meyer W."
                    }
                ],
                "citationCount": 8,
                "date": "2019-11-23T00:00:00Z",
                "journal": "Medical Mycology",
                "title": "Long-read sequencing based clinical metagenomics for the detection and confirmation of Pneumocystis jirovecii directly from clinical specimens: A paradigm shift in mycological diagnostics"
            },
            "pmid": "31758176"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ],
    "validated": 1
}