{
    "additionDate": "2019-11-14T18:39:00Z",
    "biotoolsCURIE": "biotools:Transplant",
    "biotoolsID": "Transplant",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/Ribopeaks (COM.) | Virtual learning object in hematopoietic stem cell transplantation for autoimmune diseases | O Transplantar é um site desenvolvido para reunir pacientes, familiares, profissionais de saúde e interessados em receber orientações e informações sobre o Transplante Autólogo de Células-Tronco Hematopoéticas para doenças autoimunes. Encontre, em cada módulo, orientações de acordo com seus interesses e necessidades",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.transplantardai.com.br",
    "lastUpdate": "2019-11-14T18:39:00Z",
    "name": "Transplant",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1590/0034-7167-2018-0669",
            "metadata": {
                "abstract": "OBJECTIVE: describe the development of a virtual learning object to provide information about autologous transplantation of hematopoietic stem cells to autoimmune diseases. METHODS: methodological study of a website development, using the instructional design model that includes Analysis, Design, Development and Implementation. RESULTS: the virtual object, available at http://www.transplantardai.com.br, was developed in a web platform, in the Hypertext Markup Language, using the software WebAcappella - Responsive Website Creator (Intuisphere, France 2016). The content was structured in the modules: History, Transplant, Autoimmune Diseases, Links, Guidelines, Speech Team and Doubts. The icons and menus were created in order to attract the user, facilitating the search for information and allowing maximum use of the resources available on the website. CONCLUSION: the methodology used allowed the development of the virtual learning object, which can be used as a tool to guide and disseminate knowledge about this treatment.",
                "authors": [
                    {
                        "name": "Zombrilli A.F."
                    },
                    {
                        "name": "Leopoldo V.C."
                    },
                    {
                        "name": "Oliveira M.C."
                    },
                    {
                        "name": "Oliveira M.F.C."
                    },
                    {
                        "name": "Dolci M.E."
                    },
                    {
                        "name": "Braga F.T.M.M."
                    },
                    {
                        "name": "Silveira R.C.C.P."
                    }
                ],
                "date": "2019-08-19T00:00:00Z",
                "journal": "Revista brasileira de enfermagem",
                "title": "Virtual learning object in hematopoietic stem cell transplantation for autoimmune diseases"
            },
            "pmid": "31432957"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        }
    ]
}