{
    "accessibility": "Open access",
    "additionDate": "2016-01-17T23:16:47Z",
    "biotoolsCURIE": "biotools:dnatco",
    "biotoolsID": "dnatco",
    "collectionID": [
        "BIOCEV",
        "Czech Republic",
        "ELIXIR-CZ"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bohdan@ibt.cas.cz",
            "name": "Bohdan Schneider",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jiri.cerny@ibt.cas.cz",
            "name": "Jiří Černý",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "jiri.cerny@ibt.cas.cz",
            "name": "Jiří Černý",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "bohdan@ibt.cas.cz",
            "name": "Bohdan Schneider",
            "typeRole": [
                "Support"
            ]
        },
        {
            "name": "BIOCEV",
            "typeEntity": "Consortium"
        },
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Consortium"
        },
        {
            "name": "Bohdan Schneider",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Institute of Biotechnology AS CR, Prague, Czech Republic",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A web service providing assignment of nucleic acid conformers used in bioinformatic analysis of nucleic acids and protein/DNA interfaces.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://dnatco.datmos.org/tutorial.php"
        }
    ],
    "editPermission": {
        "authors": [
            "jirka.biotools"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA structure",
                        "uri": "http://edamontology.org/data_1464"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        },
                        {
                            "term": "mmCIF",
                            "uri": "http://edamontology.org/format_1477"
                        }
                    ]
                }
            ],
            "note": "Assignment of DNA conformers User PDB file or PDB ID Assignment of DNA conformers",
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Structural profile",
                        "uri": "http://edamontology.org/data_0889"
                    },
                    "format": [
                        {
                            "term": "JSON",
                            "uri": "http://edamontology.org/format_3464"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://dnatco.datmos.org/",
    "lastUpdate": "2021-05-24T19:57:24Z",
    "maturity": "Mature",
    "name": "DNATCO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bohdan.schneider",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa383",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.By analyzing almost 120 000 dinucleotides in over 2000 nonredundant nucleic acid crystal structures, we define 96+1 diNucleotide Conformers, NtCs, which describe the geometry of RNA and DNA dinucleotides. NtC classes are grouped into 15 codes of the structural alphabet CANA (Conformational Alphabet of Nucleic Acids) to simplify symbolic annotation of the prominent structural features of NAs and their intuitive graphical display. The search for nontrivial patterns of NtCs resulted in the identification of several types of RNA loops, some of them observed for the first time. Over 30% of the nearly six million dinucleotides in the PDB cannot be assigned to any NtC class but we demonstrate that up to a half of them can be re-refined with the help of proper refinement targets. A statistical analysis of the preferences of NtCs and CANA codes for the 16 dinucleotide sequences showed that neither the NtC class AA00, which forms the scaffold of RNA structures, nor BB00, the DNA most populated class, are sequence neutral but their distributions are significantly biased. The reported automated assignment of the NtC classes and CANA codes available at dnatco.org provides a powerful tool for unbiased analysis of nucleic acid structures by structural and molecular biologists.",
                "authors": [
                    {
                        "name": "Bozikova P."
                    },
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Svoboda J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A unified dinucleotide alphabet describing both RNA and DNA structures"
            }
        },
        {
            "doi": "10.1107/S2059798320009389",
            "metadata": {
                "abstract": "© 2020 International Union of Crystallography. All rights reserved.A detailed description of the dnatco.datmos.org web server implementing the universal structural alphabet of nucleic acids is presented. It is capable of processing any mmCIF-or PDB-formatted files containing DNA or RNA molecules; these can either be uploaded by the user or supplied as the wwPDB or PDB-REDO structural database access code. The web server performs an assignment of the nucleic acid conformations and presents the results for the intuitive annotation, validation, modeling and refinement of nucleic acids.",
                "authors": [
                    {
                        "name": "Biedermannova L."
                    },
                    {
                        "name": "Bozikova P."
                    },
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Michal Maly"
                    },
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Tykac M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "Structural alphabets for conformational analysis of nucleic acids available at dnatco.datmos.org"
            }
        },
        {
            "doi": "10.1093/nar/gkn260",
            "metadata": {
                "abstract": "The geometry of the phosphodiester backbone was analyzed for 7739 dinucleotides from 447 selected crystal structures of naked and complexed DNA. Ten torsion angles of a near-dinucleotide unit have been studied by combining Fourier averaging and clustering. Besides the known variants of the A-, B- and Z-DNA forms, we have also identified combined A + B backbone-deformed conformers, e.g. with α/γ switches, and a few conformers with a syn orientation of bases occurring e.g. in G-quadruplex structures. A plethora of A- and B-like conformers show a close relationship between the A- and B-form double helices. A comparison of the populations of the conformers occurring in naked and complexed DNA has revealed a significant broadening of the DNA conformational space in the complexes, but the conformers still remain within the limits defined by the A- and B- forms. Possible sequence preferences, important for sequence-dependent recognition, have been assessed for the main A and B conformers by means of statistical goodness-of-fit tests. The structural properties of the backbone in quadruplexes, junctions and histone-core particles are discussed in further detail. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Kalina J."
                    },
                    {
                        "name": "Omelka M."
                    },
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Svozil D."
                    }
                ],
                "citationCount": 129,
                "date": "2008-06-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DNA conformations and their sequence preferences"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gkw381",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.The web service DNATCO (dnatco.org) classifies local conformations of DNA molecules beyond their traditional sorting to A, B and Z DNA forms. DNATCO provides an interface to robust algorithms assigning conformation classes called NTC: to dinucleotides extracted from DNA-containing structures uploaded in PDB format version 3.1 or above. The assigned dinucleotide NTC: classes are further grouped into DNA structural alphabet NTA: , to the best of our knowledge the first DNA structural alphabet. The results are presented at two levels: in the form of user friendly visualization and analysis of the assignment, and in the form of a downloadable, more detailed table for further analysis offline. The website is free and open to all users and there is no login requirement.",
                "authors": [
                    {
                        "name": "Bozikova P."
                    },
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Schneider B."
                    }
                ],
                "citationCount": 8,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "DNATCO: assignment of DNA conformers at dnatco.org"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1107/S2059798318000050",
            "metadata": {
                "abstract": "© Schneider et al. 2018.DNA is a structurally plastic molecule, and its biological function is enabled by adaptation to its binding partners. To identify the DNA structural polymorphisms that are possible in such adaptations, the dinucleotide structures of 60 000 DNA steps from sequentially nonredundant crystal structures were classified and an automated protocol assigning 44 distinct structural (conformational) classes called NtC (for Nucleotide Conformers) was developed. To further facilitate understanding of the DNA structure, the NtC were assembled into the DNA structural alphabet CANA (Conformational Alphabet of Nucleic Acids) and the projection of CANA onto the graphical representation of the molecular structure was proposed. The NtC classification was used to define a validation score called confal, which quantifies the conformity between an analyzed structure and the geometries of NtC. NtC and CANA assignment were applied to analyze the structural properties of typical DNA structures such as Dickerson-Drew dodecamers, guanine quadruplexes and structural models based on fibre diffraction. NtC, CANA and confal assignment, which is accessible at the website https://dnatco.org, allows the quantitative assessment and validation of DNA structures and their subsequent analysis by means of pseudo-sequence alignment. An animated Interactive 3D Complement (I3DC) is available in Proteopedia at http://proteopedia.org/w/Journal:Acta-Cryst-D:2.",
                "authors": [
                    {
                        "name": "Bozikova P."
                    },
                    {
                        "name": "Cech P."
                    },
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Necasova I."
                    },
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Svozil D."
                    }
                ],
                "citationCount": 8,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "A DNA structural alphabet provides new insight into DNA flexibility"
            },
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.3390/genes8100278",
            "metadata": {
                "abstract": "© 2017, MDPI AG. All rights reserved.We analyzed the structural behavior of DNA complexed with regulatory proteins and the nucleosome core particle (NCP). The three-dimensional structures of almost 25 thousand dinucleotide steps from more than 500 sequentially non-redundant crystal structures were classified by using DNA structural alphabet CANA (Conformational Alphabet of Nucleic Acids) and associations between ten CANA letters and sixteen dinucleotide sequences were investigated. The associations showed features discriminating between specific and non-specific binding of DNA to proteins. Important is the specific role of two DNA structural forms, A-DNA, and BII-DNA, represented by the CANA letters AAA and BB2: AAA structures are avoided in non-specific NCP complexes, where the wrapping of the DNA duplex is explained by the periodic occurrence of BB2 every 10.3 steps. In both regulatory and NCP complexes, the extent of bending of the DNA local helical axis does not influence proportional representation of the CANA alphabet letters, namely the relative incidences of AAA and BB2 remain constant in bent and straight duplexes.",
                "authors": [
                    {
                        "name": "Bozikova P."
                    },
                    {
                        "name": "Cech P."
                    },
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Svozil D."
                    }
                ],
                "citationCount": 6,
                "date": "2017-10-18T00:00:00Z",
                "journal": "Genes",
                "title": "A DNA structural alphabet distinguishes structural features of DNA bound to regulatory proteins and in the nucleosome core particle"
            },
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "v3.2"
    ]
}
