{
    "additionDate": "2017-01-17T15:03:36Z",
    "biotoolsCURIE": "biotools:pqsfinder",
    "biotoolsID": "pqsfinder",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jiri.hon@gmail.com",
            "name": "Jiri Hon",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The main functionality of the this package is to detect DNA sequence patterns that are likely to fold into an intramolecular G-quadruplex (G4). Unlike many other approaches, this package is able to detect sequences responsible for G4s folded from imperfect G-runs containing bulges or mismatches and as such is more sensitive than competing algorithms.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/pqsfinder.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://bioconductor.org/packages/release/bioc/html/pqsfinder.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quadruplex formation site detection",
                    "uri": "http://edamontology.org/operation_0429"
                },
                {
                    "term": "Nucleosome position prediction",
                    "uri": "http://edamontology.org/operation_0432"
                },
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                }
            ]
        }
    ],
    "homepage": "https://pqsfinder.fi.muni.cz",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-14T10:20:18Z",
    "license": "BSD-4-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/html/pqsfinder.html"
        }
    ],
    "name": "pqsfinder",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx413",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.comMotivation: G-quadruplexes (G4s) are one of the non-B DNA structures easily observed in vitro and assumed to form in vivo. The latest experiments with G4-specific antibodies and G4-unwinding helicase mutants confirm this conjecture. These four-stranded structures have also been shown to influence a range of molecular processes in cells. As G4s are intensively studied, it is often desirable to screen DNA sequences and pinpoint the precise locations where they might form.Results: We describe and have tested a newly developed Bioconductor package for identifying potential quadruplex-forming sequences (PQS). The package is easy-to-use, flexible and customizable. It allows for sequence searches that accommodate possible divergences from the optimal G4 base composition. A novel aspect of our research was the creation and training (parametrization) of an advanced scoring model which resulted in increased precision compared to similar tools. We demonstrate that the algorithm behind the searches has a 96% accuracy on 392 currently known and experimentally observed G4 structures. We also carried out searches against the recent G4-seq data to verify how well we can identify the structures detected by that technology. The correlation with pqsfinder predictions was 0.622, higher than the correlation 0.491 obtained with the second best G4Hunter.Availability and implementation: http://bioconductor.org/packages/pqsfinder/ This paper is based on pqsfinder-1.4.1.Contact: lexa@fi.muni.cz.Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Hon J."
                    },
                    {
                        "name": "Martinek T."
                    },
                    {
                        "name": "Zendulka J."
                    },
                    {
                        "name": "Lexa M."
                    }
                ],
                "citationCount": 37,
                "date": "2017-11-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "pqsfinder: an exhaustive and imperfection-tolerant search tool for potential quadruplex-forming sequences in R"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ928",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: G-quadruplex is a DNA or RNA form in which four guanine-rich regions are held together by base pairing between guanine nucleotides in coordination with potassium ions. G-quadruplexes are increasingly seen as a biologically important component of genomes. Their detection in vivo is problematic; however, sequencing and spectrometric techniques exist for their in vitro detection. We previously devised the pqsfinder algorithm for PQS identification, implemented it in C and published as an R/Bioconductor package. We looked for ways to optimize pqsfinder for faster and user-friendly sequence analysis. Results: We identified two weak points where pqsfinder could be optimized. We modified the internals of the recursive algorithm to avoid matching and scoring many sub-optimal PQS conformations that are later discarded. To accommodate the needs of a broader range of users, we created a website for submission of sequence analysis jobs that does not require knowledge of R to use pqsfinder.",
                "authors": [
                    {
                        "name": "Labudova D."
                    },
                    {
                        "name": "Hon J."
                    },
                    {
                        "name": "Lexa M."
                    },
                    {
                        "name": "Lexa M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Pqsfinder web: G-quadruplex prediction using optimized pqsfinder algorithm"
            },
            "pmid": "31830256",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "2.6"
    ]
}