{
    "additionDate": "2017-01-17T15:03:19Z",
    "biotoolsCURIE": "biotools:gsca",
    "biotoolsID": "gsca",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "zji4@jhu.edu",
            "name": "Zhicheng Ji",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This tool takes as input several lists of activated and repressed genes. It then searches through a compendium of publicly available gene expression profiles for biological contexts that are enriched with a specified pattern of gene expression. Finally, it provides both traditional R functions and an interactive, user-friendly interface.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/GSCA.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GSCA_2.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/GSCA.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T01:21:52Z",
    "license": "GPL-2.0",
    "name": "GSCA",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkv873",
            "metadata": {
                "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research.Gene Set Context Analysis (GSCA) is an open source software package to help researchers use massive amounts of publicly available gene expression data (PED) to make discoveries. Users can interactively visualize and explore gene and gene set activities in 25,000+ consistently normalized human and mouse gene expression samples representing diverse biological contexts (e.g. different cells, tissues and disease types, etc.). By providing one or multiple genes or gene sets as input and specifying a gene set activity pattern of interest, users can query the expression compendium to systematically identify biological contexts associated with the specified gene set activity pattern. In this way, researchers with new gene sets from their own experiments may discover previously unknown contexts of gene set functions and hence increase the value of their experiments. GSCA has a graphical user interface (GUI). The GUI makes the analysis convenient and customizable. Analysis results can be conveniently exported as publication quality figures and tables. GSCA is available at https://github.com/zji90/GSCA. This software significantly lowers the bar for biomedical investigators to use PED in their daily research for generating and screening hypotheses, which was previously difficult because of the complexity, heterogeneity and size of the data.",
                "authors": [
                    {
                        "name": "Dang C.V."
                    },
                    {
                        "name": "Ji H."
                    },
                    {
                        "name": "Ji Z."
                    },
                    {
                        "name": "Vokes S.A."
                    }
                ],
                "citationCount": 3,
                "date": "2016-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Turning publicly available gene expression data into discoveries using gene set context analysis"
            },
            "pmcid": "PMC4705686",
            "pmid": "26350211",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1,
    "version": [
        "2.4.0"
    ]
}
