{
    "additionDate": "2020-01-13T06:46:36Z",
    "biotoolsCURIE": "biotools:THESIAS",
    "biotoolsID": "THESIAS",
    "credit": [
        {
            "email": "david-alexandre.tregouet@inserm.fr",
            "name": "David-Alexandre Trégouët"
        }
    ],
    "description": "Testing Haplotype Effects In Association Studies",
    "download": [
        {
            "type": "Binaries",
            "url": "https://github.com/daissi/thesias/releases/download/3.1/ThesiasPackage.zip",
            "version": "3.1"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/daissi/thesias",
    "language": [
        "Java",
        "C"
    ],
    "lastUpdate": "2020-01-13T07:59:02Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "THESIAS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Dybian",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm058",
            "metadata": {
                "abstract": "Summary: THESIAS (Testing Haplotype EffectS In Association Studies) is a popular software for carrying haplotype association analysis in unrelated individuals. In addition to the command line interface, a graphical JAVA interface is now proposed allowing one to run THESIAS in a user-friendly manner. Besides, new functionalities have been added to THESIAS including the possibility to analyze polychotomous phenotype and X-linked polymorphisms. © The Author 2007. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Tregouet D.A."
                    },
                    {
                        "name": "Garelle V."
                    }
                ],
                "citationCount": 204,
                "date": "2007-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A new JAVA interface implementation of THESIAS: Testing haplotype effects in association studies"
            }
        },
        {
            "doi": "10.1038/sj.ejhg.5201238",
            "metadata": {
                "abstract": "It is now widely recognized that haplotype information inferred from genotypes can be of great interest to better characterize the role of a candidate gene in the etiology of a complex trait in the context of association studies. Several works have recently advocated the simultaneous estimation of haplotype frequencies and haplotype effects in order to get a better efficiency in parameter estimation. Most of the available models can deal with a binary or a quantitative phenotype, but none has yet discussed the application of haplotype-based association analysis to a survival outcome. We describe how the recently proposed Stochastic-EM (SEM) algorithm can be applied to estimate haplotype effects in censored data analysis using a standard Cox proportional hazards formulation. This model has been implemented in the THESIAS software freely available at http://www.genecanvas.org. © 2004 Nature Publishing Group. All rights reserved.",
                "authors": [
                    {
                        "name": "Tregouet D.-A."
                    },
                    {
                        "name": "Tiret L."
                    }
                ],
                "citationCount": 55,
                "date": "2004-11-01T00:00:00Z",
                "journal": "European Journal of Human Genetics",
                "title": "Cox proportional hazards survival regression in haplotype-based association analysis using the Stochastic-EM algorithm"
            }
        },
        {
            "doi": "10.1093/hmg/11.17.2015"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ],
    "version": [
        "3.1"
    ]
}