{
    "additionDate": "2020-01-13T06:46:36Z",
    "biotoolsCURIE": "biotools:THESIAS",
    "biotoolsID": "THESIAS",
    "credit": [
        {
            "email": "david-alexandre.tregouet@inserm.fr",
            "name": "David-Alexandre Trégouët"
        }
    ],
    "description": "Testing Haplotype Effects In Association Studies",
    "download": [
        {
            "type": "Binaries",
            "url": "https://github.com/daissi/thesias/releases/download/3.1/ThesiasPackage.zip",
            "version": "3.1"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/daissi/thesias",
    "language": [
        "Java",
        "C"
    ],
    "lastUpdate": "2020-01-13T07:59:02Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "THESIAS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Dybian",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm058",
            "metadata": {
                "abstract": "Summary: THESIAS (Testing Haplotype EffectS In Association Studies) is a popular software for carrying haplotype association analysis in unrelated individuals. In addition to the command line interface, a graphical JAVA interface is now proposed allowing one to run THESIAS in a user-friendly manner. Besides, new functionalities have been added to THESIAS including the possibility to analyze polychotomous phenotype and X-linked polymorphisms. © The Author 2007. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Tregouet D.A."
                    },
                    {
                        "name": "Garelle V."
                    }
                ],
                "citationCount": 211,
                "date": "2007-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A new JAVA interface implementation of THESIAS: Testing haplotype effects in association studies"
            }
        },
        {
            "doi": "10.1038/sj.ejhg.5201238",
            "metadata": {
                "abstract": "It is now widely recognized that haplotype information inferred from genotypes can be of great interest to better characterize the role of a candidate gene in the etiology of a complex trait in the context of association studies. Several works have recently advocated the simultaneous estimation of haplotype frequencies and haplotype effects in order to get a better efficiency in parameter estimation. Most of the available models can deal with a binary or a quantitative phenotype, but none has yet discussed the application of haplotype-based association analysis to a survival outcome. We describe how the recently proposed Stochastic-EM (SEM) algorithm can be applied to estimate haplotype effects in censored data analysis using a standard Cox proportional hazards formulation. This model has been implemented in the THESIAS software freely available at http://www.genecanvas.org. © 2004 Nature Publishing Group. All rights reserved.",
                "authors": [
                    {
                        "name": "Tregouet D.-A."
                    },
                    {
                        "name": "Tiret L."
                    }
                ],
                "citationCount": 56,
                "date": "2004-11-01T00:00:00Z",
                "journal": "European Journal of Human Genetics",
                "title": "Cox proportional hazards survival regression in haplotype-based association analysis using the Stochastic-EM algorithm"
            }
        },
        {
            "doi": "10.1093/hmg/11.17.2015",
            "metadata": {
                "abstract": "P-selectin is a cellular adhesion molecule that may be involved in the development of atherosclerosis and its complications. We have previously identified thirteen polymorphisms of the P-selectin gene among which five were located in the coding region of the gene (S290N, N562D, V599L, T715P, T741T (A/G)). These polymorphisms were tested individually for association with myocardial infarction (MI) and only the T715P polymorphism was shown to be associated with MI. We here extend this work by performing a haplotype analysis which enables us to assess the consequences on the phenotype of the co-presence of several variants on the same chromosome. For this purpose, a new maximum likelihood method was developed for estimating simultaneously haplotype frequencies and haplotype-phenotype effects. While haplotypes defined by the polymorphisms located in the promoter region of the gene were unrelated to MI, those defined by the polymorphisms in the coding region were globally associated with MI in a sample of 582 cases and 630 controls from the Etude Cas-Témoin sur l'Infarctus du Myocarde. Detailed haplotype analysis confirmed the protective effect of the P715 allele but additionally revealed that the presence of two asparagine codons at sites S29ON and N562D was associated with a higher risk of MI, consistenly in France and Northern Ireland, but only when they were carried by the same haplotype. This finding illustrates the complexity of the relationship between gene variability and disease and the necessity to explore in detail the polymorphisms of candidate genes.",
                "authors": [
                    {
                        "name": "Tregouet D.-A."
                    },
                    {
                        "name": "Barbaux S."
                    },
                    {
                        "name": "Escolano S."
                    },
                    {
                        "name": "Tahri N."
                    },
                    {
                        "name": "Golmard J.-L."
                    },
                    {
                        "name": "Tiret L."
                    },
                    {
                        "name": "Cambien F."
                    }
                ],
                "citationCount": 159,
                "date": "2002-08-15T00:00:00Z",
                "journal": "Human Molecular Genetics",
                "title": "Specific haplotypes of the P-selectin gene are associated with myocardial infarction"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ],
    "validated": 1,
    "version": [
        "3.1"
    ]
}