{
    "additionDate": "2021-01-18T11:58:35Z",
    "biotoolsCURIE": "biotools:msbmf",
    "biotoolsID": "msbmf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational drug repositioning based on multi-similarities bilinear matrix factorization.\n\nBased on multiple similarities of drug and disease, we propose a Multi-Similarities Bilinear Matrix Factorization algorithm to identify potential novel indications for known or novel drugs. The code of MSBMF in this package is implemented in Matlab2014a.\n\nAn international forum for researchers and educators in the life sciences, covering genetic studies of phenotypes and genotypes, DNA sequencing, expression prof.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsCSU/MSBMF",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-18T09:55:07Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BioinformaticsCSU/MSBMF"
        }
    ],
    "name": "MSBMF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA267",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.With the development of high-throughput technology and the accumulation of biomedical data, the prior information of biological entity can be calculated from different aspects. Specifically, drug-drug similarities can be measured from target profiles, drug-drug interaction and side effects. Similarly, different methods and data sources to calculate disease ontology can result in multiple measures of pairwise disease similarities. Therefore, in computational drug repositioning, developing a dynamic method to optimize the fusion process of multiple similarities is a crucial and challenging task. In this study, we propose a multi-similarities bilinear matrix factorization (MSBMF) method to predict promising drug-associated indications for existing and novel drugs. Instead of fusing multiple similarities into a single similarity matrix, we concatenate these similarity matrices of drug and disease, respectively. Applying matrix factorization methods, we decompose the drug-disease association matrix into a drug-feature matrix and a disease-feature matrix. At the same time, using these feature matrices as basis, we extract effective latent features representing the drug and disease similarity matrices to infer missing drug-disease associations. Moreover, these two factored matrices are constrained by non-negative factorization to ensure that the completed drug-disease association matrix is biologically interpretable. In addition, we numerically solve the MSBMF model by an efficient alternating direction method of multipliers algorithm. The computational experiment results show that MSBMF obtains higher prediction accuracy than the state-of-the-art drug repositioning methods in cross-validation experiments. Case studies also demonstrate the effectiveness of our proposed method in practical applications. Availability: The data and code of MSBMF are freely available at https://github.com/BioinformaticsCSU/MSBMF. Corresponding author: Jianxin Wang, School of Computer Science and Engineering, Central South University, Changsha, Hunan 410083, P. R. China. E-mail: jxwang@mail.csu.edu.cn Supplementary Data: Supplementary data are available online at https://academic.oup.com/bib.",
                "authors": [
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Wu G."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Computational drug repositioning based on multi-similarities bilinear matrix factorization"
            },
            "pmid": "33147616"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        }
    ]
}