{
    "accessibility": "Open access",
    "additionDate": "2023-01-08T15:27:21.005340Z",
    "biotoolsCURIE": "biotools:coadti",
    "biotoolsID": "coadti",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kc.w@cityu.edu.hk",
            "name": "Xiangtao Li",
            "typeEntity": "Person"
        },
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Ka-Chun Wong",
            "typeEntity": "Person"
        }
    ],
    "description": "A multi-modal co-attention based framework for drug-target interaction annotation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Layne-Huang/CoaDTI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:13:53.414143Z",
    "license": "Apache-2.0",
    "name": "CoaDTI",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbac446",
            "metadata": {
                "abstract": "Motivation: The identification of drug-target interactions (DTIs) plays a vital role for in silico drug discovery, in which the drug is the chemical molecule, and the target is the protein residues in the binding pocket. Manual DTI annotation approaches remain reliable; however, it is notoriously laborious and time-consuming to test each drug-target pair exhaustively. Recently, the rapid growth of labelled DTI data has catalysed interests in high-throughput DTI prediction. Unfortunately, those methods highly rely on the manual features denoted by human, leading to errors. Results: Here, we developed an end-to-end deep learning framework called CoaDTI to significantly improve the efficiency and interpretability of drug target annotation. CoaDTI incorporates the Co-attention mechanism to model the interaction information from the drug modality and protein modality.In particular, CoaDTI incorporates transformer to learn the protein representations from raw amino acid sequences, and GraphSage to extract the molecule graph features from SMILES. Furthermore, we proposed to employ the transfer learning strategy to encode protein features by pre-trained transformer to address the issue of scarce labelled data. The experimental results demonstrate that CoaDTI achieves competitive performance on three public datasets compared with state-of-the-art models. In addition, the transfer learning strategy further boosts the performance to an unprecedented level. The extended study reveals that CoaDTI can identify novel DTIs such as reactions between candidate drugs and severe acute respiratory syndrome coronavirus 2-associated proteins. The visualization of co-attention scores can illustrate the interpretability of our model for mechanistic insights. Availability: Source code are publicly available at https://github.com/Layne-Huang/CoaDTI.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Liu R."
                    },
                    {
                        "name": "Meng L."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Zheng Z."
                    }
                ],
                "citationCount": 29,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "CoaDTI: multi-modal co-attention based framework for drug-target interaction annotation"
            },
            "pmid": "36274236"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
