{
    "additionDate": "2021-01-18T10:27:23Z",
    "biotoolsCURIE": "biotools:msk-kp",
    "biotoolsID": "msk-kp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kiel@hsl.harvard.edu",
            "name": "Douglas P Kiel MD, MPH",
            "typeEntity": "Person"
        }
    ],
    "description": "Making Omics Data Useful to the Broader Scientific Community.\n\nMetabolic Disorders Knowledge Portal.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MSK-KP'",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://mskkp.org/",
    "lastUpdate": "2024-11-24T20:40:53.027513Z",
    "name": "MSK-KP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/jbmr.4147",
            "metadata": {
                "abstract": "The development of high-throughput genotyping technologies and large biobank collections, complemented with rapid methodological advances in statistical genetics, has enabled hypothesis-free genome-wide association studies (GWAS), which have identified hundreds of genetic variants across many loci associated with musculoskeletal conditions. Similarly, basic scientists have valuable molecular cellular and animal data based on musculoskeletal disease that would be enhanced by being able to determine the human translation of their findings. By integrating these large-scale human genomic musculoskeletal datasets with complementary evidence from model organisms, new and existing genetic loci can be statistically fine-mapped to plausibly causal variants, candidate genes, and biological pathways. Genes and pathways identified using this approach can be further prioritized as drug targets, including side-effect profiling and the potential for new indications. To bring together these big data, and to realize the vision of creating a knowledge portal, the International Federation of Musculoskeletal Research Societies (IFMRS) established a working group to collaborate with scientists from the Broad Institute to create the Musculoskeletal Knowledge Portal (MSK-KP)(http://mskkp.org/). The MSK consolidates omics datasets from humans, cellular experiments, and model organisms into a central repository that can be accessed by researchers. The vision of the MSK-KP is to enable better understanding of the biological mechanisms underlying musculoskeletal disease and apply this knowledge to identify and develop new disease interventions. © 2020 American Society for Bone and Mineral Research (ASBMR).",
                "authors": [
                    {
                        "name": "Bonewald L."
                    },
                    {
                        "name": "Burtt N."
                    },
                    {
                        "name": "Duncan E.L."
                    },
                    {
                        "name": "Flannick J."
                    },
                    {
                        "name": "Imai Y."
                    },
                    {
                        "name": "Karasik D."
                    },
                    {
                        "name": "Kemp J.P."
                    },
                    {
                        "name": "Kiel D.P."
                    },
                    {
                        "name": "Muller R."
                    },
                    {
                        "name": "Rivadeneira F."
                    },
                    {
                        "name": "Westendorf J.J."
                    }
                ],
                "citationCount": 23,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Journal of Bone and Mineral Research",
                "title": "The Musculoskeletal Knowledge Portal: Making Omics Data Useful to the Broader Scientific Community"
            },
            "pmcid": "PMC8114232",
            "pmid": "32777102"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}
