{"credit":[],"function":[{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Agricultural science","uri":"http://edamontology.org/topic_3810"}]},"publication":[{"abstract":"© 2019 John Wiley & Sons LtdConservation genetics is a well-established scientific field. However, limited information transfer between science and practice continues to hamper successful implementation of scientific knowledge in conservation practice and management. To mitigate this challenge, we have established a conservation genetics community, which entails an international exchange-and-skills platform related to genetic methods and approaches in conservation management. First, it allows for scientific exchange between researchers during annual conferences. Second, personal contact between conservation professionals and scientists is fostered by organising workshops and by popularising knowledge on conservation genetics methods and approaches in professional journals in national languages. Third, basic information on conservation genetics has been made accessible by publishing an easy-to-read handbook on conservation genetics for practitioners. Fourth, joint projects enabled practitioners and scientists to work closely together from the start of a project in order to establish a tight link between applied questions and scientific background. Fifth, standardised workflows simplifying the implementation of genetic tools in conservation management have been developed. By establishing common language and trust between scientists and practitioners, all these measures help conservation genetics to play a more prominent role in future conservation planning and management.","authors":["Holderegger R.","Balkenhol N.","Bolliger J.","Engler J.O.","Gugerli F.","Hochkirch A.","Nowak C.","Segelbacher G.","Widmer A.","Zachos F.E."],"cit_count":1,"doi":"10.1111/MEC.15202","journal":"Molecular Ecology","pmid":"31392753","title":"Conservation genetics: Linking science with practice","year":"2019-09-01"}],"summary":{"biotoolsCURIE":"biotools:conservation_genetics","biotoolsID":"conservation_genetics","description":"> LOW CONFIDENCE! | Linking science with practice | 3rd Annual Meeting in Conservation Genetics 2018 – at the Natural History Museum Vienna | 3rd Annual Meeting in Conservation Genetics 2018 | at the Natural History Museum Vienna | on behalf of the scientific committee we invite you to the 3rd Annual Meeting in Conservation Genetics which will be held from 26-28 February 2018 at the Natural History Museum Vienna. Your contributions will inform on exciting conservation genetic research and emerging new developments. Our objectives are to provide a platform for personal exchange for scientists, practitioners and stakeholders interested in conservation genetics and to establish a network in conservation genetics in Central Europe and beyond. Keynotes will be given by renowned scientists from within the European conservation genetic community","homepage":"https://consgen18.nhm-wien.ac.at/","name":"conservation genetics"}}