{
    "additionDate": "2019-11-14T17:59:51Z",
    "biotoolsCURIE": "biotools:PRAS",
    "biotoolsID": "PRAS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhengqing.ouyang@jax.org",
            "name": "Zhengqing Ouyang",
            "orcidid": "https://orcid.org/0000-0003-2842-8503",
            "typeEntity": "Person"
        }
    ],
    "description": "> HOMEPAGE BROKEN! | Predicting functional targets of RNA binding proteins based on CLIP-seq peaks | RNA-protein interaction plays important roles in post-transcriptional regulation. Recent advancements in cross-linking and immunoprecipitation followed by sequencing (CLIP-seq) technologies make it possible to detect the binding peaks of a given RNA binding protein (RBP) at transcriptome scale. However, it is still challenging to predict the functional consequences of RBP binding peaks. In this study, we propose the Protein-RNA Association Strength (PRAS), which integrates the intensities and positions of the binding peaks of RBPs for functional mRNA targets prediction. We illustrate the superiority of PRAS over existing approaches on predicting the functional targets of two related but divergent CELF (CUGBP, ELAV-like factor) RBPs in mouse brain and muscle",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ouyang-lab/PRAS",
    "lastUpdate": "2020-12-05T14:59:13.766471Z",
    "name": "PRAS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007227",
            "metadata": {
                "abstract": "© 2019 Lin et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.RNA-protein interaction plays important roles in post-transcriptional regulation. Recent advancements in cross-linking and immunoprecipitation followed by sequencing (CLIP-seq) technologies make it possible to detect the binding peaks of a given RNA binding protein (RBP) at transcriptome scale. However, it is still challenging to predict the functional consequences of RBP binding peaks. In this study, we propose the Protein-RNA Association Strength (PRAS), which integrates the intensities and positions of the binding peaks of RBPs for functional mRNA targets prediction. We illustrate the superiority of PRAS over existing approaches on predicting the functional targets of two related but divergent CELF (CUGBP, ELAV-like factor) RBPs in mouse brain and muscle. We also demonstrate the potential of PRAS for wide adoption by applying it to the enhanced CLIP-seq (eCLIP) datasets of 37 RNA decay related RBPs in two human cell lines. PRAS can be utilized to investigate any RBPs with available CLIP-seq peaks. PRAS is freely available at http://ouyanglab.jax.org/pras/.",
                "authors": [
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Frankel W.N."
                    },
                    {
                        "name": "Ouyang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "PRAS: Predicting functional targets of RNA binding proteins based on CLIP-seq peaks"
            },
            "pmcid": "PMC6716675",
            "pmid": "31425505"
        }
    ],
    "topic": [
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}