{"credit":[{"email":"jean-christophe.gelly@univ-paris-diderot.fr","name":"Jean-Christophe Gelly","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.dsimb.inserm.fr/dsimb_tools/peeling3/about.html"}],"function":[{"operation":[{"term":"Protein peeling","uri":"http://edamontology.org/operation_0390"},{"term":"Protein secondary structure comparison","uri":"http://edamontology.org/operation_2488"},{"term":"Protein fold recognition","uri":"http://edamontology.org/operation_0303"},{"term":"Protein secondary structure analysis","uri":"http://edamontology.org/operation_2416"},{"term":"Protein secondary structure prediction","uri":"http://edamontology.org/operation_0267"}]}],"labels":{"language":["R","Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Protein secondary structure","uri":"http://edamontology.org/topic_3542"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"publication":[{"abstract":"Motivation: The object of this study is to propose a new method to identify small compact units that compose protein three-dimensional structures. These fragments, called 'protein units (PU)', are a new level of description to well understand and analyze the organization of protein structures. The method only works from the contact probability matrix, i.e. the inter Cα-distances translated into probabilities. It uses the principle of conventional hierarchical clustering, leading to a series of nested partitions of the 3D structure. Every step aims at dividing optimally a unit into 2 or 3 subunits according to a criterion called 'partition index' assessing the structural independence of the subunits newly defined. Moreover, an entropy-derived squared correlation R is used for assessing globally the protein structure dissection. The method is compared to other splitting algorithms and shows relevant performance. © The Author 2005. Published by Oxford University Press. All rights reserved.","authors":["Gelly J.-C.","de Brevern A.G.","Hazout S."],"cit_count":22,"journal":"Bioinformatics","pmid":"16301202","title":"'Protein peeling': An approach for splitting a 3D protein structure into compact fragments","year":"2006-01-15"},{"abstract":"Protein Peeling 2 (PP2) is a web server for the automatic identification of protein units (PUs) given the 3D coordinates of a protein. PUs are an intermediate level of protein structure description between protein domains and secondary structures. It is a new tool to better understand and analyze the organization of protein structures. PP2 uses only the matrices of protein contact probabilities and cuts the protein structures optimally using Matthews' coefficient correlation. An index assesses the compactness quality of each PU. Results are given both textually and graphically using JMol and PyMol softwares. The server can be accessed from http://www.ebgm.jussieu.fr/~gelly/index.html. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Gelly J.C.","Etchebest C.","Hazout S.","de Brevern A.G."],"cit_count":11,"journal":"Nucleic Acids Research","pmid":"16845113","title":"Protein Peeling 2: A web server to convert protein structures into series of protein units","year":"2006-07-01"},{"abstract":"Summary: We present an improved version of our Protein Peeling web server dedicated to the analysis of protein structure architecture through the identification of protein units produced by an iterative splitting algorithm. New features include identification of structural domains, detection of unstructured terminal elements and evaluation of the stability of protein unit structures. © The Author 2010. Published by Oxford University Press. All rights reserved.","authors":["Gelly J.-C.","de Brevern A.G."],"cit_count":6,"journal":"Bioinformatics","pmid":"21075745","title":"Protein peeling 3D: New tools for analyzing protein structures","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:protein_peeling_3_d","biotoolsID":"protein_peeling_3_d","description":"Approach for splitting a protein three dimensional (3D) structure into protein units, an intermediate level of protein structure description between protein domains and secondary structures.","homepage":"http://www.dsimb.inserm.fr/dsimb_tools/peeling3/","name":"Protein Peeling 3 D"}}