{
    "additionDate": "2017-08-03T18:46:19Z",
    "biotoolsCURIE": "biotools:haptree",
    "biotoolsID": "haptree",
    "credit": [
        {
            "email": "bab@mit.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://people.csail.mit.edu/bab/"
        }
    ],
    "description": "Polyploid haplotype assembly tool based on a statistical framework.",
    "documentation": [
        {
            "type": "General",
            "url": "http://cb.csail.mit.edu/cb/haptree/README_HapTree_v1.0.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://groups.csail.mit.edu/cb/haptree/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/haptree-0-1-polyploid-haplotype-assembly-tool.html"
        }
    ],
    "name": "HapTree",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "As the more recent next-generation sequencing (NGS) technologies provide longer read sequences, the use of sequencing datasets for complete haplotype phasing is fast becoming a reality, allowing haplotype reconstruction of a single sequenced genome. Nearly all previous haplotype reconstruction studies have focused on diploid genomes and are rarely scalable to genomes with higher ploidy. Yet computational investigations into polyploid genomes carry great importance, impacting plant, yeast and fish genomics, as well as the studies of the evolution of modern-day eukaryotes and (epi)genetic interactions between copies of genes. In this paper, we describe a novel maximum-likelihood estimation framework, HapTree, for polyploid haplotype assembly of an individual genome using NGS read datasets. We evaluate the performance of HapTree on simulated polyploid sequencing read data modeled after Illumina sequencing technologies. For triploid and higher ploidy genomes, we demonstrate that HapTree substantially improves haplotype assembly accuracy and efficiency over the state-of-the-art; moreover, HapTree is the first scalable polyplotyping method for higher ploidy. As a proof of concept, we also test our method on real sequencing data from NA12878 (1000 Genomes Project) and evaluate the quality of assembled haplotypes with respect to trio-based diplotype annotation as the ground truth. The results indicate that HapTree significantly improves the switch accuracy within phased haplotype blocks as compared to existing haplotype assembly methods, while producing comparable minimum error correction (MEC) values. A summary of this paper appears in the proceedings of the RECOMB 2014 conference, April 2-5. © 2014 Berger et al.",
                "authors": [
                    {
                        "name": "Berger E."
                    },
                    {
                        "name": "Yorukoglu D."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Berger B."
                    }
                ],
                "citationCount": 26,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "HapTree: A Novel Bayesian Framework for Single Individual Polyplotyping Using NGS Data"
            },
            "pmid": "24675685"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}