{
    "additionDate": "2021-01-18T09:17:36Z",
    "biotoolsCURIE": "biotools:3d-gnome",
    "biotoolsID": "3d-gnome",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "d.plewczynski@cent.uw.edu.pl",
            "name": "Dariusz Plewczynski",
            "typeEntity": "Person"
        }
    ],
    "description": "3D chromatin organization webserver is a 3D genome modeling engine for predicting structural variation-driven alterations of chromatin spatial structure in the human genome.\n\n3D genome organization plays a critical role in its functioning. Alterations of this organization caused by structural variants (SVs) may lead to changes in gene transcription or even to disease. The recent advent of Chromosome Conformation Capture (3C) based techniques such as ChIA-PET and Hi-C allows us to investigate genome spatial organization. The rising volume of sequencing data in turn enables highly accurate identification of structural variation. Combination of those two sources of information can reveal mechanisms of genome regulation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://3dgnome.cent.uw.edu.pl/",
    "lastUpdate": "2021-01-19T10:33:18Z",
    "name": "3D-GNOME",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA388",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited. For commercial re-use, please contact journals.permissions@oup.comStructural variants (SVs) that alter DNA sequence emerge as a driving force involved in the reorganisation of DNA spatial folding, thus affecting gene transcription. In this work, we describe an improved version of our integrated web service for structural modeling of three-dimensional genome (3D-GNOME), which now incorporates all types of SVs to model changes to the reference 3D conformation of chromatin. In 3D-GNOME 2.0, the default reference 3D genome structure is generated using ChIA-PET data from the GM12878 cell line and SVs data are sourced from the population-scale catalogue of SVs identified by the 1000 Genomes Consortium. However, users may also submit their own structural data to set a customized reference genome structure, and/or a custom input list of SVs. 3D-GNOME 2.0 provides novel tools to inspect, visualize and compare 3D models for regions that differ in terms of their linear genomic sequence. Contact diagrams are displayed to compare the reference 3D structure with the one altered by SVs. In our opinion, 3D-GNOME 2.0 is a unique online tool for modeling and analyzing conformational changes to the human genome induced by SVs across populations. It can be freely accessed at https://3dgnome.cent.uw.edu.pl/.",
                "authors": [
                    {
                        "name": "Czarnota T."
                    },
                    {
                        "name": "Jodkowska K."
                    },
                    {
                        "name": "Plewczynski D."
                    },
                    {
                        "name": "Ruan Y."
                    },
                    {
                        "name": "Sadowski M."
                    },
                    {
                        "name": "Szalaj P."
                    },
                    {
                        "name": "Tang Z."
                    },
                    {
                        "name": "Wlasnowolski M."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "3D-GNOME 2.0: A three-dimensional genome modeling engine for predicting structural variation-driven alterations of chromatin spatial structure in the human genome"
            },
            "pmcid": "PMC7319547",
            "pmid": "32442297"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "DNA packaging",
            "uri": "http://edamontology.org/topic_3176"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
