
{
    "credit": [
        {
            "email": "mlist@mpi-inf.mpg.de",
            "name": "Markus List",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "mschulz@mmci.uni-saarland.de",
            "name": "Marcel H Schulz",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://jami.readthedocs.io/en/latest/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Genome-wide measurements of paired miRNA and gene expression data have enabled the prediction of competing endogenous RNAs (ceRNAs). It has been shown that the sponge effect mediated by protein-coding as well as non-coding ceRNAs can play an important regulatory role in the cell in health and disease. Therefore, many computational methods for the computational identification of ceRNAs have been suggested. In particular, methods based on Conditional Mutual Information (CMI) have shown promising results. However, the currently available implementation is slow and cannot be used to perform computations on a large scale. Results: Here, we present JAMI, a Java tool that uses a non-parametric estimator for CMI values from gene and miRNA expression data. We show that JAMI speeds up the computation of ceRNA networks by a factor of ∼70 compared to currently available implementations. Further, JAMI supports multi-threading to make use of common multi-core architectures for further performance gain.Java 8. Availability and implementation: JAMI is available as open-source software from https://github.com/SchulzLab/JAMI. Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Hornakova A.",
                "List M.",
                "Vreeken J.",
                "Schulz M.H."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty221",
            "journal": "Bioinformatics (Oxford, England)",
            "title": "JAMI: fast computation of conditional mutual information for ceRNA network analysis",
            "year": "2018-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jami",
        "biotoolsID": "jami",
        "description": "Fast computation of conditional mutual information for ceRNA network analysis.",
        "homepage": "https://github.com/SchulzLab/JAMI",
        "name": "JAMI"
    }
}