{
    "accessibility": "Open access",
    "additionDate": "2022-06-15T11:03:44.140857Z",
    "biotoolsCURIE": "biotools:morphious",
    "biotoolsID": "morphious",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "joey.silburt@mail.utoronto.ca",
            "name": "Joseph Silburt",
            "orcidid": "https://orcid.org/0000-0002-4364-5277",
            "typeEntity": "Person"
        },
        {
            "email": "isabelle.aubert@utoronto.ca",
            "name": "Isabelle Aubert",
            "typeEntity": "Person"
        }
    ],
    "description": "An unsupervised machine learning workflow to detect the activation of microglia and astrocytes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/jsilburt/Morphious/blob/master/v2/tutorial_writeup/22-2-27_tutorial_README.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jsilburt/Morphious",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-15T11:03:44.143771Z",
    "license": "Not licensed",
    "name": "MORPHIOUS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12974-021-02376-9",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: In conditions of brain injury and degeneration, defining microglial and astrocytic activation using cellular markers alone remains a challenging task. We developed the MORPHIOUS software package, an unsupervised machine learning workflow which can learn the morphologies of non-activated astrocytes and microglia, and from this information, infer clusters of microglial and astrocytic activation in brain tissue. Methods: MORPHIOUS combines a one-class support vector machine with the density-based spatial clustering of applications with noise (DBSCAN) algorithm to identify clusters of microglial and astrocytic activation. Here, activation was triggered by permeabilizing the blood–brain barrier (BBB) in the mouse hippocampus using focused ultrasound (FUS). At 7 day post-treatment, MORPHIOUS was applied to evaluate microglial and astrocytic activation in histological tissue. MORPHIOUS was further evaluated on hippocampal sections of TgCRND8 mice, a model of amyloidosis that is prone to microglial and astrocytic activation. Results: MORPHIOUS defined two classes of microglia, termed focal and proximal, that are spatially adjacent to the activating stimulus. Focal and proximal microglia demonstrated activity-associated features, including increased levels of ionized calcium-binding adapter molecule 1 expression, enlarged soma size, and deramification. MORPHIOUS further identified clusters of astrocytes characterized by activity-related changes in glial fibrillary acidic protein expression and branching. To validate these classifications following FUS, co-localization with activation markers were assessed. Focal and proximal microglia co-localized with the transforming growth factor beta 1, while proximal astrocytes co-localized with Nestin. In TgCRND8 mice, microglial and astrocytic activation clusters were found to correlate with amyloid-β plaque load. Thus, by only referencing control microglial and astrocytic morphologies, MORPHIOUS identified regions of interest corresponding to microglial and astrocytic activation. Conclusions: Overall, our algorithm is a reliable and sensitive method for characterizing microglial and astrocytic activation following FUS-induced BBB permeability and in animal models of neurodegeneration.",
                "authors": [
                    {
                        "name": "Aubert I."
                    },
                    {
                        "name": "Silburt J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Neuroinflammation",
                "title": "MORPHIOUS: an unsupervised machine learning workflow to detect the activation of microglia and astrocytes"
            },
            "pmcid": "PMC8800241",
            "pmid": "35093113"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
