{
    "additionDate": "2017-03-27T08:35:13Z",
    "biotoolsCURIE": "biotools:coxpresdb",
    "biotoolsID": "coxpresdb",
    "credit": [
        {
            "email": "coxpresdb@hgc.jp",
            "name": "COXPRESSdb Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "COXPRESdb (coexpressed gene database) represents the coexpression relationship for human and mouse. Upgrades include a new comparable coexpression measure, Mutual Rank, five other animal species, rat, chicken, zebrafish, fly and nematoda, and addition of different layers of omics data into the integrated network of genes.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://coxpresdb.jp/help/movie/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://coxpresdb.jp",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "COXPRESdb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Publicly available databases of coexpressed gene sets are a valuable resource for a wide variety of experimental studies, including gene targeting for functional identification, and for investigations of regulatory mechanisms or protein-protein interaction networks. Although coexpressed gene databases are becoming more and more popular in the field of plant biology, those with animal data are rather limited, possibly due to the lower reliability of the coexpression data. The original COXPRESdb (coexpressed gene database) (http://coxpresdb.jp) represented the coexpression relationship for human and mouse. Here, we report updates of this database that especially focus on the enhancement of the reliability of gene coexpression data in animals. For this purpose, we implemented a new comparable coexpression measure, Mutual Rank, included five other animal species, rat, chicken, zebrafish, fly and nematoda, to assess the conservation of coexpression, and added different layers of omics data into the integrated network of genes. Comparison of coexpression is a key concept to enhance the reliability of gene coexpression, and the integration of different information can reduce the noise inherent in the information. With the functions for gene network representation, COXPRESdb can help researchers to clarify the functional and regulatory networks of genes in a broad array of animal species. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Obayashi T."
                    },
                    {
                        "name": "Kinoshita K."
                    }
                ],
                "citationCount": 58,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "COXPRESdb: A database to compare gene coexpression in seven model animals"
            },
            "pmid": "21081562"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}