{
    "additionDate": "2021-01-18T09:56:03Z",
    "biotoolsCURIE": "biotools:powsc",
    "biotoolsID": "powsc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hao.wu@emory.edu",
            "name": "Hao Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Simulation, power evaluation and sample size recommendation for single-cell RNA-seq.\n\nPOWSC: A computational tool for power evaluation and sample size estimation in scRNA-seq.\n\nPOWSC is a R package designed for scRNA-seq with a wild range of usage. It can play three roles: parameter estimator, data simulator, and power assessor. As the parameter estimator, POWSC accurately captures the characterized parameters (Fig.B) for any specific cell type from a given real expression data (Fig.A). As the data simulator, POWSC generates sythetic data (Fig.C) based on a rigorous simulation mechanism incluidng zero expression values. As the power assessor, POWSC performs comprehensive power analysis and reports the stratified targeted powers (Fig.D) for two forms of DE genes. A schemetic overview of the aglorithm is shown in (Fig.E). All the copyrights are explaned by Kenong Su kenong.su@emory.edu and Dr. Wu's lab http://www.haowulab.org.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/suke18/POWSC",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-24T15:37:01Z",
    "name": "POWSC",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA607",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: Determining the sample size for adequate power to detect statistical significance is a crucial step at the design stage for high-throughput experiments. Even though a number of methods and tools are available for sample size calculation for microarray and RNA-seq in the context of differential expression (DE), this topic in the field of single-cell RNA sequencing is understudied. Moreover, the unique data characteristics present in scRNA-seq such as sparsity and heterogeneity increase the challenge. Results: We propose POWSC, a simulation-based method, to provide power evaluation and sample size recommendation for single-cell RNA-sequencing DE analysis. POWSC consists of a data simulator that creates realistic expression data, and a power assessor that provides a comprehensive evaluation and visualization of the power and sample size relationship. The data simulator in POWSC outperforms two other state-of-art simulators in capturing key characteristics of real datasets. The power assessor in POWSC provides a variety of power evaluations including stratified and marginal power analyses for DEs characterized by two forms (phase transition or magnitude tuning), under different comparison scenarios. In addition, POWSC offers information for optimizing the tradeoffs between sample size and sequencing depth with the same total reads. Availability and implementation: POWSC is an open-source R package available online at https://github.com/suke18/POWSC.",
                "authors": [
                    {
                        "name": "Su K."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Wu Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Simulation, power evaluation and sample size recommendation for single-cell RNA-seq"
            },
            "pmid": "32614380"
        }
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
