{
    "accessibility": "Open access",
    "additionDate": "2017-09-26T07:45:59Z",
    "biotoolsCURIE": "biotools:rediportal",
    "biotoolsID": "rediportal",
    "collectionID": [
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://srv00.recas.ba.infn.it/atlas/contact.html"
        }
    ],
    "description": "Database of A-to-I (deamination of adenosines to inosines) events that enables to search RNA editing sites by genomic region, gene name and other relevant features as the tissue of origin.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://srv00.recas.ba.infn.it/atlas/help.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "http://srv00.recas.ba.infn.it/atlas/download.html"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-BARI"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Structure editing",
                    "uri": "http://edamontology.org/operation_3080"
                }
            ]
        }
    ],
    "homepage": "http://srv00.recas.ba.infn.it/atlas/",
    "language": [
        "Java",
        "Python",
        "SQL"
    ],
    "lastUpdate": "2024-02-09T14:51:17.618389Z",
    "maturity": "Mature",
    "name": "REDIportal",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa916",
            "metadata": {
                "abstract": "RNA editing is a relevant epitranscriptome phenomenon able to increase the transcriptome and proteome diversity of eukaryotic organisms. ADAR mediated RNA editing is widespread in humans in which millions of A-to-I changes modify thousands of primary transcripts. RNA editing has pivotal roles in the regulation of gene expression or modulation of the innate immune response or functioning of several neurotransmitter receptors. Massive transcriptome sequencing has fostered the research in this field. Nonetheless, different aspects of the RNA editing biology are still unknown and need to be elucidated. To support the study of A-to-I RNA editing we have updated our REDIportal catalogue raising its content to about 16 millions of events detected in 9642 human RNAseq samples from the GTEx project by using a dedicated pipeline based on the HPC version of the REDItools software. REDIportal now allows searches at sample level, provides overviews of RNA editing profiles per each RNAseq experiment, implements a Gene View module to look at individual events in their genic context and hosts the CLAIRE database. Starting from this novel version, REDIportal will start collecting non-human RNA editing changes for comparative genomics investigations. The database is freely available at http://srv00.recas.ba.infn.it/atlas/index.html.",
                "authors": [
                    {
                        "name": "Castrignano T."
                    },
                    {
                        "name": "Chillemi G."
                    },
                    {
                        "name": "Flati T."
                    },
                    {
                        "name": "Kopel E."
                    },
                    {
                        "name": "Lo Giudice C."
                    },
                    {
                        "name": "Mansi L."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Schaffer A.A."
                    },
                    {
                        "name": "Tangaro M.A."
                    }
                ],
                "citationCount": 62,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "REDIportal: Millions of novel A-to-I RNA editing events from thousands of RNAseq experiments"
            },
            "pmcid": "PMC7778987",
            "pmid": "33104797",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkw767",
            "metadata": {
                "abstract": "RNA editing by A-to-I deamination is the prominent co-/post-transcriptional modification in humans. It is carried out by ADAR enzymes and contributes to both transcriptomic and proteomic expansion. RNA editing has pivotal cellular effects and its deregulation has been linked to a variety of human disorders including neurological and neurodegenerative diseases and cancer. Despite its biological relevance, many physiological and functional aspects of RNA editing are yet elusive. Here, we present REDIportal, available online at http://srv00.recas.ba.infn.it/atlas/, the largest and comprehensive collection of RNA editing in humans including more than 4.5 millions of A-to-I events detected in 55 body sites from thousands of RNAseq experiments. REDIportal embeds RADAR database and represents the first editing resource designed to answer functional questions, enabling the inspection and browsing of editing levels in a variety of human samples, tissues and body sites. In contrast with previous RNA editing databases, REDIportal comprises its own browser (JBrowse) that allows users to explore A-to-I changes in their genomic context, empathizing repetitive elements in which RNA editing is prominent.",
                "authors": [
                    {
                        "name": "D'Erchia A.M."
                    },
                    {
                        "name": "Giudice C.L."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    }
                ],
                "citationCount": 201,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "REDIportal: A comprehensive database of A-to-I RNA editing events in humans"
            },
            "pmcid": "PMC5210607",
            "pmid": "27587585",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/978-1-0716-1307-8_25",
            "metadata": {
                "abstract": "A-to-I RNA editing in humans plays a relevant role since it can influence gene expression and increase proteome diversity. In addition, its deregulation has been linked to a variety of human diseases, including neurological disorders and cancer. In the last decade, massive transcriptome sequencing through the RNAseq technology has dramatically improved the investigation of RNA editing at single nucleotide resolution. Nowadays, different bioinformatics resources to discover and/or collect A-to-I events have been released. Hereafter, we initially provide an overview of the state-of-the-art RNA editing databases and, then, we focus on REDIportal, the largest collection of A-to-I events with more than 4.5 million sites from 2660 humans GTEx samples.",
                "authors": [
                    {
                        "name": "Giudice C.L."
                    },
                    {
                        "name": "Mansi L."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Databases for RNA Editing Collections"
            },
            "pmid": "33835458",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1038/s41596-019-0279-7",
            "metadata": {
                "abstract": "RNA editing is a widespread post-transcriptional mechanism able to modify transcripts through insertions/deletions or base substitutions. It is prominent in mammals, in which millions of adenosines are deaminated to inosines by members of the ADAR family of enzymes. A-to-I RNA editing has a plethora of biological functions, but its detection in large-scale transcriptome datasets is still an unsolved computational task. To this aim, we developed REDItools, the first software package devoted to the RNA editing profiling in RNA-sequencing (RNAseq) data. It has been successfully used in human transcriptomes, proving the tissue and cell type specificity of RNA editing as well as its pervasive nature. Outcomes from large-scale REDItools analyses on human RNAseq data have been collected in our specialized REDIportal database, containing more than 4.5 million events. Here we describe in detail two bioinformatic procedures based on our computational resources, REDItools and REDIportal. In the first procedure, we outline a workflow to detect RNA editing in the human cell line NA12878, for which transcriptome and whole genome data are available. In the second procedure, we show how to identify dysregulated editing at specific recoding sites in post-mortem brain samples of Huntington disease donors. On a 64-bit computer running Linux with ≥32 GB of random-access memory (RAM), both procedures should take ~76 h, using 4 to 24 cores. Our protocols have been designed to investigate RNA editing in different organisms with available transcriptomic and/or genomic reads. Scripts to complete both procedures and a docker image are available at https://github.com/BioinfoUNIBA/REDItools.",
                "authors": [
                    {
                        "name": "Lo Giudice C."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Tangaro M.A."
                    }
                ],
                "citationCount": 69,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Investigating RNA editing in deep transcriptome datasets with REDItools and REDIportal"
            },
            "pmid": "31996844",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
