
{
    "credit": [
        {
            "name": "Simon Jupp",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ],
            "url": "https://www.ebi.ac.uk/~jupp/"
        },
        {
            "name": "Samples, Phenotypes and Ontologies Team",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ],
            "url": "http://www.ebi.ac.uk/about/spot-team"
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "http://www.ebi.ac.uk"
        },
        {
            "name": "Elixir",
            "typeEntity": "Consortium",
            "typeRoles": [
            ],
            "url": "https://www.elixir-europe.org"
        },
        {
            "name": "CORBEL",
            "typeEntity": "Funding agency",
            "typeRoles": [
                "Contributor"
            ],
            "url": "http://www.corbel-project.eu/home.html"
        },
        {
            "name": "DIACHRON",
            "typeEntity": "Funding agency",
            "typeRoles": [
                "Contributor"
            ],
            "url": "http://www.diachron-fp7.eu"
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Funding agency",
            "typeRoles": [
                "Contributor"
            ],
            "url": "http://www.ebi.ac.uk"
        },
        {
            "name": "BioMedBridges",
            "typeEntity": "Consortium",
            "typeRoles": [
                "Documentor"
            ],
            "url": "http://www.biomedbridges.eu"
        },
        {
            "name": "ebi.ac.uk",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "http://www.ebi.ac.uk"
        },
        {
            "name": "OLS GitHub",
            "typeRoles": [
                "Support"
            ],
            "url": "https://github.com/EBISPOT/OLS"
        },
        {
            "email": "ols-support@ebi.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/EBISPOT/OLS"
        }
    ],
    "documentation": [
        {
            "type": "TERMS_OF_USE",
            "url": "http://www.ebi.ac.uk/about/terms-of-use"
        },
        {
            "type": "GENERAL",
            "url": "http://www.ebi.ac.uk/ols/docs/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                }
            ]
        }
    ],
    "labels": {
        "elixirNode": [
            "EMBL"
        ],
        "elixirPlatform": [
            "Interoperability"
        ],
        "language": [
            "JavaScript",
            "Java"
        ],
        "license": "Apache-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API",
            "Web application"
        ],
        "topic": [
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/EBISPOT/OLS/"
        }
    ],
    "publication": [
        {
            "abstract": "Background: With the vast amounts of biomedical data being generated by high-throughput analysis methods, controlled vocabularies and ontologies are becoming increasingly important to annotate units of information for ease of search and retrieval. Each scientific community tends to create its own locally available ontology. The interfaces to query these ontologies tend to vary from group to group. We saw the need for a centralized location to perform controlled vocabulary queries that would offer both a lightweight web-accessible user interface as well as a consistent, unified SOAP interface for automated queries. Results: The Ontology Lookup Service (OLS) was created to integrate publicly available biomedical ontologies into a single database. All modified ontologies are updated daily. A list of currently loaded ontologies is available online. The database can be queried to obtain information on a single term or to browse a complete ontology using AJAX. Auto-completion provides a user-friendly search mechanism. An AJAX-based ontology viewer is available to browse a complete ontology or subsets of it. A programmatic interface is available to query the webservice using SOAP. The service is described by a WSDL descriptor file available online. A sample Java client to connect to the webservice using SOAP is available for download from SourceForge. All OLS source code is publicly available under the open source Apache Licence. Conclusion: The OLS provides a user-friendly single entry point for publicly available ontologies in the Open Biomedical Ontology (OBO) format. It can be accessed interactively or programmatically at http://www.ebi.ac.uk/ontology-lookup/. © 2006 Côté et al; licensee BioMed Central Ltd.",
            "authors": [
                "Cote R.G.",
                "Jones P.",
                "Apweiler R.",
                "Hermjakob H."
            ],
            "cit_count": 137,
            "doi": "10.1186/1471-2105-7-97",
            "journal": "BMC Bioinformatics",
            "title": "The Ontology Lookup Service, a lightweight cross-platform tool for controlled vocabulary queries",
            "year": "2006-02-28"
        },
        {
            "abstract": "The Ontology Lookup Service (OLS) (http://www.ebi.ac.uk/ols) provides interactive and programmatic interfaces to query, browse and navigate an ever increasing number of biomedical ontologies and controlled vocabularies. The volume of data available for querying has more than quadrupled since it went into production and OLS functionality has been integrated into several high-usage databases and data entry tools. Improvements have been made to both OLS query interfaces, based on user feedback and requirements, to improve usability and service interoperability and provide novel ways to perform queries.",
            "authors": [
                "Cote R.G.",
                "Jones P.",
                "Martens L.",
                "Apweiler R.",
                "Hermjakob H."
            ],
            "cit_count": 54,
            "doi": "10.1093/nar/gkn252",
            "journal": "Nucleic acids research",
            "title": "The Ontology Lookup Service: more data and better tools for controlled vocabulary queries.",
            "year": "2008-01-01"
        },
        {
            "abstract": "The Ontology Lookup Service (OLS; http://www.ebi.ac.uk/ols) has been providing several means to query, browse and navigate biomedical ontologies and controlled vocabularies since it first went into production 4 years ago, and usage statistics indicate that it has become a heavily accessed service with millions of hits monthly. The volume of data available for querying has increased 7-fold since its inception. OLS functionality has been integrated into several high-usage databases and data entry tools. Improvements in the data model and loaders, as well as interface enhancements have made the OLS easier to use and capture more annotations from the source data. In addition, newly released software packages now provide easy means to fully integrate OLS functionality in external applications. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Cote R.",
                "Reisinger F.",
                "Martens L.",
                "Barsnes H.",
                "Vizcaino J.A.",
                "Hermjakob H."
            ],
            "cit_count": 66,
            "doi": "10.1093/nar/gkq331",
            "journal": "Nucleic Acids Research",
            "title": "The Ontology Lookup Service: Bigger and better",
            "year": "2010-05-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ols",
        "biotoolsID": "ols",
        "description": "Repository for biomedical ontologies that aims to provide a single point of access to the latest ontology versions. Users can browse the ontologies through the web interface and programatic access is provided via a RESTful API.",
        "homepage": "http://www.ebi.ac.uk/ols/",
        "name": "Ontology Lookup Service",
        "version": [
            "3"
        ]
    }
}