{
    "additionDate": "2020-01-09T18:27:57Z",
    "biotoolsCURIE": "biotools:Phenoscape",
    "biotoolsID": "Phenoscape",
    "confidence_flag": "tool",
    "description": "A Logical Model of Homology for Comparative Biology.\n\nOWL-based reasoning and data processing utilities for assembling the Phenoscape RDF knowledgebase.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://purl.org/phenoscape/demo/phenoscape_homology.owl"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://phenoscape.org",
    "language": [
        "Scala"
    ],
    "lastUpdate": "2020-12-04T15:24:54.971043Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/phenoscape/phenoscape-owl-tools"
        }
    ],
    "name": "Phenoscape",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/SYSBIO/SYZ067",
            "metadata": {
                "abstract": "© 2019 The Author(s).There is a growing body of research on the evolution of anatomy in a wide variety of organisms. Discoveries in this field could be greatly accelerated by computational methods and resources that enable these findings to be compared across different studies and different organisms and linked with the genes responsible for anatomical modifications. Homology is a key concept in comparative anatomy; two important types are historical homology (the similarity of organisms due to common ancestry) and serial homology (the similarity of repeated structures within an organism). We explored how to most effectively represent historical and serial homology across anatomical structures to facilitate computational reasoning. We assembled a collection of homology assertions from the literature with a set of taxon phenotypes for the skeletal elements of vertebrate fins and limbs from the Phenoscape Knowledgebase. Using seven competency questions, we evaluated the reasoning ramifications of two logical models: the Reciprocal Existential Axioms (REA) homology model and the Ancestral Value Axioms (AVA) homology model. The AVA model returned all user-expected results in addition to the search term and any of its subclasses. The AVA model also returns any superclass of the query term in which a homology relationship has been asserted. The REA model returned the user-expected results for five out of seven queries. We identify some challenges of implementing complete homology queries due to limitations of OWL reasoning. This work lays the foundation for homology reasoning to be incorporated into other ontology-based tools, such as those that enable synthetic supermatrix construction and candidate gene discovery.",
                "authors": [
                    {
                        "name": "Mabee P.M."
                    },
                    {
                        "name": "Balhoff J.P."
                    },
                    {
                        "name": "Dahdul W.M."
                    },
                    {
                        "name": "Lapp H."
                    },
                    {
                        "name": "Mungall C.J."
                    },
                    {
                        "name": "Vision T.J."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "A Logical Model of Homology for Comparative Biology"
            },
            "pmid": "31596473"
        }
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ]
}