
{
    "credit": [
        {
            "typeEntity": "Project",
            "typeRoles": [
                "Support"
            ],
            "url": "http://ginsim.org/contact"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://ginsim.org/documentation"
        }
    ],
    "download": [
        {
            "note": "Access to GINsim stable and development versions",
            "type": "Downloads page",
            "url": "http://ginsim.org/downloads",
            "version": "3.0, 2.4, 2.3.1"
        }
    ],
    "function": [
        {
            "cmd": "java -jar  [path_to_GINsim.jar]",
            "input": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        }
                    ]
                }
            ],
            "note": "In most system, GINsim can be launched just by double-clicking on the corresponding icon (Jar file).\nWhen launched with a command line,  one can use the standard Java option to specify memory requirements.\nFurthermore, adding  '--dev' at the end of the command line gives access to additional functionalities still under development.",
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        },
                        {
                            "term": "SVG",
                            "uri": "http://edamontology.org/format_3604"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "elixir-fr-sdp-2019",
            "EBI Training Tools",
            "FR"
        ],
        "cost": "Free of charge",
        "elixirNode": [
            "France"
        ],
        "language": [
            "Java"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            }
        ]
    },
    "link": [
        {
            "note": "Repository of published logical models",
            "type": "REPOSITORY",
            "url": "http://ginsim.org/models_repository"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 Naldi, Hernandez, Abou-Jaoudé, Monteiro, Chaouiya and Thieffry. The logical formalism is well adapted to model large cellular networks, in particular when detailed kinetic data are scarce. This tutorial focuses on this well-established qualitative framework. Relying on GINsim (release 3.0), a software implementing this formalism, we guide the reader step by step toward the definition, the analysis and the simulation of a four-node model of the mammalian p53-Mdm2 network.",
            "authors": [
                "Naldi A.",
                "Hernandez C.",
                "Abou-Jaoude W.",
                "Monteiro P.T.",
                "Chaouiya C.",
                "Thieffry D."
            ],
            "cit_count": 9,
            "doi": "10.3389/fphys.2018.00646",
            "journal": "Frontiers in Physiology",
            "title": "Logical modeling and analysis of cellular regulatory networks with GINsim 3.0",
            "year": "2018-06-19"
        },
        {
            "abstract": "Discrete mathematical formalisms are well adapted to model large biological networks, for which detailed kinetic data are scarce. This chapter introduces the reader to a well-established qualitative (logical) framework for the modelling of regulatory networks. Relying on GINsim, a software implementing this logical formalism, we guide the reader step by step towards the definition and the analysis of a simple model of the lysis-lysogeny decision in the bacteriophage λ. © 2012 Springer Science+Business Media, LLC.",
            "authors": [
                "Chaouiya C.",
                "Naldi A.",
                "Thieffry D."
            ],
            "cit_count": 71,
            "doi": "10.1007/978-1-61779-361-5_23",
            "journal": "Methods in Molecular Biology",
            "title": "Logical modelling of gene regulatory networks with GINsim",
            "year": "2012-01-20"
        },
        {
            "abstract": "Many important problems in cell biology require the consideration of dense nonlinear interactions between functional modules. The requirement of computer simulation for the understanding of cellular processes is now widely accepted, and a variety of modelling frameworks have been designed to meet this need. Here, we present a novel public release of the Gene Interaction Network simulation suite (GINsim), a software designed for the qualitative modelling and analysis of regulatory networks. The main functionalities of GINsim are illustrated through the analysis of a logical model for the core network controlling the fission yeast cell cycle. The last public release of GINsim (version 2.3), as well as development versions, can be downloaded from the dedicated website (http://gin.univ-mrs.fr/GINsim/), which further includes a model library, along with detailed tutorial and user manual. © 2009 Elsevier Ireland Ltd. All rights reserved.",
            "authors": [
                "Naldi A.",
                "Berenguier D.",
                "Faure A.",
                "Lopez F.",
                "Thieffry D.",
                "Chaouiya C."
            ],
            "cit_count": 109,
            "doi": "10.1016/j.biosystems.2009.04.008",
            "journal": "BioSystems",
            "title": "Logical modelling of regulatory networks with GINsim 2.3",
            "year": "2009-01-01"
        },
        {
            "abstract": "This paper presents GINsim,11GINsim is available at http://gin.univ-mrs.fr/GINsim/. a Java software suite devoted to the qualitative modelling, analysis and simulation of genetic regulatory networks. Formally, our approach leans on discrete mathematical and graph-theoretical concepts. GINsim encompasses an intuitive graph editor, enabling the definition and the parameterisation of a regulatory graph, as well as a simulation engine to compute the corresponding qualitative dynamical behaviour. Our computational approach is illustrated by a preliminary model analysis of the inter-cellular regulatory network activating Notch at the dorsal-ventral boundary in the wing imaginal disc of Drosophila. We focus on the cross-regulations between five genes (within and between two cells), which implements the dorsal-ventral border in the developing imaginal disc. Our simulations qualitatively reproduce the wild-type developmental pathway, as well as the outcome of various types of experimental perturbations, such as loss-of-function mutations or ectopically induced gene expression. © 2005 Elsevier Ireland Ltd. All rights reserved.",
            "authors": [
                "Gonzalez A.G.",
                "Naldi A.",
                "Sanchez L.",
                "Thieffry D.",
                "Chaouiya C."
            ],
            "cit_count": 102,
            "doi": "10.1016/j.biosystems.2005.10.003",
            "journal": "BioSystems",
            "title": "GINsim: A software suite for the qualitative modelling, simulation and analysis of regulatory networks",
            "year": "2006-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ginsim",
        "biotoolsID": "ginsim",
        "description": "Computer tool for the modeling and simulation of genetic regulatory networks.",
        "homepage": "http://ginsim.org/",
        "name": "GINsim",
        "version": [
            "3.0"
        ]
    }
}