{
    "additionDate": "2021-01-18T07:44:38Z",
    "biotoolsCURIE": "biotools:gbdt-lr",
    "biotoolsID": "gbdt-lr",
    "confidence_flag": "tool",
    "description": "Predicting potential miRNA-disease associations by combining gradient boosting decision tree with logistic regression.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Pualalala/GBDT-LR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-22T17:49:24Z",
    "name": "GBDT-LR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2020.107200",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdMicroRNAs (miRNAs) have been proved to play an indispensable role in many fundamental biological processes, and the dysregulation of miRNAs is closely correlated with human complex diseases. Many studies have focused on the prediction of potential miRNA-disease associations. Considering the insufficient number of known miRNA-disease associations and the poor performance of many existing prediction methods, a novel model combining gradient boosting decision tree with logistic regression (GBDT-LR) is proposed to prioritize miRNA candidates for diseases. To balance positive and negative samples, GBDT-LR firstly adopted k-means clustering to screen negative samples from unknown miRNA-disease associations. Then, the gradient boosting decision tree (GBDT) model, which has an intrinsic advantage in finding many distinguishing features and feature combinations is applied to extract features. Finally, the new features extracted by the GBDT model are input into a logistic regression (LR) model for predicting the final miRNA-disease association score. The experimental results show that the average AUC of GBDT-LR in 5-fold cross-validation (CV) can achieve 0.9274. Besides, in the case studies, 90 %, 94 % and 88 % of the top 50 miRNAs potentially associated with colon cancer, gastric cancer, and pancreatic cancer were confirmed by databases, respectively. Compared with the other three state-of-the-art methods, GBDT-LR can achieve the best prediction performance. The source code and dataset of GBDT-LR are freely available at https://github.com/Pualalala/GBDT-LR.",
                "authors": [
                    {
                        "name": "Azim R."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Zhou S."
                    }
                ],
                "citationCount": 11,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "Predicting potential miRNA-disease associations by combining gradient boosting decision tree with logistic regression"
            },
            "pmid": "32058946"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
