{
    "additionDate": "2017-08-03T19:06:13Z",
    "biotoolsCURIE": "biotools:ippbs-opt",
    "biotoolsID": "ippbs-opt",
    "credit": [
        {
            "email": "dzxiaoxuan@163.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "This web-server used to predict the Protein-Protein Binding Sites(PPBS).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/iPPBS/iPPBS-Opt_readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iPPBS-Opt",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ippbs-opt-identifying-protein-protein-binding-sites.html"
        }
    ],
    "name": "iPPBS-Opt",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 by the authors; licensee MDPI, Basel, Switzerland.Knowledge of protein-protein interactions and their binding sites is indispensable for in-depth understanding of the networks in living cells. With the avalanche of protein sequences generated in the postgenomic age, it is critical to develop computational methods for identifying in a timely fashion the protein-protein binding sites (PPBSs) based on the sequence information alone because the information obtained by this way can be used for both biomedical research and drug development. To address such a challenge, we have proposed a new predictor, called iPPBS-Opt, in which we have used: (1) the K-Nearest Neighbors Cleaning (KNNC) and Inserting Hypothetical Training Samples (IHTS) treatments to optimize the training dataset; (2) the ensemble voting approach to select the most relevant features; and (3) the stationary wavelet transform to formulate the statistical samples. Cross-validation tests by targeting the experiment-confirmed results have demonstrated that the new predictor is very promising, implying that the aforementioned practices are indeed very effective. Particularly, the approach of using the wavelets to express protein/peptide sequences might be the key in grasping the problem's essence, fully consistent with the findings that many important biological functions of proteins can be elucidated with their low-frequency internal motions. To maximize the convenience of most experimental scientists, we have provided a step-by-step guide on how to use the predictor's web server (http://www.jci-bioinfo.cn/iPPBS-Opt) to get the desired results without the need to go through the complicated mathematical equations involved.",
                "authors": [
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 133,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Molecules",
                "title": "IPPBS-Opt: A sequence-based ensemble classifier for identifying protein-protein binding sites by optimizing imbalanced training datasets"
            },
            "pmid": "26797600"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1
}