{
    "additionDate": "2019-11-14T18:40:39Z",
    "biotoolsCURIE": "biotools:SssI",
    "biotoolsID": "SssI",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bundschuh@mps.ohio-state.edu",
            "name": "Ralf Bundschuh",
            "orcidid": "https://orcid.org/0000-0002-6699-8614",
            "typeEntity": "Person"
        }
    ],
    "description": "A model of pulldown alignments from SssI-treated DNA improves DNA methylation prediction | This is our model of MBD pulldown alignments generated from SssI-treated DNA proposed in the publication entitled \"A model of pulldown alignments from SssI-treated DNA improves DNA methylation prediction\". Please read through the instructions in the README before using the software. Test files are provided in the \"source\" folder. Links to the indexes of CpGs in hg18 and the corresponding yi Λ file, generated from that list using our experimental presets and summed on 10bp windows, are also given",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://bioserv.mps.ohio-state.edu/SssICalc",
    "lastUpdate": "2020-12-26T18:57:58Z",
    "name": "SssI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3011-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Protein pulldown using Methyl-CpG binding domain (MBD) proteins followed by high-throughput sequencing is a common method to determine DNA methylation. Algorithms have been developed to estimate absolute methylation level from read coverage generated by affinity enrichment-based techniques, but the most accurate one for MBD-seq data requires additional data from an SssI-treated Control experiment. Results: Using our previous characterizations of Methyl-CpG/MBD2 binding in the context of an MBD pulldown experiment, we build a model of expected MBD pulldown reads as drawn from SssI-treated DNA. We use the program BayMeth to evaluate the effectiveness of this model by substituting calculated SssI Control data for the observed SssI Control data. By comparing methylation predictions against those from an RRBS data set, we find that BayMeth run with our modeled SssI Control data performs better than BayMeth run with observed SssI Control data, on both 100 bp and 10 bp windows. Adapting the model to an external data set solely by changing the average fragment length, our calculated data still informs the BayMeth program to a similar level as observed data in predicting methylation state on a pulldown data set with matching WGBS estimates. Conclusion: In both internal and external MBD pulldown data sets tested in this study, BayMeth used with our modeled pulldown coverage performs better than BayMeth run without the inclusion of any estimate of SssI Control pulldown, and is comparable to - and in some cases better than - using observed SssI Control data with the BayMeth program. Thus, our MBD pulldown alignment model can improve methylation predictions without the need to perform additional control experiments.",
                "authors": [
                    {
                        "name": "Bundschuh R."
                    },
                    {
                        "name": "Moreland B.S."
                    },
                    {
                        "name": "Oman K.M."
                    }
                ],
                "date": "2019-08-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A model of pulldown alignments from SssI-treated DNA improves DNA methylation prediction"
            },
            "pmcid": "PMC6700779",
            "pmid": "31426747"
        }
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        }
    ],
    "validated": 1
}
