{
    "additionDate": "2020-01-14T19:35:01Z",
    "biotoolsCURIE": "biotools:LARMD",
    "biotoolsID": "LARMD",
    "confidence_flag": "tool",
    "description": "Integration of bioinformatic resources to profile ligand-driven protein dynamics with a case on the activation of estrogen receptor.\n\nProtein dynamics is central to all biological processes, including signal transduction, cellular regulation and biological catalysis. Among them, in-depth exploration of ligand-driven protein dynamics contributes to an optimal understanding of protein function, which is particularly relevant to drug discovery. Hence, a wide range of computational tools have been designed to investigate the important dynamic information in proteins. However, performing and analyzing protein dynamics is still challenging due to the complicated operation steps, giving rise to great difficulty, especially for nonexperts. Moreover, there is a lack of web protocol to provide online facility to investigate and visualize ligand-driven protein dynamics",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://chemyang.ccnu.edu.cn/ccb/server/LARMD/",
    "lastUpdate": "2020-12-22T10:18:28Z",
    "name": "LARMD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ141",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Protein dynamics is central to all biological processes, including signal transduction, cellular regulation and biological catalysis. Among them, in-depth exploration of ligand-driven protein dynamics contributes to an optimal understanding of protein function, which is particularly relevant to drug discovery. Hence, a wide range of computational tools have been designed to investigate the important dynamic information in proteins. However, performing and analyzing protein dynamics is still challenging due to the complicated operation steps, giving rise to great difficulty, especially for nonexperts. Moreover, there is a lack of web protocol to provide online facility to investigate and visualize ligand-driven protein dynamics. To this end, in this study, we integrated several bioinformatic tools to develop a protocol, named Ligand and Receptor Molecular Dynamics (LARMD, http://chemyang.ccnu.edu.cn/ccb/server/LARMD/ and http://agroda.gzu.edu.cn:9999/ccb/server/LARMD/), for profiling ligand-driven protein dynamics. To be specific, estrogen receptor (ER) was used as a case to reveal ERβ-selective mechanism, which plays a vital role in the treatment of inflammatory diseases and many types of cancers in clinical practice. Two different residues (Ile373/Met421 and Met336/Leu384) in the pocket of ERβ/ERα were the significant determinants for selectivity, especially Met336 of ERβ. The helix H8, helix H11 and H7-H8 loop influenced the migration of selective agonist (WAY-244). These computational results were consistent with the experimental results. Therefore, LARMD provides a user-friendly online protocol to study the dynamic property of protein and to design new ligand or site-directed mutagenesis.",
                "authors": [
                    {
                        "name": "Yang J.-F."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Chen Y.-Z."
                    },
                    {
                        "name": "Hao G.-F."
                    },
                    {
                        "name": "Yang G.-F."
                    }
                ],
                "citationCount": 20,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "LARMD: Integration of bioinformatic resources to profile ligand-driven protein dynamics with a case on the activation of estrogen receptor"
            },
            "pmid": "31799600"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}