{
    "additionDate": "2017-02-14T09:35:54Z",
    "biotoolsCURIE": "biotools:ffpred",
    "biotoolsID": "ffpred",
    "credit": [
        {
            "email": "psipred@cs.ucl.ac.uk",
            "name": "pripred team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Using a machine learning approach, FFPred server predicts protein function using protein features scanned against a library of over 300 Gene Ontology annotation terms. FFPred has the capacity to annotate distant homologues and orphan protein sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinf.cs.ucl.ac.uk/index.php?id=779"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.cs.ucl.ac.uk/ffpred/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "FFPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "One of the challenges of the post-genomic era is to provide accurate function annotations for large volumes of data resulting from genome sequencing projects. Most function prediction servers utilize methods that transfer existing database annotations between orthologous sequences. In contrast, there are few methods that are independent of homology and can annotate distant and orphan protein sequences. The FFPred server adopts a machine-learning approach to perform function prediction in protein feature space using feature characteristics predicted from amino acid sequence. The features are scanned against a library of support vector machines representing over 300 Gene Ontology (GO) classes and probabilistic confidence scores returned for each annotation term. The GO term library has been modelled on human protein annotations; however, benchmark performance testing showed robust performance across higher eukaryotes. FFPred offers important advantages over traditional function prediction servers in its ability to annotate distant homologues and orphan protein sequences, and achieves greater coverage and classification accuracy than other feature-based prediction servers. A user may upload an amino acid and receive annotation predictions via email. Feature information is provided as easy to interpret graphics displayed on the sequence of interest, allowing for back-interpretation of the associations between features and function classes.",
                "authors": [
                    {
                        "name": "Lobley A.E."
                    },
                    {
                        "name": "Nugent T."
                    },
                    {
                        "name": "Orengo C.A."
                    },
                    {
                        "name": "Jones D.T."
                    }
                ],
                "citationCount": 36,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "FFPred: an integrated feature-based function prediction server for vertebrate proteomes."
            },
            "pmid": "18463141"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}