
{
    "credit": [
        {
            "email": "hongyu.zhao@yale.edu",
            "name": "Hongyu Zhao",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://zhaocenter.org/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://zhaocenter.org/software/#Genetic_Linkage_Analysis"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/multiple-tdt-associate-tdt-type-test-nuclear-family-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "The transmission/disequilibrium test (TDT) is a powerful method of locating disease genes. The TDT was originally proposed for use in studies of qualitative traits in families with both parents available. Recently, the TDT has been extended to studies of qualitative traits in sibships without parents available and in families with one parent available. It has also been extended for use in studies of quantitative traits in families with both parents available and in sibships with multiple offspring. In this paper, we first propose a new class of TDT-type tests for linkage in the presence of linkage disequilibrium for use in studies of families with both parents available. The TDT of Spielman et al. (1993) for qualitative traits and the TDT of Rabinowitz (1997) for quantitative traits are special cases of the new tests. Second, we propose a new class of TDT-type tests for linkage for use in studies of families with one parent available. Third, we study the validity and the power of the tests using simulations. Finally, we propose a method of combining data from different types of families. The combined test is valuable and allows researchers full use of the available data in detecting linkage between a marker locus and an unobservable quantitative trait locus. An important feature of the tests proposed in this paper is that no assumptions on the distribution of the quantitative traits are needed.",
            "authors": [
                "Sun F.Z.",
                "Flanders W.D.",
                "Yang Q.H.",
                "Zhao H.Y."
            ],
            "cit_count": 31,
            "journal": "Annals of Human Genetics",
            "pmid": "11281218",
            "title": "Transmission/disequilibrium tests for quantitative traits",
            "year": "2000-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:multiple_tdt",
        "biotoolsID": "multiple_tdt",
        "description": "Program to do the associate test (TDT type test for nuclear-family data) using several tightly linked markers simultanously.",
        "homepage": "http://zhaocenter.org/software/#Genetic_Linkage_Analysis",
        "name": "Multiple TDT"
    }
}