{
    "additionDate": "2020-03-19T13:08:18Z",
    "biotoolsCURIE": "biotools:marome",
    "biotoolsID": "marome",
    "credit": [
        {
            "email": "nitinnarwade1504@gmail.com",
            "name": "Nitin Narwade",
            "orcidid": "https://orcid.org/0000-0002-1368-307X",
            "typeEntity": "Institute",
            "typeRole": [
                "Developer"
            ],
            "url": "http://bioinfo.net.in/"
        }
    ],
    "description": "MARome is a resource for annotation of Scaffold and Matrix Attachment Regions (S/MARs) in Human Genome such as associated genes, genomic region, associated S/MAR binding proteins, associated Retroviral Integration sites for HIV and HTLV (Source: RID) etc. MARome is interlinked to other genomic resources such as, UCSC Genome Browser (For visualization of S/MAR genomic location), ensemble, NCBI-Gene.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://196.1.114.46:8080/MARome/help"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "https://drive.google.com/drive/folders/100P0hsdXNXOBVjAp2w4GkHGAKqJVref5?usp=sharing"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bioinfo.net.in/MARome",
    "lastUpdate": "2022-11-23T11:24:35.617567Z",
    "name": "MARome",
    "owner": "nitinnarwade1504",
    "publication": [
        {
            "doi": "10.1093/nar/gkz562",
            "metadata": {
                "abstract": "© The Author(s) 2019Scaffold/matrix attachment regions (S/MARs) are DNA elements that serve to compartmentalize the chromatin into structural and functional domains. These elements are involved in control of gene expression which governs the phenotype and also plays role in disease biology. Therefore, genome-wide understanding of these elements holds great therapeutic promise. Several attempts have been made toward identification of S/MARs in genomes of various organisms including human. However, a comprehensive genome-wide map of human S/MARs is yet not available. Toward this objective, ChIP-Seq data of 14 S/MAR binding proteins were analyzed and the binding site coordinates of these proteins were used to prepare a non-redundant S/MAR dataset of human genome. Along with co-ordinate (location) details of S/MARs, the dataset also revealed details of S/MAR features, namely, length, inter-SMAR length (the chromatin loop size), nucleotide repeats, motif abundance, chromosomal distribution and genomic context. S/MARs identified in present study and their subsequent analysis also suggests that these elements act as hotspots for integration of retroviruses. Therefore, these data will help toward better understanding of genome functioning and designing effective anti-viral therapeutics. In order to facilitate user friendly browsing and retrieval of the data obtained in present study, a web interface, MARome (http://bioinfo.net.in/MARome), has been developed.",
                "authors": [
                    {
                        "name": "Alam A."
                    },
                    {
                        "name": "Chattopadhyay S."
                    },
                    {
                        "name": "Kulkarni A."
                    },
                    {
                        "name": "Mittal S."
                    },
                    {
                        "name": "Narwade N."
                    },
                    {
                        "name": "Patel S."
                    }
                ],
                "citationCount": 15,
                "date": "2019-08-22T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Mapping of scaffold/matrix attachment regions in human genome: a data mining exercise"
            },
            "pmcid": "PMC6698742",
            "pmid": "31265077",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}
