{
    "additionDate": "2022-01-17T13:23:11.605131Z",
    "biotoolsCURIE": "biotools:lbd-covid19",
    "biotoolsID": "lbd-covid19",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Rui Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Drug repurposing for COVID-19 via knowledge graph completion and literature-based discovery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kilicogluh/lbd-covid",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-17T13:23:11.607631Z",
    "name": "LBD-COVID19",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JBI.2021.103696",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Objective: To discover candidate drugs to repurpose for COVID-19 using literature-derived knowledge and knowledge graph completion methods. Methods: We propose a novel, integrative, and neural network-based literature-based discovery (LBD) approach to identify drug candidates from PubMed and other COVID-19-focused research literature. Our approach relies on semantic triples extracted using SemRep (via SemMedDB). We identified an informative and accurate subset of semantic triples using filtering rules and an accuracy classifier developed on a BERT variant. We used this subset to construct a knowledge graph, and applied five state-of-the-art, neural knowledge graph completion algorithms (i.e., TransE, RotatE, DistMult, ComplEx, and STELP) to predict drug repurposing candidates. The models were trained and assessed using a time slicing approach and the predicted drugs were compared with a list of drugs reported in the literature and evaluated in clinical trials. These models were complemented by a discovery pattern-based approach. Results: Accuracy classifier based on PubMedBERT achieved the best performance (F1 = 0.854) in identifying accurate semantic predications. Among five knowledge graph completion models, TransE outperformed others (MR = 0.923, Hits@1 = 0.417). Some known drugs linked to COVID-19 in the literature were identified, as well as others that have not yet been studied. Discovery patterns enabled identification of additional candidate drugs and generation of plausible hypotheses regarding the links between the candidate drugs and COVID-19. Among them, five highly ranked and novel drugs (i.e., paclitaxel, SB 203580, alpha 2-antiplasmin, metoclopramide, and oxymatrine) and the mechanistic explanations for their potential use are further discussed. Conclusion: We showed that a LBD approach can be feasible not only for discovering drug candidates for COVID-19, but also for generating mechanistic explanations. Our approach can be generalized to other diseases as well as to other clinical questions. Source code and data are available at https://github.com/kilicogluh/lbd-covid.",
                "authors": [
                    {
                        "name": "Fiszman M."
                    },
                    {
                        "name": "Hristovski D."
                    },
                    {
                        "name": "Kastrin A."
                    },
                    {
                        "name": "Kilicoglu H."
                    },
                    {
                        "name": "Schutte D."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "citationCount": 7,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "Drug repurposing for COVID-19 via knowledge graph completion"
            },
            "pmcid": "PMC7869625",
            "pmid": "33571675"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
