{
    "additionDate": "2020-01-14T19:59:20Z",
    "biotoolsCURIE": "biotools:KataegisPortal",
    "biotoolsID": "KataegisPortal",
    "confidence_flag": "tool",
    "description": "Multiregion whole-genome sequencing depicts intratumour heterogeneity and punctuated evolution in ovarian clear cell carcinoma.\n\nAn R package for detecting and visualizing Kataegis events.\n\nKataegisPortal is an R package that provides utilities to detect and visualize the Kataegis events from single nucleotide variants (SNVs)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MeichunCai/Kataegisportal",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-14T14:13:27Z",
    "name": "KataegisPortal",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1136/JMEDGENET-2019-106418",
            "metadata": {
                "abstract": "© Background Ovarian clear cell carcinoma (OCCC) arises from endometriosis and represents a difficult-to-treat gynaecological malignancy, in part, because its spatial intratumour heterogeneity and temporal evolutionary trajectories have not been explicitly defined. Methods We performed whole-genome sequencing on six pathologically confirmed patients with OCCC. An R package named KataegisPortal was developed to identify and annotate loci of localised hypermutations. Immunohistochemical staining was conducted on a tissue microarray containing 143 OCCC specimens. Results Multiregion analysis demonstrated considerable degrees of subclonal diversification, ascribable to dynamic mutagenic processes, as well as macroevolutionary events including the acquisition of aneuploidy and chromoplexy. KataegisPortal unveiled APOBEC-mediated kataegis in the early phases of OCCC pathogenesis. We further showed evidence that APOBEC3A and APOBEC3B were frequently expressed in OCCC and possibly regulated by the MAPK pathway. Notably, APOBEC3B-expressing OCCC displayed favourable prognosis and appreciable immunogenicity manifested by marked cytotoxic T-cell infiltration. Conclusions These results point to an appealing model of punctuated tumour evolution underlying OCCC neoplastic transformation and progression, which may pose formidable challenges of early detection and intervention, and indicate the intratumour heterogeneity of cancer-driving alterations, yielding important implications for molecular diagnosis and targeted treatment of this lethal disease.",
                "authors": [
                    {
                        "name": "Bi R."
                    },
                    {
                        "name": "Cai M.-C."
                    },
                    {
                        "name": "Di W."
                    },
                    {
                        "name": "Jing Y."
                    },
                    {
                        "name": "Ma P."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Tan L."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Yin X."
                    },
                    {
                        "name": "Yu M."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhuang G."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "Journal of Medical Genetics",
                "title": "Multiregion whole-genome sequencing depicts intratumour heterogeneity and punctuated evolution in ovarian clear cell carcinoma"
            },
            "pmid": "31862729"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gynaecology and obstetrics",
            "uri": "http://edamontology.org/topic_3411"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
