{"collectionID": [], "accessibility": [], "topic": [{"term": "Transcription factors and regulatory sites", "uri": "http://edamontology.org/topic_0749"}, {"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}, {"term": "Gene regulation", "uri": "http://edamontology.org/topic_0204"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "15980504", "type": null, "pmcid": null, "metadata": {"title": "POCO: Discovery of regulatory patterns from promoters of oppositely expressed gene sets", "abstract": "Functionally associated genes tend to be co-expressed, which indicates that they could also be co-regulated. Since co-regulation is usually governed by transcription factors via their specific binding elements, putative regulators can be identified from promoter sets of (co-expressed) genes by screening for over-represented nucleotide patterns. Here, we present a program, POCO, which discovers such over-represented patterns from either one or two promoter sets. Typical microarray experiments yield up- and down-regulated gene sets that may represent, for example, distinct defense pathways. Assuming that a functional transcription factor cannot simultaneously both up- and down-regulate the gene sets, its binding element should respectively be over- and under-represented in the corresponding promoter sets. This idea is implemented in POCO, which tests the hypothesis that the distributions of a pattern differ among three sets of promoters: up-regulated, down-regulated and randomly-chosen. In the program, pattern discovery is based on explicit enumeration of all possible patterns on the alphabet (A, C, G, T and N). The mean occurrences and SDs of the patterns are estimated using bootstrapping and their significance is assessed using ANOVA F-statistics, Tukey's honestly significantly difference test and P-values. The program is freely available at http://ekhidna.biocenter.helsinki.fi/poco. © 2005 Oxford University Press.", "citationCount": 15, "authors": [{"name": "Kankainen M."}, {"name": "Holm L."}], "date": "2005-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "15215385", "type": null, "pmcid": null, "metadata": {"title": "POBO, transcription factor binding site verification with bootstrapping", "abstract": "Transcription factors can either activate or repress target genes by binding onto short nucleotide sequence motifs in the promoter regions of these genes. Here, we present POBO, a promoter bootstrapping program, for gene expression data. POBO can be used to detect, compare and verify predetermined transcription factor binding site motifs in the promoters of one or two clusters of co-regulated genes. The program calculates the frequencies of the motif in the input promoter sets. A bootstrap analysis detects significantly over- or underrepresented motifs. The output of the program presents bootstrapped results in picture and text formats. The program was tested with published data from transgenic WRKY70 microarray experiments. Intriguingly, motifs recognized by the WRKY transcription factors of plant defense pathways are similarly enriched in both up- and downregulated clusters. POBO analysis suggests slightly modified hypothetical motifs that discriminate between up- and downregulated clusters. In conclusion, POBO allows easy, fast and accurate verification of putative regulatory motifs. The statistical tests implemented in POBO can be useful in eliminating false positives from the results of pattern discovery programs and increasing the reliability of true positives. POBO is freely available from http://ekhidna.biocenter.helsinki.fi:9801/pobo. © Oxford University Press 2004; all rights reserved.", "citationCount": 44, "authors": [{"name": "Kankainen M."}, {"name": "Holm L."}], "date": "2004-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "15987504", "type": null, "pmcid": null, "metadata": {"title": "Theme discovery from gene lists for identification and viewing of multiple functional groups", "abstract": "Background: High throughput methods of the genome era produce vast amounts of data in the form of gene lists. These lists are large and difficult to interpret without advanced computational or bioinformatic tools. Most existing methods analyse a gene list as a single entity although it is comprised of multiple gene groups associated with separate biological functions. Therefore it is imperative to define and visualize gene groups with unique functionality within gene lists. Results: In order to analyse the functional heterogeneity within a gene list, we have developed a method that clusters genes to groups with homogenous functionalities. The method uses Non-negative Matrix Factorization (NMF) to create several clustering results with varying numbers of clusters. The obtained clustering results are combined into a simple graphical presentation showing the functional groups over-represented in the analyzed gene list. We demonstrate its performance on two data sets and show results that improve upon existing methods. The comparison also shows that our method creates a more simplified view that aids in discovery of biological themes within the list and discards less informative classes from the results. Conclusion: The presented method and associated software are useful for the identification and interpretation of biological functions associated with gene lists and are especially useful for the analysis of large lists. © 2005 Pehkonen et al; licensee BioMed Central Ltd.", "citationCount": 30, "authors": [{"name": "Pehkonen P."}, {"name": "Wong G."}, {"name": "Toronen P."}], "date": "2005-06-29T00:00:00Z", "journal": "BMC Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "16845065", "type": null, "pmcid": null, "metadata": {"title": "POXO: A web-enabled tool series to discover transcription factor binding sites", "abstract": "We present POXO, a comprehensive tool series to discover transcription factor binding sites from coexpressed genes (www.bioinfo.biocenter.helsinki.fi/poxo). POXOmanagestaskssuchas functional evaluation and grouping of genes, sequence retrieval, pattern discovery and pattern verification. It also allows users to tailor analytical pipelines from these tools, with single mouse clicks. One typical pipeline of POXO begins by examining the biological functions that a set of co-expressed genes are involved in. In this examination, the functional coherence of the gene set is evaluated and representative functions are associated with the gene set. This examination can also be used to group genes into functionally similar subsets, if several biological processes are affected in the experiment. The next step in the pipeline is then to discover over-represented nucleotide patterns from the upstream sequences of the selected gene sets. This enables to investigate the possibility that the genes are co-regulated by common cis-elements. If over-represented patterns are found, similar ones can then be clustered together and be verified. The performance of POXO is demonstrated by analysing expression data from pathogen treated Arabidopsis thaliana. In this example, POXO detected activated gene sets and suggested transcription factors responsible for their regulation. © The Author 2006. Published by Oxford University Press. All rights reserved.", "citationCount": 9, "authors": [{"name": "Kankainen M."}, {"name": "Pehkonen P."}, {"name": "Rosenstom P."}, {"name": "Toronen P."}, {"name": "Wong G."}, {"name": "Holm L."}], "date": "2006-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": "Webmaster", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "matti.kankainen@helsinki.fi"}], "biotoolsCURIE": "biotools:poxo", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.bioinfo.biocenter.helsinki.fi/poxo", "function": [{"note": null, "input": [], "operation": [{"term": "Gene expression correlation", "uri": "http://edamontology.org/operation_3463"}, {"term": "Weighted correlation network analysis", "uri": "http://edamontology.org/operation_3766"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:54Z", "otherID": [], "description": "POXO is a series of tools that can be used to discover, search and verify possible regulatory cis-element(s) from set(s) co-expressed genes.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": ["C++", "Perl", "C"], "link": [], "biotoolsID": "poxo", "additionDate": "2017-02-10T14:15:15Z", "name": "POXO", "license": null, "documentation": [{"url": "http://www.bioinfo.biocenter.helsinki.fi/poxo", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}