{
    "additionDate": "2021-10-01T13:13:53.151274Z",
    "biotoolsCURIE": "biotools:bwa-mem2",
    "biotoolsID": "bwa-mem2",
    "description": "Bwa-mem2 is the next version of the bwa-mem algorithm in bwa. It produces alignment identical to bwa and is ~1.3-3.1x faster depending on the use-case,  dataset and the running machine.",
    "documentation": [
        {
            "type": [
                "Command-line options"
            ],
            "url": "https://github.com/bwa-mem2/bwa-mem2"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/bwa-mem2/bwa-mem2/releases/tag/v2.2.1",
            "version": "2.2.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence alignment",
                        "uri": "http://edamontology.org/data_1383"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bwa-mem2/bwa-mem2",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2021-10-01T13:13:53.154131Z",
    "license": "MIT",
    "name": "Bwa-mem2",
    "owner": "gallardoalba",
    "publication": [
        {
            "doi": "10.1109/IPDPS.2019.00041",
            "metadata": {
                "abstract": "© 2019 IEEEInnovations in Next-Generation Sequencing are enabling generation of DNA sequence data at ever faster rates and at very low cost. For example, the Illumina NovaSeq 6000 sequencer can generate 6 Terabases of data in less than two days, sequencing nearly 20 Billion short DNA fragments called reads at the low cost of $1000 per human genome. Large sequencing centers typically employ hundreds of such systems. Such high-throughput and low-cost generation of data underscores the need for commensurate acceleration in downstream computational analysis of the sequencing data. A fundamental step in downstream analysis is mapping of the reads to a long reference DNA sequence, such as a reference human genome. Sequence mapping is a compute-intensive step that accounts for more than 30% of the overall time of the GATK (Genome Analysis ToolKit) best practices workflow. BWA-MEM is one of the most widely used tools for sequence mapping and has tens of thousands of users. In this work, we focus on accelerating BWA-MEM through an efficient architecture aware implementation, while maintaining identical output. The volume of data requires distributed computing and is usually processed on clusters or cloud deployments with multicore processors usually being the platform of choice. Since the application can be easily parallelized across multiple sockets (even across distributed memory systems) by simply distributing the reads equally, we focus on performance improvements on a single socket multicore processor. BWA-MEM run time is dominated by three kernels, collectively responsible for more than 85% of the overall compute time. We improved the performance of the three kernels by 1) using techniques to improve cache reuse, 2) simplifying the algorithms, 3) replacing many small memory allocations with a few large contiguous ones to improve hardware prefetching of data, 4) software prefetching of data, and 5) utilization of SIMD wherever applicable and massive reorganization of the source code to enable these improvements. As a result, we achieved nearly 2×, 183×, and 8× speedups on the three kernels, respectively, resulting in up to 3.5× and 2.4× speedups on end-to-end compute time over the original BWA-MEM on single thread and single socket of Intel Xeon Skylake processor. To the best of our knowledge, this is the highest reported speedup over BWA-MEM (running on a single CPU) while using a single CPU or a single CPU-single GPGPU/FPGA combination.",
                "authors": [
                    {
                        "name": "Aluru S."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Md V."
                    },
                    {
                        "name": "Misra S."
                    }
                ],
                "citationCount": 18,
                "date": "2019-05-01T00:00:00Z",
                "journal": "Proceedings - 2019 IEEE 33rd International Parallel and Distributed Processing Symposium, IPDPS 2019",
                "title": "Efficient architecture-aware acceleration of BWA-MEM for multicore systems"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "version": [
        "2.2.1"
    ]
}
