{
    "additionDate": "2021-03-19T08:36:14Z",
    "biotoolsCURIE": "biotools:iclrbbn",
    "biotoolsID": "iclrbbn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wanglei@xtu.edu.cn",
            "name": "Lei Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for accurate prediction of potential lncRNA disease associations.\n\nPotential lncRNA-disease association prediction.\n\nICLRBBN, a tool for accurate prediction of potential lncRNA-disease associations using internal confidence based local radial basis biological network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://leelab2997.cn/",
    "lastUpdate": "2021-03-31T18:16:28Z",
    "name": "ICLRBBN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2020.12.002",
            "metadata": {
                "abstract": "© 2020 The Author(s)Growing evidence has elucidated that long non-coding RNAs (lncRNAs) are involved in a variety of complex diseases in human bodies. In recent years, it has become a hot topic to develop effective computational models to identify potential lncRNA-disease associations. In this article, a novel method called ICLRBBN (Internal Confidence-Based Local Radial Basis Biological Network) is proposed to detect potential lncRNA-disease associations by adopting an internal confidence-based radial basis biological network. In ICLRBBN, a novel internal confidence-based collaborative filtering recommendation algorithm was designed first to mine hidden features between lncRNAs and diseases, which guarantees that ICLRBBN can be more effectively applied to predict new diseases. Then, a unique three-layer local radial basis function network consisting of diseases and lncRNAs was constructed, based on which the association probability between diseases and lncRNAs was calculated by combining different characteristics of lncRNAs with local information of diseases. Finally, we compared ICLRBBN with 6 state-of-the-art methods based on two different validation frameworks. Simulation results showed that area under the receiver operating characteristic curve (AUC) values achieved by ICLRBBN outperformed all competing methods. Furthermore, case studies illustrated that ICLRBBN has a promising future as a powerful tool in the practical application of lncRNA-disease association prediction. A web service for prediction of potential lncRNA-disease associations is available at http://leelab2997.cn/. Wang et al. developed a tool called ICLRBBN to detect potential lncRNA-disease associations by adopting an internal confidence-based radial basis biological network. This paper compared ICLRBBN with 6 state-of-the-art methods based on two different validation frameworks. Simulation results demonstrated the reliability and superiority of the prediction performance of ICLRBBN.",
                "authors": [
                    {
                        "name": "Kuang L."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Tan Y."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "date": "2021-03-05T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "ICLRBBN: a tool for accurate prediction of potential lncRNA disease associations"
            },
            "pmcid": "PMC7806946",
            "pmid": "33510939"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
