{
    "additionDate": "2018-05-19T15:46:07Z",
    "biotoolsCURIE": "biotools:slmsuite",
    "biotoolsID": "slmsuite",
    "credit": [
        {
            "email": "alberto.magi@gmail.com",
            "name": "Alberto Magi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A suite of algorithms for segmenting genomic profiles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/slmsuite/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/slmsuite/",
    "language": [
        "C++",
        "Python",
        "R",
        "Ruby"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SLMSuite",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/S12859-017-1734-5",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The identification of copy number variants (CNVs) is essential to study human genetic variation and to understand the genetic basis of mendelian disorders and cancers. At present, genome-wide detection of CNVs can be achieved using microarray or second generation sequencing (SGS) data. Although these technologies are very different, the genomic profiles that they generate are mathematically very similar and consist of noisy signals in which a decrease or increase of consecutive data represent deletions or duplication of DNA. In this framework, the most important step of the analysis consists of segmenting genomic profiles for the identification of the boundaries of genomic regions with increased or decreased signal. Results: Here we introduce SLMSuite, a collection of algorithms, based on shifting level models (SLM), to segment genomic profiles from array and SGS experiments. The SLM algorithms take as input the log-transformed genomic profiles from SGS or microarray experiments and output segmentation results. We apply our method to the analysis of synthetic genomic profiles and real whole genome sequencing data and we demonstrate that it outperforms the state of the art circular binary segmentation algorithm in terms of sensitivity, specificity and computational speed. Conclusion: The SLMSuite contains an R library with the segmentation methods and three wrappers that allow to use them in Python, Ruby and C++. SLMSuite is freely available at https://sourceforge.net/projects/slmsuite.",
                "authors": [
                    {
                        "name": "Giglio S."
                    },
                    {
                        "name": "Magi A."
                    },
                    {
                        "name": "Orlandini V."
                    },
                    {
                        "name": "Provenzano A."
                    }
                ],
                "date": "2017-06-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SLMSuite: A suite of algorithms for segmenting genomic profiles"
            },
            "pmcid": "PMC5490196",
            "pmid": "28659129"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}
