{
    "additionDate": "2023-03-09T13:42:04.047913Z",
    "biotoolsCURIE": "biotools:bus_set",
    "biotoolsID": "bus_set",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Reyer Zwiggelaar"
        }
    ],
    "description": "A benchmark for quantitative evaluation of breast ultrasound segmentation networks with public datasets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/corcor27/BUS-Set",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:55:42.964828Z",
    "license": "Not licensed",
    "name": "BUS-Set",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/mp.16287",
            "metadata": {
                "abstract": "Purpose: BUS-Set is a reproducible benchmark for breast ultrasound (BUS) lesion segmentation, comprising of publicly available images with the aim of improving future comparisons between machine learning models within the field of BUS. Method: Four publicly available datasets were compiled creating an overall set of 1154 BUS images, from five different scanner types. Full dataset details have been provided, which include clinical labels and detailed annotations. Furthermore, nine state-of-the-art deep learning architectures were selected to form the initial benchmark segmentation result, tested using five-fold cross-validation and MANOVA/ANOVA with Tukey statistical significance test with a threshold of 0.01. Additional evaluation of these architectures was conducted, exploring possible training bias, and lesion size and type effects. Results: Of the nine state-of-the-art benchmarked architectures, Mask R-CNN obtained the highest overall results, with the following mean metric scores: Dice score of 0.851, intersection over union of 0.786 and pixel accuracy of 0.975. MANOVA/ANOVA and Tukey test results showed Mask R-CNN to be statistically significant better compared to all other benchmarked models with a p-value >0.01. Moreover, Mask R-CNN achieved the highest mean Dice score of 0.839 on an additional 16 image dataset, that contained multiple lesions per image. Further analysis on regions of interest was conducted, assessing Hamming distance, depth-to-width ratio (DWR), circularity, and elongation, which showed that the Mask R-CNN's segmentations maintained the most morphological features with correlation coefficients of 0.888, 0.532, 0.876 for DWR, circularity, and elongation, respectively. Based on the correlation coefficients, statistical test indicated that Mask R-CNN was only significantly different to Sk-U-Net. Conclusions: BUS-Set is a fully reproducible benchmark for BUS lesion segmentation obtained through the use of public datasets and GitHub. Of the state-of-the-art convolution neural network (CNN)-based architectures, Mask R-CNN achieved the highest performance overall, further analysis indicated that a training bias may have occurred due to the lesion size variation in the dataset. All dataset and architecture details are available at GitHub: https://github.com/corcor27/BUS-Set, which allows for a fully reproducible benchmark.",
                "authors": [
                    {
                        "name": "Byra M."
                    },
                    {
                        "name": "Marti R."
                    },
                    {
                        "name": "Thomas C."
                    },
                    {
                        "name": "Yap M.H."
                    },
                    {
                        "name": "Zwiggelaar R."
                    }
                ],
                "citationCount": 7,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "BUS-Set: A benchmark for quantitative evaluation of breast ultrasound segmentation networks with public datasets"
            },
            "pmid": "36794706"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        }
    ]
}
