{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T11:08:57Z",
    "biotoolsCURIE": "biotools:estimate-ldl-cholesterol",
    "biotoolsID": "estimate-ldl-cholesterol",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Igor Podlubny",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/869567-igor-podlubny"
        }
    ],
    "description": "Estimate LDL cholesterol based on measured total cholesterol (TC), HDL, and triglycerides (TG).",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/36095-estimate-ldl-cholesterol",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-24T14:12:25.597118Z",
    "name": "Estimate LDL cholesterol",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "metadata": {
                "authors": [
                    {
                        "name": "Friedewald W.T."
                    },
                    {
                        "name": "Levy R.I."
                    },
                    {
                        "name": "Fredrickson D.S."
                    }
                ],
                "citationCount": 23896,
                "date": "1972-01-01T00:00:00Z",
                "journal": "Clinical chemistry",
                "title": "Estimation of the concentration of low-density lipoprotein cholesterol in plasma, without use of the preparative ultracentrifuge."
            },
            "pmid": "4337382",
            "type": [
                "Other"
            ]
        },
        {
            "metadata": {
                "abstract": "Most clinical laboratories directly measure serum triglyceride, total cholesterol, and high-density lipoprotein cholesterol. They indirectly calculate low-density lipoprotein cholesterol value using the Friedewald equation. Although high serum triglyceride (>400 mg/dL or 4.52 mmol/L) devaluates low- density lipoprotein cholesterol calculation by using this formula, effects of low serum triglyceride (<100 mg/dL or 1.13 mmol/L) on its accuracy is less defined. Two hundred thirty serum samples were assayed during a one-year period. In 115 samples, the triglyceride level was below 100 mg/dL and in 115 samples from age- and sex-matched patients the triglyceride level was 150 - 350 mg/dL (1.69 - 3.95 mmol/L). In both groups total cholesterol was above 250 mg/dL (6.46 mmol/L). On each sample, total cholesterol, high-density lipoprotein cholesterol, and triglyceride were directly measured in duplicate and low-density lipoprotein cholesterol measured directly and calculated with Friedewald equation as well. Statistical analysis showed that when triglyceride is <100 mg/dL, calculated low- density lipoprotein cholesterol is significantly overestimated (average:12.17 mg/dL or 0.31 mmol/L), where as when triglyceride is between 150 and 300 mg/dL no significant difference between calculated and measured low-density lipoprotein cholesterol is observed. In patients with low serum triglyceride and undesirably high total cholesterol levels, Friedewald equation may overestimate low-density lipoprotein cholesterol concentration and it should be either directly assayed or be calculated by a modified Friedewald equation. Using linear regression modeling, we propose a modified equation.",
                "authors": [
                    {
                        "name": "Ahmadi S.-A."
                    },
                    {
                        "name": "Boroumand M.-A."
                    },
                    {
                        "name": "Gohari-Moghaddam K."
                    },
                    {
                        "name": "Tajik P."
                    },
                    {
                        "name": "Dibaj S.-M."
                    }
                ],
                "citationCount": 64,
                "date": "2008-05-01T00:00:00Z",
                "journal": "Archives of Iranian Medicine",
                "title": "The impact of low serum triglyceride on LDL-cholesterol estimation"
            },
            "pmid": "18426324",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "version": [
        "1.0.2.0"
    ]
}