{
    "additionDate": "2017-08-03T18:37:29Z",
    "biotoolsCURIE": "biotools:biobin",
    "biotoolsID": "biobin",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ritchielab.psu.edu/contact-us"
        }
    ],
    "description": "Standalone command line application and collapsing method that uses prior biological knowledge from a prebuilt database. While it was specifically developed to investigate rare variant burden in traditional genetic trait studies, it can be used to apply multiple levels of burden testing and is useful for exploring the natural distribution of rare variants in ancestral populations.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://ritchielab.org/files/RL_software/biobin-manual-2.3.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://ritchielab.psu.edu/software/biobin-download",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-12T12:25:26Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/biobin-2-0-2-explore-rare-variant-population-stratification.html"
        }
    ],
    "name": "BioBin",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Rare variants (RVs) will likely explain additional heritability of many common complex diseases; however, the natural frequencies of rare variation across and between human populations are largely unknown. We have developed a powerful, flexible collapsing method called BioBin that utilizes prior biological knowledge using multiple publicly available database sources to direct analyses. Variants can be collapsed according to functional regions, evolutionary conserved regions, regulatory regions, genes, and/or pathways without the need for external files. We conducted an extensive comparison of rare variant burden differences (MAF < 0.03) between two ancestry groups from 1000 Genomes Project data, Yoruba (YRI) and European descent (CEU) individuals. We found that 56.86% of gene bins, 72.73% of intergenic bins, 69.45% of pathway bins, 32.36% of ORegAnno annotated bins, and 9.10% of evolutionary conserved regions (shared with primates) have statistically significant differences in RV burden. Ongoing efforts include examining additional regional characteristics using regulatory regions and protein binding domains. Our results show interesting variant differences between two ancestral populations and demonstrate that population stratification is a pervasive concern for sequence analyses.",
                "authors": [
                    {
                        "name": "Moore C.B."
                    },
                    {
                        "name": "Wallace J.R."
                    },
                    {
                        "name": "Frase A.T."
                    },
                    {
                        "name": "Pendergrass S.A."
                    },
                    {
                        "name": "Ritchie M.D."
                    }
                ],
                "citationCount": 14,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing",
                "title": "Using biobin to explore rare variant population stratification"
            },
            "pmid": "23424138",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btx559",
            "metadata": {
                "abstract": "© The Author 2017.Motivation BioBin is an automated bioinformatics tool for the multi-level biological binning of sequence variants. Herein, we present a significant update to BioBin which expands the software to facilitate a comprehensive rare variant analysis and incorporates novel features and analysis enhancements. Results In BioBin 2.3, we extend our software tool by implementing statistical association testing, updating the binning algorithm, as well as incorporating novel analysis features providing for a robust, highly customizable, and unified rare variant analysis tool.",
                "authors": [
                    {
                        "name": "Basile A.O."
                    },
                    {
                        "name": "Byrska-Bishop M."
                    },
                    {
                        "name": "Wallace J."
                    },
                    {
                        "name": "Frase A.T."
                    },
                    {
                        "name": "Ritchie M.D."
                    }
                ],
                "citationCount": 3,
                "date": "2018-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Novel features and enhancements in BioBin, a tool for the biologically inspired binning and association analysis of rare variants"
            },
            "pmcid": "PMC5860358",
            "pmid": "28968757",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1,
    "version": [
        "2.3.0",
        "2.0.0 - 2.2.1"
    ]
}