
{
    "credit": [
        {
            "email": "whlee@nmrfam.wisc.edu",
            "name": "Woonghee Lee",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "markley@nmrfam.wisc.edu",
            "name": "John L Markley",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://nmrfam.wisc.edu/pine-sparky2/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Protein secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2416"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. Nuclear magnetic resonance (NMR) spectroscopy, along with X-ray crystallography and cryoelectron microscopy, is one of the three major tools that enable the determination of atomic-level structural models of biological macromolecules. Of these, NMR has the unique ability to follow important processes in solution, including conformational changes, internal dynamics and protein-ligand interactions. As a means for facilitating the handling and analysis of spectra involved in these types of NMR studies, we have developed PINE-SPARKY.2, a software package that integrates and automates discrete tasks that previously required interaction with separate software packages. The graphical user interface of PINE-SPARKY.2 simplifies chemical shift assignment and verification, automated detection of secondary structural elements, predictions of flexibility and hydrophobic cores, and calculation of three-dimensional structural models. Availability and implementation PINE-SPARKY.2 is available in the latest version of NMRFAM-SPARKY from the National Magnetic Resonance Facility at Madison (http://pine.nmrfam.wisc.edu/download-packages.html), the NMRbox Project (https://nmrbox.org) and to subscribers to the SBGrid (https://sbgrid.org). For a detailed description of the program, see http://www.nmrfam.wisc.edu/pine-sparky2.htm. Contact whlee@nmrfam.wisc.edu or markley@nmrfam.wisc.edu Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Lee W.",
                "Markley J.L."
            ],
            "cit_count": 4,
            "doi": "10.1093/bioinformatics/btx785",
            "journal": "Bioinformatics",
            "title": "PINE-SPARKY.2 for automated NMR-based protein structure research",
            "year": "2018-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pine-sparky.2",
        "biotoolsID": "pine-sparky.2",
        "description": "Software package that integrates and automates discrete tasks that previously required interaction with separate software packages. The graphical user interface of it simplifies chemical shift assignment and verification, automated detection of secondary structural elements, predictions of flexibility and hydrophobic cores, and calculation of three-dimensional structural models.",
        "homepage": "https://nmrfam.wisc.edu/pine-sparky2/",
        "name": "PINE-SPARKY.2"
    }
}