{
    "accessibility": "Open access",
    "additionDate": "2023-08-11T05:42:31.175097Z",
    "biotoolsCURIE": "biotools:outsingle",
    "biotoolsID": "outsingle",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hbensmail@hbku.edu.qa",
            "name": "Halima Bensmail",
            "orcidid": "https://orcid.org/0000-0001-6700-5752",
            "typeEntity": "Person"
        },
        {
            "name": "Abdelkader Baggag",
            "orcidid": "https://orcid.org/0000-0001-8742-5519",
            "typeEntity": "Person"
        },
        {
            "name": "Ahmed Gamal Rashed Salem",
            "typeEntity": "Person"
        },
        {
            "name": "Edin Salkovic",
            "typeEntity": "Person"
        },
        {
            "name": "Mohammad Amin Sadeghi",
            "typeEntity": "Person"
        }
    ],
    "description": "Detecting and injecting outliers in RNA-Seq count data using the optimal hard threshold for singular values.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/esalkovic/outsingle",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-08-11T05:42:31.177704Z",
    "name": "OutSingle",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD142",
            "metadata": {
                "abstract": "Motivation: Finding outliers in RNA-sequencing (RNA-Seq) gene expression (GE) can help in identifying genes that are aberrant and cause Mendelian disorders. Recently developed models for this task rely on modeling RNA-Seq GE data using the negative binomial distribution (NBD). However, some of those models either rely on procedures for inferring NBD’s parameters in a nonbiased way that are computationally demanding and thus make confounder control challenging, while others rely on less computationally demanding but biased procedures and convoluted confounder control approaches that hinder interpretability. Results: In this article, we present OutSingle (Outlier detection using Singular Value Decomposition), an almost instantaneous way of detecting outliers in RNA-Seq GE data. It uses a simple log-normal approach for count modeling. For confounder control, it uses the recently discovered optimal hard threshold (OHT) method for noise detection, which itself is based on singular value decomposition (SVD). Due to its SVD/OHT utilization, OutSingle’s model is straightforward to understand and interpret. We then show that our novel method, when used on RNA-Seq GE data with real biological outliers masked by confounders, outcompetes the previous state-of-the-art model based on an ad hoc denoising autoencoder. Additionally, OutSingle can be used to inject artificial outliers masked by confounders, which is difficult to achieve with previous approaches. We describe a way of using OutSingle for outlier injection and proceed to show how OutSingle outperforms its competition on 16 out of 18 datasets that were generated from three real datasets using OutSingle’s injection procedure with different outlier types and magnitudes. Our methods are applicable to other types of similar problems involving finding outliers in matrices under the presence of confounders.",
                "authors": [
                    {
                        "name": "Baggag A."
                    },
                    {
                        "name": "Bensmail H."
                    },
                    {
                        "name": "Sadeghi M.A."
                    },
                    {
                        "name": "Salem A.G.R."
                    },
                    {
                        "name": "Salkovic E."
                    }
                ],
                "date": "2023-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "OutSingle: a novel method of detecting and injecting outliers in RNA-Seq count data using the optimal hard threshold for singular values"
            },
            "pmcid": "PMC10089674",
            "pmid": "36945891"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
