{"credit":[{"email":"rcui@age.mpg.de","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://fish.raycui.com/wp/"}],"documentation":[{"type":"GENERAL","url":"https://github.com/melop/simMSG/"}],"function":[{"operation":[{"term":"Simulated gene expression data generation","uri":"http://edamontology.org/operation_3566"}]}],"labels":{"language":["Shell","Perl"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Simulation experiment","uri":"http://edamontology.org/topic_3524"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/simmsg-simulate-accuracy-of-msg-for-your-genome.html"}],"publication":[{"abstract":"© 2016 John Wiley & Sons Ltd.Hybridization between closely related species, whether naturally occurring or laboratory generated, is a useful tool for mapping the genetic basis of the phenotypic traits that distinguish species. The development of next-generation sequencing techniques has greatly improved our ability to assign ancestry to hybrid genomes. One such next-generation sequencing technique, multiplexed shotgun genotyping (or MSG), can be a powerful tool for genotyping hybrids. However, it is difficult a priori to predict the accuracy of MSG in natural hybrids because accuracy depends on ancestry tract length and number of ancestry informative markers. Here, we present a simulator, 'simMSG', that will allow researchers to design MSG experiments and show that in many cases MSG can accurately assign ancestry to hundreds of thousands of sites in the genomes of natural hybrids. The simMSG tool can be used to design experiments for diverse applications including QTL mapping, genotyping introgressed lines or admixture mapping.","authors":["Schumer M.","Cui R.","Rosenthal G.G.","Andolfatto P."],"cit_count":1,"journal":"Molecular Ecology Resources","pmid":"26032857","title":"simMSG: An experimental design tool for high-throughput genotyping of hybrids","year":"2016-01-01"}],"summary":{"biotoolsCURIE":"biotools:simmsg","biotoolsID":"simmsg","description":"The tool allows users to simulate hybrids from crossing two parental genomes, and run the MSG (Multiplexed Shotgun Genotyping) pipeline on these simulated hybrids to test the accuracy of the algorithm. It allows researchers to decide on various parameters before they conduct an MSG experiment.","homepage":"https://github.com/melop/simMSG/","name":"simMSG"}}