{"credit":[{"email":"jiangzhu@sioc.ac.cn","name":"Zheng-Jiang Zhu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.metabolomics-shanghai.org/MetCCS/help/"}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Mass spectrometry","uri":"http://edamontology.org/topic_3520"},{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"© 2017 The Author. Published by Oxford University Press. All rights reserved. In metabolomics, rigorous structural identification of metabolites presents a challenge for bioinformatics. The use of collision cross-section (CCS) values of metabolites derived from ion mobility-mass spectrometry effectively increases the confidence of metabolite identification, but this technique suffers from the limit number of available CCS values. Currently, there is no software available for rapidly generating the metabolites' CCS values. Here, we developed the first web server, namely, MetCCS Predictor, for predicting CCS values. It can predict the CCS values of metabolites using molecular descriptors within a few seconds. Common users with limited background on bioinformatics can benefit from this software and effectively improve the metabolite identification in metabolomics.","authors":["Zhou Z.","Xiong X.","Zhu Z.-J."],"cit_count":19,"doi":"10.1093/bioinformatics/btx140","journal":"Bioinformatics","title":"MetCCS predictor: A web server for predicting collision cross-section values of metabolites in ion mobility-mass spectrometry based metabolomics","year":"2017-07-15"}],"summary":{"biotoolsCURIE":"biotools:metccs","biotoolsID":"metccs","description":"Web server for predicting collision cross-section values of metabolites in ion mobility-mass spectrometry based metabolomics.","homepage":"http://www.metabolomics-shanghai.org/MetCCS/","name":"MetCCS"}}