{
    "additionDate": "2021-01-18T12:04:51Z",
    "biotoolsCURIE": "biotools:goegcn",
    "biotoolsID": "goegcn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yuxc@jxust.edu.cn",
            "name": "Xiangchun Yu",
            "orcidid": "https://orcid.org/0000-0001-6206-450X",
            "typeEntity": "Person"
        }
    ],
    "description": "RNA-Seq-Based Breast Cancer Subtypes Classification Using Machine Learning Approaches.\n\nPaper: RNA-Seq-based breast cancer subtype classification using machine learning approaches.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/yxchspring/GOEGCN_BRCA_Subtypes/tree/master/Data"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yxchspring/GOEGCN_BRCA_Subtypes",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-25T08:56:35Z",
    "name": "GOEGCN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1155/2020/4737969",
            "metadata": {
                "abstract": "© 2020 Zhezhou Yu et al.Background. Breast invasive carcinoma (BRCA) is not a single disease as each subtype has a distinct morphology structure. Although several computational methods have been proposed to conduct breast cancer subtype identification, the specific interaction mechanisms of genes involved in the subtypes are still incomplete. To identify and explore the corresponding interaction mechanisms of genes for each subtype of breast cancer can impose an important impact on the personalized treatment for different patients. Methods. We integrate the biological importance of genes from the gene regulatory networks to the differential expression analysis and then obtain the weighted differentially expressed genes (weighted DEGs). A gene with a high weight means it regulates more target genes and thus holds more biological importance. Besides, we constructed gene coexpression networks for control and experiment groups, and the significantly differentially interacting structures encouraged us to design the corresponding Gene Ontology (GO) enrichment based on gene coexpression networks (GOEGCN). The GOEGCN considers the two-side distinction analysis between gene coexpression networks for control and experiment groups. The method allows us to study how the modulated coexpressed gene couples impact biological functions at a GO level. Results. We modeled the binary classification with weighted DEGs for each subtype. The binary classifier could make a good prediction for an unseen sample, and the experimental results validated the effectiveness of our proposed approaches. The novel enriched GO terms based on GOEGCN for control and experiment groups of each subtype explain the specific biological function changes according to the two-side distinction of coexpression network structures to some extent. Conclusion. The weighted DEGs contain biological importance derived from the gene regulatory network. Based on the weighted DEGs, five binary classifiers were learned and showed good performance concerning the \"Sensitivity,\"\"Specificity,\"\"Accuracy,\"\"F1,\"and \"AUC\"metrics. The GOEGCN with weighted DEGs for control and experiment groups presented a novel GO enrichment analysis results and the novel enriched GO terms would further unveil the changes of specific biological functions among all the BRCA subtypes to some extent. The R code in this research is available at https://github.com/yxchspring/GOEGCN_BRCA_Subtypes.",
                "authors": [
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Yu X."
                    },
                    {
                        "name": "Yu Z."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computational Intelligence and Neuroscience",
                "title": "RNA-Seq-Based Breast Cancer Subtypes Classification Using Machine Learning Approaches"
            },
            "pmcid": "PMC7644310",
            "pmid": "33178256"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
