{
    "additionDate": "2017-01-17T15:03:33Z",
    "biotoolsCURIE": "biotools:bcrank",
    "biotoolsID": "bcrank",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "Adam.Ameur@genpat.uu.se",
            "name": "Adam Ameur",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Functions and classes for de novo prediction of transcription factor binding consensus by heuristic search.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/BCRANK.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/BCRANK_1.36.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/BCRANK.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "name": "BCRANK",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkp381",
            "metadata": {
                "abstract": "Disease-associated SNPs detected in large-scale association studies are frequently located in non-coding genomic regions, suggesting that they may be involved in transcriptional regulation. Here we describe a new strategy for detecting regulatory SNPs (rSNPs), by combining computational and experimental approaches. Whole genome ChIP-chip data for USF1 was analyzed using a novel motif finding algorithm called BCRANK. 1754 binding sites were identified and 140 candidate rSNPs were found in the predicted sites. For validating their regulatory function, seven SNPs found to be heterozygous in at least one of four human cell samples were investigated by ChIP and sequence analysis (haploChIP). In four of five cases where the SNP was predicted to affect binding, USF1 was preferentially bound to the allele containing the consensus motif. Allelic differences in binding for other proteins and histone marks further reinforced the SNPs regulatory potential. Moreover, for one of these SNPs, H3K36me3 and POLR2A levels at neighboring heterozygous SNPs indicated effects on transcription. Our strategy, which is entirely based on in vivo data for both the prediction and validation steps, can identify individual binding sites at base pair resolution and predict rSNPs. Overall, this approach can help to pinpoint the causative SNPs in complex disorders where the associated haplotypes are located in regulatory regions.",
                "authors": [
                    {
                        "name": "Ameur A."
                    },
                    {
                        "name": "Rada-Iglesias A."
                    },
                    {
                        "name": "Komorowski J."
                    },
                    {
                        "name": "Wadelius C."
                    }
                ],
                "citationCount": 26,
                "date": "2009-07-30T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Identification of candidate regulatory SNPs by combination of transcription-factor-binding site prediction, SNP genotyping and haploChIP"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "1.36.0"
    ]
}