{
    "additionDate": "2021-11-29T13:42:20.601993Z",
    "biotoolsCURIE": "biotools:sfrmaker",
    "biotoolsID": "sfrmaker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aleaf@usgs.gov",
            "name": "Andrew T. Leaf",
            "orcidid": "https://orcid.org/0000-0001-8784-4924",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SFRmaker is a python package for automating construction of stream flow routing networks from hydrography data. Hydrography are input from a polyline shapefile and intersected with a structured grid defined using a shapefile or a Flopy StructuredGrid instance",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://usgs.github.io/sfrmaker"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/usgs/sfrmaker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-29T13:42:20.604441Z",
    "license": "CC0-1.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/usgs/sfrmaker/issues"
        }
    ],
    "name": "SFRmaker",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/GWAT.13095",
            "metadata": {
                "abstract": "Published 2021. This article is a U.S. Government work and is in the public domain in the USA. Groundwater published by Wiley Periodicals LLC on behalf of National Ground Water Association.Groundwater models have evolved to encompass more aspects of the water cycle, but the incorporation of realistic boundary conditions representing surface water remains time-consuming and error-prone. We present two Python packages that robustly automate this process using readily available hydrography data as the primary input. SFRmaker creates input for the MODFLOW SFR package, while Linesink-maker creates linesink string input for the GFLOW analytic element program. These programs can reduce weeks or even months of manual effort to a few minutes of execution time, and carry the added advantages of reduced potential for error, improved reproducibility and facilitation of step-wise modeling through reduced dependency on a particular conceptual model or discretization. Two real-world examples at the county to multi-state scales are presented.",
                "authors": [
                    {
                        "name": "Fienen M.N."
                    },
                    {
                        "name": "Leaf A.T."
                    },
                    {
                        "name": "Reeves H.W."
                    }
                ],
                "citationCount": 1,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Groundwater",
                "title": "SFRmaker and Linesink-Maker: Rapid Construction of Streamflow Routing Networks from Hydrography Data"
            },
            "pmid": "33745128",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
