{
    "additionDate": "2020-01-14T09:04:08Z",
    "biotoolsCURIE": "biotools:A-Lister",
    "biotoolsID": "A-Lister",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tnordenk@uci.edu",
            "name": "Trina M. Norden-Krichmar",
            "orcidid": "https://orcid.org/0000-0002-0199-9915",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for analysis of differentially expressed omics entities across multiple pairwise comparisons.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ]
        }
    ],
    "homepage": "https://github.com/staslist/A-Lister",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-11T14:30:52Z",
    "license": "MIT",
    "name": "A-Lister",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3121-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Researchers commonly analyze lists of differentially expressed entities (DEEs), such as differentially expressed genes (DEGs), differentially expressed proteins (DEPs), and differentially methylated positions/regions (DMPs/DMRs), across multiple pairwise comparisons. Large biological studies can involve multiple conditions, tissues, and timepoints that result in dozens of pairwise comparisons. Manually filtering and comparing lists of DEEs across multiple pairwise comparisons, typically done by writing custom code, is a cumbersome task that can be streamlined and standardized. Results: A-Lister is a lightweight command line and graphical user interface tool written in Python. It can be executed in a differential expression mode or generic name list mode. In differential expression mode, A-Lister accepts as input delimited text files that are output by differential expression tools such as DESeq2, edgeR, Cuffdiff, and limma. To allow for the most flexibility in input ID types, to avoid database installation requirements, and to allow for secure offline use, A-Lister does not validate or impose restrictions on entity ID names. Users can specify thresholds to filter the input file(s) by column(s) such as p-value, q-value, and fold change. Additionally, users can filter the pairwise comparisons within the input files by fold change direction (sign). Queries composed of intersection, fuzzy intersection, difference, and union set operations can also be performed on any number of pairwise comparisons. Thus, the user can filter and compare any number of pairwise comparisons within a single A-Lister differential expression command. In generic name list mode, A-Lister accepts delimited text files containing lists of names as input. Queries composed of intersection, fuzzy intersection, difference, and union set operations can then be performed across these lists of names. Conclusions: A-Lister is a flexible tool that enables the user to rapidly narrow down large lists of DEEs to a small number of most significant entities. These entities can then be further analyzed using visualization, pathway analysis, and other bioinformatics tools.",
                "authors": [
                    {
                        "name": "Listopad S.A."
                    },
                    {
                        "name": "Norden-Krichmar T.M."
                    }
                ],
                "date": "2019-11-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A-Lister: A tool for analysis of differentially expressed omics entities across multiple pairwise comparisons"
            },
            "pmcid": "PMC6862834",
            "pmid": "31744472"
        }
    ],
    "toolType": [
        "Desktop application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}