{
    "additionDate": "2017-08-03T18:56:30Z",
    "biotoolsCURIE": "biotools:prospect",
    "biotoolsID": "prospect",
    "credit": [
        {
            "email": "yudi.pawitan@ki.se",
            "name": "Yudi Pawitan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.meb.ki.se/personal/yudpaw/"
        }
    ],
    "description": "Software of using Ciphergen outcome files to reduce the count of peaks to a biological more interesting subset.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fafner.meb.ki.se/personal/yudpaw/?page_id=13"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://fafner.meb.ki.se/personal/yudpaw/?page_id=13",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/prospect-0-3-6-processing-of-seldi-protein-spectra.html"
        }
    ],
    "name": "ProSpect",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Peak detection is a key step in the analysis of SELDI-TOF-MS spectra, but the current default method has low specificity and poor peak annotation. To improve data quality, scientists still have to validate the identified peaks visually, a tedious and time-consuming process, especially for large data sets. Hence, there is a genuine need for methods that minimize manual validation. We have previously reported a multi-spectral signal detection method, called RS for 'region of significance', with improved specificity. Here we extend it to include a peak quantification algorithm based on annotated regions of significance (ARS). For each spectral region flagged as significant by RS, we first identify a dominant spectrum for determining the number of peaks and the m/z region of these peaks. From each m/z region of peaks, a peak template is extracted from all spectra via the principal component analysis. Finally, with the template, we estimate the amplitude and location of the peak in each spectrum with the least-squares method and refine the estimation of the amplitude via the mixture model. We have evaluated the ARS algorithm on patient samples from a clinical study. Comparison with the standard method shows that ARS (i) inherits the superior specificity of RS, and (ii) gives more accurate peak annotations than the standard method. In conclusion, we find that ARS alleviates the main problems in the preprocessing of SELDI-TOF spectra. The R-package ProSpect that implements ARS is freely available for academic use at http://www.meb.ki.se/~yudpaw. © 2006 Wiley-VCH Verlag GmbH & Co. KGaA.",
                "authors": [
                    {
                        "name": "Lehtio J."
                    },
                    {
                        "name": "Lewensohn R."
                    },
                    {
                        "name": "Pawitan Y."
                    },
                    {
                        "name": "Pernemalm M."
                    },
                    {
                        "name": "Ploner A."
                    },
                    {
                        "name": "Quandt A."
                    },
                    {
                        "name": "Tan C.S."
                    }
                ],
                "citationCount": 7,
                "date": "2006-12-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "Annotated regions of significance of SELDI-TOF-MS spectra for detecting protein biomarkers"
            },
            "pmid": "17072907"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
