{
    "additionDate": "2019-11-14T18:06:46Z",
    "biotoolsCURIE": "biotools:TreeCluster",
    "biotoolsID": "TreeCluster",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "smirarab@ucsd.edu",
            "name": "Siavash Mirarab",
            "typeEntity": "Person"
        }
    ],
    "description": "Clustering biological sequences using phylogenetic trees | Efficient phylogenetic clustering of viral sequences | TreeCluster is a tool that, given a tree T (Newick format) and a distance threshold t, finds the minimum number of clusters of the leaves of T such that some user-specified constraint is met in each cluster. The user can also specify a branch support threshold s such that no pair of leaves in any cluster can be connected by branches with support less than or equal to s. Note that all leaves given a cluster of -1 are singletons, meaning they did not cluster with any other leaves (i.e., each leaf with a cluster of -1 is in its own cluster)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (minimum distance methods)",
                    "uri": "http://edamontology.org/operation_0546"
                },
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/niemasd/TreeCluster",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-30T15:37:12Z",
    "license": "GPL-3.0",
    "name": "TreeCluster",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221068",
            "metadata": {
                "abstract": "© 2019 Balaban et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Clustering homologous sequences based on their similarity is a problem that appears in many bioinformatics applications. The fact that sequences cluster is ultimately the result of their phylogenetic relationships. Despite this observation and the natural ways in which a tree can define clusters, most applications of sequence clustering do not use a phylogenetic tree and instead operate on pairwise sequence distances. Due to advances in large-scale phylogenetic inference, we argue that tree-based clustering is under-utilized. We define a family of optimization problems that, given an arbitrary tree, return the minimum number of clusters such that all clusters adhere to constraints on their heterogeneity. We study three specific constraints, limiting (1) the diameter of each cluster, (2) the sum of its branch lengths, or (3) chains of pairwise distances. These three problems can be solved in time that increases linearly with the size of the tree, and for two of the three criteria, the algorithms have been known in the theoretical computer scientist literature. We implement these algorithms in a tool called TreeCluster, which we test on three applications: OTU clustering for microbiome data, HIV transmission clustering, and divide-and-conquer multiple sequence alignment. We show that, by using tree-based distances, TreeCluster generates more internally consistent clusters than alternatives and improves the effectiveness of downstream applications. TreeCluster is available at https://github.com/niemasd/TreeCluster.",
                "authors": [
                    {
                        "name": "Balaban M."
                    },
                    {
                        "name": "Moshiri N."
                    },
                    {
                        "name": "Mai U."
                    },
                    {
                        "name": "Jia X."
                    },
                    {
                        "name": "Mirarab S."
                    }
                ],
                "citationCount": 5,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TreeCluster: Clustering biological sequences using phylogenetic trees"
            },
            "pmcid": "PMC6705769",
            "pmid": "31437182"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}