{
    "additionDate": "2018-07-26T15:02:27Z",
    "biotoolsCURIE": "biotools:variant_ranker",
    "biotoolsID": "variant_ranker",
    "credit": [
        {
            "email": "jalexand@mbg.duth.gr",
            "name": "John Alexander",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Performs ranking and annotation of variants in genomic datasets, integrating information from multiple sources to prioritize each variant by its deleteriousness, novelty and existing information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://paschou-lab.mbg.duth.gr/html5up/Tutorial22.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://paschou-lab.mbg.duth.gr/html5up/index.html",
    "language": [
        "R",
        "PHP",
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "Variant Ranker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1752-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The increasing volume and complexity of high-throughput genomic data make analysis and prioritization of variants difficult for researchers with limited bioinformatics skills. Variant Ranker allows researchers to rank identified variants and determine the most confident variants for experimental validation. Results: We describe Variant Ranker, a user-friendly simple web-based tool for ranking, filtering and annotation of coding and non-coding variants. Variant Ranker facilitates the identification of causal variants based on novelty, effect and annotation information. The algorithm implements and aggregates multiple prediction algorithm scores, conservation scores, allelic frequencies, clinical information and additional open-source annotations using accessible databases via ANNOVAR. The available information for a variant is transformed into user-specified weights, which are in turn encoded into the ranking algorithm. Through its different modules, users can (i) rank a list of variants (ii) perform genotype filtering for case-control samples (iii) filter large amounts of high-throughput data based on user custom filter requirements and apply different models of inheritance (iv) perform downstream functional enrichment analysis through network visualization. Using networks, users can identify clusters of genes that belong to multiple ontology categories (like pathways, gene ontology, disease categories) and therefore expedite scientific discoveries. We demonstrate the utility of Variant Ranker to identify causal genes using real and synthetic datasets. Our results indicate that Variant Ranker exhibits excellent performance by correctly identifying and ranking the candidate genes Conclusions: Variant Ranker is a freely available web server on http://paschou-lab.mbg.duth.gr/Software.html. This tool will enable users to prioritise potentially causal variants and is applicable to a wide range of sequencing data.",
                "authors": [
                    {
                        "name": "Alexander J."
                    },
                    {
                        "name": "Mantzaris D."
                    },
                    {
                        "name": "Georgitsi M."
                    },
                    {
                        "name": "Drineas P."
                    },
                    {
                        "name": "Paschou P."
                    }
                ],
                "citationCount": 5,
                "date": "2017-07-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Variant Ranker: A web-tool to rank genomic data according to functional significance"
            },
            "pmcid": "PMC5514526",
            "pmid": "28716001"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}