{
    "accessibility": "Open access",
    "additionDate": "2024-03-18T15:09:22.475015Z",
    "biotoolsCURIE": "biotools:synclay",
    "biotoolsID": "synclay",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "n.m.rajpoot@warwick.ac.uk",
            "name": "Nasir Rajpoot",
            "orcidid": "https://orcid.org/0000-0002-4706-1308",
            "typeEntity": "Person"
        },
        {
            "email": "srijayd@outlook.com",
            "name": "Srijay Deshpande",
            "orcidid": "https://orcid.org/0000-0003-3923-2944",
            "typeEntity": "Person"
        }
    ],
    "description": "SynCLay (Synthesis from Cellular Layouts)  can construct realistic and high-quality histology images from user-defined cellular layouts along with annotated cellular boundaries.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Srijay/SynCLay-Framework",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-03-18T15:09:22.477613Z",
    "name": "SynCLay",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2023.102995",
            "metadata": {
                "abstract": "Automated synthesis of histology images has several potential applications in computational pathology. However, no existing method can generate realistic tissue images with a bespoke cellular layout or user-defined histology parameters. In this work, we propose a novel framework called SynCLay (Synthesis from Cellular Layouts) that can construct realistic and high-quality histology images from user-defined cellular layouts along with annotated cellular boundaries. Tissue image generation based on bespoke cellular layouts through the proposed framework allows users to generate different histological patterns from arbitrary topological arrangement of different types of cells (e.g., neutrophils, lymphocytes, epithelial cells and others). SynCLay generated synthetic images can be helpful in studying the role of different types of cells present in the tumor microenvironment. Additionally, they can assist in balancing the distribution of cellular counts in tissue images for designing accurate cellular composition predictors by minimizing the effects of data imbalance. We train SynCLay in an adversarial manner and integrate a nuclear segmentation and classification model in its training to refine nuclear structures and generate nuclear masks in conjunction with synthetic images. During inference, we combine the model with another parametric model for generating colon images and associated cellular counts as annotations given the grade of differentiation and cellularities (cell densities) of different cells. We assess the generated images quantitatively using the Frechet Inception Distance and report on feedback from trained pathologists who assigned realism scores to a set of images generated by the framework. The average realism score across all pathologists for synthetic images was as high as that for the real images. Moreover, with the assistance from pathologists, we showcase the ability of the generated images to accurately differentiate between benign and malignant tumors, thus reinforcing their reliability. We demonstrate that the proposed framework can be used to add new cells to a tissue images and alter cellular positions. We also show that augmenting limited real data with the synthetic data generated by our framework can significantly boost prediction performance of the cellular composition prediction task. The implementation of the proposed SynCLay framework is available at https://github.com/Srijay/SynCLay-Framework.",
                "authors": [
                    {
                        "name": "Dawood M."
                    },
                    {
                        "name": "Deshpande S."
                    },
                    {
                        "name": "Minhas F."
                    },
                    {
                        "name": "Rajpoot N."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "SynCLay: Interactive synthesis of histology images from bespoke cellular layouts"
            },
            "pmid": "37898050"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
