{
    "accessibility": "Open access",
    "additionDate": "2023-08-07T17:58:32.415441Z",
    "biotoolsCURIE": "biotools:idio",
    "biotoolsID": "idio",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chingpolin@gmail.com",
            "name": "Ching‐Po Lin",
            "orcidid": "https://orcid.org/0000-0001-6848-8776",
            "typeEntity": "Person"
        },
        {
            "email": "czhuang@psy.ecnu.edu.cn",
            "name": "Chu‐Chung Huang",
            "orcidid": "https://orcid.org/0000-0002-9096-9610",
            "typeEntity": "Person"
        }
    ],
    "description": "A pipeline for automated configuration and processing of diffusion MRI data. iDIO is a software toolkit for processing diffusion-weighted MRI data. It integrates the functionalities of modern MRI software packages to constitute a complete data processing pipeline for structural connectivity analysis of the human brain.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "MRI image",
                        "uri": "http://edamontology.org/data_3442"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Quality control report",
                        "uri": "http://edamontology.org/data_3914"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/iDIO4dMRI/iDIO",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2023-08-07T17:59:00.397659Z",
    "license": "CC-BY-NC-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/iDIO4dMRI/iDIO"
        }
    ],
    "name": "iDIO",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/HBM.26239",
            "metadata": {
                "abstract": "The preprocessing of diffusion magnetic resonance imaging (dMRI) data involve numerous steps, including the corrections for head motion, susceptibility distortion, low signal-to-noise ratio, and signal drifting. Researchers or clinical practitioners often need to configure different preprocessing steps depending on disparate image acquisition schemes, which increases the technical threshold for dMRI analysis for nonexpert users. This could cause disparities in data processing approaches and thus hinder the comparability between studies. To make the dMRI data processing steps transparent and adapt to various dMRI acquisition schemes for researchers, we propose a semi-automated pipeline tool for dMRI named integrated diffusion image operator or iDIO. This pipeline integrates features from a wide range of advanced dMRI software tools and targets at providing a one-click solution for dMRI data analysis, via adaptive configuration for a set of suggested processing steps based on the image header of the input data. Additionally, the pipeline provides options for post-processing, such as estimation of diffusion tensor metrics and whole-brain tractography-based connectomes reconstruction using common brain atlases. The iDIO pipeline also outputs an easy-to-interpret quality control report to facilitate users to assess the data quality. To keep the transparency of data processing, the execution log and all the intermediate images produced in the iDIO's workflow are accessible. The goal of iDIO is to reduce the barriers for clinical or nonspecialist users to adopt the state-of-art dMRI processing steps.",
                "authors": [
                    {
                        "name": "Chong S.T."
                    },
                    {
                        "name": "Hsu C.-C.H."
                    },
                    {
                        "name": "Huang C.-C."
                    },
                    {
                        "name": "Kung Y.-C."
                    },
                    {
                        "name": "Kuo K.-T."
                    },
                    {
                        "name": "Lin C.-P."
                    }
                ],
                "citationCount": 1,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "Integrated diffusion image operator (iDIO): A pipeline for automated configuration and processing of diffusion MRI data"
            },
            "pmcid": "PMC10089090",
            "pmid": "36807461"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
