
{
    "credit": [
        {
            "email": "XieConnect@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/XieConnect/SecureMA"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/securema-0-2-secure-meta-analysis-for-genetic-association-studies.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: Sharing genomic data is crucial to support scientific investigation such as genome-wide association studies. However, recent investigations suggest the privacy of the individual participants in these studies can be compromised, leading to serious concerns and consequences, such as overly restricted access to data. Results: We introduce a novel cryptographic strategy to securely perform meta-analysis for genetic association studies in large consortia. Our methodology is useful for supporting joint studies among disparate data sites, where privacy or confidentiality is of concern. We validate our method using three multisite association studies. Our research shows that genetic associations can be analyzed efficiently and accurately across substudy sites, without leaking information on individual participants and site-level association summaries.",
            "authors": [
                "Xie W.",
                "Kantarcioglu M.",
                "Bush W.S.",
                "Crawford D.",
                "Denny J.C.",
                "Heatherly R.",
                "Malin B.A."
            ],
            "cit_count": 18,
            "journal": "Bioinformatics",
            "pmid": "25147357",
            "title": "SecureMA: Protecting participant privacy in genetic association meta-analysis",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:securema",
        "biotoolsID": "securema",
        "description": "A secure framework for performing multi-site genetic association studies across large consortia, without violating privacy/confidentiality of individual participants or substudy sites. It aims at addressing various attacks on genomic privacy, and provides comprehensive protection over genomic data without impeding scientific endeavor.",
        "homepage": "https://github.com/XieConnect/SecureMA",
        "name": "SecureMA"
    }
}