{
    "additionDate": "2021-01-18T09:43:59Z",
    "biotoolsCURIE": "biotools:mfcnv",
    "biotoolsID": "mfcnv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiguoyuan@mail.xidian.edu.cn",
            "name": "Xiguo Yuan",
            "typeEntity": "Person"
        }
    ],
    "description": "A New Method to Detect Copy Number Variations From Next-Generation Sequencing Data.\n\nA method for detecting CNV using neural networks.\n\nThere are six directories. 1.program This directory contains three files that have been coded, including code for training the model, for detecting simulation data, for detecting real data, for extracting eigenvalue form simulation data, for extracting eigenvalue form real data and for transforming .txt to .mat. 2.test This directory contains two subdirectories including RealData_mat and SimulationData_mat, OriginalData_bam and Reference.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BDanalysis/mfcnv",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-02-22T08:42:03Z",
    "license": "GPL-3.0",
    "name": "MFCNV",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00434",
            "metadata": {
                "abstract": "© Copyright © 2020 Zhao, Huang, Li, Liu and Yuan.Copy number variation (CNV) is a very important phenomenon in tumor genomes and plays a significant role in tumor genesis. Accurate detection of CNVs has become a routine and necessary procedure for a deep investigation of tumor cells and diagnosis of tumor patients. Next-generation sequencing (NGS) technique has provided a wealth of data for the detection of CNVs at base-pair resolution. However, such task is usually influenced by a number of factors, including GC-content bias, sequencing errors, and correlations among adjacent positions within CNVs. Although many existing methods have dealt with some of these artifacts by designing their own strategies, there is still a lack of comprehensive consideration of all the factors. In this paper, we propose a new method, MFCNV, for an accurate detection of CNVs from NGS data. Compared with existing methods, the characteristics of the proposed method include the following: (1) it makes a full consideration of the intrinsic correlations among adjacent positions in the genome to be analyzed, (2) it calculates read depth, GC-content bias, base quality, and correlation value for each genome bin and combines them as multiple features for the evaluation of genome bins, and (3) it addresses the joint effect among the factors via training a neural network algorithm for the prediction of CNVs. We test the performance of the MFCNV method by using simulation and real sequencing data and make comparisons with several peer methods. The results demonstrate that our method is superior to other methods in terms of sensitivity, precision, and F1-score and can detect many CNVs that other methods have not discovered. MFCNV is expected to be a complementary tool in the analysis of mutations in tumor genomes and can be extended to be applied to the analysis of single-cell sequencing data.",
                "authors": [
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Yuan X."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-15T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MFCNV: A New Method to Detect Copy Number Variations From Next-Generation Sequencing Data"
            },
            "pmcid": "PMC7243272",
            "pmid": "32499814"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
