{
    "additionDate": "2017-08-03T18:37:20Z",
    "biotoolsCURIE": "biotools:baypass",
    "biotoolsID": "baypass",
    "credit": [
        {
            "email": "mathieu.gautier@supagro.inra.fr",
            "name": "Mathieu Gautier",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www1.montpellier.inra.fr/CBGP/"
        }
    ],
    "description": "This package is a population genomics software which is primarily aimed at identifying genetic markers subjected to selection and/or associated to population-specific covariates (e.g., environmental variables, quantitative or categorical phenotypic characteristics).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www1.montpellier.inra.fr/CBGP/software/baypass/index.html"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://www1.montpellier.inra.fr/CBGP/software/baypass/files/BayPass_manual_2.1.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://www1.montpellier.inra.fr/CBGP/software/baypass/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/baypass-genome-wide-scan-for-adaptive-differentiation-and-association-analysis-with-population-specific-covariables.html"
        }
    ],
    "name": "Baypass",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 by the Genetics Society of America.In population genomics studies, accounting for the neutral covariance structure across population allele frequencies is critical to improve the robustness of genome-wide scan approaches. Elaborating on the BayEnv model, this study investigates several modeling extensions (i) to improve the estimation accuracy of the population covariance matrix and all the related measures, (ii) to identify significantly overly differentiated SNPs based on a calibration procedure of the XtX statistics, and (iii) to consider alternative covariate models for analyses of association with population-specific covariables. In particular, the auxiliary variable model allows one to deal with multiple testing issues and, providing the relative marker positions are available, to capture some linkage disequilibrium information. A comprehensive simulation study was carried out to evaluate the performances of these different models. Also, when compared in terms of power, robustness, and computational efficiency to five other state-of-the-art genome-scan methods (BayEnv2, BayScEnv, BayScan, FLK, and LFMM), the proposed approaches proved highly effective. For illustration purposes, genotyping data on 18 French cattle breeds were analyzed, leading to the identification of 13 strong signatures of selection. Among these, four (surrounding the KITLG, KIT, EDN3, and ALB genes) contained SNPs strongly associated with the piebald coloration pattern while a fifth (surrounding PLAG1) could be associated to morphological differences across the populations. Finally, analysis of Pool-Seq data from 12 populations of Littorina saxatilis living in two different ecotypes illustrates how the proposed framework might help in addressing relevant ecological issues in nonmodel species. Overall, the proposed methods define a robust Bayesian framework to characterize adaptive genetic differentiation across populations. The BayPass program implementing the different models is available at http:// www1.montpellier.inra.fr/CBGP/software/baypass/.",
                "authors": [
                    {
                        "name": "Gautier M."
                    }
                ],
                "citationCount": 149,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Genome-wide scan for adaptive divergence and association with population-specific covariates"
            },
            "pmid": "26482796"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1
}