{
    "additionDate": "2017-02-10T14:15:46Z",
    "biotoolsCURIE": "biotools:griffin",
    "biotoolsID": "griffin",
    "description": "Uses a support vector machine and hidden markov model to predict G-protein coupled receptors (GPCRs) and G-protein coupling selectivity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://griffin.cbrc.jp/",
    "lastUpdate": "2021-04-15T06:43:41Z",
    "name": "GRIFFIN",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_008343"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "We describe a novel system, GRIFFIN (G-protein and Receptor Interaction Feature Finding INstrument), that predicts G-protein coupled receptor (GPCR) and G-protein coupling selectivity based on a support vector machine (SVM) and a hidden Markov model (HMM) with high sensitivity and specificity. Based on our assumption that whole structural segments of ligands, GPCRs and G-proteins are essential to determine GPCR and G-protein coupling, various quantitative features were selected for ligands, GPCRs and G-protein complex structures, and those parameters that are the most effective in selecting G-protein type were used as feature vectors in the SVM. The main part of GRIFFIN includes a hierarchical SVM classifier using the feature vectors, which is useful for Class A GPCRs, the major family. For the opsins and olfactory subfamilies of Class A and other minor families (Classes B, C, frizzled and smoothened), the binding G-protein is predicted with high accuracy using the HMM. Applying this system to known GPCR sequences, each binding G-protein is predicted with high sensitivity and specificity (>85% on average). GRIFFIN (http://griffin.cbrc.jp/) is freely available and allows users to easily execute this reliable prediction of G-proteins. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Hirokawa T."
                    },
                    {
                        "name": "Mukai H."
                    },
                    {
                        "name": "Muramatsu T."
                    },
                    {
                        "name": "Suwa M."
                    },
                    {
                        "name": "Yabuki Y."
                    }
                ],
                "citationCount": 45,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GRIFFIN: A system for predicting GPCR-G-protein coupling selectivity using a support vector machine and a hidden Markov model"
            },
            "pmid": "15980445"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
