{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T14:44:51.446393Z",
    "biotoolsCURIE": "biotools:clin.iobio",
    "biotoolsID": "clin.iobio",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "alistairnward@gmail.com",
            "name": "Alistair Ward",
            "typeEntity": "Person"
        },
        {
            "email": "gabor.marth@gmail.com",
            "name": "Gabor Marth",
            "typeEntity": "Person"
        }
    ],
    "description": "Clin.iobio is an approachable diagnostic genomic analysis workflow specifically designed to engage all members of the clinical diagnostic team, and serves to accelerate the incorporation of genomic findings into patient care.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://clin.iobio.io/",
    "lastUpdate": "2022-06-10T14:44:51.449371Z",
    "name": "clin.iobio",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/JPM12010073",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.The primary goal of precision genomics is the identification of causative genetic variants in targeted or whole-genome sequencing data. The ultimate clinical hope is that these findings lead to an efficacious change in treatment for the patient. In current clinical practice, these findings are typically returned by expert analysts as static, text-based reports. Ideally, these reports summarize the quality of the data obtained, integrate known gene–phenotype associations, follow allele segregation and affected status within the sequenced samples, and weigh computational evidence of pathogenicity. These findings are used to prioritize the variant(s) most likely to cause the given patient’s phenotypes. In most diagnostic settings, a team of experts contribute to these reports, including bioinformaticians, clinicians, and genetic counselors, among others. However, these experts often do not have the necessary tools to review genomic findings, test genetic hypotheses, or query specific gene and variant information. Additionally, team members often rely on different tools and methods based on their given expertise, resulting in further difficulties in communicating and discussing genomic findings. Here, we present clin.iobio—a web-based solution to collaborative genomic analysis that enables diagnostic team members to focus on their area of expertise within the diagnostic process, while allowing them to easily review and contribute to all steps of the diagnostic process. Clin.iobio integrates tools from the popular iobio genomic visualization suite into a comprehensive diagnostic workflow, encompassing (1) genomic data quality review, (2) dynamic phenotype-driven gene prioritization, (3) variant prioritization using a comprehensive set of knowledge bases and annotations, (4) and an exportable findings summary. In conclusion, clin.iobio is a comprehensive solution to team-based precision genomics, the findings of which stand to inform genomic considerations in clinical practice.",
                "authors": [
                    {
                        "name": "Bayrak-Toydemir P."
                    },
                    {
                        "name": "Di Sera T."
                    },
                    {
                        "name": "Ekawade A."
                    },
                    {
                        "name": "Jenkins S.M."
                    },
                    {
                        "name": "Mao R."
                    },
                    {
                        "name": "Marth G."
                    },
                    {
                        "name": "Moore B."
                    },
                    {
                        "name": "Velinder M."
                    },
                    {
                        "name": "Ward A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Personalized Medicine",
                "title": "Clin.iobio: A Collaborative Diagnostic Workflow to Enable Team-Based Precision Genomics"
            },
            "pmcid": "PMC8780189",
            "pmid": "35055388"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
