{
    "additionDate": "2017-01-17T15:05:45Z",
    "biotoolsCURIE": "biotools:ruvnormalize",
    "biotoolsID": "ruvnormalize",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "laurent.jacob@univ-lyon1.fr",
            "name": "Laurent Jacob",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Removes unwanted variation from gene expression data when the factor of interest is not defined, e.g., to clean up a dataset for general use or to do any kind of unsupervised analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/RUVnormalize.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/RUVnormalize_1.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/RUVnormalize.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T01:20:41Z",
    "license": "GPL-3.0",
    "name": "RUVnormalize",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/biostatistics/kxv026",
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press.When dealing with large scale gene expression studies, observations are commonly contaminated by sources of unwanted variation such as platforms or batches. Not taking this unwanted variation into account when analyzing the data can lead to spurious associations and to missing important signals. When the analysis is unsupervised, e.g. when the goal is to cluster the samples or to build a corrected version of the dataset-as opposed to the study of an observed factor of interest-taking unwanted variation into account can become a difficult task. The factors driving unwanted variation may be correlated with the unobserved factor of interest, so that correcting for the former can remove the latter if not done carefully. We show how negative control genes and replicate samples can be used to estimate unwanted variation in gene expression, and discuss how this information can be used to correct the expression data. The proposed methods are then evaluated on synthetic data and three gene expression datasets. They generally manage to remove unwanted variation without losing the signal of interest and compare favorably to state-of-The-Art corrections. All proposed methods are implemented in the bioconductor package RUVnormalize.",
                "authors": [
                    {
                        "name": "Gagnon-Bartsch J.A."
                    },
                    {
                        "name": "Jacob L."
                    },
                    {
                        "name": "Speed T.P."
                    }
                ],
                "citationCount": 39,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Biostatistics",
                "title": "Correcting gene expression data when neither the unwanted variation nor the factor of interest are observed"
            },
            "pmcid": "PMC4679071",
            "pmid": "26286812",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.8.0"
    ]
}
