{
    "additionDate": "2018-05-22T16:07:49Z",
    "biotoolsCURIE": "biotools:graph-gpa",
    "biotoolsID": "graph-gpa",
    "credit": [
        {
            "email": "dongjun.chung@gmail.com",
            "name": "Dongjun Chung",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hang.kim@uc.edu",
            "name": "Hang J. Kim",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Graphical model for prioritizing GWAS results and investigating pleiotropic architecture. Fit graph-GPA models, implement association mapping, and generate a phenotype graph.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://dongjunchung.github.io/GGPA/",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-2.0",
    "link": [
        {
            "note": "GitHub Page",
            "type": [
                "Software catalogue"
            ],
            "url": "https://github.com/dongjunchung/GGPA"
        }
    ],
    "name": "graph-GPA",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005388",
            "metadata": {
                "abstract": "© 2017 Chung et al.Genome-wide association studies (GWAS) have identified tens of thousands of genetic variants associated with hundreds of phenotypes and diseases, which have provided clinical and medical benefits to patients with novel biomarkers and therapeutic targets. However, identification of risk variants associated with complex diseases remains challenging as they are often affected by many genetic variants with small or moderate effects. There has been accumulating evidence suggesting that different complex traits share common risk basis, namely pleiotropy. Recently, several statistical methods have been developed to improve statistical power to identify risk variants for complex traits through a joint analysis of multiple GWAS datasets by leveraging pleiotropy. While these methods were shown to improve statistical power for association mapping compared to separate analyses, they are still limited in the number of phenotypes that can be integrated. In order to address this challenge, in this paper, we propose a novel statistical framework, graph-GPA, to integrate a large number of GWAS datasets for multiple phenotypes using a hidden Markov random field approach. Application of graph-GPA to a joint analysis of GWAS datasets for 12 phenotypes shows that graph-GPA improves statistical power to identify risk variants compared to statistical methods based on smaller number of GWAS datasets. In addition, graph-GPA also promotes better understanding of genetic mechanisms shared among phenotypes, which can potentially be useful for the development of improved diagnosis and therapeutics. The R implementation of graph-GPA is currently available at https://github.com/dongjunchung/GGPA/.",
                "authors": [
                    {
                        "name": "Chung D."
                    },
                    {
                        "name": "Kim H.J."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 6,
                "date": "2017-02-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "graph-GPA: A graphical model for prioritizing GWAS results and investigating pleiotropic architecture"
            },
            "pmcid": "PMC5347371",
            "pmid": "28212402"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": [
        "0.9.6"
    ]
}
