{
    "additionDate": "2021-01-18T11:35:34Z",
    "biotoolsCURIE": "biotools:structgraphics",
    "biotoolsID": "structgraphics",
    "confidence_flag": "tool",
    "description": "Flexible Visualization Design through Data-Agnostic and Reusable Graphical Structures.\n\nInformation visualization research has developed powerful systems that enable users to author custom data visualizations without textual programming. These systems can support graphics-driven practices by bridging lazy data-binding mechanisms with vector-graphics editing tools. Yet, despite their expressive power, visualization authoring systems often assume that users want to generate visual representations that they already have in mind rather than explore designs. They also impose a data-to-graphics workflow, where binding data dimensions to graphical properties is a necessary step for generating visualization layouts. In this paper, we introduce StructGraphics, an approach for creating data-agnostic and fully reusable visualization designs",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://www.lri.fr/~fanis/StructGraphics/",
    "lastUpdate": "2021-02-24T10:45:05Z",
    "name": "StructGraphics",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TVCG.2020.3030476",
            "metadata": {
                "abstract": "© 2020 IEEE.Information visualization research has developed powerful systems that enable users to author custom data visualizations without textual programming. These systems can support graphics-driven practices by bridging lazy data-binding mechanisms with vector-graphics editing tools. Yet, despite their expressive power, visualization authoring systems often assume that users want to generate visual representations that they already have in mind rather than explore designs. They also impose a data-to-graphics workflow, where binding data dimensions to graphical properties is a necessary step for generating visualization layouts. In this paper, we introduce StructGraphics, an approach for creating data-agnostic and fully reusable visualization designs. StructGraphics enables designers to construct visualization designs by drawing graphics on a canvas and then structuring their visual properties without relying on a concrete dataset or data schema. In StructGraphics, tabular data structures are derived directly from the structure of the graphics. Later, designers can link these structures with real datasets through a spreadsheet user interface. StructGraphics supports the design and reuse of complex data visualizations by combining graphical property sharing, by-example design specification, and persistent layout constraints. We demonstrate the power of the approach through a gallery of visualization examples and reflect on its strengths and limitations in interaction with graphic designers and data visualization experts.",
                "authors": [
                    {
                        "name": "Tsandilas T."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "StructGraphics: Flexible Visualization Design through Data-Agnostic and Reusable Graphical Structures"
            },
            "pmid": "33048753"
        }
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ]
}