{
    "additionDate": "2019-11-14T19:54:47Z",
    "biotoolsCURIE": "biotools:SRH",
    "biotoolsID": "SRH",
    "confidence_flag": "tool",
    "description": "The Prevalence and Impact of Model Violations in Phylogenetic Analysis | tests of stationarity, reversibility, and homogeneity for sequence alignments | This just deletes (with rm -rf, so be careful), /data/srh/processed_data/SRH_tables/ and /data/srh/processed_data/IQtree/ | All scripts have hard-coded input and output destinations. If you want to run them for yourself, you will need to adjust these destinations in each script as you go | This will calculate SRH stats and IQtree input files for all datasets in SRHtests/datasets. It requires python 3.6.x or higher and dependencies as in the header of srh.py. Input and output files are hardcoded near the end of the script, change them if you need to. This script creates two output folders, each of which contains one folder for each dataset in SRHtests/datasets",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree analysis (shape)",
                    "uri": "http://edamontology.org/operation_0551"
                }
            ]
        }
    ],
    "homepage": "https://github.com/roblanf/SRHtests",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-24T13:55:35Z",
    "name": "SRH",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GBE/EVZ193",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.In phylogenetic inference, we commonly use models of substitution which assume that sequence evolution is stationary, reversible, and homogeneous (SRH). Although the use of such models is often criticized, the extent of SRH violations and their effects on phylogenetic inference of tree topologies and edge lengths are not well understood. Here, we introduce and apply the maximal matched-pairs tests of homogeneity to assess the scale and impact of SRH model violations on 3,572 partitions from 35 published phylogenetic data sets. We show that roughly one-quarter of all the partitions we analyzed (23.5%) reject the SRH assumptions, and that for 25% of data sets, tree topologies inferred from all partitions differ significantly from topologies inferred using the subset of partitions that do not reject the SRH assumptions. This proportion increases when comparing trees inferred using the subset of partitions that rejects the SRH assumptions, to those inferred from partitions that do not reject the SRH assumptions. These results suggest that the extent and effects of model violation in phylogenetics may be substantial. They highlight the importance of testing for model violations and possibly excluding partitions that violate models prior to tree reconstruction. Our results also suggest that further effort in developing models that do not require SRH assumptions could lead to large improvements in the accuracy of phylogenomic inference. The scripts necessary to perform the analysis are available in https://github.com/roblanf/SRHtests, and the new tests we describe are available as a new option in IQ-TREE (http://www.iqtree.org).",
                "authors": [
                    {
                        "name": "Naser-Khdour S."
                    },
                    {
                        "name": "Minh B.Q."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Stone E.A."
                    },
                    {
                        "name": "Lanfear R."
                    },
                    {
                        "name": "Bryant D."
                    }
                ],
                "citationCount": 12,
                "date": "2019-11-19T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "The Prevalence and Impact of Model Violations in Phylogenetic Analysis"
            },
            "pmid": "31536115"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ],
    "validated": 1
}