{
    "additionDate": "2021-01-18T07:09:07Z",
    "biotoolsCURIE": "biotools:adnet",
    "biotoolsID": "adnet",
    "confidence_flag": "tool",
    "description": "An attention-guided denoising convolutional neural network (ADNet), mainly including a sparse block (SB), a feature enhancement block (FEB), an attention block (AB) and a reconstruction block (RB) for image denoising.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/hellloxiaotian/ADNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T18:43:47Z",
    "name": "ADNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.NEUNET.2019.12.024",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdDeep convolutional neural networks (CNNs) have attracted considerable interest in low-level computer vision. Researches are usually devoted to improving the performance via very deep CNNs. However, as the depth increases, influences of the shallow layers on deep layers are weakened. Inspired by the fact, we propose an attention-guided denoising convolutional neural network (ADNet), mainly including a sparse block (SB), a feature enhancement block (FEB), an attention block (AB) and a reconstruction block (RB) for image denoising. Specifically, the SB makes a tradeoff between performance and efficiency by using dilated and common convolutions to remove the noise. The FEB integrates global and local features information via a long path to enhance the expressive ability of the denoising model. The AB is used to finely extract the noise information hidden in the complex background, which is very effective for complex noisy images, especially real noisy images and bind denoising. Also, the FEB is integrated with the AB to improve the efficiency and reduce the complexity for training a denoising model. Finally, a RB aims to construct the clean image through the obtained noise mapping and the given noisy image. Additionally, comprehensive experiments show that the proposed ADNet performs very well in three tasks (i.e. synthetic and real noisy images, and blind denoising) in terms of both quantitative and qualitative evaluations. The code of ADNet is accessible at https://github.com/hellloxiaotian/ADNet.",
                "authors": [
                    {
                        "name": "Tian C."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Zuo W."
                    },
                    {
                        "name": "Fei L."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "citationCount": 35,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Neural Networks",
                "title": "Attention-guided CNN for image denoising"
            },
            "pmid": "31991307"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ]
}