{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-12-06T14:21:58.555870Z",
    "biotoolsCURIE": "biotools:sysrev",
    "biotoolsID": "sysrev",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "tom@insilica.co",
            "name": "Thomas Luechtefeld",
            "typeEntity": "Person"
        }
    ],
    "description": "Sysrev is a FAIR platform for data curation and systematic evidence review.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "http://Sysrev.com",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-12-06T14:22:56.644964Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "http://github.com/sysrev/PySysrev/issues"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "http://github.com/sysrev/RSysrev/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/sysrev/PySysrev"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/sysrev/RSysrev"
        }
    ],
    "name": "Sysrev",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/frai.2021.685298",
            "metadata": {
                "abstract": "© Copyright © 2021 Bozada, Borden, Workman, Del Cid, Malinowski and Luechtefeld.Well-curated datasets are essential to evidence based decision making and to the integration of artificial intelligence with human reasoning across disciplines. However, many sources of data remain siloed, unstructured, and/or unavailable for complementary and secondary research. Sysrev was developed to address these issues. First, Sysrev was built to aid in systematic evidence reviews (SER), where digital documents are evaluated according to a well defined process, and where Sysrev provides an easy to access, publicly available and free platform for collaborating in SER projects. Secondly, Sysrev addresses the issue of unstructured, siloed, and inaccessible data in the context of generalized data extraction, where human and machine learning algorithms are combined to extract insights and evidence for better decision making across disciplines. Sysrev uses FAIR - Findability, Accessibility, Interoperability, and Reuse of digital assets - as primary principles in design. Sysrev was developed primarily because of an observed need to reduce redundancy, reduce inefficient use of human time and increase the impact of evidence based decision making. This publication is an introduction to Sysrev as a novel technology, with an overview of the features, motivations and use cases of the tool. Methods: Sysrev. com is a FAIR motivated web platform for data curation and SER. Sysrev allows users to create data curation projects called “sysrevs” wherein users upload documents, define review tasks, recruit reviewers, perform review tasks, and automate review tasks. Conclusion: Sysrev is a web application designed to facilitate data curation and SERs. Thousands of publicly accessible Sysrev projects have been created, accommodating research in a wide variety of disciplines. Described use cases include data curation, managed reviews, and SERs.",
                "authors": [
                    {
                        "name": "Borden J."
                    },
                    {
                        "name": "Bozada T."
                    },
                    {
                        "name": "Del Cid M."
                    },
                    {
                        "name": "Luechtefeld T."
                    },
                    {
                        "name": "Malinowski J."
                    },
                    {
                        "name": "Workman J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-08-05T00:00:00Z",
                "journal": "Frontiers in Artificial Intelligence",
                "title": "Sysrev: A FAIR Platform for Data Curation and Systematic Evidence Review"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
