{
    "additionDate": "2021-01-18T08:02:48Z",
    "biotoolsCURIE": "biotools:ihnlncsim",
    "biotoolsID": "ihnlncsim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lijianwei@hebut.edu.cn",
            "name": "Jianwei Li",
            "typeEntity": "Person"
        },
        {
            "email": "langliying@126.com",
            "name": "Liying Lang",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring lncRNA Functional Similarity Based on Integrating Heterogeneous Network Data.\n\nLong non-coding RNAs (long ncRNAs, lncRNA) are one of great importance non-coding RNA with exceeding 200 nucleotides which are involved in human crucial biological processes. Improved evidences has proved that lncRNAs with similar expression patterns, expression profile and associated with similar diseases may share similar functions. Using the available data to build networks that are able to systematically and comprehensively infer the functional similarity of lncRNA. Determining the functional similarity of lncRNAs is beneficial to clarify the mechanism of their in life activities and complex diseases.\n\nIHNLncSim is a freely and reliable computational model can calculate functional similarity between lncRNAs, it will be advantageous to discover their functions which are ambiguous.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://www.lirmed.com/ihnlncsim",
    "lastUpdate": "2021-02-03T07:46:55Z",
    "name": "IHNLncSim",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00027",
            "metadata": {
                "abstract": "© Copyright © 2020 Li, Zhao, Zhou, Zhou and Lang.Although lncRNAs lack the potential to be translated into proteins directly, their complicated and diversiform functions make them as a window into decoding the mechanisms of human physiological activities. Accumulating experiment studies have identified associations between lncRNA dysfunction and many important complex diseases. However, known experimentally confirmed lncRNA functions are still very limited. It is urgent to build effective computational models for rapid predicting of unknown lncRNA functions on a large scale. To this end, valid similarity measure between known and unknown lncRNAs plays a vital role. In this paper, an original model was developed to calculate functional similarities between lncRNAs by integrating heterogeneous network data. In this model, a novel integrated network was constructed based on the data of four single lncRNA functional similarity networks (miRNA-based similarity network, disease-based similarity network, GTEx expression-based network and NONCODE expression-based network). Using the lncRNA pairs that share the target mRNAs as the benchmark, the results show that this integrated network is more effective than any single networks with an AUC of 0.736 in the cross validation, while the AUC of four single networks were 0.703, 0.733, 0.611, and 0.602. To implement our model, a web server named IHNLncSim was constructed for inferring lncRNA functional similarity based on integrating heterogeneous network data. Moreover, the modules of network visualization and disease-based lncRNA function enrichment analysis were added into IHNLncSim. It is anticipated that IHNLncSim could be an effective bioinformatics tool for the researches of lncRNA regulation function studies. IHNLncSim is freely available at http://www.lirmed.com/ihnlncsim.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Zhao Y."
                    },
                    {
                        "name": "Zhou S."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Lang L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-06T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Inferring lncRNA Functional Similarity Based on Integrating Heterogeneous Network Data"
            },
            "pmcid": "PMC7015864",
            "pmid": "32117916"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}