{
    "additionDate": "2017-08-03T19:03:25Z",
    "biotoolsCURIE": "biotools:treq",
    "biotoolsID": "treq",
    "credit": [
        {
            "email": "schliep@cs.rutgers.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.rutgers.edu/"
        }
    ],
    "description": "Read mapper for high-throughput DNA sequencing reads, in particular reads from 100 nt to hundreds of nucleotides, and for large edit distance between sequencing read and match in the reference genome.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/treq/home/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/p/treq/home/Home/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-25T14:22:13.230583Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/treq-0-1-beta-indel-tolerant-read-mapping.html"
        }
    ],
    "maturity": "Emerging",
    "name": "TreQ 0.1 beta",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts380",
            "metadata": {
                "abstract": "Motivation: Mapping billions of reads from next generation sequencing experiments to reference genomes is a crucial task, which can require hundreds of hours of running time on a single CPU even for the fastest known implementations. Traditional approaches have difficulties dealing with matches of large edit distance, particularly in the presence of frequent or large insertions and deletions (indels). This is a serious obstacle both in determining the spectrum and abundance of genetic variations and in personal genomics. Results: For the first time, we adopt the approximate string matching paradigm of geometric embedding to read mapping, thus rephrasing it to nearest neighbor queries in a q-gram frequency vector space. Using the L1 distance between frequency vectors has the benefit of providing lower bounds for an edit distance with affine gap costs. Using a cache-oblivious kd-tree, we realize running times, which match the state-of-the-art. Additionally, running time and memory requirements are about constant for read lengths between 100 and 1000 bp. We provide a first proof-of-concept that geometric embedding is a promising paradigm for read mapping and that L1 distance might serve to detect structural variations. TreQ, our initial implementation of that concept, performs more accurate than many popular read mappers over a wide range of structural variants. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Mahmud M.P."
                    },
                    {
                        "name": "Schliep A."
                    },
                    {
                        "name": "Wiedenhoeft J."
                    }
                ],
                "citationCount": 3,
                "date": "2012-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Indel-tolerant read mapping with trinucleotide frequencies using cache-oblivious kd-trees"
            },
            "pmcid": "PMC3436807",
            "pmid": "22962448"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
