{"credit":[{"email":"wckao@eecs.berkeley.edu","name":"Wei-Chun Kao","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"yss@eecs.berkeley.edu","name":"Yun S. Song","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bayescall.sourceforge.net/README.txt"}],"function":[{"operation":[{"term":"Base-calling","uri":"http://edamontology.org/operation_3185"}]}],"labels":{"language":["C++","Python"],"license":"GPL-3.0","maturity":"Legacy","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"publication":[{"abstract":"Extracting sequence information from raw images of fluorescence is the foundation underlying several high-throughput sequencing platforms. Some of the main challenges associated with this technology include reducing the error rate, assigning accurate base-specific quality scores, and reducing the cost of sequencing by increasing the throughput per run. To demonstrate how computational advancement can help to meet these challenges, a novel model-based base-calling algorithm, BayesCall, is introduced for the Illumina sequencing platform. Being founded on the tools of statistical learning, BayesCall is flexible enough to incorporate various features of the sequencing process. In particular, it can easily incorporate time-dependent parameters and model residual effects. This new approach significantly improves the accuracy over Illumina's base-caller Bustard, particularly in the later cycles of a sequencing run. For 76-cycle data on a standard viral sample, phiX174, BayesCall improves Bustard's average per-base error rate by ∼51%. The probability of observing each base can be readily computed in BayesCall, and this probability can be transformed into a useful basespecific quality score with a high discrimination ability. A detailed study of BayesCall's performance is presented here. © 2009 by Cold Spring Harbor Laboratory Press.","authors":["Kao W.-C.","Stevens K.","Song Y.S."],"cit_count":58,"journal":"Genome Research","pmid":"19661376","title":"BayesCall: A model-based base-calling algorithm for high-throughput short-read sequencing","year":"2009-10-01"}],"summary":{"biotoolsCURIE":"biotools:bayescall","biotoolsID":"bayescall","description":"Bayesian basecaller","homepage":"http://bayescall.sourceforge.net/","name":"BayesCall"}}