{
    "additionDate": "2018-05-10T11:08:54Z",
    "biotoolsCURIE": "biotools:detectir",
    "biotoolsID": "detectir",
    "credit": [
        {
            "email": "liangc@miamioh.edu",
            "name": "Dr. Chun Liang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for detecting perfect and imperfect inverted repeats in genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/detectir/wiki/User%20Manual/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://sourceforge.net/projects/detectir/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/detectir/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "CC-BY-NC-SA-3.0",
    "name": "detectIR",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0113349",
            "metadata": {
                "abstract": "© 2014 Ye et al.Inverted repeats are present in abundance in both prokaryotic and eukaryotic genomes and can form DNA secondary structures - hairpins and cruciforms that are involved in many important biological processes. Bioinformatics tools for efficient and accurate detection of inverted repeats are desirable, because existing tools are often less accurate and time consuming, sometimes incapable of dealing with genome-scale input data. Here, we present a MATLAB-based program called detectIR for the perfect and imperfect inverted repeat detection that utilizes complex numbers and vector calculation and allows genome-scale data inputs. A novel algorithm is adopted in detectIR to convert the conventional sequence string comparison in inverted repeat detection into vector calculation of complex numbers, allowing non-complementary pairs (mismatches) in the pairing stem and a non-palindromic spacer (loop or gaps) in the middle of inverted repeats. Compared with existing popular tools, our program performs with significantly higher accuracy and efficiency. Using genome sequence data from HIV-1, Arabidopsis thaliana, Homo sapiens and Zea mays for comparison, detectIR can find lots of inverted repeats missed by existing tools whose outputs often contain many invalid cases. detectIR is open source and its source code is freely available at: https://sourceforge.net/projects/detectir.",
                "authors": [
                    {
                        "name": "Ye C."
                    },
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Liang C."
                    }
                ],
                "citationCount": 12,
                "date": "2014-11-19T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "detectIR: A novel program for detecting perfect and imperfect inverted repeats using complex numbers and vector calculation"
            },
            "pmcid": "PMC4237412",
            "pmid": "25409465"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}