{
    "additionDate": "2020-01-09T17:59:37Z",
    "biotoolsCURIE": "biotools:LGG",
    "biotoolsID": "LGG",
    "confidence_flag": "tool",
    "description": "An independently validated survival nomogram for lower grade glioma.\n\nBACKGROUND:Gliomas are the most common primary malignant brain tumor. Diffuse low-grade and intermediate-grade gliomas, which together comprise the lower-grade gliomas [LGG] (WHO grades II and III), present a therapeutic challenge to physicians due to the heterogeneity of their clinical behavior. Nomograms are useful tools for individualized estimation of survival. This study aimed to develop and independently validate a survival nomogram for patients with newly diagnosed LGG. METHODS:Data were obtained for newly diagnosed LGG patients from The Cancer Genome Atlas (TCGA) and the Ohio Brain Tumor Study (OBTS) with the following variables: tumor grade (II or III), age at diagnosis, sex, Karnofsky Performance Status (KPS), and molecular subtype (IDH mutant with 1p 19q codeletion [IDHmut-codel], IDH mutant without 1p 19q codeletion [IDHmut-non-codel], IDH wild-type [IDHwt])",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://hgittleman.shinyapps.io/LGG_Nomogram_H_Gittleman/",
    "lastUpdate": "2024-11-24T20:53:40.068409Z",
    "name": "LGG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/neuonc/noz191",
            "metadata": {
                "abstract": "Background: Gliomas are the most common primary malignant brain tumor. Diffuse low-grade and intermediate-grade gliomas, which together compose the lower-grade gliomas (LGGs; World Health Organization [WHO] grades II and III), present a therapeutic challenge to physicians due to the heterogeneity of their clinical behavior. Nomograms are useful tools for individualized estimation of survival. This study aimed to develop and independently validate a survival nomogram for patients with newly diagnosed LGG. Methods: Data were obtained for newly diagnosed LGG patients from The Cancer Genome Atlas (TCGA) and the Ohio Brain Tumor Study (OBTS) with the following variables: tumor grade (II or III), age at diagnosis, sex, Karnofsky performance status (KPS), and molecular subtype (IDH mutant with 1p/19q codeletion [IDHmut-codel], IDH mutant without 1p/19q codeletion, and IDH wild-type). Survival was assessed using Cox proportional hazards regression, random survival forests, and recursive partitioning analysis, with adjustment for known prognostic factors. The models were developed using TCGA data and independently validated using the OBTS data. Models were internally validated using 10-fold cross-validation and externally validated with calibration curves. Results: A final nomogram was validated for newly diagnosed LGG. Factors that increased the probability of survival included grade II tumor, younger age at diagnosis, having a high KPS, and the IDHmut-codel molecular subtype. Conclusions: A nomogram that calculates individualized survival probabilities for patients with newly diagnosed LGG could be useful to health care providers for counseling patients regarding treatment decisions and optimizing therapeutic approaches. Free online software for implementing this nomogram is provided: https://hgittleman.shinyapps.io/LGG_Nomogram_H_Gittleman/. Key Points: 1.?A survival nomogram for lower-grade glioma patients has been developed and externally validated. 2. Free online software for implementing this nomogram is provided allowing for ease of use by practicing health care providers.",
                "authors": [
                    {
                        "name": "Barnholtz-Sloan J.S."
                    },
                    {
                        "name": "Gittleman H."
                    },
                    {
                        "name": "Sloan A.E."
                    }
                ],
                "citationCount": 113,
                "date": "2020-05-15T00:00:00Z",
                "journal": "Neuro-Oncology",
                "title": "An independently validated survival nomogram for lower-grade glioma"
            },
            "pmcid": "PMC7229246",
            "pmid": "31621885"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
