{
    "additionDate": "2015-01-21T13:29:20Z",
    "biotoolsCURIE": "biotools:netturnp",
    "biotoolsID": "netturnp",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "bent@cbs.dtu.dk",
            "name": "Bent Petersen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Prediction whether an amino acid is located in a Beta-turn or not.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cbs.dtu.dk/services/NetTurnP/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "predicts whether an amino acid is located in a Beta-turn or not;predicts the nine Beta-turn subtypes",
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Structure report",
                        "uri": "http://edamontology.org/data_2085"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://cbs.dtu.dk/services/NetTurnP/",
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "NetTurnP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0015079",
            "metadata": {
                "abstract": "β-turns are the most common type of non-repetitive structures, and constitute on average 25% of the amino acids in proteins. The formation of β-turns plays an important role in protein folding, protein stability and molecular recognition processes. In this work we present the neural network method NetTurnP, for prediction of two-class β-turns and prediction of the individual β-turn types, by use of evolutionary information and predicted protein sequence features. It has been evaluated against a commonly used dataset BT426, and achieves a Matthews correlation coefficient of 0.50, which is the highest reported performance on a two-class prediction of β-turn and not-β-turn. Furthermore NetTurnP shows improved performance on some of the specific β-turn types. In the present work, neural network methods have been trained to predict β-turn or not and individual β-turn types from the primary amino acid sequence. The individual β-turn types I, I', II, II', VIII, VIa1, VIa2, VIba and IV have been predicted based on classifications by PROMOTIF, and the two-class prediction of β-turn or not is a superset comprised of all β-turn types. The performance is evaluated using a golden set of non-homologous sequences known as BT426. Our two-class prediction method achieves a performance of: MCC = 0.50, Qtotal = 82.1%, sensitivity = 75.6%, PPV = 68.8% and AUC = 0.864. We have compared our performance to eleven other prediction methods that obtain Matthews correlation coefficients in the range of 0.17 - 0.47. For the type specific β-turn predictions, only type I and II can be predicted with reasonable Matthews correlation coefficients, where we obtain performance values of 0.36 and 0.31, respectively. Conclusion: The NetTurnP method has been implemented as a webserver, which is freely available at http://www.cbs.dtu. dk/services/NetTurnP/. NetTurnP is the only available webserver that allows submission of multiple sequences. © 2010 Petersen et al.",
                "authors": [
                    {
                        "name": "Petersen B."
                    },
                    {
                        "name": "Lundegaard C."
                    },
                    {
                        "name": "Petersen T.N."
                    }
                ],
                "citationCount": 63,
                "date": "2010-12-10T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "NetTurnP - neural network prediction of beta-turns by use of evolutionary information and predicted protein sequence features"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}