{
    "additionDate": "2017-08-03T18:46:45Z",
    "biotoolsCURIE": "biotools:icsf",
    "biotoolsID": "icsf",
    "credit": [
        {
            "email": "zhiping.weng@umassmed.edu",
            "name": "Zhiping Weng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://zlab.umassmed.edu/"
        }
    ],
    "description": "Identify conserved structural features at sequentially degenerate locations in transcription factor binding sites. ICSF uses base-pair step parameters obtained from a collection of high-resolution DNA crystal structures to discover structural conservation that exists in the sequentially degenerate areas within a binding site and produce profiles of the structural features along the entire site.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://zlab.bu.edu/ICSF/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "homepage": "http://zlab.bu.edu/ICSF/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/icsf-identification-conserved-structural-features.html"
        }
    ],
    "name": "ICSF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Many locations within transcription factor binding sites are not sequentially conserved and appear to be degenerate. We hypothesize that some of these positions contain essential structural codes that are recognized by the transcription factors that bind to them. The structural codes can be defined by base-pair step parameters that describe the relative displacement and orientation of two adjacent base pairs in a nucleic acid structure. We have developed a method, Identification of Conserved Structural Features (ICSF), which uses base-pair step parameters obtained from a collection of high-resolution DNA crystal structures to discover structural conservation that exists in the sequentially degenerate areas within a binding site and produce profiles of the structural features along the entire site. We have focused our study on the transcription factor binding sites in the JASPAR database and have found that one-third (P-value > or = 0.05) of the binding sites contain sequentially degenerate locations with highly conserved structural features as described by the base-pair step parameters. These results will help us to gain a better understanding of the process by which transcription factors recognize their binding sites and possibly lead to an improvement in our ability to find these sites in genomic sequences. Availability: ICSF is freely available to academic users at http://zlab.bu.edu/ICSF . Supplementary information: http://zlab.bu.edu/ICSF .",
                "authors": [
                    {
                        "name": "Burden H.E."
                    },
                    {
                        "name": "Weng Z."
                    }
                ],
                "citationCount": 5,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Genome informatics. International Conference on Genome Informatics",
                "title": "Identification of conserved structural features at sequentially degenerate locations in transcription factor binding sites."
            },
            "pmid": "16362906"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}