{
    "accessibility": "Open access",
    "additionDate": "2022-06-13T10:09:32.821583Z",
    "biotoolsCURIE": "biotools:endotime",
    "biotoolsID": "endotime",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "s.ott@warwick.ac.uk",
            "name": "Sascha Ott",
            "orcidid": "https://orcid.org/0000-0002-5411-8114",
            "typeEntity": "Person",
            "url": "https://orcid.org/0000-0002-5411-8114"
        }
    ],
    "description": "A package for the temporal refinement of endometrial biopsies using an initial timing value as provided via urinary ovulation test and the measurement of expression for a panel of time-sensitive genes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AE-Mitchell/EndoTime",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-13T10:09:32.823888Z",
    "license": "GPL-3.0",
    "name": "EndoTime",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/HUMREP/DEAC006",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of European Society of Human Reproduction and Embryology.Study question: Can the accuracy of timing of luteal phase endometrial biopsies based on urinary ovulation testing be improved by measuring the expression of a small number of genes and a continuous, non-categorical modelling approach? Summary answer: Measuring the expression levels of six genes (IL2RB, IGFBP1, CXCL14, DPP4, GPX3 and SLC15A2) is sufficient to obtain substantially more accurate timing estimates and to assess the reliability of timing estimates for each sample. What is known already: Commercially available endometrial timing approaches based on gene expression require large gene sets and use a categorical approach that classifies samples as pre-receptive, receptive or post-receptive. Study design, size, duration: Gene expression was measured by RTq-PCR in different sample sets, comprising a total of 664 endometrial biopsies obtained 4-12 days after a self-reported positive home ovulation test. A further 36 endometrial samples were profiled by RTq-PCR as well as RNA-sequencing. Participants/materials, setting, methods: A computational procedure, named 'EndoTime', was established that models the temporal profile of each gene and estimates the timing of each sample. Iterating these steps, temporal profiles are gradually refined as sample timings are being updated, and confidence in timing estimates is increased. After convergence, the method reports updated timing estimates for each sample while preserving the overall distribution of time points. MAIN RESULTS AND THE ROLE OF CHANCE: The Wilcoxon rank-sum test was used to confirm that ordering samples by EndoTime estimates yields sharper temporal expression profiles for held-out genes (not used when determining sample timings) than ordering the same expression values by patient-reported times (GPX3: P < 0.005; CXCL14: P < 2.7e-6; DPP4: P < 3.7e-13). Pearson correlation between EndoTime estimates for the same sample set but based on RTq-PCR or RNA-sequencing data showed a high degree of congruency between the two (P = 8.6e-10, R2 = 0.687). Estimated timings did not differ significantly between control subjects and patients with recurrent pregnancy loss or recurrent implantation failure (P > 0.05). Large scale data: The RTq-PCR data files are available via the GitHub repository for the EndoTime software at https://github.com/AE-Mitchell/EndoTime, as is the code used for pre-processing of RTq-PCR data. The RNA-sequencing data are available on GEO (accession GSE180485). Limitations, reasons for caution: Timing estimates are informed by glandular gene expression and will only represent the temporal state of other endometrial cell types if in synchrony with the epithelium. Methods that estimate the day of ovulation are still required as these data are essential inputs in our method. Our approach, in its current iteration, performs batch correction such that larger sample batches impart greater accuracy to timing estimations. In theory, our method requires endometrial samples obtained at different days in the luteal phase. In practice, however, this is not a concern as timings based on urinary ovulation testing are associated with a sufficient level of noise to ensure that a variety of time points will be sampled. Wider implications of the findings: Our method is the first to assay the temporal state of luteal-phase endometrial samples on a continuous domain. It is freely available with fully shared data and open-source software. EndoTime enables accurate temporal profiling of any gene in luteal endometrial samples for a wide range of research applications and, potentially, clinical use.",
                "authors": [
                    {
                        "name": "Brosens J.J."
                    },
                    {
                        "name": "Fishwick K."
                    },
                    {
                        "name": "Hawkes A."
                    },
                    {
                        "name": "Lipecki J."
                    },
                    {
                        "name": "Lucas E.S."
                    },
                    {
                        "name": "Makwana K."
                    },
                    {
                        "name": "Mitchell A.E."
                    },
                    {
                        "name": "Muter J."
                    },
                    {
                        "name": "Odendaal J."
                    },
                    {
                        "name": "Ott S."
                    },
                    {
                        "name": "Vrljicak P."
                    }
                ],
                "citationCount": 1,
                "date": "2022-04-01T00:00:00Z",
                "journal": "Human Reproduction",
                "title": "EndoTime: non-categorical timing estimates for luteal endometrium"
            },
            "pmcid": "PMC8971653",
            "pmid": "35092277"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
