{
    "additionDate": "2018-05-29T19:01:01Z",
    "biotoolsCURIE": "biotools:apricot",
    "biotoolsID": "apricot",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://pypi.org/user/malvikasharan/"
        }
    ],
    "description": "Integrated computational pipeline for the sequence-based identification and characterization of RNA-binding proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/bio-apricot/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "APRICOT",
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKX137",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.RNA-binding proteins (RBPs) have been established as core components of several posttranscriptional gene regulation mechanisms. Experimental techniques such as cross-linking and coimmunoprecipitation have enabled the identification of RBPs, RNA-binding domains (RBDs) and their regulatory roles in the eukaryotic species such as human and yeast in large-scale. In contrast, our knowledge of the number and potential diversity of RBPs in bacteria is poorer due to the technical challenges associated with the existing global screening approaches. We introduce APRICOT, a computational pipeline for the sequence-based identification and characterization of proteins using RBDs known from experimental studies. The pipeline identifies functional motifs in protein sequences using positionspecific scoring matrices and Hidden Markov Models of the functional domains and statistically scores them based on a series of sequence-based features. Subsequently, APRICOT identifies putative RBPs and characterizes them by several biological properties. Here we demonstrate the application and adaptability of the pipeline on large-scale protein sets, including the bacterial proteome of Escherichia coli. APRICOT showed better performance on various datasets compared to other existing tools for the sequence-based prediction of RBPs by achieving an average sensitivity and specificity of 0.90 and 0.91 respectively. The command-line tool and its documentation are available at https://pypi.python.org/pypi/bio-apricot.",
                "authors": [
                    {
                        "name": "Sharan M."
                    },
                    {
                        "name": "Forstner K.U."
                    },
                    {
                        "name": "Eulalio A."
                    },
                    {
                        "name": "Vogel J."
                    }
                ],
                "citationCount": 8,
                "date": "2017-06-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "APRICOT: An integrated computational pipeline for the sequence-based identification and characterization of RNA-binding proteins"
            },
            "pmcid": "PMC5499795",
            "pmid": "28334975"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}