{
    "additionDate": "2018-07-16T16:54:31Z",
    "biotoolsCURIE": "biotools:conr",
    "biotoolsID": "conr",
    "credit": [
        {
            "email": "gildauby@gmail.com",
            "name": "Gilles Dauby",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multi-species estimation of geographical range parameters for preliminary assessment of conservation status following Criterion B of the International Union for Conservation of Nature.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/ConR/ConR.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/ConR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-2.0",
    "name": "ConR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1002/ece3.3704",
            "metadata": {
                "abstract": "© 2017 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.The Red List Categories and the accompanying five criteria developed by the International Union for Conservation of Nature (IUCN) provide an authoritative and comprehensive methodology to assess the conservation status of organisms. Red List criterion B, which principally uses distribution data, is the most widely used to assess conservation status, particularly of plant species. No software package has previously been available to perform large-scale multispecies calculations of the three main criterion B parameters [extent of occurrence (EOO), area of occupancy (AOO) and an estimate of the number of locations] and provide preliminary conservation assessments using an automated batch process. We developed ConR, a dedicated R package, as a rapid and efficient tool to conduct large numbers of preliminary assessments, thereby facilitating complete Red List assessment. ConR (1) calculates key geographic range parameters (AOO and EOO) and estimates the number of locations sensu IUCN needed for an assessment under criterion B; (2) uses this information in a batch process to generate preliminary assessments of multiple species; (3) summarize the parameters and preliminary assessments in a spreadsheet; and (4) provides a visualization of the results by generating maps suitable for the submission of full assessments to the IUCN Red List. ConR can be used for any living organism for which reliable georeferenced distribution data are available. As distributional data for taxa become increasingly available via large open access datasets, ConR provides a novel, timely tool to guide and accelerate the work of the conservation and taxonomic communities by enabling practitioners to conduct preliminary assessments simultaneously for hundreds or even thousands of species in an efficient and time-saving way.",
                "authors": [
                    {
                        "name": "Dauby G."
                    },
                    {
                        "name": "Stevart T."
                    },
                    {
                        "name": "Droissart V."
                    },
                    {
                        "name": "Cosiaux A."
                    },
                    {
                        "name": "Deblauwe V."
                    },
                    {
                        "name": "Simo-Droissart M."
                    },
                    {
                        "name": "Sosef M.S.M."
                    },
                    {
                        "name": "Lowry P.P."
                    },
                    {
                        "name": "Schatz G.E."
                    },
                    {
                        "name": "Gereau R.E."
                    },
                    {
                        "name": "Couvreur T.L.P."
                    }
                ],
                "citationCount": 22,
                "date": "2017-12-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "ConR: An R package to assist large-scale multispecies preliminary conservation assessments using distribution data"
            },
            "pmcid": "PMC5743656",
            "pmid": "29299301"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.2"
    ]
}