{
    "additionDate": "2015-12-02T15:00:10Z",
    "biotoolsCURIE": "biotools:hcvivdb",
    "biotoolsID": "hcvivdb",
    "collectionID": [
        "Czech Republic",
        "ELIXIR-CZ"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "info@hcvivdb.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A specialized and medically-oriented database of published variations observed within the internal ribosome entry site (IRES) variants in hepatitis C virus.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.hcvivdb.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Database ID",
                        "uri": "http://edamontology.org/data_1048"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence database search (by property)",
                    "uri": "http://edamontology.org/operation_0349"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.hcvivdb.org/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "maturity": "Mature",
    "name": "HCVIVdb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-CZ",
    "publication": [
        {
            "doi": "10.1186/s12866-016-0804-6",
            "metadata": {
                "abstract": "© 2016 The Author(s). Background: Sequence variability in the hepatitis C virus (HCV) genome has led to the development and classification of six genotypes and a number of subtypes. The HCV 5′ untranslated region mainly comprises an internal ribosomal entry site (IRES) responsible for cap-independent synthesis of the viral polyprotein and is conserved among all HCV genotypes. Description: Considering the possible high impact of variations in HCV IRES on viral protein production and thus virus replication, we decided to collect the available data on known nucleotide variants in the HCV IRES and their impact on IRES function in translation initiation. The HCV IRES variation database (HCVIVdb) is a collection of naturally occurring and engineered mutation entries for the HCV IRES. Each entry contains contextual information pertaining to the entry such as the HCV genotypic background and links to the original publication. Where available, quantitative data on the IRES efficiency in translation have been collated along with details on the reporter system used to generate the data. Data are displayed both in a tabular and graphical formats and allow direct comparison of results from different experiments. Together the data provide a central resource for researchers in the IRES and hepatitis C-oriented fields. Conclusion: The collation of over 1900 mutations enables systematic analysis of the HCV IRES. The database is mainly dedicated to detailed comparative and functional analysis of all the HCV IRES domains, which can further lead to the development of site-specific drug designs and provide a guide for future experiments. HCVIVdb is available at http://www.hcvivdb.org.",
                "authors": [
                    {
                        "name": "Floden E.W."
                    },
                    {
                        "name": "Khawaja A."
                    },
                    {
                        "name": "Vopalensky V."
                    },
                    {
                        "name": "Pospisek M."
                    }
                ],
                "citationCount": 2,
                "date": "2016-08-15T00:00:00Z",
                "journal": "BMC Microbiology",
                "title": "HCVIVdb: The hepatitis-C IRES variation database"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1,
    "version": [
        "0.7"
    ]
}