{
    "additionDate": "2016-04-27T13:48:04Z",
    "biotoolsCURIE": "biotools:ictv",
    "biotoolsID": "ictv",
    "collectionID": [
        "COVID-19"
    ],
    "credit": [
        {
            "email": "info@ictvonline.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "rki.de",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Committee for developing, refining, and maintaining a universal virus taxonomy. The goal is to categorize the multitude of known viruses into a single classification scheme that reflects their evolutionary relationships, i.e. their individual phylogenies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://talk.ictvonline.org/information/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "http://www.ictvonline.org/",
    "lastUpdate": "2024-01-03T15:31:38.012918Z",
    "name": "ICTV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "dabrowskiw@rki.de",
    "publication": [
        {
            "doi": "10.1099/JGV.0.001840",
            "metadata": {
                "abstract": "The taxonomy of viruses is developed and overseen by the International Committee on Taxonomy of Viruses (ICTV), which scrutinizes, approves and ratifies taxonomic proposals, and maintains a list of virus taxa with approved names (https://ictv.global). The ICTV has approximately 180 members who vote by simple majority. Taxon-specific Study Groups established by the ICTV have a combined membership of over 600 scientists from the wider virology community; they provide comprehensive expertise across the range of known viruses and are major contributors to the creation and evaluation of taxonomic proposals. Proposals can be submitted by anyone and will be considered by the ICTV irrespective of Study Group support. Thus, virus taxonomy is developed from within the virology community and realized by a democratic decision-making process. The ICTV upholds the distinction between a virus or replicating genetic element as a physical entity and the taxon category to which it is assigned. This is reflected by the nomenclature of the virus species taxon, which is now mandated by the ICTV to be in a binomial format (genus + species epithet) and is typographically distinct from the names of viruses. Classification of viruses below the rank of species (such as, genotypes or strains) is not within the remit of the ICTV. This article, authored by the ICTV Executive Committee, explains the principles of virus taxonomy and the organization, function, processes and resources of the ICTV, with the aim of encouraging greater understanding and interaction among the wider virology community.",
                "authors": [
                    {
                        "name": "Adriaenssens E."
                    },
                    {
                        "name": "Alfenas-Zerbini P."
                    },
                    {
                        "name": "Dutilh B.E."
                    },
                    {
                        "name": "Garcia M.L."
                    },
                    {
                        "name": "Junglen S."
                    },
                    {
                        "name": "Krupovic M."
                    },
                    {
                        "name": "Kuhn J.H."
                    },
                    {
                        "name": "Lambert A.J."
                    },
                    {
                        "name": "Lefkowitz E.J."
                    },
                    {
                        "name": "Lobocka M."
                    },
                    {
                        "name": "Murilo Zerbini F."
                    },
                    {
                        "name": "Mushegian A.R."
                    },
                    {
                        "name": "Oksanen H.M."
                    },
                    {
                        "name": "Robertson D.L."
                    },
                    {
                        "name": "Rubino L."
                    },
                    {
                        "name": "Sabanadzovic S."
                    },
                    {
                        "name": "Siddell S.G."
                    },
                    {
                        "name": "Simmonds P."
                    },
                    {
                        "name": "Smith D.B."
                    },
                    {
                        "name": "Suzuki N."
                    },
                    {
                        "name": "Van Doorslaer K."
                    },
                    {
                        "name": "Vandamme A.-M."
                    },
                    {
                        "name": "Varsani A."
                    }
                ],
                "citationCount": 8,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Journal of General Virology",
                "title": "Virus taxonomy and the role of the International Committee on Taxonomy of Viruses (ICTV)"
            },
            "pmcid": "PMC10227694",
            "pmid": "37141106"
        },
        {
            "doi": "10.1007/s00705-016-2977-6",
            "metadata": {
                "abstract": "This article lists the changes to virus taxonomy approved and ratified by the International Committee on Taxonomy of Viruses (ICTV) in April 2016. Changes to virus taxonomy (the Universal Scheme of Virus Classification of the International Committee on Taxonomy of Viruses [ICTV]) now take place annually and are the result of a multi-stage process. In accordance with the ICTV Statutes (http://www.ictvonline.org/statutes.asp), proposals submitted to the ICTV Executive Committee (EC) undergo a review process that involves input from the ICTV Study Groups (SGs) and Subcommittees (SCs), other interested virologists, and the EC. After final approval by the EC, proposals are then presented for ratification to the full ICTV membership by publication on an ICTV web site (http://www.ictvonline.org/) followed by an electronic vote. The latest set of proposals approved by the EC was made available on the ICTV website by January 2016 (https://talk.ictvonline.org/files/proposals/). A list of these proposals was then emailed on 28 March 2016 to the 148 members of ICTV, namely the EC Members, Life Members, ICTV Subcommittee Members (including the SG chairs) and ICTV National Representatives. Members were then requested to vote on whether to ratify the taxonomic proposals (voting closed on 29 April 2016).",
                "authors": [
                    {
                        "name": "Adams M.J."
                    },
                    {
                        "name": "Davison A.J."
                    },
                    {
                        "name": "Gorbalenya A.E."
                    },
                    {
                        "name": "Harrach B."
                    },
                    {
                        "name": "Harrison R.L."
                    },
                    {
                        "name": "King A.M.Q."
                    },
                    {
                        "name": "Knowles N.J."
                    },
                    {
                        "name": "Kropinski A.M."
                    },
                    {
                        "name": "Krupovic M."
                    },
                    {
                        "name": "Kuhn J.H."
                    },
                    {
                        "name": "Lefkowitz E.J."
                    },
                    {
                        "name": "Mushegian A.R."
                    },
                    {
                        "name": "Nibert M."
                    },
                    {
                        "name": "Sabanadzovic S."
                    },
                    {
                        "name": "Sanfacon H."
                    },
                    {
                        "name": "Siddell S.G."
                    },
                    {
                        "name": "Simmonds P."
                    },
                    {
                        "name": "Varsani A."
                    },
                    {
                        "name": "Zerbini F.M."
                    }
                ],
                "citationCount": 244,
                "date": "2016-10-01T00:00:00Z",
                "journal": "Archives of Virology",
                "title": "Ratification vote on taxonomic proposals to the International Committee on Taxonomy of Viruses (2016)"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
