{
    "additionDate": "2021-11-01T06:49:40.624182Z",
    "biotoolsCURIE": "biotools:open-specy",
    "biotoolsID": "open-specy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wcowg001@ucr.edu",
            "name": "Win Cowger",
            "orcidid": "https://orcid.org/0000-0001-9226-3104",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open Specy is a web application and R package for for microplastic spectral classification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Species frequency estimation",
                    "uri": "http://edamontology.org/operation_3221"
                }
            ]
        }
    ],
    "homepage": "http://www.openspecy.org",
    "language": [
        "R",
        "JavaScript"
    ],
    "lastUpdate": "2021-11-01T06:49:40.675156Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/wincowgerDEV/OpenSpecy"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/wincowgerDEV/OpenSpecy/issues"
        }
    ],
    "name": "Open Specy",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.1C00123",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Microplastic pollution research has suffered from inadequate data and tools for spectral (Raman and infrared) classification. Spectral matching tools often are not accurate for microplastics identification and are cost-prohibitive. Lack of accuracy stems from the diversity of microplastic pollutants, which are not represented in spectral libraries. Here, we propose a viable software solution: Open Specy. Open Specy is on the web (www.openspecy.org) and in an R package. Open Specy is free and allows users to view, process, identify, and share their spectra to a community library. Users can upload and process their spectra using smoothing (Savitzky-Golay filter) and polynomial baseline correction techniques (IModPolyFit). The processed spectrum can be downloaded to be used in other applications or identified using an onboard reference library and correlation-based matching criteria. Open Specy's data sharing and session log features ensure reproducible results. Open Specy houses a growing library of reference spectra, which increasingly represents the diversity of microplastics as a contaminant suite. We compared the functionality and accuracy of Open Specy for microplastic identification to commonly used spectral analysis software. We found that Open Specy was the only open source software and the only software with a community library, and Open Specy had comparable accuracy to popular software (OMNIC Picta and KnowItAll). Future developments will enhance spectral identification accuracy as the reference library and functionality grows through community-contributed spectra and community-developed code. Open Specy can also be used for applications beyond microplastic analysis. Open Specy's source code is open source (CC-BY-4.0, attribution only) (https://github.com/wincowgerDEV/OpenSpecy).",
                "authors": [
                    {
                        "name": "Cowger W."
                    },
                    {
                        "name": "Steinmetz Z."
                    },
                    {
                        "name": "Gray A."
                    },
                    {
                        "name": "Munno K."
                    },
                    {
                        "name": "Lynch J."
                    },
                    {
                        "name": "Hapich H."
                    },
                    {
                        "name": "Primpke S."
                    },
                    {
                        "name": "De Frond H."
                    },
                    {
                        "name": "Rochman C."
                    },
                    {
                        "name": "Herodotou O."
                    }
                ],
                "citationCount": 7,
                "date": "2021-06-01T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Microplastic Spectral Classification Needs an Open Source Community: Open Specy to the Rescue!"
            },
            "pmid": "34009953",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}