{
    "additionDate": "2018-08-09T16:37:20Z",
    "biotoolsCURIE": "biotools:subvis",
    "biotoolsID": "subvis",
    "collectionID": [
        "CRAN"
    ],
    "credit": [
        {
            "email": "sabarlowe@email.wcu.edu",
            "name": "Scott Barlowe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Visual Exploration of Protein Alignments Resulting from Multiple Substitution Matrices.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/SubVis/SubVis.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/SubVis/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "SubVis",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.7717/peerj.3492",
            "metadata": {
                "abstract": "© 2017 Barlowe et al.Understanding how proteins mutate is critical to solving a host of biological problems. Mutations occur when an amino acid is substituted for another in a protein sequence. The set of likelihoods for amino acid substitutions is stored in a matrix and input to alignment algorithms. The quality of the resulting alignment is used to assess the similarity of two or more sequences and can vary according to assumptions modeled by the substitution matrix. Substitution strategies with minor parameter variations are often grouped together in families. For example, theBLOSUMandPAMmatrix families are commonly used because they provide a standard, predefined way of modeling substitutions. However, researchers often do not know if a given matrix family or any individual matrix within a family is the most suitable. Furthermore, predefined matrix families may inaccurately reflect a particular hypothesis that a researcher wishes to model or otherwise result in unsatisfactory alignments. In these cases, the ability to compare the effects of one or more custom matrices may be needed. This laborious process is often performed manually because the ability to simultaneously load multiple matrices and then compare their effects on alignments is not readily available in current software tools. This paper presents SubVis, an interactive R package for loading and applying multiple substitution matrices to pairwise alignments. Users can simultaneously explore alignments resulting from multiple predefined and custom substitution matrices. SubVis utilizes several of the alignment functions found in R, a common language among protein scientists. Functions are tied together with the Shiny platform which allows the modification of input parameters. Information regarding alignment quality and individual amino acid substitutions is displayed with the JavaScript language which provides interactive visualizations for revealing both high-level and low-level alignment information.",
                "authors": [
                    {
                        "name": "Barlowe S."
                    },
                    {
                        "name": "Coan H.B."
                    },
                    {
                        "name": "Youker R.T."
                    }
                ],
                "citationCount": 1,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "SubVis: An interactive R package for exploring the effects of multiple substitution matrices on pairwise sequence alignment"
            },
            "pmcid": "PMC5490468",
            "pmid": "28674656"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
