{
    "additionDate": "2022-08-05T09:21:08.946438Z",
    "biotoolsCURIE": "biotools:mitohifi",
    "biotoolsID": "mitohifi",
    "description": "Find, circularise and annotate mitogenome from PacBio assemblies",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marcelauliano/MitoHiFi",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-05T09:21:08.949868Z",
    "license": "MIT",
    "name": "MitoHiFi",
    "owner": "alexcorm",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13160",
            "metadata": {
                "abstract": "© 2020 The Authors. Molecular Ecology Resources published by John Wiley & Sons LtdThanks to the development of high-throughput sequencing technologies, target enrichment sequencing of nuclear ultraconserved DNA elements (UCEs) now allows routine inference of phylogenetic relationships from thousands of genomic markers. Recently, it has been shown that mitochondrial DNA (mtDNA) is frequently sequenced alongside the targeted loci in such capture experiments. Despite its broad evolutionary interest, mtDNA is rarely assembled and used in conjunction with nuclear markers in capture-based studies. Here, we developed MitoFinder, a user-friendly bioinformatic pipeline, to efficiently assemble and annotate mitogenomic data from hundreds of UCE libraries. As a case study, we used ants (Formicidae) for which 501 UCE libraries have been sequenced whereas only 29 mitogenomes are available. We compared the efficiency of four different assemblers (IDBA-UD, MEGAHIT, MetaSPAdes, and Trinity) for assembling both UCE and mtDNA loci. Using MitoFinder, we show that metagenomic assemblers, in particular MetaSPAdes, are well suited to assemble both UCEs and mtDNA. Mitogenomic signal was successfully extracted from all 501 UCE libraries, allowing us to confirm species identification using CO1 barcoding. Moreover, our automated procedure retrieved 296 cases in which the mitochondrial genome was assembled in a single contig, thus increasing the number of available ant mitogenomes by an order of magnitude. By utilizing the power of metagenomic assemblers, MitoFinder provides an efficient tool to extract complementary mitogenomic data from UCE libraries, allowing testing for potential mitonuclear discordance. Our approach is potentially applicable to other sequence capture methods, transcriptomic data and whole genome shotgun sequencing in diverse taxa. The MitoFinder software is available from GitHub (https://github.com/RemiAllio/MitoFinder).",
                "authors": [
                    {
                        "name": "Allio R."
                    },
                    {
                        "name": "Delsuc F."
                    },
                    {
                        "name": "Nabholz B."
                    },
                    {
                        "name": "Prosdocimi F."
                    },
                    {
                        "name": "Romiguier J."
                    },
                    {
                        "name": "Schomaker-Bastos A."
                    }
                ],
                "citationCount": 55,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "MitoFinder: Efficient automated large-scale extraction of mitogenomic data in target enrichment phylogenomics"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "version": [
        "2.2"
    ]
}
