{
    "additionDate": "2021-01-18T09:51:43Z",
    "biotoolsCURIE": "biotools:mycocsm",
    "biotoolsID": "mycocsm",
    "confidence_flag": "tool",
    "description": "Using Graph-Based Signatures to Identify Safe Potent Hits against Mycobacteria.\n\nmycoCSM: identifying safe potent hits against Mycobacteria.\n\nDouglas E. V. Pires & David B. Ascher.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://biosig.unimelb.edu.au/myco_csm",
    "lastUpdate": "2021-03-08T08:23:46Z",
    "name": "mycoCSM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00362",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Development of new potent, safe drugs to treat Mycobacteria has proven to be challenging, with limited hit rates of initial screens restricting subsequent development efforts. Despite significant efforts and the evolution of quantitative structure-activity relationship as well as machine learning-based models for computationally predicting molecule bioactivity, there is an unmet need for efficient and reliable methods for identifying biologically active compounds against Mycobacterium that are also safe for humans. Here we developed mycoCSM, a graph-based signature approach to rapidly identify compounds likely to be active against bacteria from the genus Mycobacterium, or against specific Mycobacteria species. mycoCSM was trained and validated on eight organism-specific and for the first time a general Mycobacteria data set, achieving correlation coefficients of up to 0.89 on cross-validation and 0.88 on independent blind tests, when predicting bioactivity in terms of minimum inhibitory concentration. In addition, we also developed a predictor to identify those compounds likely to penetrate in necrotic tuberculosis foci, which achieved a correlation coefficient of 0.75. Together with a built-in estimator of the maximum tolerated dose in humans, we believe this method will provide a valuable resource to enrich screening libraries with potent, safe molecules. To provide simple guidance in the selection of libraries with favorable anti-Mycobacteria properties, we made mycoCSM freely available online at http://biosig.unimelb.edu.au/myco_csm.",
                "authors": [
                    {
                        "name": "Pires D.E.V."
                    },
                    {
                        "name": "Ascher D.B."
                    }
                ],
                "citationCount": 6,
                "date": "2020-07-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "MycoCSM: Using Graph-Based Signatures to Identify Safe Potent Hits against Mycobacteria"
            },
            "pmid": "32615035"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ]
}