{
    "accessibility": "Open access",
    "additionDate": "2023-01-25T10:05:03.802136Z",
    "biotoolsCURIE": "biotools:4d-fed-gnn",
    "biotoolsID": "4d-fed-gnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Islem Rekik"
        },
        {
            "name": "Zeynep Gurler"
        }
    ],
    "description": "Federated Brain Graph Evolution Prediction using Decentralized Connectivity Datasets with Temporally-varying Acquisitions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://github.com/basiralab/4D-FedGNN-Plus",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-25T10:05:03.807367Z",
    "license": "Not licensed",
    "name": "4D-FED-GNN++",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3225083",
            "metadata": {
                "abstract": "IEEEForeseeing the evolution of brain connectivity between anatomical regions from a baseline observation can propel early disease diagnosis and clinical decision making. Such task becomes challenging when learning from multiple decentralized datasets with missing timepoints (e.g., datasets collected from different hospitals with a varying sequence of acquisitions). Federated learning (FL) is an emerging paradigm that enables collaborative learning among multiple clients (i.e., hospitals) in a fully privacy-preserving fashion. However, to the best of our knowledge, there is no FL work that foresees the time-dependent brain connectivity evolution from a single timepoint &#x2013;let alone learning from non-iid decentralized longitudinal datasets with <italic>varying acquisition timepoints</italic>. In this paper, we propose the first FL framework to significantly boost the predictive performance of local hospitals with missing acquisition timepoints while benefiting from other hospitals with available data at those timepoints without sharing data. Specifically, we introduce 4D-FED-GNN+, a novel longitudinal federated GNN framework that works in (i) a uni-mode, where it acts as a graph self-encoder if the next timepoint is locally missing or (ii) in a dual-mode, where it concurrently acts as a graph generator and a self-encoder if the local follow-up data is available. Further, we propose a dual federation strategy, where (i) GNN layer-wise weight aggregation and (ii) pairwise GNN weight exchange between hospitals in a random order. To improve the performance of the poorly-conditioned hospitals (e.g., consecutive missing timepoints, intermediate missing timepoint), we further propose a second variant, namely 4D-FED-GNN++, which federates based on an ordering of the local hospitals computed using their incomplete sequential patterns. Our comprehensive experiments on real longitudinal datasets show that overall 4D-FED-GNN+ and 4D-FED-GNN++ significantly outperform benchmark methods. Our source code is available at https: //github.com/basiralab/4D-FedGNN-Plus.",
                "authors": [
                    {
                        "name": "Gurler Z."
                    },
                    {
                        "name": "Rekik I."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Federated Brain Graph Evolution Prediction using Decentralized Connectivity Datasets with Temporally-varying Acquisitions"
            },
            "pmid": "36441899"
        }
    ],
    "toolType": [
        "Script",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ]
}
