{
    "additionDate": "2022-09-19T16:01:41.053108Z",
    "biotoolsCURIE": "biotools:adastra",
    "biotoolsID": "adastra",
    "cost": "Free of charge",
    "description": "The database of Allelic Dosage-corrected Allele-Specific human Transcription factor binding sites provides a genomic map of allele-specific binding at hundreds thousands single-nucleotide polymorphisms constructed by meta-analysis of thousands of ChIP-Seq experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://adastra.autosome.org/bill-cipher/help"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://adastra.autosome.org/bill-cipher/downloads",
            "version": "5.1.2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://adastra.autosome.org",
    "lastUpdate": "2024-11-24T15:37:29.438529Z",
    "maturity": "Mature",
    "name": "ADASTRA",
    "owner": "ivan.kulakovskiy",
    "publication": [
        {
            "doi": "10.1038/s41467-021-23007-0",
            "metadata": {
                "abstract": "Sequence variants in gene regulatory regions alter gene expression and contribute to phenotypes of individual cells and the whole organism, including disease susceptibility and progression. Single-nucleotide variants in enhancers or promoters may affect gene transcription by altering transcription factor binding sites. Differential transcription factor binding in heterozygous genomic loci provides a natural source of information on such regulatory variants. We present a novel approach to call the allele-specific transcription factor binding events at single-nucleotide variants in ChIP-Seq data, taking into account the joint contribution of aneuploidy and local copy number variation, that is estimated directly from variant calls. We have conducted a meta-analysis of more than 7 thousand ChIP-Seq experiments and assembled the database of allele-specific binding events listing more than half a million entries at nearly 270 thousand single-nucleotide polymorphisms for several hundred human transcription factors and cell types. These polymorphisms are enriched for associations with phenotypes of medical relevance and often overlap eQTLs, making candidates for causality by linking variants with molecular mechanisms. Specifically, there is a special class of switching sites, where different transcription factors preferably bind alternative alleles, thus revealing allele-specific rewiring of molecular circuitry.",
                "authors": [
                    {
                        "name": "Abramov S."
                    },
                    {
                        "name": "Baulin E."
                    },
                    {
                        "name": "Boytsov A."
                    },
                    {
                        "name": "Bykova D."
                    },
                    {
                        "name": "Favorov A.V."
                    },
                    {
                        "name": "Fridman M.V."
                    },
                    {
                        "name": "Kolmykov S.K."
                    },
                    {
                        "name": "Kolpakov F."
                    },
                    {
                        "name": "Kulakovskiy I.V."
                    },
                    {
                        "name": "Makeev V.J."
                    },
                    {
                        "name": "Penzar D.D."
                    },
                    {
                        "name": "Vorontsov I.E."
                    },
                    {
                        "name": "Yevshin I."
                    }
                ],
                "citationCount": 52,
                "date": "2021-05-12T00:00:00Z",
                "journal": "Nature Communications",
                "title": "Landscape of allele-specific transcription factor binding in the human genome"
            },
            "pmcid": "PMC8115691",
            "pmid": "33980847",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "version": [
        "5.1.2"
    ]
}
