{
    "additionDate": "2019-11-14T19:31:39Z",
    "biotoolsCURIE": "biotools:iDNA6mA-Rice",
    "biotoolsID": "iDNA6mA-Rice",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangyong916@uestc.edu.cn",
            "name": "Yong Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "chenweiimu@gmail.com",
            "name": "Wei Chen",
            "typeEntity": "Person"
        },
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "A Computational Tool for Detecting N6-Methyladenine Sites in Rice | Home About us Web-Server Contact us Download Citation | 6mA is formed by transferring methyl groups to the 6th position of the adenine ring catalyzed by methyl-transferases. It is a non-canonical DNA modification that is present at low levels in different eukaryotes. 6mA possesses similar characteristics between prokaryotes and eukaryotes. Its functions display diversity, such as guiding the discrimination between original and newly synthesized DNA strand after replication, regulating gene transcription and repressing transposable elements; in the cell cycle, reducing the stability of base pairings for opening DNA duplexes. Strikingly, the protection from methylation is an inherited state that, however, can be modified by environmental conditions",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://lin-group.cn/server/iDNA6mA-Rice/download.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/server/iDNA6mA-Rice",
    "lastUpdate": "2020-12-14T08:30:37Z",
    "name": "iDNA6mA-Rice",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00793",
            "metadata": {
                "abstract": "© Copyright © 2019 Lv, Dao, Guan, Zhang, Tan, Zhang, Chen and Lin.DNA N6-methyladenine (6mA) is a dominant DNA modification form and involved in many biological functions. The accurate genome-wide identification of 6mA sites may increase understanding of its biological functions. Experimental methods for 6mA detection in eukaryotes genome are laborious and expensive. Therefore, it is necessary to develop computational methods to identify 6mA sites on a genomic scale, especially for plant genomes. Based on this consideration, the study aims to develop a machine learning-based method of predicting 6mA sites in the rice genome. We initially used mono-nucleotide binary encoding to formulate positive and negative samples. Subsequently, the machine learning algorithm named Random Forest was utilized to perform the classification for identifying 6mA sites. Our proposed method could produce an area under the receiver operating characteristic curve of 0.964 with an overall accuracy of 0.917, as indicated by the fivefold cross-validation test. Furthermore, an independent dataset was established to assess the generalization ability of our method. Finally, an area under the receiver operating characteristic curve of 0.981 was obtained, suggesting that the proposed method had good performance of predicting 6mA sites in the rice genome. For the convenience of retrieving 6mA sites, on the basis of the computational method, we built a freely accessible web server named iDNA6mA-Rice at http://lin-group.cn/server/iDNA6mA-Rice.",
                "authors": [
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Dao F.-Y."
                    },
                    {
                        "name": "Guan Z.-X."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Tan J.-X."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 25,
                "date": "2019-09-10T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "iDNA6mA-Rice: A Computational Tool for Detecting N6-Methyladenine Sites in Rice"
            },
            "pmcid": "PMC6746913",
            "pmid": "31552096"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}