{
    "accessibility": "Open access",
    "additionDate": "2022-10-27T10:30:27.557480Z",
    "biotoolsCURIE": "biotools:bayesrco",
    "biotoolsID": "bayesrco",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fanny.mollandin@inrae.fr",
            "name": "Fanny Mollandin",
            "typeEntity": "Person"
        }
    ],
    "description": "BayesRCO is a software for complex trait prediction with Bayesian hierarchical models using genome-wide genetic variation grouped into potentially overlapping annotation categories based on prior biological information",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fmollandin/BayesRCO",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2024-11-24T15:26:02.441970Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/fmollandin/BayesRCO"
        }
    ],
    "name": "BayesRCO",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04914-5",
            "metadata": {
                "abstract": "Background: It is now widespread in livestock and plant breeding to use genotyping data to predict phenotypes with genomic prediction models. In parallel, genomic annotations related to a variety of traits are increasing in number and granularity, providing valuable insight into potentially important positions in the genome. The BayesRC model integrates this prior biological information by factorizing the genome according to disjoint annotation categories, in some cases enabling improved prediction of heritable traits. However, BayesRC is not adapted to cases where markers may have multiple annotations. Results: We propose two novel Bayesian approaches to account for multi-annotated markers through a cumulative (BayesRC+) or preferential (BayesRCπ) model of the contribution of multiple annotation categories. We illustrate their performance on simulated data with various genetic architectures and types of annotations. We also explore their use on data from a backcross population of growing pigs in conjunction with annotations constructed using the PigQTLdb. In both simulated and real data, we observed a modest improvement in prediction quality with our models when used with informative annotations. In addition, our results show that BayesRC+ successfully prioritizes multi-annotated markers according to their posterior variance, while BayesRCπ provides a useful interpretation of informative annotations for multi-annotated markers. Finally, we explore several strategies for constructing annotations from a public database, highlighting the importance of careful consideration of this step. Conclusion: When used with annotations that are relevant to the trait under study, BayesRCπ and BayesRC+ allow for improved prediction and prioritization of multi-annotated markers, and can provide useful biological insight into the genetic architecture of traits.",
                "authors": [
                    {
                        "name": "Croiseau P."
                    },
                    {
                        "name": "Gilbert H."
                    },
                    {
                        "name": "Mollandin F."
                    },
                    {
                        "name": "Rau A."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Accounting for overlapping annotations in genomic prediction models of complex traits"
            },
            "pmcid": "PMC9446854",
            "pmid": "36068513"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
