{
    "additionDate": "2021-01-18T07:27:30Z",
    "biotoolsCURIE": "biotools:hspmdb",
    "biotoolsID": "hspmdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ankurgautam@imtech.res.in",
            "name": "Ankur Gautam",
            "typeEntity": "Person"
        },
        {
            "email": "deepaks@imtech.res.in",
            "name": "Deepak Sharma",
            "typeEntity": "Person"
        }
    ],
    "description": "A computational repository of heat shock protein modulators.\n\nA bird's-eye view of Heat Shock Proteins.\n\nHSPMdb will assist the scientific community working in the area of chaperone biology for designing novel inhibitors. It will also be useful for creating datasets for developing novel scaffold using in silico prediction algorithms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.imtech.res.in/bvs/hspmdb/index.php",
    "lastUpdate": "2021-03-18T09:10:46Z",
    "name": "HSPMdb",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA003",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Heat shock proteins (Hsp) are among highly conserved proteins across all domains of life. Though originally discovered as a cellular response to stress, these proteins are also involved in a wide range of cellular functions such as protein refolding, protein trafficking and cellular signalling. A large number of potential Hsp modulators are under clinical trials against various human diseases. As the number of modulators targeting Hsps is growing, there is a need to develop a comprehensive knowledge repository of these findings which is largely scattered. We have thus developed a web-accessible database, HSPMdb, which is a first of its kind manually curated repository of experimentally validated Hsp modulators (activators and inhibitors). The data was collected from 176 research articles and current version of HSPMdb holds 10 223 entries of compounds that are known to modulate activities of five major Hsps (Hsp100, Hsp90, Hsp70, Hsp60 and Hsp40) originated from 15 different organisms (i.e. human, yeast, bacteria, virus, mouse, rat, bovine, porcine, canine, chicken, Trypanosoma brucei and Plasmodium falciparum). HSPMdb provides comprehensive information on biological activities as well as the chemical properties of Hsp modulators. The biological activities of modulators are presented as enzymatic activity and cellular activity. Under the enzymatic activity field, parameters such as IC50, EC50, DC50, Ki and KD have been provided. In the cellular activity field, complete information on cellular activities (percentage cell growth inhibition, EC50 and GI50), type of cell viability assays and cell line used has been provided. One of the important features of HSPMdb is that it allows users to screen whether or not their compound of interest has any similarity with the previously known Hsp modulators. We anticipate that HSPMdb would become a valuable resource for the broader scientific community working in the area of chaperone biology and protein misfolding diseases. HSPMdb is freely accessible at http://bioinfo.imtech.res.in/bvs/hspmdb/index.php.",
                "authors": [
                    {
                        "name": "Gautam A."
                    },
                    {
                        "name": "Nagpal G."
                    },
                    {
                        "name": "Puri A."
                    },
                    {
                        "name": "Sharma D."
                    },
                    {
                        "name": "Singh B."
                    },
                    {
                        "name": "Singh P."
                    },
                    {
                        "name": "Unik B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "HSPMdb: A computational repository of heat shock protein modulators"
            },
            "pmcid": "PMC7043294",
            "pmid": "32090260"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
