{
    "additionDate": "2019-02-19T12:39:46Z",
    "biotoolsCURIE": "biotools:FoodMicrobionet",
    "biotoolsID": "FoodMicrobionet",
    "credit": [
        {
            "name": "ELIXIR-ITA-UniNa",
            "typeEntity": "Institute",
            "typeRole": [
                "Documentor"
            ]
        }
    ],
    "description": "Data resource collecting taxonomic composition and related metadata of > 2300 food and food-related samples. Data were produced according to a standardized pipeline and each sample is identified according the FoodEx2 classification (developed by the European Food Safety Authority to facilitate the comparison among different studies).",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.foodmicrobionet.org",
    "lastUpdate": "2019-03-14T13:44:29Z",
    "name": "FoodMicrobionet",
    "owner": "nunziodago",
    "publication": [
        {
            "doi": "10.1016/j.ijfoodmicro.2015.12.001",
            "metadata": {
                "abstract": "© 2015 Published by Elsevier B.V.Amplicon targeted high-throughput sequencing has become a popular tool for the culture-independent analysis of microbial communities. Although the data obtained with this approach are portable and the number of sequences available in public databases is increasing, no tool has been developed yet for the analysis and presentation of data obtained in different studies. This work describes an approach for the development of a database for the rapid exploration and analysis of data on food microbial communities. Data from seventeen studies investigating the structure of bacterial communities in dairy, meat, sourdough and fermented vegetable products, obtained by 16S rRNA gene targeted high-throughput sequencing, were collated and analysed using Gephi, a network analysis software. The resulting database, which we named FoodMicrobionet, was used to analyse nodes and network properties and to build an interactive web-based visualisation. The latter allows the visual exploration of the relationships between Operational Taxonomic Units (OTUs) and samples and the identification of core- and sample-specific bacterial communities. It also provides additional search tools and hyperlinks for the rapid selection of food groups and OTUs and for rapid access to external resources (NCBI taxonomy, digital versions of the original articles). Microbial interaction network analysis was carried out using CoNet on datasets extracted from FoodMicrobionet: the complexity of interaction networks was much lower than that found for other bacterial communities (human microbiome, soil and other environments). This may reflect both a bias in the dataset (which was dominated by fermented foods and starter cultures) and the lower complexity of food bacterial communities. Although some technical challenges exist, and are discussed here, the net result is a valuable tool for the exploration of food bacterial communities by the scientific community and food industry.",
                "authors": [
                    {
                        "name": "Parente E."
                    },
                    {
                        "name": "Cocolin L."
                    },
                    {
                        "name": "De Filippis F."
                    },
                    {
                        "name": "Zotta T."
                    },
                    {
                        "name": "Ferrocino I."
                    },
                    {
                        "name": "O'Sullivan O."
                    },
                    {
                        "name": "Neviani E."
                    },
                    {
                        "name": "De Angelis M."
                    },
                    {
                        "name": "Cotter P.D."
                    },
                    {
                        "name": "Ercolini D."
                    }
                ],
                "citationCount": 34,
                "date": "2016-02-16T00:00:00Z",
                "journal": "International Journal of Food Microbiology",
                "title": "FoodMicrobionet: A database for the visualisation and exploration of food bacterial communities based on network analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        }
    ],
    "validated": 1,
    "version": [
        "3.1"
    ]
}