{
    "accessibility": "Open access",
    "additionDate": "2024-03-27T14:45:55.984492Z",
    "biotoolsCURIE": "biotools:megaltr",
    "biotoolsID": "megaltr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "achraf.elallali@um6p.ma",
            "name": "Achraf El Allali",
            "typeEntity": "Person"
        },
        {
            "email": "morad.mokhtar@ageri.sci.eg",
            "name": "Morad M. Mokhtar",
            "typeEntity": "Person"
        }
    ],
    "description": "Web server and standalone pipeline for detecting and annotating LTR-retrotransposons in plant genomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://bioinformatics.um6p.ma/MegaLTR",
    "language": [
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2024-03-27T14:45:55.987821Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MoradMMokhtar/MegaLTR"
        }
    ],
    "name": "MegaLTR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2023.1237426",
            "metadata": {
                "abstract": "LTR-retrotransposons (LTR-RTs) are a class of RNA-replicating transposon elements (TEs) that can alter genome structure and function by moving positions, repositioning genes, shifting exons, and causing chromosomal rearrangements. LTR-RTs are widespread in many plant genomes and constitute a significant portion of the genome. Their movement and activity in eukaryotic genomes can provide insight into genome evolution and gene function, especially when LTR-RTs are located near or within genes. Building the redundant and non-redundant LTR-RTs libraries and their annotations for species lacking this resource requires extensive bioinformatics pipelines and expensive computing power to analyze large amounts of genomic data. This increases the need for online services that provide computational resources with minimal overhead and maximum efficiency. Here, we present MegaLTR as a web server and standalone pipeline that detects intact LTR-RTs at the whole-genome level and integrates multiple tools for structure-based, homologybased, and de novo identification, classification, annotation, insertion time determination, and LTR-RT gene chimera analysis. MegaLTR also provides statistical analysis and visualization with multiple tools and can be used to accelerate plant species discovery and assist breeding programs in their efforts to improve genomic resources. We hope that the development of online services such as MegaLTR, which can analyze large amounts of genomic data, will become increasingly important for the automated detection and annotation of LTR-RT elements.",
                "authors": [
                    {
                        "name": "El Allali A."
                    },
                    {
                        "name": "Mokhtar M.M."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "MegaLTR: a web server and standalone pipeline for detecting and annotating LTR-retrotransposons in plant genomes"
            },
            "pmcid": "PMC10552921",
            "pmid": "37810401"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
