
{
    "credit": [
        {
            "email": "cuiqinghua@hsc.pku.edu.cn",
            "name": "Qinghua Cui（崔庆华）",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cuilab.cn/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cuilab.cn/#tabs-4"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/lncdisease-predicting-lncrna-disease-associations.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 The Author(s).LncRNAs represent a large class of noncoding RNA molecules that have important functions and play key roles in a variety of human diseases. There is an urgent need to develop bioinformatics tools as to gain insight into lncRNAs. This study developed a sequence-based bioinformatics method, LncDisease, to predict the lncRNA-disease associations based on the crosstalk between lncRNAs and miRNAs. Using LncDisease, we predicted the lncRNAs associated with breast cancer and hypertension. The breast-cancer-associated lncRNAs were studied in two breast tumor cell lines, MCF-7 and MDA-MB-231. The qRT-PCR results showed that 11 (91.7%) of the 12 predicted lncRNAs could be validated in both breast cancer cell lines. The hypertensionassociated lncRNAs were further evaluated in human vascular smooth muscle cells (VSMCs) stimulatedwith angiotensin II (Ang II). The qRT-PCR results showed that 3 (75.0%) of the 4 predicted lncRNAs could be validated in Ang II-treated human VSMCs. In addition, we predicted 6 diseases associated with the lncRNA GAS5 and validated 4 (66.7%) of them by literature mining. These results greatly support the specificity and efficacy of LncDisease in the study of lncRNAs in human diseases. The LncDisease software is freely available on the Software Page: http://www.cuilab.cn/.",
            "authors": [
                "Wang J.",
                "Ma R.",
                "Ma W.",
                "Chen J.",
                "Yang J.",
                "Xi Y.",
                "Cui Q."
            ],
            "cit_count": 20,
            "journal": "Nucleic Acids Research",
            "pmid": "26887819",
            "title": "LncDisease: A sequence based bioinformatics tool for predicting lncRNA-disease associations",
            "year": "2016-05-19"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lncdisease",
        "biotoolsID": "lncdisease",
        "description": "Novel computational method and tool to predict the associations between lncRNAs and diseases.",
        "homepage": "http://www.cuilab.cn/#tabs-4",
        "name": "LncDisease"
    }
}