{
    "additionDate": "2022-09-09T09:25:45.975749Z",
    "biotoolsCURIE": "biotools:cots",
    "biotoolsID": "cots",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Rupesh Agrawal"
        },
        {
            "name": "Vishali Gupta"
        }
    ],
    "description": "A consensus-based decision tool for initiating antitubercular therapy in ocular tuberculosis.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.oculartb.net/cots-calc",
    "language": [
        "Delphi"
    ],
    "lastUpdate": "2024-11-24T15:40:18.723777Z",
    "name": "COTS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/s41433-022-02147-7",
            "metadata": {
                "abstract": "Objective: To introduce the Collaborative Ocular Tuberculosis Study (COTS) Calculator, an online clinical scoring system for initiating antitubercular therapy (ATT) in patients with ocular tuberculosis (TB). Method: The COTS Calculator was derived from COTS Consensus (COTS CON) data, which has previously published consensus guidelines. Using a two-step Delphi method, 81 experts evaluated 486 clinical scenario-based questions, ranking their likelihood of initiating ATT in each specific scenario. Each scenario was a permutation of the results and/or availability of five following components—clinical phenotype, endemicity, two immunological (tuberculin skin test, interferon-γ release assay) and one radiological (chest X-Ray) test results—and a sixth component further stratifying three of the clinical phenotypes. The median scores and interquartile ranges (IQR) of each scenario were tabulated, representing the expert consensus on whether to initiate ATT in that scenario. The consensus table was encoded to develop the COTS Calculator. Results: The COTS Calculator can be accessed online at: https://www.oculartb.net/cots-calc. The attending physician can select the conditions present in the patient, which will generate a median score from 1 to 5. 114 out of 486 scenarios (24%) deliberated had a median score of 5 indicating expert consensus to initiate ATT. Conclusion: The COTS Calculator is an efficient, low-cost, evidence and experience-based clinical tool to guide ATT initiation. While it holds substantial promise in improving standard-of-care for ocular-TB patients, future validation studies can help to as certain its clinical utility and reliability.",
                "authors": [
                    {
                        "name": "Agrawal R."
                    },
                    {
                        "name": "Betzler B.K."
                    },
                    {
                        "name": "Gupta V."
                    },
                    {
                        "name": "Kempen J.H."
                    },
                    {
                        "name": "Ludi Z."
                    },
                    {
                        "name": "Mahajan S."
                    },
                    {
                        "name": "McCluskey P."
                    },
                    {
                        "name": "Nguyen Q.D."
                    },
                    {
                        "name": "Pavesio C."
                    },
                    {
                        "name": "Rousellot A."
                    },
                    {
                        "name": "Smith J.R."
                    },
                    {
                        "name": "Testi I."
                    }
                ],
                "citationCount": 8,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Eye (Basingstoke)",
                "title": "The Collaborative Ocular Tuberculosis Study (COTS) calculator—a consensus-based decision tool for initiating antitubercular therapy in ocular tuberculosis"
            },
            "pmcid": "PMC10170101",
            "pmid": "35764876"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
