{
    "additionDate": "2022-10-30T10:05:33.719022Z",
    "biotoolsCURIE": "biotools:circ-psbla",
    "biotoolsID": "circ-psbla",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Xiujuan Lei"
        },
        {
            "name": "Yajing Guo"
        }
    ],
    "description": "A pseudo-Siamese framework for circRNA-RBP binding sites prediction integrating BiLSTM and soft attention mechanism.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gyj9811/circ-pSBLA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:25:16.351039Z",
    "license": "Not licensed",
    "name": "circ-pSBLA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ymeth.2022.09.003",
            "metadata": {
                "abstract": "Circular RNAs (circRNAs) are widely expressed in tissues and play a key role in diseases through interacting with RNA binding proteins (RBPs). Since the high cost of traditional technology, computational methods are developed to identify the binding sites between circRNAs and RBPs. Unfortunately, these methods suffer from the insufficient learning of features and the single classification of output. To address these limitations, we propose a novel method named circ-pSBLA which constructs a pseudo-Siamese framework integrating Bi-directional long short-term memory (BiLSTM) network and soft attention mechanism for circRNA-RBP binding sites prediction. Softmax function and CatBoost are adopted to classify, respectively, and then a pseudo-Siamese framework is constructed. circ-pSBLA combines them to get final output. To validate the effectiveness of circ-pSBLA, we compare it with other state-of-the-art methods and carry out an ablation experiment on 17 sub-datasets. Moreover, we do motif analysis on 3 sub-datasets. The results show that circ-pSBLA achieves superior performance and outperforms other methods. All supporting source codes can be downloaded from https://github.com/gyj9811/circ-pSBLA.",
                "authors": [
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Lei X."
                    }
                ],
                "citationCount": 9,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Methods",
                "title": "A pseudo-Siamese framework for circRNA-RBP binding sites prediction integrating BiLSTM and soft attention mechanism"
            },
            "pmid": "36113743"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
