{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T21:30:33.826470Z",
    "biotoolsCURIE": "biotools:tpma",
    "biotoolsID": "tpma",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "orcidid": "https://orcid.org/0000-0001-6406-1142",
            "typeEntity": "Person"
        },
        {
            "email": "Furong.TANG@hotmail.com",
            "name": "Furong Tang",
            "typeEntity": "Person"
        }
    ],
    "description": "A two pointers meta-alignment tool to ensemble different multiple nucleic acid sequence alignments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/malabz/TPMA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T13:52:44.597503Z",
    "name": "TPMA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1011988",
            "metadata": {
                "abstract": "Accurate multiple sequence alignment (MSA) is imperative for the comprehensive analysis of biological sequences. However, a notable challenge arises as no single MSA tool consistently outperforms its counterparts across diverse datasets. Users often have to try multiple MSA tools to achieve optimal alignment results, which can be time-consuming and memoryintensive. While the overall accuracy of certain MSA results may be lower, there could be local regions with the highest alignment scores, prompting researchers to seek a tool capable of merging these locally optimal results from multiple initial alignments into a globally optimal alignment. In this study, we introduce Two Pointers Meta-Alignment (TPMA), a novel tool designed for the integration of nucleic acid sequence alignments. TPMA employs two pointers to partition the initial alignments into blocks containing identical sequence fragments. It selects blocks with the high sum of pairs (SP) scores to concatenate them into an alignment with an overall SP score superior to that of the initial alignments. Through tests on simulated and real datasets, the experimental results consistently demonstrate that TPMA outperforms M-Coffee in terms of aSP, Q, and total column (TC) scores across most datasets. Even in cases where TPMA's scores are comparable to M-Coffee, TPMA exhibits significantly lower running time and memory consumption. Furthermore, we comprehensively assessed all the MSA tools used in the experiments, considering accuracy, time, and memory consumption. We propose accurate and fast combination strategies for small and large datasets, which streamline the user tool selection process and facilitate large-scale dataset integration. The dataset and source code of TPMA are available on GitHub (https://github. com/malabz/TPMA).",
                "authors": [
                    {
                        "name": "Chao J."
                    },
                    {
                        "name": "Tang F."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhai Y."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "date": "2024-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "TPMA: A two pointers meta-alignment tool to ensemble different multiple nucleic acid sequence alignments"
            },
            "pmcid": "PMC11008887",
            "pmid": "38557416"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
