{
    "additionDate": "2020-01-14T19:47:18Z",
    "biotoolsCURIE": "biotools:AnomiGAN",
    "biotoolsID": "AnomiGAN",
    "confidence_flag": "high",
    "description": "Generative Adversarial Networks for Anonymizing Private Medical Data.\n\nScikit-learn library package (version 0.18).\n\nKeras library package (version 2.0.6)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hobae/AnomiGAN/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T19:47:18Z",
    "name": "AnomiGAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "Typical personal medical data contains sensitive information about individuals. Storing or sharing the personal medical data is thus often risky. For example, a short DNA sequence can provide information that can identify not only an individual, but also his or her relatives. Nonetheless, most countries and researchers agree on the necessity of collecting personal medical data. This stems from the fact that medical data, including genomic data, are an indispensable resource for further research and development regarding disease prevention and treatment. To prevent personal medical data from being misused, techniques to reliably preserve sensitive information should be developed for real world applications. In this paper, we propose a framework called anonymized generative adversarial networks (AnomiGAN), to preserve the privacy of personal medical data, while also maintaining high prediction performance. We compared our method to state-of-the-art techniques and observed that our method preserves the same level of privacy as differential privacy (DP) and provides better prediction results. We also observed that there is a trade-off between privacy and prediction results that depends on the degree of preservation of the original data. Here, we provide a mathematical overview of our proposed model and demonstrate its validation using UCI machine learning repository datasets in order to highlight its utility in practice. The code is available at https://github.com/hobae/AnomiGAN/.",
                "authors": [
                    {
                        "name": "Bae H."
                    },
                    {
                        "name": "Jung D."
                    },
                    {
                        "name": "Choi H.-S."
                    },
                    {
                        "name": "Yoon S."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing",
                "title": "AnomiGAN: Generative Adversarial Networks for Anonymizing Private Medical Data"
            },
            "pmid": "31797628"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}