{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bii.a-star.edu.sg/"}],"documentation":[{"type":"GENERAL","url":"http://aaindexloc.bii.a-star.edu.sg/"}],"function":[{"operation":[{"term":"Protein subcellular localisation prediction","uri":"http://edamontology.org/operation_2489"},{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web service"],"topic":[{"term":"Protein targeting and localisation","uri":"http://edamontology.org/topic_0140"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/aaindexloc-predicting-protein-subcellular-localization-using-amino-acid-index.html"}],"publication":[{"abstract":"Identifying a protein's subcellular localization is an important step to understand its function. However, the involved experimental work is usually laborious, time consuming and costly. Computational prediction hence becomes valuable to reduce the inefficiency. Here we provide a method to predict protein subcellular localization by using amino acid composition and physicochemical properties. The method concatenates the information extracted from a protein's N-terminal, middle and full sequence. Each part is represented by amino acid composition, weighted amino acid composition, five-level grouping composition and five-level dipeptide composition. We divided our dataset into training and testing set. The training set is used to determine the best performing amino acid index by using five-fold cross validation, whereas the testing set acts as the independent dataset to evaluate the performance of our model. With the novel representation method, we achieve an accuracy of approximately 75% on independent dataset. We conclude that this new representation indeed performs well and is able to extract the protein sequence information. We have developed a web server for predicting protein subcellular localization. The web server is available at http://aaindexloc.bii.a-star.edu.sg. © 2007 Springer-Verlag.","authors":["Tantoso E.","Li K.-B."],"cit_count":29,"journal":"Amino Acids","pmid":"18163182","title":"AAIndexLoc: Predicting subcellular localization of proteins based on a new representation of sequences using amino acid indices","year":"2008-08-01"}],"summary":{"biotoolsCURIE":"biotools:aaindexloc","biotoolsID":"aaindexloc","description":"Machine-learning-based algorithm that uses amino acid index to predict protein subcellular localization based on its sequence.","homepage":"http://aaindexloc.bii.a-star.edu.sg/","name":"AAIndexLoc"}}