{
    "accessibility": "Open access",
    "additionDate": "2024-01-03T21:06:35.622067Z",
    "biotoolsCURIE": "biotools:vespa_mrs",
    "biotoolsID": "vespa_mrs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "brian.soher@duke.edu",
            "name": "Brian J. Soher",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrated applications for RF pulse design, spectral simulation and MRS data analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://vespa-mrs.github.io/vespa.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vespa-mrs/vespa",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-03T21:06:35.624680Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://pypi.org/project/Vespa-Suite/"
        }
    ],
    "name": "Vespa",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/MRM.29686",
            "metadata": {
                "abstract": "Purpose: The Vespa package (Versatile Simulation, Pulses, and Analysis) is described and demonstrated. It provides workflows for developing and optimizing linear combination modeling (LCM) fitting for 1H MRS data using intuitive graphical user interface interfaces for RF pulse design, spectral simulation, and MRS data analysis. Command line interfaces for embedding workflows in MR manufacturer platforms and utilities for synthetic dataset creation are included. Complete provenance is maintained for all steps in workflows. Theory and Methods: Vespa is written in Python for compatibility across operating systems. It embeds the PyGAMMA spectral simulation library for spectral simulation. Multiprocessing methods accelerate processing and visualization. Applications use the Vespa database for results storage and cross-application access. Three projects demonstrate pulse, sequence, simulation, and data analysis workflows: (1) short TE semi-LASER single-voxel spectroscopy (SVS) LCM fitting, (2) optimizing MEGA-PRESS (MEscher–GArwood Point RESolved Spectroscopy) flip angle and LCM fitting, and (3) creating a synthetic short TE dataset. Results: The LCM workflows for in vivo basis set creation and spectral analysis showed reasonable results for both the short TE semi-LASER and MEGA-PRESS. Examples of pulses, simulations, and data fitting are shown in Vespa application interfaces for various steps to demonstrate the interactive workflow. Conclusion: Vespa provides an efficient and extensible platform for characterizing RF pulses, pulse design, spectral simulation optimization, and automated LCM fitting via an interactive platform. Modular design and command line interface make it easy to embed in other platforms. As open source, it is free to the MRS community for use and extension. Vespa source code and documentation are available through GitHub.",
                "authors": [
                    {
                        "name": "Deelchand D."
                    },
                    {
                        "name": "Ji X."
                    },
                    {
                        "name": "Joers J."
                    },
                    {
                        "name": "Oz G."
                    },
                    {
                        "name": "Semanchuk P."
                    },
                    {
                        "name": "Soher B.J."
                    },
                    {
                        "name": "Todd D."
                    },
                    {
                        "name": "Young K."
                    }
                ],
                "citationCount": 5,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Magnetic Resonance in Medicine",
                "title": "Vespa: Integrated applications for RF pulse design, spectral simulation and MRS data analysis"
            },
            "pmcid": "PMC10330446",
            "pmid": "37183778",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application",
        "Suite"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
