{
    "additionDate": "2018-06-24T09:18:57Z",
    "biotoolsCURIE": "biotools:plannet",
    "biotoolsID": "plannet",
    "credit": [
        {
            "email": "jabril@ub.edu",
            "name": "J F Abril",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Homology-based predicted interactome for multiple planarian transcriptomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://compgen.bio.ub.edu/PlanNET/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://compgen.bio.ub.edu/PlanNET",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "PlanNET",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx738",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press.Motivation Planarians are emerging as a model organism to study regeneration in animals. However, the little available data of protein-protein interactions hinders the advances in understanding the mechanisms underlying its regenerating capabilities. Results We have developed a protocol to predict protein-protein interactions using sequence homology data and a reference Human interactome. This methodology was applied on 11 Schmidtea mediterranea transcriptomic sequence datasets. Then, using Neo4j as our database manager, we developed PlanNET, a web application to explore the multiplicity of networks and the associated sequence annotations. By mapping RNA-seq expression experiments onto the predicted networks, and allowing a transcript-centric exploration of the planarian interactome, we provide researchers with a useful tool to analyse possible pathways and to design new experiments, as well as a reproducible methodology to predict, store, and explore protein interaction networks for non-model organisms. Availability and implementation The web application PlanNET is available at https://compgen.bio.ub.edu/PlanNET. The source code used is available at https://compgen.bio.ub.edu/PlanNET/downloads. Contact jabril@ub.edu Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Castillo-Lara S."
                    },
                    {
                        "name": "Abril J.F."
                    }
                ],
                "citationCount": 7,
                "date": "2018-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PlanNET: Homology-based predicted interactome for multiple planarian transcriptomes"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}