
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://publichealth.lsuhsc.edu/Faculty_pages/zfang/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://publichealth.lsuhsc.edu/BCRgt/Reference%20Manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Regression",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Cancer",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Genotyping",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "samples",
                "uri": "http://edamontology.org/topic_3277"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pair-1-0-paired-allelic-log-intensity-ratio-based-normalization-method-snp-cgh-arrays.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Accurate genotype calling is a pre-requisite of a successful Genome-Wide Association Study (GWAS). Although most genotyping algorithms can achieve an accuracy rate greater than 99% for genotyping DNA samples without copy number alterations (CNAs), almost all of these algorithms are not designed for genotyping tumor samples that are known to have large regions of CNAs.Results: This study aims to develop a statistical method that can accurately genotype tumor samples with CNAs. The proposed method adds a Bayesian layer to a cluster regression model and is termed a Bayesian Cluster Regression-based genotyping algorithm (BCRgt). We demonstrate that high concordance rates with HapMap calls can be achieved without using reference/training samples, when CNAs do not exist. By adding a training step, we have obtained higher genotyping concordance rates, without requiring large sample sizes. When CNAs exist in the samples, accuracy can be dramatically improved in regions with DNA copy loss and slightly improved in regions with copy number gain, comparing with the Bayesian Robust Linear Model with Mahalanobis distance classifier (BRLMM).Conclusions: In conclusion, we have demonstrated that BCRgt can provide accurate genotyping calls for tumor samples with CNAs. © 2014 Yang et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Yang S.",
                "Cui X.",
                "Fang Z."
            ],
            "cit_count": 2,
            "doi": "10.1186/1471-2105-15-74",
            "journal": "BMC Bioinformatics",
            "title": "BCRgt: A Bayesian cluster regression-based genotyping algorithm for the samples with copy number alterations",
            "type": "Primary",
            "year": "2014-03-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bcrgt",
        "biotoolsID": "bcrgt",
        "description": "BCRgt is a Bayesian Cluster Regression based genotyping approach to genotype samples with Copy Number Alterations (CNAs). This is motivated by the facts that cancer tissues often have large regions of genetic structural alterations such as CNAs, and that researchers have been interested in genotyping SNPs from such samples.",
        "homepage": "http://publichealth.lsuhsc.edu/BCRgt.html",
        "name": "BCRgt",
        "version": [
            "1.0"
        ]
    }
}