{
    "additionDate": "2019-11-14T19:51:33Z",
    "biotoolsCURIE": "biotools:IPA",
    "biotoolsID": "IPA",
    "confidence_flag": "tool",
    "description": "A Bayesian-Based Annotation Method for Metabolomic Profiles Integrating Biochemical Connections, Isotope Patterns, and Adduct Relationships | Integrated Probabilistic Annotation (IPA) - A Bayesian annotation method for LC/MS data integrating biochemical relations, isotope patterns and adduct formation",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "https://github.com/francescodc87/IPA",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-14T13:02:46Z",
    "name": "IPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.9B02354",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.In a typical untargeted metabolomics experiment, the huge amount of complex data generated by mass spectrometry necessitates automated tools for the extraction of useful biological information. Each metabolite generates numerous mass spectrometry features. The association of these experimental features to the underlying metabolites still represents one of the major bottlenecks in metabolomics data processing. While certain identification (e.g., by comparison to authentic standards) is always desirable, it is usually achievable only for a limited number of compounds, and scientists often deal with a significant amount of putatively annotated metabolites. The confidence in a specific annotation is usually assessed by considering different sources of information (e.g., isotope patterns, adduct formation, chromatographic retention times, and fragmentation patterns). IPA (integrated probabilistic annotation) offers a rigorous and reproducible method to automatically annotate metabolite profiles and evaluate the resulting confidence of the putative annotations. It is able to provide a rigorous measure of our confidence in any putative annotation and is also able to update and refine our beliefs (i.e., background prior knowledge) by incorporating different sources of information in the annotation process, such as isotope patterns, adduct formation and biochemical relations. The IPA package is freely available on GitHub (https://github.com/francescodc87/IPA), together with the related extensive documentation.",
                "authors": [
                    {
                        "name": "Breitling R."
                    },
                    {
                        "name": "Del Carratore F."
                    },
                    {
                        "name": "Greenland-Bews C."
                    },
                    {
                        "name": "Hollywood K.A."
                    },
                    {
                        "name": "Rogers S."
                    },
                    {
                        "name": "Schmidt K."
                    },
                    {
                        "name": "Takano E."
                    },
                    {
                        "name": "Vinaixa M."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-15T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Integrated Probabilistic Annotation: A Bayesian-Based Annotation Method for Metabolomic Profiles Integrating Biochemical Connections, Isotope Patterns, and Adduct Relationships"
            },
            "pmid": "31509381"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
