{
    "additionDate": "2017-08-03T18:47:20Z",
    "biotoolsCURIE": "biotools:jepeg",
    "biotoolsID": "jepeg",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/dleelab"
        }
    ],
    "description": "Novel software which uses only summary statistics and correlation structures estimated from a reference popluation, to i) impute the summary statistics at unmeasured eQTLs and ii) test for the joint effect of measured and imputed all eQTLs affecting a gene function/expression on a phenotype.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/dleelab/jepeg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://dleelab.github.io/jepeg/",
    "lastUpdate": "2024-11-25T14:19:20.227397Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/jepeg-v0-1-0-joint-effect-on-phenotype-of-eqtlsfunctional-snps-associated-with-a-gene.html"
        }
    ],
    "name": "JEPEG",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv567",
            "metadata": {
                "abstract": "Motivation: To increase detection power, gene level analysis methods are used to aggregate weak signals. To greatly increase computational efficiency, most methods use as input summary statistics from genome-wide association studies (GWAS). Subsequently, gene statistics are constructed using linkage disequilibrium (LD) patterns from a relevant reference panel. However, all methods, including our own Joint Effect on Phenotype of eQTL/functional single nucleotide polymorphisms (SNPs) associated with a Gene (JEPEG), assume homogeneous panels, e.g. European. However, this renders these tools unsuitable for the analysis of large cosmopolitan cohorts. Results: We propose a JEPEG extension, JEPEGMIX, which similar to one of our software tools, Direct Imputation of summary STatistics of unmeasured SNPs from MIXed ethnicity cohorts, is capable of estimating accurate LD patterns for cosmopolitan cohorts. JEPEGMIX uses this accurate LD estimates to (i) impute the summary statistics at unmeasured functional variants and (ii) test for the joint effect of all measured and imputed functional variants which are associated with a gene. We illustrate the performance of our tool by analyzing the GWAS meta-analysis summary statistics from the multi-ethnic Psychiatric Genomics Consortium Schizophrenia stage 2 cohort. This practical application supports the immune system being one of the main drivers of the process leading to schizophrenia. Availability and implementation: Software, annotation database and examples are available at http://dleelab.github.io/jepegmix/. Contact: Supplementary information: Supplementary material is available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Bacanu S.-A."
                    },
                    {
                        "name": "Bigdeli T.B."
                    },
                    {
                        "name": "Fanous A.H."
                    },
                    {
                        "name": "Kendler K.S."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Riley B.P."
                    },
                    {
                        "name": "Vladimirov V.I."
                    },
                    {
                        "name": "Webb B.T."
                    },
                    {
                        "name": "Williamson V.S."
                    }
                ],
                "citationCount": 5,
                "date": "2016-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "JEPEGMIX: Gene-level joint analysis of functional SNPs in cosmopolitan cohorts"
            },
            "pmcid": "PMC4708106",
            "pmid": "26428293"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
