{
    "additionDate": "2021-01-20T10:52:28Z",
    "biotoolsCURIE": "biotools:simpel",
    "biotoolsID": "simpel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "quan.long@ucalgary.ca",
            "name": "Quan Long",
            "typeEntity": "Person"
        }
    ],
    "description": "Simulation-based power estimation for sequencing studies of low-prevalence conditions.\n\nSimPEL is short for Simulation-based Power Estimation for sequencing studies of Low-prevalence conditions. SimPEL addresses the need for power estimation in low-prevalence condition studies, taking into account their inherently small sample sizes and analytical procedures. SimPEL integrates customizable parameters to realistically model study design outcomes and provide applicable information towards further refinement of experimental procedure. SimPEL is implemented as a function of the established JAWAMix5 tool (Long et al., 2013) , an HDF5-based Java implementation for association mapping.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/precisionomics/SimPEL",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-05-20T06:08:34Z",
    "name": "SimPEL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/GEPI.22129",
            "metadata": {
                "abstract": "© 2018 WILEY PERIODICALS, INC.Power estimations are important for optimizing genotype-phenotype association study designs. However, existing frameworks are designed for common disorders, and thus ill-suited for the inherent challenges of studies for low-prevalence conditions such as rare diseases and infrequent adverse drug reactions. These challenges include small sample sizes and the need to leverage genetic annotation resources in association analyses for the purpose of ranking potential causal genes. We present SimPEL, a simulation-based program providing power estimations for the design of low-prevalence condition studies. SimPEL integrates the usage of gene annotation resources for association analyses. Customizable parameters, including the penetrance of the putative causal allele and the employed pathogenic scoring system, allow SimPEL to realistically model a large range of study designs. To demonstrate the effects of various parameters on power, we estimated the power of several simulated designs using SimPEL and captured power trends in agreement with observations from current literature on low-frequency condition studies. SimPEL, as a tool, provides researchers studying low-frequency conditions with an intuitive and highly flexible avenue for statistical power estimation. The platform-independent “batteries included” executable and default input files are available at https://github.com/precisionomics/SimPEL.",
                "authors": [
                    {
                        "name": "Bousman C."
                    },
                    {
                        "name": "Cao C."
                    },
                    {
                        "name": "Gordon P."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Long Q."
                    },
                    {
                        "name": "Mak L."
                    },
                    {
                        "name": "Tarailo-Graovac M."
                    },
                    {
                        "name": "Wang P."
                    }
                ],
                "date": "2018-07-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "SimPEL: Simulation-based power estimation for sequencing studies of low-prevalence conditions"
            },
            "pmid": "29790190"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
