{
    "additionDate": "2021-01-18T07:27:56Z",
    "biotoolsCURIE": "biotools:psortm",
    "biotoolsID": "psortm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "brinkman@sfu.ca",
            "name": "Fiona S L Brinkman",
            "typeEntity": "Person"
        }
    ],
    "description": "PSORTm is a modified version of PSORTb 3.0.2 for protein subcellular localization prediction (SCL), and PSORTdb-based cell envelope classification, that can predict protein SCL from metagenomic sequences.\n\nPSORT.org provides links to the PSORT family of programs for subcellular localization prediction as well as other datasets and resources relevant to localization prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://www.psort.org/psortm/",
    "lastUpdate": "2021-01-29T18:10:09Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.psort.org/"
        }
    ],
    "name": "PSORTm",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA136",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Many methods for microbial protein subcellular localization (SCL) prediction exist; however, none is readily available for analysis of metagenomic sequence data, despite growing interest from researchers studying microbial communities in humans, agri-food relevant organisms and in other environments (e.g. for identification of cell-surface biomarkers for rapid protein-based diagnostic tests). We wished to also identify new markers of water quality from freshwater samples collected from pristine versus pollution-impacted watersheds. Results: We report PSORTm, the first bioinformatics tool designed for prediction of diverse bacterial and archaeal protein SCL from metagenomics data. PSORTm incorporates components of PSORTb, one of the most precise and widely used protein SCL predictors, with an automated classification by cell envelope. An evaluation using 5-fold cross-validation with in silico-fragmented sequences with known localization showed that PSORTm maintains PSORTb's high precision, while sensitivity increases proportionately with metagenomic sequence fragment length. PSORTm's read-based analysis was similar to PSORTb-based analysis of metagenome-assembled genomes (MAGs); however, the latter requires non-trivial manual classification of each MAG by cell envelope, and cannot make use of unassembled sequences. Analysis of the watershed samples revealed the importance of normalization and identified potential biomarkers of water quality. This method should be useful for examining a wide range of microbial communities, including human microbiomes, and other microbiomes of medical, environmental or industrial importance.",
                "authors": [
                    {
                        "name": "Peabody M.A."
                    },
                    {
                        "name": "Lau W.Y.V."
                    },
                    {
                        "name": "Hoad G.R."
                    },
                    {
                        "name": "Jia B."
                    },
                    {
                        "name": "Maguire F."
                    },
                    {
                        "name": "Gray K.L."
                    },
                    {
                        "name": "Beiko R.G."
                    },
                    {
                        "name": "Brinkman F.S.L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PSORTm: A bacterial and archaeal protein subcellular localization prediction tool for metagenomics data"
            },
            "pmcid": "PMC7214030",
            "pmid": "32108861"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ]
}