{
    "additionDate": "2020-01-09T18:24:54Z",
    "biotoolsCURIE": "biotools:RUFUS",
    "biotoolsID": "RUFUS",
    "confidence_flag": "tool",
    "description": "RUFUS is a Pedigree-based estimation of human mobile element retrotransposition rates.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/jandrewrfarrell/RUFUS",
    "lastUpdate": "2021-01-16T12:47:01Z",
    "name": "RUFUS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/GR.247965.118",
            "metadata": {
                "abstract": "© 2019 Feusier et al.Germline mutation rates in humans have been estimated for a variety of mutation types, including single-nucleotide and large structural variants. Here, we directly measure the germline retrotransposition rate for the three active retrotransposon elements: L1, Alu, and SVA. We used three tools for calling mobile element insertions (MEIs) (MELT, RUFUS, and TranSurVeyor) on blood-derived whole-genome sequence (WGS) data from 599 CEPH individuals, comprising 33 threegeneration pedigrees. We identified 26 de novo MEIs in 437 births. The retrotransposition rate estimates for Alu elements, one in 40 births, is roughly half the rate estimated using phylogenetic analyses, a difference in magnitude similar to that observed for single-nucleotide variants. The L1 retrotransposition rate is one in 63 births and is within range of previous estimates (1:20-1:200 births). The SVA retrotransposition rate, one in 63 births, is much higher than the previous estimate of one in 900 births. Our large, three-generation pedigrees allowed us to assess parent-of-origin effects and the timing of insertion events in either gametogenesis or early embryonic development. We find a statistically significant paternal bias in Alu retrotransposition. Our study represents the first in-depth analysis of the rate and dynamics of human retrotransposition from WGS data in three-generation human pedigrees.",
                "authors": [
                    {
                        "name": "Baird L."
                    },
                    {
                        "name": "Farrell A."
                    },
                    {
                        "name": "Feusier J."
                    },
                    {
                        "name": "Ha H."
                    },
                    {
                        "name": "Jorde L.B."
                    },
                    {
                        "name": "Thomas J."
                    },
                    {
                        "name": "Watkins W.S."
                    },
                    {
                        "name": "Witherspoon D.J."
                    },
                    {
                        "name": "Xing J."
                    }
                ],
                "citationCount": 20,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Pedigree-based estimation of human mobile element retrotransposition rates"
            },
            "pmcid": "PMC6771411",
            "pmid": "31575651"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
