{
    "additionDate": "2017-08-03T18:46:41Z",
    "biotoolsCURIE": "biotools:i-tasser",
    "biotoolsID": "i-tasser",
    "credit": [
        {
            "email": "yangzhanglab@umich.edu",
            "name": "Yang Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://zhanglab.ccmb.med.umich.edu/"
        }
    ],
    "description": "Best in tertiary structure prediction (as ‘Zhang-Server’) in the community-wide blind benchmarks CASP7 and CASP8. It uses mainly profile-profile comparison to identify templates and alignments for deriving distance constraints. Its power lies in how it combines the distance constraints from up to the 50 best-ranked templates. It performs some knowledge-based free modelling in regions without any template-based information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://zhanglab.ccmb.med.umich.edu/I-TASSER/"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://zhanglab.ccmb.med.umich.edu/I-TASSER/",
    "lastUpdate": "2022-07-11T15:09:54.867335Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/i-tasser-1-1-protein-structure-function-predictions.html"
        }
    ],
    "name": "I-TASSER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_014627"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1016/j.crmeth.2021.100014",
            "metadata": {
                "abstract": "© 2021 The AuthorsStructure prediction for proteins lacking homologous templates in the Protein Data Bank (PDB) remains a significant unsolved problem. We developed a protocol, C-I-TASSER, to integrate interresidue contact maps from deep neural-network learning with the cutting-edge I-TASSER fragment assembly simulations. Large-scale benchmark tests showed that C-I-TASSER can fold more than twice the number of non-homologous proteins than the I-TASSER, which does not use contacts. When applied to a folding experiment on 8,266 unsolved Pfam families, C-I-TASSER successfully folded 4,162 domain families, including 504 folds that are not found in the PDB. Furthermore, it created correct folds for 85% of proteins in the SARS-CoV-2 genome, despite the quick mutation rate of the virus and sparse sequence profiles. The results demonstrated the critical importance of coupling whole-genome and metagenome-based evolutionary information with optimal structure assembly simulations for solving the problem of non-homologous protein structure prediction.",
                "authors": [
                    {
                        "name": "Bell E.W."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Pearce R."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zheng W."
                    }
                ],
                "citationCount": 29,
                "date": "2021-07-26T00:00:00Z",
                "journal": "Cell Reports Methods",
                "title": "Folding non-homologous proteins by coupling deep-learning contact maps with I-TASSER assembly simulations"
            },
            "pmcid": "PMC8336924",
            "pmid": "34355210"
        },
        {
            "doi": "10.1038/nmeth.3213",
            "metadata": {
                "authors": [
                    {
                        "name": "Poisson J."
                    },
                    {
                        "name": "Roy A."
                    },
                    {
                        "name": "Xu D."
                    },
                    {
                        "name": "Yan R."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 3381,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "The I-TASSER suite: Protein structure and function prediction"
            },
            "pmcid": "PMC4428668",
            "pmid": "25549265"
        },
        {
            "doi": "10.1038/nprot.2010.5",
            "metadata": {
                "abstract": "The iterative threading assembly refinement (I-TASSER) server is an integrated platform for automated protein structure and function prediction based on the sequence-to-structure-to-function paradigm. starting from an amino acid sequence, I-TAssER first generates three-dimensional (3D) atomic models from multiple threading alignments and iterative structural assembly simulations. the function of the protein is then inferred by structurally matching the 3D models with other known proteins. the output from a typical server run contains full-length secondary and tertiary structure predictions, and functional annotations on ligand-binding sites, enzyme commission numbers and Gene ontology terms. an estimate of accuracy of the predictions is provided based on the confidence score of the modeling. this protocol provides new insights and guidelines for designing of online server systems for the state-of-the-art protein structure and function predictions. the server is available at http://zhanglab.ccmb.med. umich.edu/I-TASSER. © 2010 Nature Publishing Group.",
                "authors": [
                    {
                        "name": "Kucukural A."
                    },
                    {
                        "name": "Roy A."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 4419,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "I-TASSER: A unified platform for automated protein structure and function prediction"
            },
            "pmcid": "PMC2849174",
            "pmid": "20360767"
        },
        {
            "doi": "10.1093/nar/gkv342",
            "metadata": {
                "abstract": "© 2015 The Author(s).The I-TASSER server (http://zhanglab.ccmb.med. umich.edu/I-TASSER) is an online resource for automated protein structure prediction and structurebased function annotation. In I-TASSER, structural templates are first recognized from the PDB using multiple threading alignment approaches. Full-length structure models are then constructed by iterative fragment assembly simulations. The functional insights are finally derived by matching the predicted structure models with known proteins in the function databases. Although the server has been widely used for various biological and biomedical investigations, numerous comments and suggestions have been reported from the user community. In this article, we summarize recent developments on the ITASSER server, which were designed to address the requirements from the user community and to increase the accuracy of modeling predictions. Focuses have been made on the introduction of new methods for atomic-level structure refinement, local structure quality estimation and biological function annotations. We expect that these newdevelopments will improve the quality of the I-TASSER server and further facilitate its use by the community for highresolution structure and function prediction.",
                "authors": [
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1098,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "I-TASSER server: New development for protein structure and function predictions"
            },
            "pmcid": "PMC4489253",
            "pmid": "25883148"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
