{
    "additionDate": "2015-02-16T10:04:57Z",
    "biotoolsCURIE": "biotools:ronn",
    "biotoolsID": "ronn",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "robert@strubi.ox.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predictor of regions of disorder in proteins.",
    "documentation": [
        {
            "type": "General",
            "url": "https://www.strubi.ox.ac.uk/RONN"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "note": "Regional Order Neural Network software (RONN): Recent studies have found many proteins containing regions that do not form well-defined three-dimensional structures in their native states. The study and detection of such disordered regions is important both for understanding protein function and for facilitating structural analysis since disordered regions may affect solubility and/or crystallizability.We have developed the regional order neural network (RONN) software as an application of our recently developed bio-basis function neural network pattern recognition algorithm to the detection of natively disordered regions in proteins. The results of blind-testing a panel of nine disorder prediction tools (including RONN) against 80 protein sequences derived from the Protein Data Bank shows that, based on the probability excess measure, RONN performed the best.",
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://www.strubi.ox.ac.uk/RONN",
    "homepage_status": 1,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "RONN",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bti534",
            "metadata": {
                "abstract": "Motivation: Recent studies have found many proteins containing regions that do not form well-defined three-dimensional structures in their native states. The study and detection of such disordered regions is important both for understanding protein function and for facilitating structural analysis since disordered regions may affect solubility and/or crystallizability. Results: We have developed the regional order neural network (RONN) software as an application of our recently developed 'bio-basis function neural network' pattern recognition algorithm to the detection of natively disordered regions in proteins. The results of blind-testing a panel of nine disorder prediction tools (including RONN) against 80 protein sequences derived from the Protein Data Bank shows that, based on the probability excess measure, RONN performed the best. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Yang Z.R."
                    },
                    {
                        "name": "Thomson R."
                    },
                    {
                        "name": "McNeil P."
                    },
                    {
                        "name": "Esnouf R.M."
                    }
                ],
                "citationCount": 475,
                "date": "2005-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RONN: The bio-basis function neural network technique applied to the detection of natively disordered regions in proteins"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}