{
    "accessibility": [],
    "additionDate": "2017-12-18T00:15:05Z",
    "biotoolsCURIE": "biotools:introgress",
    "biotoolsID": "introgress",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.uwyo.edu/buerkle/"
        }
    ],
    "description": "Software package for mapping components of isolation in hybrids. It is an R-package that implements various methods for the analysis of gene introgression in hybrid zones.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.uwyo.edu/buerkle/software/introgress/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.uwyo.edu/buerkle/software/introgress/",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/introgress-1-23-mapping-components-isolation-hybrids.html"
        }
    ],
    "maturity": null,
    "name": "introgress",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1111/j.1365-294X.2009.04098.x",
            "metadata": {
                "abstract": "We propose a novel method that uses natural admixture between divergent lineages (hybridization) to investigate the genetic architecture of reproductive isolation and adaptive introgression. Our method employs multinomial regression to estimate genomic clines and to quantify introgression for individual loci relative to the genomic background (clines in genotype frequency along a genomic admixture gradient). Loci with patterns of introgression that deviate significantly from null expectations based on the remainder of the genome are potentially subject to selection and thus of interest to understanding adaptation and the evolution of reproductive isolation. Using simulations, we show that different forms of selection modify these genomic clines in predictable ways and that our method has good power to detect moderate to strong selection for multiple forms of selection. Using individual-based simulations, we demonstrate that our method generally has a low false positive rate, except when genetic drift is particularly pronounced (e.g. low population size, low migration rates from parental populations, and substantial time since initial admixture). Additional individual-based simulations reveal that moderate selection against heterozygotes can be detected as much as 50 cm away from the focal locus directly experiencing selection, but is not detected at unlinked loci. Finally, we apply our analytical method to previously published data sets from a mouse (Mus musculus and M. domesticus) and two sunflower (Helianthus petiolaris and H. annuus) hybrid zones. This method should be applicable to numerous species that are currently the focus of research in evolution and ecology and should help bring about new insights regarding the processes underlying the origin and maintenance of biological diversity. © 2009 Blackwell Publishing Ltd.",
                "authors": [
                    {
                        "name": "Gompert Z."
                    },
                    {
                        "name": "Buerkle C.A."
                    }
                ],
                "citationCount": 139,
                "date": "2009-03-01T00:00:00Z",
                "journal": "Molecular Ecology",
                "title": "A powerful regression-based method for admixture mapping of isolation across the genome of hybrids"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        },
        {
            "doi": "10.1111/j.1755-0998.2009.02733.x",
            "metadata": {
                "abstract": "A new software package (introgress) provides functions for analysing introgression of genotypes between divergent, hybridizing lineages, including estimating genomic clines from multi-locus genotype data and testing for deviations from neutral expectations. The software works with co-dominant, dominant and haploid marker data, and does not require fixed allelic differences between parental populations for the sampled genetic markers. Permutation and parametric procedures generate neutral expectations for introgression and provide a basis for significance tests of observed genomic clines. The software also implements maximum likelihood estimates of hybrid index from genotypic data and a number of graphical analyses. The package is an extension of the R statistical software, is written in the R language and is freely available through the Comprehensive R Archive Network (CRAN; http://cran.r-project.org/). In this study, we describe introgress and demonstrate its use with a sample data set. © 2009 Blackwell Publishing Ltd.",
                "authors": [
                    {
                        "name": "Gompert Z."
                    },
                    {
                        "name": "Alex Buerkle C."
                    }
                ],
                "citationCount": 128,
                "date": "2010-03-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "Introgress: A software package for mapping components of isolation in hybrids"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ],
    "validated": 1,
    "version": [
        "1.23"
    ]
}