{
    "accessibility": "Open access",
    "additionDate": "2023-02-10T00:29:43.375245Z",
    "biotoolsCURIE": "biotools:xcvatr",
    "biotoolsID": "xcvatr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "arif.o.harmanci@uth.tmc.edu",
            "name": "Arif Harmanci",
            "orcidid": "https://orcid.org/0000-0002-9696-1118",
            "typeEntity": "Person"
        },
        {
            "email": "Akash.Patel@bcm.edu",
            "name": "Akash J. Patel",
            "typeEntity": "Person"
        },
        {
            "name": "Akdes Serin Harmanci"
        },
        {
            "name": "Tiemo J. Klisch"
        }
    ],
    "description": "Detection and characterization of variant impact on the Embeddings of single -cell and bulk RNA-sequencing samples.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "https://github.com/harmancilab/XCVATR",
    "language": [
        "C++",
        "Shell"
    ],
    "lastUpdate": "2023-02-10T00:29:43.378515Z",
    "license": "Not licensed",
    "name": "XCVATR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12864-022-09004-7",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: RNA-sequencing has become a standard tool for analyzing gene activity in bulk samples and at the single-cell level. By increasing sample sizes and cell counts, this technique can uncover substantial information about cellular transcriptional states. Beyond quantification of gene expression, RNA-seq can be used for detecting variants, including single nucleotide polymorphisms, small insertions/deletions, and larger variants, such as copy number variants. Notably, joint analysis of variants with cellular transcriptional states may provide insights into the impact of mutations, especially for complex and heterogeneous samples. However, this analysis is often challenging due to a prohibitively high number of variants and cells, which are difficult to summarize and visualize. Further, there is a dearth of methods that assess and summarize the association between detected variants and cellular transcriptional states. Results: Here, we introduce XCVATR (eXpressed Clusters of Variant Alleles in Transcriptome pRofiles), a method that identifies variants and detects local enrichment of expressed variants within embedding of samples and cells in single-cell and bulk RNA-seq datasets. XCVATR visualizes local “clumps” of small and large-scale variants and searches for patterns of association between each variant and cellular states, as described by the coordinates of cell embedding, which can be computed independently using any type of distance metrics, such as principal component analysis or t-distributed stochastic neighbor embedding. Through simulations and analysis of real datasets, we demonstrate that XCVATR can detect enrichment of expressed variants and provide insight into the transcriptional states of cells and samples. We next sequenced 2 new single cell RNA-seq tumor samples and applied XCVATR. XCVATR revealed subtle differences in CNV impact on tumors. Conclusions: XCVATR is publicly available to download from https://github.com/harmancilab/XCVATR.",
                "authors": [
                    {
                        "name": "Harmanci A."
                    },
                    {
                        "name": "Harmanci A.S."
                    },
                    {
                        "name": "Klisch T.J."
                    },
                    {
                        "name": "Patel A.J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "XCVATR: detection and characterization of variant impact on the Embeddings of single -cell and bulk RNA-sequencing samples"
            },
            "pmcid": "PMC9764736",
            "pmid": "36539717"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
