{
    "additionDate": "2020-01-14T20:04:00Z",
    "biotoolsCURIE": "biotools:DeepMir",
    "biotoolsID": "DeepMir",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yannisun@cityu.edu.hk",
            "name": "Yanni Sun",
            "orcidid": "https://orcid.org/0000-0003-1373-8023",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast and accurate microRNA search using CNN.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HubertTang/DeepMir",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-20T11:08:33Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/HubertTang/DeepMir/issues"
        }
    ],
    "name": "DeepMir",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3279-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: There are many different types of microRNAs (miRNAs) and elucidating their functions is still under intensive research. A fundamental step in functional annotation of a new miRNA is to classify it into characterized miRNA families, such as those in Rfam and miRBase. With the accumulation of annotated miRNAs, it becomes possible to use deep learning-based models to classify different types of miRNAs. In this work, we investigate several key issues associated with successful application of deep learning models for miRNA classification. First, as secondary structure conservation is a prominent feature for noncoding RNAs including miRNAs, we examine whether secondary structure-based encoding improves classification accuracy. Second, as there are many more non-miRNA sequences than miRNAs, instead of assigning a negative class for all non-miRNA sequences, we test whether using softmax output can distinguish in-distribution and out-of-distribution samples. Finally, we investigate whether deep learning models can correctly classify sequences from small miRNA families. Results: We present our trained convolutional neural network (CNN) models for classifying miRNAs using different types of feature learning and encoding methods. In the first method, we explicitly encode the predicted secondary structure in a matrix. In the second method, we use only the primary sequence information and one-hot encoding matrix. In addition, in order to reject sequences that should not be classified into targeted miRNA families, we use a threshold derived from softmax layer to exclude out-of-distribution sequences, which is an important feature to make this model useful for real transcriptomic data. The comparison with the state-of-the-art ncRNA classification tools such as Infernal shows that our method can achieve comparable sensitivity and accuracy while being significantly faster. Conclusion: Automatic feature learning in CNN can lead to better classification accuracy and sensitivity for miRNA classification and annotation. The trained models and also associated codes are freely available at https://github.com/HubertTang/DeepMir.",
                "authors": [
                    {
                        "name": "Tang X."
                    },
                    {
                        "name": "Sun Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Fast and accurate microRNA search using CNN"
            },
            "pmcid": "PMC6933638",
            "pmid": "31881831"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}