{
    "accessibility": "Open access",
    "additionDate": "2022-06-26T15:05:02.784149Z",
    "biotoolsCURIE": "biotools:fishsizer",
    "biotoolsID": "fishsizer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jeppehave@gmail.com",
            "name": "Jeppe Have Rasmussen",
            "orcidid": "https://orcid.org/0000-0003-3426-551X",
            "typeEntity": "Person"
        }
    ],
    "description": "FishSizer is an open-source software developed to assist researchers in the use of estimating length and depth of fish larvae by semi-automatization of the process.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jeppehave/FishSizer",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-06-26T15:05:02.787603Z",
    "license": "GPL-3.0",
    "name": "FishSizer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/ECE3.8672",
            "metadata": {
                "abstract": "© 2022 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Length and depth of fish larvae are part of the fundamental measurements in many marine ecology studies involving early fish life history. Until now, obtaining these measurements has required intensive manual labor and the risk of inter- and intra-observer variability. We developed an open-source software solution to semi-automate the measurement process and thereby reduce both time consumption and technical variability. Using contrast-based edge detection, the software segments images of a fish larva into “larva” and “background.” Length and depth are extracted from the “larva” segmentation while taking curvature of the larva into consideration. The graphical user interface optimizes workflow and ease of usage, thereby reducing time consumption for both training and analysis. The software allows for visual verification of all measurements. A comparison of measurement methods on a set of larva images showed that this software reduces measurement time by 66%–78% relative to commonly used software. Using this software instead of the commonly used manual approach has the potential to save researchers from many hours of monotonous work. No adjustment was necessary for 89% of the images regarding length (70% for depth). Hence, the only workload on most images was the visual inspection. As the visual inspection and manual dimension extraction works in the same way as currently used software, we expect no loss in accuracy.",
                "authors": [
                    {
                        "name": "Fuiman L.A."
                    },
                    {
                        "name": "Moyano M."
                    },
                    {
                        "name": "Oomen R.A."
                    },
                    {
                        "name": "Rasmussen J.H."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "FishSizer: Software solution for efficiently measuring larval fish size"
            },
            "pmcid": "PMC8928902",
            "pmid": "35342596"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
