{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T12:47:20Z",
    "biotoolsCURIE": "biotools:rSeqTU-A",
    "biotoolsID": "rSeqTU-A",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "niu.shengyong@gmail.com",
            "name": "Sheng-Yong, Niu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Maintainer"
            ]
        }
    ],
    "description": "Machine learning based R package for prediction of bacterial transcription units.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/s18692001/rSeqTU"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://s18692001.github.io/rSeqTU/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "rSeqTU-A",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.3389/fgene.2019.00374",
            "metadata": {
                "abstract": "Copyright © 2019 Niu, Liu, Ma and Chou. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.A transcription unit (TU) is composed of one or multiple adjacent genes on the same strand that are co-transcribed in mostly prokaryotes. Accurate identification of TUs is a crucial first step to delineate the transcriptional regulatory networks and elucidate the dynamic regulatory mechanisms encoded in various prokaryotic genomes. Many genomic features, for example, gene intergenic distance, and transcriptomic features including continuous and stable RNA-seq reads count signals, have been collected from a large amount of experimental data and integrated into classification techniques to computationally predict genome-wide TUs. Although some tools and web servers are able to predict TUs based on bacterial RNA-seq data and genome sequences, there is a need to have an improved machine learning prediction approach and a better comprehensive pipeline handling QC, TU prediction, and TU visualization. To enable users to efficiently perform TU identification on their local computers or high-performance clusters and provide a more accurate prediction, we develop an R package, named rSeqTU. rSeqTU uses a random forest algorithm to select essential features describing TUs and then uses support vector machine (SVM) to build TU prediction models. rSeqTU (available at https://s18692001.github.io/rSeqTU/) has six computational functionalities including read quality control, read mapping, training set generation, random forest-based feature selection, TU prediction, and TU visualization.",
                "authors": [
                    {
                        "name": "Niu S.-Y."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Chou W.-C."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "RSEQtu-A machine-learning based R package for prediction of bacterial transcription units"
            },
            "pmcid": "PMC6529933",
            "pmid": "31156694",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1,
    "version": [
        "0.1.0"
    ]
}