{
    "additionDate": "2021-01-18T07:04:09Z",
    "biotoolsCURIE": "biotools:bio-answerfinder",
    "biotoolsID": "bio-answerfinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "iozyurt@ucsd.edu",
            "name": "Ibrahim Burak Ozyurt",
            "orcidid": "https://orcid.org/0000-0003-3944-1893",
            "typeEntity": "Person"
        }
    ],
    "description": "A system to find answers to questions from biomedical texts. The system is configured by a configuration file.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/scicrunch/bio-answerfinder",
    "language": [
        "Java",
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-02-04T12:32:10Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SciCrunch/bio-answerfinder"
        }
    ],
    "name": "Bio-AnswerFinder",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ137",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.The ever accelerating pace of biomedical research results in corresponding acceleration in the volume of biomedical literature created. Since new research builds upon existing knowledge, the rate of increase in the available knowledge encoded in biomedical literature makes the easy access to that implicit knowledge more vital over time. Toward the goal of making implicit knowledge in the biomedical literature easily accessible to biomedical researchers, we introduce a question answering system called Bio-AnswerFinder. Bio-AnswerFinder uses a weighted-relaxed word mover's distance based similarity on word/phrase embeddings learned from PubMed abstracts to rank answers after question focus entity type filtering. Our approach retrieves relevant documents iteratively via enhanced keyword queries from a traditional search engine. To improve document retrieval performance, we introduced a supervised long short term memory neural network to select keywords from the question to facilitate iterative keyword search. Our unsupervised baseline system achieves a mean reciprocal rank score of 0.46 and Precision@1 of 0.32 on 936 questions from BioASQ. The answer sentences are further ranked by a fine-tuned bidirectional encoder representation from transformers (BERT) classifier trained using 100 answer candidate sentences per question for 492 BioASQ questions. To test ranking performance, we report a blind test on 100 questions that three independent annotators scored. These experts preferred BERT based reranking with 7% improvement on MRR and 13% improvement on Precision@1 scores on average.",
                "authors": [
                    {
                        "name": "Bandrowski A."
                    },
                    {
                        "name": "Grethe J.S."
                    },
                    {
                        "name": "Ozyurt I.B."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Bio-AnswerFinder: A system to find answers to questions from biomedical texts"
            },
            "pmcid": "PMC7053013",
            "pmid": "31925435"
        }
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
