{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T00:33:32.107520Z",
    "biotoolsCURIE": "biotools:scbgeda",
    "biotoolsID": "scbgeda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Xiangtao Li",
            "orcidid": "https://orcid.org/0000-0002-8716-9823",
            "typeEntity": "Person"
        },
        {
            "name": "Yunhe Wang"
        },
        {
            "name": "Zhuohan Yu"
        },
        {
            "name": "Ka-Chun Wong",
            "orcidid": "https://orcid.org/0000-0001-6062-733X"
        }
    ],
    "description": "Deep Single-cell Clustering Analysis via Dual Denoising Autoencoder with Bipartite Graph Ensemble Clustering.",
    "download": [
        {
            "type": "Other",
            "url": "https://figshare.com/articles/software/scBGEDA/19657911"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangyh082/scBGEDA",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2023-03-18T00:33:32.112079Z",
    "license": "Not licensed",
    "name": "scBGEDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD075",
            "metadata": {
                "abstract": "MOTIVATION: Single-cell RNA sequencing (scRNA-seq) is an increasingly popular technique for transcriptomic analysis of gene expression at the single-cell level. Cell-type clustering is the first crucial task in the analysis of scRNA-seq data that facilitates accurate identification of cell types and the study of the characteristics of their transcripts. Recently, several computational models based on a deep autoencoder and the ensemble clustering have been developed to analyze scRNA-seq data. However, current deep autoencoders are not sufficient to learn the latent representations of scRNA-seq data, and obtaining consensus partitions from these feature representations remains under-explored. RESULTS: To address this challenge, we propose a single-cell deep clustering model via a dual denoising autoencoder with bipartite graph ensemble clustering called scBGEDA, to identify specific cell populations in single-cell transcriptome profiles. First, a single-cell dual denoising autoencoder network is proposed to project the data into a compressed low-dimensional space and that can learn feature representation via explicit modeling of synergistic optimization of the zero-inflated negative binomial reconstruction loss and denoising reconstruction loss. Then, a bipartite graph ensemble clustering algorithm is designed to exploit the relationships between cells and the learned latent embedded space by means of a graph-based consensus function. Multiple comparison experiments were conducted on 20 scRNA-seq datasets from different sequencing platforms using a variety of clustering metrics. The experimental results indicated that scBGEDA outperforms other state-of-the-art methods on these datasets, and also demonstrated its scalability to large-scale scRNA-seq datasets. Moreover, scBGEDA was able to identify cell-type specific marker genes and provide functional genomic analysis by quantifying the influence of genes on cell clusters, bringing new insights into identifying cell types and characterizing the scRNA-seq data from different perspectives. AVAILABILITY AND IMPLEMENTATION: The source code of scBGEDA is available at https://github.com/wangyh082/scBGEDA. The software and the supporting data can be downloaded from https://figshare.com/articles/software/scBGEDA/19657911. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Bian C."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "date": "2023-02-14T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "scBGEDA: deep single-cell clustering analysis via a dual denoising autoencoder with bipartite graph ensemble clustering"
            },
            "pmcid": "PMC9925104",
            "pmid": "36734596"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
