{
    "accessibility": "Open access",
    "additionDate": "2021-04-20T09:26:18.187523",
    "biotoolsCURIE": "biotools:wataa",
    "biotoolsID": "wataa",
    "collectionID": [
        "ELIXIR-CZ",
        "BIOCEV"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lada.biedermannova@ibt.cas.cz",
            "name": "Lada Biedermannova",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "email": "jiri.cerny@ibt.cas.cz",
            "name": "JIri Cerny",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "bohdan.schneider@ibt.cas.cz",
            "name": "Bohdan Schneider",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Atlas of Protein Hydration",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://wataa.datmos.org/"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://wataa.datmos.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure report",
                        "uri": "http://edamontology.org/data_1537"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://wataa.datmos.org/",
    "lastUpdate": "2021-04-20T09:26:18.188169Z",
    "license": "Not licensed",
    "maturity": "Mature",
    "name": "WatAA",
    "owner": "ELIXIR-CZ",
    "publication": [
        {
            "doi": "10.1107/S1399004715015679",
            "metadata": {
                "abstract": "© 2015 International Union of Crystallography.Crystallography provides unique information about the arrangement of water molecules near protein surfaces. Using a nonredundant set of 2818 protein crystal structures with a resolution of better than 1.8Å, the extent and structure of the hydration shell of all 20 standard amino-acid residues were analyzed as function of the residue conformation, secondary structure and solvent accessibility. The results show how hydration depends on the amino-acid conformation and the environment in which it occurs. After conformational clustering of individual residues, the density distribution of water molecules was compiled and the preferred hydration sites were determined as maxima in the pseudo-electron-density representation of water distributions. Many hydration sites interact with both main-chain and side-chain amino-acid atoms, and several occurrences of hydration sites with less canonical contacts, such as carbon-donor hydrogen bonds, OH-π interactions and off-plane interactions with aromatic heteroatoms, are also reported. Information about the location and relative importance of the empirically determined preferred hydration sites in proteins has applications in improving the current methods of hydration-site prediction in molecular replacement, ab initio protein structure prediction and the set-up of molecular-dynamics simulations.",
                "authors": [
                    {
                        "name": "Biedermannova L."
                    },
                    {
                        "name": "Schneider B."
                    }
                ],
                "citationCount": 16,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "Structure of the ordered hydration of amino acids in proteins: Analysis of crystal structures"
            },
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1039/c7cp00187h",
            "metadata": {
                "abstract": "© 2017 the Owner Societies.Water molecules represent an integral part of proteins and a key determinant of protein structure, dynamics and function. WatAA is a newly developed, web-based atlas of amino-acid hydration in proteins. The atlas provides information about the ordered first hydration shell of the most populated amino-acid conformers in proteins. The data presented in the atlas are drawn from two sources: experimental data and ab initio quantum-mechanics calculations. The experimental part is based on a data-mining study of a large set of high-resolution protein crystal structures. The crystal-derived data include 3D maps of water distribution around amino-acids and probability of occurrence of each of the identified hydration sites. The quantum mechanics calculations validate and extend this primary description by optimizing the water position for each hydration site, by providing hydrogen atom positions and by quantifying the interaction energy that stabilizes the water molecule at the particular hydration site position. The calculations show that the majority of experimentally derived hydration sites are positioned near local energy minima for water, and the calculated interaction energies help to assess the preference of water for the individual hydration sites. We propose that the atlas can be used to validate water placement in electron density maps in crystallographic refinement, to locate water molecules mediating protein-ligand interactions in drug design, and to prepare and evaluate molecular dynamics simulations. WatAA: Atlas of Protein Hydration is freely available without login at www.dnatco.org/WatAA.",
                "authors": [
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Biedermannova L."
                    }
                ],
                "citationCount": 2,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Physical Chemistry Chemical Physics",
                "title": "WatAA: Atlas of Protein Hydration. Exploring synergies between data mining and: Ab initio calculations"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ]
}