{
    "additionDate": "2021-01-18T10:12:36Z",
    "biotoolsCURIE": "biotools:mt-sccalr",
    "biotoolsID": "mt-sccalr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dulei@nwpu.edu.cn",
            "name": "Lei Du",
            "typeEntity": "Person"
        },
        {
            "email": "Li.Shen@pennmedicine.upenn.edu",
            "name": "Li Shen",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying diagnosis-specific genotype-phenotype associations via joint multitask sparse canonical correlation analysis and classification.\n\nMulti-task sparse canonical correlation analysis and logistic regression.\n\nIdentifying diagnosis-specific genotype-phenotype associations via joint multi-task sparse canonical correlation analysis and classification, accepted by ISMB 2020.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dulei323/MTSCCALR",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-02T08:05:33Z",
    "license": "GPL-3.0",
    "name": "MT-SCCALR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA434",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Brain imaging genetics studies the complex associations between genotypic data such as single nucleotide polymorphisms (SNPs) and imaging quantitative traits (QTs). The neurodegenerative disorders usually exhibit the diversity and heterogeneity, originating from which different diagnostic groups might carry distinct imaging QTs, SNPs and their interactions. Sparse canonical correlation analysis (SCCA) is widely used to identify bi-multivariate genotype-phenotype associations. However, most existing SCCA methods are unsupervised, leading to an inability to identify diagnosis-specific genotype-phenotype associations. Results: In this article, we propose a new joint multitask learning method, named MT-SCCALR, which absorbs the merits of both SCCA and logistic regression. MT-SCCALR learns genotype-phenotype associations of multiple tasks jointly, with each task focusing on identifying one diagnosis-specific genotype-phenotype pattern. Meanwhile, MT-SCCALR cannot only select relevant SNPs and imaging QTs for each diagnostic group alone, but also allows the selection of those shared by multiple diagnostic groups. We derive an efficient optimization algorithm whose convergence to a local optimum is guaranteed. Compared with two state-of-the-art methods, MT-SCCALR yields better or similar canonical correlation coefficients and classification performances. In addition, it owns much better discriminative canonical weight patterns of great interest than competitors. This demonstrates the power and capability of MTSCCAR in identifying diagnostically heterogeneous genotype-phenotype patterns, which would be helpful to understand the pathophysiology of brain disorders. Availability and implementation: The software is publicly available at https://github.com/dulei323/MTSCCALR.",
                "authors": [
                    {
                        "name": "Du L."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Yao X."
                    },
                    {
                        "name": "Risacher S.L."
                    },
                    {
                        "name": "Han J."
                    },
                    {
                        "name": "Guo L."
                    },
                    {
                        "name": "Saykin A.J."
                    },
                    {
                        "name": "Shen L."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying diagnosis-specific genotype-phenotype associations via joint multitask sparse canonical correlation analysis and classification"
            },
            "pmcid": "PMC7355274",
            "pmid": "32657360"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script",
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}