
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "topic": [
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            },
            {
                "term": "Molecular biology",
                "uri": "http://edamontology.org/topic_3047"
            },
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, Springer Nature Switzerland AG.The in silico prediction of partition coefficients is an important task in computer-aided drug discovery. In particular the octanol–water partition coefficient is used as surrogate for lipophilicity. Various computational approaches have been proposed, ranging from simple group-contribution techniques based on the 2D topology of a molecule to rigorous methods based molecular dynamics (MD) or quantum chemistry. In order to balance accuracy and computational cost, we recently developed the MD fingerprints (MDFPs), where the information in MD simulations is encoded in a floating-point vector, which can be used as input for machine learning (ML). The MDFP-ML approach was shown to perform similarly to rigorous methods while being substantially more efficient. Here, we present the application of MDFP-ML for the prediction of octanol–water partition coefficients in the SAMPL6 blind challenge. The underlying computational pipeline is made freely available in form of the MDFPtools package.",
            "authors": [
                "Wang S.",
                "Riniker S."
            ],
            "cit_count": 0,
            "doi": "10.1007/S10822-019-00252-6",
            "journal": "Journal of Computer-Aided Molecular Design",
            "pmid": "31745704",
            "title": "Use of molecular dynamics fingerprints (MDFPs) in SAMPL6 octanol–water log P blind challenge",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:MDFPtools",
        "biotoolsID": "MDFPtools",
        "description": "Use of molecular dynamics fingerprints (MDFPs) in SAMPL6 octanol-water log P blind challenge.\n\nThis is a Python implementation of the molecular dynamics fingerprints (MDFP) methodology for building predictive models for phys-chem properties as delineated in our publication.\n\nThis toolkit is described and applied to the SAMPL6 logP prediction challenge, with the results published here.\n\nVisit our documentation to learn details about installation, example workflow and API references.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MDFP-ML', 'MDFPs', 'SAMPL6', 'octanol-water'",
        "homepage": "https://github.com/rinikerlab/mdfptools/",
        "name": "MDFPtools"
    }
}