{
    "additionDate": "2017-01-17T15:00:43Z",
    "biotoolsCURIE": "biotools:iclusterplus",
    "biotoolsID": "iclusterplus",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "qmo@bcm.edu",
            "name": "Qianxing Mo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "shenr@mskcc.org",
            "name": "Ronglai Shen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Integrative clustering of multiple genomic data using a joint latent variable model.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/iClusterPlus.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/iClusterPlus_1.10.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/iClusterPlus.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-2.0",
    "name": "iClusterPlus",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/biostatistics/kxx017",
            "metadata": {
                "abstract": "Identification of clinically relevant tumor subtypes and omics signatures is an important task in cancer translational research for precision medicine. Large-scale genomic profiling studies such as The Cancer Genome Atlas (TCGA) Research Network have generated vast amounts of genomic, transcriptomic, epigenomic, and proteomic data. While these studies have provided great resources for researchers to discover clinically relevant tumor subtypes and driver molecular alterations, there are fewcomputationally efficient methods and tools for integrative clustering analysis of these multi-type omics data. Therefore, the aim of this article is to develop a fully Bayesian latent variable method (called iClusterBayes) that can jointly model omics data of continuous and discrete data types for identification of tumor subtypes and relevant omics features. Specifically, the proposed method uses a few latent variables to capture the inherent structure of multiple omics data sets to achieve joint dimension reduction. As a result, the tumor samples can be clustered in the latent variable space and relevant omics features that drive the sample clustering are identified through Bayesian variable selection. This method significantly improve on the existing integrative clustering method iClusterPlus in terms of statistical inference and computational speed. By analyzing TCGA and simulated data sets, we demonstrate the excellent performance of the proposed method in revealing clinically meaningful tumor subtypes and driver omics features.",
                "authors": [
                    {
                        "name": "Chan K.S."
                    },
                    {
                        "name": "Guo C."
                    },
                    {
                        "name": "Hilsenbeck S.G."
                    },
                    {
                        "name": "Mo Q."
                    },
                    {
                        "name": "Shen R."
                    },
                    {
                        "name": "Vannucci M."
                    }
                ],
                "citationCount": 45,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Biostatistics",
                "title": "A fully Bayesian latent variable model for integrative clustering analysis of multi-type omics data"
            },
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1.10.0"
    ]
}
