{
    "additionDate": "2021-01-18T10:33:06Z",
    "biotoolsCURIE": "biotools:m6areader",
    "biotoolsID": "m6areader",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kunqi.chen@liverpool.ac.uk",
            "name": "Kunqi Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Epitranscriptome Target Prediction and Functional Characterization of a sequence-based N6-methyladenosine (m6A) modification site predictor.\n\nAmong the various types of RNA modification, the methylation of adenosine at the N6 position (m6A) is characterized as the most abundant post-transcriptional modification in mRNA.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://m6areader.rnamd.com",
    "lastUpdate": "2021-03-02T08:04:38Z",
    "name": "m6Areader",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FCELL.2020.00741",
            "metadata": {
                "abstract": "© Copyright © 2020 Zhen, Wu, Zhang, Chen, Song, Xu, Tang, Wei and Meng.N6-methyladenosine (m6A) is the most abundant post-transcriptional modification in mRNA, and regulates critical biological functions via m6A reader proteins that bind to m6A-containing transcripts. There exist multiple m6A reader proteins in the human genome, but their respective binding specificity and functional relevance under different biological contexts are not yet fully understood due to the limitation of experimental approaches. An in silico study was devised to unveil the target specificity and regulatory functions of different m6A readers. We established a support vector machine-based computational framework to predict the epitranscriptome-wide targets of six m6A reader proteins (YTHDF1-3, YTHDC1-2, and EIF3A) based on 58 genomic features as well as the conventional sequence-derived features. Our model achieved an average AUC of 0.981 and 0.893 under the full-transcript and mature mRNA model, respectively, marking a substantial improvement in accuracy compared to the sequence encoding schemes tested. Additionally, the distinct biological characteristics of each individual m6A reader were explored via the distribution, conservation, Gene Ontology enrichment, cellular components and molecular functions of their target m6A sites. A web server was constructed for predicting the putative binding readers of m6A sites to serve the research community, and is freely accessible at: http://m6areader.rnamd.com.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhen D."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-11T00:00:00Z",
                "journal": "Frontiers in Cell and Developmental Biology",
                "title": "m6A Reader: Epitranscriptome Target Prediction and Functional Characterization of N6-Methyladenosine (m6A) Readers"
            },
            "pmcid": "PMC7431669",
            "pmid": "32850851"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ]
}
