{
    "additionDate": "2022-10-11T12:54:34.651178Z",
    "biotoolsCURIE": "biotools:vlcvirus",
    "biotoolsID": "vlcvirus",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/vlcvirus/"
        }
    ],
    "description": "A Web Resource For Designing Subunit Vaccine Candidates Against Lung Cancer Associated Viruses",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/vlcvirus/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/vlcvirus/",
    "lastUpdate": "2022-10-11T12:54:39.962099Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/vlcvirus/"
        }
    ],
    "name": "vlcvirus",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2021.104215",
            "metadata": {
                "abstract": "© 2021Globally, ~20% of cancer malignancies are associated with virus infections. Lung cancer is the most prevalent cancer and has a 10% 5-year survival rate when diagnosed at stage IV. Cancer vaccines and oncolytic immunotherapy are promising treatment strategies for better clinical outcomes in advanced-stage cancer patients. Here, we used a reverse vaccinology approach to devise subunit vaccine candidates against lung cancer-causing oncogenic viruses. Protein components (945) from nine oncogenic virus species were systematically analyzed to identify epitope-based subunit vaccine candidates. Best vaccine candidates were identified based on their predicted ability to stimulate humoral and cell-mediated immunity and avoid self-tolerance. Using a rigorous integrative approach, we identified 125 best antigenic epitopes with predicted B-cell, T-cell, and/or MHC-binding capability and vaccine adjuvant potential. Thirty-two of these antigenic epitopes were predicted to have IL-4/IFN-gamma inducing potential and IL-10 non-inducing potential and were predicted to bind 15 MHC-type I and 49 MHC-type II alleles. All 32 epitopes were non-allergenic and 31 were non-toxic. The identified epitopes showed good conservancy and likely bind a broad class of human HLA alleles, indicating promiscuous potential. The majority of best antigenic epitopes were derived from Human papillomavirus and Epstein-Barr virus proteins. Of the 32 epitopes, 25 promiscuous epitopes were related to E1 and E6 envelope genes and were present in multiple viral strains/species, potentially providing heterologous immunity. Further validating our results, 38 antigenic epitopes were also present in the largest experimentally-validated epitope resource, Immune Epitope Database and Analysis Resource. We further narrowed the selection to 29 antigenic epitopes with the highest immunogenic/immune-boosting potential. These epitopes possess tremendous therapeutic potential as vaccines against lung cancer-causing viruses and should be validated in future experiments. All findings are available at https://webs.iiitd.edu.in/raghava/vlcvirus/.",
                "authors": [
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Lathwal A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "In-silico identification of subunit vaccine candidates against lung cancer-associated oncogenic viruses"
            },
            "pmid": "33465550"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
