{
    "additionDate": "2017-08-03T18:45:04Z",
    "biotoolsCURIE": "biotools:genefatt",
    "biotoolsID": "genefatt",
    "credit": [
        {
            "email": "desheng619@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool that can compute all attractors in synchronous dynamic models and asynchronous dynamic models. It is helpful for biologist to deep understand the genetic regulatory networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/desheng619/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/desheng619/download",
    "lastUpdate": "2018-12-10T12:58:46Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/genefatt-computing-attractors-of-synchronous-and-asynchronous-boolean-networks.html"
        }
    ],
    "name": "GeneFAtt",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Biological networks, such as genetic regulatory networks, often contain positive and negative feedback loops that settle down to dynamically stable patterns. Identifying these patterns, the so-called attractors, can provide important insights for biologists to understand the molecular mechanisms underlying many coordinated cellular processes such as cellular division, differentiation, and homeostasis. Both synchronous and asynchronous Boolean networks have been used to simulate genetic regulatory networks and identify their attractors. The common methods of computing attractors are that start with a randomly selected initial state and finish with exhaustive search of the state space of a network. However, the time complexity of these methods grows exponentially with respect to the number and length of attractors. Here, we build two algorithms to achieve the computation of attractors in synchronous and asynchronous Boolean networks. For the synchronous scenario, combing with iterative methods and reduced order binary decision diagrams (ROBDD), we propose an improved algorithm to compute attractors. For another algorithm, the attractors of synchronous Boolean networks are utilized in asynchronous Boolean translation functions to derive attractors of asynchronous scenario. The proposed algorithms are implemented in a procedure called geneFAtt. Compared to existing tools such as genYsis, geneFAtt is significantly 3.25-116 × faster in computing attractors for empirical experimental systems. Availability: The software package is available at https://sites.google.com/site/desheng619/download. © 2013 Zheng et al.",
                "authors": [
                    {
                        "name": "Zheng D."
                    },
                    {
                        "name": "Yang G."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "He L."
                    }
                ],
                "citationCount": 29,
                "date": "2013-04-09T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "An Efficient Algorithm for Computing Attractors of Synchronous And Asynchronous Boolean Networks"
            },
            "pmid": "23585840"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}