
{
    "credit": [
        {
            "email": "cai@cs.uga.edu",
            "name": "Liming Cai",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://rna-informatics.uga.edu/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://rna-informatics.uga.edu/?f=software&p=BkTree"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/bktree-prediction-of-rna-nucleotide-interactions-with-backbone-k-tree-model.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Given the importance of non-coding RNAs to cellular regulatory functions, it would be highly desirable to have accurate computational prediction of RNA 3D structure, a task which remains challenging. Even for a short RNA sequence, the space of tertiary conformations is immense; existing methods to identify native-like conformations mostly resort to random sampling of conformations to achieve computational feasibility. However, native conformations may not be examined and prediction accuracy may be compromised due to sampling. State-of-the-art methods have yet to deliver satisfactory predictions for RNAs of length beyond 50 nucleotides. Results: This paper presents a method to tackle a key step in the RNA 3D structure prediction problem, the prediction of the nucleotide interactions that constitute the desired 3D structure. The research is based on a novel graph model, called a backbone k-tree, to tightly constrain the nucleotide interaction relationships considered for RNA 3D structures. It is shown that the new model makes it possible to efficiently predict the optimal set of nucleotide interactions (including the non-canonical interactions in all recently revealed families) from the query sequence along with known or predicted canonical basepairs. The preliminary results indicate that in most cases the new method can predict with a high accuracy the nucleotide interactions that constitute the 3D structure of the query sequence. It thus provides a useful tool for the accurate prediction of RNA 3D structure. Availability and Implementation: The source package for BkTree is available at http://rna-informatics.uga.edu/index.php?f=software&p=BkTree.",
            "authors": [
                "Ding L.",
                "Xue X.",
                "Lamarca S.",
                "Mohebbi M.",
                "Samad A.",
                "Malmberg R.L.",
                "Cai L."
            ],
            "cit_count": 0,
            "journal": "Bioinformatics",
            "pmid": "25886978",
            "title": "Accurate prediction of RNA nucleotide interactions with backbone k-tree model",
            "year": "2015-01-19"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bktree",
        "biotoolsID": "bktree",
        "description": "Utility capable of predicting all familites of RNA nucleotide interactions, including base-base, base-phosphate, base-ribose, and base-stacking interactions, from the input query sequence (along with predicted or known canonical Watson-Crick base pairs).",
        "homepage": "http://rna-informatics.uga.edu/index.php?f=software&p=BkTree",
        "name": "BkTree"
    }
}