{
    "additionDate": "2021-01-18T09:49:53Z",
    "biotoolsCURIE": "biotools:virus-ckb",
    "biotoolsID": "virus-ckb",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhf11@pitt.edu",
            "name": "Zhiwei Feng",
            "orcidid": "https://orcid.org/0000-0001-6533-8932",
            "typeEntity": "Person"
        },
        {
            "email": "xix15@pitt.edu",
            "name": "Xiang-Qun Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "an integrated bioinformatics platform and analysis resource for COVID-19 research.\n\nA generic knowledgebase computation platform integrated with our established chemogenomics tools as well as our algorithms for data visualization and analyses.\n\nVirus-CKB is a knowledgebase for COVID-19 and similar viral infection research that implemented with our established chemogenomics tools as well as our algorithms for data visualization and analyses. This tool predicts the BioActivities on 92 viral related targets for a query compound and provides a handy user interface for viewing, downloading and plotting the output results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.cbligand.org/g/virus-ckb",
    "lastUpdate": "2021-03-13T14:07:50Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.cbligand.org/g/virus-ckb/job/list"
        }
    ],
    "name": "Virus-CKB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA155",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Given the scale and rapid spread of the coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), there is an urgent need for medicines that can help before vaccines are available. In this study, we present a viral-associated disease-specific chemogenomics knowledgebase (Virus-CKB) and apply our computational systems pharmacology-target mapping to rapidly predict the FDA-approved drugs which can quickly progress into clinical trials to meet the urgent demand of the COVID-19 outbreak. Virus-CKB reuses the underlying platform of our DAKB-GPCRs but adds new features like multiple-compound support, multi-cavity protein support and customizable symbol display. Our one-stop computing platform describes the chemical molecules, genes and proteins involved in viral-associated diseases regulation. To date, Virus-CKB archived 65 antiviral drugs in the market, 107 viral-related targets with 189 available 3D crystal or cryo-EM structures and 2698 chemical agents reported for these target proteins. Moreover, Virus-CKB is implemented with web applications for the prediction of the relevant protein targets and analysis and visualization of the outputs, including HTDocking, TargetHunter, BBB predictor, NGL Viewer, Spider Plot, etc. The Virus-CKB server is accessible at https://www.cbligand.org/g/virus-ckb.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Feng Z."
                    },
                    {
                        "name": "Liang T."
                    },
                    {
                        "name": "Shen M."
                    },
                    {
                        "name": "Xie X.-Q."
                    }
                ],
                "citationCount": 5,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Virus-CKB: An integrated bioinformatics platform and analysis resource for COVID-19 research"
            },
            "pmcid": "PMC7454273",
            "pmid": "32715315"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
