{
    "additionDate": "2017-12-18T00:14:11Z",
    "biotoolsCURIE": "biotools:vonode",
    "biotoolsID": "vonode",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "cpan@utk.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "New de novo sequencing algorithm which has been developed specifically for analysis of such high-resolution tandem mass spectra.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "http://www.omicsbio.org/",
    "lastUpdate": "2022-01-11T16:45:56.473075Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/vonode-de-novo-sequencing-algorithm-for-shotgun-proteomics-using-high-resolution-tandem-mass-spectrometry.html"
        }
    ],
    "name": "Vonode",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-118",
            "metadata": {
                "abstract": "Background: High-resolution tandem mass spectra can now be readily acquired with hybrid instruments, such as LTQ-Orbitrap and LTQ-FT, in high-throughput shotgun proteomics workflows. The improved spectral quality enables more accurate de novo sequencing for identification of post-translational modifications and amino acid polymorphisms.Results: In this study, a new de novo sequencing algorithm, called Vonode, has been developed specifically for analysis of such high-resolution tandem mass spectra. To fully exploit the high mass accuracy of these spectra, a unique scoring system is proposed to evaluate sequence tags based primarily on mass accuracy information of fragment ions. Consensus sequence tags were inferred for 11,422 spectra with an average peptide length of 5.5 residues from a total of 40,297 input spectra acquired in a 24-hour proteomics measurement of Rhodopseudomonas palustris. The accuracy of inferred consensus sequence tags was 84%. According to our comparison, the performance of Vonode was shown to be superior to the PepNovo v2.0 algorithm, in terms of the number of de novo sequenced spectra and the sequencing accuracy.Conclusions: Here, we improved de novo sequencing performance by developing a new algorithm specifically for high-resolution tandem mass spectral data. The Vonode algorithm is freely available for download at http://compbio.ornl.gov/Vonode. © 2010 Pan et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Pan C."
                    },
                    {
                        "name": "Park B.H."
                    },
                    {
                        "name": "McDonald W.H."
                    },
                    {
                        "name": "Carey P.A."
                    },
                    {
                        "name": "Banfield J.F."
                    },
                    {
                        "name": "VerBerkmoes N.C."
                    },
                    {
                        "name": "Hettich R.L."
                    },
                    {
                        "name": "Samatova N.F."
                    }
                ],
                "citationCount": 50,
                "date": "2010-03-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A high-throughput de novo sequencing approach for shotgun proteomics using high-resolution tandem mass spectrometry"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}