{
    "additionDate": "2018-05-29T12:52:19Z",
    "biotoolsCURIE": "biotools:giant",
    "biotoolsID": "giant",
    "credit": [
        {
            "email": "kengo@ecei.tohoku.ac.jp",
            "name": "Kengo Kinoshita",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pattern analysis of molecular interactions in 3D structures of protein–small ligand complexes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://giant.hgc.jp/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://giant.hgc.jp/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "GIANT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-12",
            "metadata": {
                "abstract": "Background: Interpretation of binding modes of protein-small ligand complexes from 3D structure data is essential for understanding selective ligand recognition by proteins. It is often performed by visual inspection and sometimes largely depends on a priori knowledge about typical interactions such as hydrogen bonds and π-π stacking. Because it can introduce some biases due to scientists' subjective perspectives, more objective viewpoints considering a wide range of interactions are required.Description: In this paper, we present a web server for analyzing protein-small ligand interactions on the basis of patterns of atomic contacts, or \" interaction patterns\" obtained from the statistical analyses of 3D structures of protein-ligand complexes in our previous study. This server can guide visual inspection by providing information about interaction patterns for each atomic contact in 3D structures. Users can visually investigate what atomic contacts in user-specified 3D structures of protein-small ligand complexes are statistically overrepresented. This server consists of two main components: \" Complex Analyzer\" , and \" Pattern Viewer\" The former provides a 3D structure viewer with annotations of interacting amino acid residues, ligand atoms, and interacting pairs of these. In the annotations of interacting pairs, assignment to an interaction pattern of each contact and statistical preferences of the patterns are presented. The \" Pattern Viewer\" provides details of each interaction pattern. Users can see visual representations of probability density functions of interactions, and a list of protein-ligand complexes showing similar interactions.Conclusions: Users can interactively analyze protein-small ligand binding modes with statistically determined interaction patterns rather than relying on a priori knowledge of the users, by using our new web server named GIANT that is freely available at http://giant.hgc.jp/. © 2014 Kasahara and Kinoshita; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Kasahara K."
                    },
                    {
                        "name": "Kinoshita K."
                    }
                ],
                "citationCount": 9,
                "date": "2014-01-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GIANT: Pattern analysis of molecular interactions in 3D structures of protein-small ligand complexes"
            },
            "pmcid": "PMC3897944",
            "pmid": "24423161"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}