{
    "additionDate": "2017-09-11T10:28:49Z",
    "biotoolsCURIE": "biotools:gprotpred",
    "biotoolsID": "gprotpred",
    "credit": [
        {
            "email": "mtheodo@biol.uoa.gr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Detection of distinct Galpha families, Gbeta and Ggamma subunits of heterotrimeric G-proteins using profile Hidden Markov Models (pHMMs).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://aias.biol.uoa.gr/GprotPRED/helppage.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://aias.biol.uoa.gr/GprotPRED/",
    "lastUpdate": "2019-01-13T00:45:15Z",
    "name": "GprotPRED",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "katnastou",
    "publication": [
        {
            "doi": "10.1016/j.bbapap.2016.02.005",
            "metadata": {
                "abstract": "© 2016 Elsevier B.V.Heterotrimeric G-proteins form a major protein family, which participates in signal transduction. They are composed of three subunits, Gα, Gβ and Gγ. The Gα subunit is further divided in four distinct families Gs, Gi/o, Gq/11 and G12/13. The goal of this work was to detect and classify members of the four distinct families, plus the Gβ and the Gγ subunits of G-proteins from sequence alone. To achieve this purpose, six specific profile Hidden Markov Models (pHMMs) were built and checked for their credibility. These models were then applied to ten (10) proteomes and were able to identify all known G-protein and classify them into the distinct families. In a separate case study, the models were applied to twenty seven (27) arthropod proteomes and were able to give more credible classification in proteins with uncertain annotation and in some cases to detect novel proteins. An online tool, GprotPRED, was developed that uses these six pHMMs. The sensitivity and specificity for all pHMMs were equal to 100% with the exception of the Gβ case, where sensitivity equals to 100%, while specificity is 99.993%. In contrast to Pfam's pHMM which detects Gα subunits in general, our method not only detects Gα subunits but also classifies them into the appropriate Gα-protein family and thus could become a useful tool for the annotation of G-proteins in newly discovered proteomes. GprotPRED online tool is publicly available for non-commercial use at http://bioinformatics.biol.uoa.gr/GprotPRED and, also, a standalone version of the tool at https://github.com/vkostiou/GprotPRED.",
                "authors": [
                    {
                        "name": "Hamodrakas S.J."
                    },
                    {
                        "name": "Kostiou V.D."
                    },
                    {
                        "name": "Theodoropoulou M.C."
                    }
                ],
                "citationCount": 1,
                "date": "2016-05-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Proteins and Proteomics",
                "title": "GprotPRED: Annotation of Gα, Gβ and Gγ subunits of G-proteins using profile Hidden Markov Models (pHMMs) and application to proteomes"
            },
            "pmid": "26854601",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "validated": 1
}
