{
    "additionDate": "2017-03-27T11:53:34Z",
    "biotoolsCURIE": "biotools:droid",
    "biotoolsID": "droid",
    "credit": [
        {
            "email": "DroID@wayne.edu",
            "name": "DroID Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Drosophila Interactions Database, is a comprehensive public resource for Drosophila gene and protein interactions. It contains genetic interactions and experimentally detected protein-protein interactions curated from the literature and from external databases, and predicted protein interactions based on experiments in other species. Protein interactions are annotated with experimental details and periodically updated confidence scores.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://droidb.org/DBdescription.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://droidb.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "DroID",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "DroID (http://droidb.org/), the Drosophila Interactions Database, is a comprehensive public resource for Drosophila gene and protein interactions. DroID contains genetic interactions and experimentally detected protein-protein interactions curated from the literature and from external databases, and predicted protein interactions based on experiments in other species. Protein interactionsare annotated with experimental details and periodically updated confidence scores. Data in DroID is accessible through user-friendly, intuitive interfaces that allow simple or advanced searches and graphical visualization of interaction networks. DroID has been expanded to include interaction types that enable more complete analyses of the genetic networks that underlie biological processes. In addition to protein-protein and genetic interactions, the database now includes transcription factor-gene and regulatory RNA-gene interactions. In addition, DroID now has more gene expression data that can be used to search and filter interaction networks. Orthologous gene mappings of Drosophila genes to other organisms are also available to facilitate finding interactions based on gene names and identifiers for a number of common model organisms and humans. Improvements have been made to the web and graphical interfaces to help biologists gain a comprehensive view of the interaction networks relevant to the genes and systems that they study.DroID (http://droidb.org/), the Drosophila Interactions Database, is a comprehensive public resource for Drosophila gene and protein interactions. DroID contains genetic interactions and experimentally detected protein-protein interactions curated from the literature and from external databases, and predicted protein interactions based on experiments in other species. Protein interactions are annotated with experimental details and periodically updated confidence scores. Data in DroID is accessible through user-friendly, intuitive interfaces that allow simple or advanced searches and graphical visualization of interaction networks. DroID has been expanded to include interaction types that enable more complete analyses of the genetic networks that underlie biological processes. In addition to protein-protein and genetic interactions, the database now includes transcription factor-gene and regulatory RNA-gene interactions. In addition, DroID now has more gene expression data that can be used to search and filter interaction networks. Orthologous gene mappings of Drosophila genes to other organisms are also available to facilitate finding interactions based on gene names and identifiers for a number of common model organisms and humans. Improvements have been made to the web and graphical interfaces to help biologists gain a comprehensive view of the interaction networks relevant to the genes and systems that they study. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Murali T."
                    },
                    {
                        "name": "Pacifico S."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Guest S."
                    },
                    {
                        "name": "Roberts III G.G."
                    },
                    {
                        "name": "Finley Jr. R.L."
                    }
                ],
                "citationCount": 107,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DroID 2011: A comprehensive, integrated resource for protein, transcription factor, RNA and gene interactions for Drosophila"
            },
            "pmid": "21036869"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}