{
    "accessibility": "Open access",
    "additionDate": "2017-01-13T13:15:35Z",
    "biotoolsCURIE": "biotools:mummer",
    "biotoolsID": "mummer",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mummer-help@lists.sourceforge.net",
            "name": "Help list",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MUMmer is a modular system for the rapid whole genome alignment of finished or draft sequence. Basically it is a ultra-fast alignment of large-scale DNA and protein sequences",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mummer.sourceforge.net/manual/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/mummer4/mummer/releases"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://mummer.sourceforge.net/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-04-22T06:45:15Z",
    "license": "Artistic-2.0",
    "maturity": "Mature",
    "name": "MUMmer",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_018171"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A new system for aligning whole genome sequences is described. Using an efficient data structure called a suffix tree, the system is able to rapidly align sequences containing millions of nucleotides. Its use is demonstrated on two strains of Mycoplasma tuberculosis, on two less similar species of Mycoplasma bacteria and on two syntenic sequences from human chromosome 12 and mouse chromosome 6. In each case it found an alignment of the input sequences, using between 30 s and 2 min of computation time. From the system output, information on single nucleotide changes, translocations and homologous genes can easily be extracted. Use of the algorithm should facilitate analysis of syntenic chromosomal regions, strain-to-strain comparisons, evolutionary comparisons and genomic duplications.",
                "authors": [
                    {
                        "name": "Delcher A.L."
                    },
                    {
                        "name": "Kasif S."
                    },
                    {
                        "name": "Fleischmann R.D."
                    },
                    {
                        "name": "Peterson J."
                    },
                    {
                        "name": "White O."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 566,
                "date": "1999-06-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Alignment of whole genomes"
            },
            "pmid": "10325427"
        },
        {
            "doi": "10.1371/journal.pcbi.1005944",
            "metadata": {
                "abstract": "© 2018 Public Library of Science. All Rights Reserved.The MUMmer system and the genome sequence aligner nucmer included within it are among the most widely used alignment packages in genomics. Since the last major release of MUMmer version 3 in 2004, it has been applied to many types of problems including aligning whole genome sequences, aligning reads to a reference genome, and comparing different assemblies of the same genome. Despite its broad utility, MUMmer3 has limitations that can make it difficult to use for large genomes and for the very large sequence data sets that are common today. In this paper we describe MUMmer4, a substantially improved version of MUMmer that addresses genome size constraints by changing the 32-bit suffix tree data structure at the core of MUMmer to a 48-bit suffix array, and that offers improved speed through parallel processing of input query sequences. With a theoretical limit on the input size of 141Tbp, MUMmer4 can now work with input sequences of any biologically realistic length. We show that as a result of these enhancements, the nucmer program in MUMmer4 is easily able to handle alignments of large genomes; we illustrate this with an alignment of the human and chimpanzee genomes, which allows us to compute that the two species are 98% identical across 96% of their length. With the enhancements described here, MUMmer4 can also be used to efficiently align reads to reference genomes, although it is less sensitive and accurate than the dedicated read aligners. The nucmer aligner in MUMmer4 can now be called from scripting languages such as Perl, Python and Ruby. These improvements make MUMer4 one the most versatile genome alignment packages available.",
                "authors": [
                    {
                        "name": "Marcais G."
                    },
                    {
                        "name": "Delcher A.L."
                    },
                    {
                        "name": "Phillippy A.M."
                    },
                    {
                        "name": "Coston R."
                    },
                    {
                        "name": "Salzberg S.L."
                    },
                    {
                        "name": "Zimin A."
                    }
                ],
                "citationCount": 246,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "MUMmer4: A fast and versatile genome alignment system"
            }
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "4"
    ]
}