{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:09:23Z",
    "biotoolsCURIE": "biotools:FASTO",
    "biotoolsID": "FASTO",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kskwak@inha.ac.kr",
            "name": "Kyung-Sup Kwak",
            "orcidid": "https://orcid.org/0000-0002-9559-4352",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FHIR And SSN based Type 1 diabetes Ontology (FASTO) is an OWL 2 ontology for real time management of insulin for diabetes patients especially type 1 diabetics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "https://bioportal.bioontology.org/ontologies/FASTO",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "FASTO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0806-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Mobile health (MH) technologies including clinical decision support systems (CDSS) provide an efficient method for patient monitoring and treatment. A mobile CDSS is based on real-time sensor data and historical electronic health record (EHR) data. Raw sensor data have no semantics of their own; therefore, a computer system cannot interpret these data automatically. In addition, the interoperability of sensor data and EHR medical data is a challenge. EHR data collected from distributed systems have different structures, semantics, and coding mechanisms. As a result, building a transparent CDSS that can work as a portable plug-and-play component in any existing EHR ecosystem requires a careful design process. Ontology and medical standards support the construction of semantically intelligent CDSSs. Methods: This paper proposes a comprehensive MH framework with an integrated CDSS capability. This cloud-based system monitors and manages type 1 diabetes mellitus. The efficiency of any CDSS depends mainly on the quality of its knowledge and its semantic interoperability with different data sources. To this end, this paper concentrates on constructing a semantic CDSS based on proposed FASTO ontology. Results: This realistic ontology is able to collect, formalize, integrate, analyze, and manipulate all types of patient data. It provides patients with complete, personalized, and medically intuitive care plans, including insulin regimens, diets, exercises, and education sub-plans. These plans are based on the complete patient profile. In addition, the proposed CDSS provides real-time patient monitoring based on vital signs collected from patients' wireless body area networks. These monitoring include real-time insulin adjustments, mealtime carbohydrate calculations, and exercise recommendations. FASTO integrates the well-known standards of HL7 fast healthcare interoperability resources (FHIR), semantic sensor network (SSN) ontology, basic formal ontology (BFO) 2.0, and clinical practice guidelines. The current version of FASTO includes 9577 classes, 658 object properties, 164 data properties, 460 individuals, and 140 SWRL rules. FASTO is publicly available through the National Center for Biomedical Ontology BioPortal at https://bioportal.bioontology.org/ontologies/FASTO. Conclusions: The resulting CDSS system can help physicians to monitor more patients efficiently and accurately. In addition, patients in rural areas can depend on the system to manage their diabetes and emergencies.",
                "authors": [
                    {
                        "name": "Ali F."
                    },
                    {
                        "name": "El-Sappagh S."
                    },
                    {
                        "name": "Hendawi A."
                    },
                    {
                        "name": "Jang J.-H."
                    },
                    {
                        "name": "Kwak K.-S."
                    }
                ],
                "citationCount": 17,
                "date": "2019-05-10T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "A mobile health monitoring-and-treatment system based on integration of the SSN sensor ontology and the HL7 FHIR standard"
            },
            "pmcid": "PMC6511155",
            "pmid": "31077222",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
