{
    "additionDate": "2019-11-14T19:56:44Z",
    "biotoolsCURIE": "biotools:SuperCryoEMPicker",
    "biotoolsID": "SuperCryoEMPicker",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "chengji@missouri.edu",
            "name": "Jianlin Cheng",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'cryo-EM', 'super-particle', 'super-clustering' | A Super-Clustering Approach for Fully Automated Single Particle Picking in Cryo-EM | A Super Clustering Approach for Single Particle Picking in cryo-EM Images",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Single particle alignment and classification",
                    "uri": "http://edamontology.org/operation_3458"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jianlin-cheng/SuperCryoEMPicker",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-11-14T19:56:44Z",
    "name": "SuperCryoEMPicker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/GENES10090666",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Structure determination of proteins and macromolecular complexes by single-particle cryo-electron microscopy (cryo-EM) is poised to revolutionize structural biology. An early challenging step in the cryo-EM pipeline is the detection and selection of particles from twodimensional micrographs (particle picking). Most existing particle-picking methods require human intervention to deal with complex (irregular) particle shapes and extremely low signal-to-noise ratio (SNR) in cryo-EM images. Here, we design a fully automated super-clustering approach for single particle picking (SuperCryoEMPicker) in cryo-EM micrographs, which focuses on identifying, detecting, and picking particles of the complex and irregular shapes in micrographs with extremely low signal-to-noise ratio (SNR). Our method first applies advanced image processing procedures to improve the quality of the cryo-EM images. The binary mask image-highlighting protein particles are then generated from each individual cryo-EM image using the super-clustering (SP) method, which improves upon base clustering methods (i.e., k-means, fuzzy c-means (FCM), and intensitybased cluster (IBC) algorithm) via a super-pixel algorithm. SuperCryoEMPicker is tested and evaluated on micrographs of β-galactosidase and 80S ribosomes, which are examples of cryo-EM data exhibiting complex and irregular particle shapes. The results show that the super-particle clustering method provides a more robust detection of particles than the base clustering methods, such as k-means, FCM, and IBC. SuperCryoEMPicker automatically and effectively identifies very complex particles from cryo-EM images of extremely low SNR. As a fully automated particle detection method, it has the potential to relieve researchers from laborious, manual particle-labeling work and therefore is a useful tool for cryo-EM protein structure determination.",
                "authors": [
                    {
                        "name": "Azzawi A.A."
                    },
                    {
                        "name": "Ouadou A."
                    },
                    {
                        "name": "Tanner J.J."
                    },
                    {
                        "name": "Cheng J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Genes",
                "title": "A super-clustering approach for fully automated single particle picking in cryo-em"
            },
            "pmcid": "PMC6770523",
            "pmid": "31480377"
        }
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}