{
    "additionDate": "2021-01-18T07:07:13Z",
    "biotoolsCURIE": "biotools:bioseqzip",
    "biotoolsID": "bioseqzip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gianvito.urgese@polito.it",
            "name": "Gianvito Urgese",
            "orcidid": "https://orcid.org/0000-0003-2672-7593",
            "typeEntity": "Person"
        }
    ],
    "description": "BioSeqZip is a tool for performing exact collapsing of Second-Generation Sequencing datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinformatics-polito/BioSeqZip",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-04T14:53:09Z",
    "name": "BioSeqZip",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA051",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press.Motivation: High-throughput next-generation sequencing can generate huge sequence files, whose analysis requires alignment algorithms that are typically very demanding in terms of memory and computational resources. This is a significant issue, especially for machines with limited hardware capabilities. As the redundancy of the sequences typically increases with coverage, collapsing such files into compact sets of non-redundant reads has the 2-fold advantage of reducing file size and speeding-up the alignment, avoiding to map the same sequence multiple times. Method: BioSeqZip generates compact and sorted lists of alignment-ready non-redundant sequences, keeping track of their occurrences in the raw files as well as of their quality score information. By exploiting a memory-constrained external sorting algorithm, it can be executed on either single-or multi-sample datasets even on computers with medium computational capabilities. On request, it can even re-expand the compacted files to their original state. Results: Our extensive experiments on RNA-Seq data show that BioSeqZip considerably brings down the computational costs of a standard sequence analysis pipeline, with particular benefits for the alignment procedures that typically have the highest requirements in terms of memory and execution time. In our tests, BioSeqZip was able to compact 2.7 billion of reads into 963 million of unique tags reducing the size of sequence files up to 70% and speeding-up the alignment by 50% at least.",
                "authors": [
                    {
                        "name": "Urgese G."
                    },
                    {
                        "name": "Parisi E."
                    },
                    {
                        "name": "Scicolone O."
                    },
                    {
                        "name": "Di Cataldo S."
                    },
                    {
                        "name": "Ficarra E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BioSeqZip: A collapser of NGS redundant reads for the optimization of sequence analysis"
            },
            "pmcid": "PMC7203750",
            "pmid": "31999333"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}