{
    "additionDate": "2021-01-18T12:02:19Z",
    "biotoolsCURIE": "biotools:eyedose",
    "biotoolsID": "eyedose",
    "confidence_flag": "tool",
    "description": "EyeDose is an open-source tool for using published Monte Carlo results to estimate the radiation dose delivered to the tumor and critical ocular structures for 125I Collaborative Ocular Melanoma Study eye plaques.",
    "download": [
        {
            "type": "Source code",
            "url": "https://www.brachyjournal.com/cms/10.1016/j.brachy.2020.09.007/attachment/bbf1fb0a-a49f-4aa3-b775-fc926260e7d2/mmc4.doc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=33187821",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-08T10:51:37Z",
    "name": "EyeDose",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.BRACHY.2020.09.007",
            "metadata": {
                "abstract": "© 2021 American Brachytherapy SocietyPurpose: Radiation side effects and visual outcome for uveal melanoma patients managed with plaque radiotherapy are dependent on the radiation dose administered to the tumor and nearby healthy tissues. We have developed an open-source software tool, EyeDose, to simplify and standardize tumor and critical structure dose reporting for Collaborative Ocular Melanoma Study eye plaques. Methods and Materials: EyeDose is a MATLAB-based program that calculates point dose and volume dose metrics for standard models of the tumor and critical ocular structures. It uses published three-dimensional dose distributions for eye plaques, calculated with Monte Carlo methods, which are oriented with respect to the eye using the tumor's position on a fundus diagram. A standard model for the ocular structures was created using published measurements and patient CT scans. EyeDose reports radiation statistics for the fovea, optic disc, lens, lacrimal gland, retina, and tumor. The dosimetric margin for implant placement uncertainty is also calculated. Results: EyeDose calculations were validated against previously published Monte Carlo results for eight different tumor positions, including the dose to the fovea, optic disc, lacrimal gland, lens, and along the central axis. EyeDose accepts a spreadsheet input for rapidly processing large retrospective patient data sets, with an average run time of <40 s per patient. EyeDose is published as an open-source tool for easy adaptation at different institutions. Conclusions: EyeDose calculates radiation statistics for Collaborative Ocular Melanoma Study eye plaque patients with Monte Carlo accuracy and without a treatment planning system. EyeDose streamlines data collection for large retrospective studies and can also be used prospectively to assess plaque applicability.",
                "authors": [
                    {
                        "name": "Corbin K.S."
                    },
                    {
                        "name": "Dalvin L.A."
                    },
                    {
                        "name": "Deufel C.L."
                    },
                    {
                        "name": "McCauley Cutsinger S."
                    },
                    {
                        "name": "Petersen I.A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Brachytherapy",
                "title": "EyeDose: An open-source tool for using published Monte Carlo results to estimate the radiation dose delivered to the tumor and critical ocular structures for 125I Collaborative Ocular Melanoma Study eye plaques"
            },
            "pmid": "33187821"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
