
{
    "credit": [
        {
            "email": "hymenopterabase@gmail.com",
            "name": "HGD Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            },
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Hymenoptera Genome Database (HGD) is a comprehensive model organism database that caters to the needs of scientists working on insect species of the order Hymenoptera. This system implements open-source software and relational databases providing access to curated data contributed by an extensive, active research community. HGD contains data from 9 different species across ̃200 million years in the phylogeny of Hymenoptera, allowing researchers to leverage genetic, genome sequence and gene expression data, as well as the biological knowledge of related model organisms. The availability of resources across an order greatly facilitates comparative genomics and enhances our understanding of the biology of agriculturally important Hymenoptera species through genomics. Curated data at HGD includes predicted and annotated gene sets supported with evidence tracks such as ESTs/cDNAs, small RNA sequences and GC composition domains. Data at HGD can be queried using genome browsers and/or BLAST/PSI-BLAST servers, and it may also be downloaded to perform local searches. We encourage the public to access and contribute data to HGD at: http://HymenopteraGenome. org. © The Author(s) 2010.",
            "authors": [
                "Munoz-Torres M.C.",
                "Reese J.T.",
                "Childers C.P.",
                "Bennett A.K.",
                "Sundaram J.P.",
                "Childs K.L.",
                "Anzola J.M.",
                "Milshina N.",
                "Elsik C.G."
            ],
            "cit_count": 116,
            "journal": "Nucleic Acids Research",
            "pmid": "21071397",
            "title": "Hymenoptera Genome Database: Integrated community resources for insect species of the order Hymenoptera",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hgd",
        "biotoolsID": "hgd",
        "description": "The Hymenoptera Genome Database is a comprehensive model organism database for insect species of the order Hymenoptera. HGD contains data from 9 different species across 200 million years in the phylogeny of Hymenoptera. Curated data at HGD includes predicted and annotated gene sets supported with evidence tracks such as ESTs/cDNAs, small RNA sequences and GC composition domains.",
        "homepage": "http://HymenopteraGenome.org",
        "name": "The Hymenoptera Genome Database (HGD)"
    }
}