{
    "additionDate": "2021-03-19T09:20:08Z",
    "biotoolsCURIE": "biotools:transvw",
    "biotoolsID": "transvw",
    "confidence_flag": "tool",
    "description": "Exploiting the Semantics of Anatomical Patterns for Self-supervised Learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JLiangLab/TransVW",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-23T17:28:49.133247Z",
    "name": "TransVW",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3060634",
            "metadata": {
                "abstract": "IEEEThis paper introduces a new concept called &#x201C;transferable visual words&#x201D; (TransVW), aiming to achieve annotation efficiency for deep learning in medical image analysis. Medical imaging&#x2014;focusing on particular parts of the body for defined clinical purposes&#x2014;generates images of great similarity in anatomy across patients and yields sophisticated anatomical patterns across images, which are associated with rich semantics about human anatomy and which are natural visual words. We show that these visual words can be automatically harvested according to anatomical consistency via self-discovery, and that the self-discovered visual words can serve as strong yet free supervision signals for deep models to learn semantics-enriched generic image representation via self-supervision (self-classification and self-restoration). Our extensive experiments demonstrate the annotation efficiency of TransVW by offering higher performance and faster convergence with reduced annotation cost in several applications. Our TransVW has several important advantages, including (1) TransVW is a fully autodidactic scheme, which exploits the semantics of visual words for self-supervised learning, requiring no expert annotation; (2) visual word learning is an add-on strategy, which complements existing self-supervised methods, boosting their performance; and (3) the learned image representation is semantics-enriched models, which have proven to be more robust and generalizable, saving annotation efforts for a variety of applications through transfer learning. Our code, pre-trained models, and curated visual words are available at https://github.com/JLiangLab/TransVW.",
                "authors": [
                    {
                        "name": "Haghighi F."
                    },
                    {
                        "name": "Taher M.R.H."
                    },
                    {
                        "name": "Zhou Z."
                    },
                    {
                        "name": "Gotway M.B."
                    },
                    {
                        "name": "Liang J."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Transferable Visual Words: Exploiting the Semantics of Anatomical Patterns for Self-supervised Learning"
            },
            "pmid": "33617450"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}