
{
    "credit": [
        {
            "email": "askar703@gmail.com",
            "name": "Askar Obulkasim",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/stepwiseCM.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/stepwiseCM_1.20.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://master.bioconductor.org/packages//2.10/bioc/html/stepwiseCM.html"
        }
    ],
    "publication": [
        {
            "abstract": "This paper presents the R/Bioconductor package stepwiseCM, which classifies cancer samples using two heterogeneous data sets in an effi-cient way. The algorithm is able to capture the distinct classification power of two given data types without actually combining them. This package suits for classification problems where two different types of data sets on the same samples are available. One of these data types has measurements on all samples and the other one has measurements on some samples. One is easy to collect and/or relatively cheap (eg, clinical covariates) compared to the latter (high-dimensional data, eg, gene expression). One additional application for which stepwiseCM is proven to be useful as well is the combination of two high-dimensional data types, eg, DNA copy number and mRNA expression. The package includes functions to project the neighborhood information in one data space to the other to determine a potential group of samples that are likely to benefit most by measuring the second type of covariates. The two heterogeneous data spaces are connected by indirect mapping. The crucial difference between the stepwise classification strategy implemented in this package and the exist-ing packages is that our approach aims to be cost-efficient by avoiding measuring additional covariates, which might be expensive or patient-unfriendly, for a potentially large subgroup of individuals. Moreover, in diagnosis for these individuals test, results would be quickly available, which may lead to reduced waiting times and hence lower the patients' distress. The improvement described remedies the key limitations of existing packages, and facilitates the use of the stepwiseCM package in diverse applications. © the authors, publisher and licensee Libertas Academica Limited.",
            "authors": [
                "Obulkasim A.",
                "van de Wiel M.A."
            ],
            "cit_count": 0,
            "doi": "10.4137/CIN.S13075",
            "journal": "Cancer Informatics",
            "title": "StepwiseCM: An R package for stepwise classification of cancer samples using multiple heterogeneous data sets",
            "type": "Primary",
            "year": "2014-01-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:stepwisecm",
        "biotoolsID": "stepwisecm",
        "description": "This package implements a cancer samples classification strategy using multiple data sets. It uses the data type for which full measurements are available at the first stage, and the data type for which only partial measurements are available at the second stage. For incoming new samples, it quantifies how much improvement will be obtained if covariates of new samples for the data types at the second stage are measured.",
        "homepage": "https://bioconductor.riken.jp/packages/3.1/bioc/html/stepwiseCM.html",
        "name": "stepwiseCM",
        "version": [
            "1.20.0"
        ]
    }
}