{
    "additionDate": "2017-08-03T18:49:12Z",
    "biotoolsCURIE": "biotools:medusa_motif",
    "biotoolsID": "medusa_motif",
    "credit": [
        {
            "email": "cleslie@cbio.mskcc.org",
            "name": "Christina Leslie",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cbio.mskcc.org/leslielab/home"
        }
    ],
    "description": "Integrative method for learning motif models of transcription factor binding sites by incorporating promoter sequence and gene expression data. We use a modern large-margin machine learning approach, based on boosting, to enable feature selection from the high-dimensional search space of candidate binding sequences while avoiding overfitting.",
    "documentation": [
        {
            "type": "General",
            "url": "http://cbio.mskcc.org/leslielab/software/medusa/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://cbio.mskcc.org/leslielab/software/medusa",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/medusa-motif-element-detection-sequence-agglomeration.html"
        }
    ],
    "name": "MEDUSA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Inferring gene regulatory networks from high-throughput genomic data is one of the central problems in computational biology. In this paper, we describe a predictive modeling approach for studying regulatory networks, based on a machine learning algorithm called MEDUSA. MEDUSA integrates promoter sequence, mRNA expression, and transcription factor occupancy data to learn gene regulatory programs that predict the differential expression of target genes. Instead of using clustering or correlation of expression profiles to infer regulatory relationships, MEDUSA determines condition-specific regulators and discovers regulatory motifs that mediate the regulation of target genes. In this way, MEDUSA meaningfully models biological mechanisms of transcriptional regulation. MEDUSA solves the problem of predicting the differential (up/down) expression of target genes by using boosting, a technique from statistical learning, which helps to avoid overfitting as the algorithm searches through the high-dimensional space of potential regulators and sequence motifs. Experimental results demonstrate that MEDUSA achieves high prediction accuracy on held-out experiments (test data), that is, data not seen in training. We also present context-specific analysis of MEDUSA regulatory programs for DNA damage and hypoxia, demonstrating that MEDUSA identifies key regulators and motifs in these processes. A central challenge in the field is the difficulty of validating reverse-engineered networks in the absence of a gold standard. Our approach of learning regulatory programs provides at least a partial solution for the problem: MEDUSA's prediction accuracy on held-out data gives a concrete and statistically sound way to validate how well the algorithm performs. With MEDUSA, statistical validation becomes a prerequisite for hypothesis generation and network building rather than a secondary consideration. © 2007 New York Academy of Sciences.",
                "authors": [
                    {
                        "name": "Kundaje A."
                    },
                    {
                        "name": "Lianoglou S."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Quigley D."
                    },
                    {
                        "name": "Arias M."
                    },
                    {
                        "name": "Wiggins C.H."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Leslie C."
                    }
                ],
                "citationCount": 10,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Annals of the New York Academy of Sciences",
                "title": "Learning regulatory programs that accurately predict differential expression with MEDUSA"
            },
            "pmid": "17934055"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1
}