{
    "additionDate": "2021-01-18T08:07:14Z",
    "biotoolsCURIE": "biotools:lillies",
    "biotoolsID": "lillies",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "opr@econ.au.dk",
            "name": "Oleguer Plana-Ripoll",
            "orcidid": "https://orcid.org/0000-0002-6470-7465",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for the estimation of excess Life Years Lost among patients with a given disease or condition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "http://CRAN.R-project.org/package=lillies",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-16T08:45:58Z",
    "license": "MIT",
    "name": "lillies",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0228073",
            "metadata": {
                "abstract": "© 2020 Plana-Ripoll et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Life expectancy at a given age is a summary measure of mortality rates present in a population (estimated as the area under the survival curve), and represents the average number of years an individual at that age is expected to live if current age-specific mortality rates apply now and in the future. A complementary metric is the number of Life Years Lost, which is used to measure the reduction in life expectancy for a specific group of persons, for example those diagnosed with a specific disease or condition (e.g. smoking). However, calculation of life expectancy among those with a specific disease is not straightforward for diseases that are not present at birth, and previous studies have considered a fixed age at onset of the disease, e.g. at age 15 or 20 years. In this paper, we present the R package lillies (freely available through the Comprehensive R Archive Network; CRAN) to guide the reader on how to implement a recently-introduced method to estimate excess Life Years Lost associated with a disease or condition that overcomes these limitations. In addition, we show how to decompose the total number of Life Years Lost into specific causes of death through a competing risks model, and how to calculate confidence intervals for the estimates using non-parametric bootstrap. We provide a description on how to use the method when the researcher has access to individual-level data (e.g. electronic healthcare and mortality records) and when only aggregated-level data are available.",
                "authors": [
                    {
                        "name": "Andersen P.K."
                    },
                    {
                        "name": "Canudas-Romo V."
                    },
                    {
                        "name": "Laursen T.M."
                    },
                    {
                        "name": "McGrath J.J."
                    },
                    {
                        "name": "Plana-Ripoll O."
                    },
                    {
                        "name": "Weye N."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Lillies: An R package for the estimation of excess life years lost among patients with a given disease or condition"
            },
            "pmcid": "PMC7059906",
            "pmid": "32142521"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
