{
    "additionDate": "2020-01-09T17:40:29Z",
    "biotoolsCURIE": "biotools:iEEGview",
    "biotoolsID": "iEEGview",
    "confidence_flag": "high",
    "description": "an open-source multifunction GUI-based Matlab toolbox for localization and visualization of human intracranial electrodes.\n\nLocalization and Visualization of Intracranial Electrodes.\n\nPLEASE READ THE IEEGVIEW MANUAL \"Manual_iEEGview_V1.0.PDF\" TO SEE HOW TO USE IT WITH MORE DETAILS. START USING THE IEEGVIEW TOOLBOX IN MATLAB FROM THE PATH WHERE IEEGVIEW.M/FIG IS LOCATED",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GuangyeLiGit/iEEGview",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-01-09T17:40:29Z",
    "license": "GPL-3.0",
    "name": "iEEGview",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1088/1741-2552/AB51A5",
            "metadata": {
                "abstract": "OBJECTIVE: The precise localization of intracranial electrodes is a fundamental step relevant to the analysis of intracranial electroencephalography (iEEG) recordings in various fields. With the increasing development of iEEG studies in human neuroscience, higher requirements have been posed on the localization process, resulting in urgent demand for more integrated, easy-operation and versatile tools for electrode localization and visualization. With the aim of addressing this need, we develop an easy-to-use and multifunction toolbox called iEEGview, which can be used for the localization and visualization of human intracranial electrodes. APPROACH: iEEGview is written in Matlab scripts and implemented with a GUI. From the GUI, by taking only pre-implant MRI and post-implant CT images as input, users can directly run the full localization pipeline including brain segmentation, image co-registration, electrode reconstruction, anatomical information identification, activation map generation and electrode projection from native brain space into common brain space for group analysis. Additionally, iEEGview implements methods for brain shift correction, visual location inspection on MRI slices and computation of certainty index in anatomical label assignment. MAIN RESULTS: All the introduced functions of iEEGview work reliably and successfully, and are tested by images from 28 human subjects implanted with depth and/or subdural electrodes. SIGNIFICANCE: iEEGview is the first public Matlab GUI-based software for intracranial electrode localization and visualization that holds integrated capabilities together within one pipeline. iEEGview promotes convenience and efficiency for the localization process, provides rich localization information for further analysis and offers solutions for addressing raised technical challenges. Therefore, it can serve as a useful tool in facilitating iEEG studies.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Jiang S."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Brunner P."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Schalk G."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Zhang D."
                    }
                ],
                "date": "2019-12-23T00:00:00Z",
                "journal": "Journal of neural engineering",
                "title": "iEEGview: an open-source multifunction GUI-based Matlab toolbox for localization and visualization of human intracranial electrodes"
            },
            "pmid": "31658449"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}