{
    "accessibility": "Open access",
    "additionDate": "2022-09-29T21:39:11.847837Z",
    "biotoolsCURIE": "biotools:re-place",
    "biotoolsID": "re-place",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mieke.vanmulders@sciensano.be",
            "name": "Mieke Van Mulders",
            "typeEntity": "Person"
        },
        {
            "name": "Birgit Mertens"
        },
        {
            "name": "Nancy Liodo Missigba"
        },
        {
            "name": "Vera Rogiers"
        }
    ],
    "description": "A Unique Project Collecting Expertise on New Approach Methodologies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Molecular replacement",
                    "uri": "http://edamontology.org/operation_3455"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.RE-Place.be",
    "lastUpdate": "2022-09-29T21:39:11.850437Z",
    "name": "RE-Place",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FPHAR.2022.930148",
            "metadata": {
                "abstract": "Copyright © 2022 Van Mulders, Liodo Missigba, Mertens and Rogiers.By applying “New Approach Methodologies (NAMs)” based on innovative technologies such as computer modeling, high throughput testing, omics, and sophisticated cell cultures, the use of experimental animals in the life sciences can be reduced or sometimes even completely avoided. Stimulating NAMs may benefit from a bottom-up approach, i.e., local initiatives mapping the available NAMs and promoting their use. An example of such an initiative in Belgium is the RE-Place project, which collects the available NAMs in one central database, and links this knowledge with the names of experts and research centers. To this extent, a template was created to collect the information of interest in a fast and consistent manner. Based on this template, a web-based application was developed to facilitate the entry of information, which was evaluated in a pilot study by experts in the field of NAMs. After integration of their feedback, a revised version of the RE-Place online tool was launched to the public. Aspects such as user-friendliness, quality of submitted information, protection of personal data and Intellectual Property (IP) rights were all considered in the development process. Hurdles like incentives for collaboration were also taken into account. Information submitted with the online tool is directly integrated in the RE-Place open access database. By consulting the database, scientists from various disciplines can easily identify the different types of NAMs and the experts using them in Belgium. As such, the RE-Place database contributes to building trust in the use of NAMs and stimulating their use and regulatory uptake.",
                "authors": [
                    {
                        "name": "Liodo Missigba N."
                    },
                    {
                        "name": "Mertens B."
                    },
                    {
                        "name": "Rogiers V."
                    },
                    {
                        "name": "Van Mulders M."
                    }
                ],
                "date": "2022-06-22T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "RE-Place: A Unique Project Collecting Expertise on New Approach Methodologies"
            },
            "pmcid": "PMC9257167",
            "pmid": "35814243"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Laboratory animal science",
            "uri": "http://edamontology.org/topic_3386"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
