{
    "additionDate": "2018-08-09T16:33:25Z",
    "biotoolsCURIE": "biotools:isvase",
    "biotoolsID": "isvase",
    "credit": [
        {
            "email": "haljohi@kacst.edu.sa",
            "name": "Hasan Awad Aljohi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identification of sequence variant associated with splicing event using RNA-seq data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/isvase/files/README.txt/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/isvase/",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "ISVASE",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1732-7",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Exon recognition and splicing precisely and efficiently by spliceosome is the key to generate mature mRNAs. About one third or a half of disease-related mutations affect RNA splicing. Software PVAAS has been developed to identify variants associated with aberrant splicing by directly using RNA-seq data. However, it bases on the assumption that annotated splicing site is normal splicing, which is not true in fact. Results: We develop the ISVASE, a tool for specifically identifying sequence variants associated with splicing events (SVASE) by using RNA-seq data. Comparing with PVAAS, our tool has several advantages, such as multi-pass stringent rule-dependent filters and statistical filters, only using split-reads, independent sequence variant identification in each part of splicing (junction), sequence variant detection for both of known and novel splicing event, additional exon-exon junction shift event detection if known splicing events provided, splicing signal evaluation, known DNA mutation and/or RNA editing data supported, higher precision and consistency, and short running time. Using a realistic RNA-seq dataset, we performed a case study to illustrate the functionality and effectiveness of our method. Moreover, the output of SVASEs can be used for downstream analysis such as splicing regulatory element study and sequence variant functional analysis. Conclusions: ISVASE is useful for researchers interested in sequence variants (DNA mutation and/or RNA editing) associated with splicing events. The package is freely available at https://sourceforge.net/projects/isvase/.",
                "authors": [
                    {
                        "name": "Aljohi H.A."
                    },
                    {
                        "name": "Hu S."
                    },
                    {
                        "name": "Lin Q."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Yu J."
                    }
                ],
                "date": "2017-06-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ISVASE: Identification of sequence variant associated with splicing event using RNA-seq data"
            },
            "pmcid": "PMC5490186",
            "pmid": "28659141"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
