{
    "accessibility": "Open access",
    "additionDate": "2022-10-30T10:29:50.173279Z",
    "biotoolsCURIE": "biotools:cmrsegtools",
    "biotoolsID": "cmrsegtools",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Magalie.Viallon@creatis.insa-lyon.fr",
            "name": "Magalie Viallon",
            "orcidid": "https://orcid.org/0000-0001-9118-0438",
            "typeEntity": "Person"
        }
    ],
    "description": "CMRSegTools: an open-source application software designed for the segmentation and quantification of myocardial infarct lesion enabling full access to state-of-the-art segmentation methods and parameters, easy integration of new algorithms and standardised results sharing.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OpenCardiacMRISoftware/CMRSegTools",
    "language": [
        "C++"
    ],
    "lastUpdate": "2022-10-30T10:29:50.175677Z",
    "license": "CECILL-2.1",
    "name": "CMRSegTools",
    "operatingSystem": [
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0274491",
            "metadata": {
                "abstract": "© 2022 Romero R. et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In the last decade, a large number of clinical trials have been deployed using Cardiac Magnetic Resonance (CMR) to evaluate cardioprotective strategies aiming at reducing the irreversible myocardial damage at the time of reperfusion. In these studies, segmentation and quantification of myocardial infarct lesion are often performed with a commercial software or an in-house closed-source code development thus creating a barrier for reproducible research. This paper introduces CMRSegTools: an open-source application software designed for the segmentation and quantification of myocardial infarct lesion enabling full access to state-of-the-art segmentation methods and parameters, easy integration of new algorithms and standardised results sharing. This post-processing tool has been implemented as a plug-in for the OsiriX/Horos DICOM viewer leveraging its database management functionalities and user interaction features to provide a bespoke tool for the analysis of cardiac MR images on large clinical cohorts. CMRSegTools includes, among others, user-assisted segmentation of the left-ventricle, semi- and automatic lesion segmentation methods, advanced statistical analysis and visualisation based on the American Heart Association 17-segment model. New segmentation methods can be integrated into the plug-in by developing components based on image processing and visualisation libraries such as ITK and VTK in C++ programming language. CMRSegTools allows the creation of training and testing data sets (labeled features such as lesion, microvascular obstruction and remote ROI) for supervised Machine Learning methods, and enables the comparative assessment of lesion segmentation methods via a single and integrated platform. The plug-in has been successfully used by several CMR imaging studies.",
                "authors": [
                    {
                        "name": "Belle L."
                    },
                    {
                        "name": "Bernard O."
                    },
                    {
                        "name": "Clarysse P."
                    },
                    {
                        "name": "Croisille P."
                    },
                    {
                        "name": "Petrusca L."
                    },
                    {
                        "name": "Romero W.R.A."
                    },
                    {
                        "name": "Spaltenstein J."
                    },
                    {
                        "name": "Viallon M."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CMRSegTools: An open-source software enabling reproducible research in segmentation of acute myocardial infarct in CMR images"
            },
            "pmcid": "PMC9469999",
            "pmid": "36099286"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
