{
    "additionDate": "2017-08-20T15:57:27Z",
    "biotoolsCURIE": "biotools:gwapp",
    "biotoolsID": "gwapp",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "magnus.nordborg@gmi.oeaw.ac.at",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GWAPP enables reseachers working with Arabidopsis thaliana to do Genome Wide Association Mapping (GWAS) on their phenotypes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gwapp.gmi.oeaw.ac.at/index.html#!helpPage"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://gwapp.gmi.oeaw.ac.at/index.html",
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "GWAPP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1105/tpc.112.108068",
            "metadata": {
                "abstract": "Arabidopsis thaliana is an important model organism for understanding the genetics and molecular biology of plants. Its highly selfing nature, small size, short generation time, small genome size, and wide geographic distribution make it an ideal model organism for understanding natural variation. Genome-wide association studies (GWAS) have proven a useful technique for identifying genetic loci responsible for natural variation in A. thaliana. Previously genotyped accessions (natural inbred lines) can be grown in replicate under different conditions and phenotyped for different traits. These important features greatly simplify association mapping of traits and allow for systematic dissection of the genetics of natural variation by the entire A. thaliana community. To facilitate this, we present GWAPP, an interactive Web-based application for conducting GWAS in A. thaliana. Using an efficient implementation of a linear mixed model, traits measured for a subset of 1386 publicly available ecotypes can be uploaded and mapped with a mixed model and other methods in just a couple of minutes. GWAPP features an extensive, interactive, and user-friendly interface that includes interactive Manhattan plots and linkage disequilibrium plots. It also facilitates exploratory data analysis by implementing features such as the inclusion of candidate polymorphisms in the model as cofactors. © 2012 American Society of Plant Biologists.",
                "authors": [
                    {
                        "name": "Seren U."
                    },
                    {
                        "name": "Vilhjalmsson B.J."
                    },
                    {
                        "name": "Horton M.W."
                    },
                    {
                        "name": "Meng D."
                    },
                    {
                        "name": "Forai P."
                    },
                    {
                        "name": "Huang Y.S."
                    },
                    {
                        "name": "Long Q."
                    },
                    {
                        "name": "Segura V."
                    },
                    {
                        "name": "Nordborg M."
                    }
                ],
                "citationCount": 98,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Plant Cell",
                "title": "GWAPP: A web application for genome-Wide association mapping in arabidopsis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}