{
    "additionDate": "2022-10-07T06:43:46.832057Z",
    "biotoolsCURIE": "biotools:lbtope",
    "biotoolsID": "lbtope",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/lbtope/index.php"
        }
    ],
    "description": "We developed a method LBtope for predicting linear B-cell epitopes. We developed several models using various techniques (e.g., SVM, IBk)on a large dataset of B-cell epitopes and non-epitopes (12063 epitopes and 20589 non epitopes obtained from IEDB database).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/lbtope/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/lbtope/index.php",
    "lastUpdate": "2022-10-07T06:43:52.514848Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/lbtope/index.php"
        }
    ],
    "name": "lbtope",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0062216",
            "metadata": {
                "abstract": "One of the major challenges in designing a peptide-based vaccine is the identification of antigenic regions in an antigen that can stimulate B-cell's response, also called B-cell epitopes. In the past, several methods have been developed for the prediction of conformational and linear (or continuous) B-cell epitopes. However, the existing methods for predicting linear B-cell epitopes are far from perfection. In this study, an attempt has been made to develop an improved method for predicting linear B-cell epitopes. We have retrieved experimentally validated B-cell epitopes as well as non B-cell epitopes from Immune Epitope Database and derived two types of datasets called Lbtope_Variable and Lbtope_Fixed length datasets. The Lbtope_Variable dataset contains 14876 B-cell epitope and 23321 non-epitopes of variable length where as Lbtope_Fixed length dataset contains 12063 B-cell epitopes and 20589 non-epitopes of fixed length. We also evaluated the performance of models on above datasets after removing highly identical peptides from the datasets. In addition, we have derived third dataset Lbtope_Confirm having 1042 epitopes and 1795 non-epitopes where each epitope or non-epitope has been experimentally validated in at least two studies. A number of models have been developed to discriminate epitopes and non-epitopes using different machine-learning techniques like Support Vector Machine, and K-Nearest Neighbor. We achieved accuracy from ~54% to 86% using diverse s features like binary profile, dipeptide composition, AAP (amino acid pair) profile. In this study, for the first time experimentally validated non B-cell epitopes have been used for developing method for predicting linear B-cell epitopes. In previous studies, random peptides have been used as non B-cell epitopes. In order to provide service to scientific community, a web server LBtope has been developed for predicting and designing B-cell epitopes (http://crdd.osdd.net/raghava/lbtope/). © 2013 Singh et al.",
                "authors": [
                    {
                        "name": "Ansari H.R."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Singh H."
                    }
                ],
                "citationCount": 206,
                "date": "2013-05-07T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Improved Method for Linear B-Cell Epitope Prediction Using Antigen's Primary Sequence"
            },
            "pmcid": "PMC3646881",
            "pmid": "23667458"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
