{
    "additionDate": "2020-01-14T09:00:14Z",
    "biotoolsCURIE": "biotools:ImaGene",
    "biotoolsID": "ImaGene",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.fumagalli@imperial.ac.uk",
            "name": "Matteo Fumagalli",
            "orcidid": "https://orcid.org/0000-0002-4084-2953",
            "typeEntity": "Person"
        }
    ],
    "description": "A convolutional neural network to quantify natural selection from genomic data.\n\nImaGene implements a supervised machine learning algorithm to predict natural selection and estimate selection coefficients from population genomic data. Specifically, it uses a convolutional neural network (CNN) which takes as input haplotypes for a population and locus of interest. It outputs confusion matrices as well as point estimates of the selection coefficient along with its posterior distribution and various metrics of confidence",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mfumagalli/ImaGene",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2020-12-14T09:05:39Z",
    "license": "GPL-3.0",
    "name": "ImaGene",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2927-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The genetic bases of many complex phenotypes are still largely unknown, mostly due to the polygenic nature of the traits and the small effect of each associated mutation. An alternative approach to classic association studies to determining such genetic bases is an evolutionary framework. As sites targeted by natural selection are likely to harbor important functionalities for the carrier, the identification of selection signatures in the genome has the potential to unveil the genetic mechanisms underpinning human phenotypes. Popular methods of detecting such signals rely on compressing genomic information into summary statistics, resulting in the loss of information. Furthermore, few methods are able to quantify the strength of selection. Here we explored the use of deep learning in evolutionary biology and implemented a program, called ImaGene, to apply convolutional neural networks on population genomic data for the detection and quantification of natural selection. Results: ImaGene enables genomic information from multiple individuals to be represented as abstract images. Each image is created by stacking aligned genomic data and encoding distinct alleles into separate colors. To detect and quantify signatures of positive selection, ImaGene implements a convolutional neural network which is trained using simulations. We show how the method implemented in ImaGene can be affected by data manipulation and learning strategies. In particular, we show how sorting images by row and column leads to accurate predictions. We also demonstrate how the misspecification of the correct demographic model for producing training data can influence the quantification of positive selection. We finally illustrate an approach to estimate the selection coefficient, a continuous variable, using multiclass classification techniques. Conclusions: While the use of deep learning in evolutionary genomics is in its infancy, here we demonstrated its potential to detect informative patterns from large-scale genomic data. We implemented methods to process genomic data for deep learning in a user-friendly program called ImaGene. The joint inference of the evolutionary history of mutations and their functional impact will facilitate mapping studies and provide novel insights into the molecular mechanisms associated with human phenotypes.",
                "authors": [
                    {
                        "name": "Torada L."
                    },
                    {
                        "name": "Lorenzon L."
                    },
                    {
                        "name": "Beddis A."
                    },
                    {
                        "name": "Isildak U."
                    },
                    {
                        "name": "Pattini L."
                    },
                    {
                        "name": "Mathieson S."
                    },
                    {
                        "name": "Fumagalli M."
                    }
                ],
                "citationCount": 12,
                "date": "2019-11-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ImaGene: A convolutional neural network to quantify natural selection from genomic data"
            },
            "pmcid": "PMC6873651",
            "pmid": "31757205"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}