{
    "accessibility": "Open access",
    "additionDate": "2022-09-26T18:33:40.900448Z",
    "biotoolsCURIE": "biotools:atrpred",
    "biotoolsID": "atrpred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "p.shukla@ulster.ac.uk",
            "name": "Priyank Shukla",
            "orcidid": "https://orcid.org/0000-0002-4985-9305",
            "typeEntity": "Person"
        },
        {
            "name": "Bodhayan Prasad"
        }
    ],
    "description": "A machine learning based tool for clinical decision making of anti-TNF treatment in rheumatoid arthritis patients.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ShuklaLab/ATRPred",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-26T18:33:40.902898Z",
    "license": "MIT",
    "name": "ATRPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010204",
            "metadata": {
                "abstract": "© 2022 Prasad et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Rheumatoid arthritis (RA) is a chronic autoimmune condition, characterised by joint pain, damage and disability, which can be addressed in a high proportion of patients by timely use of targeted biologic treatments. However, the patients, non-responsive to the treatments often suffer from refractoriness of the disease, leading to poor quality of life. Additionally, the biologic treatments are expensive. We obtained plasma samples from N = 144 participants with RA, who were about to commence anti-tumour necrosis factor (anti-TNF) therapy. These samples were sent to Olink Proteomics, Uppsala, Sweden, where proximity extension assays of 4 panels, containing 92 proteins each, were performed. A total of n = 89 samples of patients passed the quality control. The preliminary analysis of plasma protein expression values suggested that the RA population could be divided into two distinct molecular sub-groups (endotypes). However, these broad groups did not predict response to anti-TNF treatment, but were significantly different in terms of gender and their disease activity. We then labelled these patients as responders (n = 60) and non-responders (n = 29) based on the change in disease activity score (DAS) after 6 months of anti-TNF treatment and applied machine learning (ML) with a rigorous 5-fold nested cross-validation scheme to filter 17 proteins that were significantly associated with the treatment response. We have developed a ML based classifier ATRPred (anti-TNF treatment response predictor), which can predict anti-TNF treatment response in RA patients with 81% accuracy, 75% sensitivity and 86% specificity. ATRPred may aid clinicians to direct anti-TNF therapy to patients most likely to receive benefit, thus save cost as well as prevent non-responsive patients from refractory consequences. ATRPred is implemented in R.",
                "authors": [
                    {
                        "name": "Ahmed T."
                    },
                    {
                        "name": "Bjourson A.J."
                    },
                    {
                        "name": "Eakin A."
                    },
                    {
                        "name": "Gardiner P."
                    },
                    {
                        "name": "Gibson D.S."
                    },
                    {
                        "name": "McGeough C."
                    },
                    {
                        "name": "Pendleton A."
                    },
                    {
                        "name": "Prasad B."
                    },
                    {
                        "name": "Shukla P."
                    },
                    {
                        "name": "Small D."
                    },
                    {
                        "name": "Wright G."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "ATRPred: A machine learning based tool for clinical decision making of anti-TNF treatment in rheumatoid arthritis patients"
            },
            "pmcid": "PMC9321399",
            "pmid": "35788746"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
