{
    "additionDate": "2017-12-18T00:08:22Z",
    "biotoolsCURIE": "biotools:lsr",
    "biotoolsID": "lsr",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csjfann.ibms.sinica.edu.tw/"
        }
    ],
    "description": "LSR (Longest Run Test) is an S-plus program computes the distribution and the first moment of the length of the longest k-interrupted run (Lk) in a binary sequence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.csjfann.ibms.sinica.edu.tw/eag/programlist/LSR/LSR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/lsr-estimate-region-specific-p-values-genetic-association-mapping-studies.html"
        }
    ],
    "name": "LSR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-246",
            "metadata": {
                "abstract": "Background: Association testing is a powerful tool for identifying disease susceptibility genes underlying complex diseases. Technological advances have yielded a dramatic increase in the density of available genetic markers, necessitating an increase in the number of association tests required for the analysis of disease susceptibility genes. As such, multiple-tests corrections have become a critical issue. However the conventional statistical corrections on locus-specific multiple tests usually result in lower power as the number of markers increases. Alternatively, we propose here the application of the longest significant run (LSR) method to estimate a region-specific p-value to provide an index for the most likely candidate region. Results: An advantage of the LSR method relative to procedures based on genotypic data is that only p-value data are needed and hence can be applied extensively to different study designs. In this study the proposed LSR method was compared with commonly used methods such as Bonferroni's method and FDR controlling method. We found that while all methods provide good control over false positive rate, LSR has much better power and false discovery rate. In the authentic analysis on psoriasis and asthma disease data, the LSR method successfully identified important candidate regions and replicated the results of previous association studies. Conclusion: The proposed LSR method provides an efficient exploratory tool for the analysis of sequences of dense genetic markers. Our results show that the LSR method has better power and lower false discovery rate comparing with the locus-specific multiple tests. © 2008 Lian et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lian E.-B."
                    },
                    {
                        "name": "Lin Y.-H."
                    },
                    {
                        "name": "Lin Y.-C."
                    },
                    {
                        "name": "Yang H.-C."
                    },
                    {
                        "name": "Chang C.-J."
                    },
                    {
                        "name": "Fann C.S.J."
                    }
                ],
                "citationCount": 2,
                "date": "2008-05-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Using the longest significance run to estimate region-specific p-values in genetic association mapping studies"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1
}