{
    "additionDate": "2021-06-14T12:38:56Z",
    "biotoolsCURIE": "biotools:cpdseqer",
    "biotoolsID": "cpdseqer",
    "confidence_flag": "tool",
    "description": "CPDSeqer is a tool for processing, elucidating and quality control of cyclobutane pyrimidine dimer sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Nucleosome position prediction",
                    "uri": "http://edamontology.org/operation_0432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/shengqh/cpdseqer",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-08-23T19:01:08.580435Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "http://github.com/shengqh/cpdseqer/issues"
        }
    ],
    "name": "CPDSeqer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-021-00496-3",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature Limited.UV radiation may lead to melanoma and nonmelanoma skin cancers by causing helix-distorting DNA damage such as cyclobutane pyrimidine dimers (CPDs). These DNA lesions, if located in important genes and not repaired promptly, are mutagenic and may eventually result in carcinogenesis. Examining CPD formation and repair processes across the genome can shed light on the mutagenesis mechanisms associated with UV damage in relevant cancers. We recently developed CPD-Seq, a high-throughput and single-nucleotide resolution sequencing technique that can specifically capture UV-induced CPD lesions across the genome. This novel technique has been increasingly used in studies of UV damage and can be adapted to sequence other clinically relevant DNA lesions. Although the library preparation protocol has been established, a systematic protocol to analyze CPD-Seq data has not been described yet. To streamline the various general or specific analysis steps, we developed a protocol named CPDSeqer to assist researchers with CPD-Seq data processing. CPDSeqer can accommodate both a single- and multiple-sample experimental design, and it allows both genome-wide analyses and regional scrutiny (such as of suspected UV damage hotspots). The runtime of CPDSeqer scales with raw data size and takes roughly 4 h per sample with the possibility of acceleration by parallel computing. Various guiding graphics are generated to help diagnose the performance of the experiment and inform regional enrichment of CPD formation. UV damage comparison analyses are set forth in three analysis scenarios, and the resulting HTML pages report damage directional trends and statistical significance. CPDSeqer can be accessed at https://github.com/shengqh/cpdseqer.",
                "authors": [
                    {
                        "name": "Sheng Q."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Duan M."
                    },
                    {
                        "name": "Ness S."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Kang H."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Wyrick J.J."
                    },
                    {
                        "name": "Mao P."
                    },
                    {
                        "name": "Guo Y."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "A streamlined solution for processing, elucidating and quality control of cyclobutane pyrimidine dimer sequencing data"
            },
            "pmid": "33731963"
        }
    ],
    "toolType": [
        "Script",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}