{
    "additionDate": "2017-01-17T14:58:34Z",
    "biotoolsCURIE": "biotools:rnaseqmap",
    "biotoolsID": "rnaseqmap",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "michal@fgcz.ethz.ch",
            "name": "Michal Okoniewski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A library provides classes and functions to analyze the RNA-sequencing data using the coverage profiles in multiple samples at a time.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/rnaSeqMap.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/rnaSeqMap_2.32.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment (nucleic acid)",
                        "uri": "http://edamontology.org/data_1383"
                    },
                    "format": [
                        {
                            "term": "BAM",
                            "uri": "http://edamontology.org/format_2572"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "Alignment format",
                            "uri": "http://edamontology.org/format_1921"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/rnaSeqMap.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "name": "rnaSeqMap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-200",
            "metadata": {
                "abstract": "Background: The throughput of commercially available sequencers has recently significantly increased. It has reached the point where measuring the RNA expression by the depth of coverage has become feasible even for largest genomes. The development of software tools is constantly following the progress of biological hardware. In particular, as RNA sequencing software can be regarded genome browsers, exon junction tools and statistical tools operating on counts of reads in predefined regions. The library rnaSeqMap, freely available via Bioconductor, is an RNA sequencing software which is independent of any biological hardware platform. It is based upon standard Bioconductor infrastructure for sequencing data and includes several novel features focused on deeper understanding of coverage expression profiles and discovery of novel transcription regions.Results: rnaSeqMap is a toolbox for analyses that may be performed with the use of gene annotations or alternatively, in an unsupervised mode, on any genomic region to find novel or non-standard transcripts. The data back-end may be a MySQL database or a set of files in standard BAM format. The processing in R can be run on a machine without any particular hardware requirements, and scales linearly with the number of genomic loci and number of samples analyzed. The main features of rnaSeqMap include coverage operations, discovering irreducible regions of high expression, significance search and splicing analyses with nucleotide granularity.Conclusions: This software may be used for a range of applications related to RNA sequencing by building customized analysis pipelines. The applicability and precision is expected to increase in parallel with the progress of the genome coverage in sequencers. © 2011 Leśniewska and Okoniewski; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lesniewska A."
                    },
                    {
                        "name": "Okoniewski M.J."
                    }
                ],
                "citationCount": 7,
                "date": "2011-05-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "rnaSeqMap: A Bioconductor package for RNA sequencing data exploration"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "2.32.0"
    ]
}