{
    "additionDate": "2022-07-20T06:00:44.129175Z",
    "biotoolsCURIE": "biotools:currmg",
    "biotoolsID": "currmg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "li.jiao@imicams.ac.cn",
            "name": "Jiao Li",
            "typeEntity": "Person"
        },
        {
            "name": "Yaowen Gu",
            "orcidid": "https://orcid.org/0000-0003-0924-5939"
        }
    ],
    "description": "An efficient curriculum learning-based strategy for molecular graph learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gu-yaowen/CurrMG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-20T06:00:44.131870Z",
    "license": "Not licensed",
    "name": "CurrMG",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC099",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved.Computational methods have been widely applied to resolve various core issues in drug discovery, such as molecular property prediction. In recent years, a data-driven computational method-deep learning had achieved a number of impressive successes in various domains. In drug discovery, graph neural networks (GNNs) take molecular graph data as input and learn graph-level representations in non-Euclidean space. An enormous amount of well-performed GNNs have been proposed for molecular graph learning. Meanwhile, efficient use of molecular data during training process, however, has not been paid enough attention. Curriculum learning (CL) is proposed as a training strategy by rearranging training queue based on calculated samples’ difficulties, yet the effectiveness of CL method has not been determined in molecular graph learning. In this study, inspired by chemical domain knowledge and task prior information, we proposed a novel CL-based training strategy to improve the training efficiency of molecular graph learning, called CurrMG. Consisting of a difficulty measurer and a training scheduler, CurrMG is designed as a plug-and-play module, which is model-independent and easy-to-use on molecular data. Extensive experiments demonstrated that molecular graph learning models could benefit from CurrMG and gain noticeable improvement on five GNN models and eight molecular property prediction tasks (overall improvement is 4.08%). We further observed CurrMG’s encouraging potential in resource-constrained molecular property prediction. These results indicate that CurrMG can be used as a reliable and efficient training strategy for molecular graph learning.",
                "authors": [
                    {
                        "name": "Gu Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Yin Q."
                    },
                    {
                        "name": "Zheng S."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "An efficient curriculum learning-based strategy for molecular graph learning"
            },
            "pmid": "35368074"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
