{
    "additionDate": "2024-04-19T09:17:39.303537Z",
    "biotoolsCURIE": "biotools:genecompete",
    "biotoolsID": "genecompete",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kitiporn.p@chula.ac.th",
            "name": "Kitiporn Plaimas",
            "orcidid": "https://orcid.org/0000-0002-0416-8316",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrative tool of a novel union algorithm with various ranking techniques for multiple gene expression data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://genecompete.streamlit.app/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:03:22.209063Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/panisajan/GeneCompete/"
        }
    ],
    "name": "GeneCompete",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/peerj-cs.1686",
            "metadata": {
                "abstract": "Background: Identifying the genes responsible for diseases requires precise prioritization of significant genes. Gene expression analysis enables differentiation between gene expressions in disease and normal samples. Increasing the number of high-quality samples enhances the strength of evidence regarding gene involvement in diseases. This process has led to the discovery of disease biomarkers through the collection of diverse gene expression data. Methods: This study presents GeneCompete, a web-based tool that integrates gene expression data from multiple platforms and experiments to identify the most promising biomarkers. GeneCompete incorporates a novel union strategy and eight well-established ranking methods, including Win-Loss, Massey, Colley, Keener, Elo, Markov, PageRank, and Bi-directional PageRank algorithms, to prioritize genes across multiple gene expression datasets. Each gene in the competition is assigned a score based on log-fold change values, and significant genes are determined as winners. Results: We tested the tool on the expression datasets of Hypertrophic cardiomyopathy (HCM) and the datasets from Microarray Quality Control (MAQC) project, which include both microarray and RNA-Sequencing techniques. The results demonstrate that all ranking scores have more power to predict new occurrence datasets than the classical method. Moreover, the PageRank method with a union strategy delivers the best performance for both up-regulated and down-regulated genes. Furthermore, the top-ranking genes exhibit a strong association with the disease. For MAQC, the two-sides ranking score shows a high relationship with TaqMan validation set in all log-fold change thresholds. Conclusion: GeneCompete is a powerful web-based tool that revolutionizes the identification of disease-causing genes through the integration of gene expression data from multiple platforms and experiments.",
                "authors": [
                    {
                        "name": "Janyasupab P."
                    },
                    {
                        "name": "Plaimas K."
                    },
                    {
                        "name": "Suratanee A."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "PeerJ Computer Science",
                "title": "GeneCompete: an integrative tool of a novel union algorithm with various ranking techniques for multiple gene expression data"
            },
            "pmcid": "PMC10703088",
            "pmid": "38077583"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
