
{
    "credit": [
        {
            "email": "ccamacho@pitt.edu",
            "name": "Camacho CJ",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://structure.pitt.edu/servers/fastcontact/doc/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Fortran"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Protein interaction experiment",
                "uri": "http://edamontology.org/topic_3557"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Summary: Interaction free energies are crucial for analyzing binding propensities in proteins. Although the problem of computing binding free energies remains open, approximate estimates have become very useful for filtering potential binding complexes. We report on the implementation of a fast computational estimate of the binding free energy based on a statistically determined desolvation contact potential and Coulomb electrostatics with a distance-dependent dielectric constant, and validated in the Critical Assessment of PRotein Interactions experiment. The application also reports residue contact free energies that rapidly highlight the hotspots of the interaction. © The Author 2005. Published by Oxford Unversity Press. All rights reserved.",
            "authors": [
                "Camacho C.J.",
                "Zhang C."
            ],
            "cit_count": 92,
            "journal": "Bioinformatics",
            "pmid": "15713734",
            "title": "FastContact: Rapid estimate of contact and binding free energies",
            "year": "2005-05-15"
        },
        {
            "abstract": "'FastContact' is a server that estimates the direct electrostatic and desolvation interaction free energy between two proteins in units of kcal/mol. Users submit two proteins in PDB format, and the output is emailed back to the user in three files: one output file, and the two processed proteins. Besides the electrostatic and desolvation free energy, the server reports residue contact free energies that rapidly highlight the hotspots of the interaction and evaluates the van der Waals interaction using CHARMm. Response time is ∼1 min. The server has been successfully tested and validated, scoring refined complex structures and blind sets of docking decoys, as well as proven useful predicting protein interactions. 'FastContact' offers unique capabilities from biophysical insights to scoring and identifying important contacts. © 2007 The Author(s).",
            "authors": [
                "Champ P.C.",
                "Camacho C.J."
            ],
            "cit_count": 29,
            "journal": "Nucleic Acids Research",
            "pmid": "17537824",
            "title": "FastContact: A free energy scoring tool for protein-protein complex structures",
            "year": "2007-07-01"
        },
        {
            "abstract": "Predicting protein-protein interactions involves sampling and scoring docked conformations. Barring some large structural rearrangement, rapidly sampling the space of docked conformations is now a real possibility, and the limiting step for the successful prediction of protein interactions is the scoring function used to reduce the space of conformations from billions to a few, and eventually one high affinity complex. An atomic level free-energy scoring function that estimates in units of kcal/mol both electrostatic and desolvation interactions (plus van der Waals if appropriate) of protein-protein docked conformations is used to rerank the blind predictions (860 in total) submitted for six targets to the community-wide Critical Assessment of PRediction of Interactions (CAPRI; http://capri.ebi.ac.uk). We found that native-like models often have varying intermolecular contacts and atom clashes, making unlikely that one can construct a universal function that would rank all these models as native-like. Nevertheless, our scoring function is able to consistently identify the native-like complexes as those with the lowest free energy for the individual models of 16 (out of 17) human predictors for five of the targets, while at the same time the modelers failed to do so in more than half of the cases. The scoring of high-quality models developed by a wide variety of methods and force fields confirms that electrostatic and desolvation forces are the dominant interactions determining the bound structure. The CAPRI experiment has shown that modelers can predict valuable models of protein-protein complexes, and improvements in scoring functions should soon solve the docking problem for complexes whose backbones do not change much upon binding. © 2006 Wiley-Liss, Inc.",
            "authors": [
                "Camacho C.J.",
                "Ma H.",
                "Champ P.C."
            ],
            "cit_count": 23,
            "journal": "Proteins: Structure, Function and Genetics",
            "pmid": "16506242",
            "title": "Scoring a diverse set of high-quality docked conformations: A metascore based on electrostatic and desolvation interactions",
            "year": "2006-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fastcontact",
        "biotoolsID": "fastcontact",
        "description": "FastContact is a free energy scoring tool for protein-protein complex structures.",
        "homepage": "http://structure.pitt.edu/servers/fastcontact/",
        "name": "FastContact"
    }
}