{"collectionID": [], "accessibility": [], "topic": [{"term": "Phylogenetics", "uri": "http://edamontology.org/topic_3293"}, {"term": "Machine learning", "uri": "http://edamontology.org/topic_3474"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "21752249", "type": null, "pmcid": null, "metadata": {"title": "Split-based computation of majority-rule supertrees", "abstract": "Background: Supertree methods combine overlapping input trees into a larger supertree. Here, I consider split-based supertree methods that first extract the split information of the input trees and subsequently combine this split information into a phylogeny. Well known split-based supertree methods are matrix representation with parsimony and matrix representation with compatibility. Combining input trees on the same taxon set, as in the consensus setting, is a well-studied task and it is thus desirable to generalize consensus methods to supertree methods. Results: Here, three variants of majority-rule (MR) supertrees that generalize majority-rule consensus trees are investigated. I provide simple formulas for computing the respective score for bifurcating input- and supertrees. These score computations, together with a heuristic tree search minmizing the scores, were implemented in the python program PluMiST (Plus- and Minus SuperTrees) available from http://www.cibiv.at/software/ plumist. The different MR methods were tested by simulation and on real data sets. The search heuristic was successful in combining compatible input trees. When combining incompatible input trees, especially one variant, MR(-) supertrees, performed well. Conclusions: The presented framework allows for an efficient score computation of three majority-rule supertree variants and input trees. I combined the score computation with a heuristic search over the supertree space. The implementation was tested by simulation and on real data sets and showed promising results. Especially the MR(-) variant seems to be a reasonable score for supertree reconstruction. Generalizing these computations to multifurcating trees is an open problem, which may be tackled using this framework. © 2011Kupczok; licensee BioMed Central Ltd.", "citationCount": 4, "authors": [{"name": "Kupczok A."}], "date": "2011-07-15T00:00:00Z", "journal": "BMC Evolutionary Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.cibiv.at/contact/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:plumist", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.cibiv.at/software/plumist/", "function": [{"note": null, "input": [], "operation": [{"term": "Phylogenetic tree generation", "uri": "http://edamontology.org/operation_0323"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:56Z", "otherID": [], "description": "Computer program to reconstruct and evaluate majority rule supertrees: MR(-), MR(+) and MR(+)g. It searches tree space by NNI (nearest-neighbor interchange) and TDR (taxa-deletion-reinsertion). Only fully resolved input and supertrees are considered, multifurcating trees may be returned as the strict consensus of equally best scoring trees.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Python"], "link": [{"url": "http://www.mybiosoftware.com/plumist-1-1-supertrees.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "plumist", "additionDate": "2017-08-03T18:55:57Z", "name": "PluMiST", "license": null, "documentation": [{"url": "http://www.cibiv.at/software/plumist/plumist.pdf", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}