{
    "accessibility": "Open access",
    "additionDate": "2023-08-11T06:08:35.724686Z",
    "biotoolsCURIE": "biotools:coda4microbiome",
    "biotoolsID": "coda4microbiome",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "malu.calle@uvic.cat",
            "name": "M. Luz Calle",
            "orcidid": "https://orcid.org/0000-0001-9334-415X",
            "typeEntity": "Person"
        },
        {
            "name": "Antonio Susin",
            "orcidid": "https://orcid.org/0000-0002-0874-2784"
        },
        {
            "name": "Meritxell Pujolassos",
            "orcidid": "https://orcid.org/0000-0003-0313-3506",
            "typeEntity": "Person"
        }
    ],
    "description": "Package for compositional data analysis for microbiome cross-sectional and longitudinal studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://malucalle.github.io/coda4microbiome/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:44:04.758523Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/coda4microbiome/"
        }
    ],
    "name": "coda4microbiome",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05205-3",
            "metadata": {
                "abstract": "Background: One of the main challenges of microbiome analysis is its compositional nature that if ignored can lead to spurious results. Addressing the compositional structure of microbiome data is particularly critical in longitudinal studies where abundances measured at different times can correspond to different sub-compositions. Results: We developed coda4microbiome, a new R package for analyzing microbiome data within the Compositional Data Analysis (CoDA) framework in both, cross-sectional and longitudinal studies. The aim of coda4microbiome is prediction, more specifically, the method is designed to identify a model (microbial signature) containing the minimum number of features with the maximum predictive power. The algorithm relies on the analysis of log-ratios between pairs of components and variable selection is addressed through penalized regression on the “all-pairs log-ratio model”, the model containing all possible pairwise log-ratios. For longitudinal data, the algorithm infers dynamic microbial signatures by performing penalized regression over the summary of the log-ratio trajectories (the area under these trajectories). In both, cross-sectional and longitudinal studies, the inferred microbial signature is expressed as the (weighted) balance between two groups of taxa, those that contribute positively to the microbial signature and those that contribute negatively. The package provides several graphical representations that facilitate the interpretation of the analysis and the identified microbial signatures. We illustrate the new method with data from a Crohn's disease study (cross-sectional data) and on the developing microbiome of infants (longitudinal data). Conclusions: coda4microbiome is a new algorithm for identification of microbial signatures in both, cross-sectional and longitudinal studies. The algorithm is implemented as an R package that is available at CRAN (https://cran.r-project.org/web/packages/coda4microbiome/) and is accompanied with a vignette with a detailed description of the functions. The website of the project contains several tutorials: https://malucalle.github.io/coda4microbiome/.",
                "authors": [
                    {
                        "name": "Calle M.L."
                    },
                    {
                        "name": "Pujolassos M."
                    },
                    {
                        "name": "Susin A."
                    }
                ],
                "citationCount": 21,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "coda4microbiome: compositional data analysis for microbiome cross-sectional and longitudinal studies"
            },
            "pmcid": "PMC9990256",
            "pmid": "36879227"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ]
}
