{
    "additionDate": "2024-01-10T13:14:56.601485Z",
    "biotoolsCURIE": "biotools:neurobridge",
    "biotoolsID": "neurobridge",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "satya.sahoo@case.edu",
            "name": "Satya S. Sahoo"
        }
    ],
    "description": "An ontology-driven deep learning approach in the NeuroBridge Project.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://neurobridges.org/",
    "lastUpdate": "2024-11-24T14:22:17.853315Z",
    "name": "NeuroBridge",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.ijmedinf.2018.10.009",
            "metadata": {
                "abstract": "Objective: Reproducibility of research studies is key to advancing biomedical science by building on sound results and reducing inconsistencies between published results and study data. We propose that the available data from research studies combined with provenance metadata provide a framework for evaluating scientific reproducibility. We developed the ProvCaRe platform to model, extract, and query semantic provenance information from 435, 248 published articles. Methods: The ProvCaRe platform consists of: (1) the S3 model and a formal ontology; (2) a provenance-focused text processing workflow to generate provenance triples consisting of subject, predicate, and object using metadata extracted from articles; and (3) the ProvCaRe knowledge repository that supports “provenance-aware” hypothesis-driven search queries. A new provenance-based ranking algorithm is used to rank the articles in the search query results. Results: The ProvCaRe knowledge repository contains 48.9 million provenance triples. Seven research hypotheses were used as search queries for evaluation and the resulting provenance triples were analyzed using five categories of provenance terms. The highest number of terms (34%) described provenance related to population cohort followed by 29% of terms describing statistical data analysis methods, and only 5% of the terms described the measurement instruments used in a study. In addition, the analysis showed that some articles included a higher number of provenance terms across multiple provenance categories suggesting a higher potential for reproducibility of these research studies. Conclusion: The ProvCaRe knowledge repository (https://provcare.case.edu/) is one of the largest provenance resources for biomedical research studies that combines intuitive search functionality with a new provenance-based ranking feature to list articles related to a search query.",
                "authors": [
                    {
                        "name": "Kim M."
                    },
                    {
                        "name": "Redline S."
                    },
                    {
                        "name": "Rueschman M."
                    },
                    {
                        "name": "Sahoo S.S."
                    },
                    {
                        "name": "Valdez J."
                    }
                ],
                "citationCount": 13,
                "date": "2019-01-01T00:00:00Z",
                "journal": "International Journal of Medical Informatics",
                "title": "ProvCaRe: Characterizing scientific reproducibility of biomedical research studies using semantic provenance metadata"
            },
            "pmcid": "PMC6343667",
            "pmid": "30545485"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
