{
    "accessibility": [],
    "additionDate": "2016-03-21T10:28:28Z",
    "biotoolsCURIE": "biotools:b6db",
    "biotoolsID": "b6db",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "ELIXIR-ITA-PARMA",
            "note": null,
            "orcidid": null,
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": null
        },
        {
            "email": null,
            "gridid": null,
            "name": "Riccardo Percudani",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.unipr.it/ugov/person/17868"
        }
    ],
    "description": "A tool for the description and classification of vitamin B6-dependent enzymatic activities and of the corresponding protein families.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://bioinformatics.unipr.it/cgi-bin/bioinformatics/B6db/home.pl"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": "classification of vitamin B6-dependent enzymatic activities",
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://bioinformatics.unipr.it/B6db",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "The B6 Database (B6DB)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-ITA-PARMA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-273",
            "metadata": {
                "abstract": "Background: Enzymes that depend on vitamin B6 (and in particular on its metabolically active form, pyridoxal 5'-phosphate, PLP) are of great relevance to biology and medicine, as they catalyze a wide variety of biochemical reactions mainly involving amino acid substrates. Although PLP-dependent enzymes belong to a small number of independent evolutionary lineages, they encompass more than 160 distinct catalytic functions, thus representing a striking example of divergent evolution. The importance and remarkable versatility of these enzymes, as well as the difficulties in their functional classification, create a need for an integrated source of information about them. Description: The B6 database http://bioinformatics.unipr.it/B6db contains documented B6-dependent activities and the relevant protein families, defined as monophyletic groups of sequences possessing the same enzymatic function. One or more families were associated to each of 121 PLP-dependent activities with known sequences. Hidden Markov models (HMMs) were built from family alignments and incorporated in the database. These HMMs can be used for the functional classification of PLP-dependent enzymes in genomic sets of predicted protein sequences. An example of such analyses (a census of human genes coding for PLP-dependent enzymes) is provided here, whereas many more are accessible through the database itself. Conclusion: The B6 database is a curated repository of biochemical and molecular information about an important group of enzymes. This information is logically organized and available for computational analyses, providing a key resource for the identification, classification and comparative analysis of B6-dependent enzymes. © 2009 Percudani and Peracchi; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Percudani R."
                    },
                    {
                        "name": "Peracchi A."
                    }
                ],
                "citationCount": 95,
                "date": "2009-09-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The B6 database: A tool for the description and classification of vitamin B6-dependent enzymatic activities and of the corresponding protein families"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        }
    ],
    "validated": 1,
    "version": []
}