{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T22:34:56.864197Z",
    "biotoolsCURIE": "biotools:phreepred",
    "biotoolsID": "phreepred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zuzanna.drulis-kawa@uwr.edu.pl",
            "name": "Zuzanna Drulis-Kawa"
        },
        {
            "name": "Bogna J. Smug"
        },
        {
            "name": "Grazyna Majkowska-Skrobek"
        }
    ],
    "description": "Phage Resistance Emergence Prediction Web Tool to Foresee Encapsulated Bacterial Escape from Phage Cocktail Treatment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://phartner.shinyapps.io/PhREEPred/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-04T22:34:56.866724Z",
    "name": "PhREEPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2022.167670",
            "metadata": {
                "abstract": "© 2022 The Author(s)Phages, as well as phage-derived proteins, especially lysins and depolymerases, are intensively studied to become prospective alternatives or supportive antibacterials used alone or in combination. In the common phage therapy approach, the unwanted emergence of phage-resistant variants from the treated bacterial population can be postponed or reduced by the utilization of an effective phage cocktail. In this work, we present a publicly available web tool PhREEPred (Phage Resistance Emergence Prediction) (https://phartner.shinyapps.io/PhREEPred/), which will allow an informed choice of the composition of phage cocktails by predicting the outcome of phage cocktail or phage/depolymerase combination treatments against encapsulated bacterial pathogens given a mutating population that escapes single phage treatment. PhREEPred simulates solutions of our mathematical model calibrated and tested on the experimental Klebsiella pneumoniae setup and Klebsiella-specific lytic phages: K63 type-specific phage KP34 equipped with a capsule-degrading enzyme (KP34p57), capsule-independent myoviruses KP15 and KP27, and recombinant capsule depolymerase KP34p57. The model can calculate the phage-resistance emergence depending on the bacterial growth rate and initial density, the multiplicity of infection, phage latent period, its infectiveness and the cocktail composition, as well as initial depolymerase concentration and activity rate. This model reproduced the experimental results and showed that (i) the phage cocktail of parallelly infecting phages is less effective than the one composed of sequentially infecting phages; (ii) depolymerase can delay or prevent bacterial resistance by unveiling an alternative receptor for initially inactive phages. In our opinion, this customer-friendly web tool will allow for the primary design of the phage cocktail and phage-depolymerase combination effectiveness against encapsulated pathogens.",
                "authors": [
                    {
                        "name": "Drulis-Kawa Z."
                    },
                    {
                        "name": "Majkowska-Skrobek G."
                    },
                    {
                        "name": "Smug B.J."
                    }
                ],
                "date": "2022-07-30T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "PhREEPred: Phage Resistance Emergence Prediction Web Tool to Foresee Encapsulated Bacterial Escape from Phage Cocktail Treatment"
            },
            "pmid": "35671831"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1
}
