{
    "additionDate": "2018-08-20T14:06:17Z",
    "biotoolsCURIE": "biotools:sbscl",
    "biotoolsID": "sbscl",
    "credit": [
        {
            "email": "andraeger@eng.ucsd.edu",
            "name": "Andreas Dräger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Provides an efficient and exhaustive Java™ implementation of methods to interpret the content of models encoded in the Systems Biology Markup Language (SBML) and its numerical solution.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://draeger-lab.github.io/SBSCL/old_javadoc/version_1.4/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://draeger-lab.github.io/SBSCL/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "Systems Biology Simulation Core Library",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-55",
            "metadata": {
                "abstract": "Background: With the increasing availability of high dimensional time course data for metabolites, genes, and fluxes, the mathematical description of dynamical systems has become an essential aspect of research in systems biology. Models are often encoded in formats such as SBML, whose structure is very complex and difficult to evaluate due to many special cases.Results: This article describes an efficient algorithm to solve SBML models that are interpreted in terms of ordinary differential equations. We begin our consideration with a formal representation of the mathematical form of the models and explain all parts of the algorithm in detail, including several preprocessing steps. We provide a flexible reference implementation as part of the Systems Biology Simulation Core Library, a community-driven project providing a large collection of numerical solvers and a sophisticated interface hierarchy for the definition of custom differential equation systems. To demonstrate the capabilities of the new algorithm, it has been tested with the entire SBML Test Suite and all models of BioModels Database.Conclusions: The formal description of the mathematics behind the SBML format facilitates the implementation of the algorithm within specifically tailored programs. The reference implementation can be used as a simulation backend for Java™-based programs. Source code, binaries, and documentation can be freely obtained under the terms of the LGPL version 3 from http://simulation-core.sourceforge.net. Feature requests, bug reports, contributions, or any further discussion can be directed to the mailing list simulation-core-development at lists.sourceforge.net. © 2013 Keller et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Keller R."
                    },
                    {
                        "name": "Dorr A."
                    },
                    {
                        "name": "Tabira A."
                    },
                    {
                        "name": "Funahashi A."
                    },
                    {
                        "name": "Ziller M.J."
                    },
                    {
                        "name": "Adams R."
                    },
                    {
                        "name": "Rodriguez N."
                    },
                    {
                        "name": "Novere N.L."
                    },
                    {
                        "name": "Hiroi N."
                    },
                    {
                        "name": "Planatscher H."
                    },
                    {
                        "name": "Zell A."
                    },
                    {
                        "name": "Drager A."
                    }
                ],
                "citationCount": 18,
                "date": "2013-07-05T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "The systems biology simulation core algorithm"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1
}