{
    "additionDate": "2020-01-09T17:51:45Z",
    "biotoolsCURIE": "biotools:TZMD",
    "biotoolsID": "TZMD",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhouyizhuang3@163.com",
            "name": "Yizhuang Zhou",
            "orcidid": "https://orcid.org/0000-0003-2795-3111",
            "typeEntity": "Person"
        },
        {
            "email": "changliangzijin@163.com",
            "name": "Junfei Jin",
            "typeEntity": "Person"
        }
    ],
    "description": "A high-resolution genomic composition-based method with the ability to distinguish similar bacterial organisms.\n\nThe \"tranucleotide-derived Z-value Manhattan Distance” (TZMD) approach profiles genomic composition with high resolution, which can distinguish bacteria at even strain level",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Yizhuangzhou/TZMD",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-31T13:39:29Z",
    "name": "TZMD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6119-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background : Genomic composition has been found to be species specific and is used to differentiate bacterial species. To date, almost no published composition-based approaches are able to distinguish between most closely related organisms, including intra-genus species and intra-species strains. Thus, it is necessary to develop a novel approach to address this problem. Results: Here, we initially determine that the \"tetranucleotide-derived z-value Pearson correlation coefficient\" (TETRA) approach is representative of other published statistical methods. Then, we devise a novel method called \"Tetranucleotide-derived Z-value Manhattan Distance\" (TZMD) and compare it with the TETRA approach. Our results show that TZMD reflects the maximal genome difference, while TETRA does not in most conditions, demonstrating in theory that TZMD provides improved resolution. Additionally, our analysis of real data shows that TZMD improves species differentiation and clearly differentiates similar organisms, including similar species belonging to the same genospecies, subspecies and intraspecific strains, most of which cannot be distinguished by TETRA. Furthermore, TZMD is able to determine clonal strains with the TZMD = 0 criterion, which intrinsically encompasses identical composition, high average nucleotide identity and high percentage of shared genomes. Conclusions: Our extensive assessment demonstrates that TZMD has high resolution. This study is the first to propose a composition-based method for differentiating bacteria at the strain level and to demonstrate that composition is also strain specific. TZMD is a powerful tool and the first easy-to-use approach for differentiating clonal and non-clonal strains. Therefore, as the first composition-based algorithm for strain typing, TZMD will facilitate bacterial studies in the future.",
                "authors": [
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Huang K."
                    },
                    {
                        "name": "Jin J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-21T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A high-resolution genomic composition-based method with the ability to distinguish similar bacterial organisms"
            },
            "pmcid": "PMC6805505",
            "pmid": "31638897"
        }
    ],
    "topic": [
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}