
{
    "credit": [
        {
            "email": "sato-kengo@aist.go.jp",
            "name": "Kengo SATO",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.dna.bio.keio.ac.jp/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bpla-kernel.dna.bio.keio.ac.jp/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/bpla-kernel-1-0-structural-rna-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Computational prediction of noncoding RNAs (ncRNAs) is an important task in the post-genomic era. One common approach is to utilize the profile information contained in alignment data rather than single sequences. However, this strategy involves the possibility that the quality of input alignments can influence the performance of prediction methods. Therefore, the evaluation of the robustness against alignment errors is necessary as well as the development of accurate prediction methods.Results: We describe a new method, called Profile BPLA kernel, which predicts ncRNAs from alignment data in combination with support vector machines (SVMs). Profile BPLA kernel is an extension of base-pairing profile local alignment (BPLA) kernel which we previously developed for the prediction from single sequences. By utilizing the profile information of alignment data, the proposed kernel can achieve better accuracy than the original BPLA kernel. We show that Profile BPLA kernel outperforms the existing prediction methods which also utilize the profile information using the high-quality structural alignment dataset. In addition to these standard benchmark tests, we extensively evaluate the robustness of Profile BPLA kernel against errors in input alignments. We consider two different types of error: first, that all sequences in an alignment are actually ncRNAs but are aligned ignoring their secondary structures; second, that an alignment contains unrelated sequences which are not ncRNAs but still aligned. In both cases, the effects on the performance of Profile BPLA kernel are surprisingly small. Especially for the latter case, we demonstrate that Profile BPLA kernel is more robust compared to the existing prediction methods.Conclusions: Profile BPLA kernel provides a promising way for identifying ncRNAs from alignment data. It is more accurate than the existing prediction methods, and can keep its performance under the practical situations in which the quality of input alignments is not necessarily high. © 2010 Saito et al; licensee BioMed Central Ltd.",
            "authors": [
                "Saito Y.",
                "Sato K.",
                "Sakakibara Y."
            ],
            "cit_count": 1,
            "journal": "BMC Bioinformatics",
            "pmid": "21106125",
            "title": "Robust and accurate prediction of noncoding RNAs from aligned sequences",
            "year": "2010-10-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bpla_kernel",
        "biotoolsID": "bpla_kernel",
        "description": "Base-pairing profile local alignment is a powerful method that evaluates the similarity between a pair of RNAs taking into account secondary structure information. Based on the accurate similarity calculated by BPLA kernel, you can perform a broad range of structural RNA analysis, including family prediction, hierarchical clustering, and remote homology search.",
        "homepage": "http://bpla-kernel.dna.bio.keio.ac.jp/",
        "name": "BPLA kernel"
    }
}