{
    "additionDate": "2015-08-03T09:36:54Z",
    "biotoolsCURIE": "biotools:showalign_ws_husar",
    "biotoolsID": "showalign_ws_husar",
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dkfz.de/en/kontakt.php"
        }
    ],
    "description": "This tool displays an aligned set of protein or a nucleic acid sequences in a style suitable for publication.",
    "documentation": [
        {
            "type": "General",
            "url": "http://genius.embnet.dkfz-heidelberg.de/menu/hobit/embdoc/showalign.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://genius.embnet.dkfz-heidelberg.de/menu/hobit/embdoc/showalign.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "https://www.biocatalogue.org/services/3661"
        }
    ],
    "name": "showalign WS (husar)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1186/2041-1480-2-S1-S5",
            "metadata": {
                "abstract": "© 2011 Lamprecht et al; licensee BioMed Central Ltd.Background: More than in other domains the heterogeneous services world in bioinformatics demands for a methodology to classify and relate resources in a both human and machine accessible manner. The Semantic Web, which is meant to address exactly this challenge, is currently one of the most ambitious projects in computer science. Collective efforts within the community have already led to a basis of standards for semantic service descriptions and meta-information. In combination with process synthesis and planning methods, such knowledge about types and services can facilitate the automatic composition of workflows for particular research questions. Results: In this study we apply the synthesis methodology that is available in the Bio-jETI workflow management framework for the semantics-based composition of EMBOSS services. EMBOSS (European Molecular Biology Open Software Suite) is a collection of 350 tools (March 2010) for various sequence analysis tasks, and thus a rich source of services and types that imply comprehensive domain models for planning and synthesis approaches. We use and compare two different setups of our EMBOSS synthesis domain: 1) a manually defined domain setup where an intuitive, high-level, semantically meaningful nomenclature is applied to describe the input/output behavior of the single EMBOSS tools and their classifications, and 2) a domain setup where this information has been automatically derived from the EMBOSS Ajax Command Definition (ACD) files and the EMBRACE Data and Methods ontology (EDAM). Our experiments demonstrate that these domain models in combination with our synthesis methodology greatly simplify working with the large, heterogeneous, and hence manually intractable EMBOSS collection. However, they also show that with the information that can be derived from the (current) ACD files and EDAM ontology alone, some essential connections between services can not be recognized. Conclusions: Our results show that adequate domain modeling requires to incorporate as much domain knowledge as possible, far beyond the mere technical aspects of the different types and services. Finding or defining semantically appropriate service and type descriptions is a difficult task, but the bioinformatics community appears to be on the right track towards a Life Science Semantic Web, which will eventually allow automatic service composition methods to unfold their full potential.",
                "authors": [
                    {
                        "name": "Lamprecht A.-L."
                    },
                    {
                        "name": "Naujokat S."
                    },
                    {
                        "name": "Margaria T."
                    },
                    {
                        "name": "Steffen B."
                    }
                ],
                "citationCount": 39,
                "date": "2011-03-07T00:00:00Z",
                "journal": "Journal of Biomedical Semantics",
                "title": "Semantics-based composition of EMBOSS services"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}