{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-06-14T12:31:26Z",
    "biotoolsCURIE": "biotools:agroseek",
    "biotoolsID": "agroseek",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xliangvt@vt.edu",
            "name": "Xiao Liang",
            "orcidid": "https://orcid.org/0000-0001-8789-6732",
            "typeEntity": "Person"
        }
    ],
    "description": "AgroSeek is a system for computational analysis of environmental metagenomic data and associated metadata.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://agroseek.cs.vt.edu/",
    "lastUpdate": "2021-08-09T11:56:22.970901Z",
    "name": "AgroSeek",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04035-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Metagenomics is gaining attention as a powerful tool for identifying how agricultural management practices influence human and animal health, especially in terms of potential to contribute to the spread of antibiotic resistance. However, the ability to compare the distribution and prevalence of antibiotic resistance genes (ARGs) across multiple studies and environments is currently impossible without a complete re-analysis of published datasets. This challenge must be addressed for metagenomics to realize its potential for helping guide effective policy and practice measures relevant to agricultural ecosystems, for example, identifying critical control points for mitigating the spread of antibiotic resistance. Results: Here we introduce AgroSeek, a centralized web-based system that provides computational tools for analysis and comparison of metagenomic data sets tailored specifically to researchers and other users in the agricultural sector interested in tracking and mitigating the spread of ARGs. AgroSeek draws from rich, user-provided metagenomic data and metadata to facilitate analysis, comparison, and prediction in a user-friendly fashion. Further, AgroSeek draws from publicly-contributed data sets to provide a point of comparison and context for data analysis. To incorporate metadata into our analysis and comparison procedures, we provide flexible metadata templates, including user-customized metadata attributes to facilitate data sharing, while maintaining the metadata in a comparable fashion for the broader user community and to support large-scale comparative and predictive analysis. Conclusion: AgroSeek provides an easy-to-use tool for environmental metagenomic analysis and comparison, based on both gene annotations and associated metadata, with this initial demonstration focusing on control of antibiotic resistance in agricultural ecosystems. Agroseek creates a space for metagenomic data sharing and collaboration to assist policy makers, stakeholders, and the public in decision-making. AgroSeek is publicly-available at https://agroseek.cs.vt.edu/.",
                "authors": [
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Akers K."
                    },
                    {
                        "name": "Keenum I."
                    },
                    {
                        "name": "Wind L."
                    },
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Aldaihani R."
                    },
                    {
                        "name": "Pruden A."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Knowlton K.F."
                    },
                    {
                        "name": "Xia K."
                    },
                    {
                        "name": "Heath L.S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AgroSeek: a system for computational analysis of environmental metagenomic data and associated metadata"
            },
            "pmcid": "PMC7944603",
            "pmid": "33691615"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ]
}