{
    "additionDate": "2020-01-14T19:43:44Z",
    "biotoolsCURIE": "biotools:CATHER",
    "biotoolsID": "CATHER",
    "confidence_flag": "tool",
    "description": "A novel threading algorithm with predicted contacts.\n\nCATHER is a threading algorithm for template-based modeling. It uses an iterative algorithm to combine both sequential information and contact maps to improve the threading performance. For a submitted query protein sequence, the returned results include the predicted structure",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein threading",
                    "uri": "http://edamontology.org/operation_0302"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://yanglab.nankai.edu.cn/CATHER/",
    "lastUpdate": "2020-12-10T13:48:43Z",
    "name": "CATHER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ876",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Threading is one of the most effective methods for protein structure prediction. In recent years, the increasing accuracy in protein contact map prediction opens a new avenue to improve the performance of threading algorithms. Several preliminary studies suggest that with predicted contacts, the performance of threading algorithms can be improved greatly. There is still much room to explore to make better use of predicted contacts. Results: We have developed a new contact-assisted threading algorithm named CATHER using both conventional sequential profiles and contact map predicted by a deep learning-based algorithm. Benchmark tests on an independent test set and the CASP12 targets demonstrated that CATHER made significant improvement over other methods which only use either sequential profile or predicted contact map. Our method was ranked at the Top 10 among all 39 participated server groups on the 32 free modeling targets in the blind tests of the CASP13 experiment. These data suggest that it is promising to push forward the threading algorithms by using predicted contacts.",
                "authors": [
                    {
                        "name": "Du Z."
                    },
                    {
                        "name": "Pan S."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Peng Z."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CATHER: A novel threading algorithm with predicted contacts"
            },
            "pmid": "31790141"
        }
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}