{
    "accessibility": "Open access",
    "additionDate": "2022-07-04T10:08:45.894723Z",
    "biotoolsCURIE": "biotools:regscaf",
    "biotoolsID": "regscaf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lilei@amss.ac.cn",
            "name": "Lei M Li",
            "orcidid": "https://orcid.org/0000-0002-6571-1079",
            "typeEntity": "Person"
        },
        {
            "name": "Mengtian Li",
            "orcidid": "https://orcid.org/0000-0002-8344-0241"
        }
    ],
    "description": "A Regression Approach to Scaffolding.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lemontealala/RegScaf.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-04T10:08:45.897289Z",
    "license": "Not licensed",
    "name": "RegScaf",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC174",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Crucial to the correctness of a genome assembly is the accuracy of the underlying scaffolds that specify the orders and orientations of contigs together with the gap distances between contigs. The current methods construct scaffolds based on the alignments of 'linking' reads against contigs. We found that some 'optimal' alignments are mistaken due to factors such as the contig boundary effect, particularly in the presence of repeats. Occasionally, the incorrect alignments can even overwhelm the correct ones. The detection of the incorrect linking information is challenging in any existing methods. Results: In this study, we present a novel scaffolding method RegScaf. It first examines the distribution of distances between contigs from read alignment by the kernel density. When multiple modes are shown in a density, orientation-supported links are grouped into clusters, each of which defines a linking distance corresponding to a mode. The linear model parameterizes contigs by their positions on the genome; then each linking distance between a pair of contigs is taken as an observation on the difference of their positions. The parameters are estimated by minimizing a global loss function, which is a version of trimmed sum of squares. The least trimmed squares estimate has such a high breakdown value that it can automatically remove the mistaken linking distances. The results on both synthetic and real datasets demonstrate that RegScaf outperforms some popular scaffolders, especially in the accuracy of gap estimates by substantially reducing extremely abnormal errors. Its strength in resolving repeat regions is exemplified by a real case. Its adaptability to large genomes and TGS long reads is validated as well.",
                "authors": [
                    {
                        "name": "Li L.M."
                    },
                    {
                        "name": "Li M."
                    }
                ],
                "date": "2022-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RegScaf: A regression approach to scaffolding"
            },
            "pmid": "35333294"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
