{
    "additionDate": "2021-01-18T07:29:46Z",
    "biotoolsCURIE": "biotools:neoant-hill",
    "biotoolsID": "neoant-hill",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sandro@imd.ufrn.br",
            "name": "Sandro J. de Souza",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated tool for identification of potential neoantigens.\n\nneoANT-HILL is a python toolkit that integrates several pipelines for fully automated identification of potential neoantigens (pNeoAgs) which could be used in personalized immunotherapy due to their ability to elicit and boosting T-cell immune response. It is available as a Docker pre-built image and allows the analysis of single- or multiple samples. As input files is required RNA sequencing reads and/or somatic DNA mutations derived from Next Generating Sequencing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/neoanthill/neoANT-HILL",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-03-08T13:23:05Z",
    "license": "Apache-2.0",
    "name": "neoANT-HILL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12920-020-0694-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Cancer neoantigens have attracted great interest in immunotherapy due to their capacity to elicit antitumoral responses. These molecules arise from somatic mutations in cancer cells, resulting in alterations on the original protein. Neoantigens identification remains a challenging task due largely to a high rate of false-positives. Results: We have developed an efficient and automated pipeline for the identification of potential neoantigens. neoANT-HILL integrates several immunogenomic analyses to improve neoantigen detection from Next Generation Sequence (NGS) data. The pipeline has been compiled in a pre-built Docker image such that minimal computational background is required for download and setup. NeoANT-HILL was applied in The Cancer Genome Atlas (TCGA) melanoma dataset and found several putative neoantigens including ones derived from the recurrent RAC1:P29S and SERPINB3:E250K mutations. neoANT-HILL was also used to identify potential neoantigens in RNA-Seq data with a high sensitivity and specificity. Conclusion: neoANT-HILL is a user-friendly tool with a graphical interface that performs neoantigens prediction efficiently. neoANT-HILL is able to process multiple samples, provides several binding predictors, enables quantification of tumor-infiltrating immune cells and considers RNA-Seq data for identifying potential neoantigens. The software is available through github at http://github.com/neoanthill/neoANT-HILL.",
                "authors": [
                    {
                        "name": "Coelho A.C.M.F."
                    },
                    {
                        "name": "Da Cunha L.M."
                    },
                    {
                        "name": "De Souza S.J."
                    },
                    {
                        "name": "Fonseca A.L."
                    },
                    {
                        "name": "Lins P.B.R."
                    },
                    {
                        "name": "Martins D.L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-22T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "NeoANT-HILL: An integrated tool for identification of potential neoantigens"
            },
            "pmcid": "PMC7036241",
            "pmid": "32087727"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
