{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T15:17:05.354057Z",
    "biotoolsCURIE": "biotools:3mint",
    "biotoolsID": "3mint",
    "confidence_flag": "high",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "malik.yousef@gmail.com",
            "name": "Malik Yousef",
            "typeEntity": "Person"
        }
    ],
    "description": "Feature grouping and scoring in multi-omics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/malikyousef/3Mint/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:29:31.758533Z",
    "name": "3Mint",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fgene.2023.1093326",
            "metadata": {
                "abstract": "Advanced genomic and molecular profiling technologies accelerated the enlightenment of the regulatory mechanisms behind cancer development and progression, and the targeted therapies in patients. Along this line, intense studies with immense amounts of biological information have boosted the discovery of molecular biomarkers. Cancer is one of the leading causes of death around the world in recent years. Elucidation of genomic and epigenetic factors in Breast Cancer (BRCA) can provide a roadmap to uncover the disease mechanisms. Accordingly, unraveling the possible systematic connections between-omics data types and their contribution to BRCA tumor progression is crucial. In this study, we have developed a novel machine learning (ML) based integrative approach for multi-omics data analysis. This integrative approach combines information from gene expression (mRNA), microRNA (miRNA) and methylation data. Due to the complexity of cancer, this integrated data is expected to improve the prediction, diagnosis and treatment of disease through patterns only available from the 3-way interactions between these 3-omics datasets. In addition, the proposed method bridges the interpretation gap between the disease mechanisms that drive onset and progression. Our fundamental contribution is the 3 Multi-omics integrative tool (3Mint). This tool aims to perform grouping and scoring of groups using biological knowledge. Another major goal is improved gene selection via detection of novel groups of cross-omics biomarkers. Performance of 3Mint is assessed using different metrics. Our computational performance evaluations showed that the 3Mint classifies the BRCA molecular subtypes with lower number of genes when compared to the miRcorrNet tool which uses miRNA and mRNA gene expression profiles in terms of similar performance metrics (95% Accuracy). The incorporation of methylation data in 3Mint yields a much more focused analysis. The 3Mint tool and all other supplementary files are available at https://github.com/malikyousef/3Mint/.",
                "authors": [
                    {
                        "name": "Bakir-Gungor B."
                    },
                    {
                        "name": "Marron J.S."
                    },
                    {
                        "name": "Unlu Yazici M."
                    },
                    {
                        "name": "Yousef M."
                    },
                    {
                        "name": "Zou F."
                    }
                ],
                "citationCount": 12,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Invention of 3Mint for feature grouping and scoring in multi-omics"
            },
            "pmcid": "PMC10050723",
            "pmid": "37007972"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
