{
    "additionDate": "2021-12-13T14:00:23.205105Z",
    "biotoolsCURIE": "biotools:visme",
    "biotoolsID": "visme",
    "confidence_flag": "tool",
    "description": "VisME (Visual Microsaccades Explorer) is a visual analytics system to explore high frequency eye tracking data with a special focus on microsaccades. The exploration can take place on different levels, for fixations, participants, trials, and test conditions using data of individuals as well as groups of participants. The system provides multiple views, eye movement filters, visibility filters and further options to support users in their exploration.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MunzT/VisME",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-12-13T14:00:23.207698Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MunzT/VisME/issues"
        }
    ],
    "name": "VisME",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.16910/JEMR.12.6.5",
            "metadata": {
                "abstract": "© 2019, Journal of Eye Movement Research. All rights reserved.This work presents a visual analytics approach to explore microsaccade distributions in high-frequency eye tracking data. Research studies often apply filter algorithms and parameter values for microsaccade detection. Even when the same algorithms are employed, different parameter values might be adopted across different studies. In this paper, we present a visual analytics system (VisME) to promote reproducibility in the data analysis of microsaccades. It allows users to interactively vary the parametric values for microsaccade filters and evaluate the resulting influence on microsaccade behavior across individuals and on a group level. In particular, we exploit brushing-and-linking techniques that allow the microsaccadic properties of space, time, and movement direction to be extracted, visualized, and compared across multiple views. We demonstrate in a case study the use of our visual analytics system on data sets collected from natural scene viewing and show in a qualitative usability study the usefulness of this approach for eye tracking researchers. We believe that interactive tools such as VisME will promote greater transparency in eye movement research by providing researchers with the ability to easily understand complex eye tracking data sets; such tools can also serve as teaching systems. VisME is provided as open source software.",
                "authors": [
                    {
                        "name": "Munz T."
                    },
                    {
                        "name": "Chuang L."
                    },
                    {
                        "name": "Pannasch S."
                    },
                    {
                        "name": "Weiskopf D."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Eye Movement Research",
                "title": "VisME: Visual Microsaccades Explorer"
            },
            "pmcid": "PMC7962676",
            "pmid": "33828749",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}