{
    "additionDate": "2022-07-11T02:28:28.621485Z",
    "biotoolsCURIE": "biotools:hifiadapterfilt",
    "biotoolsID": "hifiadapterfilt",
    "description": "Remove CCS reads with remnant PacBio adapter sequences and convert outputs to a compressed .fastq (.fastq.gz).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                }
            ]
        }
    ],
    "homepage": "https://bmcgenomics.biomedcentral.com/articles/10.1186/s12864-022-08375-1",
    "lastUpdate": "2022-12-01T20:32:29.428618Z",
    "name": "HiFiAdapterFilt",
    "owner": "mthang",
    "publication": [
        {
            "doi": "10.1186/s12864-022-08375-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Pacific Biosciences HiFi read technology is currently the industry standard for high accuracy long-read sequencing that has been widely adopted by large sequencing and assembly initiatives for generation of de novo assemblies in non-model organisms. Though adapter contamination filtering is routine in traditional short-read analysis pipelines, it has not been widely adopted for HiFi workflows. Results: Analysis of 55 publicly available HiFi datasets revealed that a read-sanitation step to remove sequence artifacts derived from PacBio library preparation from read pools is necessary as adapter sequences can be erroneously integrated into assemblies. Conclusions: Here we describe the nature of adapter contaminated reads, their consequences in assembly, and present HiFiAdapterFilt, a simple and memory efficient solution for removing adapter contaminated reads prior to assembly.",
                "authors": [
                    {
                        "name": "Corpuz R.L."
                    },
                    {
                        "name": "Geib S.M."
                    },
                    {
                        "name": "Sim S.B."
                    },
                    {
                        "name": "Simmonds T.J."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "HiFiAdapterFilt, a memory efficient read processing pipeline, prevents occurrence of adapter sequence in PacBio HiFi reads and their negative impacts on genome assembly"
            },
            "pmcid": "PMC8864876",
            "pmid": "35193521"
        }
    ],
    "version": [
        "2.0.0"
    ]
}
