{
    "accessibility": "Open access",
    "additionDate": "2021-11-15T11:29:06.218841Z",
    "biotoolsCURIE": "biotools:abrainvis",
    "biotoolsID": "abrainvis",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pguevara@udec.cl",
            "name": "Pamela Guevara",
            "orcidid": "https://orcid.org/0000-0001-9988-400X",
            "typeEntity": "Person"
        }
    ],
    "description": "Android brain image visualization tool.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Cocobio/aBrainVis",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-11-15T11:29:06.221569Z",
    "license": "GPL-3.0",
    "name": "ABrainVis",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12938-021-00909-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The visualization and analysis of brain data such as white matter diffusion tractography and magnetic resonance imaging (MRI) volumes is commonly used by neuro-specialist and researchers to help the understanding of brain structure, functionality and connectivity. As mobile devices are widely used among users and their technology shows a continuous improvement in performance, different types of applications have been designed to help users in different work areas. Results: We present, ABrainVis, an Android mobile tool that allows users to visualize different types of brain images, such as white matter diffusion tractographies, represented as fibers in 3D, segmented fiber bundles, MRI 3D images as rendered volumes and slices, and meshes. The tool enables users to choose and combine different types of brain imaging data to provide visual anatomical context for specific visualization needs. ABrainVis provides high performance over a wide range of Android devices, including tablets and cell phones using medium and large tractography datasets. Interesting visualizations including brain tumors and arteries, along with fiber, are given as examples of case studies using ABrainVis. Conclusions: The functionality, flexibility and performance of ABrainVis tool introduce an improvement in user experience enabling neurophysicians and neuroscientists fast visualization of large tractography datasets, as well as the ability to incorporate other brain imaging data such as MRI volumes and meshes, adding anatomical contextual information.",
                "authors": [
                    {
                        "name": "Osorio I."
                    },
                    {
                        "name": "Guevara M."
                    },
                    {
                        "name": "Bonometti D."
                    },
                    {
                        "name": "Carrasco D."
                    },
                    {
                        "name": "Descoteaux M."
                    },
                    {
                        "name": "Poupon C."
                    },
                    {
                        "name": "Mangin J.-F."
                    },
                    {
                        "name": "Hernandez C."
                    },
                    {
                        "name": "Guevara P."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BioMedical Engineering Online",
                "title": "ABrainVis: an android brain image visualization tool"
            },
            "pmcid": "PMC8323223",
            "pmid": "34325693"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}