{
    "name": "PredictPA", 
    "description": "Bayesian network model that integrates genomic, transcriptomic and proteomic data to predict protein abundance. Specifically, by using expression, sequence and interaction data, we effectively link transcriptional information with post-transcriptional and protein translational data.", 
    "homepage": "http://bioinf.scmb.uq.edu.au:8080/proteinabundance/", 
    "biotoolsID": "predictpa", 
    "biotoolsCURIE": "biotools:predictpa", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3308", 
            "term": "Transcriptomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": null, 
    "collectionID": [
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/predictpa-a-bayesian-network-model-to-predict-protein-abundance.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bioinf.scmb.uq.edu.au:8080/proteinabundance/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "24532840", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Predicting the dynamics of protein abundance", 
                "abstract": "Protein synthesis is finely regulated across all organisms, from bacteria to humans, and its integrity underpins many important processes. Emerging evidence suggests that the dynamic range of protein abundance is greater than that observed at the transcript level. Technological breakthroughs now mean that sequencing-based measurement of mRNA levels is routine, but protocols for measuring protein abundance remain both complex and expensive. This paper introduces a Bayesian network that integrates transcriptomic and proteomic data to predict protein abundance and to model the effects of its determinants. We aim to use this model to follow a molecular response over time, from condition-specific data, in order to understand adaptation during processes such as the cell cycle. With microarray data now available for many conditions, the general utility of a protein abundance predictor is broad. Whereas most quantitative proteomics studies have focused on higher organisms, we developed a predictive model of protein abundance for both Saccharomyces cerevisiae and Schizosaccharomyces pombe to explore the latitude at the protein level. Our predictor primarily relies on mRNA level, mRNA-protein interaction, mRNA folding energy and half-life, and tRNA adaptation. The combination of key features, allowing for the low certainty and uneven coverage of experimental observations, gives comparativelyminor but robust prediction accuracy. The model substantially improved the analysis of protein regulation during the cell cycle: predicted protein abundance identified twice as many cell-cycle-associated proteins as experimental mRNA levels. Predicted protein abundance was more dynamic than observed mRNA expression, agreeing with experimental protein abundance from a human cell line. We illustrate how the same model can be used to predict the folding energy of mRNA when protein abundance is available, lending credence to the emerging view that mRNA folding affects translation efficiency. The software and data used in this research are available at http://bioinf.scmb. uq.edu.au/proteinabundance/. © 2014 by The American Society for Biochemistry and Molecular Biology, Inc.", 
                "date": "2014-01-01T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Mehdi A.M."
                    }, 
                    {
                        "name": "Patrick R."
                    }, 
                    {
                        "name": "Bailey T.L."
                    }, 
                    {
                        "name": "Boden M."
                    }
                ], 
                "journal": "Molecular and Cellular Proteomics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://bioinf.scmb.uq.edu.au:8080/proteinabundance/contact.html", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:56:14Z", 
    "lastUpdate": "2019-03-26T08:32:53Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}