{
    "additionDate": "2023-02-19T11:41:40.004602Z",
    "biotoolsCURIE": "biotools:difir_ct",
    "biotoolsID": "difir_ct",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Francisco Contijoch",
            "orcidid": "https://orcid.org/0000-0001-9616-3274"
        }
    ],
    "description": "Distance field representation to resolve motion artifacts in computed tomography",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://kunalmgupta.github.io/projects/DiFiR-CT.html",
    "lastUpdate": "2023-02-19T11:41:40.007255Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://github.com/KunalMGupta/DIFIR-CT"
        }
    ],
    "name": "DiFiR-CT",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/MP.16157",
            "metadata": {
                "abstract": "© 2022 The Authors. Medical Physics published by Wiley Periodicals LLC on behalf of American Association of Physicists in Medicine.Background: Motion during data acquisition leads to artifacts in computed tomography (CT) reconstructions. In cases such as cardiac imaging, not only is motion unavoidable, but evaluating the motion of the object is of clinical interest. Reducing motion artifacts has typically been achieved by developing systems with faster gantry rotation or via algorithms which measure and/or estimate the displacement. However, these approaches have had limited success due to both physical constraints as well as the challenge of estimating non-rigid, temporally varying, and patient-specific motion fields. Purpose: To develop a novel reconstruction method which generates time-resolved, artifact-free images without estimation or explicit modeling of the motion. Methods: We describe an analysis-by-synthesis approach which progressively regresses a solution consistent with the acquired sinogram. In our method, we focus on the movement of object boundaries. Not only are the boundaries the source of image artifacts, but object boundaries can simultaneously be used to represent both the object as well as its motion over time without the need for an explicit motion model. We represent the object boundaries via a signed distance function (SDF) which can be efficiently modeled using neural networks. As a result, optimization can be performed under spatial and temporal smoothness constraints without the need for explicit motion estimation. Results: We illustrate the utility of DiFiR-CT in three imaging scenarios with increasing motion complexity: translation of a small circle, heart-like change in an ellipse's diameter, and a complex topological deformation. Compared to filtered backprojection, DiFiR-CT provides high quality image reconstruction for all three motions without hyperparameter tuning or change to the architecture. We also evaluate DiFiR-CT's robustness to noise in the acquired sinogram and found its reconstruction to be accurate across a wide range of noise levels. Lastly, we demonstrate how the approach could be used for multi-intensity scenes and illustrate the importance of the initial segmentation providing a realistic initialization. Code and supplemental movies are available at https://kunalmgupta.github.io/projects/DiFiR-CT.html. Conclusions: Projection data can be used to accurately estimate a temporally-evolving scene without the need for explicit motion estimation using a neural implicit representation and analysis-by-synthesis approach.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Colvert B."
                    },
                    {
                        "name": "Contijoch F."
                    },
                    {
                        "name": "Gupta K."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "DiFiR-CT: Distance field representation to resolve motion artifacts in computed tomography"
            },
            "pmid": "36515381"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
