{
    "additionDate": "2018-07-24T10:10:15Z",
    "biotoolsCURIE": "biotools:dynomics_emn",
    "biotoolsID": "dynomics_emn",
    "credit": [
        {
            "email": "hongchun@pitt.edu",
            "name": "Hongchun Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Compute biomolecular systems dynamics for user-uploaded structural coordinates or PDB identifiers, by integrating two widely used elastic network models (ENMs) – the Gaussian Network Model (GNM) and the Anisotropic Network Model (ANM).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://enm.pitt.edu/Theory_EnvENM.php"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://enm.pitt.edu/Tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Salt bridge calculation",
                    "uri": "http://edamontology.org/operation_1839"
                }
            ]
        }
    ],
    "homepage": "http://enm.pitt.edu/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "DynOmics EMN",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gkx385",
            "metadata": {
                "abstract": "©The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.DynOmics (dynomics.pitt.edu) is a portal developed to leverage rapidly growing structural proteomics data by efficiently and accurately evaluating the dynamics of structurally resolved systems, from individual molecules to large complexes and assemblies, in the context of their physiological environment. At the core of the portal is a newly developed server, ENM 1.0, which permits users to efficiently generate information on the collective dynamics of any structure in PDB format, user-uploaded or database-retrieved. ENM 1.0 integrates two widely used elastic network models (ENMs)--the Gaussian Network Model (GNM) and the Anisotropic Network Model (ANM), extended to take account of molecular environment. It enables users to assess potentially functional sites, signal transduction or allosteric communication mechanisms, and protein- protein and protein-DNA interaction poses, in addition to delivering ensembles of accessible conformers reconstructed at atomic details based on the global modes of motions predicted by the ANM. The environment is defined in a flexible manner, from lipid bilayer and crystal contacts, to substrate or ligands bound to a protein, or surrounding subunits in a multimeric structure or assembly. User-friendly interactive features permit users to easily visualize how the environment alter the intrinsic dynamics of the query systems. ENM 1.0 can be accessed at http: //enm.pitt.edu/ or http://dyn.life.nthu.edu.tw/oENM/.",
                "authors": [
                    {
                        "name": "Bahar I."
                    },
                    {
                        "name": "Chang Y.-Y."
                    },
                    {
                        "name": "Lee J.Y."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Yang L.-W."
                    }
                ],
                "citationCount": 72,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DynOmics: Dynamics of structural proteome and beyond"
            },
            "pmcid": "PMC5793847",
            "pmid": "28472330",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
