{
    "additionDate": "2021-01-18T08:14:41Z",
    "biotoolsCURIE": "biotools:ktrim",
    "biotoolsID": "ktrim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sunkun@szbl.ac.cn",
            "name": "Kun Sun",
            "typeEntity": "Person"
        }
    ],
    "description": "An extra-fast and accurate adapter- and quality-trimmer for sequencing data.\nThere is a bug in multi-file handling in v1.2.0 and previous versions of Ktrim, therefore the author strongly recommend all users update to version 1.2.1 (or later versions).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hellosunking/Ktrim/",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2021-02-12T11:01:34Z",
    "license": "GPL-3.0",
    "name": "Ktrim",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA171",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Next-generation sequencing (NGS) data frequently suffer from poor-quality cycles and adapter contaminations therefore need to be preprocessed before downstream analyses. With the ever-growing throughput and read length of modern sequencers, the preprocessing step turns to be a bottleneck in data analysis due to unmet performance of current tools. Extra-fast and accurate adapter- and quality-trimming tools for sequencing data preprocessing are therefore still of urgent demand. Results: Ktrim was developed in this work. Key features of Ktrim include: built-in support to adapters of common library preparation kits; supports user-supplied, customized adapter sequences; supports both paired-end and single-end data; supports parallelization to accelerate the analysis. Ktrim was ∼2-18 times faster than current tools and also showed high accuracy when applied on the testing datasets. Ktrim could thus serve as a valuable and efficient tool for short-read NGS data preprocessing. Contact: sunkun@szbl.ac.cn",
                "authors": [
                    {
                        "name": "Sun K."
                    }
                ],
                "citationCount": 4,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Ktrim: An extra-fast and accurate adapter- And quality-trimmer for sequencing data"
            },
            "pmid": "32159761"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}