{
    "additionDate": "2021-03-19T08:27:57Z",
    "biotoolsCURIE": "biotools:deepselex",
    "biotoolsID": "deepselex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yaronore@bgu.ac.il",
            "name": "Yaron Orenstein",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepSELEX is a tool for inferring DNA-binding preferences from HT-SELEX data using multi-class CNNs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://github.com/OrensteinLab/DeepSELEX/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-27T19:19:31Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/OrensteinLab/DeepSELEX/issues"
        }
    ],
    "name": "DeepSELEX",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA789",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Transcription factor (TF) DNA-binding is a central mechanism in gene regulation. Biologists would like to know where and when these factors bind DNA. Hence, they require accurate DNA-binding models to enable binding prediction to any DNA sequence. Recent technological advancements measure the binding of a single TF to thousands of DNA sequences. One of the prevailing techniques, high-throughput SELEX, measures protein-DNA binding by high-throughput sequencing over several cycles of enrichment. Unfortunately, current computational methods to infer the binding preferences from high-throughput SELEX data do not exploit the richness of these data, and are under-using the most advanced computational technique, deep neural networks. Results: To better characterize the binding preferences of TFs from these experimental data, we developed DeepSELEX, a new algorithm to infer intrinsic DNA-binding preferences using deep neural networks. DeepSELEX takes advantage of the richness of high-throughput sequencing data and learns the DNA-binding preferences by observing the changes in DNA sequences through the experimental cycles. DeepSELEX outperforms extant methods for the task of DNA-binding inference from high-throughput SELEX data in binding prediction in vitro and is on par with the state of the art in in vivo binding prediction. Analysis of model parameters reveals it learns biologically relevant features that shed light on TFs' binding mechanism.",
                "authors": [
                    {
                        "name": "Asif M."
                    },
                    {
                        "name": "Orenstein Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepSELEX: Inferring DNA-binding preferences from HT-SELEX data using multi-class CNNs"
            },
            "pmid": "33381817"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
