{
    "additionDate": "2018-05-03T16:58:16Z",
    "biotoolsCURIE": "biotools:cisminer",
    "biotoolsID": "cisminer",
    "credit": [
        {
            "email": "cnluzon@decsai.ugr.es",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Genome-Wide In-Silico Cis-Regulatory Module Prediction by Fuzzy Itemset Mining.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genome.ugr.es:9000/about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://genome.ugr.es:9000/cisminer",
    "homepage_status": 1,
    "lastUpdate": "2018-12-11T19:05:51Z",
    "name": "CisMiner",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0108065",
            "metadata": {
                "abstract": "© 2014 Fonseca et al.Eukaryotic gene control regions are known to be spread throughout non-coding DNA sequences which may appear distant from the gene promoter. Transcription factors are proteins that coordinately bind to these regions at transcription factor binding sites to regulate gene expression. Several tools allow to detect significant co-occurrences of closely located binding sites (cis-regulatory modules, CRMs). However, these tools present at least one of the following limitations: 1) scope limited to promoter or conserved regions of the genome; 2) do not allow to identify combinations involving more than two motifs; 3) require prior information about target motifs. In this work we present CisMiner, a novel methodology to detect putative CRMs by means of a fuzzy itemset mining approach able to operate at genome-wide scale. CisMiner allows to perform a blind search of CRMs without any prior information about target CRMs nor limitation in the number of motifs. CisMiner tackles the combinatorial complexity of genome-wide cis-regulatory module extraction using a natural representation of motif combinations as itemsets and applying the Top-Down Fuzzy Frequent- Pattern Tree algorithm to identify significant itemsets. Fuzzy technology allows CisMiner to better handle the imprecision and noise inherent to regulatory processes. Results obtained for a set of well-known binding sites in the S. cerevisiae genome show that our method yields highly reliable predictions. Furthermore, CisMiner was also applied to putative in-silico predicted transcription factor binding sites to identify significant combinations in S. cerevisiae and D. melanogaster, proving that our approach can be further applied genome-wide to more complex genomes. CisMiner is freely accesible at: http://genome2.ugr.es/cisminer. CisMiner can be queried for the results presented in this work and can also perform a customized cis-regulatory module prediction on a query set of transcription factor binding sites provided by the user. Copyright:",
                "authors": [
                    {
                        "name": "Blanco A."
                    },
                    {
                        "name": "Cano C."
                    },
                    {
                        "name": "Garcia-Alcalde F."
                    },
                    {
                        "name": "Lopez F.J."
                    },
                    {
                        "name": "Navarro C."
                    }
                ],
                "citationCount": 7,
                "date": "2014-09-30T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CisMiner: Genome-wide in-silico cis-regulatory module prediction by fuzzy itemset mining"
            },
            "pmcid": "PMC4182448",
            "pmid": "25268582"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
