{
    "additionDate": "2017-03-30T23:00:35Z",
    "biotoolsCURIE": "biotools:opm",
    "biotoolsID": "opm",
    "credit": [
        {
            "email": "almz@umich.edu",
            "name": "Andrei Lomize",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Orientations of Proteins in Membranes (OPM) database: curated resource, provides spatial positions of membrane-bound peptides and proteins of known 3D structure, together with their structural classification, topology and intracellular localization. Data can be searched and retrieved, database offers downloadable coordinates. Protein images and visualization tools provided.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://opm.phar.umich.edu/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Structure classification",
                    "uri": "http://edamontology.org/operation_2996"
                },
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                }
            ]
        }
    ],
    "homepage": "http://opm.phar.umich.edu/",
    "lastUpdate": "2021-04-26T08:41:20.897406Z",
    "name": "Orientations of Proteins in Membranes database",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_011961"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The Orientations of Proteins in Membranes (OPM) database is a curated web resource that provides spatial positions of membrane-bound peptides and proteins of known three-dimensional structure in the lipid bilayer, together with their structural classification, topology and intracellular localization. OPM currently contains more than 1200 transmembrane and peripheral proteins and peptides from approximately 350 organisms that represent approximately 3800 Protein Data Bank entries. Proteins are classified into classes, superfamilies and families and assigned to 21 distinct membrane types. Spatial positions of proteins with respect to the lipid bilayer are optimized by the PPM 2.0 method that accounts for the hydrophobic, hydrogen bonding and electrostatic interactions of the proteins with the anisotropic water-lipid environment described by the dielectric constant and hydrogenbonding profiles. The OPM database is freely accessible at http://opm.phar.umich.edu. Data can be sorted, searched or retrieved using the hierarchical classification, source organism, localization in different types of membranes. The database offers downloadable coordinates of proteins and peptides with membrane boundaries. A gallery of protein images and several visualization tools are provided. The database is supplemented by the PPM server (http://opm.phar.umich.edu/server.php) which can be used for calculating spatial positions in membranes of newly determined proteins structures or theoretical models. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Lomize M.A."
                    },
                    {
                        "name": "Pogozheva I.D."
                    },
                    {
                        "name": "Joo H."
                    },
                    {
                        "name": "Mosberg H.I."
                    },
                    {
                        "name": "Lomize A.L."
                    }
                ],
                "citationCount": 629,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OPM database and PPM web server: Resources for positioning of proteins in membranes"
            },
            "pmid": "21890895"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}