{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T09:13:07.939048Z",
    "biotoolsCURIE": "biotools:crws",
    "biotoolsID": "crws",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Xiujuan Lei"
        },
        {
            "name": "Zhengfeng Wang"
        }
    ],
    "description": "A web server for identifying circRNA-RBP variable-length binding sites based on stacked generalization ensemble deep learning network.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.bioinformatics.team/circRNA-rbp-report/help"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.team",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:31:33.799777Z",
    "license": "Not licensed",
    "name": "CRWS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ymeth.2022.06.014",
            "metadata": {
                "abstract": "Circular RNA (circRNA) can exert biological functions by interacting with RNA-binding protein (RBP), and some deep learning-based methods have been developed to predict RBP binding sites on circRNA. However, most of these methods identify circRNA-RBP binding sites are only based on single data resource and cannot provide exact binding sites, only providing the probability value of a sequence fragment. To solve these problems, we propose a binding sites localization algorithm that fuses binding sites from multiple databases, and further design a stacked generalization ensemble deep learning model named CirRBP to identify RBP binding sites on circRNA. The CirRBP is trained by combining the binding sites from multiple databases and makes predictions by weighted aggregating the predictions of each sub-model. The results show that the CirRBP outperforms any sub-model and existing online prediction model. For better access to our research results, we develop an open-source web application called CRWS (CircRNA-RBP Web Server). Its back-end learning model of the CRWS is a stacked generalization ensemble learning model CirRBP based on different deep learning frameworks. Given a full-length circRNA or fragment sequence and a target RBP, the CRWS can analyze and provide the exact potential binding sites of the target RBP on the given sequence through the binding sites localization algorithm, and visualize it. In addition, the CRWS can discover the most widely distributed motif in each RBP dataset. Up to now, CRWS is the first significant online tool that uses multi-source data to train models and predict exact binding sites. CRWS is now publicly and freely available without login requirement at: http://www.bioinformatics.team.",
                "authors": [
                    {
                        "name": "Lei X."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 8,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Methods",
                "title": "A web server for identifying circRNA-RBP variable-length binding sites based on stacked generalization ensemble deep learning network"
            },
            "pmid": "35810958"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
