
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Elsevier Inc.Accurate identification of drug-target interaction (DTI) is a crucial and challenging task in the drug discovery process, having enormous benefit to the patients and pharmaceutical company. The traditional wet-lab experiments of DTI is expensive, time-consuming, and labor-intensive. Therefore, many computational techniques have been established for this purpose; although a huge number of interactions are still undiscovered. Here, we present pdti-EssB, a new computational model for identification of DTI using protein sequence and drug molecular structure. More specifically, each drug molecule is transformed as the molecular substructure fingerprint. For a protein sequence, different descriptors are utilized to represent its evolutionary, sequence, and structural information. Besides, our proposed method uses data balancing techniques to handle the imbalance problem and applies a novel feature eliminator to extract the best optimal features for accurate prediction. In this paper, four classes of DTI benchmark datasets are used to construct a predictive model with XGBoost. Here, the auROC is utilized as an evaluation metric to compare the performance of pdti-EssB method with recent methods, applying five-fold cross-validation. Finally, the experimental results indicate that our proposed method is able to outperform other approaches in predicting DTI, and introduces new drug-target interaction samples based on prediction probability scores. pdti-EssB webserver is available online at http://pdtiessb-uestc.com/",
            "authors": [
                "Mahmud S.M.H.",
                "Chen W.",
                "Meng H.",
                "Jahan H.",
                "Liu Y.",
                "Hasan S.M.M."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.AB.2019.113507",
            "journal": "Analytical Biochemistry",
            "pmid": "31734254",
            "title": "Prediction of drug-target interaction based on protein features using undersampling and feature selection techniques with boosting",
            "year": "2020-01-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pdti-EssB",
        "biotoolsID": "pdti-EssB",
        "description": "Prediction of drug-target interaction based on protein features using undersampling and feature selection techniques with boosting.\n\nPrediction of Drug-Target Interaction Based on Protein Features using Under-sampling and Feature Selection Techniques with Boosting",
        "homepage": "http://pdtiessb-uestc.com/",
        "name": "pdti-EssB"
    }
}