{
    "additionDate": "2022-11-17T13:18:06.688838Z",
    "biotoolsCURIE": "biotools:demotox-pk",
    "biotoolsID": "demotox-pk",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Patricia E. Ganey"
        },
        {
            "name": "Robert A. Roth"
        }
    ],
    "description": "Pharmacokinetic and toxicodynamic concepts in idiosyncratic, drug-induced liver injury.\n\nDemoTox-PK documentation.\n\nDemoTox-PK allows the user to visualize how such alterations might lead to a toxic reaction. The illustrations presented provide a framework for conceptualizing idiosyncratic reactions and could serve as a stimulus for future discussion, education, and research into modes of action of IDILI.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bhattacharyalab.github.io/DemoTox-PK/about.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://bhattacharyalab.github.io/DemoTox-PK/",
    "lastUpdate": "2022-11-17T13:18:06.692197Z",
    "license": "Freeware",
    "name": "DemoTox-PK",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1080/17425255.2022.2113379",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.Introduction: Idiosyncratic drug-induced liver injury (IDILI) causes morbidity and mortality in patients and leads to curtailed use of efficacious pharmaceuticals. Unlike intrinsically toxic reactions, which depend on dose, IDILI occurs in a minority of patients at therapeutic doses. Much remains unknown about causal links among drug exposure, a mode of action, and liver injury. Consequently, numerous hypotheses about IDILI pathogenesis have arisen. Areas covered: Pharmacokinetic and toxicodynamic characteristics underlying current hypotheses of IDILI etiology are discussed and illustrated graphically. Expert opinion: Hypotheses to explain IDILI etiology all involve alterations in pharmacokinetics, which lead to plasma drug concentrations that rise above a threshold for toxicity, or in toxicodynamics, which result in a lowering of the toxicity threshold. Altered pharmacokinetics arise, for example, from changes in drug metabolism or from transporter polymorphisms. A lowered toxicity threshold can arise from drug-induced mitochondrial injury, accumulation of toxic endogenous factors or harmful immune responses. Newly developed, interactive freeware (DemoTox-PK; https://bit.ly/DemoTox-PK) allows the user to visualize how such alterations might lead to a toxic reaction. The illustrations presented provide a framework for conceptualizing idiosyncratic reactions and could serve as a stimulus for future discussion, education, and research into modes of action of IDILI.",
                "authors": [
                    {
                        "name": "Filipovic D."
                    },
                    {
                        "name": "Ganey P.E."
                    },
                    {
                        "name": "Kana O."
                    },
                    {
                        "name": "Roth R.A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Expert Opinion on Drug Metabolism and Toxicology",
                "title": "Pharmacokinetic and toxicodynamic concepts in idiosyncratic, drug-induced liver injury"
            },
            "pmcid": "PMC9484408",
            "pmid": "36003040"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
