{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T09:14:01Z",
    "biotoolsCURIE": "biotools:amt",
    "biotoolsID": "amt",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jsigner@gwdg.de",
            "name": "Johannes Signer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Animal movement tools (amt) for managing tracking data and conducting habitat selection analyses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/jmsigner/amt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=amt",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "amt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1002/ece3.4823",
            "metadata": {
                "abstract": "© 2019 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Advances in tracking technology have led to an exponential increase in animal location data, greatly enhancing our ability to address interesting questions in movement ecology, but also presenting new challenges related to data management and analysis. Step-selection functions (SSFs) are commonly used to link environmental covariates to animal location data collected at fine temporal resolution. SSFs are estimated by comparing observed steps connecting successive animal locations to random steps, using a likelihood equivalent of a Cox proportional hazards model. By using common statistical distributions to model step length and turn angle distributions, and including habitat- and movement-related covariates (functions of distances between points, angular deviations), it is possible to make inference regarding habitat selection and movement processes or to control one process while investigating the other. The fitted model can also be used to estimate utilization distributions and mechanistic home ranges. Here, we present the R package amt (animal movement tools) that allows users to fit SSFs to data and to simulate space use of animals from fitted models. The amt package also provides tools for managing telemetry data. Using fisher (Pekania pennanti) data as a case study, we illustrate a four-step approach to the analysis of animal movement data, consisting of data management, exploratory data analysis, fitting of models, and simulating from fitted models.",
                "authors": [
                    {
                        "name": "Avgar T."
                    },
                    {
                        "name": "Fieberg J."
                    },
                    {
                        "name": "Signer J."
                    }
                ],
                "citationCount": 71,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "Animal movement tools (amt): R package for managing tracking data and conducting habitat selection analyses"
            },
            "pmcid": "PMC6362447",
            "pmid": "30766677",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1,
    "version": [
        "0.0.6"
    ]
}
