{
    "additionDate": "2018-08-06T15:18:40Z",
    "biotoolsCURIE": "biotools:isown",
    "biotoolsID": "isown",
    "credit": [
        {
            "email": "ikalats@gmail.com",
            "name": "Irina Kalatskaya",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Accurate somatic mutation identification in the absence of normal tissue controls.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ikalatskaya/ISOWN"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ikalatskaya/ISOWN",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "APSL-2.0",
    "name": "ISOWN",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13073-017-0446-9",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: A key step in cancer genome analysis is the identification of somatic mutations in the tumor. This is typically done by comparing the genome of the tumor to the reference genome sequence derived from a normal tissue taken from the same donor. However, there are a variety of common scenarios in which matched normal tissue is not available for comparison. Results: In this work, we describe an algorithm to distinguish somatic single nucleotide variants (SNVs) in next-generation sequencing data from germline polymorphisms in the absence of normal samples using a machine learning approach. Our algorithm was evaluated using a family of supervised learning classifications across six different cancer types and ~1600 samples, including cell lines, fresh frozen tissues, and formalin-fixed paraffin-embedded tissues; we tested our algorithm with both deep targeted and whole-exome sequencing data. Our algorithm correctly classified between 95 and 98% of somatic mutations with F1-measure ranges from 75.9 to 98.6% depending on the tumor type. We have released the algorithm as a software package called ISOWN (Identification of SOmatic mutations Without matching Normal tissues). Conclusions: In this work, we describe the development, implementation, and validation of ISOWN, an accurate algorithm for predicting somatic mutations in cancer tissues in the absence of matching normal tissues. ISOWN is available as Open Source under Apache License 2.0 from https://github.com/ikalatskaya/ISOWN.",
                "authors": [
                    {
                        "name": "Kalatskaya I."
                    },
                    {
                        "name": "Trinh Q.M."
                    },
                    {
                        "name": "Spears M."
                    },
                    {
                        "name": "McPherson J.D."
                    },
                    {
                        "name": "Bartlett J.M.S."
                    },
                    {
                        "name": "Stein L."
                    }
                ],
                "citationCount": 22,
                "date": "2017-06-29T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "ISOWN: Accurate somatic mutation identification in the absence of normal tissue controls"
            },
            "pmcid": "PMC5490163",
            "pmid": "28659176"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}