{
    "accessibility": "Open access",
    "additionDate": "2023-01-09T01:13:11.464340Z",
    "biotoolsCURIE": "biotools:ecotranslearn",
    "biotoolsID": "ecotranslearn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Guillaume.Wacquet@ifremer.fr",
            "name": "Guillaume Wacquet",
            "orcidid": "https://orcid.org/0000-0002-3325-5136",
            "typeEntity": "Person"
        },
        {
            "name": "Alain Lefebvre"
        }
    ],
    "description": "An R-package to easily use Transfer Learning for Ecological Studies. A plankton case study.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IFREMER-LERBL/EcoTransLearn",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2023-01-09T01:13:11.466989Z",
    "license": "GPL-3.0",
    "name": "EcoTransLearn",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC703",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.SUMMARY: In recent years, Deep Learning (DL) has been increasingly used in many fields, in particular in image recognition, due to its ability to solve problems where traditional machine learning algorithms fail. However, building an appropriate DL model from scratch, especially in the context of ecological studies, is a difficult task due to the dynamic nature and morphological variability of living organisms, as well as the high cost in terms of time, human resources and skills required to label a large number of training images. To overcome this problem, Transfer Learning (TL) can be used to improve a classifier by transferring information learnt from many domains thanks to a very large training set composed of various images, to another domain with a smaller amount of training data. To compensate the lack of 'easy-to-use' software optimized for ecological studies, we propose the EcoTransLearn R-package, which allows greater automation in the classification of images acquired with various devices (FlowCam, ZooScan, photographs, etc.), thanks to different TL methods pre-trained on the generic ImageNet dataset. AVAILABILITY AND IMPLEMENTATION: EcoTransLearn is an open-source package. It is implemented in R and calls Python scripts for image classification step (using reticulate and tensorflow libraries). The source code, instruction manual and examples can be found at https://github.com/IFREMER-LERBL/EcoTransLearn. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Lefebvre A."
                    },
                    {
                        "name": "Wacquet G."
                    }
                ],
                "date": "2022-12-13T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "EcoTransLearn: an R-package to easily use transfer learning for ecological studies-a plankton case study"
            },
            "pmid": "36282847"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
