{
    "additionDate": "2019-11-14T18:35:00Z",
    "biotoolsCURIE": "biotools:CIMI-Ethiopia",
    "biotoolsID": "CIMI-Ethiopia",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "tafese.bosha@gmail.com",
            "name": "Tafese Bosha",
            "orcidid": "https://orcid.org/0000-0002-6188-7675",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | Validation of the CIMI-Ethiopia Program and Seasonal Variation in Maternal Nutrient Intake in Enset (False Banana) Growing Areas of Southern Ethiopia | BACKGROUND:Tools for the rapid and accurate analysis of nutrient intakes from diets of individuals in Southern Ethiopia are lacking. The Calculator of Inadequate Micronutrient Intake program for Ethiopia (CIMI-Ethiopia) has been developed to overcome this problem. CIMI-Ethiopia also computes protein and energy intakes from the diet. The objectives of the current study were to validate CIMI-Ethiopia for the dietary pattern of Southern Ethiopia, and assess the nutrient intakes in postharvest dry and lean wet seasons. METHODS:24-h dietary recall (24HR) data was collected from 578 women of a reproductive age in postharvest dry and lean wet seasons in 2017. For analysis, 24HR data was entered into NutriSurvey (NS), which was the reference nutrition software, and then into CIMI-Ethiopia",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31405023",
    "lastUpdate": "2019-11-14T18:35:00Z",
    "name": "CIMI-Ethiopia",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/IJERPH16162852",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Background: Tools for the rapid and accurate analysis of nutrient intakes from diets of individuals in Southern Ethiopia are lacking. The Calculator of Inadequate Micronutrient Intake program for Ethiopia (CIMI-Ethiopia) has been developed to overcome this problem. CIMI-Ethiopia also computes protein and energy intakes from the diet. The objectives of the current study were to validate CIMI-Ethiopia for the dietary pattern of Southern Ethiopia, and assess the nutrient intakes in postharvest dry and lean wet seasons. Methods: 24-h dietary recall (24HR) data was collected from 578 women of a reproductive age in postharvest dry and lean wet seasons in 2017. For analysis, 24HR data was entered into NutriSurvey (NS), which was the reference nutrition software, and then into CIMI-Ethiopia. For validation, the mean and standard deviation (SD) of the difference between CIMI-Ethiopia and NS were computed. The percentage of participants with an inadequate intake was calculated. The correlation between CIMI-Ethiopia and NS results was determined. The nutrient intakes in postharvest dry and lean seasons were compared. Results: Among the nutrients, pantothenic acid, vitamin B1, and protein showed a very high accuracy in CIMI-Ethiopia calculation (|difference (D)| < 5.0% of the NS result). Nutrients with a good accuracy (|D| = 5%–15%) were iron, zinc, magnesium, vitamin B12, vitamin B6, and energy. The accuracy for calcium, niacin, and vitamin A was moderate (|D| = 15%–30%). The intakes calculated by CIMI-Ethiopia and NS of iron, zinc, magnesium, calcium, B-complex vitamins, vitamin A, protein, and energy were highly correlated (r = 0.85–0.97, p < 0.001). NS analysis identified a significant reduction in the mean intake of iron; zinc; magnesium; pantothenic acid; vitamin B1, B12, and D; protein; and energy in the lean wet season; however, calcium and vitamin A intake increased. Conclusions: It has been found that CIMI-Ethiopia is a valid tool for estimating nutrient intakes at an individual level in Southern Ethiopia. The study demonstrated a decline in intakes of iron; zinc; magnesium; pantothenic acid; vitamin B1, B12, and D; protein; and energy in the lean wet season. This result provides some hint for fortification and supplementation programs that aim to combat maternal malnutrition in rural Southern Ethiopia.",
                "authors": [
                    {
                        "name": "Bosha T."
                    },
                    {
                        "name": "Lambert C."
                    },
                    {
                        "name": "Riedel S."
                    },
                    {
                        "name": "Gola U."
                    },
                    {
                        "name": "Melesse A."
                    },
                    {
                        "name": "Biesalski H.K."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-02T00:00:00Z",
                "journal": "International Journal of Environmental Research and Public Health",
                "title": "Validation of the CIMI-ethiopia program and seasonal variation in maternal nutrient intake in enset (False banana) growing areas of Southern Ethiopia"
            },
            "pmcid": "PMC6719118",
            "pmid": "31405023"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}