{
    "accessibility": "Open access",
    "additionDate": "2023-03-17T17:08:52.298176Z",
    "biotoolsCURIE": "biotools:dater",
    "biotoolsID": "dater",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Mukul S Bansal"
        }
    ],
    "description": "DaTeR (short for \"Dating Trees using Relative constraints\") is a program for improved dating of microbial species phylogenies using relative time constraints (e.g., obtained from high-confidence horizontal gene transfer events).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Tree dating",
                    "uri": "http://edamontology.org/operation_3942"
                }
            ]
        }
    ],
    "homepage": "https://compbio.engr.uconn.edu/software/dater/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-17T17:08:52.305146Z",
    "license": "GPL-3.0",
    "name": "DaTeR",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD084",
            "metadata": {
                "abstract": "MOTIVATION: A chronogram is a dated phylogenetic tree whose branch lengths have been scaled to represent time. Such chronograms are computed based on available date estimates (e.g. from dated fossils), which provide absolute time constraints for one or more nodes of an input undated phylogeny, coupled with an appropriate underlying model for evolutionary rates variation along the branches of the phylogeny. However, traditional methods for phylogenetic dating cannot take into account relative time constraints, such as those provided by inferred horizontal transfer events. In many cases, chronograms computed using only absolute time constraints are inconsistent with known relative time constraints. RESULTS: In this work, we introduce a new approach, Dating Trees using Relative constraints (DaTeR), for phylogenetic dating that can take into account both absolute and relative time constraints. The key idea is to use existing Bayesian approaches for phylogenetic dating to sample posterior chronograms satisfying desired absolute time constraints, minimally adjust or 'error-correct' these sampled chronograms to satisfy all given relative time constraints, and aggregate across all error-corrected chronograms. DaTeR uses a constrained optimization framework for the error-correction step, finding minimal deviations from previously assigned dates or branch lengths. We applied DaTeR to a biological dataset of 170 Cyanobacterial taxa and a reliable set of 24 transfer-based relative constraints, under six different molecular dating models. Our extensive analysis of this dataset demonstrates that DaTeR is both highly effective and scalable and that its application can significantly improve estimated chronograms. AVAILABILITY AND IMPLEMENTATION: Freely available from https://compbio.engr.uconn.edu/software/dater/. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Bansal M.S."
                    },
                    {
                        "name": "Fournier G.P."
                    },
                    {
                        "name": "Mondal A."
                    },
                    {
                        "name": "Payette J.G."
                    },
                    {
                        "name": "Rangel L.T."
                    }
                ],
                "date": "2023-02-03T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "DaTeR: error-correcting phylogenetic chronograms using relative time constraints"
            },
            "pmid": "36752504"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular evolution",
            "uri": "http://edamontology.org/topic_3945"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ]
}
