{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-08-09T13:07:53Z",
    "biotoolsCURIE": "biotools:PyRod",
    "biotoolsID": "PyRod",
    "cost": "Free of charge",
    "description": "Software developed to generate dynamic molecular interaction fields (dMIFs) and pharmacophore features based on analyzing the protein environment of water molecules in molecular dynamcis simulations.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/schallerdavid/pyrod/wiki"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/schallerdavid/pyrod/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/schallerdavid/pyrod",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-10-31T12:12:32Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/schallerdavid/pyrod/issues"
        }
    ],
    "maturity": "Mature",
    "name": "PyRod",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00281",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Ligands entering a protein binding pocket essentially compete with water molecules for binding to the protein. Hence, the location and thermodynamic properties of water molecules in protein structures have gained increased attention in the drug design community. Including corresponding data into 3D pharmacophore modeling is essential for efficient high throughput virtual screening. Here, we present PyRod, a free and open-source Python software that allows for visualization of pharmacophoric binding pocket characteristics, identification of hot spots for ligand binding, and subsequent generation of pharmacophore features for virtual screening. The implemented routines analyze the protein environment of water molecules in molecular dynamics (MD) simulations and can differentiate between hydrogen bonded waters as well as waters in a protein environment of hydrophobic, charged, or aromatic atom groups. The gathered information is further processed to generate dynamic molecular interaction fields (dMIFs) for visualization and pharmacophoric features for virtual screening. The described software was applied to 5 therapeutically relevant drug targets, and generated pharmacophores were evaluated using DUD-E benchmarking sets. The best performing pharmacophore was found for the HIV1 protease with an early enrichment factor of 54.6. PyRod adds a new perspective to structure-based screening campaigns by providing easy-to-interpret dMIFs and purely protein-based pharmacophores that are solely based on tracing water molecules in MD simulations. Since structural information about cocrystallized ligands is not needed, screening campaigns can be followed, for which less or no ligand information is available. PyRod is freely available at https://github.com/schallerdavid/pyrod.",
                "authors": [
                    {
                        "name": "Schaller D."
                    },
                    {
                        "name": "Pach S."
                    },
                    {
                        "name": "Wolber G."
                    }
                ],
                "date": "2019-06-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "PyRod: Tracing Water Molecules in Molecular Dynamics Simulations"
            },
            "pmid": "31117512",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}