{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2018-07-28T14:47:26Z",
    "biotoolsCURIE": "biotools:netpredictor",
    "biotoolsID": "netpredictor",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "djwild@indiana.edu",
            "name": "David J. Wild",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package is developed to perform network based prediction of unipartite and bipartite networks and use the results to understand the functionality of proteins in an interactome using enrichment analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/abhik1368/Shiny_NetPredictor/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/abhik1368/Shiny_NetPredictor",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/abhik1368/netpredictor"
        }
    ],
    "name": "Netpredictor",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2254-7",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: Netpredictor is an R package for prediction of missing links in any given unipartite or bipartite network. The package provides utilities to compute missing links in a bipartite and well as unipartite networks using Random Walk with Restart and Network inference algorithm and a combination of both. The package also allows computation of Bipartite network properties, visualization of communities for two different sets of nodes, and calculation of significant interactions between two sets of nodes using permutation based testing. The application can also be used to search for top-K shortest paths between interactome and use enrichment analysis for disease, pathway and ontology. The R standalone package (including detailed introductory vignettes) and associated R Shiny web application is available under the GPL-2 Open Source license and is freely available to download. Results: We compared different algorithms performance in different small datasets and found random walk supersedes rest of the algorithms. The package is developed to perform network based prediction of unipartite and bipartite networks and use the results to understand the functionality of proteins in an interactome using enrichment analysis. Conclusion: The rapid application development envrionment like shiny, helps non programmers to develop fast rich visualization apps and we beleieve it would continue to grow in future with further enhancements. We plan to update our algorithms in the package in near future and help scientist to analyse data in a much streamlined fashion.",
                "authors": [
                    {
                        "name": "Seal A."
                    },
                    {
                        "name": "Wild D.J."
                    }
                ],
                "citationCount": 2,
                "date": "2018-07-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Netpredictor: R and Shiny package to perform drug-target network analysis and prediction of missing links"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Drug targets",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.1"
    ]
}