{
    "additionDate": "2020-01-14T19:47:05Z",
    "biotoolsCURIE": "biotools:FilterDCA",
    "biotoolsID": "FilterDCA",
    "confidence_flag": "tool",
    "description": "interpretable supervised contact prediction using inter-domain coevolution.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Protein quaternary structure prediction",
                    "uri": "http://edamontology.org/operation_3350"
                }
            ]
        }
    ],
    "homepage": "http://gitlab.lcqb.upmc.fr/muscat/FilterDCA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T20:00:57Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "http://gitlab.lcqb.upmc.fr/muscat/FilterDCA/issues"
        }
    ],
    "name": "FilterDCA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/2019.12.24.887877"
        },
        {
            "doi": "10.1371/journal.pcbi.1007621",
            "metadata": {
                "abstract": "© 2020 Muscat et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Predicting three-dimensional protein structure and assembling protein complexes using sequence information belongs to the most prominent tasks in computational biology. Recently substantial progress has been obtained in the case of single proteins using a combination of unsupervised coevolutionary sequence analysis with structurally supervised deep learning. While reaching impressive accuracies in predicting residue-residue contacts, deep learning has a number of disadvantages. The need for large structural training sets limits the applicability to multi-protein complexes; and their deep architecture makes the interpretability of the convolutional neural networks intrinsically hard. Here we introduce FilterDCA, a simpler supervised predictor for inter-domain and inter-protein contacts. It is based on the fact that contact maps of proteins show typical contact patterns, which results from secondary structure and are reflected by patterns in coevolutionary analysis. We explicitly integrate averaged contacts patterns with coevolutionary scores derived by Direct Coupling Analysis, improving performance over standard coevolutionary analysis, while remaining fully transparent and interpretable. The FilterDCA code is available at http://gitlab.lcqb.upmc.fr/muscat/FilterDCA.",
                "authors": [
                    {
                        "name": "Muscat M."
                    },
                    {
                        "name": "Croce G."
                    },
                    {
                        "name": "Sarti E."
                    },
                    {
                        "name": "Weigt M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-09T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "FilterDCA: Interpretable supervised contact prediction using inter-domain coevolution"
            }
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}