{
    "additionDate": "2017-08-20T15:59:21Z",
    "biotoolsCURIE": "biotools:wigwams",
    "biotoolsID": "wigwams",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "comp-sci@dcs.warwick.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Biclustering approach for time series data, as it identifies genes exhibiting co-expression across subsets of available time course data sets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www2.warwick.ac.uk/fac/sci/dcs/people/sascha_ott/tools_and_software/wigwams"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://cyverseuk.org/applications/wigwams/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-25T14:02:20.162445Z",
    "license": "Not licensed",
    "name": "Wigwams",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt728",
            "metadata": {
                "abstract": "Motivation: Identification of modules of co-regulated genes is a crucial first step towards dissecting the regulatory circuitry underlying biological processes. Co-regulated genes are likely to reveal themselves by showing tight co-expression, e.g. high correlation of expression profiles across multiple time series datasets. However, numbers of up-or downregulated genes are often large, making it difficult to discriminate between dependent co-expression resulting from co-regulation and independent co-expression. Furthermore, modules of co-regulated genes may only show tight co-expression across a subset of the time series, i.e. show condition-dependent regulation.Results: Wigwams is a simple and efficient method to identify gene modules showing evidence for co-regulation in multiple time series of gene expression data. Wigwams analyzes similarities of gene expression patterns within each time series (condition) and directly tests the dependence or independence of these across different conditions. The expression pattern of each gene in each subset of conditions is tested statistically as a potential signature of a condition-dependent regulatory mechanism regulating multiple genes. Wigwams does not require particular time points and can process datasets that are on different time scales. Differential expression relative to control conditions can be taken into account. The output is succinct and non-redundant, enabling gene network reconstruction to be focused on those gene modules and combinations of conditions that show evidence for shared regulatory mechanisms. Wigwams was run using six Arabidopsis time series expression datasets, producing a set of biologically significant modules spanning different combinations of conditions. © 2013 The Author 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Beynon J."
                    },
                    {
                        "name": "Buchanan-Wollaston V."
                    },
                    {
                        "name": "Denby K.J."
                    },
                    {
                        "name": "Hill C."
                    },
                    {
                        "name": "Jenkins D.J."
                    },
                    {
                        "name": "Jironkin A."
                    },
                    {
                        "name": "Kiddle S.J."
                    },
                    {
                        "name": "Ott S."
                    },
                    {
                        "name": "Polanski K."
                    },
                    {
                        "name": "Rhodes J."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "citationCount": 21,
                "date": "2014-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Wigwams: Identifying gene modules co-regulated across multiple biological conditions"
            },
            "pmcid": "PMC3967106",
            "pmid": "24351708",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}
