{
    "additionDate": "2020-01-14T09:23:44Z",
    "biotoolsCURIE": "biotools:miRPathDB",
    "biotoolsID": "miRPathDB",
    "confidence_flag": "tool",
    "description": "A novel release of the miRNA Pathway Dictionary Database.\n\nSince the initial release of miRPathDB, tremendous progress has been made in the field of microRNA (miRNA) research. New miRNA reference databases have emerged, a vast amount of new miRNA candidates has been discovered and the number of experimentally validated target genes has increased considerably. Hence, the demand for a major upgrade of miRPathDB, including extended analysis functionality and intuitive visualizations of query results has emerged. Here, we present the novel release 2.0 of the miRNA Pathway Dictionary Database (miRPathDB) that is freely accessible at https: mpd.bioinf.uni-sb.de. miRPathDB 2.0 comes with a ten-fold increase of pre-processed data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://mpd.bioinf.uni-sb.de/",
    "lastUpdate": "2021-04-22T06:24:11Z",
    "name": "miRPathDB",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_017356"
        }
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1022",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Since the initial release of miRPathDB, tremendous progress has been made in the field of microRNA (miRNA) research. New miRNA reference databases have emerged, a vast amount of new miRNA candidates has been discovered and the number of experimentally validated target genes has increased considerably. Hence, the demand for a major upgrade of miRPathDB, including extended analysis functionality and intuitive visualizations of query results has emerged. Here, we present the novel release 2.0 of the miRNA Pathway Dictionary Database (miRPathDB) that is freely accessible at https://mpd.bioinf.uni-sb.de/. miRPathDB 2.0 comes with a ten-fold increase of pre-processed data. In total, the updated database provides putative associations between 27 452 (candidate) miRNAs, 28 352 targets and 16 833 pathways for Homo sapiens, as well as interactions of 1978 miRNAs, 24 898 targets and 6511 functional categories for Mus musculus. Additionally, we analyzed publications citing miRPathDB to identify common use-cases and further extensions. Based on this evaluation, we added new functionality for interactive visualizations and down-stream analyses of bulk queries. In summary, the updated version of miRPathDB, with its new custom-tailored features, is one of the most comprehensive and advanced resources for miRNAs and their target pathways.",
                "authors": [
                    {
                        "name": "Kehl T."
                    },
                    {
                        "name": "Kern F."
                    },
                    {
                        "name": "Backes C."
                    },
                    {
                        "name": "Fehlmann T."
                    },
                    {
                        "name": "Stockel D."
                    },
                    {
                        "name": "Meese E."
                    },
                    {
                        "name": "Lenhof H.-P."
                    },
                    {
                        "name": "Keller A."
                    }
                ],
                "citationCount": 23,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MiRPathDB 2.0: A novel release of the miRNA Pathway Dictionary Database"
            },
            "pmid": "31691816"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}