{
    "additionDate": "2015-01-22T11:40:40Z",
    "biotoolsCURIE": "biotools:grape_database",
    "biotoolsID": "grape_database",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "nicola.vitulo@cribi.unipd.it",
            "name": "Nicola Vitulo",
            "orcidid": "http://orcid.org/0000-0002-9571-0747",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genomes.cribi.unipd.it/grape/contact.php"
        }
    ],
    "description": "Database which provides several ways to access to the grape genomic data: as a blast search page, a genome browser and a direct link to download the data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genomes.cribi.unipd.it/grape/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Gene prediction and annotation data",
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://genomes.cribi.unipd.it/grape/",
    "lastUpdate": "2019-01-10T05:17:13Z",
    "name": "Grape Database",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2229-14-99",
            "metadata": {
                "abstract": "Background: Alternative splicing (AS) significantly enhances transcriptome complexity. It is differentially regulated in a wide variety of cell types and plays a role in several cellular processes. Here we describe a detailed survey of alternative splicing in grape based on 124 SOLiD RNAseq analyses from different tissues, stress conditions and genotypes.Results: We used the RNAseq data to update the existing grape gene prediction with 2,258 new coding genes and 3,336 putative long non-coding RNAs. Several gene structures have been improved and alternative splicing was described for about 30% of the genes. A link between AS and miRNAs was shown in 139 genes where we found that AS affects the miRNA target site. A quantitative analysis of the isoforms indicated that most of the spliced genes have one major isoform and tend to simultaneously co-express a low number of isoforms, typically two, with intron retention being the most frequent alternative splicing event.Conclusions: As described in Arabidopsis, also grape displays a marked AS tissue-specificity, while stress conditions produce splicing changes to a minor extent. Surprisingly, some distinctive splicing features were also observed between genotypes. This was further supported by the observation that the panel of Serine/Arginine-rich splicing factors show a few, but very marked differences between genotypes. The finding that a part the splicing machinery can change in closely related organisms can lead to some interesting hypotheses for evolutionary adaptation, that could be particularly relevant in the response to sudden and strong selective pressures. © 2014 Vitulo et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Vitulo N."
                    },
                    {
                        "name": "Forcato C."
                    },
                    {
                        "name": "Carpinelli E.C."
                    },
                    {
                        "name": "Telatin A."
                    },
                    {
                        "name": "Campagna D."
                    },
                    {
                        "name": "D'Angelo M."
                    },
                    {
                        "name": "Zimbello R."
                    },
                    {
                        "name": "Corso M."
                    },
                    {
                        "name": "Vannozzi A."
                    },
                    {
                        "name": "Bonghi C."
                    },
                    {
                        "name": "Lucchin M."
                    },
                    {
                        "name": "Valle G."
                    }
                ],
                "citationCount": 144,
                "date": "2014-04-17T00:00:00Z",
                "journal": "BMC Plant Biology",
                "title": "A deep survey of alternative splicing in grape reveals changes in the splicing machinery related to tissue, stress condition and genotype"
            },
            "pmcid": "PMC4108029",
            "pmid": "24739459",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}