{
    "accessibility": "Open access",
    "additionDate": "2023-02-20T19:45:29.332792Z",
    "biotoolsCURIE": "biotools:fmriflows",
    "biotoolsID": "fmriflows",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michaelnotter@hotmail.com",
            "name": "Michael P. Notter",
            "typeEntity": "Person"
        },
        {
            "email": "micah.murray@chuv.ch",
            "typeEntity": "Person"
        }
    ],
    "description": "A consortium of fully automatic neuroimaging pipelines for fMRI analysis, which performs standard preprocessing, as well as 1st- and 2nd-level univariate and multivariate analyses.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/miykael/fmriflows",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2023-02-20T19:45:29.335301Z",
    "license": "BSD-3-Clause",
    "name": "fMRIflows",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S10548-022-00935-8",
            "metadata": {
                "abstract": "© 2022, The Author(s).How functional magnetic resonance imaging (fMRI) data are analyzed depends on the researcher and the toolbox used. It is not uncommon that the processing pipeline is rewritten for each new dataset. Consequently, code transparency, quality control and objective analysis pipelines are important for improving reproducibility in neuroimaging studies. Toolboxes, such as Nipype and fMRIPrep, have documented the need for and interest in automated pre-processing analysis pipelines. Recent developments in data-driven models combined with high resolution neuroimaging dataset have strengthened the need not only for a standardized preprocessing workflow, but also for a reliable and comparable statistical pipeline. Here, we introduce fMRIflows: a consortium of fully automatic neuroimaging pipelines for fMRI analysis, which performs standard preprocessing, as well as 1st- and 2nd-level univariate and multivariate analyses. In addition to the standardized pre-processing pipelines, fMRIflows provides flexible temporal and spatial filtering to account for datasets with increasingly high temporal resolution and to help appropriately prepare data for advanced machine learning analyses, improving signal decoding accuracy and reliability. This paper first describes fMRIflows’ structure and functionality, then explains its infrastructure and access, and lastly validates the toolbox by comparing it to other neuroimaging processing pipelines such as fMRIPrep, FSL and SPM. This validation was performed on three datasets with varying temporal sampling and acquisition parameters to prove its flexibility and robustness. fMRIflows is a fully automatic fMRI processing pipeline which uniquely offers univariate and multivariate single-subject and group analyses as well as pre-processing.",
                "authors": [
                    {
                        "name": "Da Costa S."
                    },
                    {
                        "name": "Gaglianese A."
                    },
                    {
                        "name": "Gulban O.F."
                    },
                    {
                        "name": "Herholz P."
                    },
                    {
                        "name": "Isik A.I."
                    },
                    {
                        "name": "Murray M.M."
                    },
                    {
                        "name": "Notter M.P."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Brain Topography",
                "title": "fMRIflows: A Consortium of Fully Automatic Univariate and Multivariate fMRI Processing Pipelines"
            },
            "pmid": "36575327"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
