{
    "additionDate": "2018-05-19T11:46:24Z",
    "biotoolsCURIE": "biotools:gobyweb",
    "biotoolsID": "gobyweb",
    "credit": [
        {
            "email": "fac2003@campagnelab.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simplified Management and Analysis of Gene Expression and DNA Methylation Sequencing Data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://campagnelab.org/software/gobyweb/tutorials/introduction/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://campagnelab.org/software/gobyweb/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "GobyWeb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0069666",
            "metadata": {
                "abstract": "We present GobyWeb, a web-based system that facilitates the management and analysis of high-throughput sequencing (HTS) projects. The software provides integrated support for a broad set of HTS analyses and offers a simple plugin extension mechanism. Analyses currently supported include quantification of gene expression for messenger and small RNA sequencing, estimation of DNA methylation (i.e., reduced bisulfite sequencing and whole genome methyl-seq), or the detection of pathogens in sequenced data. In contrast to previous analysis pipelines developed for analysis of HTS data, GobyWeb requires significantly less storage space, runs analyses efficiently on a parallel grid, scales gracefully to process tens or hundreds of multi-gigabyte samples, yet can be used effectively by researchers who are comfortable using a web browser. We conducted performance evaluations of the software and found it to either outperform or have similar performance to analysis programs developed for specialized analyses of HTS data. We found that most biologists who took a one-hour GobyWeb training session were readily able to analyze RNA-Seq data with state of the art analysis tools. GobyWeb can be obtained at http://gobyweb.campagnelab and is freely available for non-commercial use. GobyWeb plugins are distributed in source code and licensed under the open source LGPL3 license to facilitate code inspection, reuse and independent extensions http://github.com/CampagneLaboratory/gobyweb2-plugins. © 2013 Dorff et al.",
                "authors": [
                    {
                        "name": "Dorff K.C."
                    },
                    {
                        "name": "Chambwe N."
                    },
                    {
                        "name": "Zeno Z."
                    },
                    {
                        "name": "Simi M."
                    },
                    {
                        "name": "Shaknovich R."
                    },
                    {
                        "name": "Campagne F."
                    }
                ],
                "citationCount": 13,
                "date": "2013-07-23T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GobyWeb: Simplified Management and Analysis of Gene Expression and DNA Methylation Sequencing Data"
            },
            "pmcid": "PMC3720652",
            "pmid": "23936070"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}