
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bio.cs.washington.edu/biohome"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/statsigma-beta-computes-p-value-multiple-alignment.html"
        }
    ],
    "publication": [
        {
            "abstract": "Multiple sequence alignments have wide applicability in many areas of computational biology, including comparative genomics, functional annotation of proteins, gene finding, and modeling evolutionary processes. Because of the computational difficulty of multiple sequence alignment and the availability of numerous tools, it is critical to be able to assess the reliability of multiple alignments. We present a tool called StatSigMA to assess whether multiple alignments of nucleotide or amino acid sequences are contaminated with one or more unrelated sequences. There are numerous applications for which StatSigMA can be used. Two such applications are to distinguish homologous sequences from nonhomologous ones and to compare alignments produced by various multiple alignment tools. We present examples of both types of applications. © 2009 IEEE.",
            "authors": [
                "Prakash A.",
                "Tompa M."
            ],
            "cit_count": 3,
            "doi": "10.1109/TCBB.2007.70271",
            "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
            "pmid": "19875854",
            "title": "Assessing the discordance of multiple sequence alignments",
            "type": "Primary",
            "year": "2009-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:statsigma",
        "biotoolsID": "statsigma",
        "description": "Compute the statistical significance of multiple sequence alignments (of either nucleotide or amino acid sequences), much as BLAST’s E-values provide statistical significance for pairwise alignments.",
        "homepage": "http://bio.cs.washington.edu/software/alignment_quality",
        "name": "StatSigMA"
    }
}