{
    "name": "WebFEATURE", 
    "description": "Structural analysis tool for identifying 3D physiochemical motifs in molecular structures.", 
    "homepage": "http://feature.stanford.edu/webfeature/", 
    "biotoolsID": "webfeature", 
    "biotoolsCURIE": "biotools:webfeature", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0245", 
                    "term": "Protein structural motif recognition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2416", 
                    "term": "Protein secondary structure analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2481", 
                    "term": "Nucleic acid structure analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2480", 
                    "term": "Structure analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2406", 
                    "term": "Protein structure analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0166", 
            "term": "Protein structural motifs and surfaces"
        }, 
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_2814", 
            "term": "Protein structure analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_0097", 
            "term": "Nucleic acid structure analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_0082", 
            "term": "Structure prediction"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12824318", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "WebFEATURE: An interactive web tool for identifying and visualizing functional sites on macromolecular structures", 
                "abstract": "WebFEATURE (http://feature.stanford.edu/webfeature/) is a web-accessible structural analysis tool that allows users to scan query structures for functional sites in both proteins and nucleic acids. WebFEATURE is the public interface to the scanning algorithm of the FEATURE package, a supervised learning algorithm for creating and identifying 3D, physicochemical motifs in molecular structures. Given an input structure or Protein Data Bank identifier (PDB ID), and a statistical model of a functional site, WebFEATURE will return rank-scored 'hits' in 3D space that identify regions in the structure where similar distributions of physicochemical properties occur relative to the site model. Users can visualize and interactively manipulate scored hits and the query structure in web browsers that support the Chime plug-in. Alternatively, results can be downloaded and visualized through other freely available molecular modeling tools, like RasMol, PyMOL and Chimera. A major application of WebFEATURE is in rapid annotation of function to structures in the context of structural genomics.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 68, 
                "authors": [
                    {
                        "name": "Liang M.P."
                    }, 
                    {
                        "name": "Banatao D.R."
                    }, 
                    {
                        "name": "Klein T.E."
                    }, 
                    {
                        "name": "Brutlag D.L."
                    }, 
                    {
                        "name": "Altman R.B."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "9697207", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Recognizing protein binding sites using statistical descriptions of their 3D environments.", 
                "abstract": "We have developed a new method for recognizing sites in three-dimensional protein structures. Our method is based on our previously reported algorithm for creating descriptions of protein microenvironments using physical and chemical properties at multiple levels of detail (including features at the atomic, chemical group, residue, and secondary structural levels). The recognition method takes three inputs: a set of sites that share some structural or functional role, a set of control nonsites that lack this role, and a single query site. The values of properties for the query site are compared to the distributions of values for both sites and nonsites to determine the group to which it is most similar. A log-odds scoring function, based on Bayes' Rule, computes a score that indicates the likelihood that the query region is a site of interest. In this paper, we apply the method to the task of identifying calcium binding sites in proteins. Cross-validation analysis shows that this recognition approach has high sensitivity and specificity. We also describe the results of scanning four calcium binding proteins (with the calcium removed) using a three-dimensional grid of probe points at 2 A spacing. The probe points that have high scores cluster around the true calcium binding sites, with the highest scoring points at or near the binding sites. The method fails in only one case where a calcium binding site is created by four proteins in the crystal lattice, and is thus not recognizable within the crystallographic asymmetric unit. Our results show that property-based descriptions can be used for recognizing protein sites in unannotated structures.", 
                "date": "1998-01-01T00:00:00Z", 
                "citationCount": 56, 
                "authors": [
                    {
                        "name": "Wei L."
                    }, 
                    {
                        "name": "Altman R.B."
                    }
                ], 
                "journal": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-07T13:52:13Z", 
    "lastUpdate": "2018-12-10T12:58:39Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}