
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Humans",
                "uri": "http://edamontology.org/topic_2815"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Herein we present TmPrime, a computer program to design oligonucleotide sets for gene assembly by both ligase chain reaction (LCR) and polymerase chain reaction (PCR). TmPrime offers much flexibility with no constraints on the gene and oligonucleotide lengths. The program divides the long input DNA sequence based on the input desired melting temperature, and dynamically optimizes the length of oligonucleotides to achieve homologous melting temperatures. The output reports the melting temperatures, oligonucleotide sequences and potential formation of secondary structures. Our program also provides functions on sequence pooling to separate long genes into smaller pieces for multi-pool assembly and codon optimization for expression. The software has been successfully used in the design and synthesis of green fluorescent protein fragment (GFPuv) (760 bp), human protein kinase B-2 (PKB2) (1446 bp) and the promoter of human calcium-binding protein A4 (S100A4) (752 bp) using real-time PCR assembly with LCGreen I, which offers a novel approach to compare the efficiency of gene synthesis. The purity of assembled products is successfully estimated with the use of melting curve analysis, which would potentially eliminate the necessity for agarose gel electrophoresis. This program is freely available at http://prime.ibn.a-star.edu.sg.",
            "authors": [
                "Bode M.",
                "Khor S.",
                "Ye H.",
                "Li M.-H.",
                "Ying J.Y."
            ],
            "cit_count": 27,
            "journal": "Nucleic Acids Research",
            "pmid": "19515937",
            "title": "TmPrime: Fast, flexible oligonucleotide design software for gene synthesis",
            "year": "2009-08-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tmprime",
        "biotoolsID": "tmprime",
        "description": "Allows users to design oligonucleotide sets for gene assembly by both ligase chain reaction and polymerase chain reaction. The program also provides functions to separate long genes into smaller fragments for multi-pool assembly and codon optimization for expression.",
        "homepage": "http://prime.ibn.a-star.edu.sg",
        "name": "TmPrime"
    }
}