
{
    "credit": [
        {
            "email": "sleal@bcm.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.bcm.edu/genetics/leal/index.cfm?PMID=0"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://code.google.com/archive/p/simrare/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "C++",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/simrare-rare-variant-simulation-analysis-tool.html"
        }
    ],
    "publication": [
        {
            "abstract": "Sprague-Dawley rats were first trained on an inhibitory avoidance task (IA) and then, two weeks later, on a Y-maze discrimination task (YMD). Bilateral intra-amygdala injections were given through implanted cannulae immediately post-training. Retention was evaluated one week following training on each task. Naloxone (0.1, 0.3 or 1.0 μg) facilitated retention performance in both tasks. The most effective doses were 0.1 μg for the IA task and 0.3 μg for the YMD task. Since naloxone (0.1 μg) did not affect retention when administered via cannulae implanted in either the caudate-putamen or cortex dorsal to the amygdala, the effects of intra-amygdala naloxone is not due to diffusion of the drug to these brain regions. Intra-amygdala injectiins of the β1,2-adrenoceptor blocker propranolol (0.3 μg) blocked the memory enhancing effects of intra-amygdala naloxone (IA : 0.1 μg; YMD : 0.3 μg) administered concurrently immediately post-training. We interpret these findings as indicating that the enhancing effects of intra-amygdala naloxone are mediated by the activation of β-noradrenergic receptors within the amygdala. Such effects are presumably due to blocking of inhibitory effects of opioid peptides on the release of norepinephrine. © 1989.",
            "authors": [
                "Introini-Collison I.B.",
                "Nagahara A.H.",
                "McGaugh J.L."
            ],
            "cit_count": 105,
            "journal": "Brain Research",
            "pmid": "2914216",
            "title": "Memory enhancement with intra-amygdala post-training naloxone is blocked by concurrent administration of propranolol",
            "year": "1989-01-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:simrare",
        "biotoolsID": "simrare",
        "description": "A program to generate and analyze sequence-based data for rare variant association studies of quantitative and qualitative traits",
        "homepage": "https://code.google.com/p/simrare/",
        "name": "SimRare"
    }
}