
{
    "credit": [
        {
            "email": "development@ecopath.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://ecopath.org/download/ecopath-6-6-beta/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Visual Basic"
        ],
        "license": "LGPL-2.0",
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Ecology",
                "uri": "http://edamontology.org/topic_0610"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/ElsevierSoftwareX/SOFTX_2018_57/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 The Authors The widely used Ecopath with Ecosim (EwE) food web modelling approach has been extended with a new module to measure the impact of input parameter sensitivity on its results. Ecosampler records samples – alternate mass-balanced parameter sets for a food web model – from the built-in Monte Carlo routine, and replays these samples through all of EwE modules and any loaded plug-in. Via Ecosampler, output variation due to base input parameter sensitivity can be captured, of any computational component including the temporal module Ecosim, the spatial–temporal module Ecospace, and plug-ins such as Ecological Network Analysis, Value Chain, and Ecological Indicators.",
            "authors": [
                "Steenbeek J.",
                "Corrales X.",
                "Platts M.",
                "Coll M."
            ],
            "cit_count": 2,
            "doi": "10.1016/j.softx.2018.06.004",
            "journal": "SoftwareX",
            "title": "Ecosampler: A new approach to assessing parameter uncertainty in Ecopath with Ecosim",
            "type": "Primary",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ewe",
        "biotoolsID": "ewe",
        "description": "EwE has three main components: Ecopath – a static, mass-balanced snapshot of the system; Ecosim – a time dynamic simulation module for policy exploration; and Ecospace – a spatial and temporal dynamic module primarily designed for exploring impact and placement of protected areas. The Ecopath software package can be used to",
        "homepage": "http://ecopath.org/",
        "name": "EwE",
        "version": [
            "6.6 Beta"
        ]
    }
}