{
    "name": "Bio-jETI", 
    "description": "Service platform for interdisciplinary work on biological application domains. It uses the jETI (Java Electronic Tool Integration Platform) service integration technology for remote tool integration and the jABC framework as a graphical workflow modeling tool.", 
    "homepage": "http://ls5-www.cs.tu-dortmund.de/projects/biojeti/about.php", 
    "biotoolsID": "bio-jeti", 
    "biotoolsCURIE": "biotools:bio-jeti", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3760", 
                    "term": "Service management"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3316", 
            "term": "Computer science"
        }, 
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0769", 
            "term": "Workflows"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/bio-jeti-1-0-framework-bioinformatics-workflows.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://ls5-www.cs.tu-dortmund.de/projects/biojeti/documentation.php", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "19796405", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Bio-jETI: A framework for semantics-based service composition", 
                "abstract": "Background: The development of bioinformatics databases, algorithms, and tools throughout the last years has lead to a highly distributed world of bioinformatics services. Without adequate management and development support, in silico researchers are hardly able to exploit the potential of building complex, specialized analysis processes from these services. The Semantic Web aims at thoroughly equipping individual data and services with machine-processable meta-information, while workflow systems support the construction of service compositions. However, even in this combination, in silico researchers currently would have to deal manually with the service interfaces, the adequacy of the semantic annotations, type incompatibilities, and the consistency of service compositions. Results: In this paper, we demonstrate by means of two examples how Semantic Web technology together with an adequate domain modelling frees in silico researchers from dealing with interfaces, types, and inconsistencies. In Bio-jETI, bioinformatics services can be graphically combined to complex services without worrying about details of their interfaces or about type mismatches of the composition. These issues are taken care of at the semantic level by Bio-jETI's model checking and synthesis features. Whenever possible, they automatically resolve type mismatches in the considered service setting. Otherwise, they graphically indicate impossible/incorrect service combinations. In the latter case, the workflow developer may either modify his service composition using semantically similar services, or ask for help in developing the missing mediator that correctly bridges the detected type gap. Newly developed mediators should then be adequately annotated semantically, and added to the service library for later reuse in similar situations. Conclusion: We show the power of semantic annotations in an adequately modelled and semantically enabled domain setting. Using model checking and synthesis methods, users may orchestrate complex processes from a wealth of heterogeneous services without worrying about interfaces and (type) consistency. The success of this method strongly depends on a careful semantic annotation of the provided services and on its consequent exploitation for analysis, validation, and synthesis. We are convinced that these annotations will become standard, as they will become preconditions for the success and widespread use of (preferred) services in the Semantic Web. © 2009 Lamprecht et al; licensee BioMed Central Ltd.", 
                "date": "2009-10-01T00:00:00Z", 
                "citationCount": 48, 
                "authors": [
                    {
                        "name": "Lamprecht A.-L."
                    }, 
                    {
                        "name": "Margaria T."
                    }, 
                    {
                        "name": "Steffen B."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "anna-lena.lamprecht@cs.tu-dortmund.de", 
            "url": "http://www.ls-5.de/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:37:28Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}