{
    "accessibility": "Open access",
    "additionDate": "2022-07-07T20:09:13.434165Z",
    "biotoolsCURIE": "biotools:wsdl-ad",
    "biotoolsID": "wsdl-ad",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "henggui.zhang@manchester.ac.uk",
            "name": "Henggui Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "qinceli@hit.edu.cn",
            "name": "Qince Li",
            "typeEntity": "Person"
        },
        {
            "name": "Yong Xia"
        },
        {
            "name": "Yongfeng Yuan"
        }
    ],
    "description": "Generalizable Beat-by-Beat Arrhythmia Detection by Using Weakly Supervised Deep Learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sdnjly/WSDL-AD",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-07T20:09:13.437258Z",
    "license": "MIT",
    "name": "WSDL-AD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FPHYS.2022.850951",
            "metadata": {
                "abstract": "Copyright © 2022 Liu, Li, He, Wang, Liu, Yuan, Xia and Zhang.Beat-by-beat arrhythmia detection in ambulatory electrocardiogram (ECG) monitoring is critical for the evaluation and prognosis of cardiac arrhythmias, however, it is a highly professional demanding and time-consuming task. Current methods for automatic beat-by-beat arrhythmia detection suffer from poor generalization ability due to the lack of large-sample and finely-annotated (labels are given to each beat) ECG data for model training. In this work, we propose a weakly supervised deep learning framework for arrhythmia detection (WSDL-AD), which permits training a fine-grained (beat-by-beat) arrhythmia detector with the use of large amounts of coarsely annotated ECG data (labels are given to each recording) to improve the generalization ability. In this framework, heartbeat classification and recording classification are integrated into a deep neural network for end-to-end training with only recording labels. Several techniques, including knowledge-based features, masked aggregation, and supervised pre-training, are proposed to improve the accuracy and stability of the heartbeat classification under weak supervision. The developed WSDL-AD model is trained for the detection of ventricular ectopic beats (VEB) and supraventricular ectopic beats (SVEB) on five large-sample and coarsely-annotated datasets and the model performance is evaluated on three independent benchmarks according to the recommendations from the Association for the Advancement of Medical Instrumentation (AAMI). The experimental results show that our method improves the F1 score of supraventricular ectopic beats detection by 8%–290% and the F1 of ventricular ectopic beats detection by 4%–11% on the benchmarks compared with the state-of-the-art methods of supervised learning. It demonstrates that the WSDL-AD framework can leverage the abundant coarsely-labeled data to achieve a better generalization ability than previous methods while retaining fine detection granularity. Therefore, this framework has a great potential to be used in clinical and telehealth applications. The source code is available at https://github.com/sdnjly/WSDL-AD.",
                "authors": [
                    {
                        "name": "He R."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Xia Y."
                    },
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "date": "2022-03-22T00:00:00Z",
                "journal": "Frontiers in Physiology",
                "title": "Generalizable Beat-by-Beat Arrhythmia Detection by Using Weakly Supervised Deep Learning"
            },
            "pmcid": "PMC9037749",
            "pmid": "35480046"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
