{
    "additionDate": "2022-11-15T07:52:01.380298Z",
    "biotoolsCURIE": "biotools:mtrader",
    "biotoolsID": "mtrader",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qian.li@stjude.org",
            "name": "Qian Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A robust and transformation-free joint model with matching and regularization for metagenomic trajectory and disease onset.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qianli10000/mtradeR",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-15T07:52:01.382933Z",
    "license": "Other",
    "name": "mtradeR",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12864-022-08890-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: To identify operational taxonomy units (OTUs) signaling disease onset in an observational study, a powerful strategy was selecting participants by matched sets and profiling temporal metagenomes, followed by trajectory analysis. Existing trajectory analyses modeled individual OTU or microbial community without adjusting for the within-community correlation and matched-set-specific latent factors. Results: We proposed a joint model with matching and regularization (JMR) to detect OTU-specific trajectory predictive of host disease status. The between- and within-matched-sets heterogeneity in OTU relative abundance and disease risk were modeled by nested random effects. The inherent negative correlation in microbiota composition was adjusted by incorporating and regularizing the top-correlated taxa as longitudinal covariate, pre-selected by Bray-Curtis distance and elastic net regression. We designed a simulation pipeline to generate true biomarkers for disease onset and the pseudo biomarkers caused by compositionality. We demonstrated that JMR effectively controlled the false discovery and pseudo biomarkers in a simulation study generating temporal high-dimensional metagenomic counts with random intercept or slope. Application of the competing methods in the simulated data and the TEDDY cohort showed that JMR outperformed the other methods and identified important taxa in infants’ fecal samples with dynamics preceding host disease status. Conclusion: Our method JMR is a robust framework that models taxon-specific trajectory and host disease status for matched participants without transformation of relative abundance, improving the power of detecting disease-associated microbial features in certain scenarios. JMR is available in R package mtradeR at https://github.com/qianli10000/mtradeR.",
                "authors": [
                    {
                        "name": "Hu Y.-J."
                    },
                    {
                        "name": "Krischer J."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Roesch L."
                    },
                    {
                        "name": "Triplett E."
                    },
                    {
                        "name": "Vehik K."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A robust and transformation-free joint model with matching and regularization for metagenomic trajectory and disease onset"
            },
            "pmcid": "PMC9484160",
            "pmid": "36123651"
        }
    ],
    "toolType": [
        "Library",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
