{
    "additionDate": "2017-04-21T12:12:20Z",
    "biotoolsCURIE": "biotools:betaturns",
    "biotoolsID": "betaturns",
    "credit": [
        {
            "email": "raghava@imtech.res.in",
            "name": "Dr. G.P.S. Raghava",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.imtech.res.in/raghava/betaturns/who.html"
        },
        {
            "email": "harpreet@imtech.res.in",
            "name": "Harpreet Kaur",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This software predicts the beta turns and their types in a protein from its amino acid sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava//betaturns/method.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/betaturns/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "name": "Betaturns",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The prediction of β-turns is an important element of protein secondary structure prediction. Recently, a highly accurate neural network based method Betatpred2 has been developed for predicting β-turns in proteins using position-specific scoring matrices (PSSM) generated by PSI-BLAST and secondary structure information predicted by PSIPRED. However, the major limitation of Betatpred2 is that it predicts only β-turn and non-β-turn residues and does not provide any information of different β-turn types. Thus, there is a need to predict β-turn types using an approach based on multiple sequence alignment, which will be useful in overall tertiary structure prediction. Results: In the present work, a method has been developed for the prediction of β-turn types I, II, IV and VIII. For each turn type, two consecutive feed-forward back-propagation networks with a single hidden layer have been used where the first sequence-to-structure network has been trained on single sequences as well as on PSI-BLAST PSSM. The output from the first network along with PSIPRED predicted secondary structure has been used as input for the second-level structure-to-structure network. The networks have been trained and tested on a non-homologous dataset of 426 proteins chains by 7-fold cross-validation. It has been observed that the prediction performance for each turn type is improved significantly by using multiple sequence alignment. The performance has been further improved by using a second level structure-to-structure network and PSIPRED predicted secondary structure information. It has been observed that Type I and II β -turns have better prediction performance than Type IV and VIII β -turns. The final network yields an overall accuracy of 74.5, 93.5, 67.9 and 96.5% with MCC values of 0.29, 0.29, 0.23 and 0.02 for Type I, II, IV and VIII β-turns, respectively, and is better than random prediction. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 84,
                "date": "2004-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A neural network method for prediction of β-turn types in proteins using evolutionary information"
            },
            "pmid": "15145798"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}