{
    "accessibility": "Open access",
    "additionDate": "2024-01-29T07:22:06.494786Z",
    "biotoolsCURIE": "biotools:bapres",
    "biotoolsID": "bapres",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "suraiya.akhter@wsu.edu",
            "name": "Suraiya Akhter",
            "orcidid": "https://orcid.org/0000-0001-6577-2034",
            "typeEntity": "Person"
        },
        {
            "email": "jmiller16@wsu.edu",
            "name": "John H. Miller",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting bacteriocins using an optimal set of features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://github.com/suraiya14/BaPreS",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:19:05.263546Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://shiny.tricities.wsu.edu/bacteriocin-prediction/"
        }
    ],
    "name": "BaPreS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05330-z",
            "metadata": {
                "abstract": "Background: Antibiotic resistance is a major public health concern around the globe. As a result, researchers always look for new compounds to develop new antibiotic drugs for combating antibiotic-resistant bacteria. Bacteriocin becomes a promising antimicrobial agent to fight against antibiotic resistance, due to cases of both broad and narrow killing spectra. Sequence matching methods are widely used to identify bacteriocins by comparing them with the known bacteriocin sequences; however, these methods often fail to detect new bacteriocin sequences due to their high diversity. The ability to use a machine learning approach can help find new highly dissimilar bacteriocins for developing highly effective antibiotic drugs. The aim of this work is to develop a machine learning-based software tool called BaPreS (Bacteriocin Prediction Software) using an optimal set of features for detecting bacteriocin protein sequences with high accuracy. We extracted potential features from known bacteriocin and non-bacteriocin sequences by considering the physicochemical and structural properties of the protein sequences. Then we reduced the feature set using statistical justifications and recursive feature elimination technique. Finally, we built support vector machine (SVM) and random forest (RF) models using the selected features and utilized the best machine learning model to implement the software tool. Results: We applied BaPreS to an established dataset and evaluated its prediction performance. Acquired results show that the software tool can achieve a prediction accuracy of 95.54% for testing protein sequences. This tool allows users to add new bacteriocin or non-bacteriocin sequences in the training dataset to further enhance the predictive power of the tool. We compared the prediction performance of the BaPreS with a popular sequence matching-based tool and a deep learning-based method, and our software tool outperformed both. Conclusions: BaPreS is a bacteriocin prediction tool that can be used to discover new highly dissimilar bacteriocins for developing highly effective antibiotic drugs. This software tool can be used with Windows, Linux and macOS operating systems. The open-source software package and its user manual are available at https://github.com/suraiya14/BaPreS .",
                "authors": [
                    {
                        "name": "Akhter S."
                    },
                    {
                        "name": "Miller J.H."
                    }
                ],
                "citationCount": 7,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BaPreS: a software tool for predicting bacteriocins using an optimal set of features"
            },
            "pmcid": "PMC10433575",
            "pmid": "37592230"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
