{
    "additionDate": "2017-08-03T18:50:49Z",
    "biotoolsCURIE": "biotools:mdrpdt",
    "biotoolsID": "mdrpdt",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ritchielab.psu.edu/"
        }
    ],
    "description": "This tool merges the MDR method with the genotype-Pedigree Disequilibrium Test (geno-PDT). It allows identification of single-locus effects or joint effects of multiple loci in families of diverse structure. We present simulations to demonstrate the validity of the test and evaluate its power.",
    "documentation": [
        {
            "type": "General",
            "url": "http://ritchielab.psu.edu/mdr-downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://ritchielab.psu.edu/mdr-downloads",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mdrpdt-2-0-1-21-multifactor-dimensionality-reduction-genotype-pedigree-disequilibrium-test.html"
        }
    ],
    "name": "MdrPDT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "It is now well recognized that gene-gene and gene-environment interactions are important in complex diseases, and statistical methods to detect interactions are becoming widespread. Traditional parametric approaches are limited in their ability to detect high-order interactions and handle sparse data, and standard stepwise procedures may miss interactions that occur in the absence of detectable main effects. To address these limitations, the multifactor dimensionality reduction (MDR) method [Ritchie et al., 2001: Am J Hum Genet 69:138-147] was developed. The MDR is wellsuited for examining high-order interactions and detecting interactions without main effects. The MDR was originally designed to analyze balanced case-control data. The analysis can use family data, but requires a single matched pair be selected from each family. This may be a discordant sib pair, or may be constructed from triad data when parents are available. To take advantage of additional affected and unaffected siblings requires a test statistic that measures the association of genotype with disease in general nuclear families. We have developed a novel test, the MDR-PDT, by merging the MDR method with the genotype-Pedigree Disequilibrium Test (geno-PDT)[Martin et al., 2003: Genet Epidemiol 25:203-213]. MDR-PDT allows identification of single-locus effects or joint effects of multiple loci in families of diverse structure. We present simulations to demonstrate the validity of the test and evaluate its power. To examine its applicability to real data, we applied the MDR-PDT to data from candidate genes for Alzheimer disease (AD) in a large family dataset. These results show the utility of the MDR-PDT for understanding the genetics of complex diseases. © 2005 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Martin E.R."
                    },
                    {
                        "name": "Ritchie M.D."
                    },
                    {
                        "name": "Hahn L."
                    },
                    {
                        "name": "Kang S."
                    },
                    {
                        "name": "Moore J.H."
                    }
                ],
                "citationCount": 94,
                "date": "2006-02-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "A novel method to identify gene-gene effects in nuclear families: The MDR-PDT"
            },
            "pmid": "16374833"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1
}