{
    "additionDate": "2017-08-03T18:50:19Z",
    "biotoolsCURIE": "biotools:mufold",
    "biotoolsID": "mufold",
    "credit": [
        {
            "email": "xudong@missouri.edu",
            "name": "Dong Xu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mufold.org/people.html"
        }
    ],
    "description": "Comprehensive platform for efficient and consistently accurate protein tertiary structure prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mufold.org/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://mufold.org/prediction.php",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mufold-solution-for-protein-3d-structure-prediction.html"
        }
    ],
    "name": "MUFOLD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "De novo protein structure prediction often generates a large population of candidates (models), and then selects near-native models through clustering. Existing structural model clustering methods are time consuming due to pairwise distance calculation between models. In this paper, we present a novel method for fast model clustering without losing the clustering accuracy. Instead of the commonly used pairwise root mean square deviation and TM-score values, we propose two new distance measures, Dscore1 and Dscore2, based on the comparison of the protein distance matrices for describing the difference and the similarity among models, respectively. The analysis indicates that both the correlation between Dscore1 and root mean square deviation and the correlation between Dscore2 and TM-score are high. Compared to the existing methods with calculation time quadratic to the number of models, our Dscore1-based clustering achieves a linearly time complexity while obtaining almost the same accuracy for near-native model selection. By using Dscore2 to select representatives of clusters, we can further improve the quality of the representatives with little increase in computing time. In addition, for large size (~500 k) models, we can give a fast data visualization based on the Dscore distribution in seconds to minutes. Our method has been implemented in a package named MUFOLD-CL, available at http://mufold.org/clustering.php. © 2013 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 6,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "Fast algorithm for population-based protein structural model analysis"
            },
            "pmid": "23184517"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}