{
    "additionDate": "2017-05-16T13:43:43Z",
    "biotoolsCURIE": "biotools:mrsfast-ultra",
    "biotoolsID": "mrsfast-ultra",
    "credit": [
        {
            "email": "fhach@sfu.ca",
            "name": "Faraz Hach",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://eichlerlab.gs.washington.edu/"
        }
    ],
    "description": "Cache oblivious mapper that is designed to map short reads to reference genome. It maps short reads with respect to user defined error threshold. In this manual, we will show how to choose the parameters and tune the tool with respect to the library settings.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/sfu-compbio/mrsfast//blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://sfu-compbio.github.io/mrsfast/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mrsfast-2-3-0-2-micro-read-substitution-only-fast-alignment-search-tool.html"
        }
    ],
    "name": "mrsFAST-Ultra",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "High throughput sequencing (HTS) platforms generate unprecedented amounts of data that introduce challenges for processing and downstream analysis. While tools that report the 'best' mapping location of each read provide a fast way to process HTS data, they are not suitable for many types of downstream analysis such as structural variation detection, where it is important to report multiple mapping loci for each read. For this purpose we introduce mrsFAST-Ultra, a fast, cache oblivious, SNP-aware aligner that can handle the multi-mapping of HTS reads very efficiently. mrsFAST-Ultra improves mrsFAST, our first cache oblivious read aligner capable of handling multi-mapping reads, through new and compact index structures that reduce not only the overall memory usage but also the number of CPU operations per alignment. In fact the size of the index generated by mrsFAST-Ultra is 10 times smaller than that of mrsFAST. As importantly, mrsFAST-Ultra introduces new features such as being able to (i) obtain the best mapping loci for each read, and (ii) return all reads that have at most n mapping loci (within an error threshold), together with these loci, for any user specified n. Furthermore, mrsFAST-Ultra is SNP-aware, i.e. it can map reads to reference genome while discounting the mismatches that occur at common SNP locations provided by db-SNP; this significantly increases the number of reads that can be mapped to the reference genome. Notice that all of the above features are implemented within the index structure and are not simple post-processing steps and thus are performed highly efficiently. Finally, mrsFAST-Ultra utilizes multiple available cores and processors and can be tuned for various memory settings. Our results show that mrsFAST-Ultra is roughly five times faster than its predecessor mrsFAST. In comparison to newly enhanced popular tools such as Bowtie2, it is more sensitive (it can report 10 times or more mappings per read) and much faster (six times or more) in the multi-mapping mode. Furthermore, mrsFAST-Ultra has an index size of 2GB for the entire human reference genome, which is roughly half of that of Bowtie2. mrsFAST-Ultra is open source and it can be accessed at http://mrsfast.sourceforge.net. © 2014 The Author(s).",
                "authors": [
                    {
                        "name": "Hach F."
                    },
                    {
                        "name": "Sarrafi I."
                    },
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Alkan C."
                    },
                    {
                        "name": "Eichler E.E."
                    },
                    {
                        "name": "Sahinalp S.C."
                    }
                ],
                "citationCount": 25,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MrsFAST-Ultra: A compact, SNP-aware mapper for high performance sequencing applications"
            },
            "pmid": "24810850"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}