{
    "additionDate": "2018-07-26T14:38:19Z",
    "biotoolsCURIE": "biotools:ace_insect",
    "biotoolsID": "ace_insect",
    "credit": [
        {
            "email": "gdh19910309@outlook.com",
            "name": "Dianhao Guo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "luojiapeng1993@gmail.com",
            "name": "Jiapeng Luo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Efficient and sensitive tool to detect insecticide resistance-associated mutations in insect acetylcholinesterase from RNA-Seq data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genome.zju.edu.cn/software/ace/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                }
            ]
        }
    ],
    "homepage": "http://genome.zju.edu.cn/software/ace/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "ACE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1741-6",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Insecticide resistance is a substantial problem in controlling agricultural and medical pests. Detecting target site mutations is crucial to manage insecticide resistance. Though PCR-based methods have been widely used in this field, they are time-consuming and inefficient, and typically have a high false positive rate. Acetylcholinesterases (Ace) is the neural target of the widely used organophosphate (OP) and carbamate insecticides. However, there is not any software available to detect insecticide resistance associated mutations in RNA-Seq data at present. Results: A computational pipeline ACE was developed to detect resistance mutations of ace in insect RNA-Seq data. Known ace resistance mutations were collected and used as a reference. We constructed a Web server for ACE, and the standalone software in both Linux and Windows versions is available for download. ACE was used to analyse 971 RNA-Seq data from 136 studies in 7 insect pests. The mutation frequency of each RNA-Seq dataset was calculated. The results indicated that the resistance frequency was 30%-44% in an eastern Ugandan Anopheles population, thus suggesting this resistance-conferring mutation has reached high frequency in these mosquitoes in Uganda. Analyses of RNA-Seq data from the diamondback moth Plutella xylostella indicated that the G227A mutation was positively related with resistance levels to organophosphate or carbamate insecticides. The wasp Nasonia vitripennis had a low frequency of resistant reads (<5%), but the agricultural pests Chilo suppressalis and Bemisia tabaci had a high resistance frequency. All ace reads in the 30 B. tabaci RNA-Seq data were resistant reads, suggesting that insecticide resistance has spread to very high frequency in B. tabaci. Conclusions: To the best of our knowledge, the ACE pipeline is the first tool to detect resistance mutations from RNA-Seq data, and it facilitates the full utilization of large-scale genetic data obtained by using next-generation sequencing.",
                "authors": [
                    {
                        "name": "Guo D."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Xiao H."
                    },
                    {
                        "name": "He K."
                    },
                    {
                        "name": "Yin C."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Li F."
                    }
                ],
                "citationCount": 11,
                "date": "2017-07-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ACE: An efficient and sensitive tool to detect insecticide resistance-associated mutations in insect acetylcholinesterase from RNA-Seq data"
            },
            "pmcid": "PMC5504734",
            "pmid": "28693417"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}