{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T12:22:59Z",
    "biotoolsCURIE": "biotools:bpdrtdb",
    "biotoolsID": "bpdrtdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kokkatjohn@rediffmail.com",
            "name": "Johnson George Kokkat",
            "typeEntity": "Person"
        },
        {
            "email": "dinesh.kumar@icar.gov.in",
            "name": "Dinesh Kumar",
            "typeEntity": "Person"
        }
    ],
    "description": "Black Pepper Drought Transcriptome Database (BPDRTDb) catalogues all the genomic information like differential expressed genes, microsatellites, variants, transcriptional factors, pathways, domain and families of assembled transcriptome associated with root drought.",
    "download": [
        {
            "type": "Binaries",
            "url": "ftp://ftp.ncbi.nlm.nih.gov/blast/db/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://webtom.cabgrid.res.in/bpdrtdb/",
    "lastUpdate": "2021-02-06T16:24:46Z",
    "name": "BPDRTDb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/PPL.13308",
            "metadata": {
                "abstract": "© 2020 Scandinavian Plant Physiology SocietyBlack pepper (Piper nigrum L.; 2n = 52; Piperaceae), the king of spices, is a perennial, trailing woody flowering vine and has global importance with widespread dietary, medicinal, and preservative uses. It is an economically important germplasm cultivated for its fruit and the major cash crop in >30 tropical countries. Crop production is mainly affected by drought stress. The present study deals with the candidate gene identification from drought-affected black pepper leaf transcriptome generated by Illumina Hiseq2000. It also aims to mine putative molecular markers (namely SSRs, SNPs, and InDels) and generate primers for them. The identification of transcription factors and pathways involved in drought tolerance is also reported here. De novo transcriptome assembly was performed with trinity assembler. In total, 4914 differential expressed genes, 2110 transcriptional factors, 786 domains and 1137 families, 20,124 putative SSR markers, and 259,236 variants were identified. At2g30105 (unidentified gene containing leucine-rich repeats and ubiquitin-like domain), serine threonine protein kinase, Mitogen-activated protein kinase, Nucleotide Binding Site-Leucine Rich Repeat, Myeloblastosis-related proteins, basic helix–loop–helix are all found upregulated and are reported to be associated with plant tolerance against drought condition. All these information are catalogued in the Black Pepper Drought Transcriptome Database (BPDRTDb), freely accessible for academic use at http://webtom.cabgrid.res.in/bpdrtdb/. This database is a good foundation for the genetic improvement of pepper plants, breeding programmes, and mapping population of this crop. Putative markers can also be a reliable genomic resource to develop drought-tolerant variety for better black pepper productivity.",
                "authors": [
                    {
                        "name": "Negi A."
                    },
                    {
                        "name": "George Kokkat J."
                    },
                    {
                        "name": "Jasrotia R.S."
                    },
                    {
                        "name": "Madhavan S."
                    },
                    {
                        "name": "Jaiswal S."
                    },
                    {
                        "name": "Angadi U.B."
                    },
                    {
                        "name": "Iquebal M.A."
                    },
                    {
                        "name": "Kalathil Palliyarakkal M."
                    },
                    {
                        "name": "Palaniyandi U."
                    },
                    {
                        "name": "Rai A."
                    },
                    {
                        "name": "Kumar D."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Physiologia Plantarum",
                "title": "Drought responsiveness in black pepper (Piper nigrum L.): Genes associated and development of a web-genomic resource"
            },
            "pmid": "33305409"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}