{
    "additionDate": "2022-10-07T08:54:55.832934Z",
    "biotoolsCURIE": "biotools:cpxdeepmsa",
    "biotoolsID": "cpxdeepmsa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "njyudj@njust.edu.cn",
            "name": "Dong-Jun Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "cpxDeepMSA is a deep cascade algorithm to generate high-quality protein complex multiple sequence alignment with high quality, significant depth, a wide range of sequence sources, and strong generalization ability.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "https://zhanggroup.org/cpxDeepMSA/",
    "lastUpdate": "2022-10-07T08:54:55.835299Z",
    "license": "Not licensed",
    "name": "cpxDeepMSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/IJMS23158459",
            "metadata": {
                "abstract": "© 2022 by the authors.Protein–protein interactions (PPIs) are fundamental to many biological processes. The coevolution-based prediction of interacting residues has made great strides in protein complexes that are known to interact. A multiple sequence alignment (MSA) is the basis of coevolution analysis. MSAs have recently made significant progress in the protein monomer sequence analysis. However, no standard or efficient pipelines are available for the sensitive protein complex MSA (cpxMSA) collection. How to generate cpxMSA is one of the most challenging problems of sequence coevolution analysis. Although several methods have been developed to address this problem, no standalone program exists. Furthermore, the number of built-in properties is limited; hence, it is often difficult for users to analyze sequence coevolution according to their desired cpxMSA. In this article, we developed a novel cpxMSA approach (cpxDeepMSA. We used different protein monomer databases and incorporated the three strategies (genomic distance, phylogeny information, and STRING interaction network) used to join the monomer MSA results of protein complexes, which can prevent using a single method fail to the joint two-monomer MSA causing the cpxMSA construction failure. We anticipate that the cpxDeepMSA algorithm will become a useful high-throughput tool in protein complex structure predictions, inter-protein residue-residue contacts, and the biological sequence coevolution analysis.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Yu D.-J."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "cpxDeepMSA: A Deep Cascade Algorithm for Constructing Multiple Sequence Alignments of Protein–Protein Interactions"
            },
            "pmcid": "PMC9369210",
            "pmid": "35955594"
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
