
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://immersive-analytics.infotech.monash.edu/vanted/addons/fluxmap/copyright_contact.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://immersive-analytics.infotech.monash.edu/vanted/addons/fluxmap/download_installation_tutorial.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/fluxmap-1-13-visual-exploration-flux-distributions-biological-networks.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: The quantification of metabolic fluxes is gaining increasing importance in the analysis of the metabolic behavior of biological systems such as organisms, tissues or cells. Various methodologies (wetlab or drylab) result in sets of fluxes which require an appropriate visualization for interpretation by scientists. The visualization of flux distributions is a necessary prerequisite for intuitive flux data exploration in the context of metabolic networks.Results: We present FluxMap, a tool for the advanced visualization and exploration of flux data in the context of metabolic networks. The template-based flux data import assigns flux values and optional quality parameters (e. g. the confidence interval) to biochemical reactions. It supports the discrimination between mass and substance fluxes, such as C- or N-fluxes. After import, flux data mapping and network-based visualization allow the interactive exploration of the dataset. Various visualization options enable the user to adapt layout and network representation according to individual purposes.Conclusions: The Vanted add-on FluxMap comprises a comprehensive set of functionalities for visualization and advanced visual exploration of flux distributions in biological networks. It is available as a Java open source tool from http://www.vanted.org/fluxmap. © 2012 Rohn et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Rohn H.",
                "Hartmann A.",
                "Junker A.",
                "Junker B.H.",
                "Schreiber F."
            ],
            "cit_count": 24,
            "journal": "BMC Systems Biology",
            "pmid": "22548786",
            "title": "FluxMap: A VANTED add-on for the visual exploration of flux distributions in biological networks",
            "year": "2012-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fluxmap",
        "biotoolsID": "fluxmap",
        "description": "Easy to use tool for the advanced visualization of simulated or measured flux data in biological networks. Flux data import is achieved via a structured template basing on intuitive reaction equations. Flux data is mapped onto any network and visualized using edge thickness. Various visualization options and interaction possibilities enable comparison and visual analysis of complex experimental setups in an interactive way.",
        "homepage": "https://immersive-analytics.infotech.monash.edu/vanted/addons/fluxmap/",
        "name": "FluxMap"
    }
}