{
    "additionDate": "2017-08-03T18:51:58Z",
    "biotoolsCURIE": "biotools:multeesum",
    "biotoolsID": "multeesum",
    "credit": [
        {
            "email": "tmm@cs.ubc.ca",
            "name": "Tamara Munzner",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.utah.edu/~miriah/"
        }
    ],
    "description": "Visualization system that supports inspection and curation of data sets showing gene expression over time, in conjunction with the spatial location of the cells where the genes are expressed — it is the first tool to support comparisons across multiple such datasets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cs.utah.edu/~miriah/multeesum/usage/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.utah.edu/~miriah/multeesum/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/multeesum-visualize-comparison-cellular-gene-expression-profiles.html"
        }
    ],
    "name": "MulteeSum",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Cells in an organism share the same genetic information in their DNA, but have very different forms and behavior because of the selective expression of subsets of their genes. The widely used approach of measuring gene expression over time from a tissue sample using techniques such as microarrays or sequencing do not provide information about the spatial position within the tissue where these genes are expressed. In contrast, we are working with biologists who use techniques that measure gene expression in every individual cell of entire fruitfly embryos over an hour of their development, and do so for multiple closely-related subspecies of Drosophila. These scientists are faced with the challenge of integrating temporal gene expression data with the spatial location of cells and, moreover, comparing this data across multiple related species. We have worked with these biologists over the past two years to develop MulteeSum, a visualization system that supports inspection and curation of data sets showing gene expression over time, in conjunction with the spatial location of the cells where the genes are expressed - it is the first tool to support comparisons across multiple such data sets. MulteeSum is part of a general and flexible framework we developed with our collaborators that is built around multiple summaries for each cell, allowing the biologists to explore the results of computations that mix spatial information, gene expression measurements over time, and data from multiple related species or organisms. We justify our design decisions based on specific descriptions of the analysis needs of our collaborators, and provide anecdotal evidence of the efficacy of MulteeSum through a series of case studies. © 2006 IEEE.",
                "authors": [
                    {
                        "name": "Meyer M."
                    },
                    {
                        "name": "Munzner T."
                    },
                    {
                        "name": "DePace A."
                    },
                    {
                        "name": "Pfister H."
                    }
                ],
                "citationCount": 41,
                "date": "2010-11-12T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "MulteeSum: A tool for comparative spatial and temporal gene expression data"
            },
            "pmid": "20975127"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Embryology",
            "uri": "http://edamontology.org/topic_3065"
        }
    ],
    "validated": 1
}