{
    "additionDate": "2019-11-14T19:59:59Z",
    "biotoolsCURIE": "biotools:LSTD",
    "biotoolsID": "LSTD",
    "confidence_flag": "tool",
    "description": "Progressive Object Transfer Detection | LSTD: A Low-Shot Transfer Detector for Object Detection | Specifically, SSD acts as the region proposal network (RPN) in LSTD. Additionally, we propose Transfer Knowledge (TK) and Background Depression (BD) modules for transfer detection task. More details can be found in LSTD",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Cassie94/LSTD/tree/lstd",
    "lastUpdate": "2020-12-22T13:15:04Z",
    "name": "LSTD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TIP.2019.2938680",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.Recent development of object detection mainly depends on deep learning with large-scale benchmarks. However, collecting such fully-annotated data is often difficult or expensive for real-world applications, which restricts the power of deep neural networks in practice. Alternatively, humans can detect new objects with little annotation burden, since humans often use the prior knowledge to identify new objects with few elaborately-annotated examples, and subsequently generalize this capacity by exploiting objects from wild images. Inspired by this procedure of learning to detect, we propose a novel Progressive Object Transfer Detection (POTD) framework. Specifically, we make three main contributions in this paper. First, POTD can leverage various object supervision of different domains effectively into a progressive detection procedure. Via such human-like learning, one can boost a target detection task with few annotations. Second, POTD consists of two delicate transfer stages, i.e., Low-Shot Transfer Detection (LSTD), and Weakly-Supervised Transfer Detection (WSTD). In LSTD, we distill the implicit object knowledge of source detector to enhance target detector with few annotations. It can effectively warm up WSTD later on. In WSTD, we design a recurrent object labelling mechanism for learning to annotate weakly-labeled images. More importantly, we exploit the reliable object supervision from LSTD, which can further enhance the robustness of target detector in the WSTD stage. Finally, we perform extensive experiments on a number of challenging detection benchmarks with different settings. The results demonstrate that, our POTD outperforms the recent state-of-the-art approaches. The codes and models are available at https://github.com/Cassie94/LSTD/tree/lstd.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Bai X."
                    },
                    {
                        "name": "Qiao Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Progressive object transfer detection"
            },
            "pmid": "31502974"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}