{
    "additionDate": "2018-05-18T12:14:22Z",
    "biotoolsCURIE": "biotools:voromqa",
    "biotoolsID": "voromqa",
    "credit": [
        {
            "email": "kliment@ibt.lt",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Voronoi tessellation‐based Model Quality Assessment. Quality assessment of single protein structure models using inter-atomi contact areas derived from Voronoi diagram of atomic balls.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.ibt.lt/wtsam/voromqa/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "homepage": "http://www.bti.vu.lt/en/departments/department-of-bioinformatics/software/voromqa",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "VoroMQA",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1002/prot.25278",
            "metadata": {
                "abstract": "© 2017 Wiley Periodicals, Inc. In the absence of experimentally determined protein structure many biological questions can be addressed using computational structural models. However, the utility of protein structural models depends on their quality. Therefore, the estimation of the quality of predicted structures is an important problem. One of the approaches to this problem is the use of knowledge-based statistical potentials. Such methods typically rely on the statistics of distances and angles of residue-residue or atom-atom interactions collected from experimentally determined structures. Here, we present VoroMQA (Voronoi tessellation-based Model Quality Assessment), a new method for the estimation of protein structure quality. Our method combines the idea of statistical potentials with the use of interatomic contact areas instead of distances. Contact areas, derived using Voronoi tessellation of protein structure, are used to describe and seamlessly integrate both explicit interactions between protein atoms and implicit interactions of protein atoms with solvent. VoroMQA produces scores at atomic, residue, and global levels, all in the fixed range from 0 to 1. The method was tested on the CASP data and compared to several other single-model quality assessment methods. VoroMQA showed strong performance in the recognition of the native structure and in the structural model selection tests, thus demonstrating the efficacy of interatomic contact areas in estimating protein structure quality. The software implementation of VoroMQA is freely available as a standalone application and as a web server at http://bioinformatics.lt/software/voromqa. Proteins 2017; 85:1131–1145. © 2017 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Olechnovic K."
                    },
                    {
                        "name": "Venclovas C."
                    }
                ],
                "citationCount": 6,
                "date": "2017-06-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "VoroMQA: Assessment of protein structure quality using interatomic contact areas"
            },
            "pmid": "28263393"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}