{
    "additionDate": "2019-11-14T20:00:08Z",
    "biotoolsCURIE": "biotools:MethylMix_autogenerated",
    "biotoolsID": "MethylMix_autogenerated",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "doctorlihao@163.com",
            "name": "Hao Li",
            "typeEntity": "Person"
        },
        {
            "email": "quyiqing@sdu.edu.cn",
            "name": "Yi-Qing Qu",
            "orcidid": "https://orcid.org/0000-0002-9538-7601",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > NAME EQUAL TO (PUB. DIFFERENT) bio.tools/methylmix | > CORRECT NAME OF TOOL COULD ALSO BE 'LUAD', 'methylation-driven' | Methylation and transcriptome analysis reveal lung adenocarcinoma-specific diagnostic biomarkers | To install this package, start R and enter: | ## try http if https is not available | source(\"https://bioconductor.org/biocLite.R\") | MethylMix: Identifying methylation driven cancer genes | In most cases, you don't need to download the package archive at all | MethylMix is an algorithm implemented to identify hyper and hypomethylated genes for a disease",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.riken.jp/packages/3.1/bioc/html/MethylMix.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T20:00:08Z",
    "name": "MethylMix_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12967-019-2068-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: DNA methylation can regulate the role of long noncoding RNAs (lncRNAs) in the development of lung adenocarcinoma (LUAD). The present study aimed to identify methylation-driven lncRNAs and mRNAs as biomarkers in the prognosis of LUAD using bioinformatics analysis. Methods: Differentially expressed RNAs were obtained using the edge R package from 535 LUAD tissues and 59 adjacent non-LUAD tissues. Differentially methylated genes were obtained using the limma R package from 475 LUAD tissues and 32 adjacent non-LUAD tissues. Methylation-driven mRNA and lncRNA were obtained using the MethylMix R package from 465 LUAD tissues with matched DNA methylation and RNA expression and 32 non-LUAD tissues with DNA methylation. Gene ontology and ConsensusPathDB pathway analysis were performed to identify functional enrichment of methylation-driven mRNAs. Univariate and multivariate Cox regression analyses were performed to identify the independent effect of each variable for predicting the prognosis of LUAD. Kaplan-Meier curve analysis of DNA methylation and gene expression might provide potential prognostic biomarkers for LUAD patients. Results: A total of 99 methylation-driven mRNAs and 17 methylation-driven lncRNAs were obtained. Univariate and multivariate Cox regression analysis showed that 6 lncRNAs (FOXE1, HOXB13-AS1-2, VMO1, HIST1H3F, AJ003147.8, ASXL3) were retrieved to construct a predictive model associated with overall survival in LUAD patients. Combined DNA methylation and gene expression survival analysis revealed that 4 lncRNAs (AC023824.1, AF186192.1, LINC01354 and WASIR2) and 8 mRNAs (S1PR1, CCDC181, F2RL1, EFS, KLHDC9, MPV17L, GKN2, ITPRIPL1) might act as independent biomarkers for the prognosis of LUAD. Conclusions: Methylation-driven lncRNA and mRNA contribute to the survival of LUAD, and 4 lncRNAs and 8 mRNAs might be potential biomarkers for the prognosis of LUAD.",
                "authors": [
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Yang Y.-E."
                    },
                    {
                        "name": "Yin Y.-H."
                    },
                    {
                        "name": "Zhang M.-Y."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Qu Y.-Q."
                    }
                ],
                "citationCount": 5,
                "date": "2019-09-27T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Methylation and transcriptome analysis reveal lung adenocarcinoma-specific diagnostic biomarkers"
            },
            "pmcid": "PMC6764142",
            "pmid": "31558162"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}