
{
    "credit": [
        {
            "typeEntity": "Project",
            "typeRoles": [
                "Support"
            ],
            "url": "https://groups.google.com/forum/#!forum/clusterscan-support"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/pyrevo/ClusterScan/blob/master/README.md"
        },
        {
            "type": "TRAINING_MATERIAL",
            "url": "https://github.com/pyrevo/ClusterScan/wiki/ClusterScan-Tutorial"
        },
        {
            "type": "INSTALLATIONS_INSTRUCTIONS",
            "url": "https://github.com/pyrevo/ClusterScan/wiki/ClusterScan-Installation"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/pyrevo/ClusterScan"
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "R",
            "Python"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/pyrevo/ClusterScan/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2018. Published by Oxford University Press. All rights reserved. Summary Studies on gene clusters proved to be an excellent source of information to understand genomes evolution and identifying specific metabolic pathways or gene families. Improvements in sequencing methods have resulted in a large increase of sequenced genomes for which cluster annotation could be performed and standardized. Currently available programs are developed to search for specific cluster types and none of them is suitable for a broad range of user-based choices. We have developed ClusterScan which allows identifying clusters of any kind of feature simply based on their genomic coordinates and user-defined categorical annotations. Availability and implementation The tool is written in Python, distributed under the GNU General Public License (GPL) and available on Github at http://bit.ly/ClusterScan or as Docker image at sangeslab/clusterscan: latest. It is supported through a mailing-list on http://bit.ly/ClusterScanSupport. Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Volpe M.",
                "Miralto M.",
                "Gustincich S.",
                "Sanges R."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty486",
            "journal": "Bioinformatics",
            "title": "ClusterScan: Simple and generalistic identification of genomic clusters",
            "type": "Method",
            "year": "2018-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ClusterScan",
        "biotoolsID": "ClusterScan",
        "description": "ClusterScan is a tool to search for genomic clusters starting from genomic feature locations and their annotations. It allows the user to scan an annotation file (BED format with locations of specific features such as gene, transcripts, regulatory regions or anything that can be mapped on a genome) and get clusters coordinates in output. In order to build annotated clusters, ClusterScan needs an additional two-columns file, storing the feature ids and the corresponding categorical information (such as Gene Ontology classes, KEGG, Pfam accessions, etc).",
        "homepage": "https://github.com/pyrevo/ClusterScan",
        "name": "ClusterScan"
    }
}