{
    "additionDate": "2021-11-29T10:35:21.882555Z",
    "biotoolsCURIE": "biotools:riboa",
    "biotoolsID": "riboa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "epo2@psu.edu",
            "name": "Edward P. O’Brien",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RiboA (Ribo-Seq A-site Identifier) is a web application to identify ribosome A-site locations in ribosome profiling data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/obrien-lab/aip_web_docker",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-11-29T10:35:21.885152Z",
    "license": "MIT",
    "name": "RiboA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04068-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Translation is a fundamental process in gene expression. Ribosome profiling is a method that enables the study of transcriptome-wide translation. A fundamental, technical challenge in analyzing Ribo-Seq data is identifying the A-site location on ribosome-protected mRNA fragments. Identification of the A-site is essential as it is at this location on the ribosome where a codon is translated into an amino acid. Incorrect assignment of a read to the A-site can lead to lower signal-to-noise ratio and loss of correlations necessary to understand the molecular factors influencing translation. Therefore, an easy-to-use and accurate analysis tool is needed to accurately identify the A-site locations. Results: We present RiboA, a web application that identifies the most accurate A-site location on a ribosome-protected mRNA fragment and generates the A-site read density profiles. It uses an Integer Programming method that reflects the biological fact that the A-site of actively translating ribosomes is generally located between the second codon and stop codon of a transcript, and utilizes a wide range of mRNA fragment sizes in and around the coding sequence (CDS). The web application is containerized with Docker, and it can be easily ported across platforms. Conclusions: The Integer Programming method that RiboA utilizes is the most accurate in identifying the A-site on Ribo-Seq mRNA fragments compared to other methods. RiboA makes it easier for the community to use this method via a user-friendly and portable web application. In addition, RiboA supports reproducible analyses by tracking all the input datasets and parameters, and it provides enhanced visualization to facilitate scientific exploration. RiboA is available as a web service at https://a-site.vmhost.psu.edu/. The code is publicly available at https://github.com/obrien-lab/aip_web_docker under the MIT license.",
                "authors": [
                    {
                        "name": "Ahmed N."
                    },
                    {
                        "name": "O'Brien E.P."
                    },
                    {
                        "name": "Shao D."
                    },
                    {
                        "name": "Soni N."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RiboA: a web application to identify ribosome A-site locations in ribosome profiling data"
            },
            "pmcid": "PMC7992832",
            "pmid": "33765913",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
