
{
    "credit": [
        {
            "email": "dynamicproteomics@gmail.com",
            "name": "DynamicProteomics Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.weizmann.ac.il/mcb/UriAlon/DynamProt/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                },
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Recent advances allow tracking the levels and locations of a thousand proteins in individual living human cells over time using a library of annotated reporter cell clones (LARC). This library was created by Cohen et al. to study the proteome dynamics of a human lung carcinoma cell-line treated with an anti-cancer drug. Here, we report the Dynamic Proteomics database for the proteins studied by Cohen et al. Each cell-line clone in LARC has a protein tagged with yellow fluorescent protein, expressed from its endogenous chromosomal location, under its natural regulation. The Dynamic Proteomics interface facilitates searches for genes of interest, downloads of protein fluorescent movies and alignments of dynamics following drug addition. Each protein in the database is displayed with its annotation, cDNA sequence, fluorescent images and movies obtained by the time-lapse microscopy. The protein dynamics in the database represents a quantitative trace of the protein fluorescence levels in nucleus and cytoplasm produced by image analysis of movies over time. Furthermore, a sequence analysis provides a search and comparison of up to 50 input DNA sequences with all cDNAs in the library. The raw movies may be useful as a benchmark for developing image analysis tools for individual-cell dynamic-proteomics. The database is available at http://www.dynamicproteomics.net/. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Frenkel-Morgenstern M.",
                "Cohen A.A.",
                "Geva-Zatorsky N.",
                "Eden E.",
                "Prilusky J.",
                "Issaeva I.",
                "Sigal A.",
                "Cohen-Saidon C.",
                "Liron Y.",
                "Cohen L.",
                "Danon T.",
                "Perzov N.",
                "Alon U."
            ],
            "cit_count": 17,
            "journal": "Nucleic Acids Research",
            "pmid": "19820112",
            "title": "Dynamic proteomics: A database for dynamics and localizations of endogenous fluorescently-tagged proteins in living human cells",
            "year": "2009-10-09"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dynamicproteomics_db",
        "biotoolsID": "dynamicproteomics_db",
        "description": "Dynamic Proteomics database contains information on the position and amounts of endogenous proteins in individual living human cells. This is based on the Library of Annotated Reporter Cell-clones (LARC). The Dynamic Proteomics interface facilitates searches for genes of interest, downloads of protein fluorescent movies and alignments of dynamics following drug addition.",
        "homepage": "http://www.weizmann.ac.il/mcb/UriAlon/DynamProt/",
        "name": "DynamicProteomics DB"
    }
}