{
    "additionDate": "2020-01-09T18:06:19Z",
    "biotoolsCURIE": "biotools:OncoPPi",
    "biotoolsID": "OncoPPi",
    "confidence_flag": "tool",
    "description": "Explore Protein-Protein Interactions for Cancer Target Discovery Using the OncoPPi Portal.\n\nTranslating Genomics Data into Protein-Protein Interaction Networks for Therapeutic Manipulation.\n\nThis site provides a platform to facilitate discovery of new mechanisms to control tumorigenesis through the integration of genomic, pharmacological, clinical, and structural data with the network of cancer-associated protein-protein interactions experimentally detected in cancer cells.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://oncoppi.emory.edu",
    "lastUpdate": "2021-01-04T13:35:33Z",
    "name": "OncoPPi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9873-9_12",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.Protein–protein interactions (PPIs) control all functions and physiological states of the cell. Identification and understanding of novel PPIs would facilitate the discovery of new biological models and therapeutic targets for clinical intervention. Numerous resources and PPI databases have been developed to define a global interactome through the PPI data mining, curation, and integration of different types of experimental evidence obtained with various methods in different model systems. On the other hand, the recent advances in cancer genomics and proteomics have revealed a critical role of genomic alterations in acquisition of cancer hallmarks through a dysregulated network of oncogenic PPIs. Deciphering of cancer-specific interactome would uncover new mechanisms of oncogenic signaling for therapeutic interrogation. Toward this goal our team has developed a high-throughput screening platform to detect PPIs between cancer-associated proteins in the context of cancer cells. The established network of oncogenic PPIs, termed the OncoPPi network, is available through the OncoPPi Portal, an interactive web resource that allows to access and interpret a high-quality cancer-focused network of PPIs experimentally detected in cancer cell lines integrated with the analysis of mutual exclusivity of genomic alterations, cellular co-localization of interacting proteins, domain-domain interactions, and therapeutic connectivity. This chapter presents a guide to explore the OncoPPi network using the OncoPPi Portal to facilitate cancer biology.",
                "authors": [
                    {
                        "name": "Ivanov A.A."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Explore protein–protein interactions for cancer target discovery using the oncoPPi portal"
            },
            "pmid": "31583637"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}