{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T08:45:33Z",
    "biotoolsCURIE": "biotools:rMSIKeyIon",
    "biotoolsID": "rMSIKeyIon",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "esteban.delcastillo@urv.cat",
            "name": "Esteban del Castillo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Ion Filtering R Package for Untargeted Analysis of Metabolomic LDI-MS Images.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/LlucSF/rMSIKeyIon/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LlucSF/rMSIKeyIon",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/LlucSF/rMSIKeyIon/issues"
        }
    ],
    "maturity": "Mature",
    "name": "rMSIKeyIon",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.3390/metabo9080162",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Many MALDI-MS imaging experiments make a case versus control studies of different tissue regions in order to highlight significant compounds affected by the variables of study. This is a challenge because the tissue samples to be compared come from different biological entities, and therefore they exhibit high variability. Moreover, the statistical tests available cannot properly compare ion concentrations in two regions of interest (ROIs) within or between images. The high correlation between the ion concentrations due to the existence of different morphological regions in the tissue means that the common statistical tests used in metabolomics experiments cannot be applied. Another difficulty with the reliability of statistical tests is the elevated number of undetected MS ions in a high percentage of pixels. In this study, we report a procedure for discovering the most important ions in the comparison of a pair of ROIs within or between tissue sections. These ROIs were identified by an unsupervised segmentation process, using the popular k-means algorithm. Our ion filtering algorithm aims to find the up or down-regulated ions between two ROIs by using a combination of three parameters: (a) the percentage of pixels in which a particular ion is not detected, (b) the Mann–Whitney U ion concentration test, and (c) the ion concentration fold-change. The undetected MS signals (null peaks) are discarded from the histogram before the calculation of (b) and (c) parameters. With this methodology, we found the important ions between the different segments of a mouse brain tissue sagittal section and determined some lipid compounds (mainly triacylglycerols and phosphatidylcholines) in the liver of mice exposed to thirdhand smoke.",
                "authors": [
                    {
                        "name": "Del Castillo E."
                    },
                    {
                        "name": "Semente L."
                    },
                    {
                        "name": "Torres S."
                    },
                    {
                        "name": "Rafols P."
                    },
                    {
                        "name": "Ramirez N."
                    },
                    {
                        "name": "Martins-Green M."
                    },
                    {
                        "name": "Santafe M."
                    },
                    {
                        "name": "Correig X."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "RMsikeyion: An ion filtering r package for untargeted analysis of metabolomic LDI-MS images"
            },
            "pmid": "31382415",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}