{
    "accessibility": "Open access",
    "additionDate": "2022-06-11T12:54:03.902618Z",
    "biotoolsCURIE": "biotools:deepmgt-dti",
    "biotoolsID": "deepmgt-dti",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhangpl109@163.com",
            "name": "Peiliang Zhang"
        }
    ],
    "description": "Transformer network incorporating multilayer graph information for Drug-Target interaction prediction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangpl109/DeepMGT-DTI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-11T12:54:03.905108Z",
    "license": "Not licensed",
    "name": "DeepMGT-DTI",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2022.105214",
            "metadata": {
                "abstract": "© 2022Drug–target interaction (DTI) prediction reduces the cost and time of drug development, and plays a vital role in drug discovery. However, most of research does not fully explore the molecular structures of drug compounds in DTI prediction. To this end, we propose a deep learning model to capture the molecular structure information of drug compounds for DTI prediction. This model utilizes a transformer network incorporating multilayer graph information, which captures the features of a drug's molecular structure so that the interactions between atoms of drug compounds can be explored more deeply. At the same time, a convolutional neural network is employed to capture the local residue information in the target sequence, and effectively extract the feature information of the target. The experiments on the DrugBank dataset showed that the proposed model outperformed previous models based on the structure of target sequences. The results indicate that the improved transformer network fuses the feature information between layers in the graph convolutional neural network and extracts the interaction data for the molecular structure. The drug repositioning experiment on COVID-19 and Alzheimer's disease demonstrated the proposed model's ability to find therapeutic drugs in drug discovery. The code of our model is available at https://github.com/zhangpl109/DeepMGT-DTI.",
                "authors": [
                    {
                        "name": "Che C."
                    },
                    {
                        "name": "Jin B."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "citationCount": 1,
                "date": "2022-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DeepMGT-DTI: Transformer network incorporating multilayer graph information for Drug–Target interaction prediction"
            },
            "pmid": "35030496"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
