{
    "additionDate": "2017-08-03T18:44:26Z",
    "biotoolsCURIE": "biotools:gmql",
    "biotoolsID": "gmql",
    "credit": [
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/contacts.html"
        }
    ],
    "description": "Next-generation query language for querying NGS data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/documentation.html"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-POLIMI"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/index.html",
    "language": [
        "Racket"
    ],
    "lastUpdate": "2023-12-03T20:13:25.388085Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gmql-1-0-1-genometric-query-language.html"
        }
    ],
    "name": "GMQL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1016/j.ymeth.2016.09.002",
            "metadata": {
                "abstract": "While a huge amount of (epi)genomic data of multiple types is becoming available by using Next Generation Sequencing (NGS) technologies, the most important emerging problem is the so-called tertiary analysis, concerned with sense making, e.g., discovering how different (epi)genomic regions and their products interact and cooperate with each other. We propose a paradigm shift in tertiary analysis, based on the use of the Genomic Data Model (GDM), a simple data model which links genomic feature data to their associated experimental, biological and clinical metadata. GDM encompasses all the data formats which have been produced for feature extraction from (epi)genomic datasets. We specifically describe the mapping to GDM of SAM (Sequence Alignment/Map), VCF (Variant Call Format), NARROWPEAK (for called peaks produced by NGS ChIP-seq or DNase-seq methods), and BED (Browser Extensible Data) formats, but GDM supports as well all the formats describing experimental datasets (e.g., including copy number variations, DNA somatic mutations, or gene expressions) and annotations (e.g., regarding transcription start sites, genes, enhancers or CpG islands). We downloaded and integrated samples of all the above-mentioned data types and formats from multiple sources. The GDM is able to homogeneously describe semantically heterogeneous data and makes the ground for providing data interoperability, e.g., achieved through the GenoMetric Query Language (GMQL), a high-level, declarative query language for genomic big data. The combined use of the data model and the query language allows comprehensive processing of multiple heterogeneous data, and supports the development of domain-specific data-driven computations and bio-molecular knowledge discovery.",
                "authors": [
                    {
                        "name": "Ceri S."
                    },
                    {
                        "name": "Kaitoua A."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Pinoli P."
                    }
                ],
                "citationCount": 41,
                "date": "2016-12-01T00:00:00Z",
                "journal": "Methods",
                "title": "Modeling and interoperability of heterogeneous genomic big data for integrative processing and querying"
            }
        },
        {
            "doi": "10.1093/bioinformatics/bty688",
            "metadata": {
                "abstract": "Motivation We previously proposed a paradigm shift in genomic data management, based on the Genomic Data Model (GDM) for mediating existing data formats and on the GenoMetric Query Language (GMQL) for supporting, at a high level of abstraction, data extraction and the most common data-driven computations required by tertiary data analysis of Next Generation Sequencing datasets. Here, we present a new GMQL-based system with enhanced accessibility, portability, scalability and performance. Results The new system has a well-designed modular architecture featuring: (i) an intermediate representation supporting many different implementations (including Spark, Flink and SciDB); (ii) a high-level technology-independent repository abstraction, supporting different repository technologies (e.g., local file system, Hadoop File System, database or others); (iii) several system interfaces, including a user-friendly Web-based interface, a Web Service interface, and a programmatic interface for Python language. Biological use case examples, using public ENCODE, Roadmap Epigenomics and TCGA datasets, demonstrate the relevance of our work.",
                "authors": [
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Ceri S."
                    },
                    {
                        "name": "Gulino A."
                    },
                    {
                        "name": "Horlova O."
                    },
                    {
                        "name": "Kaitoua A."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Nanni L."
                    },
                    {
                        "name": "Perna S."
                    },
                    {
                        "name": "Pinoli P."
                    },
                    {
                        "name": "Stamoulakatou E."
                    }
                ],
                "citationCount": 43,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Processing of big heterogeneous genomic datasets for tertiary analysis of Next Generation Sequencing data"
            }
        },
        {
            "metadata": {
                "abstract": "Motivation: Improvement of sequencing technologies and data processing pipelines is rapidly providing sequencing data, with associated high-level features, of many individual genomes in multiple biological and clinical conditions. They allow for data-driven genomic, transcriptomic and epigenomic characterizations, but require state-of-the-art 'big data' computing strategies, with abstraction levels beyond available tool capabilities. Results: We propose a high-level, declarative GenoMetric Query Language (GMQL) and a toolkit for its use. GMQL operates downstream of raw data preprocessing pipelines and supports queries over thousands of heterogeneous datasets and samples; as such it is key to genomic 'big data' analysis. GMQL leverages a simple data model that provides both abstractions of genomic region data and associated experimental, biological and clinical metadata and interoperability between many data formats. Based on Hadoop framework and Apache Pig platform, GMQL ensures high scalability, expressivity, flexibility and simplicity of use, as demonstrated by several biological query examples on ENCODE and TCGA datasets.",
                "authors": [
                    {
                        "name": "Ceri S."
                    },
                    {
                        "name": "Jalili V."
                    },
                    {
                        "name": "Kaitoua A."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Muller H."
                    },
                    {
                        "name": "Palluzzi F."
                    },
                    {
                        "name": "Pinoli P."
                    },
                    {
                        "name": "Venco F."
                    }
                ],
                "citationCount": 79,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GenoMetric Query Language: A novel approach to large-scale genomic data management"
            },
            "pmid": "25649616"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
