
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/contacts.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/documentation.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Racket"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gmql-1-0-1-genometric-query-language.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: Improvement of sequencing technologies and data processing pipelines is rapidly providing sequencing data, with associated high-level features, of many individual genomes in multiple biological and clinical conditions. They allow for data-driven genomic, transcriptomic and epigenomic characterizations, but require state-of-the-art 'big data' computing strategies, with abstraction levels beyond available tool capabilities. Results: We propose a high-level, declarative GenoMetric Query Language (GMQL) and a toolkit for its use. GMQL operates downstream of raw data preprocessing pipelines and supports queries over thousands of heterogeneous datasets and samples; as such it is key to genomic 'big data' analysis. GMQL leverages a simple data model that provides both abstractions of genomic region data and associated experimental, biological and clinical metadata and interoperability between many data formats. Based on Hadoop framework and Apache Pig platform, GMQL ensures high scalability, expressivity, flexibility and simplicity of use, as demonstrated by several biological query examples on ENCODE and TCGA datasets.",
            "authors": [
                "Masseroli M.",
                "Pinoli P.",
                "Venco F.",
                "Kaitoua A.",
                "Jalili V.",
                "Palluzzi F.",
                "Muller H.",
                "Ceri S."
            ],
            "cit_count": 35,
            "journal": "Bioinformatics",
            "pmid": "25649616",
            "title": "GenoMetric Query Language: A novel approach to large-scale genomic data management",
            "year": "2015-06-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gmql",
        "biotoolsID": "gmql",
        "description": "Next-generation query language for querying NGS data.",
        "homepage": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/index.html",
        "name": "GMQL"
    }
}