
{
    "credit": [
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/hernanchavezthielemann/GRO2LAM/blob/27ene19/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/hernanchavezthielemann/GRO2LAM/releases"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "license": "MIT",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Biomaterials",
                "uri": "http://edamontology.org/topic_3368"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/hernanchavezthielemann/GRO2LAM/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019, Springer-Verlag GmbH Germany, part of Springer Nature.Atomistic simulations have progressively attracted attention in the study of physical-chemical properties of innovative nanomaterials. GROMACS and LAMMPS are currently the most widespread open-source software for molecular dynamics simulations thanks to their good flexibility, numerous functionalities and responsive community support. Nevertheless, the very different formats adopted for input and output files are limiting the possibility to transfer GROMACS simulations to LAMMPS. In this article, we present GRO2LAM, a modular and open-source Python 2.7 code for rapidly translating input files and parameters from GROMACS to LAMMPS format. The robustness of the tool has been assessed by comparing the simulation results obtained by GROMACS and LAMMPS, after the format conversion by GRO2LAM. Specifically, three nanoscale configurations of interest in both engineering and biomedical fields are studied, namely a carbon nanotube, an iron oxide nanoparticle, and a protein immersed in water. In perspective, GRO2LAM may be the first step to achieve a full interoperability between molecular dynamics software. This would allow to easily exploit their complementary potentialities and post-processing functionalities. Moreover, GRO2LAM could facilitate the cross-check of simulation results, guaranteeing the reproducibility of molecular dynamics models and testing their robustness. [Figure not available: see fulltext.].",
            "authors": [
                "Chavez Thielemann H.",
                "Cardellini A.",
                "Fasano M.",
                "Bergamasco L.",
                "Alberghini M.",
                "Ciorra G.",
                "Chiavazzo E.",
                "Asinari P."
            ],
            "cit_count": 0,
            "doi": "10.1007/S00894-019-4011-X",
            "journal": "Journal of Molecular Modeling",
            "pmid": "31065808",
            "title": "From GROMACS to LAMMPS: GRO2LAM: A converter for molecular dynamics software",
            "type": "Primary",
            "year": "2019-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:GRO2LAM",
        "biotoolsID": "GRO2LAM",
        "description": "GROMACS to LAMMPS  (GRO2LAM) - converter for molecular dynamics software.",
        "homepage": "https://github.com/hernanchavezthielemann/GRO2LAM",
        "name": "GRO2LAM"
    }
}