
{
    "credit": [
        {
            "email": "kate.eason@icr.ac.uk",
            "name": "Kate Eason",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/syspremed/polyClustR/blob/master/README.md"
        },
        {
            "type": "User manual",
            "url": "https://github.com/syspremed/polyClustR/blob/master/README.Rmd"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Cancer",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Background: To ensure cancer patients are stratified towards treatments that are optimally beneficial, it is a priority to define robust molecular subtypes using clustering methods applied to high-dimensional biological data. If each of these methods produces different numbers of clusters for the same data, it is difficult to achieve an optimal solution. Here, we introduce \"polyClustR\", a tool that reconciles clusters identified by different methods into subtype \"communities\" using a hypergeometric test or a measure of relative proportion of common samples. Results: The polyClustR pipeline was initially tested using a breast cancer dataset to demonstrate how results are compatible with and add to the understanding of this well-characterised cancer. Two uveal melanoma datasets were then utilised to identify and validate novel subtype communities with significant metastasis-free prognostic differences and associations with known chromosomal aberrations. Conclusion: We demonstrate the value of the polyClustR approach of applying multiple consensus clustering algorithms and systematically reconciling the results in identifying novel subtype communities of two cancer types, which nevertheless are compatible with established understanding of these diseases. An R implementation of the pipeline is available at: https://github.com/syspremed/polyClustR",
            "authors": [
                "Eason K.",
                "Nyamundanda G.",
                "Sadanandam A."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12859-018-2204-4",
            "journal": "BMC Bioinformatics",
            "title": "polyClustR: Defining communities of reconciled cancer subtypes with biological and prognostic significance",
            "type": "Primary",
            "year": "2018-05-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:polyclustr",
        "biotoolsID": "polyclustr",
        "description": "It is a pipeline to reconcile cluster solutions from multiple clustering algorithms.\n    It allows the user to apply multiple clustering algorithms to a dataset, then performs multiple reconciliations to understand the relationships between the solutions.",
        "homepage": "https://github.com/syspremed/polyClustR",
        "name": "polyClustR",
        "version": [
            "0.1.0"
        ]
    }
}