
{
    "credit": [
        {
            "email": "Mark.Gerstein@yale.edu",
            "name": "Mark B. Gerstein",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://sv.gersteinlab.org/breakseq/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA structural variation",
                "uri": "http://edamontology.org/topic_3175"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Structural variants (SVs) are a major source of human genomic variation; however, characterizing them at nucleotide resolution remains challenging. Here we assemble a library of breakpoints at nucleotide resolution from collating and standardizing ∼2,000 published SVs. For each breakpoint, we infer its ancestral state (through comparison to primate genomes) and its mechanism of formation (e.g., nonallelic homologous recombination, NAHR). We characterize breakpoint sequences with respect to genomic landmarks, chromosomal location, sequence motifs and physical properties, finding that the occurrence of insertions and deletions is more balanced than previously reported and that NAHR-formed breakpoints are associated with relatively rigid, stable DNA helices. Finally, we demonstrate an approach, BreakSeq, for scanning the reads from short-read sequenced genomes against our breakpoint library to accurately identify previously overlooked SVs, which we then validate by PCR. As new data become available, we expect our BreakSeq approach will become more sensitive and facilitate rapid SV genotyping of personal genomes. © 2010 Nature America, Inc. All rights reserved.",
            "authors": [
                "Lam H.Y.K.",
                "Mu X.J.",
                "Stutz A.M.",
                "Tanzer A.",
                "Cayting P.D.",
                "Snyder M.",
                "Kim P.M.",
                "Korbel J.O.",
                "Gerstein M.B."
            ],
            "cit_count": 96,
            "journal": "Nature Biotechnology",
            "pmid": "20037582",
            "title": "Nucleotide-resolution analysis of structural variants using BreakSeq and a breakpoint library",
            "year": "2010-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:breakseq",
        "biotoolsID": "breakseq",
        "description": "Database of known human breakpoint junctions and software to search short reads against them.",
        "homepage": "http://sv.gersteinlab.org/breakseq/",
        "name": "BreakSeq"
    }
}