{
    "additionDate": "2024-06-18T14:27:59.777332Z",
    "biotoolsCURIE": "biotools:tcmnpas",
    "biotoolsID": "tcmnpas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yangpluszhu@sina.com",
            "name": "Ming Yang",
            "orcidid": "https://orcid.org/0000-0001-8246-4797",
            "typeEntity": "Person"
        },
        {
            "email": "may7679@163.com",
            "name": "Shiyu Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive analysis platform integrating network formulaology and network pharmacology for exploring traditional Chinese medicine.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://54.223.75.62:3838/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:53:58.973398Z",
    "name": "TCMNPAS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13020-024-00924-y",
            "metadata": {
                "abstract": "The application of network formulaology and network pharmacology has significantly advanced the scientific understanding of traditional Chinese medicine (TCM) treatment mechanisms in disease. The field of herbal biology is experiencing a surge in data generation. However, researchers are encountering challenges due to the fragmented nature of the data and the reliance on programming tools for data analysis. We have developed TCMNPAS, a comprehensive analysis platform that integrates network formularology and network pharmacology. This platform is designed to investigate in-depth the compatibility characteristics of TCM formulas and their potential molecular mechanisms. TCMNPAS incorporates multiple resources and offers a range of functions designed for automated analysis implementation, including prescription mining, molecular docking, network pharmacology analysis, and visualization. These functions enable researchers to analyze and obtain core herbs and core formulas from herbal prescription data through prescription mining. Additionally, TCMNPAS facilitates virtual screening of active compounds in TCM and its formulas through batch molecular docking, allowing for the rapid construction and analysis of networks associated with “herb-compound-target-pathway” and disease targets. Built upon the integrated analysis concept of network formulaology and network pharmacology, TCMNPAS enables quick point-and-click completion of network-based association analysis, spanning from core formula mining from clinical data to the exploration of therapeutic targets for disease treatment. TCMNPAS serves as a powerful platform for uncovering the combinatorial rules and mechanism of TCM formulas holistically. We distribute TCMNPAS within an open-source R package at GitHub (https://github.com/yangpluszhu/tcmnpas), and the project is freely available at http://54.223.75.62:3838/.",
                "authors": [
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Ding N."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Ma S."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zheng P."
                    }
                ],
                "citationCount": 2,
                "date": "2024-12-01T00:00:00Z",
                "journal": "Chinese Medicine (United Kingdom)",
                "title": "TCMNPAS: a comprehensive analysis platform integrating network formulaology and network pharmacology for exploring traditional Chinese medicine"
            },
            "pmcid": "PMC10958928",
            "pmid": "38519956"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ]
}
