{
    "additionDate": "2018-10-02T12:21:58Z",
    "biotoolsCURIE": "biotools:dipcheck",
    "biotoolsID": "dipcheck",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cluster.embl-hamburg.de/cgi-bin/dipcheck/dipcheck.cgi"
        }
    ],
    "description": "DipCheck is a validation tool for the evaluation of protein backbone geometry, developed by Joana Pereira and Victor Lamzin at the EMBL Hamburg.\n\nThe tool uses a Euclidian 3D space (DipSpace) of the orthogonal descriptors of the geometry of a 5-atom dipeptide unit: CAi-1-Oi-1-CAi-Oi-CAi+1. The DipSpace database contains 1,024,000 data points derived from well-refined structures deposited in the PDB.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein geometry validation",
                    "uri": "http://edamontology.org/operation_1844"
                }
            ]
        }
    ],
    "homepage": "http://cluster.embl-hamburg.de/cgi-bin/dipcheck/dipcheck.cgi",
    "lastUpdate": "2024-11-25T14:27:18.996143Z",
    "maturity": "Mature",
    "name": "Dipcheck",
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1107/s2052252517008466",
            "metadata": {
                "abstract": "Understanding the protein main-chain conformational space forms the basis for the modelling of protein structures and for the validation of models derived from structural biology techniques. Presented here is a novel idea for a three-dimensional distance geometry-based metric to account for the fine details of protein backbone conformations. The metrics are computed for dipeptide units, defined as blocks of C α i-1 - O i-1 - C α i - O i - C α i+1 atoms, by obtaining the eigenvalues of their Euclidean distance matrices. These were computed for ∼1.3 million dipeptide units collected from nonredundant good-quality structures in the Protein Data Bank and subjected to principal component analysis. The resulting new Euclidean orthogonal three-dimensional space (DipSpace) allows a probabilistic description of protein backbone geometry. The three axes of the DipSpace describe the local extension of the dipeptide unit structure, its twist and its bend. By using a higher-dimensional metric, the method is efficient for the identification of C α atoms in an unlikely or unusual geometrical environment, and its use for both local and overall validation of protein models is demonstrated. It is also shown, for the example of trypsin proteases, that the detection of unusual conformations that are conserved among the structures of this protein family may indicate geometrically strained residues of potentially functional importance.",
                "authors": [
                    {
                        "name": "Lamzin V.S."
                    },
                    {
                        "name": "Pereira J."
                    }
                ],
                "citationCount": 12,
                "date": "2017-01-01T00:00:00Z",
                "journal": "IUCrJ",
                "title": "A distance geometry-based description and validation of protein main-chain conformation"
            },
            "pmcid": "PMC5619857",
            "pmid": "28989721"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1
}
