{
    "additionDate": "2018-07-29T08:47:59Z",
    "biotoolsCURIE": "biotools:fnbtools",
    "biotoolsID": "fnbtools",
    "credit": [
        {
            "email": "jwen@noble.org",
            "name": "Jiangqi Wen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "lsun@noble.org",
            "name": "Liang Sun",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software to Identify Homozygous Lesions in Deletion Mutant Populations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/noble-research-institute/fnbtools"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/noble-research-institute/fnbtools",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-10-14T08:51:40.221506Z",
    "name": "FNBtools",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "keke2",
    "publication": [
        {
            "doi": "10.3389/fpls.2018.00976",
            "metadata": {
                "abstract": "© 2018 Sun, Ge, Bancroft, Cheng and Wen.Deletion mutagenesis such as fast neutron bombardment (FNB) has been widely used for forward and reverse genetics studies in functional genomics. Traditionally, the time-consuming map-based cloning is used to locate causal deletions in deletion mutants. In recent years, comparative genomic hybridization (CGH) has been used to speed up and scale up the lesion identification process in deletion mutants. However, limitations of low accuracy and sensitivity for small deletions in the CGH approach are apparent. With the next generation sequencing (NGS) becoming affordable for most users, NGS-based bioinformatics tools are more appealing. Although several deletion callers are available, these tools are not efficient in detecting small deletions. Population-scale deletion callers that can identify both small and large deletions are rare. We were motivated to create a population-scale deletion detection tool, called FNBtools, to identify homozygous causal deletions in mutant populations by using NGS data. FNBtools is a tool to call deletions at a population-scale and to achieve high accuracy at different levels of coverage. In addition, FNBtools can detect both small and large deletions with the ability to identify unique deletions in a mutant pool by filtering deletions that exist in a wild-type or control pool. Furthermore, FNBtools is also able to visualize all identified deletions in a genome-wide scope by using Circos. From simulated data analysis, FNBtools outperforms four existing popular deletion callers in detecting small deletions at different coverage levels. To test the usefulness of FNBtools in real biological applications, we used it to analyze a salt-tolerant mutant in Medicago truncatula and identified the unique deletion locus that is tightly linked with this trait. The causal deletion in the mutant was confirmed by PCR amplification, sequencing and genetic linkage analyses. FNBtools can be used for homozygous deletion identification in any species with reference genome sequences. FNBtools is publicly available at: https://github.com/noble-research-institute/fnbtools.",
                "authors": [
                    {
                        "name": "Bancroft A.C."
                    },
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Ge Y."
                    },
                    {
                        "name": "Sun L."
                    },
                    {
                        "name": "Wen J."
                    }
                ],
                "citationCount": 3,
                "date": "2018-07-10T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "FNBtools: A software to identify homozygous lesions in deletion mutant populations"
            },
            "pmcid": "PMC6048286",
            "pmid": "30042776"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
