{
    "additionDate": "2017-12-18T00:12:49Z",
    "biotoolsCURIE": "biotools:stac",
    "biotoolsID": "stac",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cbil.upenn.edu/"
        }
    ],
    "description": "Method for testing the significance of DNA copy number aberrations across multiple array-CGH experiments. It utilizes two complementary statistics in combination with a novel search strategy. The significance of both statistics is assessed, and P-values are assigned to each location on the genome by using a multiple testing corrected permutation approach.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cbil.upenn.edu/STAC/doc/1.1/STAC_Station_users-guide.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.cbil.upenn.edu/STAC/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-01-17T22:26:33Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/stac-1-2-significance-testing-aberrant-copy-number.html"
        }
    ],
    "name": "STAC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1101/gr.5076506",
            "metadata": {
                "abstract": "Regions of gain and loss of genomic DNA occur in many cancers and can drive the genesis and progression of disease. These copy number aberrations (CNAs) can be detected at high resolution by using microarray-based techniques. However, robust statistical approaches are needed to identify nonrandom gains and losses across multiple experiments/samples. We have developed a method called Significance Testing for Aberrant Copy number (STAC) to address this need. STAC utilizes two complementary statistics in combination with a novel search strategy. The significance of both statistics is assessed, and P-values are assigned to each location on the genome by using a multiple testing corrected permutation approach. We validate our method by using two published cancer data sets. STAC identifies genomic alterations known to be of clinical and biological significance and provides statistical support for 85% of previously reported regions. Moreover, STAC identifies numerous additional regions of significant gain/loss in these data that warrant further investigation. The P-values provided by STAC can be used to prioritize regions for follow-up study in an unbiased fashion. We conclude that STAC is a powerful tool for identifying nonrandom genomic amplifications and deletions across multiple experiments. A Java version of STAC is freely available for download at http://cbil.upenn.edu/STAC. ©2006 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Diskin S.J."
                    },
                    {
                        "name": "Eck T."
                    },
                    {
                        "name": "Greshock J."
                    },
                    {
                        "name": "Mosse Y.P."
                    },
                    {
                        "name": "Naylor T."
                    },
                    {
                        "name": "Stoeckert Jr. C.J."
                    },
                    {
                        "name": "Weber B.L."
                    },
                    {
                        "name": "Maris J.M."
                    },
                    {
                        "name": "Grant G.R."
                    }
                ],
                "citationCount": 134,
                "date": "2006-09-08T00:00:00Z",
                "journal": "Genome Research",
                "title": "STAC: A method for testing the significance of DNA copy number aberrations across multiple array-CGH experiments"
            },
            "pmcid": "PMC1557772",
            "pmid": "16899652",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Statistics",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}