{
    "additionDate": "2021-01-18T11:20:40Z",
    "biotoolsCURIE": "biotools:transsynw",
    "biotoolsID": "transsynw",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "antonio.delsol@uni.lu",
            "name": "Antonio del Sol",
            "typeEntity": "Person"
        }
    ],
    "description": "A single-cell RNA-sequencing based web application to guide cell conversion experiments.\n\nConvert between cell subtypes by using single-cell data to identify an optimal, subtype-specific set of core transcription factors personalized for your own human or mouse cell study.\n\nStarting cell population: Select or upload a tab-separated file with the single-cell gene expression data from the cell type you started your differentiation protocol from. Genes should be labeled according to the Gene Symbols nomenclature.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://transsynw.lcsb.uni.lu/",
    "lastUpdate": "2021-03-03T10:47:32Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://git-r3lab.uni.lu/mariana.ribeiro/transsynw"
        }
    ],
    "name": "TransSynW",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/SCTM.20-0227",
            "metadata": {
                "abstract": "© 2020 The Authors. STEM CELLS TRANSLATIONAL MEDICINE published by Wiley Periodicals LLC on behalf of AlphaMed Press.Generation of desired cell types by cell conversion remains a challenge. In particular, derivation of novel cell subtypes identified by single-cell technologies will open up new strategies for cell therapies. The recent increase in the generation of single-cell RNA-sequencing (scRNA-seq) data and the concomitant increase in the interest expressed by researchers in generating a wide range of functional cells prompted us to develop a computational tool for tackling this challenge. Here we introduce a web application, TransSynW, which uses scRNA-seq data for predicting cell conversion transcription factors (TFs) for user-specified cell populations. TransSynW prioritizes pioneer factors among predicted conversion TFs to facilitate chromatin opening often required for cell conversion. In addition, it predicts marker genes for assessing the performance of cell conversion experiments. Furthermore, TransSynW does not require users' knowledge of computer programming and computational resources. We applied TransSynW to different levels of cell conversion specificity, which recapitulated known conversion TFs at each level. We foresee that TransSynW will be a valuable tool for guiding experimentalists to design novel protocols for cell conversion in stem cell research and regenerative medicine.",
                "authors": [
                    {
                        "name": "Ribeiro M.M."
                    },
                    {
                        "name": "Okawa S."
                    },
                    {
                        "name": "del Sol A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Stem Cells Translational Medicine",
                "title": "TransSynW: A single-cell RNA-sequencing based web application to guide cell conversion experiments"
            },
            "pmid": "33125830"
        }
    ],
    "topic": [
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}