{
    "accessibility": "Open access",
    "additionDate": "2021-10-30T13:35:15.010327Z",
    "biotoolsCURIE": "biotools:neuromorpho.org",
    "biotoolsID": "neuromorpho.org",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kblackw1@gmu.edu",
            "name": "Kim T. Blackwell",
            "typeEntity": "Person"
        },
        {
            "name": "Jonathan D. Reed"
        }
    ],
    "description": "NeuroMorpho.Org is a centrally curated inventory of digitally reconstructed neurons associated with peer-reviewed publications. It contains contributions from over 800 laboratories worldwide and is continuously updated as new morphological reconstructions are collected, published, and shared.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "http://neuromorpho.org/apiReference.htm"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://neuromorpho.org/main_help.jsp"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://NeuroMorpho.org",
    "lastUpdate": "2021-10-30T13:35:15.012876Z",
    "name": "NeuroMorpho.org",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINF.2021.666695",
            "metadata": {
                "abstract": "© Copyright © 2021 Reed and Blackwell.Accurate neuron morphologies are paramount for computational model simulations of realistic neural responses. Over the last decade, the online repository NeuroMorpho.Org has collected over 140,000 available neuron morphologies to understand brain function and promote interaction between experimental and computational research. Neuron morphologies describe spatial aspects of neural structure; however, many of the available morphologies do not contain accurate diameters that are essential for computational simulations of electrical activity. To best utilize available neuron morphologies, we present a set of equations that predict dendritic diameter from other morphological features. To derive the equations, we used a set of NeuroMorpho.org archives with realistic neuron diameters, representing hippocampal pyramidal, cerebellar Purkinje, and striatal spiny projection neurons. Each morphology is separated into initial, branching children, and continuing nodes. Our analysis reveals that the diameter of preceding nodes, Parent Diameter, is correlated to diameter of subsequent nodes for all cell types. Branching children and initial nodes each required additional morphological features to predict diameter, such as path length to soma, total dendritic length, and longest path to terminal end. Model simulations reveal that membrane potential response with predicted diameters is similar to the original response for several tested morphologies. We provide our open source software to extend the utility of available NeuroMorpho.org morphologies, and suggest predictive equations may supplement morphologies that lack dendritic diameter and improve model simulations with realistic dendritic diameter.",
                "authors": [
                    {
                        "name": "Reed J.D."
                    },
                    {
                        "name": "Blackwell K.T."
                    }
                ],
                "date": "2021-06-03T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Prediction of Neural Diameter From Morphology to Enable Accurate Simulation"
            },
            "pmcid": "PMC8209307",
            "pmid": "34149388"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ]
}