{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T13:11:08.889489Z",
    "biotoolsCURIE": "biotools:pyc2mc",
    "biotoolsID": "pyc2mc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "carlos.afonso@univ-rouen.fr",
            "name": "Carlos Afonso",
            "orcidid": "https://orcid.org/0000-0002-2406-5664"
        }
    ],
    "description": "Open-source software solution for visualization and treatment of high-resolution mass spectrometry data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/iC2MC/PyC2MC_viewer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:29:51.618704Z",
    "license": "GPL-3.0",
    "name": "PyC2MC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/jasms.2c00323",
            "metadata": {
                "abstract": "Complex molecular mixtures are encountered in almost all research disciplines, such as biomedical ‘omics, petroleomics, and environmental sciences. State-of-the-art characterization of sample materials related to these fields, deploying high-end instrumentation, allows for gathering large quantities of molecular composition data. One established technological platform is ultrahigh-resolution mass spectrometry, e.g., Fourier-transform mass spectrometry (FT-MS). However, the huge amounts of data acquired in FT-MS often result in tedious data treatment and visualization. FT-MS analysis of complex matrices can easily lead to single mass spectra with more than 10,000 attributed unique molecular formulas. Sophisticated software solutions to conduct these treatment and visualization attempts from commercial and noncommercial origins exist. However, existing applications have distinct drawbacks, such as focusing on only one type of graphic representation, being unable to handle large data sets, or not being publicly available. In this respect, we developed a software, within the international complex matrices molecular characterization joint lab (IC2MC), named “python tools for complex matrices molecular characterization” (PyC2MC). This piece of software will be open-source and free to use. PyC2MC is written under python 3.9.7 and relies on well-known libraries such as pandas, NumPy, or SciPy. It is provided with a graphical user interface developed under PyQt5. The two options for execution, (1) a user-friendly route with a prepacked executable file or (2) running the main python script through a Python interpreter, ensure a high applicability but also an open characteristic for further development by the community. Both are available on the GitHub platform (https://github.com/iC2MC/PyC2MC_viewer).",
                "authors": [
                    {
                        "name": "Afonso C."
                    },
                    {
                        "name": "Giusti P."
                    },
                    {
                        "name": "Lacroix-Andrivet O."
                    },
                    {
                        "name": "Lavanant H."
                    },
                    {
                        "name": "Maillard J.F."
                    },
                    {
                        "name": "Ruger C.P."
                    },
                    {
                        "name": "Sueur M."
                    }
                ],
                "citationCount": 12,
                "date": "2023-04-05T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "PyC2MC: An Open-Source Software Solution for Visualization and Treatment of High-Resolution Mass Spectrometry Data"
            },
            "pmid": "37016836",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
