
{
    "credit": [
        {
            "email": "gailro@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/p/quikr/wiki/Home/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB",
            "Python",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            },
            {
                "term": "Microbiology",
                "uri": "http://edamontology.org/topic_3301"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/quikr-1-0-3-rapid-reconstruction-phylotyping-of-bacterial-communities.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Many metagenomic studies compare hundreds to thousands of environmental and health-related samples by extracting and sequencing their 16S rRNA amplicons and measuring their similarity using beta-diversity metrics. However, one of the first steps - to classify the operational taxonomic units within the sample - can be a computationally time-consuming task because most methods rely on computing the taxonomic assignment of each individual read out of tens to hundreds of thousands of reads.Results: We introduce Quikr: a QUadratic, K-mer-based, Iterative, Reconstruction method, which computes a vector of taxonomic assignments and their proportions in the sample using an optimization technique motivated from the mathematical theory of compressive sensing. On both simulated and actual biological data, we demonstrate that Quikr typically has less error and is typically orders of magnitude faster than the most commonly used taxonomic assignment technique (the Ribosomal Database Project's Naïve Bayesian Classifier). Furthermore, the technique is shown to be unaffected by the presence of chimeras, thereby allowing for the circumvention of the time-intensive step of chimera filtering. Availability: The Quikr computational package (in MATLAB, Octave, Python and C) for the Linux and Mac platforms is available at http://sourceforge.net/projects/quikr/. Contact: Supplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author.",
            "authors": [
                "Koslicki D.",
                "Foucart S.",
                "Rosen G."
            ],
            "cit_count": 23,
            "journal": "Bioinformatics",
            "pmid": "23786768",
            "title": "Quikr: A method for rapid reconstruction of bacterial communities via compressive sensing",
            "year": "2013-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:quikr",
        "biotoolsID": "quikr",
        "description": "Quadratic, iterative, K-mer based reconstruction technique that utilizes sparsity promoting ideas from the field of compressed sensing to reconstruct the composition of a bacterial community (when the input data is 454-like pyrosequencing data).",
        "homepage": "http://sourceforge.net/projects/quikr/",
        "name": "Quikr"
    }
}