{
    "additionDate": "2020-01-09T18:00:03Z",
    "biotoolsCURIE": "biotools:independientes_para_el_ileo_postoperatorio",
    "biotoolsID": "independientes_para_el_ileo_postoperatorio",
    "confidence_flag": "high",
    "description": "Potential Association Between Perioperative Fluid Management and Occurrence of Postoperative Ileus.\n\nBACKGROUND:Postoperative ileus remains an issue after colorectal surgery delaying recovery and increasing the length of hospital stay and costs. OBJECTIVE:The purpose of this study was to analyze the impact of perioperative fluid management on ileus occurrence after colorectal surgery within a fully implemented enhanced recovery pathway. DESIGN:This was a retrospective cohort study of a prospectively maintained institutional database. SETTINGS:The study was conducted at a tertiary academic facility with fully implemented standardized enhanced recovery pathway over the entire study period. PATIENTS:All of the consecutive elective major colorectal resections for benign or malign indications between 2011 and 2016 were included.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'B54', 'El ileo postoperatorio', 'para el ileo postoperatorio', 'riesgo independientes para el ileo'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31633601",
    "lastUpdate": "2020-01-09T18:00:03Z",
    "name": "independientes para el ileo postoperatorio",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/DCR.0000000000001522",
            "metadata": {
                "abstract": "BACKGROUND: Postoperative ileus remains an issue after colorectal surgery delaying recovery and increasing the length of hospital stay and costs. OBJECTIVE: The purpose of this study was to analyze the impact of perioperative fluid management on ileus occurrence after colorectal surgery within a fully implemented enhanced recovery pathway. DESIGN: This was a retrospective cohort study of a prospectively maintained institutional database. SETTINGS: The study was conducted at a tertiary academic facility with fully implemented standardized enhanced recovery pathway over the entire study period. PATIENTS: All of the consecutive elective major colorectal resections for benign or malign indications between 2011 and 2016 were included. MAIN OUTCOME MEASURES: Postoperative ileus was defined as the need for nasogastric tube reinsertion. Perioperative fluid management and surgical outcome were compared between patients presenting with ileus and those without. Potential risk factors for ileus were identified through multinomial logistic regression. RESULTS: Postoperative ileus occurred in 377 (9%) of 4205 included patients at day 4 (interquartile range, 2-5 d). Intraoperatively, ileus patients received 3.2 ± 2.6 L of fluids, whereas the remaining patients received 2.5 ± 1.7 L (p < 0.001). Weight gain was 3.8 ± 7.1 kg in ileus patients versus 3.0 ± 6.6 kg (p = 0.272) in the remaining patients at postoperative day 1, 4.4 ± 6.5 kg versus 3.1 ± 7.0 kg (p = 0.028) at postoperative day 2, and 1.8 ± 6.0 kg versus 0.0 ± 6.0 kg at discharge (p = 0.002). The multivariable model including all significant (p < 0.05) demographic, fluid management-related, and surgical parameters retained postoperative day 0 fluids of >3 L (OR = 1.65 (95% CI, 1.13-2.41); p = 0.009), postoperative day 2 weight gain of >2.5 kg (OR = 1.49 (95% CI, 1.01-2.21); p = 0.048), and occurrence of postoperative complications (OR = 2.00 (95% CI, 1.39-2.90); p < 0.001) as independent risk factors for ileus. LIMITATIONS: This study was limited by its retrospective design. Fluid management depends on patient-, disease-, and surgery-related factors and cannot be generalized and extrapolated. CONCLUSIONS: Fluid overload and occurrence of postoperative complications were independent risk factors for postoperative ileus. This calls for action to keep perioperative fluids below suggested thresholds. See Video Abstract at http://links.lww.com/DCR/B54. ASOCIACIÓN POTENCIAL ENTRE EL MANEJO DEL LÍQUIDO PERIOPERATORIO Y EL SUCESO DE ÍLEO POSTOPERATORIO: El íleo postoperatorio sigue siendo un problema después de una cirugía colorrectal que retrasa la recuperación y aumenta la duración de la estancia hospitalaria y los costos.Analizar el impacto del manejo del líquido perioperatorio en la incidencia de íleo después de la cirugía colorrectal dentro de una vía de recuperación mejorada totalmente implementada.Estudio de cohorte retrospectivo de una base de datos institucional mantenida prospectivamente.Centro académico terciario con una ruta de recuperación mejorada estandarizada completamente implementada durante todo el período del estudio.Se incluyeron todas las resecciones colorrectales mayores electivas consecutivas para indicaciones benignas o malignas entre 2011 y 2016.El íleo postoperatorio se definió como la necesidad de reinserción de la sonda nasogástrica. El manejo del líquido perioperatorio y el resultado quirúrgico se compararon entre los pacientes con íleo y los que no. Los posibles factores de riesgo para el íleo se identificaron mediante regresión logística multinominal.El íleo postoperatorio se ocurrió en 377 (9%) de los 4205 pacientes incluidos al cuarto día (RIC 2-5). Intraoperatoriamente, los pacientes con íleo recibieron 3.2 ± 2.6 L de líquidos, mientras que los pacientes restantes recibieron 2.5 ± 1.7 L (p < 0.001). El aumento de peso fue de 3.8 ± 7.1 kg en pacientes con íleo versus 3 ± 6.6 kg (p = 0.272) en los pacientes restantes en el día postoperatorio 1, 4.4 ± 6.5 kg vs. 3.1 ± 7 kg (p = 0.028) en el día postoperatorio 2 y 1.8 ± 6 kg versus a 0 ± 6 kg al tiempo de alta hospitalaria (p = 0.002). El modelo multivariable que incluye todos los parámetros demográficos, del manejo de líquidos y quirúrgicos significativos (p <0.05) mantuvo líquidos del día 0 después de la operación de> 3L (proporción de probabilidad 1.65, intervalo de confianza del 95% 1.13-2.41, p = 0.009), ganancia de peso de > 2.5 kg en el dia postoperatorio 2 (proporción de probabilidad 1.49, 95% intervalo de confianza 1.01-2.21, p = 0.048) y aparición de complicaciones postoperatorias (proporción de probabilidad 2, 95% intervalo de confianza 1.39-2.9, p <0.001) como factores de riesgo independientes para íleo.Diseño retrospectivo. El manejo de líquidos depende de factores relacionados con el paciente, la enfermedad y la cirugía, y no puede generalizarse ni extrapolarse.La sobrecarga de líquidos y la aparición de complicaciones postoperatorias fueron factores de riesgo independientes para el íleo postoperatorio. Esto requiere medidas para mantener los líquidos perioperatorios por debajo de los umbrales sugeridos. Vea el Video del Resumen en http://links.lww.com/DCR/B54.",
                "authors": [
                    {
                        "name": "Grass F."
                    },
                    {
                        "name": "Lovely J.K."
                    },
                    {
                        "name": "Crippa J."
                    },
                    {
                        "name": "Hubner M."
                    },
                    {
                        "name": "Mathis K.L."
                    },
                    {
                        "name": "Larson D.W."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Diseases of the colon and rectum",
                "title": "Potential Association Between Perioperative Fluid Management and Occurrence of Postoperative Ileus"
            },
            "pmid": "31633601"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}