{
    "accessibility": "Open access",
    "additionDate": "2023-03-20T23:41:02.572869Z",
    "biotoolsCURIE": "biotools:l3n",
    "biotoolsID": "l3n",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "andy.aa.yuen@connect.polyu.hk",
            "name": "Ho Yin Yuen",
            "typeEntity": "Person"
        },
        {
            "email": "jj@i.kyoto-u.ac.jp",
            "name": "Jesper Jansson",
            "typeEntity": "Person"
        }
    ],
    "description": "Normalized L3-based link prediction in protein-protein interaction networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/andy897221/BMC_PPI_L3N",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-20T23:41:02.578494Z",
    "license": "MIT",
    "name": "L3N",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05178-3",
            "metadata": {
                "abstract": "Background: Protein–protein interaction (PPI) data is an important type of data used in functional genomics. However, high-throughput experiments are often insufficient to complete the PPI interactome of different organisms. Computational techniques are thus used to infer missing data, with link prediction being one such approach that uses the structure of the network of PPIs known so far to identify non-edges whose addition to the network would make it more sound, according to some underlying assumptions. Recently, a new idea called the L3 principle introduced biological motivation into PPI link predictions, yielding predictors that are superior to general-purpose link predictors for complex networks. Interestingly, the L3 principle can be interpreted in another way, so that other signatures of PPI networks can also be characterized for PPI predictions. This alternative interpretation uncovers candidate PPIs that the current L3-based link predictors may not be able to fully capture, underutilizing the L3 principle. Results: In this article, we propose a formulation of link predictors that we call NormalizedL3 (L3N) which addresses certain missing elements within L3 predictors in the perspective of network modeling. Our computational validations show that the L3N predictors are able to find missing PPIs more accurately (in terms of true positives among the predicted PPIs) than the previously proposed methods on several datasets from the literature, including BioGRID, STRING, MINT, and HuRI, at the cost of using more computation time in some of the cases. In addition, we found that L3-based link predictors (including L3N) ranked a different pool of PPIs higher than the general-purpose link predictors did. This suggests that different types of PPIs can be predicted based on different topological assumptions, and that even better PPI link predictors may be obtained in the future by improved network modeling.",
                "authors": [
                    {
                        "name": "Jansson J."
                    },
                    {
                        "name": "Yuen H.Y."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Normalized L3-based link prediction in protein–protein interaction networks"
            },
            "pmcid": "PMC9945744",
            "pmid": "36814208"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
