{
    "additionDate": "2022-03-21T11:42:29.327057Z",
    "biotoolsCURIE": "biotools:fastlsa",
    "biotoolsID": "fastlsa",
    "credit": [
        {
            "email": "shallam@mail.ubc.ca",
            "name": "Steven J Hallam",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The fastLSAsoftware package expands the boundaries of LSA allowing analysis on datasets with millions of co-varying time series. Mapping metadata onto force-directed graphs derived from FAST LSA allows investigators to view correlated cliques and explore previously unrecognized network relationships.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/hallamlab/fastLSA",
    "lastUpdate": "2024-11-24T20:10:53.055334Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hallamlab/fastLSA/issues"
        }
    ],
    "name": "fastLSA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/1471-2164-14-s1-s3",
            "metadata": {
                "abstract": "Background: Pairwise comparison of time series data for both local and time-lagged relationships is a computationally challenging problem relevant to many fields of inquiry. The Local Similarity Analysis (LSA) statistic identifies the existence of local and lagged relationships, but determining significance through a p-value has been algorithmically cumbersome due to an intensive permutation test, shuffling rows and columns and repeatedly calculating the statistic. Furthermore, this p-value is calculated with the assumption of normality - a statistical luxury dissociated from most real world datasets. Results: To improve the performance of LSA on big datasets, an asymptotic upper bound on the p-value calculation was derived without the assumption of normality. This change in the bound calculation markedly improved computational speed from O(pm2n) to O(m2n), where p is the number of permutations in a permutation test, m is the number of time series, and n is the length of each time series. The bounding process is implemented as a computationally efficient software package, FASTLSA, written in C and optimized for threading on multi-core computers, improving its practical computation time. We computationally compare our approach to previous implementations of LSA, demonstrate broad applicability by analyzing time series data from public health, microbial ecology, and social media, and visualize resulting networks using the Cytoscape software. Conclusions: The FASTLSA software package expands the boundaries of LSA allowing analysis on datasets with millions of co-varying time series. Mapping metadata onto force-directed graphs derived from FASTLSA allows investigators to view correlated cliques and explore previously unrecognized network relationships. The software is freely available for download at: http://www.cmde.science.ubc.ca/hallam/fastLSA/.",
                "authors": [
                    {
                        "name": "Durno W.E."
                    },
                    {
                        "name": "Hallam S.J."
                    },
                    {
                        "name": "Hanson N.W."
                    },
                    {
                        "name": "Konwar K.M."
                    }
                ],
                "citationCount": 24,
                "date": "2013-01-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Expanding the boundaries of local similarity analysis"
            },
            "pmcid": "PMC3549818",
            "pmid": "23368516"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
