{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:26:28Z",
    "biotoolsCURIE": "biotools:MRICloud",
    "biotoolsID": "MRICloud",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "koishi@mri.jhu.edu",
            "name": "Kumiko Oishi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Kenichi Oishi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multi‐Atlas Label Fusion Tool for Neonatal Brain MRI Parcellation and Quantification.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://mricloud.org/docs/tutorials/login_mricloud/login_mricloud.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://braingps.mricloud.org",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "MRICloud",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1111/JON.12623",
            "metadata": {
                "abstract": "© 2019 by the American Society of NeuroimagingStructure-by-structure analysis, in which the brain magnetic resonance imaging (MRI) is parcellated based on its anatomical units, is widely used to investigate chronological changes in morphology or signal intensity during normal development, as well as to identify the alterations seen in various diseases or conditions. The multi-atlas label fusion (MALF) method is considered a highly accurate parcellation approach, and anticipated for clinical application to quantitatively evaluate early developmental processes. However, the current MALF methods, which are designed for neonatal brain segmentations, are not widely available. In this study, we developed a T1-weighted, neonatal, multi-atlas repository and integrated it into the MALF-based brain segmentation tools in the cloud-based platform, MRICloud. The cloud platform ensures users instant access to the advanced MALF tool for neonatal brains, with no software or installation requirements for the client. The Web platform by braingps.mricloud.org will eliminate the dependence on a particular operating system (eg, Windows, Macintosh, or Linux) and the requirement for high computational performance of the user's computers. The MALF-based, fully automated, image parcellation could achieve excellent agreement with manual parcellation, and the whole and regional brain volumes quantified through this method demonstrated developmental trajectories comparable to those from a previous publication. This solution will make the latest MALF tools readily available to users, with minimum barriers, and will expedite and accelerate advancements in developmental neuroscience research, neonatology, and pediatric neuroradiology.",
                "authors": [
                    {
                        "name": "Otsuka Y."
                    },
                    {
                        "name": "Chang L."
                    },
                    {
                        "name": "Kawasaki Y."
                    },
                    {
                        "name": "Wu D."
                    },
                    {
                        "name": "Ceritoglu C."
                    },
                    {
                        "name": "Oishi K."
                    },
                    {
                        "name": "Ernst T."
                    },
                    {
                        "name": "Miller M."
                    },
                    {
                        "name": "Mori S."
                    },
                    {
                        "name": "Oishi K."
                    }
                ],
                "citationCount": 3,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Journal of Neuroimaging",
                "title": "A Multi-Atlas Label Fusion Tool for Neonatal Brain MRI Parcellation and Quantification"
            },
            "pmcid": "PMC6609486",
            "pmid": "31037800",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}