{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T10:10:55.983529Z",
    "biotoolsCURIE": "biotools:mkdcnet",
    "biotoolsID": "mkdcnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Abhishek Srivastava"
        },
        {
            "name": "Debesh Jha"
        },
        {
            "name": "Nikhil Kumar Tomar"
        },
        {
            "name": "Ulas Bagci"
        }
    ],
    "description": "Automatic Polyp Segmentation with Multiple Kernel Dilated Convolution Network.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/nikhilroxtomar/MKDCNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:53:07.176058Z",
    "license": "Not licensed",
    "name": "MKDCNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/cbms55023.2022.00063",
            "metadata": {
                "abstract": "The detection and removal of precancerous polyps through colonoscopy is the primary technique for the prevention of colorectal cancer worldwide. However, the miss rate of colorectal polyp varies significantly among the endoscopists. It is well known that a computer-aided diagnosis (CAD) system can assist endoscopists in detecting colon polyps and minimize the variation among endoscopists. In this study, we introduce a novel deep learning architecture, named MKDCNet, for automatic polyp segmentation robust to significant changes in polyp data distribution. MKDCNet is simply an encoder-decoder neural network that uses the pre-trained ResNet50 as the encoder and novel multiple kernel dilated convolution (MKDC) block that expands the field of view to learn more robust and heterogeneous representation. Extensive experiments on four publicly available polyp datasets and cell nuclei dataset show that the proposed MKDCNet outperforms the state-of-the-art methods when trained and tested on the same dataset as well when tested on unseen polyp datasets from different distributions. With rich results, we demonstrated the robustness of the proposed architecture. From an efficiency perspective, our algorithm can process at (\\approx 45) frames per second on RTX 3090 GPU. MKDCNet can be a strong benchmark for building real-time systems for clinical colonoscopies. The code of the proposed MKDCNet is available at https://github.com/nikhilroxtomar/MKDCNet.",
                "authors": [
                    {
                        "name": "Bagci U."
                    },
                    {
                        "name": "Jha D."
                    },
                    {
                        "name": "Srivastava A."
                    },
                    {
                        "name": "Tomar N.K."
                    }
                ],
                "citationCount": 17,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Proceedings - IEEE Symposium on Computer-Based Medical Systems",
                "title": "Automatic Polyp Segmentation with Multiple Kernel Dilated Convolution Network"
            },
            "pmcid": "PMC9921313",
            "pmid": "36777398"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
