{
    "accessibility": "Open access",
    "additionDate": "2022-02-23T18:44:59.752233Z",
    "biotoolsCURIE": "biotools:dmvfl-rsa",
    "biotoolsID": "dmvfl-rsa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zgj@zjut.edu.cn",
            "name": "Gui-Jun Zhang"
        }
    ],
    "description": "Improved protein relative solvent accessibility prediction using deep multi-view feature learning framework.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Accessible surface calculation",
                    "uri": "http://edamontology.org/operation_0384"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://jun-csbio.github.io/DMVFL-RSA/",
    "language": [
        "Python",
        "Scheme"
    ],
    "lastUpdate": "2022-02-23T18:44:59.754720Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/XueQiangFan/DMVFL-RSA"
        }
    ],
    "name": "DMVFL-RSA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.AB.2021.114358",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.The accurate prediction of the relative solvent accessibility of a protein is critical to understanding its 3D structure and biological function. In this study, a novel deep multi-view feature learning (DMVFL) framework that integrates three different neural network units, i.e., bidirectional long short-term memory recurrent neural network, squeeze-and-excitation, and fully-connected hidden layer, with four sequence-based single-view features, i.e., position-specific scoring matrix, position-specific frequency matrix, predicted secondary structure, and roughly predicted three-state relative solvent accessibility probability, is developed to accurately predict relative solvent accessibility information of protein. On the basis of this newly developed framework, one new protein relative solvent accessibility predictor was proposed and called DMVFL-RSA, which employs a customized multiple feedback mechanism that helps to extract discriminative information embedded in the four single-view features. In benchmark tests on TEST524 and CASP14-derived (CASP14set) datasets, DMVFL-RSA outperforms other existing state-of-the-art protein relative solvent accessibility predictors when predicting two-state (exposure threshold of 25%), three-state (exposure thresholds of 9% and 36%), and four-state (exposure thresholds of 4%, 25%, and 50%) discrete values. For real-valued prediction on TEST524 and CASP14set, DMVFL-RSA has also gained high Pearson correlation coefficient values, indicating a positive correlation between the predicted and native relative solvent accessibility. Detailed analyses show that the major advantages of DMVFL-RSA lie in the high efficiency of the DMVFL framework, the applied multiple feedback mechanism, and the strong sensitivity of the sequence-based features. The web server of DMVFL-RSA is freely available at https://jun-csbio.github.io/DMVFL-RSA/for academic use. The standalone package of DMVFL-RSA is downloadable at https://github.com/XueQiangFan/DMVFL-RSA.",
                "authors": [
                    {
                        "name": "Fan X.-Q."
                    },
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Jia N.-X."
                    },
                    {
                        "name": "Yu D.-J."
                    },
                    {
                        "name": "Zhang G.-J."
                    }
                ],
                "date": "2021-10-15T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "Improved protein relative solvent accessibility prediction using deep multi-view feature learning framework"
            },
            "pmid": "34478704"
        }
    ],
    "toolType": [
        "Web application",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
