{
    "additionDate": "2017-02-10T14:14:35Z",
    "biotoolsCURIE": "biotools:magma",
    "biotoolsID": "magma",
    "description": "This tool can be used for the analyses of two-channel microarray experiments and computes genes with significant differential expression using R and Bioconductor. Automatically generated R-scripts are available for download.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://www.magma-fgcz.unizh.ch/pages/loginuser.jsf",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "MAGMA",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The web application MAGMA provides a simple and intuitive interface to identify differentially expressed genes from two-channel microarray data. While the underlying algorithms are not superior to those of similar web applications, MAGMA is particularly user friendly and can be used without prior training. The user interface guides the novice user through the most typical microarray analysis workflow consisting of data upload, annotation, normalization and statistical analysis. It automatically generates R-scripts that document MAGMA's entire data processing steps, thereby allowing the user to regenerate all results in his local R installation. The implementation of MAGMA follows the model-view-controller design pattern that strictly separates the R-based statistical data processing, the web-representation and the application logic. This modular design makes the application flexible and easily extendible by experts in one of the fields: statistical microarray analysis, web design or software development. State-of-theart Java Server Faces technology was used to generate the web interface and to perform user input processing. MAGMA's object-oriented modular framework makes it easily extendible and applicable to other fields and demonstrates that modern Java technology is also suitable for rather small and concise academic projects. MAGMA is freely available at www.magma-fgcz.uzh.ch. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Rehrauer H."
                    },
                    {
                        "name": "Zoller S."
                    },
                    {
                        "name": "Schlapbach R."
                    }
                ],
                "citationCount": 11,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MAGMA: Analysis of two-channel microarrays made easy"
            },
            "pmid": "17517778"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}