{
    "additionDate": "2021-10-25T20:20:16.819710Z",
    "biotoolsCURIE": "biotools:respiraconnosotros",
    "biotoolsID": "respiraconnosotros",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "luisaugustos@usal.es",
            "name": "Luís Augusto Silva",
            "orcidid": "https://orcid.org/0000-0002-9981-4586",
            "typeEntity": "Person"
        },
        {
            "email": "rociollamas@usal.es",
            "name": "Rocío Llamas-Ramos",
            "orcidid": "https://orcid.org/0000-0002-5606-261X",
            "typeEntity": "Person"
        }
    ],
    "description": "A Viable Home-Based Telerehabilitation System for Respiratory Patients.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://respiraconnosotros.es",
    "lastUpdate": "2021-10-25T20:20:16.822254Z",
    "name": "RespiraConNosotros",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/S21103318",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Currently, there are more than 1.55 million cases of SARS-CoV-2 infection in Spain. Of these, it is estimated that around 45% will present respiratory complications, which represents approximately 620,000 patients who will need respiratory rehabilitation. The health system has no resources for this huge quantity of patients after the hospital discharge to finish the complete recovery and avoid the chronicity of the symptoms. We propose an application named RespiraConNosotros. The application has been created and designed to guide users in performing respiratory rehabilitation exercises, especially for COVID-19 patients, and it also facilitates patient–physiotherapist contact via chat or video calling to help patients. It is accessible for all users and on all devices. All exercises would be guided and supervised by a specialized physiotherapist who suggests, adapts, and guides the exercise according to the function level of each patient. Data obtained was satisfactory; all patients pointed out the easy access, the intuitive format, and the advantage of communicating with an expert. Concerning functional assessment, all participants improved their score on the Borg scale after performing the intervention with the application.This platform would help respiratory patients to make rehabilitation treatments to recover their pulmonary function and to decrease or eliminate the possible complications they have. It never substitutes any prescribed treatment. In conclusion, RespiraConNosotros is a simple, viable, and safe alternative for the improvement and maintenance of respiratory capacity and patient’s functionality affected by COVID-19. It could be used as a complement to face-to-face treatment when the situation allows it.",
                "authors": [
                    {
                        "name": "Bermejo-Gil B.M."
                    },
                    {
                        "name": "Leithardt V.R.Q."
                    },
                    {
                        "name": "Llamas-Ramos I."
                    },
                    {
                        "name": "Llamas-Ramos R."
                    },
                    {
                        "name": "Perez-Robledo F."
                    },
                    {
                        "name": "Sales-Mendes A."
                    },
                    {
                        "name": "Silva L.A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-02T00:00:00Z",
                "journal": "Sensors",
                "title": "Respiraconnosotros: A viable home-based telerehabilitation system for respiratory patients"
            },
            "pmcid": "PMC8150923",
            "pmid": "34064725"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Pain medicine",
            "uri": "http://edamontology.org/topic_3401"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        }
    ]
}
