{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-08-09T13:26:48Z",
    "biotoolsCURIE": "biotools:Molecular_clock",
    "biotoolsID": "Molecular_clock",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ubastolla@cbm.csic.es",
            "name": "Ugo Bastolla",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Computation of clock violations.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/ugobas/Molecular_clock/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/ugobas/Molecular_clock",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2019-10-31T11:48:11Z",
    "license": "MIT",
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/ugobas/Molecular_clock/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Molecular clock",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/SYSBIO/SYZ022",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press, on behalf of the Society of Systematic Biologists. All rights reserved. For permissions, please email: journals.permissions@oup.com.The molecular clock hypothesis, which states that substitutions accumulate in protein sequences at a constant rate, plays a fundamental role in molecular evolution but it is violated when selective or mutational processes vary with time. Such violations of the molecular clock have been widely investigated for protein sequences, but not yet for protein structures. Here, we introduce a novel statistical test (Significant Clock Violations) and perform a large scale assessment of the molecular clock in the evolution of both protein sequences and structures in three large superfamilies. After validating our method with computer simulations, we find that clock violations are generally consistent in sequence and structure evolution, but they tend to be larger and more significant in structure evolution. Moreover, changes of function assessed through Gene Ontology and InterPro terms are associated with large and significant clock violations in structure evolution. We found that almost one third of significant clock violations are significant in structure evolution but not in sequence evolution, highlighting the advantage to use structure information for assessing accelerated evolution and gathering hints of positive selection. Clock violations between closely related pairs are frequently significant in sequence evolution, consistent with the observed time dependence of the substitution rate attributed to segregation of neutral and slightly deleterious polymorphisms, but not in structure evolution, suggesting that these substitutions do not affect protein structure although they may affect stability. These results are consistent with the view that natural selection, both negative and positive, constrains more strongly protein structures than protein sequences. Our code for computing clock violations is freely available at https://github.com/ugobas/Molecular_clock.",
                "authors": [
                    {
                        "name": "Pascual-Garcia A."
                    },
                    {
                        "name": "Arenas M."
                    },
                    {
                        "name": "Bastolla U."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Systematic biology",
                "title": "The Molecular Clock in the Evolution of Protein Structures"
            },
            "pmid": "31111152",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}