{
    "additionDate": "2020-07-03T05:06:04Z",
    "biotoolsCURIE": "biotools:memblob",
    "biotoolsID": "memblob",
    "collectionID": [
        "3D-BioInfo"
    ],
    "description": "MemBlob web application calculates the membrane boundaries of transmembrane proteins using cryo-EM densities. The membrane environment used during transmembrane protein structure determination cannot be resolved at the atomic level, but it produces density, which can be utilized to dissect the membrane embedded part of the protein.",
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein atom",
                        "uri": "http://edamontology.org/data_1755"
                    },
                    "format": [
                        {
                            "term": "protein",
                            "uri": "http://edamontology.org/format_1208"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Transmembrane protein visualisation",
                    "uri": "http://edamontology.org/operation_2241"
                }
            ]
        }
    ],
    "homepage": "http://memblob.hegelab.org",
    "lastUpdate": "2022-12-01T22:09:47.097994Z",
    "name": "MemBlob",
    "owner": "biohegedus",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-0270-6_9",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.Transmembrane proteins include membrane channels, pores, and receptors and, as such, comprise an important part of the proteome, yet our knowledge about them is much less complete than about soluble, globular proteins. An important aspect of transmembrane protein structure is their exact position within the lipid bilayer, a feature hard to investigate experimentally at the atomic level. Here we describe MemBlob, a novel approach utilizing difference electron density maps obtained by cryo-EM studies of transmembrane proteins. The idea behind is that the nonprotein part of such maps carries information on the exact localization of the membrane mimetics used in the experiment and can be used to extract the positional information of the protein within the membrane. MemBlob uses a structural model of the protein and an experimental electron density map to provide an estimation of the surface residues interacting with the membrane.",
                "authors": [
                    {
                        "name": "Csizmadia G."
                    },
                    {
                        "name": "Farkas B."
                    },
                    {
                        "name": "Hegedus T."
                    },
                    {
                        "name": "Katona E."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Using MemBlob to Analyze Transmembrane Regions Based on Cryo-EM Maps"
            },
            "pmid": "32006282",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btz539",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.The identification of transmembrane helices in transmembrane proteins is crucial, not only to understand their mechanism of action but also to develop new therapies. While experimental data on the boundaries of membrane-embedded regions are sparse, this information is present in cryo-electron microscopy (cryo-EM) density maps and it has not been utilized yet for determining membrane regions. We developed a computational pipeline, where the inputs of a cryo-EM map, the corresponding atomistic structure, and the potential bilayer orientation determined by TMDET algorithm of a given protein result in an output defining the residues assigned to the bulk water phase, lipid interface and the lipid hydrophobic core. Based on this method, we built a database involving published cryo-EM protein structures and a server to be able to compute this data for newly obtained structures.",
                "authors": [
                    {
                        "name": "Csizmadia G."
                    },
                    {
                        "name": "Csizmadia G."
                    },
                    {
                        "name": "Farkas B."
                    },
                    {
                        "name": "Farkas B."
                    },
                    {
                        "name": "Farkas B."
                    },
                    {
                        "name": "Hegedus T."
                    },
                    {
                        "name": "Hegedus T."
                    },
                    {
                        "name": "Katona E."
                    },
                    {
                        "name": "Katona E."
                    },
                    {
                        "name": "Tusnady G.E."
                    }
                ],
                "citationCount": 4,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MemBlob database and server for identifying transmembrane regions using cryo-EM maps"
            },
            "pmid": "31290936",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "validated": 1
}
