{"collectionID": [], "accessibility": [], "topic": [{"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}, {"term": "Molecular modelling", "uri": "http://edamontology.org/topic_2275"}, {"term": "Phylogenetics", "uri": "http://edamontology.org/topic_3293"}, {"term": "Immunoproteins, genes and antigens", "uri": "http://edamontology.org/topic_2830"}, {"term": "Immunology", "uri": "http://edamontology.org/topic_0804"}, {"term": "Biochemistry", "uri": "http://edamontology.org/topic_3292"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "23777206", "type": null, "pmcid": null, "metadata": {"title": "HASP server: A database and structural visualization platform for comparative models of influenza A hemagglutinin proteins", "abstract": "Background: Influenza A viruses possess RNA genomes that mutate frequently in response to immune pressures. The mutations in the hemagglutinin genes are particularly significant, as the hemagglutinin proteins mediate attachment and fusion to host cells, thereby influencing viral pathogenicity and species specificity. Large-scale influenza A genome sequencing efforts have been ongoing to understand past epidemics and pandemics and anticipate future outbreaks. Sequencing efforts thus far have generated nearly 9,000 distinct hemagglutinin amino acid sequences.Description: Comparative models for all publicly available influenza A hemagglutinin protein sequences (8,769 to date) were generated using the Rosetta modeling suite. The C-alpha root mean square deviations between a randomly chosen test set of models and their crystallographic templates were less than 2 Å, suggesting that the modeling protocols yielded high-quality results. The models were compiled into an online resource, the Hemagglutinin Structure Prediction (HASP) server. The HASP server was designed as a scientific tool for researchers to visualize hemagglutinin protein sequences of interest in a three-dimensional context. With a built-in molecular viewer, hemagglutinin models can be compared side-by-side and navigated by a corresponding sequence alignment. The models and alignments can be downloaded for offline use and further analysis.Conclusions: The modeling protocols used in the HASP server scale well for large amounts of sequences and will keep pace with expanded sequencing efforts. The conservative approach to modeling and the intuitive search and visualization interfaces allow researchers to quickly analyze hemagglutinin sequences of interest in the context of the most highly related experimental structures, and allow them to directly compare hemagglutinin sequences to each other simultaneously in their two- and three-dimensional contexts. The models and methodology have shown utility in current research efforts and the ongoing aim of the HASP server is to continue to accelerate influenza A research and have a positive impact on global public health. © 2013 Ambroggio et al.; licensee BioMed Central Ltd.", "citationCount": 2, "authors": [{"name": "Ambroggio X.I."}, {"name": "Dommer J."}, {"name": "Gopalan V."}, {"name": "Dunham E.J."}, {"name": "Taubenberger J.K."}, {"name": "Hurt D.E."}], "date": "2013-06-18T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://exon.niaid.nih.gov/about.html", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}, {"typeRole": ["Primary contact"], "name": "Support page", "url": "https://exon.niaid.nih.gov/support.jsp?category=HASP", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:hasp", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://exon.niaid.nih.gov/HASP.html", "function": [{"note": null, "input": [], "operation": [{"term": "Protein structure prediction", "uri": "http://edamontology.org/operation_0474"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Protein modelling", "uri": "http://edamontology.org/operation_0477"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:56Z", "otherID": [], "description": "Server designed as a scientific tool for researchers to visualize their phylogenetic, biochemical, and immunological HA data in the three-dimensional context of the HA structure, in the hopes that the context may help researchers better interpret their data and generate new hypotheses.", "toolType": ["Database portal"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/hasp-structural-viewer-predicted-hemagglutinin-structures.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "hasp", "additionDate": "2017-08-03T18:45:51Z", "name": "HASP", "license": null, "documentation": [{"url": "https://exon.niaid.nih.gov/HASP.html", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}