{
    "additionDate": "2019-11-14T18:07:13Z",
    "biotoolsCURIE": "biotools:Ularcirc",
    "biotoolsID": "Ularcirc",
    "confidence_flag": "tool",
    "description": "visualization and enhanced analysis of circular RNAs via back and canonical forward splicing | An R-shiny app that provides backsplice and canonical splicing analysis for both circRNA and parental transcripts | An R package that provides analysis and visualisation of canonical and backsplice junctions. Takes output provided by the STAR aligner as well as CIRI2 and circExplorer2 output and enables circRNA downstream analysis | Ularcirc manuscript now available through Nucleic Acids Research | Author and maintainer: David Humphreys (d.humphreys at victorchang dot edu dot au) | Ularcirc can annotate circRNA with overlapping gene information. This is obtained from available bioconductor databases. Use the following command to identify what databases to download:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VCCRI/Ularcirc",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-31T14:01:38Z",
    "license": "GPL-3.0",
    "name": "Ularcirc",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ718",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Circular RNAs (circRNA) are a unique class of transcripts that can only be identified from sequence alignments spanning discordant junctions, commonly referred to as backsplice junctions (BSJ). Canonical splicing is also linked with circRNA biogenesis either from the parental transcript or internal to the circRNA, and is not fully utilized in circRNA software. Here we present Ularcirc, a software tool that integrates the visualization of both BSJ and forward splicing junctions and provides downstream analysis of selected circRNA candidates. Ularcirc utilizes the output of CIRI, circExplorer, or raw chimeric output of the STAR aligner and assembles BSJ count table to allow multi-sample analysis. We used Ularcirc to identify and characterize circRNA from public and in-house generated data sets and demonstrate how it can be used to (i) discover novel splicing patterns of parental transcripts, (ii) detect internal splicing patterns of circRNA, and (iii) reveal the complexity of BSJ formation. Furthermore, we identify circRNA that have potential open reading frames longer than their linear sequence. Finally, we detected and validated the presence of a novel class of circRNA generated from ApoA4 transcripts whose BSJ derive from multiple non-canonical splicing sites within coding exons. Ularcirc is accessed via https://github.com/VCCRI/Ularcirc.",
                "authors": [
                    {
                        "name": "Demuth M."
                    },
                    {
                        "name": "Fossat N."
                    },
                    {
                        "name": "Ho J.W.K."
                    },
                    {
                        "name": "Humphreys D.T."
                    },
                    {
                        "name": "Tam P.P.L."
                    }
                ],
                "citationCount": 8,
                "date": "2019-11-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Ularcirc: Visualization and enhanced analysis of circular RNAs via back and canonical forward splicing"
            },
            "pmid": "31435647"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
