{
    "accessibility": "Open access",
    "additionDate": "2023-06-26T12:38:15.108087Z",
    "biotoolsCURIE": "biotools:mitk",
    "biotoolsID": "mitk",
    "collectionID": [
        "EUCAIM"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "gridid": "grid.7497.d",
            "name": "German Cancer Research Center (DKFZ)",
            "rorid": "04cdgtt98",
            "url": "https://www.dkfz.de/de"
        }
    ],
    "description": "The Medical Imaging Interaction Toolkit (MITK) is a free open-source software for the development of interactive medical image processing software. Based on MITK, there is the MITK Workbench, a powerful and free application to view, process, and segment medical images.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://docs.mitk.org/2023.04/"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.mitk.org/wiki/Downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "DICOM format",
                            "uri": "http://edamontology.org/format_3548"
                        },
                        {
                            "term": "nii",
                            "uri": "http://edamontology.org/format_3549"
                        },
                        {
                            "term": "nrrd",
                            "uri": "http://edamontology.org/format_3551"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "DICOM format",
                            "uri": "http://edamontology.org/format_3548"
                        },
                        {
                            "term": "nii",
                            "uri": "http://edamontology.org/format_3549"
                        },
                        {
                            "term": "nrrd",
                            "uri": "http://edamontology.org/format_3551"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://www.mitk.org/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:46:17.782338Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "note": "If you have any questions related to the use of or the development with MITK, please use the official mailing list.\n\nNote that you have to subscribe to the mailing list in order to send mails",
            "type": [
                "Mailing list"
            ],
            "url": "https://lists.sourceforge.net/lists/listinfo/mitk-users"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MITK/MITK/"
        }
    ],
    "maturity": "Mature",
    "name": "MITK",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "sschaum",
    "publication": [
        {
            "doi": "10.1007/s11548-013-0840-8",
            "metadata": {
                "abstract": "Purpose: The Medical Imaging Interaction Toolkit (MITK) has been available as open-source software for almost 10 years now. In this period the requirements of software systems in the medical image processing domain have become increasingly complex. The aim of this paper is to show how MITK evolved into a software system that is able to cover all steps of a clinical workflow including data retrieval, image analysis, diagnosis, treatment planning, intervention support, and treatment control. Methods: MITK provides modularization and extensibility on different levels. In addition to the original toolkit, a module system, micro services for small, system-wide features, a service-oriented architecture based on the Open Services Gateway initiative (OSGi) standard, and an extensible and configurable application framework allow MITK to be used, extended and deployed as needed. A refined software process was implemented to deliver high-quality software, ease the fulfillment of regulatory requirements, and enable teamwork in mixed-competence teams. Results: MITK has been applied by a worldwide community and integrated into a variety of solutions, either at the toolkit level or as an application framework with custom extensions. The MITK Workbench has been released as a highly extensible and customizable end-user application. Optional support for tool tracking, image-guided therapy, diffusion imaging as well as various external packages (e.g. CTK, DCMTK, OpenCV, SOFA, Python) is available. MITK has also been used in several FDA/CE-certified applications, which demonstrates the high-quality software and rigorous development process. Conclusions: MITK provides a versatile platform with a high degree of modularization and interoperability and is well suited to meet the challenging tasks of today's and tomorrow's clinically motivated research. © 2013 CARS.",
                "authors": [
                    {
                        "name": "Baumhauer M."
                    },
                    {
                        "name": "Fangerau M."
                    },
                    {
                        "name": "Franz A.M."
                    },
                    {
                        "name": "Maier-Hein K.H."
                    },
                    {
                        "name": "Maier-Hein L."
                    },
                    {
                        "name": "Maleike D."
                    },
                    {
                        "name": "Meinzer H.-P."
                    },
                    {
                        "name": "Muller M."
                    },
                    {
                        "name": "Nolden M."
                    },
                    {
                        "name": "Seitel A."
                    },
                    {
                        "name": "Wald D."
                    },
                    {
                        "name": "Wolf I."
                    },
                    {
                        "name": "Zelzer S."
                    }
                ],
                "citationCount": 354,
                "date": "2013-01-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "The medical imaging interaction toolkit: Challenges and advances: 10 years of open-source development"
            },
            "note": "Nolden, Marco, et al. \"The Medical Imaging Interaction Toolkit: challenges and advances: 10 years of open-source development.\"\nInternational journal of computer assisted radiology and surgery 8 (2013): 607-620",
            "pmid": "23588509"
        },
        {
            "doi": "10.1016/j.media.2005.04.005",
            "metadata": {
                "abstract": "Thoroughly designed, open-source toolkits emerge to boost progress in medical imaging. The Insight Toolkit (ITK) provides this for the algorithmic scope of medical imaging, especially for segmentation and registration. But medical imaging algorithms have to be clinically applied to be useful, which additionally requires visualization and interaction. The Visualization Toolkit (VTK) has powerful visualization capabilities, but only low-level support for interaction. In this paper, we present the Medical Imaging Interaction Toolkit (MITK). The goal of MITK is to significantly reduce the effort required to construct specifically tailored, interactive applications for medical image analysis. MITK allows an easy combination of algorithms developed by ITK with visualizations created by VTK and extends these two toolkits with those features, which are outside the scope of both. MITK adds support for complex interactions with multiple states as well as undo-capabilities, a very important prerequisite for convenient user interfaces. Furthermore, MITK facilitates the realization of multiple, different views of the same data (as a multiplanar reconstruction and a 3D rendering) and supports the visualization of 3D+t data, whereas VTK is only designed to create one kind of view of 2D or 3D data. MITK reuses virtually everything from ITK and VTK. Thus, it is not at all a competitor to ITK or VTK, but an extension, which eases the combination of both and adds the features required for interactive, convenient to use medical imaging software. MITK is an open-source project (www.mitk.org). © 2005 Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Bottger T."
                    },
                    {
                        "name": "Hastenteufel M."
                    },
                    {
                        "name": "Kunert T."
                    },
                    {
                        "name": "Meinzer H.-P."
                    },
                    {
                        "name": "Nolden M."
                    },
                    {
                        "name": "Schobinger M."
                    },
                    {
                        "name": "Vetter M."
                    },
                    {
                        "name": "Wegner I."
                    },
                    {
                        "name": "Wolf I."
                    }
                ],
                "citationCount": 378,
                "date": "2005-12-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "The medical imaging interaction toolkit"
            },
            "note": "Nolden, Marco, et al. \"The Medical Imaging Interaction Toolkit: challenges and advances: 10 years of open-source development.\"\nInternational journal of computer assisted radiology and surgery 8 (2013): 607-620",
            "pmid": "15896995"
        }
    ],
    "toolType": [
        "Desktop application",
        "Library",
        "Workbench"
    ],
    "version": [
        "v2023.04"
    ]
}
