{
    "additionDate": "2022-06-26T15:13:33.871668Z",
    "biotoolsCURIE": "biotools:flt",
    "biotoolsID": "flt",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Anuj Singh",
            "orcidid": "https://orcid.org/0000-0001-7550-1924"
        },
        {
            "name": "Hadi Jamali-Rad",
            "orcidid": "https://orcid.org/0000-0003-2254-6963"
        }
    ],
    "description": "Classical federated learning approaches incur significant performance degradation in the presence of non-IID client data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hjraad/FLT/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-26T15:13:33.874761Z",
    "license": "Not licensed",
    "name": "FLT",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2022.3152581",
            "metadata": {
                "abstract": "AuthorClassical federated learning approaches incur significant performance degradation in the presence of non-independent and identically distributed (non-IID) client data. A possible direction to address this issue is forming clusters of clients with roughly IID data. Most solutions following this direction are iterative and relatively slow, also prone to convergence issues in discovering underlying cluster formations. We introduce federated learning with taskonomy (FLT) that generalizes this direction by learning the task relatedness between clients for more efficient federated aggregation of heterogeneous data. In a one-off process, the server provides the clients with a pretrained (and fine-tunable) encoder to compress their data into a latent representation and transmit the signature of their data back to the server. The server then learns the task relatedness among clients via manifold learning and performs a generalization of federated averaging. FLT can flexibly handle a generic client relatedness graph, when there are no explicit clusters of clients, as well as efficiently decompose it into (disjoint) clusters for clustered federated learning. We demonstrate that FLT not only outperforms the existing state-of-the-art baselines in non-IID scenarios but also offers improved fairness across clients. Our codebase can be found at: https://github.com/hjraad/FLT/",
                "authors": [
                    {
                        "name": "Abdizadeh M."
                    },
                    {
                        "name": "Jamali-Rad H."
                    },
                    {
                        "name": "Singh A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "Federated Learning With Taskonomy for Non-IID Data"
            },
            "pmid": "35316193"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "validated": 1
}
