{"credit":[{"email":"admin.vbc5@univie.ac.at","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cibiv.at/"}],"documentation":[{"type":"GENERAL","url":"http://www.iqtree.org/doc/"}],"function":[{"operation":[{"term":"Phylogenetic tree generation (maximum likelihood and Bayesian methods)","uri":"http://edamontology.org/operation_0547"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Phylogenomics","uri":"http://edamontology.org/topic_0194"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/iq-tree-0-9-4-efficient-phylogenetic-tree-reconstruction-ultrafast-bootstrap-approximation.html"}],"publication":[{"abstract":"© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research. This article presents W-IQ-TREE, an intuitive and user-friendly web interface and server for IQ-TREE, an efficient phylogenetic software for maximum likelihood analysis. W-IQ-TREE supports multiple sequence types (DNA, protein, codon, binary and morphology) in common alignment formats and a wide range of evolutionary models including mixture and partition models. W-IQ-TREE performs fast model selection, partition scheme finding, efficient tree reconstruction, ultrafast bootstrapping, branch tests, and tree topology tests. All computations are conducted on a dedicated computer cluster and the users receive the results via URL or email. W-IQ-TREE is available at http://iqtree.cibiv.univie.ac.at It is free and open to all users and there is no login requirement.","authors":["Trifinopoulos J.","Nguyen L.-T.","von Haeseler A.","Minh B.Q."],"cit_count":275,"journal":"Nucleic acids research","pmid":"27084950","title":"W-IQ-TREE: a fast online phylogenetic tool for maximum likelihood analysis","year":"2016-07-08"}],"summary":{"biotoolsCURIE":"biotools:iq-tree","biotoolsID":"iq-tree","description":"Very efficient phylogenetic software for reconstructing maximum-likelihood trees and assessing branch supports with the ultrafast bootstrap approximation. It is based on the IQPNNI algorithm with 10-fold speedup together with substantially additional features.","homepage":"http://www.cibiv.at/software/iqtree/","name":"IQ-TREE"}}