{
    "additionDate": "2021-01-18T08:36:26Z",
    "biotoolsCURIE": "biotools:ctcrbase",
    "biotoolsID": "ctcrbase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ddong@xzhmu.edu.cn",
            "name": "Dong Dong",
            "typeEntity": "Person"
        },
        {
            "email": "jluo@bio.ecnu.edu.cn",
            "name": "Jian Luo",
            "typeEntity": "Person"
        }
    ],
    "description": "ctcRbase is agene expression database of circulating tumor cells and microemboli Circulating tumor cells/microemboli (CTCs/CTM) are those cells that depart from cancerous lesions and shed into the bloodstream. Enumeration and analysis of CTCs/CTM may enable non-invasive monitoring of advanced cancers, as well as early detection of tumor metastases. ctcRbase (Gene expression database of circulating tumor cells/ microemboli) is a database to collect expression data of CTCs and CTM in all kinds of cancer types, including long non-coding RNA (lncRNA) and messenger RNA (mRNA) derived from RNA-seq data analyses. ctcRbase provides the expression level of primary tumors, CTCs/CTM and white blood cells (WBC). Moreover, the expression level of tumor metastasis was also provided. An easy-to-use interface was constructed to query and browse gene expression in CTCs/CTM.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://www.origin-gene.cn/database/ctcRbase/",
    "lastUpdate": "2021-02-18T17:59:07Z",
    "name": "ctcRbase",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA020",
            "metadata": {
                "abstract": "© 2020 Crown copyright 2020.Circulating tumor cells/microemboli (CTCs/CTMs) are malignant cells that depart from cancerous lesions and shed into the bloodstream. Analysis of CTCs can allow the investigation of tumor cell biomarker expression from a non-invasive liquid biopsy. To date, high-throughput technologies have become a powerful tool to provide a genome-wide view of transcriptomic changes associated with CTCs/CTMs. These data provided us much information to understand the tumor heterogeneity, and the underlying molecular mechanism of tumor metastases. Unfortunately, these data have been deposited into various repositories, and a uniform resource for the cancer metastasis is still unavailable. To this end, we integrated previously published transcriptome datasets of CTCs/CTMs and constructed a web-accessible database. The first release of ctcRbase contains 526 CTCs/CTM samples across seven cancer types. The expression of 14 631 mRNAs and 3642 long non-coding RNAs of CTCs/CTMs were included. Experimental validations from the published literature are also included. Since CTCs/CTMs are considered to be precursors of metastases, ctcRbase also collected the expression data of primary tumors and metastases, which allows user to discover a unique 'circulating tumor cell gene signature' that is distinct from primary tumor and metastases. An easy-to-use database was constructed to query and browse CTCs/CTMs genes. ctcRbase can be freely accessible at http://www.origin-gene.cn/database/ctcRbase/.",
                "authors": [
                    {
                        "name": "Dong D."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Zhao L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "CtcRbase: The gene expression database of circulating tumor cells and microemboli"
            },
            "pmcid": "PMC7158883",
            "pmid": "32294193"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
