
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://csbl.bmb.uga.edu/SeqTU/contact.php"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://csbl.bmb.uga.edu/SeqTU/tutorial.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Transcription",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/seqtu-r12-bacterial-rna-seq-analysis-to-identify-transcription-units-tus.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research. Identification of transcription units (TUs) encoded in a bacterial genome is essential to elucidation of transcriptional regulation of the organism. To gain a detailed understanding of the dynamically composed TU structures, we have used four strand-specific RNA-seq (ssRNA-seq) datasets collected under two experimental conditions to derive the genomic TU organization of Clostridium thermocellum using a machine-learning approach. Our method accurately predicted the genomic boundaries of individual TUs based on two sets of parameters measuring the RNA-seq expression patterns across the genome: expression-level continuity and variance. A total of 2590 distinct TUs are predicted based on the four RNA-seq datasets. Among the predicted TUs, 44% have multiple genes. We assessed our prediction method on an independent set of RNA-seq data with longer reads. The evaluation confirmed the high quality of the predicted TUs. Functional enrichment analyses on a selected subset of the predicted TUs revealed interesting biology. To demonstrate the generality of the prediction method, we have also applied the method to RNA-seq data collected on Escherichia coli and achieved high prediction accuracies. The TU prediction program named SeqTU is publicly available at https://code.google.com/p/seqtu/. We expect that the predicted TUs can serve as the baseline information for studying transcriptional and post-transcriptional regulation in C. thermocellum and other bacteria.",
            "authors": [
                "Chou W.-C.",
                "Ma Q.",
                "Yang S.",
                "Cao S.",
                "Klingeman D.M.",
                "Brown S.D.",
                "Xu Y."
            ],
            "cit_count": 9,
            "doi": "10.1093/nar/gkv177",
            "journal": "Nucleic Acids Research",
            "title": "Analysis of strand-specific RNA-seq data using machine learning reveals the structures of transcription units in Clostridium thermocellum",
            "type": "Primary",
            "year": "2015-02-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:seqtu",
        "biotoolsID": "seqtu",
        "description": "Analysis of strand-specific RNA-seq data using machine learning to reveal the structures of transcription units in Prokaryotes.",
        "homepage": "http://csbl.bmb.uga.edu/SeqTU/index.php",
        "name": "SeqTU",
        "version": [
            "r12"
        ]
    }
}