{
    "additionDate": "2020-01-09T17:58:37Z",
    "biotoolsCURIE": "biotools:BioSwitch",
    "biotoolsID": "BioSwitch",
    "confidence_flag": "tool",
    "description": "A tool for the detection of bistability and multi-steady state behaviour in signaling and gene regulatory networks.\n\nhttps://sites.google.com/view/bioswitch.\n\nBioSwitch is a Matlab software tool for detection of multi-steady state behaviour in biochemical reaction networks (specially suited for signaling and gene regulatory networks)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/view/bioswitch",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-09T14:09:11.234300Z",
    "name": "BioSwitch",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ746",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Multi-steady state behaviour, and in particular multi-stability, provides biological systems with the capacity to take reliable decisions (such as cell fate determination). A problem arising frequently in systems biology is to elucidate whether a signal transduction mechanism or a gene regulatory network has the capacity for multi-steady state behaviour, and consequently for a switch-like response to stimuli. Bifurcation diagrams are a powerful instrument in non-linear analysis to study the qualitative and quantitative behaviour of equilibria including bifurcation into different equilibrium branches and bistability. However, in the context of signalling pathways, the inherent large parametric uncertainty hampers the (direct) use of standard bifurcation tools. Results: We present BioSwitch, a toolbox to detect multi-steady state behaviour in signalling pathways and gene regulatory networks. The tool combines results from chemical reaction network theory with global optimization to efficiently detect whether a signalling pathway has the capacity to undergo a saddle node bifurcation, and in case of multi-stationarity, provides the exact coordinates of the bifurcation where to start a numerical continuation analysis with standard bifurcation tools, leading to two different branches of equilibria. Bistability detection in the G1/S transition pathway of Saccharomyces cerevisiae is included as an illustrative example.",
                "authors": [
                    {
                        "name": "Yordanov P."
                    },
                    {
                        "name": "Stelling J."
                    },
                    {
                        "name": "Otero-Muras I."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BioSwitch: A tool for the detection of bistability and multi-steady state behaviour in signalling and gene regulatory networks"
            },
            "pmid": "31609384"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ]
}