{
    "additionDate": "2017-05-02T07:18:52Z",
    "biotoolsCURIE": "biotools:nhlapred",
    "biotoolsID": "nhlapred",
    "credit": [
        {
            "email": "raghava@imtech.res.in",
            "name": "Dr G P S Raghava",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.imtech.res.in/raghava/nhlapred/team.html"
        }
    ],
    "description": "Allows to predict binding peptide for 67 MHC Class I alleles. This also allow to predict the proteasome cleavage site and binding peptide that have cleavage site at C terminus (potential T cell epitopes).",
    "documentation": [
        {
            "type": "General",
            "url": "http://crdd.osdd.net/raghava/nhlapred/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/nhlapred/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/nhlapred-neural-network-based-mhc-class-i-binding-peptide-prediction-server.html"
        }
    ],
    "name": "nHLAPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In the present study, a systematic attempt has been made to develop an accurate method for predicting MHC class I restricted T cell epitopes for a large number of MHC class I alleles. Initially, a quantitative matrix (QM)-based method was developed for 47 MHC class I alleles having at least 15 binders. A secondary artificial neural network (ANN)-based method was developed for 30 out of 47 MHC alleles having a minimum of 40 binders. Combination of these ANN- and QM-based prediction methods for 30 alleles improved the accuracy of prediction by 6% compared to each individual method. Average accuracy of hybrid method for 30 MHC alleles is 92.8%. This method also allows prediction of binders for 20 additional alleles using QM that has been reported in the literature, thus allowing prediction for 67 MHC class I alleles. The performance of the method was evaluated using jack-knife validation test. The performance of the methods was also evaluated on blind or independent data. Comparison of our method with existing MHC binder prediction methods for alleles studied by both methods shows that our method is superior to other existing methods. This method also identifies proteasomal cleavage sites in antigen sequences by implementing the matrices described earlier. Thus, the method that we discover allows the identification of MHC class I binders (peptides binding with many MHC alleles) having proteasomal cleavage site at C-terminus. The user-friendly result display format (HTML-II) can assist in locating the promiscuous MHC binding regions from antigen sequence. The method is available on the web at www.imtech.res.in/raghava/nhlapred and its mirror site is available at http://bioinformatics.uams.edu/mirror/nhlapred/. © Indian Academy of Sciences.",
                "authors": [
                    {
                        "name": "Bhasin M."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 77,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Journal of Biosciences",
                "title": "A hybrid approach for predicting promiscuous MHC class I restricted T cell epitopes"
            },
            "pmid": "17426378"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        }
    ],
    "validated": 1
}