{
    "additionDate": "2017-08-03T18:47:28Z",
    "biotoolsCURIE": "biotools:kappa",
    "biotoolsID": "kappa",
    "credit": [
        {
            "email": "dp.matton@umontreal.ca",
            "name": "Daniel P. Matton",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/kappa-sequence-search/?source=typ_redirect"
        }
    ],
    "description": "Sequence search program dedicated to the discovery and clustering of proteins defined by a key aminoacid pattern.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/kappa-sequence-search/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/kappa-sequence-search/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/kappa-1-0-key-amino-acid-pattern-based-protein-analyzer.html"
        }
    ],
    "name": "KAPPA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Proteins defined by a key amino acid pattern are key players in the exchange of signals between bacteria, animals and plants, as well as important mediators for cell-cell communication within a single organism. Their description and characterization open the way to a better knowledge of molecular signalling in a broad range of organisms, and to possible application in medical and agricultural research. The contrasted pattern of evolution in these proteins makes it difficult to detect and cluster them with classical sequence-based search tools. Here, we introduce Key Aminoacid Pattern-based Protein Analyzer (KAPPA), a new multi-platform program to detect them in a given set of proteins, analyze their pattern and cluster them by comparison to reference patterns (ab initio search) or internal pairwise comparison (de novo search). Results: In this study, we use the concrete example of cysteine-rich proteins (CRPs) to show that the similarity of two cysteine patterns can be precisely and efficiently assessed by a quantitative tool created for KAPPA: the j-score. We also demonstrate the clear advantage of KAPPA over other classical sequence search tools for ab initio search of new CRPs. Eventually, we present de novo clustering and subclustering functionalities that allow to rapidly generate consistent groups of CRPs without a seed reference. Availability and implementation: KAPPA executables are available for Linux, Windows and Mac OS at http://kappa-sequence-search.sourceforge.net.",
                "authors": [
                    {
                        "name": "Joly V."
                    },
                    {
                        "name": "Matton D.P."
                    }
                ],
                "citationCount": 5,
                "date": "2015-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "KAPPA, a simple algorithm for discovery and clustering of proteins defined by a key amino acid pattern: A case study of the cysteine-rich proteins"
            },
            "pmid": "25638812"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
