{
    "additionDate": "2020-01-14T09:31:47Z",
    "biotoolsCURIE": "biotools:CorDiff",
    "biotoolsID": "CorDiff",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "yihui_zhou@ncsu.edu",
            "name": "Yi‐Hui Zhou",
            "orcidid": "https://orcid.org/0000-0002-4092-7463",
            "typeEntity": "Person"
        }
    ],
    "description": "Set-based differential covariance testing for genomics.\n\nWe describe four different summary statistics, to ensure power and flexibility under various settings, including a new connectivity statistic that is sensitive to changes in overall covariance magnitude",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/CorDiff/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:31:47Z",
    "license": "GPL-2.0",
    "name": "CorDiff",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/STA4.235",
            "metadata": {
                "abstract": "© 2019 The Authors Stat Published by John Wiley & Sons LtdThe problem of detecting the changes in covariance for a single pair of genomic features has been studied in some detail but may be limited in importance or general applicability. For testing equality of covariance matrices of a set of features, many methods have been limited to the two-sample problem and involve varying assumptions on the number of features p versus the sample size n. More general covariance regression approaches are appealing but have been insufficiently structured to provide interpretable testing. To address these deficiencies, we propose a simple uniform framework to test association of covariance matrices with an experimental variable, whether discrete or continuous. We describe four different summary statistics, to ensure power and flexibility under various alternatives, including a new “connectivity” statistic that is sensitive to the changes in overall covariance magnitude. For continuous experimental variables, a natural individual “risk score” is associated with several of the statistics. We establish asymptotic results applicable to both continuous and discrete responses, with relatively mild conditions and allowing for situations where p>n. We also show that the proposed statistics are permutationally equivalent to some existing methods in the two-sample special case. We demonstrate the power and utility of our approaches via simulation and analysis of real data. The R package CorDiff is published on R CRAN.",
                "authors": [
                    {
                        "name": "Zhou Y.-H."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Stat",
                "title": "Set-based differential covariance testing for genomics"
            },
            "pmcid": "PMC6853199",
            "pmid": "31763041"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ]
}