{
    "additionDate": "2021-01-18T11:12:13Z",
    "biotoolsCURIE": "biotools:seekcrit",
    "biotoolsID": "seekcrit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "juw.park@louisville.edu",
            "name": "Juw Won Park",
            "orcidid": "https://orcid.org/0000-0002-4610-6893",
            "typeEntity": "Person"
        },
        {
            "email": "nigel.cooper@louisville.edu",
            "name": "Nigel G. F. Cooper",
            "orcidid": "https://orcid.org/0000-0001-6598-5136",
            "typeEntity": "Person"
        }
    ],
    "description": "Detecting and characterizing differentially expressed circular RNAs using high-throughput sequencing data.\n\nNOTE: UNDER CONSTRUCTION, the actual software is NOT released yet.\n\nseek for circular RNA in transcriptome (identifies deferentially expressed circRNAs between two samples).\n\ngit clone https://github.com/UofLBioinformatics/seekCRIT.git.\n\nRun testrun.sh to test the installation and the dependencies of seekCRIT and also it will test the installation with CRTL12.fastq and IR12.fastq by specifying the path for FASTA and gtf files:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UofLBioinformatics/seekCRIT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-16T13:46:46Z",
    "license": "MIT",
    "name": "seekCRIT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008338",
            "metadata": {
                "abstract": "Copyright: © 2020 Chaabane et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Over the past two decades, researchers have discovered a special form of alternative splicing that produces a circular form of RNA. Although these circular RNAs (circRNAs) have garnered considerable attention in the scientific community for their biogenesis and functions, the focus of current studies has been on the tissue-specific circRNAs that exist only in one tissue but not in other tissues or on the disease-specific circRNAs that exist in certain disease conditions, such as cancer, but not under normal conditions. This approach was conducted in the relative absence of methods that analyze a group of common circRNAs that exist in both conditions, but are more abundant in one condition relative to another (differentially expressed). Studies of differentially expressed circRNAs (DECs) between two conditions would serve as a significant first step in filling this void. Here, we introduce a novel computational tool, seekCRIT (seek for differentially expressed CircRNAs In Transcriptome), that identifies the DECs between two conditions from high-throughput sequencing data. Using rat retina RNA-seq data from ischemic and normal conditions, we show that over 74% of identifiable circRNAs are expressed in both conditions and over 40 circRNAs are differentially expressed between two conditions. We also obtain a high qPCR validation rate of 90% for DECs with a FDR of < 5%. Our results demonstrate that seekCRIT is a novel and efficient approach to detect DECs using rRNA depleted RNA-seq data. seekCRIT is freely downloadable at https://github.com/UofLBioinformatics/seekCRIT. The source code is licensed under the MIT License. seekCRIT is developed and tested on Linux CentOS-7.",
                "authors": [
                    {
                        "name": "Andreeva K."
                    },
                    {
                        "name": "Chaabane M."
                    },
                    {
                        "name": "Cooper N.G.F."
                    },
                    {
                        "name": "Hwang J.Y."
                    },
                    {
                        "name": "Kook T.L."
                    },
                    {
                        "name": "Park J.W."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-20T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "seekCRIT: Detecting and characterizing differentially expressed circular RNAs using high-throughput sequencing data"
            },
            "pmcid": "PMC7598922",
            "pmid": "33079938"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
