{
    "additionDate": "2018-05-06T16:04:24Z",
    "biotoolsCURIE": "biotools:beacon",
    "biotoolsID": "beacon",
    "credit": [
        {
            "name": "Contact list",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cbrc.kaust.edu.sa/BEACON/About.html"
        }
    ],
    "description": "Automated tool for Bacterial GEnome Annotation ComparisON.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbrc.kaust.edu.sa/BEACON/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://www.cbrc.kaust.edu.sa/BEACON/",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "BEACON",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-015-1826-4",
            "metadata": {
                "abstract": "© 2015 Kalkatawi et al.Background: Genome annotation is one way of summarizing the existing knowledge about genomic characteristics of an organism. There has been an increased interest during the last several decades in computer-based structural and functional genome annotation. Many methods for this purpose have been developed for eukaryotes and prokaryotes. Our study focuses on comparison of functional annotations of prokaryotic genomes. To the best of our knowledge there is no fully automated system for detailed comparison of functional genome annotations generated by different annotation methods (AMs). Results: The presence of many AMs and development of new ones introduce needs to: a/ compare different annotations for a single genome, and b/ generate annotation by combining individual ones. To address these issues we developed an Automated Tool for Bacterial GEnome Annotation ComparisON (BEACON) that benefits both AM developers and annotation analysers. BEACON provides detailed comparison of gene function annotations of prokaryotic genomes obtained by different AMs and generates extended annotations through combination of individual ones. For the illustration of BEACON's utility, we provide a comparison analysis of multiple different annotations generated for four genomes and show on these examples that the extended annotation can increase the number of genes annotated by putative functions up to 27 %, while the number of genes without any function assignment is reduced. Conclusions: We developed BEACON, a fast tool for an automated and a systematic comparison of different annotations of single genomes. The extended annotation assigns putative functions to many genes with unknown functions. BEACON is available under GNU General Public License version 3.0 and is accessible at: http://www.cbrc.kaust.edu.sa/BEACON/ .",
                "authors": [
                    {
                        "name": "Kalkatawi M."
                    },
                    {
                        "name": "Alam I."
                    },
                    {
                        "name": "Bajic V.B."
                    }
                ],
                "citationCount": 15,
                "date": "2015-08-18T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "BEACON: Automated tool for Bacterial GEnome Annotation ComparisON"
            },
            "pmcid": "PMC4539851",
            "pmid": "26283419"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1
}