{
    "additionDate": "2018-05-29T11:43:31Z",
    "biotoolsCURIE": "biotools:symbiogbr",
    "biotoolsID": "symbiogbr",
    "credit": [
        {
            "email": "l.tonk@uq.edu.au",
            "name": "Linda Tonk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "pim@uq.edu.au",
            "name": "Pim Bongaerts",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database of all currently available Symbiodinium sequences and associated host information of data collected from the Great Barrier Reef into a single relational database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.symbiogbr.org/introduction"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://www.symbiogbr.org",
    "language": [
        "Ruby",
        "SQL"
    ],
    "lastUpdate": "2018-12-11T17:20:14Z",
    "name": "SymbioGBR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/1472-6785-13-7",
            "metadata": {
                "abstract": "Background: The algal endosymbionts (genus Symbiodinium) associated with scleractinian corals (and other reef invertebrates) have received a lot of research attention in the past decade, particularly as certain host-symbiont associations appear more affected by increasing seawater temperatures than others. With the rapid accumulation of information on the diversity of Symbiodinium, it is becoming increasingly difficult to compare newly acquired Symbiodinium data with existing data to detect patterns of host-symbiont specificity on broader spatial scales. The lack of a general consensus on the classification of Symbiodinium species coupled with the variety of different markers used to identify the genus Symbiodinium (ITS1, ITS2, LSU D1/D2, chloroplast 23S rDNA and psbA minicircle) further complicate direct comparison. Description: The SymbioGBR database compiles all currently available Symbiodinium sequences and associated host information of data collected from the Great Barrier Reef into a single relational database that is accessible via a user-friendly, searchable web-based application (http://www.SymbioGBR.org). SymbioGBR allows users to query Symbiodinium types or sequences sourced from various genetic markers (e.g. ITS1, ITS2, LSU D1/D2 and chloroplast 23S) and invertebrate host species to explore their reported associations. In addition, as the database includes sequence information of multiple genetic markers, it allows cross-referencing between conventional (e.g. ITS2 region) and novel markers that exhibit low intragenomic variability (e.g. psbA region). Finally, the database is based on the collection details of individual specimens. Such host-symbiont associations can be assessed quantitatively and viewed in relation to their environmental and geographic context. Conclusions: The SymbioGBR database provides a comprehensive overview of Symbiodinium diversity and host-associations on the Great Barrier Reef. It provides a quick, user-friendly means to compare newly acquired data on Symbiodinium (e.g. raw sequences or characterized Symbiodinium types) with previous data on the diversity of invertebrate host-symbiont associations on the GBR. The inclusion of psbAncr sequence information allows for validation of widely used ITS1/ITS2 markers and their ability to accurately identify relevant sequences. Most importantly, centralization of sequence information from multiple genetic markers will aid the classification of Symbiodinium species diversity and allow researchers to easily compare patterns of host-Symbiodinium associations. © 2013 Tonk et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Tonk L."
                    },
                    {
                        "name": "Bongaerts P."
                    },
                    {
                        "name": "Sampayo E.M."
                    },
                    {
                        "name": "Hoegh-Guldberg O."
                    }
                ],
                "citationCount": 39,
                "date": "2013-03-13T00:00:00Z",
                "journal": "BMC Ecology",
                "title": "SymbioGBR: A web-based database of Symbiodinium associated with cnidarian hosts on the Great Barrier Reef"
            },
            "pmcid": "PMC3616961",
            "pmid": "23497177"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ],
    "validated": 1
}