{
    "additionDate": "2022-10-09T10:31:02.391959Z",
    "biotoolsCURIE": "biotools:a-hiot",
    "biotoolsID": "a-hiot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vishal@ihbt.res.in",
            "name": "Vishal Acharya",
            "orcidid": "https://orcid.org/0000-0003-2175-9799",
            "typeEntity": "Person"
        }
    ],
    "description": "A method that simultaneously identifies and optimizes hit/lead molecules by integrating chemical- and protein-space-driven architectures and stands for an automated-hit identification and optimization tool (A-HIOT).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/neeraj-24/A-HIOT",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2022-10-09T10:31:02.394705Z",
    "license": "Not licensed",
    "name": "A-HIOT",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S13321-022-00630-7",
            "metadata": {
                "abstract": "© 2022, The Author(s).Virtual screening (VS) aids in prioritizing unknown bio-interactions between compounds and protein targets for empirical drug discovery. In standard VS exercise, roughly 10% of top-ranked molecules exhibit activity when examined in biochemical assays, which accounts for many false positive hits, making it an arduous task. Attempts for conquering false-hit rates were developed through either ligand-based or structure-based VS separately; however, nonetheless performed remarkably well. Here, we present an advanced VS framework—automated hit identification and optimization tool (A-HIOT)—comprises chemical space-driven stacked ensemble for identification and protein space-driven deep learning architectures for optimization of an array of specific hits for fixed protein receptors. A-HIOT implements numerous open-source algorithms intending to integrate chemical and protein space leading to a high-quality prediction. The optimized hits are the selective molecules which we retrieve after extreme refinement implying chemical space and protein space modules of A-HIOT. Using CXC chemokine receptor 4, we demonstrated the superior performance of A-HIOT for hit molecule identification and optimization with tenfold cross-validation accuracies of 94.8% and 81.9%, respectively. In comparison with other machine learning algorithms, A-HIOT achieved higher accuracies of 96.2% for hit identification and 89.9% for hit optimization on independent benchmark datasets for CXCR4 and 86.8% for hit identification and 90.2% for hit optimization on independent test dataset for androgen receptor (AR), thus, shows its generalizability and robustness. In conclusion, advantageous features impeded in A-HIOT is making a reliable approach for bridging the long-standing gap between ligand-based and structure-based VS in finding the optimized hits for the desired receptor. The complete resource (framework) code is available at https://gitlab.com/neeraj-24/A-HIOT. Graphical Abstract: [Figure not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Acharya V."
                    },
                    {
                        "name": "Kumar N."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Machine intelligence-driven framework for optimized hit selection in virtual screening"
            },
            "pmcid": "PMC9306080",
            "pmid": "35869511"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
