{
    "accessibility": "Open access",
    "additionDate": "2023-09-15T16:24:25.402195Z",
    "biotoolsCURIE": "biotools:imperm",
    "biotoolsID": "imperm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "Fast and comprehensive IMmune Paired-End Reads Merger for sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangwei2015/IMperm",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-24T14:40:58.572676Z",
    "license": "MIT",
    "name": "IMperm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbad080",
            "metadata": {
                "abstract": "The adaptive immune receptor repertoire (AIRR), consisting of T- and B-cell receptors, is the core component of the immune system. The AIRR sequencing is commonly used in cancer immunotherapy and minimal residual disease (MRD) detection of leukemia and lymphoma. The AIRR is captured by primers and sequenced to yield paired-end (PE) reads. The PE reads could be merged into one sequence by the overlapped region between them. However, the wide range of AIRR data raises the difficulty, so a special tool is required. We developed a software package for IMmune PE reads merger of sequencing data, named IMperm. We used the k-mer-and-vote strategy to pin down the overlapped region rapidly. IMperm could handle all types of PE reads, eliminate adapter contamination and successfully merge low-quality and minor/non-overlapping reads. Compared with existing tools, IMperm performed better in both simulated and sequencing data. Notably, IMperm was well suited to processing the data of MRD detection in leukemia and lymphoma and detected 19 novel MRD clones in 14 patients with leukemia from previously published data. Additionally, IMperm can handle PE reads from other sources, and we demonstrated its effectiveness on two genomic and one cell-free deoxyribonucleic acid datasets. IMperm is implemented in the C programming language and consumes little runtime and memory. It is freely available at https://github.com/zhangwei2015/IMperm.",
                "authors": [
                    {
                        "name": "Ju J."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li S.C."
                    },
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Lu S."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Xiong T."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2023-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "IMperm: a fast and comprehensive IMmune Paired-End Reads Merger for sequencing data"
            },
            "pmid": "36892171"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
