{
    "additionDate": "2019-11-14T19:42:48Z",
    "biotoolsCURIE": "biotools:HPAanalyze",
    "biotoolsID": "HPAanalyze",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "trannhatanh89@gmail.com",
            "name": "Anh Nhat Tran",
            "typeEntity": "Person"
        },
        {
            "email": "hjelmea@uab.edu",
            "name": "Anita B. Hjelmeland",
            "orcidid": "https://orcid.org/0000-0003-2200-3248",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package that facilitates the retrieval and analysis of the Human Protein Atlas data | To access this site please go to: http://alexdussaq.info/jsHPAanalyze | A Bioconductor package to retrieve and analyze data from the Human Protein Atlas | Results: HPAanalyze is an R package for retreiving and performing exploratory data analysis from HPA. It provides functionality for importing data tables and xml files from HPA, exporting and visualizing data, as well as download all staining images of interest. The package is free, open source, and available via Github | Background: The Human Protein Atlas program aims to map human proteins via multiple technologies including imaging, proteomics and transcriptomics",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/adussaq/jsHPAanalyze",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2020-12-10T09:40:55Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/trannhatanh89/HPAanalyze"
        }
    ],
    "name": "HPAanalyze",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3059-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The Human Protein Atlas (HPA) aims to map human proteins via multiple technologies including imaging, proteomics and transcriptomics. Access of the HPA data is mainly via web-based interface allowing views of individual proteins, which may not be optimal for data analysis of a gene set, or automatic retrieval of original images. Results: HPAanalyze is an R package for retrieving and performing exploratory analysis of data from HPA. HPAanalyze provides functionality for importing data tables and xml files from HPA, exporting and visualizing data, as well as downloading all staining images of interest. The package is free, open source, and available via Bioconductor and GitHub. We provide examples of the use of HPAanalyze to investigate proteins altered in the deadly brain tumor glioblastoma. For example, we confirm Epidermal Growth Factor Receptor elevation and Phosphatase and Tensin Homolog loss and suggest the importance of the GTP Cyclohydrolase I/Tetrahydrobiopterin pathway. Additionally, we provide an interactive website for non-programmers to explore and visualize data without the use of R. Conclusions: HPAanalyze integrates into the R workflow with the tidyverse framework, and it can be used in combination with Bioconductor packages for easy analysis of HPA data.",
                "authors": [
                    {
                        "name": "Tran A.N."
                    },
                    {
                        "name": "Dussaq A.M."
                    },
                    {
                        "name": "Kennell T."
                    },
                    {
                        "name": "Willey C.D."
                    },
                    {
                        "name": "Hjelmeland A.B."
                    }
                ],
                "citationCount": 4,
                "date": "2019-09-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HPAanalyze: An R package that facilitates the retrieval and analysis of the Human Protein Atlas data"
            },
            "pmcid": "PMC6734269",
            "pmid": "31500569"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}