{
    "additionDate": "2020-01-14T19:48:38Z",
    "biotoolsCURIE": "biotools:PHI-Nets",
    "biotoolsID": "PHI-Nets",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "martin.urban@rothamsted.ac.uk",
            "name": "Martin Urban",
            "typeEntity": "Person"
        }
    ],
    "description": "PHI-Nets is a network resource for Ascomycete fungal pathogens to annotate and identify putative virulence interacting proteins and siRNAs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PHI-base/phi-nets/",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2021-01-09T14:44:42Z",
    "license": "MIT",
    "name": "PHI-Nets",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FMICB.2019.02721",
            "metadata": {
                "abstract": "© Copyright © 2019 Janowska-Sejda, Lysenko, Urban, Rawlings, Tsoka and Hammond-Kosack.Interactions between proteins underlie all aspects of complex biological mechanisms. Therefore, methodologies based on complex network analyses can facilitate identification of promising candidate genes involved in phenotypes of interest and put this information into appropriate contexts. To facilitate discovery and gain additional insights into globally important pathogenic fungi, we have reconstructed computationally inferred interactomes using an interolog and domain-based approach for 15 diverse Ascomycete fungal species, across nine orders, specifically Aspergillus fumigatus, Bipolaris sorokiniana, Blumeria graminis f. sp. hordei, Botrytis cinerea, Colletotrichum gloeosporioides, Colletotrichum graminicola, Fusarium graminearum, Fusarium oxysporum f. sp. lycopersici, Fusarium verticillioides, Leptosphaeria maculans, Magnaporthe oryzae, Saccharomyces cerevisiae, Sclerotinia sclerotiorum, Verticillium dahliae, and Zymoseptoria tritici. Network cartography analysis was associated with functional patterns of annotated genes linked to the disease-causing ability of each pathogen. In addition, for the best annotated organism, namely F. graminearum, the distribution of annotated genes with respect to network structure was profiled using a random walk with restart algorithm, which suggested possible co-location of virulence-related genes in the protein–protein interaction network. In a second ‘use case’ study involving two networks, namely B. cinerea and F. graminearum, previously identified small silencing plant RNAs were mapped to their targets. The F. graminearum phenotypic network analysis implicates eight B. cinerea targets and 35 F. graminearum predicted interacting proteins as prime candidate virulence genes for further testing. All 15 networks have been made accessible for download at www.phi-base.org providing a rich resource for major crop plant pathogens.",
                "authors": [
                    {
                        "name": "Janowska-Sejda E.I."
                    },
                    {
                        "name": "Lysenko A."
                    },
                    {
                        "name": "Urban M."
                    },
                    {
                        "name": "Rawlings C."
                    },
                    {
                        "name": "Tsoka S."
                    },
                    {
                        "name": "Hammond-Kosack K.E."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-06T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "PHI-Nets: A Network Resource for Ascomycete Fungal Pathogens to Annotate and Identify Putative Virulence Interacting Proteins and siRNA Targets"
            },
            "pmcid": "PMC6908471",
            "pmid": "31866958"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}