{
    "additionDate": "2019-11-14T20:00:12Z",
    "biotoolsCURIE": "biotools:SCIMAP",
    "biotoolsID": "SCIMAP",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/intpred (ORG.UK), bio.tools/dbass (ORG.UK), bio.tools/rightfield (ORG.UK), bio.tools/wgbssuite (ORG.UK), bio.tools/cadre_genomes_browser (ORG.UK) | > CORRECT NAME OF TOOL COULD ALSO BE 'walkover', 'catchment', 'CSAs', 'diffuse pollution' | Identifying critical source areas using multiple methods for effective diffuse pollution mitigation | A framework for modelling and mapping diffuse pollution risk across landscapes | SCIMAP - Diffuse Pollution Risk Mapping | To identify the locations that are a problem, we developed SCIMAP. This project was originally jointly developed between Durham and Lancaster Universities. SCIMAP is supported by the U.K.’s Natural Environment Research Council, the Eden Rivers Trust, the Department of the Environment, Food and Rural Affairs and the Environment Agency. Following this project SCIMAP has been supported by Durham University, the Rivers Trust and the Environment Agency",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.scimap.org.uk/",
    "lastUpdate": "2019-11-14T20:00:12Z",
    "name": "SCIMAP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JENVMAN.2019.109366",
            "metadata": {
                "abstract": "© 2019 The AuthorsDiffuse pollution from agriculture constitutes a key pressure on the water quality of freshwaters and is frequently the cause of ecological degradation. The problem of diffuse pollution can be conceptualised with a source-mobilisation-pathway (or delivery)-impact model, whereby the combination of high source risk and strong connected pathways leads to ‘critical source areas’ (CSAs). These areas are where most diffuse pollution will originate, and hence are the optimal places to implement mitigation measures. However, identifying the locations of these areas is a key problem across different spatial scales within catchments. A number of approaches are frequently used for this assessment, although comparisons of these assessments are rarely carried out. We evaluate the CSAs identified via traditional walkover surveys supported by three different approaches, highlighting their benefits and disadvantages. These include a custom designed smartphone app; a desktop geographic information system (GIS) and terrain analysis-based SCIMAP (Sensitive Catchment Integrated Modelling and Analysis Platform) approach; and the use of a high spatial resolution drone dataset as an improved input data for SCIMAP modelling. Each of these methods captures the locations of the CSAs, revealing similarities and differences in the prioritisation of CSA features. The differences are due to the temporal and spatial resolution of the three methods such as the use of static land cover information, the ability to capture small scale features, such as gateways and the incomplete catchment coverage of the walkover survey. The relative costs and output resolutions of the three methods indicate that they are suitable for application at different catchment scales in conjunction with other methods. Based on the results in this paper, it is recommended that a multi-evidence-based approach to diffuse pollution management is taken across catchment spatial scales, incorporating local knowledge from the walkover with the different data resolutions of the SCIMAP approach.",
                "authors": [
                    {
                        "name": "Reaney S.M."
                    },
                    {
                        "name": "Mackay E.B."
                    },
                    {
                        "name": "Haygarth P.M."
                    },
                    {
                        "name": "Fisher M."
                    },
                    {
                        "name": "Molineux A."
                    },
                    {
                        "name": "Potts M."
                    },
                    {
                        "name": "Benskin C.M.H."
                    }
                ],
                "date": "2019-11-15T00:00:00Z",
                "journal": "Journal of Environmental Management",
                "title": "Identifying critical source areas using multiple methods for effective diffuse pollution mitigation"
            },
            "pmid": "31494409"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ]
}