{
    "additionDate": "2021-01-18T11:11:43Z",
    "biotoolsCURIE": "biotools:hichap",
    "biotoolsID": "hichap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chengpeng@ynu.edu.cn",
            "name": "Cheng Peng",
            "orcidid": "https://orcid.org/0000-0002-0448-0094",
            "typeEntity": "Person"
        }
    ],
    "description": "a package to correct and analyze the diploid Hi-C data.\n\nAn integrated package to process diploid Hi-C data.\n\nHiCHap is a Python package designed to process and analyze Hi-C data, primarily the diploid Hi-C data for phased haplotypes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/HiCHap/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T11:33:09Z",
    "license": "GPL-3.0",
    "name": "HiCHap",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07165-X",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: In diploid cells, it is important to construct maternal and paternal Hi-C contact maps respectively since the two homologous chromosomes can differ in chromatin three-dimensional (3D) organization. Though previous softwares could construct diploid (maternal and paternal) Hi-C contact maps by using phased genetic variants, they all neglected the systematic biases in diploid Hi-C contact maps caused by variable genetic variant density in the genome. In addition, few of softwares provided quantitative analyses on allele-specific chromatin 3D organization, including compartment, topological domain and chromatin loop. Results: In this work, we revealed the feature of allele-assignment bias caused by the variable genetic variant density, and then proposed a novel strategy to correct the systematic biases in diploid Hi-C contact maps. Based on the bias correction, we developed an integrated tool, called HiCHap, to perform read mapping, contact map construction, whole-genome identification of compartments, topological domains and chromatin loops, and allele-specific testing for diploid Hi-C data. Our results show that the correction on allele-assignment bias in HiCHap does significantly improve the quality of diploid Hi-C contact maps, which subsequently facilitates the whole-genome identification of diploid chromatin 3D organization, including compartments, topological domains and chromatin loops. Finally, HiCHap also supports the data analysis for haploid Hi-C maps without distinguishing two homologous chromosomes. Conclusions: We provided an integrated package HiCHap to perform the data processing, bias correction and structural analysis for diploid Hi-C data. The source code and tutorial of software HiCHap are freely available at https://pypi.org/project/HiCHap/.",
                "authors": [
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Peng C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "HiCHap: a package to correct and analyze the diploid Hi-C data"
            },
            "pmcid": "PMC7590616",
            "pmid": "33109075"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
