{
    "additionDate": "2024-07-24T11:06:50.936808Z",
    "biotoolsCURIE": "biotools:antibp3",
    "biotoolsID": "antibp3",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr. Gajendra P. S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/"
        }
    ],
    "description": "AntiBP3: A Method for Predicting Antibacterial Peptides against Gram-Positive/Negative/Variable Bacteria",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://webs.iiitd.edu.in/raghava/antibp3/",
    "lastUpdate": "2024-11-24T13:49:59.397783Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/antibp3/"
        }
    ],
    "name": "AntiBP3",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.3390/antibiotics13020168",
            "metadata": {
                "abstract": "Most of the existing methods developed for predicting antibacterial peptides (ABPs) are mostly designed to target either gram-positive or gram-negative bacteria. In this study, we describe a method that allows us to predict ABPs against gram-positive, gram-negative, and gram-variable bacteria. Firstly, we developed an alignment-based approach using BLAST to identify ABPs and achieved poor sensitivity. Secondly, we employed a motif-based approach to predict ABPs and obtained high precision with low sensitivity. To address the issue of poor sensitivity, we developed alignment-free methods for predicting ABPs using machine/deep learning techniques. In the case of alignment-free methods, we utilized a wide range of peptide features that include different types of composition, binary profiles of terminal residues, and fastText word embedding. In this study, a five-fold cross-validation technique has been used to build machine/deep learning models on training datasets. These models were evaluated on an independent dataset with no common peptide between training and independent datasets. Our machine learning-based model developed using the amino acid binary profile of terminal residues achieved maximum AUC 0.93, 0.98, and 0.94 for gram-positive, gram-negative, and gram-variable bacteria, respectively, on an independent dataset. Our method performs better than existing methods when compared with existing approaches on an independent dataset. A user-friendly web server, standalone package and pip package have been developed to facilitate peptide-based therapeutics.",
                "authors": [
                    {
                        "name": "Bajiya N."
                    },
                    {
                        "name": "Choudhury S."
                    },
                    {
                        "name": "Dhall A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 4,
                "date": "2024-02-01T00:00:00Z",
                "journal": "Antibiotics",
                "title": "AntiBP3: A Method for Predicting Antibacterial Peptides against Gram-Positive/Negative/Variable Bacteria"
            },
            "pmcid": "PMC10885866",
            "pmid": "38391554"
        }
    ]
}
