{
    "name": "IBM Bioinformatics and Pattern Discovery Group", 
    "description": "Extensive server possessing a wide range of tools for pattern discovery in DNA and protein sequences as well as in text. Tools for multiple sequence alignment, gene discovery, protein annotation, and other applications also exist on this server. A detailed help page is provided for all tools.", 
    "homepage": "http://cbcsrv.watson.ibm.com/Tspd.html", 
    "biotoolsID": "ibm_pattern_discovery", 
    "biotoolsCURIE": "biotools:ibm_pattern_discovery", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0452", 
                    "term": "Indel detection"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0492", 
                    "term": "Multiple sequence alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2479", 
                    "term": "Protein sequence analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3761", 
                    "term": "Service discovery"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0238", 
                    "term": "Sequence motif discovery"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0623", 
            "term": "Gene and protein families"
        }, 
        {
            "uri": "http://edamontology.org/topic_3510", 
            "term": "Protein sites, features and motifs"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12060689", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Dictionary-driven prokaryotic gene finding", 
                "abstract": "Gene identification, also known as gene finding or gene recognition, is among the important problems of molecular biology that have been receiving increasing attention with the advent of large scale sequencing projects. Previous strategies for solving this problem can be categorized into essentially two schools of thought: one school employs sequence composition statistics, whereas the other relies on database similarity searches. In this paper, we propose a new gene identification scheme that combines the best characteristics from each of these two schools. In particular, our method determines gene candidates among the ORFs that can be identified in a given DNA strand through the use of the Bio-Dictionary, a database of patterns that covers essentially all of the currently available sample of the natural protein sequence space. Our approach relies entirely on the use of redundant patterns as the agents on which the presence or absence of genes is predicated and does not employ any additional evidence, e.g. ribosome-binding site signals. The Bio-Dictionary Gene Finder (BDGF), the algorithm's implementation, is a single computational engine able to handle the gene identification task across distinct archaeal and bacterial genomes. The engine exhibits performance that is characterized by simultaneous very high values of sensitivity and specificity, and a high percentage of correctly predicted start sites. Using a collection of patterns derived from an old (June 2000) release of the Swiss-Prot/TrEMBL database that contained 451 602 proteins and fragments, we demonstrate our method's generality and capabilities through an extensive analysis of 17 complete archaeal and bacterial genomes. Examples of previously unreported genes are also shown and discussed in detail.", 
                "date": "2002-06-15T00:00:00Z", 
                "citationCount": 29, 
                "authors": [
                    {
                        "name": "Shibuya T."
                    }, 
                    {
                        "name": "Rigoutsos I."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "9520502", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Combinatorial pattern discovery in biological sequences: The TEIRESIAS algorithm", 
                "abstract": "Motivation: The discovery of motifs in biological sequences is an important problem. Results: This paper presents a new algorithm for the discovery of rigid patterns (motifs) in biological sequences. Our method is combinatorial in nature and able to produce all patterns that appear in at least a (user-defined) minimum number of sequences, yet it manages to be very efficient by avoiding the enumeration of the entire pattern space. Furthermore, the reported patterns are maximal: any reported pattern cannot be made more specific and still keep on appearing at the exact same positions within the input sequences. The effectiveness of the proposed approach is showcased on a number of test cases which aim to: (i) validate the approach through the discovery of previously reported patterns; (ii) demonstrate the capability to identify automatically highly selective patterns particular to the sequences under consideration. Finally, experimental analysis indicates that the algorithm is output sensitive, i.e. its running time is quasi-linear to the size of the generated output. Contact: rigoutso@us.ibm.com .", 
                "date": "1998-01-01T00:00:00Z", 
                "citationCount": 382, 
                "authors": [
                    {
                        "name": "Rigoutsos I."
                    }, 
                    {
                        "name": "Floratos A."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12824385", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The web server of IBM's Bionformatics and Pattern Discovery group", 
                "abstract": "We herein present and discuss the services and content which are available on the web server of IBM's Bioinformatics and Pattern Discovery group. The server is operational around the clock and provides access to a variety of methods that have been published by the group's members and collaborators. The available tools correspond to applications ranging from the discovery of patterns in streams of events and the computation of multiple sequence alignments, to the discovery of genes in nucleic acid sequences and the interactive annotation of amino acid sequences. Additionally, annotations for more than 70 archaeal, bacterial, eukaryotic and viral genomes are available on-line and can be searched interactively. The tools and code bundles can be accessed beginning at http://cbcsrv.watson.ibm.com/Tspd.html whereas the genomics annotations are available at http://cbcsrv.watson.ibm.com/Annotations/.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Huynh T."
                    }, 
                    {
                        "name": "Rigoutsos I."
                    }, 
                    {
                        "name": "Parida L."
                    }, 
                    {
                        "name": "Platt D."
                    }, 
                    {
                        "name": "Shibuya T."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12202776", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Dictionary-driven protein annotation", 
                "abstract": "Computational methods seeking to automatically determine the properties (functional, structural, physicochemical, etc.) of a protein directly from the sequence have long been the focus of numerous research groups. With the advent of advanced sequencing methods and systems, the number of amino acid sequences that are being deposited in the public databases has been increasing steadily. This has in turn generated a renewed demand for automated approaches that can annotate individual sequences and complete genomes quickly, exhaustively and objectively. In this paper, we present one such approach that is centered around and exploits the Bio-Dictionary, a collection of amino acid patterns that completely covers the natural sequence space and can capture functional and structural signals that have been reused during evolution, within and across protein families. Our annotation approach also makes use of a weighted, position-specific scoring scheme that is unaffected by the over-representation of well-conserved proteins and protein fragments in the databases used. For a given query sequence, the method permits one to determine, in a single pass, the following: local and global similarities between the query and any protein already present in a public database; the likeness of the query to all available archaeal/ bacterial/eukaryotic/viral sequences in the database as a function of amino acid position within the query; the character of secondary structure of the query as a function of amino acid position within the query; the cytoplasmic, transmembrane or extracellular behavior of the query; the nature and position of binding domains, active sites, post-translationally modified sites, signal peptides, etc. In terms of performance, the proposed method is exhaustive, objective and allows for the rapid annotation of individual sequences and full genomes. Annotation examples are presented and discussed in Results, including individual queries and complete genomes that were released publicly after we built the Bio-Dictionary that is used in our experiments. Finally, we have computed the annotations of more than 70 complete genomes and made them available on the World Wide Web at http://cbcsrv.watson.ibm.com/Annotations/.", 
                "date": "2002-09-01T00:00:00Z", 
                "citationCount": 24, 
                "authors": [
                    {
                        "name": "Rigoutsos I."
                    }, 
                    {
                        "name": "Huynh T."
                    }, 
                    {
                        "name": "Floratos A."
                    }, 
                    {
                        "name": "Parida L."
                    }, 
                    {
                        "name": "Platt D."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "11056059", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The emergence of pattern discovery techniques in computational biology", 
                "abstract": "In the past few years, pattern discovery has been emerging as a generic tool of choice for tackling problems from the computational biology domain. In this presentation, and after defining the problem in its generality, we review some of the algorithms that have appeared in the literature and describe several applications of pattern discovery to problems from computational biology. (C) 2000 Academic Press.", 
                "date": "2000-01-01T00:00:00Z", 
                "citationCount": 60, 
                "authors": [
                    {
                        "name": "Rigoutsos I."
                    }, 
                    {
                        "name": "Floratos A."
                    }, 
                    {
                        "name": "Parida L."
                    }, 
                    {
                        "name": "Gao Y."
                    }, 
                    {
                        "name": "Platt D."
                    }
                ], 
                "journal": "Metabolic Engineering"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15215340", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The web server of IBM's Bioinformatics and Pattern Discovery group: 2004 update", 
                "abstract": "In this report, we provide an update on the services and content which are available on the web server of IBM's Bioinformatics and Pattern Discovery group. The server, which is operational around the clock, provides access to a large number of methods that have been developed and published by the group's members. There is an increasing number of problems that these tools can help tackle; these problems range from the discovery of patterns in streams of events and the computation of multiple sequence alignments, to the discovery of genes in nucleic acid sequences, the identification - directly from sequence - of structural deviations from α-helicity and the annotation of amino acid sequences for antimicrobial activity. Additionally, annotations for more than 130 archaeal, bacterial, eukaryotic and viral genomes are now available on-line and can be searched interactively. The tools and code bundles continue to be accessible from http://cbcsrv.watson.ibm.com/Tspd.html whereas the genomics annotations are available at http://cbcsrv.watson.ibm.com/Annotations/. © Oxford University Press 2004; all rights reserved.", 
                "date": "2004-07-01T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Huynh T."
                    }, 
                    {
                        "name": "Rigoutsos I."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "10786305", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Building dictionaries of 1D and 3D motifs by mining the Unaligned 1D sequences of 17 archaeal and bacterial genomes.", 
                "abstract": "We have used the Teiresias algorithm to carry out unsupervised pattern discovery in a database containing the unaligned ORFs from the 17 publicly available complete archaeal and bacterial genomes and build a 1D dictionary of motifs. These motifs which we refer to as seqlets account for and cover 97.88% of this genomic input at the level of amino acid positions. Each of the seqlets in this 1D dictionary was located among the sequences in Release 38.0 of the Protein Data Bank and the structural fragments corresponding to each seqlet's instances were identified and aligned in three dimensions: those of the seqlets that resulted in RMSD errors below a pre-selected threshold of 2.5 Angstroms were entered in a 3D dictionary of structurally conserved seqlets. These two dictionaries can be thought of as cross-indices that facilitate the tackling of tasks such as automated functional annotation of genomic sequences, local homology identification, local structure characterization, comparative genomics, etc.", 
                "date": "1999-01-01T00:00:00Z", 
                "citationCount": 9, 
                "authors": [
                    {
                        "name": "Rigoutsos I."
                    }, 
                    {
                        "name": "Gao Y."
                    }, 
                    {
                        "name": "Floratos A."
                    }, 
                    {
                        "name": "Parida L."
                    }
                ], 
                "journal": "Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T11:35:59Z", 
    "lastUpdate": "2018-12-10T12:58:39Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}