{
    "additionDate": "2020-01-14T20:14:53Z",
    "biotoolsCURIE": "biotools:LP-SDA",
    "biotoolsID": "LP-SDA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhang.10631@osu.edu",
            "name": "Ping Zhang",
            "orcidid": "https://orcid.org/0000-0002-4601-0779",
            "typeEntity": "Person"
        }
    ],
    "description": "Combining pre-clinical drug structures and post-market safety reports.\n\nCode and Datasets for paper \"Towards early detection of adverse drug reactions: combining pre-clinical drug structures and post-market safety reports\".\n\nThis repository contains source code for paper \"Towards early detection of adverse drugreactions: combining pre-clinical drug structuresand post-market safety reports\" (accepted by BMC Medical Informatics andDecision Making).\n\nPlease kindly cite the paper if you use the code, datasets or any results in this repo or in the paper:.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ruoqi-liu/LP-SDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-22T13:04:01Z",
    "name": "LP-SDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0999-1",
            "metadata": {
                "abstract": "© 2019 Liu and Zhang.Background: Adverse drug reaction (ADR) is a major burden for patients and healthcare industry. Early and accurate detection of potential ADRs can help to improve drug safety and reduce financial costs. Post-market spontaneous reports of ADRs remain a cornerstone of pharmacovigilance and a series of drug safety signal detection methods play an important role in providing drug safety insights. However, existing methods require sufficient case reports to generate signals, limiting their usages for newly approved drugs with few (or even no) reports. Methods: In this study, we propose a label propagation framework to enhance drug safety signals by combining drug chemical structures with FDA Adverse Event Reporting System (FAERS). First, we compute original drug safety signals via common signal detection algorithms. Then, we construct a drug similarity network based on chemical structures. Finally, we generate enhanced drug safety signals by propagating original signals on the drug similarity network. Our proposed framework enriches post-market safety reports with pre-clinical drug similarity network, effectively alleviating issues of insufficient cases for newly approved drugs. Results: We apply the label propagation framework to four popular signal detection algorithms (PRR, ROR, MGPS, BCPNN) and find that our proposed framework generates more accurate drug safety signals than the corresponding baselines. In addition, our framework identifies potential ADRs for newly approved drugs, thus paving the way for early detection of ADRs. Conclusions: The proposed label propagation framework combines pre-clinical drug structures with post-market safety reports, generates enhanced drug safety signals, and can potentially help to accurately detect ADRs ahead of time.",
                "authors": [
                    {
                        "name": "Liu R."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-18T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Towards early detection of adverse drug reactions: Combining pre-clinical drug structures and post-market safety reports"
            },
            "pmcid": "PMC6918608",
            "pmid": "31849321"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}