{
    "additionDate": "2021-01-18T11:16:03Z",
    "biotoolsCURIE": "biotools:sc2disease",
    "biotoolsID": "sc2disease",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jiajiepeng@nwpu.edu.cn",
            "name": "Jiajie Peng",
            "typeEntity": "Person"
        }
    ],
    "description": "a manually curated database of single-cell transcriptome for human diseases.\n\nThe transcriptome plays a crucial role in the maintenance of cell identity and the spatiotemporal specificity in the process of cell differentiation, which consequently produces a profound impact in the formation of any organism and regulatory complex.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://easybioai.com/sc2disease/",
    "lastUpdate": "2021-02-11T16:53:15Z",
    "name": "SC2disease",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA838",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.SC2disease (http://easybioai.com/sc2disease/) is a manually curated database that aims to provide a comprehensive and accurate resource of gene expression profiles in various cell types for different diseases. With the development of single-cell RNA sequencing (scRNA-seq) technologies, uncovering cellular heterogeneity of different tissues for different diseases has become feasible by profiling transcriptomes across cell types at the cellular level. In particular, comparing gene expression profiles between different cell types and identifying cell-type-specific genes in various diseases offers new possibilities to address biological and medical questions. However, systematic, hierarchical and vast databases of gene expression profiles in human diseases at the cellular level are lacking. Thus, we reviewed the literature prior to March 2020 for studies which used scRNA-seq to study diseases with human samples, and developed the SC2disease database to summarize all the data by different diseases, tissues and cell types. SC2disease documents 946 481 entries, corresponding to 341 cell types, 29 tissues and 25 diseases. Each entry in the SC2disease database contains comparisons of differentially expressed genes between different cell types, tissues and disease-related health status. Furthermore, we reanalyzed gene expression matrix by unified pipeline to improve the comparability between different studies. For each disease, we also compare cell-type-specific genes with the corresponding genes of lead single nucleotide polymorphisms (SNPs) identified in genome-wide association studies (GWAS) to implicate cell type specificity of the traits.",
                "authors": [
                    {
                        "name": "Hao J."
                    },
                    {
                        "name": "Juan L."
                    },
                    {
                        "name": "Lu G."
                    },
                    {
                        "name": "Lyu S."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zhao T."
                    }
                ],
                "citationCount": 12,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SC2disease: A manually curated database of single-cell transcriptome for human diseases"
            },
            "pmid": "33010177"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
