{
    "additionDate": "2018-04-26T15:20:50Z",
    "biotoolsCURIE": "biotools:ptmtreesearch",
    "biotoolsID": "ptmtreesearch",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "contact@thegpm.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A program developed for identification of Post-Translational Modification in MS/MS data and it is embedded to the X!Tandem project.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wiki.thegpm.org/wiki/Main_Page"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://pongor.itk.ppke.hu/ptmtreesearch/",
    "lastUpdate": "2019-03-26T08:36:08Z",
    "name": "PTMTreeSearch",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTT642",
            "metadata": {
                "abstract": "Motivation: Tandem mass spectrometry has become a standard tool for identifying post-translational modifications (PTMs) of proteins. Algorithmic searches for PTMs from tandem mass spectrum data (MS/MS) tend to be hampered by noisy data as well as by a combinatorial explosion of search space. This leads to high uncertainty and long search-execution times.Results: To address this issue, we present PTMTreeSearch, a new algorithm that uses a large database of known PTMs to identify PTMs from MS/MS data. For a given peptide sequence, PTMTreeSearch builds a computational tree wherein each path from the root to the leaves is labeled with the amino acids of a peptide sequence. Branches then represent PTMs. Various empirical tree pruning rules have been designed to decrease the search-execution time by eliminating biologically unlikely solutions. PTMTreeSearch first identifies a relatively small set of high confidence PTM types, and in a second stage, performs a more exhaustive search on this restricted set using relaxed search parameter settings. An analysis of experimental data shows that using the same criteria for false discovery, PTMTreeSearch annotates more peptides than the current state-of-the-art methods and PTM identification algorithms, and achieves this at roughly the same execution time. PTMTreeSearch is implemented as a plugable scoring function in the X!Tandem search engine. © 2013 The Author.",
                "authors": [
                    {
                        "name": "Kertesz-Farkas A."
                    },
                    {
                        "name": "Myers M.P."
                    },
                    {
                        "name": "Pongor S."
                    },
                    {
                        "name": "Reiz B."
                    },
                    {
                        "name": "Vera R."
                    }
                ],
                "citationCount": 4,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PTMTreeSearch: A novel two-stage tree-search algorithm with pruning rules for the identification of post-translational modification of proteins in MS/MS spectra"
            },
            "pmid": "24215026"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
