{
    "additionDate": "2021-01-18T10:50:34Z",
    "biotoolsCURIE": "biotools:dpddi",
    "biotoolsID": "dpddi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangsw@nwpu.edu.cn",
            "name": "Shao-Wu Zhang",
            "orcidid": "https://orcid.org/0000-0003-1305-7447",
            "typeEntity": "Person"
        },
        {
            "email": "jianyushi@nwpu.edu.cn",
            "name": "Jian-Yu Shi",
            "typeEntity": "Person"
        }
    ],
    "description": "DPDDI is a deep predictor for drug-drug interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NWPU-903PR/DPDDI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-03T18:37:22Z",
    "name": "DPDDI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03724-X",
            "metadata": {
                "abstract": "BACKGROUND: The treatment of complex diseases by taking multiple drugs becomes increasingly popular. However, drug-drug interactions (DDIs) may give rise to the risk of unanticipated adverse effects and even unknown toxicity. DDI detection in the wet lab is expensive and time-consuming. Thus, it is highly desired to develop the computational methods for predicting DDIs. Generally, most of the existing computational methods predict DDIs by extracting the chemical and biological features of drugs from diverse drug-related properties, however some drug properties are costly to obtain and not available in many cases. RESULTS: In this work, we presented a novel method (namely DPDDI) to predict DDIs by extracting the network structure features of drugs from DDI network with graph convolution network (GCN), and the deep neural network (DNN) model as a predictor. GCN learns the low-dimensional feature representations of drugs by capturing the topological relationship of drugs in DDI network. DNN predictor concatenates the latent feature vectors of any two drugs as the feature vector of the corresponding drug pairs to train a DNN for predicting the potential drug-drug interactions. Experiment results show that, the newly proposed DPDDI method outperforms four other state-of-the-art methods; the GCN-derived latent features include more DDI information than other features derived from chemical, biological or anatomical properties of drugs; and the concatenation feature aggregation operator is better than two other feature aggregation operators (i.e., inner product and summation). The results in case studies confirm that DPDDI achieves reasonable performance in predicting new DDIs. CONCLUSION: We proposed an effective and robust method DPDDI to predict the potential DDIs by utilizing the DDI network information without considering the drug properties (i.e., drug chemical and biological properties). The method should also be useful in other DDI-related scenarios, such as the detection of unexpected side effects, and the guidance of drug combination.",
                "authors": [
                    {
                        "name": "Feng Y.-H."
                    },
                    {
                        "name": "Shi J.-Y."
                    },
                    {
                        "name": "Zhang S.-W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-24T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "DPDDI: a deep predictor for drug-drug interactions"
            },
            "pmcid": "PMC7513481",
            "pmid": "32972364"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
