{
    "additionDate": "2022-08-26T07:30:22.783387Z",
    "biotoolsCURIE": "biotools:graphtgi",
    "biotoolsID": "graphtgi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lijq@szu.edu.cn",
            "name": "Jian-Qiang Li",
            "typeEntity": "Person"
        },
        {
            "email": "yahuang1991@gmail.com",
            "name": "Yu-An Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "An attention-based graph embedding model for predicting TF-target gene interactions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YanghanWu/GraphTGI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-26T07:30:22.785862Z",
    "license": "Not licensed",
    "name": "GraphTGI",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC148",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved.Motivation: Interaction between transcription factor (TF) and its target genes establishes the knowledge foundation for biological researches in transcriptional regulation, the number of which is, however, still limited by biological techniques. Existing computational methods relevant to the prediction of TF-target interactions are mostly proposed for predicting binding sites, rather than directly predicting the interactions. To this end, we propose here a graph attention-based autoencoder model to predict TF-target gene interactions using the information of the known TF-target gene interaction network combined with two sequential and chemical gene characters, considering that the unobserved interactions between transcription factors and target genes can be predicted by learning the pattern of the known ones. To the best of our knowledge, the proposed model is the first attempt to solve this problem by learning patterns from the known TF-target gene interaction network. Results: In this paper, we formulate the prediction task of TF-target gene interactions as a link prediction problem on a complex knowledge graph and propose a deep learning model called GraphTGI, which is composed of a graph attention-based encoder and a bilinear decoder. We evaluated the prediction performance of the proposed method on a real dataset, and the experimental results show that the proposed model yields outstanding performance with an average AUC value of 0.8864 +/- 0.0057 in the 5-fold cross-validation. It is anticipated that the GraphTGI model can effectively and efficiently predict TF-target gene interactions on a large scale.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Du Z.-H."
                    },
                    {
                        "name": "Hu L."
                    },
                    {
                        "name": "Huang Y.-A."
                    },
                    {
                        "name": "Li J.-Q."
                    },
                    {
                        "name": "Pan G.-Q."
                    },
                    {
                        "name": "Wu Y.-H."
                    },
                    {
                        "name": "You Z.-H."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "GraphTGI: an attention-based graph embedding model for predicting TF-target gene interactions"
            },
            "pmid": "35511108"
        }
    ],
    "toolType": [
        "Script",
        "Workbench"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
