{
    "additionDate": "2021-01-20T11:05:14Z",
    "biotoolsCURIE": "biotools:gan",
    "biotoolsID": "gan",
    "confidence_flag": "tool",
    "description": "From Image-to-Image Translation to Disease Detection and Localization.\n\nThis repository provides the official PyTorch implementation of Fixed-Point GAN. Fixed-Point GAN introduces fixed-point translation which dramatically reduces artifacts in image-to-image translation and introduces a novel method for disease detection and localization using image-level annotation only.\n\nStarGAN - Official PyTorch Implementation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://github.com/jlianglab/Fixed-Point-GAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-05-17T06:37:47Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yunjey/StarGAN"
        }
    ],
    "name": "GAN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/ICCV.2019.00028",
            "metadata": {
                "abstract": "© 2019 IEEE.Generative adversarial networks (GANs) have ushered in a revolution in image-to-image translation. The development and proliferation of GANs raises an interesting question: Can we train a GAN to remove an object, if present, from an image while otherwise preserving the image? Specifically, can a GAN ''virtually heal'' anyone by turning his medical image, with an unknown health status (diseased or healthy), into a healthy one, so that diseased regions could be revealed by subtracting those two images? Such a task requires a GAN to identify a minimal subset of target pixels for domain translation, an ability that we call fixed-point translation, which no GAN is equipped with yet. Therefore, we propose a new GAN, called Fixed-Point GAN, trained by (1) supervising same-domain translation through a conditional identity loss, and (2) regularizing cross-domain translation through revised adversarial, domain classification, and cycle consistency loss. Based on fixed-point translation, we further derive a novel framework for disease detection and localization using only image-level annotation. Qualitative and quantitative evaluations demonstrate that the proposed method outperforms the state of the art in multi-domain image-to-image translation and that it surpasses predominant weakly-supervised localization methods in both disease detection and localization. Implementation is available at https://github.com/jlianglab/Fixed-Point-GAN.",
                "authors": [
                    {
                        "name": "Bengio Y."
                    },
                    {
                        "name": "Feng R."
                    },
                    {
                        "name": "Gotway M."
                    },
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Siddiquee M.M.R."
                    },
                    {
                        "name": "Tajbakhsh N."
                    },
                    {
                        "name": "Zhou Z."
                    }
                ],
                "citationCount": 14,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Proceedings of the IEEE International Conference on Computer Vision",
                "title": "Learning fixed points in generative adversarial networks: From image-to-image translation to disease detection and localization"
            },
            "pmcid": "PMC7329240",
            "pmid": "32612486"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
