{
    "additionDate": "2017-01-13T13:13:30Z",
    "biotoolsCURIE": "biotools:agile",
    "biotoolsID": "agile",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "smi539@eecs.northwestern.edu",
            "name": "Misra S.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A hash table based high throughput sequence mapping algorithm for longer 454 reads that uses diagonal multiple seed-match criteria, customized q-gram filtering and a dynamic incremental search approach among other heuristics to optimize every step of the mapping process.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.ece.northwestern.edu/%7Esmi539/agile.html#usage"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://www.ece.northwestern.edu/%7Esmi539/agile.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "maturity": "Mature",
    "name": "AGILE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Recently, a number of programs have been proposed for mapping short reads to a reference genome. Many of them are heavily optimized for short-read mapping and hence are very efficient for shorter queries, but that makes them inefficient or not applicable for reads longer than 200 bp. However, many sequencers are already generating longer reads and more are expected to follow. For long read sequence mapping, there are limited options; BLAT, SSAHA2, FANGS and BWA-SW are among the popular ones. However, resequencing and personalized medicine need much faster software to map these long sequencing reads to a reference genome to identify SNPs or rare transcripts. Results: We present AGILE (AliGnIng Long rEads), a hash table based high-throughput sequence mapping algorithm for longer 454 reads that uses diagonal multiple seed-match criteria, customized q-gram filtering and a dynamic incremental search approach among other heuristics to optimize every step of the mapping process. In our experiments, we observe that AGILE is more accurate than BLAT, and comparable to BWA-SW and SSAHA2. For practical error rates (<5%) and read lengths (200-1000 bp), AGILE is significantly faster than BLAT, SSAHA2 and BWA-SW. Even for the other cases, AGILE is comparable to BWA-SW and several times faster than BLAT and SSAHA2. © The Author 2010. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Agrawal A."
                    },
                    {
                        "name": "Choudhary A."
                    },
                    {
                        "name": "Liao W.-K."
                    },
                    {
                        "name": "Misra S."
                    }
                ],
                "citationCount": 19,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Anatomy of a hash-based long read sequence mapping algorithm for next generation DNA sequencing"
            },
            "pmid": "21088030"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
