{
    "additionDate": "2021-06-14T12:39:20Z",
    "biotoolsCURIE": "biotools:aceapi",
    "biotoolsID": "aceapi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "acallaha@stanford.edu",
            "name": "Alison Callahan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ACEapi is the API for the the Advanced Cohort Engine for searching longitudinal patient records.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/som-shahlab/ACEapi",
    "language": [
        "Java",
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:20:40.018035Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/ACEsearch/"
        }
    ],
    "name": "ACEapi",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/jamia/ocab027",
            "metadata": {
                "abstract": "Objective: To propose a paradigm for a scalable time-aware clinical data search, and to describe the design, implementation and use of a search engine realizing this paradigm. Materials and Methods: The Advanced Cohort Engine (ACE) uses a temporal query language and in-memory datastore of patient objects to provide a fast, scalable, and expressive time-aware search. ACE accepts data in the Observational Medicine Outcomes Partnership Common Data Model, and is configurable to balance performance with compute cost. ACE's temporal query language supports automatic query expansion using clinical knowledge graphs. The ACE API can be used with R, Python, Java, HTTP, and a Web UI. Results: ACE offers an expressive query language for complex temporal search across many clinical data types with multiple output options. ACE enables electronic phenotyping and cohort-building with subsecond response times in searching the data of millions of patients for a variety of use cases. Discussion: ACE enables fast, time-aware search using a patient object-centric datastore, thereby overcoming many technical and design shortcomings of relational algebra-based querying. Integrating electronic phenotype development with cohort-building enables a variety of high-value uses for a learning health system. Tradeoffs include the need to learn a new query language and the technical setup burden. Conclusion: ACE is a tool that combines a unique query language for time-aware search of longitudinal patient records with a patient object datastore for rapid electronic phenotyping, cohort extraction, and exploratory data analyses.",
                "authors": [
                    {
                        "name": "Banda J.M."
                    },
                    {
                        "name": "Callahan A."
                    },
                    {
                        "name": "Gombar S."
                    },
                    {
                        "name": "Polony V."
                    },
                    {
                        "name": "Posada J.D."
                    },
                    {
                        "name": "Shah N.H."
                    }
                ],
                "citationCount": 12,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Journal of the American Medical Informatics Association",
                "title": "ACE: The Advanced Cohort Engine for searching longitudinal patient records"
            },
            "pmcid": "PMC8279796",
            "pmid": "33712854",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
