{
    "additionDate": "2021-01-18T11:35:03Z",
    "biotoolsCURIE": "biotools:pi-net",
    "biotoolsID": "pi-net",
    "confidence_flag": "tool",
    "description": "A Deep Learning Approach to Extract Topological Persistence Images.\n\nNOTE: This page is under construction.\n\nHere we provide sample code to compute persistence images (PIs) using the proposed Image PI-Net model. We load weights from a pre-trained model trained on the CIFAR10 dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anirudhsom/PI-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T16:11:33Z",
    "license": "MIT",
    "name": "PI-Net",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/CVPRW50498.2020.00425",
            "metadata": {
                "abstract": "© 2020 IEEE.Topological features such as persistence diagrams and their functional approximations like persistence images (PIs) have been showing substantial promise for machine learning and computer vision applications. This is greatly attributed to the robustness topological representations provide against different types of physical nuisance variables seen in real-world data, such as view-point, illumination, and more. However, key bottlenecks to their large scale adoption are computational expenditure and difficulty incorporating them in a differentiable architecture. We take an important step in this paper to mitigate these bottlenecks by proposing a novel one-step approach to generate PIs directly from the input data. We design two separate convolutional neural network architectures, one designed to take in multi-variate time series signals as input and another that accepts multi-channel images as input. We call these networks Signal PI-Net and Image PI- Net respectively. To the best of our knowledge, we are the first to propose the use of deep learning for computing topological features directly from data. We explore the use of the proposed PI-Net architectures on two applications: human activity recognition using tri-axial accelerometer sensor data and image classification. We demonstrate the ease of fusion of PIs in supervised deep learning architectures and speed up of several orders of magnitude for extracting PIs from data. Our code is available at https://github.com/anirudhsom/PI-Net.",
                "authors": [
                    {
                        "name": "Som A."
                    },
                    {
                        "name": "Choi H."
                    },
                    {
                        "name": "Ramamurthy K.N."
                    },
                    {
                        "name": "Buman M.P."
                    },
                    {
                        "name": "Turaga P."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "IEEE Computer Society Conference on Computer Vision and Pattern Recognition Workshops",
                "title": "PI-net: A deep learning approach to extract topological persistence images"
            },
            "pmcid": "PMC7521829",
            "pmid": "32995068"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}