{
    "additionDate": "2017-08-03T18:35:46Z",
    "biotoolsCURIE": "biotools:amps",
    "biotoolsID": "amps",
    "credit": [
        {
            "name": "The Barton Group",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.compbio.dundee.ac.uk/"
        }
    ],
    "description": "Suite of programs for multiple sequence alignment. The programs include options to incorporate non-sequence information such as secondary structures. It also implements flexible pattern matching and database scanning options, and includes functions for running randomisations to estimate the significance of sequence similarities.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.compbio.dundee.ac.uk/manuals/amps/amps.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.compbio.dundee.ac.uk/software.html#msa",
    "lastUpdate": "2018-12-10T12:58:42Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/amps-d2-3a-alignment-multiple-protein-sequences.html"
        }
    ],
    "name": "AMPS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "This chapter demonstrates the use of alignments obtained from comparison of the protein three-dimensional structures as a standard against which to test an automatic method for the pair wise alignment of protein sequences. Optimal global alignment methods allow the best overall score for the comparison of the two sequences to be obtained including a consideration of gaps. The protein three-dimensional structure determines its biological activity. It is therefore of crucial importance when two or more protein sequences are aligned that those residues defining a common tertiary fold, together with any common catalytic and binding residues, are correctly equivalent. To be useful, a protein sequence alignment method must at least align those residues that are performing equivalent structural roles in the two proteins. The multiple alignments of four or more sequences cannot, in practice, be performed by a rigorous method because even when gaps are not explicitly considered, the number of segment comparisons that must be made is of the order of the product of the sequence lengths. Algorithms for multiple sequence alignment therefore seek to identify an optimum alignment by considering only a small number of the total possible residue or segment comparisons. © 1990, Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Barton G.J."
                    }
                ],
                "citationCount": 178,
                "date": "1990-01-01T00:00:00Z",
                "journal": "Methods in Enzymology",
                "title": "Protein multiple sequence alignment and flexible pattern matching"
            },
            "pmid": "2314284"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}