{
    "accessibility": "Restricted access",
    "additionDate": "2017-03-04T22:58:49Z",
    "biotoolsCURIE": "biotools:hgmd",
    "biotoolsID": "hgmd",
    "collectionID": [
        "RD-connect",
        "Rare Disease"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.hgmd.cf.ac.uk/docs/comment_form.html"
        }
    ],
    "description": "The Human Gene Mutation Database (HGMD) - comprehensive collection of germline mutations in nuclear genes that underlie, or are associated with, human inherited disease. It is a flexible resource that can be adapted to a broad range of applications including searching for an overview of known mutations associated with a particular disease, interpreting clinical test results or looking for the likely causal mutation in a list of variants.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.hgmd.cf.ac.uk/docs/new_help.html"
        }
    ],
    "editPermission": {
        "authors": [
            "Friederike",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://www.hgmd.org",
    "lastUpdate": "2024-02-14T13:12:49.217756Z",
    "maturity": "Mature",
    "name": "HGMD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_001621"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1007/s00439-013-1358-4",
            "metadata": {
                "abstract": "The Human Gene Mutation Database (HGMD®) is a comprehensive collection of germline mutations in nuclear genes that underlie, or are associated with, human inherited disease. By June 2013, the database contained over 141,000 different lesions detected in over 5,700 different genes, with new mutation entries currently accumulating at a rate exceeding 10,000 per annum. HGMD was originally established in 1996 for the scientific study of mutational mechanisms in human genes. However, it has since acquired a much broader utility as a central unified disease-oriented mutation repository utilized by human molecular geneticists, genome scientists, molecular biologists, clinicians and genetic counsellors as well as by those specializing in biopharmaceuticals, bioinformatics and personalized genomics. The public version of HGMD (http://www.hgmd.org) is freely available to registered users from academic institutions/non-profit organizations whilst the subscription version (HGMD Professional) is available to academic, clinical and commercial users under license via BIOBASE GmbH. © 2013 The Author(s).",
                "authors": [
                    {
                        "name": "Ball E.V."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Mort M."
                    },
                    {
                        "name": "Phillips A.D."
                    },
                    {
                        "name": "Shaw K."
                    },
                    {
                        "name": "Stenson P.D."
                    }
                ],
                "citationCount": 904,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Human Genetics",
                "title": "The Human Gene Mutation Database: Building a comprehensive mutation repository for clinical and molecular genetics, diagnostic testing and personalized genomic medicine"
            },
            "pmcid": "PMC3898141",
            "pmid": "24077912",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1002/humu.10212",
            "metadata": {
                "abstract": "The Human Gene Mutation Database (HGMD) constitutes a comprehensive core collection of data on germ-line mutations in nuclear genes underlying or associated with human inherited disease (www.hgmd.org). Data catalogued includes: single base-pair substitutions in coding, regulatory and splicing-relevant regions; micro-deletions and micro-insertions; indels; triplet repeat expansions as well as gross deletions; insertions; duplications; and complex rearrangements. Each mutation is entered into HGMD only once in order to avoid confusion between recurrent and identical-by-descent lesions. By March 2003, the database contained in excess of 39,415 different lesions detected in 1,516 different nuclear genes, with new entries currently accumulating at a rate exceeding 5,000 per annum. Since its inception, HGMD has been expanded to include cDNA reference sequences for more than 87% of listed genes, splice junction sequences, disease-associated and functional polymorphisms, as well as links to data present in publicly available online locus-specific mutation databases. Although HGMD has recently entered into a licensing agreement with Celera Genomics (Rockville, MD), mutation data will continue to be made freely available via the Internet. © 2003 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Abeysinghe S."
                    },
                    {
                        "name": "Ball E.V."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Krawczak M."
                    },
                    {
                        "name": "Mort M."
                    },
                    {
                        "name": "Phillips A.D."
                    },
                    {
                        "name": "Shiel J.A."
                    },
                    {
                        "name": "Stenson P.D."
                    },
                    {
                        "name": "Thomas N.S.T."
                    }
                ],
                "citationCount": 1269,
                "date": "2003-06-16T00:00:00Z",
                "journal": "Human Mutation",
                "title": "Human Gene Mutation Database (HGMD®): 2003 Update"
            },
            "pmid": "12754702"
        },
        {
            "doi": "10.1007/s00439-017-1779-6",
            "metadata": {
                "abstract": "© 2017, The Author(s).The Human Gene Mutation Database (HGMD®) constitutes a comprehensive collection of published germline mutations in nuclear genes that underlie, or are closely associated with human inherited disease. At the time of writing (March 2017), the database contained in excess of 203,000 different gene lesions identified in over 8000 genes manually curated from over 2600 journals. With new mutation entries currently accumulating at a rate exceeding 17,000 per annum, HGMD represents de facto the central unified gene/disease-oriented repository of heritable mutations causing human genetic disease used worldwide by researchers, clinicians, diagnostic laboratories and genetic counsellors, and is an essential tool for the annotation of next-generation sequencing data. The public version of HGMD (http://www.hgmd.org) is freely available to registered users from academic institutions and non-profit organisations whilst the subscription version (HGMD Professional) is available to academic, clinical and commercial users under license via QIAGEN Inc.",
                "authors": [
                    {
                        "name": "Ball E.V."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Evans K."
                    },
                    {
                        "name": "Hayden M."
                    },
                    {
                        "name": "Heywood S."
                    },
                    {
                        "name": "Hussain M."
                    },
                    {
                        "name": "Mort M."
                    },
                    {
                        "name": "Phillips A.D."
                    },
                    {
                        "name": "Stenson P.D."
                    }
                ],
                "citationCount": 724,
                "date": "2017-06-01T00:00:00Z",
                "journal": "Human Genetics",
                "title": "The Human Gene Mutation Database: towards a comprehensive repository of inherited mutation data for medical research, genetic diagnosis and next-generation sequencing studies"
            },
            "pmid": "28349240"
        },
        {
            "doi": "10.1136/jmg.2007.055210",
            "metadata": {
                "authors": [
                    {
                        "name": "Ball E."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Howells K."
                    },
                    {
                        "name": "Mort M."
                    },
                    {
                        "name": "Phillips A."
                    },
                    {
                        "name": "Stenson P.D."
                    }
                ],
                "citationCount": 87,
                "date": "2008-02-01T00:00:00Z",
                "journal": "Journal of Medical Genetics",
                "title": "Human Gene Mutation Database: Towards a comprehensive central mutation database"
            },
            "pmid": "18245393"
        },
        {
            "doi": "10.1186/gm13",
            "metadata": {
                "abstract": "The Human Gene Mutation Database (HGMD®) is a comprehensive core collection of germlinemutations in nuclear genes that underlie or are associated with human inherited disease. Here we summarize the history of the database and its current resources. By December 2008, thedatabase contained over 85,000 different lesions detected in 3,253 ifferent genes, with new entries currently accumulating at a rate exceeding 9,000 per annum. Although originally established for the scientific study of mutational mechanisms in human genes, HGMD has since acquired a much broader utility for researchers, physicians, clinicians and genetic counselors as well as for companies specializing in biopharmaceuticals, bioinformatics and personalized genomics. HGMD was first made publicly available in April 1996, and a collaboration was initiated in 2006 between HGMD and BIOBASE GmbH. This cooperative agreement covers the exclusive worldwide marketing of the most up-to-date (subscription) version of HGMD, HGMD Professional, to academic, clinical and commercial users. © 2009 BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ball E.V."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Howells K."
                    },
                    {
                        "name": "Mort M."
                    },
                    {
                        "name": "Phillips P.D."
                    },
                    {
                        "name": "Stenson P.D."
                    },
                    {
                        "name": "Thomas N.S.T."
                    }
                ],
                "citationCount": 665,
                "date": "2009-01-22T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "The human gene mutation database: 2008 update"
            },
            "pmid": "19348700"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data integration and warehousing",
            "uri": "http://edamontology.org/topic_3366"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}
