{
    "additionDate": "2019-11-14T19:56:40Z",
    "biotoolsCURIE": "biotools:elmeri",
    "biotoolsID": "elmeri",
    "confidence_flag": "tool",
    "description": "Fast and Accurate Correction of Optical Mapping Data via Spaced Seeds | Elmeri is a program to correct errors in raw optical map data (Rmaps) | L. Salmela, K. Mukherjee, S.J. Puglisi, M.D. Muggli, and C. Boucher: Fast and accurate correction of optical mapping data with spaced seeds",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LeenaSalmela/Elmeri",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-12-02T17:15:40Z",
    "license": "AGPL-3.0",
    "name": "Elmeri",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz663",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Optical mapping data is used in many core genomics applications, including structural variation detection, scaffolding assembled contigs and mis-assembly detection. However, the pervasiveness of spurious and deleted cut sites in the raw data, which are called Rmaps, make assembly and alignment of them challenging. Although there exists another method to error correct Rmap data, named cOMet, it is unable to scale to even moderately large sized genomes. The challenge faced in error correction is in determining pairs of Rmaps that originate from the same region of the same genome. Results: We create an efficient method for determining pairs of Rmaps that contain significant overlaps between them. Our method relies on the novel and nontrivial adaption and application of spaced seeds in the context of optical mapping, which allows for spurious and deleted cut sites to be accounted for. We apply our method to detecting and correcting these errors. The resulting error correction method, referred to as Elmeri, improves upon the results of state-of-the-art correction methods but in a fraction of the time. More specifically, cOMet required 9.9 CPU days to error correct Rmap data generated from the human genome, whereas Elmeri required less than 15 CPU hours and improved the quality of the Rmaps by more than four times compared to cOMet.",
                "authors": [
                    {
                        "name": "Salmela L."
                    },
                    {
                        "name": "Mukherjee K."
                    },
                    {
                        "name": "Puglisi S.J."
                    },
                    {
                        "name": "Muggli M.D."
                    },
                    {
                        "name": "Boucher C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fast and accurate correction of optical mapping data via spaced seeds"
            },
            "pmcid": "PMC7005598",
            "pmid": "31504206"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}