{
    "additionDate": "2021-01-18T09:34:53Z",
    "biotoolsCURIE": "biotools:pymeshsim",
    "biotoolsID": "pymeshsim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhy630@mail.hzau.edu.cn",
            "name": "Hong-Yu Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "zhen-xia.chen@mail.hzau.edu.cn",
            "name": "Zhen-Xia Chen",
            "orcidid": "https://orcid.org/0000-0003-0474-902X",
            "typeEntity": "Person"
        }
    ],
    "description": "an integrative python package for biomedical named entity recognition, normalization, and comparison of MeSH terms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://pymeshsim.readthedocs.io/en/latest/",
    "lastUpdate": "2021-01-30T16:25:20Z",
    "name": "pyMeSHSim",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03583-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Many disease causing genes have been identified through different methods, but there have been no uniform annotations of biomedical named entity (bio-NE) of the disease phenotypes of these genes yet. Furthermore, semantic similarity comparison between two bio-NE annotations has become important for data integration or system genetics analysis. Results: The package pyMeSHSim recognizes bio-NEs by using MetaMap which produces Unified Medical Language System (UMLS) concepts in natural language process. To map the UMLS concepts to Medical Subject Headings (MeSH), pyMeSHSim is embedded with a house-made dataset containing the main headings (MHs), supplementary concept records (SCRs), and their relations in MeSH. Based on the dataset, pyMeSHSim implemented four information content (IC)-based algorithms and one graph-based algorithm to measure the semantic similarity between two MeSH terms. To evaluate its performance, we used pyMeSHSim to parse OMIM and GWAS phenotypes. The pyMeSHSim introduced SCRs and the curation strategy of non-MeSH-synonymous UMLS concepts, which improved the performance of pyMeSHSim in the recognition of OMIM phenotypes. In the curation of 461 GWAS phenotypes, pyMeSHSim showed recall > 0.94, precision > 0.56, and F1 > 0.70, demonstrating better performance than the state-of-the-art tools DNorm and TaggerOne in recognizing MeSH terms from short biomedical phrases. The semantic similarity in MeSH terms recognized by pyMeSHSim and the previous manual work was calculated by pyMeSHSim and another semantic analysis tool meshes, respectively. The result indicated that the correlation of semantic similarity analysed by two tools reached as high as 0.89-0.99. Conclusions: The integrative MeSH tool pyMeSHSim embedded with the MeSH MHs and SCRs realized the bio-NE recognition, normalization, and comparison in biomedical text-mining.",
                "authors": [
                    {
                        "name": "Luo Z.-H."
                    },
                    {
                        "name": "Luo Z.-H."
                    },
                    {
                        "name": "Shi M.-W."
                    },
                    {
                        "name": "Shi M.-W."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Zhang H.-Y."
                    },
                    {
                        "name": "Chen Z.-X."
                    },
                    {
                        "name": "Chen Z.-X."
                    }
                ],
                "date": "2020-06-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PyMeSHSim: An integrative python package for biomedical named entity recognition, normalization, and comparison of MeSH terms"
            },
            "pmcid": "PMC7301509",
            "pmid": "32552728"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}