{
    "additionDate": "2021-01-18T11:14:31Z",
    "biotoolsCURIE": "biotools:mlodisdb",
    "biotoolsID": "mlodisdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "litt@hsc.pku.edu.cn",
            "name": "Tingting Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A manually curated database of the relations between membraneless organelles and diseases.\n\nMembraneless organelles (MLOs) play important roles in the temporal and spatial regulation of various biological processes, and emerging evidence supports that liquid-liquid phase separation (LLPS) is underlying the assembly of MLOs. Dysfunction of MLOs and LLPS are associated with various pathological processes.\n\nMloDisDB aims to gather MLOs and LLPS related diseases from the dispersed literature. Each entry was assigned with one of the three evidence levels based on original publication: Direct experiment, Indirect experiment, Clinical Investigation. The functional factors, changes of MLOs and changes of the factors were recorded, the components of MLOs and LLPS related predictions were integrated (go to About for detail).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://mlodis.phasep.pro/",
    "lastUpdate": "2021-02-26T08:52:05Z",
    "name": "MloDisDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA271",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Cells are compartmentalized by numerous membrane-bounded organelles and membraneless organelles (MLOs) to ensure temporal and spatial regulation of various biological processes. A number of MLOs, such as nucleoli, nuclear speckles and stress granules, exist as liquid droplets within the cells and arise from the condensation of proteins and RNAs via liquid-liquid phase separation (LLPS). By concentrating certain proteins and RNAs, MLOs accelerate biochemical reactions and protect cells during stress, and dysfunction of MLOs is associated with various pathological processes. With the development in this field, more and more relations between the MLOs and diseases have been described; however, these results have not been made available in a centralized resource. Herein, we build MloDisDB, a database which aims to gather the relations between MLOs and diseases from dispersed literature. In addition, the relations between LLPS and diseases were included as well. Currently, MloDisDB contains 771 curated entries from 607 publications; each entry in MloDisDB contains detailed information about the MLO, the disease and the functional factor in the relation. Furthermore, an efficient and user-friendly interface for users to search, browse and download all entries was provided. MloDisDB is the first comprehensive database of the relations between MLOs and diseases so far, and the database is freely accessible at http://mlodis.phasep.pro/.",
                "authors": [
                    {
                        "name": "Hou C."
                    },
                    {
                        "name": "Xie H."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Li T."
                    }
                ],
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "MloDisDB: a manually curated database of the relations between membraneless organelles and diseases"
            },
            "pmid": "33126250"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ]
}