{
    "additionDate": "2017-12-18T00:07:34Z",
    "biotoolsCURIE": "biotools:haploi",
    "biotoolsID": "haploi",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sailing.cs.cmu.edu/main/?page_id=1115"
        }
    ],
    "description": "Haploi is a haplotype inference program for multi-population data. Underlying Haploi is a new haplotype distribution model based on a nonparametric Bayesian model known as the hierarchical Dirichlet process, which represents a tractable surrogate to the coalescent process. It offers a well-founded statistical framework for posterior inference of individual haplotypes, and the size and configuration of haplotype ancestor pools given genotype data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype inference",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://www.sailing.cs.cmu.edu/main/?page_id=475",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/haploi-haplotype-inference-program-multi-population-data.html"
        }
    ],
    "name": "Haploi",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1214/08-AOAS225",
            "metadata": {
                "abstract": "The perennial problem of \"how many clusters?\" remains an issue of substantial interest in data mining and machine learning communities, and becomes particularly salient in large data sets such as populational genomic data where the number of clusters needs to be relatively large and open-ended. This problem gets further complicated in a co-clustering scenario in which one needs to solve multiple clustering problems simultaneously because of the presence of common centroids (e.g., ancestors) shared by clusters (e.g., possible descents from a certain ancestor) from different multiple-cluster samples (e.g., different human subpopulations). In this paper we present a hierarchical nonparametric Bayesian model to address this problem in the context of multi-population haplotype inference. Uncovering the haplotypes of single nucleotide polymorphisms is essential for many biological and medical applications. While it is uncommon for the genotype data to be pooled from multiple ethnically distinct populations, few existing programs have explicitly leveraged the individual ethnic information for haplotype inference. In this paper we present a new haplotype inference program, Haploi, which makes use of such information and is readily applicable to genotype sequences with thousands of SNPs from heterogeneous populations, with competent and sometimes superior speed and accuracy comparing to the state-of-the-art programs. Underlying Haploi is a new haplotype distribution model based on a nonparametric Bayesian formalism known as the hierarchical Dirichlet process, which represents a tractable surrogate to the coalescent process. The proposed model is exchangeable, unbounded, and capable of coupling demographic information of different populations. It offers a well-founded statistical framework for posterior inference of individual haplotypes, the size and configuration of haplotype ancestor pools, and other parameters of interest given genotype data. © Institute of Mathematical Statistics, 2009.",
                "authors": [
                    {
                        "name": "Sohn K.-A."
                    },
                    {
                        "name": "Xing E.P."
                    }
                ],
                "citationCount": 12,
                "date": "2009-03-01T00:00:00Z",
                "journal": "Annals of Applied Statistics",
                "title": "A hierarchical Dirichlet process mixture model for haplotype reconstruction from multi-population data"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}