{
    "additionDate": "2016-03-17T13:51:10Z",
    "biotoolsCURIE": "biotools:webnma",
    "biotoolsID": "webnma",
    "collectionID": [
        "BiB tools",
        "CBU tools",
        "UiB tools"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Sandhya P Tiwari",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Kidane M Tekle",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Tristan Cragnolini",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Svenn H Grindhaug",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Lars Skjærven",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Gisle Salensminde",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Edvin Fuglebakk",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Nathalie Reuter",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Siv M Hollup",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Department of Molecular Biology, University of Bergen, Norway",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Computational Biology Unit, Department of Informatics, University of Bergen, Norway",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "UiB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://apps.cbu.uib.no/webnma/contact"
        }
    ],
    "description": "Quick, automated computation and analysis of low-frequency normal modes for protein structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://apps.cbu.uib.no/webnma/howto"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Constructs elastic network model from alpha carbon coordinates of the protein, and computes properties to describe large scale conformations. Computes normal modes, fluctuation profiles, inter-residue correlations, conformational overlap analysis and vector field representations. Structural amino acid profiles, and normal mode characteristics describing protein motion, visualized in plots and decorated structure visualizations. White space delimited tabular data for normal modes and the provided plots",
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    },
                    "format": [
                        {
                            "term": "PDF",
                            "uri": "http://edamontology.org/format_3508"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence profile",
                        "uri": "http://edamontology.org/data_1354"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        },
        {
            "input": [
                {
                    "data": {
                        "term": "Structure alignment",
                        "uri": "http://edamontology.org/data_0886"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Performs comparative analysis of the normal modes of protein structures. Computes the Bhattacharyya Coefficient (BC) and the Root Mean Squared Inner Product (RMSIP) of aligned parts of the proteins. Alignment of sets of proteins to be compared. Multiple protein structures Heatmaps, dendrograms and structural amino acid profiles for visual comparison of structural similarity. White space delimited tabular data for the provided plots",
            "operation": [
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    },
                    "format": [
                        {
                            "term": "PDF",
                            "uri": "http://edamontology.org/format_3508"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Structural profile",
                        "uri": "http://edamontology.org/data_0889"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://apps.cbu.uib.no/webnma",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "maturity": "Mature",
    "name": "WEBnma",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "UiB",
    "publication": [
        {
            "doi": "10.1186/s12859-014-0427-6",
            "metadata": {
                "abstract": "© 2015 Tiwari et al.; licensee BioMed Central.Background: Normal mode analysis (NMA) using elastic network models is a reliable and cost-effective computational method to characterise protein flexibility and by extension, their dynamics. Further insight into the dynamics-function relationship can be gained by comparing protein motions between protein homologs and functional classifications. This can be achieved by comparing normal modes obtained from sets of evolutionary related proteins. Results: We have developed an automated tool for comparative NMA of a set of pre-aligned protein structures. The user can submit a sequence alignment in the FASTA format and the corresponding coordinate files in the Protein Data Bank (PDB) format. The computed normalised squared atomic fluctuations and atomic deformation energies of the submitted structures can be easily compared on graphs provided by the web user interface. The web server provides pairwise comparison of the dynamics of all proteins included in the submitted set using two measures: the Root Mean Squared Inner Product and the Bhattacharyya Coefficient. The Comparative Analysis has been implemented on our web server for NMA, WEBnmat, which also provides recently upgraded functionality for NMA of single protein structures. This includes new visualisations of protein motion, visualisation of inter-residue correlations and the analysis of conformational change using the. In addition, programmatic access to WEBnmat is now available through a SOAP-based web service. WEBnmat is available at. Conclusion: WEBnmat v2.0 is an online tool offering unique capability for comparative NMA on multiple protein structures. Along with a convenient web interface, powerful computing resources, and several methods for mode analyses, WEBnmat facilitates the assessment of protein flexibility within protein families and superfamilies. These analyses can give a good view of how the structures move and how the flexibility is conserved over the different structures.",
                "authors": [
                    {
                        "name": "Tiwari S.P."
                    },
                    {
                        "name": "Fuglebakk E."
                    },
                    {
                        "name": "Hollup S.M."
                    },
                    {
                        "name": "Skjaerven L."
                    },
                    {
                        "name": "Cragnolini T."
                    },
                    {
                        "name": "Grindhaug S.H."
                    },
                    {
                        "name": "Tekle K.M."
                    },
                    {
                        "name": "Reuter N."
                    }
                ],
                "citationCount": 34,
                "date": "2014-12-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WEBnmat v2.0: Web server and services for comparing protein flexibility"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-6-52",
            "metadata": {
                "abstract": "Background: Normal mode analysis (NMA) has become the method of choice to investigate the slowest motions in macromolecular systems. NMA is especially useful for large biomolecular assemblies, such as transmembrane channels or virus capsids. NMA relies on the hypothesis that the vibrational normal modes having the lowest frequencies (also named soft modes) describe the largest movements in a protein and are the ones that are functionally relevant. Results: We developed a web-based server to perform normal modes calculations and different types of analyses. Starting from a structure file provided by the user in the PDB format, the server calculates the normal modes and subsequently offers the user a series of automated calculations; normalized squared atomic displacements, vector field representation and animation of the first six vibrational modes. Each analysis is performed independently from the others and results can be visualized using only a web browser. No additional plug-in or software is required. For users who would like to analyze the results with their favorite software, raw results can also be downloaded. The application is available on http://www.bioinfo.no/tools/normalmodes. We present here the underlying theory, the application architecture and an illustration of its features using a large transmembrane protein as an example. Conclusion: We built an efficient and modular web application for normal mode analysis of proteins. Non specialists can easily and rapidly evaluate the degree of flexibility of multi-domain protein assemblies and characterize the large amplitude movements of their domains. © 2005 Hollup et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hollup S.M."
                    },
                    {
                        "name": "Salensminde G."
                    },
                    {
                        "name": "Reuter N."
                    }
                ],
                "citationCount": 95,
                "date": "2005-03-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WEBnm@: A web application for normal mode analyses of proteins"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}