{
    "additionDate": "2021-01-18T11:52:59Z",
    "biotoolsCURIE": "biotools:blur",
    "biotoolsID": "blur",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "odile.lecompte@unistra.fr",
            "name": "Odile Lecompte",
            "typeEntity": "Person"
        }
    ],
    "description": "BLUR (BLast Unexpected Ranking) is a tool designed to highlight, on the whole proteome level, protein divergences between species that result from divergence or loss of a domain and/or motif in a specific taxon. It is based on precomputed BLAST searches for a variety of model organism queries, allowing the study of all major life groups.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://lbgi.fr/blur/",
    "lastUpdate": "2024-11-24T20:45:42.361236Z",
    "name": "BLUR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/gbe/evaa248",
            "metadata": {
                "abstract": "In the multiomics era, comparative genomics studies based on gene repertoire comparison are increasingly used to investigate evolutionary histories of species, to study genotype–phenotype relations, species adaptation to various environments, or to predict gene function using phylogenetic profiling. However, comparisons of orthologs have highlighted the prevalence of sequence plasticity among species, showing the benefits of combining protein and subprotein levels of analysis to allow for a more comprehensive study of genotype/phenotype correlations. In this article, we introduce a new approach called BLUR (BLAST Unexpected Ranking), capable of detecting genotype divergence or specialization between two related clades at different levels: gain/loss of proteins but also of subprotein regions. These regions can correspond to known domains, uncharacterized regions, or even small motifs. Our method was created to allow two types of research strategies: 1) the comparison of two groups of species with no previous knowledge, with the aim of predicting phenotype differences or specializations between close species or 2) the study of specific phenotypes by comparing species that present the phenotype of interest with species that do not. We designed a website to facilitate the use of BLUR with a possibility of in-depth analysis of the results with various tools, such as functional enrichments, protein–protein interaction networks, and multiple sequence alignments. We applied our method to the study of two different biological pathways and to the comparison of several groups of close species, all with very promising results. BLUR is freely available at http://lbgi.fr/blur/.",
                "authors": [
                    {
                        "name": "Defosset A."
                    },
                    {
                        "name": "Kress A."
                    },
                    {
                        "name": "Lecompte O."
                    },
                    {
                        "name": "Nevers Y."
                    },
                    {
                        "name": "Poch O."
                    },
                    {
                        "name": "Ripp R."
                    },
                    {
                        "name": "Thompson J.D."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "Proteome-Scale Detection of Differential Conservation Patterns at Protein and Subprotein Levels with BLUR"
            },
            "pmcid": "PMC7851591",
            "pmid": "33211099"
        }
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
