
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://infos.korea.ac.kr/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://infos.korea.ac.kr/berex/berex_userguide.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Databases",
                "uri": "http://edamontology.org/topic_3489"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/berex-1-0-iberex-biomedical-entity-relation-explorer.html"
        }
    ],
    "publication": [
        {
            "abstract": "Summary: Biomedical Entity-Relationship eXplorer (BEReX) is a new biomedical knowledge integration, search and exploration tool. BEReX integrates eight popular databases (STRING, DrugBank, KEGG, PhamGKB, BioGRID, GO, HPRD and MSigDB) and delineates an integrated network by combining the information available from these databases. Users search the integrated network by entering key words, and BEReX returns a sub-network matching the key words. The resulting graph can be explored interactively. BEReX allows users to find the shortest paths between two remote nodes, find the most relevant drugs, diseases, pathways and so on related to the current network, expand the network by particular types of entities and relations and modify the network by removing or adding selected nodes. BEReX is implemented as a standalone Java application. Availability and implementation: BEReX and a detailed user guide are available for download at our project Web site (http://infos.korea.ac.kr/berex).Contact: Supplementary Information: Supplementary methods and user guide are available at Bioinformatics online. © 2013 The Author .",
            "authors": [
                "Jeon M.",
                "Lee S.",
                "Lee K.",
                "Tan A.-C.",
                "Kang J."
            ],
            "cit_count": 5,
            "doi": "10.1093/bioinformatics/btt598",
            "journal": "Bioinformatics",
            "title": "BEReX: Biomedical entity-relationship explorer",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:berex",
        "biotoolsID": "berex",
        "description": "BEReX is a new biomedical knowledge integration, search and exploration tool. BEReX integrates eight popular databases (STRING, DrugBank, KEGG, PhamGKB, BioGRID, GO, HPRD and MSigDB) and delineates an integrated network by combining the information available from these databases.",
        "homepage": "http://infos.korea.ac.kr/berex/",
        "name": "BEReX",
        "version": [
            "1.0"
        ]
    }
}