{
    "additionDate": "2020-01-14T09:38:43Z",
    "biotoolsCURIE": "biotools:RGADE",
    "biotoolsID": "RGADE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cbmontei@usp.br",
            "name": "Claudia B. Monteiro-Vitorello",
            "orcidid": "https://orcid.org/0000-0002-1238-9354",
            "typeEntity": "Person"
        }
    ],
    "description": "RGADE is a tool with genomic features and differential expression of the innate immune system from a smut-resistant genotype.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "http://github.com/hugorody/rga",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-15T19:26:15Z",
    "name": "RGADE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6207-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Resistance genes composing the two-layer immune system of plants are thought as important markers for breeding pathogen-resistant crops. Many have been the attempts to establish relationships between the genomic content of Resistance Gene Analogs (RGAs) of modern sugarcane cultivars to its degrees of resistance to diseases such as smut. However, due to the highly polyploid and heterozygous nature of sugarcane genome, large scale RGA predictions is challenging. Results: We predicted, searched for orthologs, and investigated the genomic features of RGAs within a recently released sugarcane elite cultivar genome, alongside the genomes of sorghum, one sugarcane ancestor (Saccharum spontaneum), and a collection of de novo transcripts generated for six modern cultivars. In addition, transcriptomes from two sugarcane genotypes were obtained to investigate the roles of RGAs differentially expressed (RGADE) in their distinct degrees of resistance to smut. Sugarcane references lack RGAs from the TNL class (Toll-Interleukin receptor (TIR) domain associated to nucleotide-binding site (NBS) and leucine-rich repeat (LRR) domains) and harbor elevated content of membrane-associated RGAs. Up to 39% of RGAs were organized in clusters, and 40% of those clusters shared synteny. Basically, 79% of predicted NBS-encoding genes are located in a few chromosomes. S. spontaneum chromosome 5 harbors most RGADE orthologs responsive to smut in modern sugarcane. Resistant sugarcane had an increased number of RGAs differentially expressed from both classes of RLK (receptor-like kinase) and RLP (receptor-like protein) as compared to the smut-susceptible. Tandem duplications have largely contributed to the expansion of both RGA clusters and the predicted clades of RGADEs. Conclusions: Most of smut-responsive RGAs in modern sugarcane were potentially originated in chromosome 5 of the ancestral S. spontaneum genotype. Smut resistant and susceptible genotypes of sugarcane have a distinct pattern of RGADE. TM-LRR (transmembrane domains followed by LRR) family was the most responsive to the early moment of pathogen infection in the resistant genotype, suggesting the relevance of an innate immune system. This work can help to outline strategies for further understanding of allele and paralog expression of RGAs in sugarcane, and the results should help to develop a more applied procedure for the selection of resistant plants in sugarcane.",
                "authors": [
                    {
                        "name": "Rody H.V.S."
                    },
                    {
                        "name": "Bombardelli R.G.H."
                    },
                    {
                        "name": "Creste S."
                    },
                    {
                        "name": "Camargo L.E.A."
                    },
                    {
                        "name": "Van Sluys M.-A."
                    },
                    {
                        "name": "Monteiro-Vitorello C.B."
                    }
                ],
                "citationCount": 5,
                "date": "2019-11-06T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Genome survey of resistance gene analogs in sugarcane: Genomic features and differential expression of the innate immune system from a smut-resistant genotype"
            },
            "pmcid": "PMC6836459",
            "pmid": "31694536"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}