
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Viruses",
                "uri": "http://edamontology.org/topic_0781"
            },
            {
                "term": "Microbial ecology",
                "uri": "http://edamontology.org/topic_3697"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The integrated microbial genomes (IMG) system serves as a community resource for comparative analysis of publicly available genomes in a comprehensive integrated context. IMG contains both draft and complete microbial genomes integrated with other publicly available genomes from all three domains of life, together with a large number of plasmids and viruses. IMG provides tools and viewers for analyzing and reviewing the annotations of genes and genomes in a comparative context. Since its first release in 2005, IMG's data content and analytical capabilities have been constantly expanded through regular releases. Several companion IMG systems have been set up in order to serve domain specific needs, such as expert review of genome annotations. IMG is available at http://img.jgi.doe.gov. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Markowitz V.M.",
                "Chen I.A.",
                "Palaniappan K.",
                "Chu K.",
                "Szeto E.",
                "Grechkin Y.",
                "Ratner A.",
                "Anderson I.",
                "Lykidis A.",
                "Mavromatis K.",
                "Ivanova N.N.",
                "Kyrpides N.C."
            ],
            "cit_count": 196,
            "journal": "Nucleic Acids Research",
            "pmid": "19864254",
            "title": "The integrated microbial genomes system: An expanding comparative analysis resource",
            "year": "2009-10-28"
        },
        {
            "abstract": "The Integrated Microbial Genomes (IMG) system serves as a community resource for comparative analysis of publicly available genomes in a comprehensive integrated context. IMG integrates publicly available draft and complete genomes from all three domains of life with a large number of plasmids and viruses. IMG provides tools and viewers for analyzing and reviewing the annotations of genes and genomes in a comparative context. IMG's data content and analytical capabilities have been continuously extended through regular updates since its first release in March 2005. IMG is available at http://img.jgi.doe.gov. Companion IMG systems provide support for expert review of genome annotations (IMG/ER: http://img.jgi.doe.gov/er), teaching courses and training in microbial genome analysis (IMG/EDU: http://img.jgi.doe.gov/edu) and analysis of genomes related to the Human Microbiome Project (IMG/HMP: http://www.hmpdacc-resources.org/img-hmp). © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Markowitz V.M.",
                "Chen I.-M.A.",
                "Palaniappan K.",
                "Chu K.",
                "Szeto E.",
                "Grechkin Y.",
                "Ratner A.",
                "Jacob B.",
                "Huang J.",
                "Williams P.",
                "Huntemann M.",
                "Anderson I.",
                "Mavromatis K.",
                "Ivanova N.N.",
                "Kyrpides N.C."
            ],
            "cit_count": 689,
            "journal": "Nucleic Acids Research",
            "pmid": "22194640",
            "title": "IMG: The integrated microbial genomes database and comparative analysis system",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:img",
        "biotoolsID": "img",
        "description": "Community resource for comparative analysis of publicly available genomes in a comprehensive integrated context. It contains both draft and complete microbial genomes integrated with other publicly available genomes from all three domains of life, together with a large number of plasmids and viruses. It provides tools and viewers for analyzing and reviewing the annotations of genes and genomes in a comparative context.",
        "homepage": "http://img.jgi.doe.gov/",
        "name": "Integrated Microbial Genomes (IMG)"
    }
}