{
    "accessibility": "Open access",
    "additionDate": "2021-11-21T22:18:15.806730Z",
    "biotoolsCURIE": "biotools:recognicer",
    "biotoolsID": "recognicer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zang@virginia.edu",
            "name": "Chongzhi Zang",
            "typeEntity": "Person"
        },
        {
            "email": "wpeng@gwu.edu",
            "name": "Weiqun Peng",
            "typeEntity": "Person"
        },
        {
            "name": "Yiren Wang"
        }
    ],
    "description": "An algorithm for identifying multi-scale broad peaks from ChIP-seq data",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zanglab/recognicer",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-11-21T22:18:15.809304Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zanglab/recognicer"
        }
    ],
    "name": "RECOGNICER",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S40484-020-0225-2",
            "metadata": {
                "abstract": "© 2020, Higher Education Press and Springer-Verlag GmbH Germany, part of Springer Nature.Background: Histone modifications are major factors that define chromatin states and have functions in regulating gene expression in eukaryotic cells. Chromatin immunoprecipitation coupled with high-throughput sequencing (ChIP-seq) technique has been widely used for profiling the genome-wide distribution of chromatin-associating protein factors. Some histone modifications, such as H3K27me3 and H3K9me3, usually mark broad domains in the genome ranging from kilobases (kb) to megabases (Mb) long, resulting in diffuse patterns in the ChIP-seq data that are challenging for signal separation. While most existing ChIP-seq peak-calling algorithms are based on local statistical models without account of multi-scale features, a principled method to identify scale-free board domains has been lacking. Methods: Here we present RECOGNICER (Recursive coarse-graining identification for ChIP-seq enriched regions), a computational method for identifying ChIP-seq enriched domains on a large range of scales. The algorithm is based on a coarse-graining approach, which uses recursive block transformations to determine spatial clustering of local enriched elements across multiple length scales. Results: We apply RECOGNICER to call H3K27me3 domains from ChIP-seq data, and validate the results based on H3K27me3’s association with repressive gene expression. We show that RECOGNICER outperforms existing ChIP-seq broad domain calling tools in identifying more whole domains than separated pieces. Conclusion: RECOGNICER can be a useful bioinformatics tool for next-generation sequencing data analysis in epigenomics research.[Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Zang C."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Peng W."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Quantitative Biology",
                "title": "RECOGNICER: A coarse-graining approach for identifying broad domains from ChIP-seq data"
            },
            "pmcid": "PMC8318318",
            "pmid": "34327037"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}