{
    "additionDate": "2017-01-17T14:56:11Z",
    "biotoolsCURIE": "biotools:lymphoseq",
    "biotoolsID": "lymphoseq",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "dcoffey@fredhutch.org",
            "name": "David Coffey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This R package analyzes high-throughput sequencing of T and B cell receptor complementarity determining region 3 (CDR3) sequences generated by Adaptive Biotechnologies' ImmunoSEQ assay.  Its input comes from tab-separated value (.tsv) files exported from the ImmunoSEQ analyzer.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/LymphoSeq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/LymphoSeq_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/LymphoSeq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "Artistic-2.0",
    "name": "LymphoSeq",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1182/bloodadvances.2016000794",
            "metadata": {
                "abstract": "© 2017 American Society of Hematology. All rights reserved.Burkitt lymphoma (BL), the most common pediatric cancer in sub-Saharan Africa, is a malignancy of antigen-experienced B lymphocytes. High-throughput sequencing (HTS) of the immunoglobulin heavy (IGH) and light chain (IGK/IGL) loci was performed on genomic DNA from 51 primary BL tumors: 19 from Uganda and 32 from Ghana. Reverse transcription polymerase chain reaction analysis and tumor RNA sequencing (RNAseq) was performed on the Ugandan tumors to confirm and extend the findings from the HTS of tumor DNA. Clonal IGH and IGK/IGL rearrangements were identified in 41 and 46 tumors, respectively. Evidence for rearrangement of the second IGH allele was observed in only 6 of 41 tumor samples with a clonal IGH rearrangement, suggesting that the normal process of biallelic IGHD to IGHJ diversity-joining (DJ) rearrangement is often disrupted in BL progenitor cells. Most tumors, including those with a sole dominant, nonexpressed DJ rearrangement, contained many IGH and IGK/IGL sequences that differed from the dominant rearrangement by, 10 nucleotides, suggesting that the target of ongoing mutagenesis of these loci in BL tumor cells is not limited to expressed alleles. IGHV usage in both BL tumor cohorts revealed enrichment for IGHV genes that are infrequently used in memory B cells from healthy subjects. Analysis of publicly available DNA sequencing and RNAseq data revealed that these same IGHV genes were overrepresented in dominant tumor-associated IGH rearrangements in several independent BL tumor cohorts. These data suggest that BL derives from an abnormal B-cell progenitor and that aberrant mutational processes are active on the immunoglobulin loci in BL cells.",
                "authors": [
                    {
                        "name": "Bhatia K.G."
                    },
                    {
                        "name": "Biggar R.J."
                    },
                    {
                        "name": "Carlson C.S."
                    },
                    {
                        "name": "Casper C."
                    },
                    {
                        "name": "Coffey D.G."
                    },
                    {
                        "name": "Gerdts S.E."
                    },
                    {
                        "name": "Lombardo K.A."
                    },
                    {
                        "name": "Mbulaiteye S.M."
                    },
                    {
                        "name": "Morales A.J."
                    },
                    {
                        "name": "Neequaye J."
                    },
                    {
                        "name": "Nkrumah F.K."
                    },
                    {
                        "name": "Orem J."
                    },
                    {
                        "name": "Towlerton A.M.H."
                    },
                    {
                        "name": "Warren E.H."
                    }
                ],
                "citationCount": 16,
                "date": "2017-03-28T00:00:00Z",
                "journal": "Blood Advances",
                "title": "High-throughput sequencing of the B-cell receptor in African Burkitt lymphoma reveals clues to pathogenesis"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.0"
    ]
}
