{
    "accessibility": "Open access",
    "additionDate": "2022-09-28T19:57:36.229783Z",
    "biotoolsCURIE": "biotools:sars-arena",
    "biotoolsID": "sars-arena",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dinler@uh.edu",
            "name": "Dinler Amaral Antunes",
            "typeEntity": "Person"
        },
        {
            "email": "kavraki@rice.edu",
            "name": "Lydia E. Kavraki",
            "typeEntity": "Person"
        },
        {
            "name": "Anja Conev"
        },
        {
            "name": "Mauricio Menegatti Rigo"
        },
        {
            "name": "Romanos Fasoulis"
        },
        {
            "name": "Sarah Hall-Swan"
        }
    ],
    "description": "Sequence and Structure-Guided Selection of Conserved Peptides from SARS-related Coronaviruses for Novel Vaccine Development.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://kavrakilab.github.io/SARS-Arena/#modeller-license-key"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KavrakiLab/SARS-Arena",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-28T19:57:36.232382Z",
    "license": "Not licensed",
    "name": "SARS-Arena",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2022.931155",
            "metadata": {
                "abstract": "Copyright © 2022 Rigo, Fasoulis, Conev, Hall-Swan, Antunes and Kavraki.The pandemic caused by the SARS-CoV-2 virus, the agent responsible for the COVID-19 disease, has affected millions of people worldwide. There is constant search for new therapies to either prevent or mitigate the disease. Fortunately, we have observed the successful development of multiple vaccines. Most of them are focused on one viral envelope protein, the spike protein. However, such focused approaches may contribute for the rise of new variants, fueled by the constant selection pressure on envelope proteins, and the widespread dispersion of coronaviruses in nature. Therefore, it is important to examine other proteins, preferentially those that are less susceptible to selection pressure, such as the nucleocapsid (N) protein. Even though the N protein is less accessible to humoral response, peptides from its conserved regions can be presented by class I Human Leukocyte Antigen (HLA) molecules, eliciting an immune response mediated by T-cells. Given the increased number of protein sequences deposited in biological databases daily and the N protein conservation among viral strains, computational methods can be leveraged to discover potential new targets for SARS-CoV-2 and SARS-CoV-related viruses. Here we developed SARS-Arena, a user-friendly computational pipeline that can be used by practitioners of different levels of expertise for novel vaccine development. SARS-Arena combines sequence-based methods and structure-based analyses to (i) perform multiple sequence alignment (MSA) of SARS-CoV-related N protein sequences, (ii) recover candidate peptides of different lengths from conserved protein regions, and (iii) model the 3D structure of the conserved peptides in the context of different HLAs. We present two main Jupyter Notebook workflows that can help in the identification of new T-cell targets against SARS-CoV viruses. In fact, in a cross-reactive case study, our workflows identified a conserved N protein peptide (SPRWYFYYL) recognized by CD8+ T-cells in the context of HLA-B7+. SARS-Arena is available at https://github.com/KavrakiLab/SARS-Arena.",
                "authors": [
                    {
                        "name": "Antunes D.A."
                    },
                    {
                        "name": "Conev A."
                    },
                    {
                        "name": "Fasoulis R."
                    },
                    {
                        "name": "Hall-Swan S."
                    },
                    {
                        "name": "Kavraki L.E."
                    },
                    {
                        "name": "Rigo M.M."
                    }
                ],
                "date": "2022-07-12T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "SARS-Arena: Sequence and Structure-Guided Selection of Conserved Peptides from SARS-related Coronaviruses for Novel Vaccine Development"
            },
            "pmcid": "PMC9315150",
            "pmid": "35903104"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
