{
    "additionDate": "2017-02-10T14:14:58Z",
    "biotoolsCURIE": "biotools:tarfisdock",
    "biotoolsID": "tarfisdock",
    "description": "Web server that docks small molecules with protein structures in the Potential Drug Target Database (PDTD) in an effort to discover new drug targets.",
    "editPermission": {
        "authors": [
            "Chem",
            "iranmanesh"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://www.dddc.ac.cn/tarfisdock/",
    "homepage_status": 2,
    "lastUpdate": "2023-12-21T11:47:13.910427Z",
    "name": "TarFisDock",
    "owner": "Doudou",
    "publication": [
        {
            "metadata": {
                "abstract": "TarFisDock is a web-based tool for automating the procedure of searching for small molecule-protein interactions over a large repertoire of protein structures. It offers PDTD (potential drug target database), a target database containing 698 protein structures covering 15 therapeutic areas and a reverse ligand-protein docking program. In contrast to conventional ligand-protein docking, reverse ligand-protein docking aims to seek potential protein targets by screening an appropriate protein database. The input file of this web server is the small molecule to be tested, in standard mol2 format; TarFisDock then searches for possible binding proteins for the given small molecule by use of a docking approach. The ligand-protein interaction energy terms of the program DOCK are adopted for ranking the proteins. To test the reliability of the TarFisDock server, we searched the PDTD for putative binding proteins for vitamin E and 4H-tamoxifen. The top 2 and 10% candidates of vitamin E binding proteins identified by TarFisDock respectively cover 30 and 50% of reported targets verified or implicated by experiments; and 30 and 50% of experimentally confirmed targets for 4H-tamoxifen appear amongst the top 2 and 5% of the TarFisDock predicted candidates, respectively. Therefore, TarFisDock may be a useful tool for target identification, mechanism study of old drugs and probes discovered from natural products. TarFisDock and PDTD are available at http://www.dddc.ac.cn/tarfisdock/. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Gao Z."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Kang L."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Shen J."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yang K."
                    },
                    {
                        "name": "Yul K."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhu W."
                    }
                ],
                "citationCount": 299,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TarFisDock: A web server for identifying drug targets with docking approach"
            },
            "pmid": "16844997"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
