{
    "additionDate": "2019-11-14T19:32:44Z",
    "biotoolsCURIE": "biotools:dotdotdot",
    "biotoolsID": "dotdotdot",
    "confidence_flag": "tool",
    "description": "An automated approach to quantify multiplex single molecule fluorescent in situ hybridization (smFISH) images in complex tissues",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LieberInstitute/dotdotdot",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-22T10:30:02Z",
    "license": "AGPL-3.0",
    "name": "dotdotdot",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/781559"
        },
        {
            "doi": "10.1093/nar/gkaa312",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Multiplex single-molecule fluorescent in situ hybridization (smFISH) is a powerful method for validating RNA sequencing and emerging spatial transcriptomic data, but quantification remains a computational challenge. We present a framework for generating and analyzing smFISH data in complex tissues while overcoming autofluorescence and increasing multiplexing capacity. We developed dotdotdot (https://github.com/LieberInstitute/dotdotdot) as a corresponding software package to quantify RNA transcripts in single nuclei and perform differential expression analysis. We first demonstrate robustness of our platform in single mouse neurons by quantifying differential expression of activity-regulated genes. We then quantify spatial gene expression in human dorsolateral prefrontal cortex (DLPFC) using spectral imaging and dotdotdot to mask lipofuscin autofluorescence. We lastly apply machine learning to predict cell types and perform downstream cell type-specific expression analysis. In summary, we provide experimental workflows, imaging acquisition and analytic strategies for quantification and biological interpretation of smFISH data in complex tissues.",
                "authors": [
                    {
                        "name": "Maynard K.R."
                    },
                    {
                        "name": "Tippani M."
                    },
                    {
                        "name": "Takahashi Y."
                    },
                    {
                        "name": "Phan B.N."
                    },
                    {
                        "name": "Hyde T.M."
                    },
                    {
                        "name": "Jaffe A.E."
                    },
                    {
                        "name": "Martinowich K."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "dotdotdot: An automated approach to quantify multiplex single molecule fluorescent in situ hybridization (smFISH) images in complex tissues"
            }
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}