{
    "additionDate": "2017-08-03T18:44:05Z",
    "biotoolsCURIE": "biotools:gec",
    "biotoolsID": "gec",
    "credit": [
        {
            "email": "limx54@yahoo.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Java-based application developed to address multiple-testing issue with dependent Single-nucleotide polymorphisms (SNPs).  Based on this new measure, several popular multiple-testing methods including Bonferroni, Holm, Simes correction was improved to evaluate significance level of SNP p-values in genome-wide association studies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://grass.cgs.hku.hk/gec/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://statgenpro.psychiatry.hku.hk/gec/index.php",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gec-1-0-address-multiple-testing-issue-dependent-snps.html"
        }
    ],
    "name": "GEC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Current genome-wide association studies (GWAS) use commercial genotyping microarrays that can assay over a million single nucleotide polymorphisms (SNPs). The number of SNPs is further boosted by advanced statistical genotype-imputation algorithms and large SNP databases for reference human populations. The testing of a huge number of SNPs needs to be taken into account in the interpretation of statistical significance in such genome-wide studies, but this is complicated by the non-independence of SNPs because of linkage disequilibrium (LD). Several previous groups have proposed the use of the effective number of independent markers (M e) for the adjustment of multiple testing, but current methods of calculation for M e are limited in accuracy or computational speed. Here, we report a more robust and fast method to calculate Me. Applying this efficient method [implemented in a free software tool named Genetic type 1 error calculator (GEC)], we systematically examined the Me, and the corresponding p-value thresholds required to control the genome-wide type 1 error rate at 0.05, for 13 Illumina or Affymetrix genotyping arrays, as well as for HapMap Project and 1000 Genomes Project datasets which are widely used in genotype imputation as reference panels. Our results suggested the use of a p-value threshold of ∼10 -7 as the criterion for genome-wide significance for early commercial genotyping arrays, but slightly more stringent p-value thresholds ∼5 × 10 -8 for current or merged commercial genotyping arrays, ∼10 -8 for all common SNPs in the 1000 Genomes Project dataset and ∼5 × 10 -8 for the common SNPs only within genes. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "Cherny S.S."
                    },
                    {
                        "name": "Li M.-X."
                    },
                    {
                        "name": "Sham P.C."
                    },
                    {
                        "name": "Yeung J.M.Y."
                    }
                ],
                "citationCount": 346,
                "date": "2012-05-01T00:00:00Z",
                "journal": "Human Genetics",
                "title": "Evaluating the effective numbers of independent tests and significant p-value thresholds in commercial genotyping arrays and public imputation reference datasets"
            },
            "pmid": "22143225"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
