{
    "additionDate": "2017-01-17T15:00:42Z",
    "biotoolsCURIE": "biotools:hiergwas",
    "biotoolsID": "hiergwas",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "buzdugan@stat.math.ethz.ch",
            "name": "Laura Buzdugan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Testing individual SNPs, as well as arbitrarily large groups of SNPs in GWA studies, using a joint model of all SNPs. The method controls the FWER, and provides an automatic, data-driven refinement of the SNP clusters to smaller groups or single markers.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/hierGWAS.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/hierGWAS_1.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/hierGWAS.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "GPL-3.0",
    "name": "hierGWAS",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw128",
            "metadata": {
                "abstract": "© The Author 2016.Motivation: Although Genome Wide Association Studies (GWAS) genotype a very large number of single nucleotide polymorphisms (SNPs), the data are often analyzed one SNP at a time. The low predictive power of single SNPs, coupled with the high significance threshold needed to correct for multiple testing, greatly decreases the power of GWAS. Results: We propose a procedure in which all the SNPs are analyzed in a multiple generalized linear model, and we show its use for extremely high-dimensional datasets. Our method yields P-values for assessing significance of single SNPs or groups of SNPs while controlling for all other SNPs and the family wise error rate (FWER). Thus, our method tests whether or not a SNP carries any additional information about the phenotype beyond that available by all the other SNPs. This rules out spurious correlations between phenotypes and SNPs that can arise from marginal methods because the 'spuriously correlated' SNP merely happens to be correlated with the 'truly causal' SNP. In addition, the method offers a data driven approach to identifying and refining groups of SNPs that jointly contain informative signals about the phenotype. We demonstrate the value of our method by applying it to the seven diseases analyzed by the Wellcome Trust Case Control Consortium (WTCCC). We show, in particular, that our method is also capable of finding significant SNPs that were not identified in the original WTCCC study, but were replicated in other independent studies. Contact: peter.buehlmann@stat.math.ethz.ch.",
                "authors": [
                    {
                        "name": "Buhlmann P."
                    },
                    {
                        "name": "Buzdugan L."
                    },
                    {
                        "name": "Fehr E."
                    },
                    {
                        "name": "Kalisch M."
                    },
                    {
                        "name": "Navarro A."
                    },
                    {
                        "name": "Schunk D."
                    }
                ],
                "citationCount": 16,
                "date": "2016-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Assessing statistical significance in multivariable genome wide association analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.0"
    ]
}
