
{
    "credit": [
        {
            "email": "hanansh@korea.ac.kr",
            "name": "Soo-heang Eo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/rbsurv.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/rbsurv_2.32.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://www.korea.ac.kr/~stat2242/"
        }
    ],
    "publication": [
        {
            "abstract": "Gene expression data can be associated with various clinical outcomes. In particular, these data can be of importance in discovering survival-associated genes for medical applications. As alternatives to traditional statistical methods, sophisticated methods and software programs have been developed to overcome the high-dimensional difficulty of microarray data. Nevertheless, new algorithms and software programs are needed to include practical functions such as the discovery of multiple sets of survival-associated genes and the incorporation of risk factors, and to use in the R environment which many statisticians are familiar with. For survival modeling with microarray data, we have developed a software program (called rbsurv) which can be used conveniently and interactively in the R environment. This program selects survival-associated genes based on the partial likelihood of the Cox model and separates training and validation sets of samples for robustness. It can discover multiple sets of genes by iterative forward selection rather than one large set of genes. It can also allow adjustment for risk factors in microarray survival modeling. This software package, the rbsurv package, can be used to discover survival-associated genes with microarray data conveniently.",
            "authors": [
                "Cho H.J.",
                "Yu A.",
                "Kim S.",
                "Kang J.",
                "Hong S.-M."
            ],
            "cit_count": 11,
            "doi": "10.18637/jss.v029.i01",
            "journal": "Journal of Statistical Software",
            "title": "Robust likelihood-based survival modeling with microarray data",
            "type": "Primary",
            "year": "2009-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rbsurv",
        "biotoolsID": "rbsurv",
        "description": "This package selects genes associated with survival.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/rbsurv.html",
        "name": "rbsurv",
        "version": [
            "2.32.0"
        ]
    }
}