{
    "accessibility": "Open access",
    "additionDate": "2022-09-23T13:28:07.795397Z",
    "biotoolsCURIE": "biotools:cluster-tracker",
    "biotoolsID": "cluster-tracker",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jmcbroom@ucsc.edu",
            "name": "Jakob McBroome",
            "orcidid": "https://orcid.org/0000-0002-5002-5156",
            "typeEntity": "Person",
            "url": "https://orcid.org/0000-0002-5002-5156"
        },
        {
            "email": "rucorbet@ucsc.edu",
            "name": "Russell Corbett-Detig",
            "typeEntity": "Person"
        }
    ],
    "description": "A interactive web-based tool to facilitate effective and intuitive SARS-CoV-2 geographic data exploration and visualization across the USA.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://clustertracker.gi.ucsc.edu/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2022-09-23T13:28:07.797788Z",
    "license": "Not licensed",
    "name": "Cluster-Tracker",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/VE/VEAC048",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022.The unprecedented severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) global sequencing effort has suffered from an analytical bottleneck. Many existing methods for phylogenetic analysis are designed for sparse, static datasets and are too computationally expensive to apply to densely sampled, rapidly expanding datasets when results are needed immediately to inform public health action. For example, public health is often concerned with identifying clusters of closely related samples, but the sheer scale of the data prevents manual inspection and the current computational models are often too expensive in time and resources. Even when results are available, intuitive data exploration tools are of critical importance to effective public health interpretation and action. To help address this need, we present a phylogenetic heuristic that quickly and efficiently identifies newly introduced strains in a region, resulting in clusters of infected individuals, and their putative geographic origins. We show that this approach performs well on simulated data and yields results largely congruent with more sophisticated Bayesian phylogeographic modeling approaches. We also introduce Cluster-Tracker (https://clustertracker.gi.ucsc.edu/), a novel interactive web-based tool to facilitate effective and intuitive SARS-CoV-2 geographic data exploration and visualization across the USA. Cluster-Tracker is updated daily and automatically identifies and highlights groups of closely related SARS-CoV-2 infections resulting from the transmission of the virus between two geographic areas by travelers, streamlining public health tracking of local viral diversity and emerging infection clusters. The site is open-source and designed to be easily configured to analyze any chosen region, making it a useful resource globally. The combination of these open-source tools will empower detailed investigations of the geographic origins and spread of SARS-CoV-2 and other densely sampled pathogens.",
                "authors": [
                    {
                        "name": "Corbett-Detig R."
                    },
                    {
                        "name": "De Bernardi Schneider A."
                    },
                    {
                        "name": "Martin J."
                    },
                    {
                        "name": "McBroome J."
                    },
                    {
                        "name": "Turakhia Y."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Virus Evolution",
                "title": "Identifying SARS-CoV-2 regional introductions and transmission clusters in real time"
            },
            "pmcid": "PMC9214145",
            "pmid": "35769891"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
