
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/quanlongresearch/contact"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://code.google.com/archive/p/poolhap2/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/poolhap-1-0-0-inferring-haplotype-frequencies-pooled-sequencing.html"
        }
    ],
    "publication": [
        {
            "abstract": "With the advance of next-generation sequencing (NGS) technologies, increasingly ambitious applications are becoming feasible. A particularly powerful one is the sequencing of polymorphic, pooled samples. The pool can be naturally occurring, as in the case of multiple pathogen strains in a blood sample, multiple types of cells in a cancerous tissue sample, or multiple isoforms of mRNA in a cell. In these cases, it's difficult or impossible to partition the subtypes experimentally before sequencing, and those subtype frequencies must hence be inferred. In addition, investigators may occasionally want to artificially pool the sample of a large number of individuals for reasons of cost-efficiency, e.g., when carrying out genetic mapping using bulked segregant analysis. Here we describe PoolHap, a computational tool for inferring haplotype frequencies from pooled samples when haplotypes are known. The key insight into why PoolHap works is that the large number of SNPs that come with genome-wide coverage can compensate for the uneven coverage across the genome. The performance of PoolHap is illustrated and discussed using simulated and real data. We show that PoolHap is able to accurately estimate the proportions of haplotypes with less than 2% error for 34-strain mixtures with 2X total coverage Arabidopsis thaliana whole genome polymorphism data. This method should facilitate greater biological insight into heterogeneous samples that are difficult or impossible to isolate experimentally. Software and users manual are freely available at http://arabidopsis.gmi.oeaw.ac.at/quan/poolhap/. © 2010 Long et al.",
            "authors": [
                "Long Q.",
                "Jeffares D.C.",
                "Zhang Q.",
                "Ye K.",
                "Nizhynska V.",
                "Ning Z.",
                "Tyler-Smith C.",
                "Nordborg M."
            ],
            "cit_count": 14,
            "journal": "PLoS ONE",
            "pmid": "21264334",
            "title": "PoolHap: Inferring haplotype frequencies from pooled samples by next generation sequencing",
            "year": "2011-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:poolhap2",
        "biotoolsID": "poolhap2",
        "description": "Computer program that infers haplotype (or epitype in case of DNA methylation sequencing) from a pool.  In its current release, only pathogen sequencing application is implemented. In pathogen studies utilizing next generation sequencing, investigators ofte n collect samples naturally as pools of multiple strains, e.g., when the samples are taken from patients’ blood. To analyze these types of within-host polymorphisms, one would ideally like to determine the haplotypes in the sample.",
        "homepage": "https://code.google.com/p/poolhap2/",
        "name": "PoolHap2"
    }
}