{
    "name": "POPS", 
    "description": "Algorithm to calculate accessible surfaces areas at atomic and residue level.", 
    "homepage": "http://mathbio.nimr.mrc.ac.uk/wiki/POPS", 
    "biotoolsID": "pops", 
    "biotoolsCURIE": "biotools:pops", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0384", 
                    "term": "Accessible surface calculation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0387", 
                    "term": "Molecular surface calculation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2950", 
                    "term": "Residue distance calculation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_1816", 
                    "term": "Surface rendering"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0166", 
            "term": "Protein structural motifs and surfaces"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12087181", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Parameter optimized surfaces (POPS): Analysis of key interactions and conformational changes in the ribosome", 
                "abstract": "We present a new method for the calculation of solvent accessible surface areas at the atomic and residue levels, which we call parameter optimized surfaces (POPS-A and POPS-R). Atomic and residue areas (the latter simulated with a single sphere centered at the Cαs atom for amino acids and at the P atom for nucleotides) have been optimized versus accurate all-atoms methods. We concentrated on an analytical formula for the approximation of solvent accessibilities. The formula is simple, easily derivable and fast to compute, therefore it is practical for use in molecular dynamics simultations as an approximation to the first solvation shell. The residue based approach POPS-R has been derived as a useful tool for the analysis of large macromolecular assemblies like the ribosome, and is especially suited for use in refinement of low resolution structures. The structures of the 70S, 50S and 30S ribosomes have been analyzed in detail and most of the interactions within the sub-units and at their interfaces were clearly identified. Some interesting differences between 30S alone and within the 70S have been highlighted. Owing to the presence of the P-tRNA in the 70S ribosome, localized conformational rearrangements occur within the subunits, exposing Arg and Lys residues to negatively charged binding sites of P-tRNA. POPS-R also allows for estimates of the loss of free energy of solvation upon complex formation, particularly useful in designing new protein-RNA complexes and in suggesting more focused experimental work.", 
                "date": "2002-07-01T00:00:00Z", 
                "citationCount": 85, 
                "authors": [
                    {
                        "name": "Fraternali F."
                    }, 
                    {
                        "name": "Cavallo L."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12824328", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "POPS: A fast algorithm for solvent accessible surface areas at atomic and residue level", 
                "abstract": "POPS (Parameter OPtimsed Surfaces) is a new method to calculate solvent accessible surface areas, which is based on an empirically parameterisable analytical formula and fast to compute. Atomic and residue areas (the latter represented by a single sphere centered on the Cα atom of amino acids and at the P atom of nucleotides) have been optimised versus accurate all-atom methods. The parameterisation has been derived from a selected dataset of proteins and nucleic acids of different sizes and topologies. The residue based approach POPS-R, has been devised as a useful tool for the analysis of large macromolecular assemblies like the ribosome and it is specially suited for the refinement of low resolution structures. POPS-R also allows for estimates of the loss of free energy of solvation upon complex formation, which should be particularly useful for the design of new protein - protein and protein - nucleic acid complexes. The program POPS is available at http://mathbio.nimr.mrc.ac.uk/~ffranca/ POPS and at the mirror site http://www.cs.vu.nl/~ibivu/programs/popswww.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 149, 
                "authors": [
                    {
                        "name": "Cavallo L."
                    }, 
                    {
                        "name": "Kleinjung J."
                    }, 
                    {
                        "name": "Fraternali F."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T11:34:46Z", 
    "lastUpdate": "2018-12-10T12:58:39Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}