{"collectionID": [], "accessibility": [], "topic": [{"term": "Genetics", "uri": "http://edamontology.org/topic_3053"}, {"term": "Mathematics", "uri": "http://edamontology.org/topic_3315"}, {"term": "Data management", "uri": "http://edamontology.org/topic_3071"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "25992957", "type": null, "pmcid": null, "metadata": {"title": "QuantiFly: Robust trainable software for automated Drosophila egg counting", "abstract": "© 2015 Waithe et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. We report the development and testing of software called QuantiFly: an automated tool to quantify Drosophila egg laying. Many laboratories count Drosophila eggs as a marker of fitness. The existing method requires laboratory researchers to count eggs manually while looking down a microscope. This technique is both time-consuming and tedious, especially when experiments require daily counts of hundreds of vials. The basis of the QuantiFly software is an algorithm which applies and improves upon an existing advanced pattern recognition and machine-learning routine. The accuracy of the baseline algorithm is additionally increased in this study through correction of bias observed in the algorithm output. The QuantiFly software, which includes the refined algorithm, has been designed to be immediately accessible to scientists through an intuitive and responsive user-friendly graphical interface. The software is also open-source, self-contained, has no dependencies and is easily installed (https://github.com/dwaithe/quantifly). Compared to manual egg counts made from digital images, QuantiFly achieved average accuracies of 94% and 85% for eggs laid on transparent (defined) and opaque (yeast-based) fly media. Thus, the software is capable of detecting experimental differences in most experimental situations. Significantly, the advanced feature recognition capabilities of the software proved to be robust to food surface artefacts like bubbles and crevices. The user experience involves image acquisition, algorithm training by labelling a subset of eggs in images of some of the vials, followed by a batch analysis mode in which new images are automatically assessed for egg numbers. Initial training typically requires approximately 10 minutes, while subsequent image evaluation by the software is performed in just a few seconds. Given the average time per vial for manual counting is approximately 40 seconds, our software introduces a timesaving advantage for experiments starting with as few as 20 vials. We also describe an optional acrylic box to be used as a digital camera mount and to provide controlled lighting during image acquisition which will guarantee the conditions used in this study.", "citationCount": 6, "authors": [{"name": "Waithe D."}, {"name": "Rennert P."}, {"name": "Brostow G."}, {"name": "Piper M.D.W."}], "date": "2015-05-18T00:00:00Z", "journal": "PLoS ONE"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.imm.ox.ac.uk/contact-us", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:quantifly", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://github.com/dwaithe/quantifly", "function": [{"note": null, "input": [], "operation": [{"term": "Image analysis", "uri": "http://edamontology.org/operation_3443"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:55Z", "otherID": [], "description": "Software package for automating egg counting in Drosophila genetics research.", "toolType": ["Desktop application"], "editPermission": {"type": "private", "authors": []}, "language": ["Python"], "link": [{"url": "http://www.mybiosoftware.com/quantifly-automated-drosophila-egg-counting.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "quantifly", "additionDate": "2017-08-03T18:57:12Z", "name": "QuantiFly", "license": null, "documentation": [{"url": "https://github.com/dwaithe/quantifly/releases/tag/2.0", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}