{
    "additionDate": "2020-01-09T17:34:14Z",
    "biotoolsCURIE": "biotools:SOLart",
    "biotoolsID": "SOLart",
    "confidence_flag": "high",
    "description": "SOLart is a fast and accurate method for predicting the protein solubility of a target protein whose experimental or modeled structure is available. It yields a scaled solubility score with values close to zero indicating aggregate-prone proteins, while values close to 130 designate soluble proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://babylone.ulb.ac.be/SOLART/",
    "lastUpdate": "2020-06-12T19:59:54Z",
    "name": "SOLart",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ773",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: The solubility of a protein is often decisive for its proper functioning. Lack of solubility is a major bottleneck in high-throughput structural genomic studies and in high-concentration protein production, and the formation of protein aggregates causes a wide variety of diseases. Since solubility measurements are time-consuming and expensive, there is a strong need for solubility prediction tools. Results: We have recently introduced solubility-dependent distance potentials that are able to unravel the role of residue-residue interactions in promoting or decreasing protein solubility. Here, we extended their construction by defining solubility-dependent potentials based on backbone torsion angles and solvent accessibility, and integrated them, together with other structure- and sequence-based features, into a random forest model trained on a set of Escherichia coli proteins with experimental structures and solubility values. We thus obtained the SOLart protein solubility predictor, whose most informative features turned out to be folding free energy differences computed from our solubility-dependent statistical potentials. SOLart performances are very good, with a Pearson correlation coefficient between experimental and predicted solubility values of almost 0.7 both in cross-validation on the training dataset and in an independent set of Saccharomyces cerevisiae proteins. On test sets of modeled structures, only a limited drop in performance is observed. SOLart can thus be used with both high-resolution and low-resolution structures, and clearly outperforms state-of-art solubility predictors. It is available through a user-friendly webserver, which is easy to use by non-expert scientists.",
                "authors": [
                    {
                        "name": "Hou Q."
                    },
                    {
                        "name": "Kwasigroch J.M."
                    },
                    {
                        "name": "Rooman M."
                    },
                    {
                        "name": "Pucci F."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SOLart: A structure-based method to predict protein solubility and aggregation"
            },
            "pmid": "31603466"
        }
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}