{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T10:58:38Z",
    "biotoolsCURIE": "biotools:DeepSplice",
    "biotoolsID": "DeepSplice",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yi.zhang@uky.edu",
            "name": "Yi Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Deep learning based splice junction sequence classifier.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/zhangyimc/DeepSplice/blob/master/DeepSplice_v0.10/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangyimc/DeepSplice",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/zhangyimc/DeepSplice/issues"
        }
    ],
    "maturity": "Mature",
    "name": "DeepSplice",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12864-018-5350-1",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Exon splicing is a regulated cellular process in the transcription of protein-coding genes. Technological advancements and cost reductions in RNA sequencing have made quantitative and qualitative assessments of the transcriptome both possible and widely available. RNA-seq provides unprecedented resolution to identify gene structures and resolve the diversity of splicing variants. However, currently available ab initio aligners are vulnerable to spurious alignments due to random sequence matches and sample-reference genome discordance. As a consequence, a significant set of false positive exon junction predictions would be introduced, which will further confuse downstream analyses of splice variant discovery and abundance estimation. Results: In this work, we present a deep learning based splice junction sequence classifier, named DeepSplice, which employs convolutional neural networks to classify candidate splice junctions. We show (I) DeepSplice outperforms state-of-the-art methods for splice site classification when applied to the popular benchmark dataset HS3D, (II) DeepSplice shows high accuracy for splice junction classification with GENCODE annotation, and (III) the application of DeepSplice to classify putative splice junctions generated by Rail-RNA alignment of 21,504 human RNA-seq data significantly reduces 43 million candidates into around 3 million highly confident novel splice junctions. Conclusions: A model inferred from the sequences of annotated exon junctions that can then classify splice junctions derived from primary RNA-seq data has been implemented. The performance of the model was evaluated and compared through comprehensive benchmarking and testing, indicating a reliable performance and gross usability for classifying novel splice junctions derived from RNA-seq alignment.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "MacLeod J."
                    },
                    {
                        "name": "Liu J."
                    }
                ],
                "citationCount": 7,
                "date": "2018-12-27T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Discerning novel splice junctions derived from RNA-seq alignment: A deep learning approach"
            },
            "pmcid": "PMC6307148",
            "pmid": "30591034",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}