{
    "accessibility": "Open access",
    "additionDate": "2021-05-05T19:18:02Z",
    "biotoolsCURIE": "biotools:umic",
    "biotoolsID": "umic",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fpsom@certh.gr",
            "name": "Fotis E. Psomopoulos",
            "orcidid": "https://orcid.org/0000-0002-0222-4273",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "UMIc is an alignment free framework serving as a pre-processing step of FASTQ files for deduplication and correction of reads building consensus sequences from each UMI. The tool takes into account the frequency and the Phred quality of nucleotides and the distances between the UMIs and the actual sequences, and produces FASTQ files that contain the corrected sequences (without the UMI) and their quality.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BiodataAnalysisGroup/UMIc/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Greece"
    ],
    "homepage": "https://github.com/BiodataAnalysisGroup/UMIc",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-17T08:39:37Z",
    "license": "MIT",
    "maturity": "Emerging",
    "name": "UMIc",
    "owner": "fpsom",
    "publication": [
        {
            "doi": "10.3389/fgene.2021.660366",
            "metadata": {
                "abstract": "© Copyright © 2021 Tsagiopoulou, Maniou, Pechlivanis, Togkousidis, Kotrová, Hutzenlaub, Kappas, Chatzidimitriou and Psomopoulos.A recent refinement in high-throughput sequencing involves the incorporation of unique molecular identifiers (UMIs), which are random oligonucleotide barcodes, on the library preparation steps. A UMI adds a unique identity to different DNA/RNA input molecules through polymerase chain reaction (PCR) amplification, thus reducing bias of this step. Here, we propose an alignment free framework serving as a preprocessing step of fastq files, called UMIc, for deduplication and correction of reads building consensus sequences from each UMI. Our approach takes into account the frequency and the Phred quality of nucleotides and the distances between the UMIs and the actual sequences. We have tested the tool using different scenarios of UMI-tagged library data, having in mind the aspect of a wide application. UMIc is an open-source tool implemented in R and is freely available from https://github.com/BiodataAnalysisGroup/UMIc.",
                "authors": [
                    {
                        "name": "Tsagiopoulou M."
                    },
                    {
                        "name": "Maniou M.C."
                    },
                    {
                        "name": "Pechlivanis N."
                    },
                    {
                        "name": "Togkousidis A."
                    },
                    {
                        "name": "Kotrova M."
                    },
                    {
                        "name": "Hutzenlaub T."
                    },
                    {
                        "name": "Kappas I."
                    },
                    {
                        "name": "Chatzidimitriou A."
                    },
                    {
                        "name": "Psomopoulos F."
                    }
                ],
                "date": "2021-05-28T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "UMIc: A Preprocessing Method for UMI Deduplication and Reads Correction"
            },
            "type": [
                "Method"
            ]
        }
    ],
    "version": [
        "1.0"
    ]
}