{
    "additionDate": "2019-11-14T20:04:21Z",
    "biotoolsCURIE": "biotools:PIPR",
    "biotoolsID": "PIPR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "muhaochen@ucla.edu",
            "name": "Muhao Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'PPI' (bio.tools/ppi) | Multifaceted protein-protein interaction prediction based on Siamese residual RCNN | MOTIVATION:Sequence-based protein-protein interaction (PPI) prediction represents a fundamental computational biology problem. To address this problem, extensive research efforts have been made to extract predefined features from the sequences. Based on these features, statistical algorithms are learned to classify the PPIs. However, such explicit features are usually costly to extract, and typically have limited coverage on the PPI information. RESULTS:We present an end-to-end framework, PIPR (Protein-Protein Interaction Prediction Based on Siamese Residual RCNN), for PPI predictions using only the protein sequences",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/muhaochen/seq_ppi",
    "lastUpdate": "2020-12-09T15:02:55.901010Z",
    "name": "PIPR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ328",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Sequence-based protein-protein interaction (PPI) prediction represents a fundamental computational biology problem. To address this problem, extensive research efforts have been made to extract predefined features from the sequences. Based on these features, statistical algorithms are learned to classify the PPIs. However, such explicit features are usually costly to extract, and typically have limited coverage on the PPI information. Results: We present an end-to-end framework, PIPR (Protein-Protein Interaction Prediction Based on Siamese Residual RCNN), for PPI predictions using only the protein sequences. PIPR incorporates a deep residual recurrent convolutional neural network in the Siamese architecture, which leverages both robust local features and contextualized information, which are significant for capturing the mutual influence of proteins sequences. PIPR relieves the data pre-processing efforts that are required by other systems, and generalizes well to different application scenarios. Experimental evaluations show that PIPR outperforms various state-of-the-art systems on the binary PPI prediction problem. Moreover, it shows a promising performance on more challenging problems of interaction type prediction and binding affinity estimation, where existing approaches fall short.",
                "authors": [
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Ju C.J.-T."
                    },
                    {
                        "name": "Zhou G."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Chang K.-W."
                    },
                    {
                        "name": "Zaniolo C."
                    },
                    {
                        "name": "Wang W."
                    }
                ],
                "citationCount": 10,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Multifaceted protein-protein interaction prediction based on Siamese residual RCNN"
            },
            "pmcid": "PMC6681469",
            "pmid": "31510705"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}