{"credit":[{"email":"gajula.ibt@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"language":["PHP","SQL"],"license":"CC-BY-4.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"}]},"publication":[{"abstract":"© 2018 Kumar A et al.Cereals are key contributors to global food security. Genes involved in the uptake (transport), assimilation and utilization of macro- and micronutrients are responsible for the presence of these nutrients in grain and straw. Although many genomic databases for cereals are available, there is currently no cohesive web resource of manually curated nutrient use efficiency (NtUE)-related genes and quantitative trait loci (QTLs). In this study, we present a web-resource containing information on NtUE-related genes/QTLs and the corresponding available microRNAs for some of these genes in four major cereal crops (wheat ( Triticum aestivum), rice ( Oryza sativa), maize ( Zea mays), barley ( Hordeum vulgare)), two alien species related to wheat ( Triticum urartu and Aegilops tauschii), and two model species ( Brachypodium distachyon and Arabidopsis thaliana). Gene annotations integrated in the current web resource were manually curated from the existing databases and the available literature. The primary goal of developing this web resource is to provide descriptions of the NtUE-related genes and their functional annotation. MicroRNAs targeting some of the NtUE related genes and the QTLs for NtUE-related traits are also included. The genomic information embedded in the web resource should help users to search for the desired information.","authors":["Suravajhala P.","Kumar A.","Pandeya A.","Malik G.","Sharma M.","P. H.K.","S. A.K.","Gahlaut V.","Gajula M.N.V.P.","Singh K.P.","Balyan H.S.","Gupta P.K."],"cit_count":0,"doi":"10.12688/f1000research.14561.1","journal":"F1000Research","title":"A web resource for nutrient use efficiency-related genes, quantitative trait loci and microRNAs in important cereals and model plants [version 1; referees: 2 approved]","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:ntue","biotoolsID":"ntue","description":"Nutrient Use Efficiency.  Repository of  NtUE-related genes/QTLs and the corresponding available microRNAs for some of these genes in four major cereal crops (wheat (Triticum aestivum), rice (Oryza sativa), maize (Zea mays), barley (Hordeum vulgare)), two alien species related to wheat (Triticum urartu and Aegilops tauschii), and two model species (Brachypodium distachyon and Arabidopsis thaliana).","homepage":"http://bioclues.org/NtUE/index.php","name":"NtUE"}}