{
    "additionDate": "2015-01-22T11:40:42Z",
    "biotoolsCURIE": "biotools:ultranet",
    "biotoolsID": "ultranet",
    "credit": [
        {
            "email": "comin@dei.unipd.it",
            "name": "Matteo Comin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~ciompin/"
        },
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Network Phylogeny",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.dei.unipd.it/~ciompin/main/Ultranet/Documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://www.dei.unipd.it/~ciompin/main/Ultranet/Ultranet.html",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "GPL-3.0",
    "name": "UltraNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1748-7188-8-7",
            "metadata": {
                "abstract": "Background: The large majority of optimization problems related to the inference of distance-based trees used in phylogenetic analysis and classification is known to be intractable. One noted exception is found within the realm of ultrametric distances. The introduction of ultrametric trees in phylogeny was inspired by a model of evolution driven by the postulate of a molecular clock, now dismissed, whereby phylogeny could be represented by a weighted tree in which the sum of the weights of the edges separating any given leaf from the root is the same for all leaves. Both, molecular clocks and rooted ultrametric trees, fell out of fashion as credible representations of evolutionary change. At the same time, ultrametric dendrograms have shown good potential for purposes of classification in so far as they have proven to provide good approximations for additive trees. Most of these approximations are still intractable, but the problem of finding the nearest ultrametric distance matrix to a given distance matrix with respect to the L∞ distance has been long known to be solvable in polynomial time, the solution being incarnated in any minimum spanning tree for the weighted graph subtending to the matrix.Results: This paper expands this subdominant ultrametric perspective by studying ultrametric networks, consisting of the collection of all edges involved in some minimum spanning tree. It is shown that, for a graph with n vertices, the construction of such a network can be carried out by a simple algorithm in optimal time O(n2) which is faster by a factor of n than the direct adaptation of the classical O(n3) paradigm by Warshall for computing the transitive closure of a graph. This algorithm, called UltraNet, will be shown to be easily adapted to compute relaxed networks and to support the introduction of artificial points to reduce the maximum distance between vertices in a pair. Finally, a few experiments will be discussed to demonstrate the applicability of subdominant ultrametric networks.Availability: http://www.dei.unipd.it/~ciompin/main/Ultranet/Ultranet.html. © 2013 Apostolico et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Apostolico A."
                    },
                    {
                        "name": "Comin M."
                    },
                    {
                        "name": "Dress A."
                    },
                    {
                        "name": "Parida L."
                    }
                ],
                "citationCount": 4,
                "date": "2013-03-05T00:00:00Z",
                "journal": "Algorithms for Molecular Biology",
                "title": "Ultrametric networks: A new tool for phylogenetic analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
