{
    "additionDate": "2021-01-18T08:34:45Z",
    "biotoolsCURIE": "biotools:ittca-hybrid",
    "biotoolsID": "ittca-hybrid",
    "confidence_flag": "tool",
    "description": "Improved and robust identification of tumor T cell antigens by utilizing hybrid feature representation.\n\nThis is the website for predicting T-Cell peptides from the publication called ...\n\niTTCA-Hybrid: Improved and robust identification of tumor T cell antigens by hybridizing multiple feature representations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://camt.pythonanywhere.com/iTTCA-Hybrid",
    "lastUpdate": "2021-02-11T10:46:09Z",
    "name": "iTTCA-Hybrid",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.AB.2020.113747",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.In spite of the repertoire of existing cancer therapies, the ongoing recurrence and new cases of cancer poses a challenging health concern that prompts for novel and effective treatment. Cancer immunotherapy represents a promising venue for treatment by harnessing the body's immune system to combat cancer. Therefore, the identification of tumor T cell antigen represents an exciting area to explore. Computational tools have been instrumental in the identification of tumor T cell antigens and it is highly desirable to attain highly accurate models in a timely fashion from large volumes of peptides generated in the post-genomic era. In this study, we present a reliable, accurate, unbiased and automated sequence-based predictor named iTTCA-Hybrid for identifying tumor T cell antigens. The iTTCA-Hybrid approach proposed herein employs two robust machine learning models (e.g. support vector machine and random forest) constructed using five feature encoding strategies (i.e. amino acid composition, dipeptide composition, pseudo amino acid composition, distribution of amino acid properties in sequences and physicochemical properties derived from the AAindex). Rigorous independent test indicated that the iTTCA-Hybrid approach achieved an accuracy and area under the curve of 73.60% and 0.783, respectively, which corresponds to 4% and 7% performance increase than those of existing methods thereby indicating the superiority of the proposed model. To the best of our knowledge, the iTTCA-Hybrid is the first free web server (Available at http://camt.pythonanywhere.com/iTTCA-Hybrid) for identifying tumor T cell antigens presented by the MHC class I. The proposed web server allows robust predictions to be made without the need to develop in-house prediction models.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 13,
                "date": "2020-06-15T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "iTTCA-Hybrid: Improved and robust identification of tumor T cell antigens by utilizing hybrid feature representation"
            },
            "pmid": "32333902"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}