{
    "additionDate": "2021-01-18T10:07:02Z",
    "biotoolsCURIE": "biotools:csbfinder-s",
    "biotoolsID": "csbfinder-s",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michaluz@cs.bgu.ac.il",
            "name": "Michal Ziv-Ukelson",
            "typeEntity": "Person"
        }
    ],
    "description": "CSBFinder-S is a tool for the discovery and ranking of colinear syntenic blocks (CSBs) - groups of genes that are consistently located close to each other, in the same order, across a wide range of taxa. CSBFinder-S incorporates efficient algorithms that identify CSBs in large genomic datasets. The discovered CSBs are ranked according to a probabilistic score and clustered to families according to their gene content similarity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dinasv/CSBFinder",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-18T16:34:43Z",
    "license": "Apache-2.0",
    "name": "CSBFinder-S",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA503",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: An important task in comparative genomics is to detect functional units by analyzing gene-context patterns. Colinear syntenic blocks (CSBs) are groups of genes that are consistently encoded in the same neighborhood and in the same order across a wide range of taxa. Such CSBs are likely essential for the regulation of gene expression in prokaryotes. Recent results indicate that colinearity can be conserved across multiple operons, thus motivating the discovery of multi-operon CSBs. This computational task raises scalability challenges in large datasets. Results: We propose an efficient algorithm for the discovery of cross-strand multi-operon CSBs in large genomic datasets. The proposed algorithm uses match-point arithmetic, which is scalable for large datasets of microbial genomes in terms of running time and space requirements. The algorithm is implemented and incorporated into a tool with a graphical user interface, called CSBFinder-S. We applied CSBFinder-S to data mine 1485 prokaryotic genomes and analyzed the identified cross-strand CSBs. Our results indicate that most of the syntenic blocks are exclusively colinear. Additional results indicate that transcriptional regulation by overlapping transcriptional genes is abundant in bacteria. We demonstrate the utility of CSBFinder-S to identify common function of the gene-pair PulEF in multiple contexts, including Type 2 Secretion System, Type 4 Pilus System and DNA uptake machinery.",
                "authors": [
                    {
                        "name": "Svetlitsky D."
                    },
                    {
                        "name": "Dagan T."
                    },
                    {
                        "name": "Ziv-Ukelson M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Discovery of multi-operon colinear syntenic blocks in microbial genomes"
            },
            "pmcid": "PMC7355258",
            "pmid": "32657415"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}