{
    "additionDate": "2019-11-14T20:01:37Z",
    "biotoolsCURIE": "biotools:Databio",
    "biotoolsID": "Databio",
    "confidence_flag": "tool",
    "description": "Automated Gene Data Integration with Databio | Automated data transformation for bioinformatics | Automated data integration tools | A simple Gene ID mapping service for Bioinformatics. Upload a gene-oriented data set, we'll automatically detect the identifiers in use, and offer to convert them to match other providers in just a few clicks | A web portal that does automated identifier translation for bioinformatics",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                }
            ]
        }
    ],
    "homepage": "https://datab.io/",
    "lastUpdate": "2020-12-17T13:14:39Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/joiningdata/databio/"
        }
    ],
    "name": "Datab.io",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/768077"
        },
        {
            "doi": "10.1186/s13104-020-05038-w",
            "metadata": {
                "abstract": "© 2020 The Author(s).Objective: Although sequencing and other high-throughput data production technologies are increasingly affordable, data analysis and interpretation remains a significant factor in the cost of -omics studies. Despite the broad acceptance of findable, accessible, interoperable, and reusable (FAIR) data principles which focus on data discoverability and annotation, data integration remains a significant bottleneck in linking prior work in order to better understand novel research. Relevant and timely information discovery is difficult for increasingly multi-disciplinary projects when scientists cannot easily keep up with work across multiple fields. Computational tools are necessary to accurately describe data contents, and empower linkage to existing resources without prior knowledge of the various database resources. Results: We developed the Databio tool, accessible at https://datab.io/, to automate data parsing, identifier detection, and streamline common tasks to provide a point-and-click approach to data manipulation and integration in life sciences research and translational medicine. Databio uses fast real-time data structures and a data warehouse of 137 million identifiers, with automated heuristics to describe data provenance without highly specialized knowledge or bioinformatics training.",
                "authors": [
                    {
                        "name": "Reid R.W."
                    },
                    {
                        "name": "Ferrier J.W."
                    },
                    {
                        "name": "Jay J.J."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Automated gene data integration with Databio"
            },
            "pmcid": "PMC7110638",
            "pmid": "32238171"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}