
{
    "credit": [
        {
            "email": "li.yan@roswellpark.org",
            "name": "Li Yan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/OSAT.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/OSAT_1.22.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "Artistic-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Laboratory techniques",
                "uri": "http://edamontology.org/topic_3361"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "http://www.biomedcentral.com/1471-2164/13/689"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Batch effect is one type of variability that is not of primary interest but ubiquitous in sizable genomic experiments. To minimize the impact of batch effects, an ideal experiment design should ensure the even distribution of biological groups and confounding factors across batches. However, due to the practical complications, the availability of the final collection of samples in genomics study might be unbalanced and incomplete, which, without appropriate attention in sample-to-batch allocation, could lead to drastic batch effects. Therefore, it is necessary to develop effective and handy tool to assign collected samples across batches in an appropriate way in order to minimize the impact of batch effects.Results: We describe OSAT (Optimal Sample Assignment Tool), a bioconductor package designed for automated sample-to-batch allocations in genomics experiments.Conclusions: OSAT is developed to facilitate the allocation of collected samples to different batches in genomics study. Through optimizing the even distribution of samples in groups of biological interest into different batches, it can reduce the confounding or correlation between batches and the biological variables of interest. It can also optimize the homogeneous distribution of confounding factors across batches. It can handle challenging instances where incomplete and unbalanced sample collections are involved as well as ideally balanced designs. © 2012 Yan et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Yan L.",
                "Ma C.",
                "Wang D.",
                "Hu Q.",
                "Qin M.",
                "Conroy J.M.",
                "Sucheston L.E.",
                "Ambrosone C.B.",
                "Johnson C.S.",
                "Wang J.",
                "Liu S."
            ],
            "cit_count": 15,
            "doi": "10.1186/1471-2164-13-689",
            "journal": "BMC Genomics",
            "title": "OSAT: A tool for sample-to-batch allocations in genomics experiments",
            "type": "Primary",
            "year": "2012-12-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:osat",
        "biotoolsID": "osat",
        "description": "A sizable genomics study often involves the use of multiple batches. To minimize batch effects, a careful experiment design should ensure the even distribution of biological groups and confounding factors across batches. This tool is developed to facilitate the allocation of samples to different batches. It produces setup that optimizes the even distribution of samples in groups of biological interest into batches, reducing the confounding or correlation between batches and variables.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/OSAT.html",
        "name": "OSAT",
        "version": [
            "1.22.0"
        ]
    }
}