{
    "additionDate": "2021-11-29T10:12:26.552448Z",
    "biotoolsCURIE": "biotools:rephine-drug",
    "biotoolsID": "rephine-drug",
    "confidence_flag": "tool",
    "description": "RePhine is a method for identification of drug response related transcriptional regulators by modeling correlation patterns of targets. RePhine takes in pharmacogenomics data containing gene expression, copy number, mutation status, cancer type information and pharmacological profiles for estimation of associations between genes expression and drug response. It also takes in ChIP-seq data for target inference.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/coexps/Rephine",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:15:40.267591Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/coexps/Rephine/issues"
        }
    ],
    "name": "RePhine",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2019.09.008",
            "metadata": {
                "abstract": "Transcriptional regulators (TRs) participate in essential processes in cancer pathogenesis and are critical therapeutic targets. Identification of drug response-related TRs from cell line-based compound screening data is often challenging due to low mRNA abundance of TRs, protein modifications, and other confounders (CFs). In this study, we developed a regression-based pharmacogenomic and ChIP-seq data integration method (RePhine) to infer the impact of TRs on drug response through integrative analyses of pharmacogenomic and ChIP-seq data. RePhine was evaluated in simulation and pharmacogenomic data and was applied to pan-cancer datasets with the goal of biological discovery. In simulation data with added noises or CFs and in pharmacogenomic data, RePhine demonstrated an improved performance in comparison with three commonly used methods (including Pearson correlation analysis, logistic regression model, and gene set enrichment analysis). Utilizing RePhine and Cancer Cell Line Encyclopedia data, we observed that RePhine-derived TR signatures could effectively cluster drugs with different mechanisms of action. RePhine predicted that loss-of-function of EZH2/PRC2 reduces cancer cell sensitivity toward the BRAF inhibitor PLX4720. Experimental validation confirmed that pharmacological EZH2 inhibition increases the resistance of cancer cells to PLX4720 treatment. Our results support that RePhine is a useful tool for inferring drug response-related TRs and for potential therapeutic applications. The source code for RePhine is freely available at https://github.com/coexps/RePhine.",
                "authors": [
                    {
                        "name": "Genchev G.Z."
                    },
                    {
                        "name": "Hui L."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Qin W."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 3,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "RePhine: An Integrative Method for Identification of Drug Response-related Transcriptional Regulators"
            },
            "pmcid": "PMC9040019",
            "pmid": "33713851"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        }
    ]
}
