{
    "additionDate": "2020-01-14T09:01:12Z",
    "biotoolsCURIE": "biotools:CANDO",
    "biotoolsID": "CANDO",
    "confidence_flag": "tool",
    "description": "CANDO is a open-source, unique computational drug discovery, design, and repurposing platform.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ram-compbio/CANDO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:49:12.620374Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://compbio.buffalo.edu/software/"
        }
    ],
    "name": "Computational Analysis of Novel Drug Opportunities (CANDO)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/845545"
        },
        {
            "doi": "10.1021/acs.jcim.0c00110",
            "metadata": {
                "abstract": "Traditional drug discovery methods focus on optimizing the efficacy of a drug against a single biological target of interest for a specific disease. However, evidence supports the multitarget theory, i.e., drugs work by exerting their therapeutic effects via interaction with multiple biological targets, which have multiple phenotypic effects. Analytics of drug−protein interactions on a large proteomic scale provides insight into disease systems while also allowing for prediction of putative therapeutics against specific indications. We present a Python package for analysis of drug−proteome and drug−disease relationships implementing the Computational Analysis of Novel Drug Opportunities (CANDO) platform. The CANDO package allows for rapid drug similarity assessment, most notably via an in-house interaction scoring protocol where billions of drug−protein interactions are rapidly scored and the similarity of drug-proteome interaction signatures is calculated. The package also implements a variety of benchmarking protocols for shotgun drug discovery and repurposing, i.e., to determine how every known drug is related to every other in the context of the indications/diseases for which they are approved. Drug predictions are generated through consensus scoring of the most similar compounds to drugs known to treat a particular indication. Support for comparing and ranking novel chemical entities, as well as machine learning modules for both benchmarking and putative drug candidate prediction is also available. The CANDO Python package is available on GitHub at https://github.com/ ram-compbio/CANDO, through the Conda Python package installer, and at http://compbio.org/software/.",
                "authors": [
                    {
                        "name": "Chopra G."
                    },
                    {
                        "name": "Falls Z."
                    },
                    {
                        "name": "Mangione W."
                    },
                    {
                        "name": "Samudrala R."
                    }
                ],
                "citationCount": 15,
                "date": "2020-09-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Cando.py: Open source software for predictive bioanalytics of large scale drug−protein−disease data"
            },
            "pmcid": "PMC8098009",
            "pmid": "32515949"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
