{
    "additionDate": "2020-01-14T19:29:18Z",
    "biotoolsCURIE": "biotools:AcetoBase",
    "biotoolsID": "AcetoBase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "abhijeetsingh.aau@gmail.com",
            "name": "Abhijeet Singh",
            "orcidid": "https://orcid.org/0000-0002-0807-6080",
            "typeEntity": "Person"
        },
        {
            "name": "Anna Schnürer",
            "typeEntity": "Person"
        }
    ],
    "description": "a functional gene repository and database for formyltetrahydrofolate synthetase sequences.\n\nAcetoBase is a first dedicated repository and curated database for the analysis of acetogenic bacteria based on the key functional gene formyltetrahydrofolate synthetase (FTHFS/fhs) of Wood-Ljungdahl Pathway for Acetogenesis. The database contains ~18,000 full length bacterial protein accessions, ~13,000 full length bacterial nucleotide accessions and ~3,000 bacterial clone accessions. Approximately 6,000 taxonomic identifiers contains whole genomic meta-data information",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://acetobase.molbio.slu.se/download"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://acetobase.molbio.slu.se",
    "lastUpdate": "2020-12-01T14:11:42.637887Z",
    "name": "AcetoBase",
    "owner": "abhijeet_singh",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ142",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Acetogenic bacteria are imperative to environmental carbon cycling and diverse biotechnological applications, but their extensive physiological and taxonomical diversity is an impediment to systematic taxonomic studies. Acetogens are chemolithoautotrophic bacteria that perform reductive carbon fixation under anaerobic conditions through the Wood-Ljungdahl pathway (WLP)/acetyl-coenzyme A pathway. The gene-encoding formyltetrahydrofolate synthetase (FTHFS), a key enzyme of this pathway, is highly conserved and can be used as a molecular marker to probe acetogenic communities. However, there is a lack of systematic collection of FTHFS sequence data at nucleotide and protein levels. In an attempt to streamline investigations on acetogens, we developed AcetoBase - a repository and database for systematically collecting and organizing information related to FTHFS sequences. AcetoBase also provides an opportunity to submit data and obtain accession numbers, perform homology searches for sequence identification and access a customized blast database of submitted sequences. AcetoBase provides the prospect to identify potential acetogenic bacteria, based on metadata information related to genome content and the WLP, supplemented with FTHFS sequence accessions, and can be an important tool in the study of acetogenic communities. AcetoBase can be publicly accessed at https://acetobase.molbio.slu.se.",
                "authors": [
                    {
                        "name": "Singh A."
                    },
                    {
                        "name": "Muller B."
                    },
                    {
                        "name": "Fuxelius H.-H."
                    },
                    {
                        "name": "Schnurer A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "AcetoBase: a functional gene repository and database for formyltetrahydrofolate synthetase sequences"
            },
            "pmcid": "PMC6908459",
            "pmid": "31832668"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ]
}