{
    "additionDate": "2017-08-03T18:37:02Z",
    "biotoolsCURIE": "biotools:bless",
    "biotoolsID": "bless",
    "credit": [
        {
            "email": "aramach4@illinois.edu",
            "name": "Anand Ramachandran",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.bioen.illinois.edu/index.html"
        }
    ],
    "description": "BLoom-filter-based Error correction Solution for high-throughput Sequencing reads is a novel algorithm that produces accurate correction results with much less memory compared with previous solutions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/bless-ec/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/p/bless-ec/wiki/Home/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bless-v0p17-bloom-filter-based-error-correction-tool-for-ngs-reads.html"
        }
    ],
    "name": "BLESS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Rapid advances in next-generation sequencing (NGS) technology have led to exponential increase in the amount of genomic information. However, NGS reads contain far more errors than data from traditional sequencing methods, and downstream genomic analysis results can be improved by correcting the errors. Unfortunately, all the previous error correction methods required a large amount of memory, making it unsuitable to process reads from large genomes with commodity computers. Results: We present a novel algorithm that produces accurate correction results with much less memory compared with previous solutions. The algorithm, named BLoom-filter-based Error correction Solution for high-throughput Sequencing reads (BLESS), uses a single minimum-sized Bloom filter, and is also able to tolerate a higher false-positive rate, thus allowing us to correct errors with a 40× memory usage reduction on average compared with previous methods. Meanwhile, BLESS can extend reads like DNA assemblers to correct errors at the end of reads. Evaluations using real and simulated reads showed that BLESS could generate more accurate results than existing solutions. After errors were corrected using BLESS, 69% of initially unaligned reads could be aligned correctly. Additionally, de novo assembly results became 50% longer with 66% fewer assembly errors. © The Author 2014.",
                "authors": [
                    {
                        "name": "Heo Y."
                    },
                    {
                        "name": "Wu X.-L."
                    },
                    {
                        "name": "Chen D."
                    },
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Hwu W.-M."
                    }
                ],
                "citationCount": 74,
                "date": "2014-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BLESS: Bloom filter-based error correction solution for high-throughput sequencing reads"
            },
            "pmid": "24451628"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}