{
    "accessibility": "Open access",
    "additionDate": "2022-10-19T19:32:56.190127Z",
    "biotoolsCURIE": "biotools:metaproclust-ms1",
    "biotoolsID": "metaproclust-ms1",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dfigeys@uottawa.ca",
            "name": "Daniel Figeys",
            "orcidid": "https://orcid.org/0000-0002-5373-7546",
            "typeEntity": "Person"
        },
        {
            "name": "Leyuan Li"
        },
        {
            "name": "Zhibin Ning"
        },
        {
            "name": "Caitlin M. A. Simopoulos",
            "orcidid": "https://orcid.org/0000-0001-9832-7797"
        }
    ],
    "description": "An MS1 Profiling Approach for Large-Scale Microbiome Screening.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/northomics/MetaProClust-MS1",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-10-19T19:32:56.192865Z",
    "license": "GPL-3.0",
    "name": "MetaProClust-MS1",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00381-22",
            "metadata": {
                "abstract": "2022 Simopoulos et al.Metaproteomics is used to explore the functional dynamics of microbial communities. However, acquiring metaproteomic data by tandem mass spectrometry (MS/MS) is time-consuming and resource-intensive, and there is a demand for computational methods that can be used to reduce these resource requirements. We present MetaProClust-MS1, a computational framework for microbiome feature screening developed to prioritize samples for follow-up MS/MS. In this proof-of-concept study, we tested and compared MetaProClust-MS1 results on gut microbiome data, from fecal samples, acquired using short 15-min MS1-only chromatographic gradients and MS1 spectra from longer 60-min gradients to MS/MS-acquired data. We found that MetaProClust-MS1 identified robust gut microbiome responses caused by xenobiotics with significantly correlated cluster topologies of comparable data sets. We also used MetaProClust-MS1 to reanalyze data from both a clinical MS/MS diagnostic study of pediatric patients with inflammatory bowel disease and an experiment evaluating the therapeutic effects of a small molecule on the brain tissue of Alzheimer’s disease mouse models. MetaProClust-MS1 clusters could distinguish between inflammatory bowel disease diagnoses (ulcerative colitis and Crohn’s disease) using samples from mucosal luminal interface samples and identified hippocampal proteome shifts of Alzheimer’s disease mouse models after small-molecule treatment. Therefore, we demonstrate that MetaProClust-MS1 can screen both microbiomes and single-species proteomes using only MS1 profiles, and our results suggest that this approach may be generalizable to any proteomics experiment. MetaProClust-MS1 may be especially useful for large-scale metaproteomic screening for the prioritization of samples for further metaproteomic characterization, using MS/MS, for instance, in addition to being a promising novel approach for clinical diagnostic screening. IMPORTANCE Growing evidence suggests that human gut microbiome composition and function are highly associated with health and disease. As such, high-throughput metaproteomic studies are becoming more common in gut microbiome research. However, using a conventional long liquid chromatography (LC)-MS/MS gradient metaproteomics approach as an initial screen in large-scale microbiome experiments can be slow and expensive. To combat this challenge, we introduce MetaProClust-MS1, a computational framework for microbiome screening using MS1-only profiles. In this proof-of-concept study, we show that MetaProClust-MS1 identifies clusters of gut microbiome treatments using MS1-only profiles similar to those identified using MS/MS. Our approach allows researchers to prioritize samples and treatments of interest for further metaproteomic analyses and may be generally applicable to any proteomic analysis. In particular, this approach may be especially useful for large-scale metaproteomic screening or in clinical settings where rapid diagnostic evidence is required.",
                "authors": [
                    {
                        "name": "Figeys D."
                    },
                    {
                        "name": "Khamis M.M."
                    },
                    {
                        "name": "Lavallee-Adam M."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Ning Z."
                    },
                    {
                        "name": "Simopoulos C.M.A."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "mSystems",
                "title": "MetaProClust-MS1: an MS1 Profiling Approach for Large-Scale Microbiome Screening"
            },
            "pmcid": "PMC9426440",
            "pmid": "35950762"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
