
{
    "credit": [
        {
            "email": "vastdb@googlegroups.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://vastdb.crg.eu/wiki/Downloads"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene identifier",
                        "uri": "http://edamontology.org/data_1025"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    },
                    "format": [
                        {
                            "term": "Map format",
                            "uri": "http://edamontology.org/format_2060"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Tapialet al.Alternative splicing (AS) generates remarkable regulatory and proteomic complexity in metazoans. However, the functions of most AS events are not known, and programs of regulated splicing remain to be identified. To address these challenges, we describe the Vertebrate Alternative Splicing and Transcription Database (VastDB), the largest resource of genome-wide, quantitative profiles of AS events assembled to date. VastDB provides readily accessible quantitative information on the inclusion levels and functional associations of AS events detected in RNA-seq data from diverse vertebrate cell and tissue types, as well as developmental stages. The VastDB profiles reveal extensive new intergenic and intragenic regulatory relationships among different classes of AS and previously unknown and conserved landscapes of tissue-regulated exons. Contrary to recent reports concluding that nearly all human genes express a single major isoform, VastDB provides evidence that at least 48% of multiexonic protein-coding genes express multiple splice variants that are highly regulated in a cell/tissue-specific manner, and that >18% of genes simultaneously express multiple major isoforms across diverse cell and tissue types. Isoforms encoded by the latter set of genes are generally coexpressed in the same cells and are often engaged by translating ribosomes. Moreover, they are encoded by genes that are significantly enriched in functions associated with transcriptional control, implying they may have an important and wide-ranging role in controlling cellular activities. VastDB thus provides an unprecedented resource for investigations of AS function and regulation.",
            "authors": [
                "Tapial J.",
                "Ha K.C.H.",
                "Sterne-Weiler T.",
                "Gohr A.",
                "Braunschweig U.",
                "Hermoso-Pulido A.",
                "Quesnel-Vallieres M.",
                "Permanyer J.",
                "Sodaei R.",
                "Marquez Y.",
                "Cozzuto L.",
                "Wang X.",
                "Gomez-Velazquez M.",
                "Rayon T.",
                "Manzanares M.",
                "Ponomarenko J.",
                "Blencowe B.J.",
                "Irimia M."
            ],
            "cit_count": 21,
            "doi": "10.1101/gr.220962.117",
            "journal": "Genome Research",
            "title": "An atlas of alternative splicing profiles and functional associations reveals new regulatory programs and genes that simultaneously express multiple major isoforms",
            "year": "2017-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vastdb",
        "biotoolsID": "vastdb",
        "description": "An atlas of alternative splicing profiles in vertebrate cell and tissue types",
        "homepage": "http://vastdb.crg.eu/",
        "name": "VastDB"
    }
}