{
    "additionDate": "2021-01-18T11:58:09Z",
    "biotoolsCURIE": "biotools:hpenet",
    "biotoolsID": "hpenet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangxiaodong@baafs.net.cn",
            "name": "Xiaodong Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "zhensu@cau.edu.cn",
            "name": "Zhen Su",
            "typeEntity": "Person"
        }
    ],
    "description": "Co-expression Network Database for <i>de novo</i> Transcriptome Assembly of <i>Paeonia lactiflora</i> Pall.\n\nPaeonia lactiflora Pall., commonly known as the herbaceous peony, is an ornamental flowering plant known around the world. Its oil contains a high proportion of polyunsaturated fatty acids (PUFAs). We produced 40 in-house RNA-seq datasets from 10 different tissues and performed de novo transcriptome assembly to obtain a complete transcriptome. Moreover,we had constructed the co-expression network database, HpeNet, which contains transcriptome data, gene information, the co-expression network, and so forth. Furthermore some analytical tools, such as blast, gene expression profiling analysis and gene set enrichment analysis (GSEA), were supported for network analysis and functional annotation. We hope that the HpeNet database will be beneficial to future work on Paeonia lactiflora Pall.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.cau.edu.cn/HpeNet",
    "lastUpdate": "2021-01-30T12:08:00Z",
    "name": "HpeNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.570138",
            "metadata": {
                "abstract": "© Copyright © 2020 Sheng, She, Xu, Hong, Su and Zhang.The herbaceous peony (Paeonia lactiflora Pall.) is a well-known ornamental flowering and pharmaceutical plant found in China. Its high medicinal value has long been recognized by traditional Chinese medicine (as Radix paeoniae Alba and Radix paeoniae Rubra), and it has become economically valued for its oilseed in recent years; like other Paeonia species, it has been identified as a novel resource for the α-linolenic acid used in seed oil production. However, its genome has not yet been sequenced, and little transcriptome data on Paeonia lactiflora are available. To obtain a comprehensive transcriptome for Paeonia lactiflora, RNAs from 10 tissues of the Paeonia lactiflora Pall. cv Shaoyou17C were used for de novo assembly, and 416,062 unigenes were obtained. Using a homology search, it was found that 236,222 (approximately 57%) unigenes had at least one BLAST hit in one or more public data resources. The construction of co-expression networks is a feasible means for improving unigene annotation. Using in-house transcriptome data, we obtained a co-expression network covering 95.13% of the unigenes. Then we integrated co-expression network analyses and lipid-related pathway genes to study lipid metabolism in Paeonia lactiflora cultivars. Finally, we constructed the online database HpeNet (http://bioinformatics.cau.edu.cn/HpeNet) to integrate transcriptome data, gene information, the co-expression network, and so forth. The database can also be searched for gene details, gene functions, orthologous matches, and other data. Our online database may help the research community identify functional genes and perform research on Paeonia lactiflora more conveniently. We hope that de novo transcriptome assembly, combined with co-expression networks, can provide a feasible means to predict the gene function of species that do not have a reference genome.",
                "authors": [
                    {
                        "name": "Hong Y."
                    },
                    {
                        "name": "She J."
                    },
                    {
                        "name": "Sheng M."
                    },
                    {
                        "name": "Su Z."
                    },
                    {
                        "name": "Xu W."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2020-10-21T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "HpeNet: Co-expression Network Database for de novo Transcriptome Assembly of Paeonia lactiflora Pall"
            },
            "pmcid": "PMC7641121",
            "pmid": "33193666"
        }
    ],
    "toolType": [
        "Database portal",
        "Web service"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
