{
    "accessibility": "Open access",
    "additionDate": "2018-08-07T09:13:29Z",
    "biotoolsCURIE": "biotools:gw-sem",
    "biotoolsID": "gw-sem",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bverhulst@vcu.edu",
            "name": "Brad Verhulst",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Statistical Package to Conduct Genome-Wide Structural Equation Modeling.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.people.vcu.edu/~bverhulst/GW-SEM/GW-SEM.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.people.vcu.edu/~bverhulst/GW-SEM/GW-SEM.R",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "GW-SEM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1007/s10519-017-9842-6",
            "metadata": {
                "abstract": "© 2017, Springer Science+Business Media New York.Improving the accuracy of phenotyping through the use of advanced psychometric tools will increase the power to find significant associations with genetic variants and expand the range of possible hypotheses that can be tested on a genome-wide scale. Multivariate methods, such as structural equation modeling (SEM), are valuable in the phenotypic analysis of psychiatric and substance use phenotypes, but these methods have not been integrated into standard genome-wide association analyses because fitting a SEM at each single nucleotide polymorphism (SNP) along the genome was hitherto considered to be too computationally demanding. By developing a method that can efficiently fit SEMs, it is possible to expand the set of models that can be tested. This is particularly necessary in psychiatric and behavioral genetics, where the statistical methods are often handicapped by phenotypes with large components of stochastic variance. Due to the enormous amount of data that genome-wide scans produce, the statistical methods used to analyze the data are relatively elementary and do not directly correspond with the rich theoretical development, and lack the potential to test more complex hypotheses about the measurement of, and interaction between, comorbid traits. In this paper, we present a method to test the association of a SNP with multiple phenotypes or a latent construct on a genome-wide basis using a diagonally weighted least squares (DWLS) estimator for four common SEMs: a one-factor model, a one-factor residuals model, a two-factor model, and a latent growth model. We demonstrate that the DWLS parameters and p-values strongly correspond with the more traditional full information maximum likelihood parameters and p-values. We also present the timing of simulations and power analyses and a comparison with and existing multivariate GWAS software package.",
                "authors": [
                    {
                        "name": "Verhulst B."
                    },
                    {
                        "name": "Maes H.H."
                    },
                    {
                        "name": "Neale M.C."
                    }
                ],
                "citationCount": 9,
                "date": "2017-05-01T00:00:00Z",
                "journal": "Behavior Genetics",
                "title": "GW-SEM: A Statistical Package to Conduct Genome-Wide Structural Equation Modeling"
            },
            "pmcid": "PMC5423544",
            "pmid": "28299468",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ]
}