{
    "additionDate": "2019-11-14T19:49:18Z",
    "biotoolsCURIE": "biotools:CELLmicrocosmos_tools",
    "biotoolsID": "CELLmicrocosmos_tools",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "bjorn@CELLmicrocosmos.org",
            "name": "Bjorn Sommer",
            "typeEntity": "Person"
        }
    ],
    "description": "> COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/CmPIweb (CELLMICROCOSMOS.ORG), bio.tools/cmpi (CELLMICROCOSMOS.ORG) | A Small History of Java-Based Cell and Membrane Modelling Open Source Software Development | The aim of CELLmicrocosmos is the interactive 3D stereoscopic visualization of biological cells for a better understanding of their internal structures and their functioning",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.CELLmicrocosmos.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-11-14T19:49:18Z",
    "name": "CELLmicrocosmos tools",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1515/JIB-2019-0057",
            "metadata": {
                "abstract": "For more than one decade, CELLmicrocosmos tools are being developed. Here, we discus some of the technical and administrative hurdles to keep a software suite running so many years. The tools were being developed during a number of student projects and theses, whereas main developers refactored and maintained the code over the years. The focus of this publication is laid on two Java-based Open Source Software frameworks. Firstly, the CellExplorer with the PathwayIntegration combines the mesoscopic and the functional level by mapping biological networks onto cell components using database integration. Secondly, the MembraneEditor enables users to generate membranes of different lipid and protein compositions using the PDB format. Technicalities will be discussed as well as the historical development of these tools with a special focus on group-based development. In this way, university-associated developers of Integrative Bioinformatics applications should be inspired to go similar ways. All tools discussed in this publication can be downloaded and installed from https://www.CELLmicrocosmos.org.",
                "authors": [
                    {
                        "name": "Sommer B."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-27T00:00:00Z",
                "journal": "Journal of integrative bioinformatics",
                "title": "The CELLmicrocosmos Tools: A Small History of Java-Based Cell and Membrane Modelling Open Source Software Development"
            },
            "pmcid": "PMC6798854",
            "pmid": "31560649"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        }
    ]
}