{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T09:37:59Z",
    "biotoolsCURIE": "biotools:WGDdetector",
    "biotoolsID": "WGDdetector",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yangyongzhi2008@gmail.com",
            "name": "Yongzhi Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pipeline for detecting whole genome duplication events using the genome or transcriptome annotations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yongzhiyang2012/WGDdetector",
    "language": [
        "R",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "WGDdetector",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2670-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: With the availability of well-assembled genomes of a growing number of organisms, identifying the bioinformatic basis of whole genome duplication (WGD) is a growing field of genomics. The most extant software for detecting footprints of WGDs has been restricted to a well-assembled genome. However, the massive poor quality genomes and the more accessible transcriptomes have been largely ignored, and in theoretically they are also likely to contribute to detect WGD using dS based method. Here, to resolve these problems, we have designed a universal and simple technical tool WGDdetector for detecting WGDs using either genome or transcriptome annotations in different organisms based on the widely used dS based method. Results: We have constructed WGDdetector pipeline that integrates all analyses including gene family constructing, dS estimating and phasing, and outputting the dS values of each paralogs pairs processed with only one command. We further chose four species (Arabidopsis thaliana, Juglans regia, Populus trichocarpa and Xenopus laevis) representing herb, wood and animal, to test its practicability. Our final results showed a high degree of accuracy with the previous studies using both genome and transcriptome data. Conclusion: WGDdetector is not only reliable and stable for genome data, but also a new way to using the transcriptome data to obtain the correct dS distribution for detecting WGD. The source code is freely available, and is implemented in Windows and Linux operation system.",
                "authors": [
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Lu Z."
                    }
                ],
                "citationCount": 6,
                "date": "2019-02-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WGDdetector: A pipeline for detecting whole genome duplication events using the genome or transcriptome annotations"
            },
            "pmcid": "PMC6375192",
            "pmid": "30760221",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}