{
    "additionDate": "2017-01-13T13:16:39Z",
    "biotoolsCURIE": "biotools:sr-asm",
    "biotoolsID": "sr-asm",
    "credit": [
        {
            "name": "Contact page",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bio.cs.put.poznan.pl/contact"
        }
    ],
    "description": "SR-ASM algorithm is designed for DNA assembly of the short sequences coming from 454 sequencers.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bio.cs.put.poznan.pl/files/52234c829dfb89d856000001/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://bio.cs.put.poznan.pl/programs/519227629dfb89a7fa000001",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "SR-ASM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Recently, 454 Life Sciences Corporation proposed a new biochemical approach to DNA sequencing (the 454 sequencing). It is based on the pyrosequencing protocol. The 454 sequencing aims to give reliable output at a low cost and in a short time. The produced sequences are shorter than reads produced by classical methods. Our paper proposes a new DNA assembly algorithm which deals well with such data and outperforms other assembly algorithms used in practice. The constructed SR-ASM algorithm is a heuristic method based on a graph model, the graph being a modified DNA graph proposed for DNA sequencing by hybridization procedure. Other new features of the assembly algorithm are, among others, temporary compression of input sequences, and a new and fast multiple alignment heuristics taking advantage of the way the output data for the 454 sequencing are presented and coded. The usefulness of the algorithm has been proved in tests on raw data generated during sequencing of the whole 1.84 Mbp genome of Prochlorococcus marinus bacteria and also on a part of chromosome 15 of Homo sapiens. The source code of SR-ASM can be downloaded from http://bio.cs.put.poznan.pl/ in the section 'Current research' → 'DNA Assembly'. Among publicly available assemblers our algorithm appeared to generate the best results, especially in the number of produced contigs and in the lengths of the contigs with high similarity to the genome sequence. © 2009 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Blazewicz J."
                    },
                    {
                        "name": "Bryja M."
                    },
                    {
                        "name": "Figlerowicz M."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Kasprzak M."
                    },
                    {
                        "name": "Kirton E."
                    },
                    {
                        "name": "Platt D."
                    },
                    {
                        "name": "Przybytek J."
                    },
                    {
                        "name": "Swiercz A."
                    },
                    {
                        "name": "Szajkowski L."
                    }
                ],
                "citationCount": 18,
                "date": "2009-06-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "Whole genome assembly from 454 sequencing output via modified DNA graph concept"
            },
            "pmid": "19477687"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}