{
    "additionDate": "2022-09-30T06:44:47.829452Z",
    "biotoolsCURIE": "biotools:cbtope",
    "biotoolsID": "cbtope",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/cbtope/index.php"
        }
    ],
    "description": "Conformational B cell epitope prediction",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cbtope/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/cbtope/index.php",
    "lastUpdate": "2022-09-30T06:44:56.611093Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cbtope/index.php"
        }
    ],
    "name": "cbtope",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/1745-7580-6-6",
            "metadata": {
                "abstract": "Background. One of the major challenges in the field of vaccine design is to predict conformational B-cell epitopes in an antigen. In the past, several methods have been developed for predicting conformational B-cell epitopes in an antigen from its tertiary structure. This is the first attempt in this area to predict conformational B-cell epitope in an antigen from its amino acid sequence. Results. All Support vector machine (SVM) models were trained and tested on 187 non-redundant protein chains consisting of 2261 antibody interacting residues of B-cell epitopes. Models have been developed using binary profile of pattern (BPP) and physiochemical profile of patterns (PPP) and achieved a maximum MCC of 0.22 and 0.17 respectively. In this study, for the first time SVM model has been developed using composition profile of patterns (CPP) and achieved a maximum MCC of 0.73 with accuracy 86.59%. We compare our CPP based model with existing structure based methods and observed that our sequence based model is as good as structure based methods. Conclusion. This study demonstrates that prediction of conformational B-cell epitope in an antigen is possible from is primary sequence. This study will be very useful in predicting conformational B-cell epitopes in antigens whose tertiary structures are not available. A web server CBTOPE has been developed for predicting B-cell epitope http://www.imtech.res.in/raghava/cbtope/. © 2010 Ansari and Raghava; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ansari H.R."
                    },
                    {
                        "name": "Raghava G.P."
                    }
                ],
                "citationCount": 222,
                "date": "2010-10-22T00:00:00Z",
                "journal": "Immunome Research",
                "title": "Identification of conformational B-cell Epitopes in an antigen from its primary sequence"
            },
            "pmcid": "PMC2974664",
            "pmid": "20961417"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
