{
    "additionDate": "2021-01-18T08:36:17Z",
    "biotoolsCURIE": "biotools:hylength",
    "biotoolsID": "hylength",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Elisa Pellegrino",
            "typeEntity": "Person"
        }
    ],
    "description": "A semi-automated digital image analysis tool for measuring the length of roots and fungal hyphae of dense mycelia.\n\nHyLength: a semi-automated digital image analysis pipeline to measure total fungal hyphal and root lengths.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.iit.it/EDelDottore/hylength",
    "lastUpdate": "2021-02-01T09:10:02Z",
    "name": "HyLength",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S00572-020-00956-W",
            "metadata": {
                "abstract": "© 2020, Springer-Verlag GmbH Germany, part of Springer Nature.In plant-fungus phenotyping, determining fungal hyphal and plant root lengths by digital image analysis can reduce labour and increase data reproducibility. However, the degree of software sophistication is often prohibitive and manual measuring is still used, despite being very time-consuming. We developed the HyLength tool for measuring the lengths of hyphae and roots in in vivo and in vitro systems. The HyLength was successfully validated against manual measures of roots and fungal hyphae obtained from all systems. Compared with manual methods, the HyLength underestimated Medicago sativa roots in the in vivo system and Rhizophagus irregularis hyphae in the in vitro system by about 12 cm per m and allowed to save about 1 h for a single experimental unit. As regards hyphae of R. irregularis in the in vivo system, the HyLength overestimated the length by about 21 cm per m compared with manual measures, but time saving was up to 20.5 h per single experimental unit. Finally, with hyphae of Aspergillus oryzae, the underestimation was about 8 cm per m with a time saving of about 10 min for a single germinating spore. By benchmarking the HyLength against the AnaMorf plugin of the ImageJ/Fiji, we found that the HyLength performed better for dense fungal hyphae, also strongly reducing the measuring time. The HyLength can allow measuring the length over a whole experimental unit, eliminating the error due to sub-area selection by the user and allowing processing a high number of samples. Therefore, we propose the HyLength as a useful freeware tool for measuring fungal hyphae of dense mycelia.",
                "authors": [
                    {
                        "name": "Cardini A."
                    },
                    {
                        "name": "Del Dottore E."
                    },
                    {
                        "name": "Ercoli L."
                    },
                    {
                        "name": "Gamper H.A."
                    },
                    {
                        "name": "Mazzolai B."
                    },
                    {
                        "name": "Pellegrino E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Mycorrhiza",
                "title": "HyLength: a semi-automated digital image analysis tool for measuring the length of roots and fungal hyphae of dense mycelia"
            },
            "pmid": "32300867"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
