{
    "additionDate": "2020-01-14T09:07:28Z",
    "biotoolsCURIE": "biotools:SCNBase",
    "biotoolsID": "SCNBase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "severin@iastate.edu",
            "name": "Andrew J Severin",
            "typeEntity": "Person"
        }
    ],
    "description": "a genomics portal for the soybean cyst nematode (Heterodera glycines).\n\nAll supporting analyses required for SCNBase data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://SCNBase.org",
    "lastUpdate": "2020-12-17T09:53:13Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/remkv6/SCNBase"
        }
    ],
    "name": "SCNBase",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ111",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Soybean is an important worldwide crop, and farmers continue to experience significant yield loss due to the soybean cyst nematode (SCN), Heterodera glycines. This soil-borne roundworm parasite is rated the most important pathogen problem in soybean production. The infective nematodes enter into complex interactions with their host plant by inducing the development of specialized plant feeding cells that provide the parasites with nourishment. Addressing the SCN problem will require the development of genomic resources and a global collaboration of scientists to analyze and use these resources. SCNBase.org was designed as a collaborative hub for the SCN genome. All data and analyses are downloadable and can be analyzed with three integrated genomic tools: JBrowse, Feature Search and BLAST. At the time of this writing, a number of genomic and transcriptomic data sets are already available, with 43 JBrowse tracks and 21 category pages describing SCN genomic analyses on gene predictions, transcriptome and read alignments, effector-like genes, expansion and contraction of genomic repeats, orthology and synteny with related nematode species, Single Nucleotide Polymorphism (SNPs) from 15 SCN populations and novel splice sites. Standard functional gene annotations were supplemented with orthologous gene annotations using a comparison to nine related plant-parasitic nematodes, thereby enabling functional annotations for 85% of genes. These annotations led to a greater grasp on the SCN effectorome, which include over 3324 putative effector genes. By designing SCNBase as a hub, future research findings and genomic resources can easily be uploaded and made available for use by others with minimal needs for further curation. By providing these resources to nematode research community, scientists will be empowered to develop novel, more effective SCN management tools.",
                "authors": [
                    {
                        "name": "Masonbrink R."
                    },
                    {
                        "name": "Maier T.R."
                    },
                    {
                        "name": "Seetharam A.S."
                    },
                    {
                        "name": "Juvale P.S."
                    },
                    {
                        "name": "Baber L."
                    },
                    {
                        "name": "Baum T.J."
                    },
                    {
                        "name": "Severin A.J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "SCNBase: A genomics portal for the soybean cyst nematode (Heterodera glycines)"
            },
            "pmcid": "PMC6853641",
            "pmid": "31680133"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}