{
    "name": "MetAML", 
    "description": "Computational tool for metagenomics-based prediction tasks and for quantitative assessment of the strength of potential microbiome-phenotype associations. The tool (i) is based on machine learning classifiers, (ii) includes automatic model and feature selection steps, (iii) comprises cross-validation and cross-study analysis, and (iv) uses as features quantitative microbiome profiles including species-level relative abundances and presence of strain-specific markers.\nIt provides also species-level taxonomic profiles, marker presence data, and metadata for 3000+ public available metagenomes.", 
    "homepage": "http://segatalab.cibio.unitn.it/tools/metaml/", 
    "biotoolsID": "MetAML", 
    "biotoolsCURIE": "biotools:MetAML", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3174", 
            "term": "Metagenomics"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://bitbucket.org/CibioCM/metaml/src", 
            "type": "Repository", 
            "note": null
        }, 
        {
            "url": "https://groups.google.com/forum/#!forum/metaml-users", 
            "type": "Discussion forum", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://bitbucket.org/CibioCM/metaml/wiki", 
            "type": "Tutorial", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1004977", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Machine Learning Meta-analysis of Large Metagenomic Datasets: Tools and Biological Insights", 
                "abstract": "© 2016 Pasolli et al. Shotgun metagenomic analysis of the human associated microbiome provides a rich set of microbial features for prediction and biomarker discovery in the context of human diseases and health conditions. However, the use of such high-resolution microbial features presents new challenges, and validated computational tools for learning tasks are lacking. Moreover, classification rules have scarcely been validated in independent studies, posing questions about the generality and generalization of disease-predictive models across cohorts. In this paper, we comprehensively assess approaches to metagenomics-based prediction tasks and for quantitative assessment of the strength of potential microbiome-phenotype associations. We develop a computational framework for prediction tasks using quantitative microbiome profiles, including species-level relative abundances and presence of strain-specific markers. A comprehensive meta-analysis, with particular emphasis on generalization across cohorts, was performed in a collection of 2424 publicly available metagenomic samples from eight large-scale studies. Cross-validation revealed good disease-prediction capabilities, which were in general improved by feature selection and use of strain-specific markers instead of species-level taxonomic abundance. In cross-study analysis, models transferred between studies were in some cases less accurate than models tested by within-study cross-validation. Interestingly, the addition of healthy (control) samples from other studies to training sets improved disease prediction capabilities. Some microbial species (most notably Streptococcus anginosus) seem to characterize general dysbiotic states of the microbiome rather than connections with a specific disease. Our results in modelling features of the “healthy” microbiome can be considered a first step toward defining general microbial dysbiosis. The software framework, microbiome profiles, and metadata for thousands of samples are publicly available at http://segatalab.cibio.unitn.it/tools/metaml.", 
                "date": "2016-07-01T00:00:00Z", 
                "citationCount": 49, 
                "authors": [
                    {
                        "name": "Pasolli E."
                    }, 
                    {
                        "name": "Truong D.T."
                    }, 
                    {
                        "name": "Malik F."
                    }, 
                    {
                        "name": "Waldron L."
                    }, 
                    {
                        "name": "Segata N."
                    }
                ], 
                "journal": "PLoS Computational Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "ELIXIR-ITA-UniNa", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Documentor"
            ], 
            "note": null
        }
    ], 
    "owner": "nunziodago", 
    "additionDate": "2019-02-19T12:41:00Z", 
    "lastUpdate": "2019-03-12T15:39:36Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}