{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T20:50:06.124830Z",
    "biotoolsCURIE": "biotools:nanomixhamster",
    "biotoolsID": "nanomixhamster",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Alicja Mikolajczyk"
        },
        {
            "name": "Anna Rybińska-Fryca"
        },
        {
            "name": "Filip Stoliński"
        },
        {
            "name": "Maciej Gromelski"
        },
        {
            "name": "Tomasz Puzyn"
        }
    ],
    "description": "A web-based tool for predicting cytotoxicity of TiO2-based multicomponent nanomaterials toward Chinese hamster ovary (CHO-K1) cells.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://nanomixhamster.cloud.nanosolveit.eu/",
    "lastUpdate": "2024-11-24T15:42:07.786253Z",
    "name": "NanoMixHamster",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1080/17435390.2022.2080609",
            "metadata": {
                "abstract": "Nano-QSAR models can be effectively used for prediction of the biological activity of nanomaterials that have not been experimentally tested before. However, their use is associated with the need to have appropriate knowledge and skills in chemoinformatics. Thus, they are mainly aimed at specialists in the field. This significantly limits the potential group of recipients of the developed solutions. In this perspective, the purpose of the presented research was to develop an easily accessible and user-friendly web-based application that could enable the prediction of TiO2-based multicomponent nanomaterials cytotoxicity toward Chinese Hamster Ovary (CHO-K1) cells. The graphical user interface is clear and intuitive and the only information required from the user is the type and concentration of the metals which will be modifying TiO2-based nanomaterial. Thanks to this, the application will be easy to use not only by cheminformatics but also by specialists in the field of nanotechnology or toxicology, who will be able to quickly predict cytotoxicity of desired nanoclusters. We have performed case studies to demonstrate the features and utilities of developed application. The NanoMixHamster application is freely available at https://nanomixhamster.cloud.nanosolveit.eu/.",
                "authors": [
                    {
                        "name": "Gromelski M."
                    },
                    {
                        "name": "Mikolajczyk A."
                    },
                    {
                        "name": "Puzyn T."
                    },
                    {
                        "name": "Rybinska-Fryca A."
                    },
                    {
                        "name": "Stolinski F."
                    }
                ],
                "citationCount": 4,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Nanotoxicology",
                "title": "NanoMixHamster: a web-based tool for predicting cytotoxicity of TiO2-based multicomponent nanomaterials toward Chinese hamster ovary (CHO-K1) cells"
            },
            "pmid": "35713578"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
