{
    "accessibility": "Open access",
    "additionDate": "2022-12-06T00:04:46.313647Z",
    "biotoolsCURIE": "biotools:tmbcat",
    "biotoolsID": "tmbcat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fangwf@sysucc.org.cn",
            "name": "Wenfeng Fang",
            "typeEntity": "Person"
        },
        {
            "email": "wangjiayin@mail.xjtu.edu.cn",
            "name": "Jiayin Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Li Zhang"
        },
        {
            "name": "Yang Shao"
        }
    ],
    "description": "Multi-endpoint assessment on immunotherapy benefits suggests multi-stratification thresholds for tumor mutation burden",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YixuanWang1120/JM_TMBcat",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-06T00:04:46.316297Z",
    "license": "Not licensed",
    "name": "TMBcat",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2022.995180",
            "metadata": {
                "abstract": "Copyright © 2022 Wang, Lai, Wang, Xu, Zhang, Zhu, Liu, Shao, Zhang and Fang.Tumor mutation burden (TMB) is a widely recognized stratification biomarker for predicting the efficacy of immunotherapy; however, the number and universal definition of the categorizing thresholds remain debatable due to the multifaceted nature of efficacy and the imprecision of TMB measurements. We proposed a minimal joint p-value criterion from the perspective of differentiating the comprehensive therapeutic advantages, termed TMBcat, optimized TMB categorization across distinct cancer cohorts and surpassed known benchmarks. The statistical framework applies to multidimensional endpoints and is fault-tolerant to TMB measurement errors. To explore the association between TMB and various immunotherapy outcomes, we performed a retrospective analysis on 78 patients with non-small cell lung cancer and 64 patients with nasopharyngeal carcinomas who underwent anti-PD-(L)1 therapy. The stratification results of TMBcat confirmed that the relationship between TMB and immunotherapy is non-linear, i.e., treatment gains do not inherently increase with higher TMB, and the pattern varies across carcinomas. Thus, multiple TMB classification thresholds could distinguish patient prognosis flexibly. These findings were further validated in an assembled cohort of 943 patients obtained from 11 published studies. In conclusion, our work presents a general criterion and an accessible software package; together, they enable optimal TMB subgrouping. Our study has the potential to yield innovative insights into therapeutic selection and treatment strategies for patients.",
                "authors": [
                    {
                        "name": "Fang W."
                    },
                    {
                        "name": "Lai X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Shao Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "date": "2022-09-16T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "TMBcat: A multi-endpoint p-value criterion on different discrepancy metrics for superiorly inferring tumor mutation burden thresholds"
            },
            "pmcid": "PMC9523486",
            "pmid": "36189291"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
