
{
    "credit": [
        {
            "email": "akerteszfarkas@hse.ru",
            "name": "Attila Kertész-Farkas",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/kfattila/LZW-Kernel"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Motivation: Bioinformatics studies often rely on similarity measures between sequence pairs, which often pose a bottleneck in large-scale sequence ana lysis.Results: Here, we present a new convolutional kernel function for proteinsequences called the Lempel-Ziv-Welch (LZW)-Kernel. It is based on code words identified with the LZW universal text compressor. The LZW-Kernel is an alignment-free method, it is always symmetric, is positive, always provides 1.0 for self-similarity and it can directly be used with Support Vector Machines (SVMs) in classification problems, contrary to normalized compression distance, which often violates the distance metric properties in practice and requires further techniques to be used with SVMs. The LZW-Kernel is a one-pass algorithm, which makes it particularly plausible for big data applications. Our experimental studies on remote protein homology detection and protein classification tasks reveal that the LZW-Kernel closely approaches the performance of the Local Alignment Kernel (LAK) and the SVM-pairwise method combined with Smith-Waterman (SW) scoring at a fraction of the time. Moreover, the LZW-Kernel outperforms the SVM-pairwise method when combined with Basic Local Alignment Search Tool (BLAST) scores, which indicates that the LZW code words might be a better basis for similarity measures than local alignment approximations found with BLAST. In addition, the LZW-Kernel outperforms n-gram based mismatch kernels, hidden Markov model based SAM and Fisher kernel and protein family based PSI-BLAST, among others. Further advantages include the LZW-Kernel's reliance on a simple idea, its ease of implementation, and its high speed, three times faster than BLAST and severalmagnitudes faster than SWor LAK in our tests.",
            "authors": [
                "Filatov G.",
                "Bauwens B.",
                "Kertesz-Farkas A."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty349",
            "journal": "Bioinformatics",
            "title": "LZW-Kernel: Fast kernel utilizing variable length code blocks from LZW compressors for protein sequence classification",
            "year": "2018-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lzw-kernel",
        "biotoolsID": "lzw-kernel",
        "description": "Fast kernel utilizing variable length code blocks from LZW compressors for protein sequence classification.",
        "homepage": "https://github.com/kfattila/LZW-Kernel",
        "name": "LZW-Kernel"
    }
}