{
    "additionDate": "2021-01-18T09:03:42Z",
    "biotoolsCURIE": "biotools:pathwalks",
    "biotoolsID": "pathwalks",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "georges@cing.ac.cy",
            "name": "George M Spyrou",
            "typeEntity": "Person"
        }
    ],
    "description": "PathWalks is a random walk based algorithm, developed in R, where a walker crosses a pathway-to-pathway network under the guidance of a disease-related map. The latter is a gene network that we construct by integrating multi-source information regarding a specific disease. The most frequent trajectories highlight communities of pathways that are expected to be strongly related to the disease under study.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vagkaratzas/PathWalks",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T18:26:34Z",
    "name": "PathWalks",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA291",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Understanding the underlying biological mechanisms and respective interactions of a disease remains an elusive, time consuming and costly task. Computational methodologies that propose pathway/mechanism communities and reveal respective relationships can be of great value as they can help expedite the process of identifying how perturbations in a single pathway can affect other pathways. Results: We present a random-walks-based methodology called PathWalks, where a walker crosses a pathway-to-pathway network under the guidance of a disease-related map. The latter is a gene network that we construct by integrating multi-source information regarding a specific disease. The most frequent trajectories highlight communities of pathways that are expected to be strongly related to the disease under study. We apply the PathWalks methodology on Alzheimer's disease and idiopathic pulmonary fibrosis and establish that it can highlight pathways that are also identified by other pathway analysis tools as well as are backed through bibliographic references. More importantly, PathWalks produces additional new pathways that are functionally connected with those already established, giving insight for further experimentation.",
                "authors": [
                    {
                        "name": "Bourdakou M.M."
                    },
                    {
                        "name": "Delis A."
                    },
                    {
                        "name": "Karatzas E."
                    },
                    {
                        "name": "Kolios G."
                    },
                    {
                        "name": "Minadakis G."
                    },
                    {
                        "name": "Oulas A."
                    },
                    {
                        "name": "Spyrou G.M."
                    },
                    {
                        "name": "Zachariou M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PathWalks: Identifying pathway communities using a disease-related map of integrated information"
            },
            "pmcid": "PMC7332569",
            "pmid": "32369599"
        }
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
