
{
    "credit": [
        {
            "email": "s.o.nyangoma@bham.ac.uk",
            "name": "Stephen Nyangoma",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/clippda.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/clippda_1.24.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor",
            "Proteomics"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "http://www.cancerstudies.bham.ac.uk/crctu/CLIPPDA.shtml"
        }
    ],
    "publication": [
        {
            "abstract": "In cancer clinical proteomics, MALDI and SELDI profiling are used to search for biomarkers of potentially curable early-stage disease. A given number of samples must be analysed in order to detect clinically relevant differences between cancers and controls, with adequate statistical power. From clinical proteomic profiling studies, expression data for each peak (protein or peptide) from two or more clinically defined groups of subjects are typically available. Typically, both exposure and confounder information on each subject are also available, and usually the samples are not from randomized subjects. Moreover, the data is usually available in replicate. At the design stage, however, covariates are not typically available and are often ignored in sample size calculations. This leads to the use of insufficient numbers of samples and reduced power when there are imbalances in the numbers of subjects between different phenotypic groups. A method is proposed for accommodating information on covariates, data imbalances and designcharacteristics, such as the technical replication and the observational nature of these studies, in sample size calculations. It assumes knowledge of a joint distribution for the protein expression values and the covariates. When discretized covariates are considered, the effect of the covariates enters the calculations as a function of the proportions of subjects with specific attributes. This makes it relatively straightforward (even when pilot data on subject covariates is unavailable) to specify and to adjust for the effect of the expected heterogeneities. The new method suggests certain experimental designs which lead to the use of a smaller number of samples when planning a study. Analysis of data from the proteomic profiling of colorectal cancer reveals that fewer samples are needed when a study is balanced than when it is unbalanced, and when the IMAC30 chip-type is used. The method is implemented in the clippda package and is available in R at: http://www.bioconductor.org/help/bioc-views/release/ bioc/html/clippda.html. © 2012 De Gruyter. All rights reserved.",
            "authors": [
                "Nyangoma S.O.",
                "Collins S.I.",
                "Altman D.G.",
                "Johnson P.",
                "Billingham L.J."
            ],
            "cit_count": 2,
            "doi": "10.1515/1544-6115.1686",
            "journal": "Statistical Applications in Genetics and Molecular Biology",
            "title": "Sample size calculations for designing clinical proteomic profiling studies using mass spectrometry",
            "type": "Primary",
            "year": "2012-03-07"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:clippda",
        "biotoolsID": "clippda",
        "description": "Methods for the nalysis of data from clinical proteomic profiling studies. The focus is on the studies of human subjects, which are often observational case-control by design and have technical replicates. A method for sample size determination for planning these studies is proposed. It incorporates routines for adjusting for the expected heterogeneities and imbalances in the data and the within-sample replicate correlations.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/clippda.html",
        "name": "clippda",
        "version": [
            "1.24.0"
        ]
    }
}