{
    "additionDate": "2020-01-14T09:41:42Z",
    "biotoolsCURIE": "biotools:ISIMA",
    "biotoolsID": "ISIMA",
    "confidence_flag": "tool",
    "description": "Hep G2 cell culture confluence measurement in phase-contrast micrographs.\n\nPhase-contrast micrographs are often used for confirmation of proliferation and viability assays. However, they are usually only a qualitative tool and fail to exclude with certainty the presence of assay interference by test substances. The complexity of image analysis workflows hinders life scientists from routinely utilizing micrograph data. Here, we present an open-source software-based, combined ilastik segmentation ImageJ measurement of area (ISIMA) approach for cell monolayer segmentation and confluence percentage measurement of phase-contrast micrographs of Hep G2 cells. The aim of this study is to test whether the proposed approach is suitable for quantitative confirmation of proliferation data, acquired by the 3-(4,5-Dimethyl-2-thiazolyl)-2,5-diphenyl-2H-tetrazolium bromide (MTT) assay.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.ilastik.org/download.html",
    "lastUpdate": "2020-12-14T13:30:29Z",
    "name": "ISIMA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/15376516.2019.1695303",
            "metadata": {
                "abstract": "© 2019, © 2019 Informa UK Limited, trading as Taylor & Francis Group.Phase-contrast micrographs are often used for confirmation of proliferation and viability assays. However, they are usually only a qualitative tool and fail to exclude with certainty the presence of assay interference by test substances. The complexity of image analysis workflows hinders life scientists from routinely utilizing micrograph data. Here, we present an open-source software-based, combined ilastik segmentation/ImageJ measurement of area (ISIMA) approach for cell monolayer segmentation and confluence percentage measurement of phase-contrast micrographs of Hep G2 cells. The aim of this study is to test whether the proposed approach is suitable for quantitative confirmation of proliferation data, acquired by the 3-(4,5-Dimethyl-2-thiazolyl)-2,5-diphenyl-2H-tetrazolium bromide (MTT) assay. Our results show that ISIMA is user-friendly and provides reproducible data, which strongly correlates to the results of the MTT assay. In conclusion, ISIMA is an affordable, simple, and fast approach for confluence quantification by researchers without image analysis background.",
                "authors": [
                    {
                        "name": "Yordanov Y.I."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-12T00:00:00Z",
                "journal": "Toxicology Mechanisms and Methods",
                "title": "Hep G2 cell culture confluence measurement in phase-contrast micrographs–a user-friendly, open-source software-based approach"
            },
            "pmid": "31736404"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}