
{
    "credit": [
        {
            "email": "nchchung@gmail.com",
            "name": "Neo Christopher Chung",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://genomics.princeton.edu/storeylab/"
        }
    ],
    "documentation": [
        {
            "url": "https://cran.r-project.org/web/packages/jackstraw/jackstraw.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/jackstraw-1-0-non-parametric-jackstraw-for-principal-component-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 The Author. Motivation: There are a number of well-established methods such as principal component analysis (PCA) for automatically capturing systematic variation due to latent variables in large-scale genomic data. PCA and related methods may directly provide a quantitative characterization of a complex biological variable that is otherwise difficult to precisely define or model. An unsolved problem in this context is how to systematically identify the genomic variables that are drivers of systematic variation captured by PCA. Principal components (PCs) (and other estimates of systematic variation) are directly constructed from the genomic variables themselves, making measures of statistical significance artificially inflated when using conventional methods due to over-fitting. Results: We introduce a new approach called the jackstraw that allows one to accurately identify genomic variables that are statistically significantly associated with any subset or linear combination of PCs. The proposed method can greatly simplify complex significance testing problems encountered in genomics and can be used to identify the genomic variables significantly associated with latent variables. Using simulation, we demonstrate that our method attains accurate measures of statistical significance over a range of relevant scenarios. We consider yeast cell-cycle gene expression data, and show that the proposed method can be used to straightforwardly identify genes that are cell-cycle regulated with an accurate measure of statistical significance. We also analyze gene expression data from post-trauma patients, allowing the gene expression data to provide a molecularly driven phenotype. Using our method, we find a greater enrichment for inflammatory-related gene sets compared to the original analysis that uses a clinically defined, although likely imprecise, phenotype. The proposed method provides a useful bridge between large-scale quantifications of systematic variation and gene-level significance analyses.",
            "authors": [
                "Chung N.C.",
                "Storey J.D."
            ],
            "cit_count": 34,
            "journal": "Bioinformatics",
            "pmid": "25336500",
            "title": "Statistical significance of variables driving systematic variation in high-dimensional data",
            "year": "2015-02-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jackstraw",
        "biotoolsID": "jackstraw",
        "description": "New approach that allows one to accurately identify genomic variables that are statistically significantly associated with any subset or linear combination of principal components (PCs).",
        "homepage": "http://cran.r-project.org/web/packages/jackstraw/index.html",
        "name": "jackstraw",
        "version": [
            "1.1.1"
        ]
    }
}