{"credit":[{"email":"h.klein@uni-muenster.de","name":"Hans-Ulrich Klein","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/epigenomix.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/epigenomix_1.14.0.tar.gz"}],"function":[{"operation":[{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"},{"term":"RNA-Seq analysis","uri":"http://edamontology.org/operation_3680"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Epigenetics","uri":"http://edamontology.org/topic_3295"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"}]},"publication":[{"abstract":"Motivation: Histone modifications are a key epigenetic mechanism to activate or repress the transcription of genes. Datasets of matched transcription data and histone modification data obtained by ChIP-seq exist, but methods for integrative analysis of both data types are still rare. Here, we present a novel bioinformatics approach to detect genes that show different transcript abundances between two conditions putatively caused by alterations in histone modification. Results: We introduce a correlation measure for integrative analysis of ChIP-seq and gene transcription data measured by RNA sequencing or microarrays and demonstrate that a proper normalization of ChIPseq data is crucial. We suggest applying Bayesian mixture models of different types of distributions to further study the distribution of the correlation measure. The implicit classification of the mixturemodels is used to detect genes with differences between two conditions in both gene transcription and histone modification. The method is applied to different datasets, and its superiority to a naive separate analysis of both data types is demonstrated. © 2014 The Author.","authors":["Klein H.-U.","Schafer M.","Porse B.T.","Hasemann M.S.","Ickstadt K.","Dugas M."],"cit_count":14,"doi":"10.1093/bioinformatics/btu003","journal":"Bioinformatics","pmid":"24403540","title":"Integrative analysis of histone ChIP-seq and transcription data using Bayesian mixture models","type":"Primary","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:epigenomix","biotoolsID":"epigenomix","description":"A package for the integrative analysis of RNA-seq or microarray based gene transcription and histone modification data obtained by ChIP-seq. The package provides methods for data preprocessing and matching as well as methods for fitting bayesian mixture models in order to detect genes with differences in both data types.","homepage":"http://bioconductor.org/packages/release/bioc/html/epigenomix.html","name":"epigenomix","version":["1.14.0"]}}