{
    "additionDate": "2017-08-03T19:08:00Z",
    "biotoolsCURIE": "biotools:protr",
    "biotoolsID": "protr",
    "credit": [
        {
            "email": "me@nanx.me",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cbdd.csu.edu.cn/"
        }
    ],
    "description": "Comprehensive R package for generating various numerical representation schemes of proteins and peptides from amino acid sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/protr/protr.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://cran.r-project.org/web/packages/protr/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/protr-0-5-1-protrweb-generating-various-numerical-representation-schemes-of-protein-sequence.html"
        }
    ],
    "name": "protr",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "nanx",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Summary: Amino acid sequence-derived structural and physiochemical descriptors are extensively utilized for the research of structural, functional, expression and interaction profiles of proteins and peptides. We developed protr, a comprehensive R package for generating various numerical representation schemes of proteins and peptides from amino acid sequence. The package calculates eight descriptor groups composed of 22 types of commonly used descriptors that include about 22 700 descriptor values. It allows users to select amino acid properties from the AAindex database, and use self-defined properties to construct customized descriptors. For proteochemometric modeling, it calculates six types of scales-based descriptors derived by various dimensionality reduction methods. The protr package also integrates the functionality of similarity score computation derived by protein sequence alignment and Gene Ontology semantic similarity measures within a list of proteins, and calculates profile-based protein features based on position-specific scoring matrix. We also developed ProtrWeb, a user-friendly web server for calculating descriptors presented in the protr package. Availability and implementation: The protr package is freely available from CRAN: http://cran. r-project.org/package=protr, ProtrWeb, is freely available at http://protrweb.scbdd.com/.",
                "authors": [
                    {
                        "name": "Cao D.-S."
                    },
                    {
                        "name": "Xiao N."
                    },
                    {
                        "name": "Xu Q.-S."
                    },
                    {
                        "name": "Zhu M.-F."
                    }
                ],
                "citationCount": 109,
                "date": "2015-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Protr/ProtrWeb: R package and web server for generating various numerical representation schemes of protein sequences"
            },
            "pmid": "25619996"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
