{
    "additionDate": "2021-01-18T07:38:26Z",
    "biotoolsCURIE": "biotools:hamap_sparql",
    "biotoolsID": "hamap_sparql",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jerven.bolleman@sib.swiss",
            "name": "Jerven Bolleman",
            "orcidid": "https://orcid.org/0000-0002-7449-1266",
            "typeEntity": "Person"
        }
    ],
    "description": "Portable annotation pipeline for genomes and proteomes.\n\nHAMAP is a system for the classification and annotation of protein sequences. It consists of a collection of expert-curated protein family signatures and rules that specify annotations that apply to family members. HAMAP was originally developed by the Swiss-Prot group to help curators annotate UniProtKB/Swiss-Prot records and was subsequently made available to external users via the HAMAP-Scan web service. HAMAP signatures are also integrated into InterPro and the HAMAP rules into UniRule, the core part of the UniProt automatic annotation pipeline.",
    "download": [
        {
            "type": "Binaries",
            "url": "ftp://ftp.expasy.org/databases/hamap/sparql/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "homepage": "https://hamap.expasy.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-30T10:46:26Z",
    "license": "CC0-1.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sib-swiss/HAMAP-SPARQL"
        }
    ],
    "name": "HAMAP_SPARQL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAA003",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Background: Genome and proteome annotation pipelines are generally custom built and not easily reusable by other groups. This leads to duplication of effort, increased costs, and suboptimal annotation quality. One way to address these issues is to encourage the adoption of annotation standards and technological solutions that enable the sharing of biological knowledge and tools for genome and proteome annotation. Results: Here we demonstrate one approach to generate portable genome and proteome annotation pipelines that users can run without recourse to custom software. This proof of concept uses our own rule-based annotation pipeline HAMAP, which provides functional annotation for protein sequences to the same depth and quality as UniProtKB/Swiss-Prot, and the World Wide Web Consortium (W3C) standards Resource Description Framework (RDF) and SPARQL (a recursive acronym for the SPARQL Protocol and RDF Query Language). We translate complex HAMAP rules into the W3C standard SPARQL 1.1 syntax, and then apply them to protein sequences in RDF format using freely available SPARQL engines. This approach supports the generation of annotation that is identical to that generated by our own in-house pipeline, using standard, off-the-shelf solutions, and is applicable to any genome or proteome annotation pipeline. Conclusions: HAMAP SPARQL rules are freely available for download from the HAMAP FTP site, ftp://ftp.expasy.org/databases/hamap/sparql/, under the CC-BY-ND 4.0 license. The annotations generated by the rules are under the CC-BY 4.0 license. A tutorial and supplementary code to use HAMAP as SPARQL are available on GitHub at https://github.com/sib-swiss/HAMAP-SPARQL, and general documentation about HAMAP can be found on the HAMAP website at https://hamap.expasy.org.",
                "authors": [
                    {
                        "name": "Auchincloss A.H."
                    },
                    {
                        "name": "Baratin D."
                    },
                    {
                        "name": "Bolleman J."
                    },
                    {
                        "name": "Bridge A."
                    },
                    {
                        "name": "Coudert E."
                    },
                    {
                        "name": "Cuche B.A."
                    },
                    {
                        "name": "Gehant S."
                    },
                    {
                        "name": "Hulo C."
                    },
                    {
                        "name": "Masson P."
                    },
                    {
                        "name": "Pedruzzi I."
                    },
                    {
                        "name": "Redaschi N."
                    },
                    {
                        "name": "Rivoire C."
                    },
                    {
                        "name": "Xenarios I."
                    },
                    {
                        "name": "de Castro E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "HAMAP as SPARQL rules—A portable annotation pipeline for genomes and proteomes"
            },
            "pmcid": "PMC7007698",
            "pmid": "32034905"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
