{
    "additionDate": "2020-04-10T21:08:36Z",
    "biotoolsCURIE": "biotools:network_analysis_provider",
    "biotoolsID": "network_analysis_provider",
    "credit": [
        {
            "name": "Georgios Pavlopoulos",
            "orcidid": "https://orcid.org/0000-0002-4577-8276"
        },
        {
            "name": "Theodosis Theodosiou"
        },
        {
            "name": "Mikaela Koutrouli"
        }
    ],
    "description": "NAP is a network analysis tool and offers:\n1) Exploration of a network's  topological features\n2) Ranking nodes/edge by topological properties\n3) Simultaneous comparison of topological features between different networks\n4) Basic network visualization",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bib.fleming.gr:3838/NAP/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-04-10T21:10:05Z",
    "maturity": "Mature",
    "name": "NAP",
    "owner": "g.pavlopoulos",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2017 The Author(s).Objective: Nowadays, due to the technological advances of high-throughput techniques, Systems Biology has seen a tremendous growth of data generation. With network analysis, looking at biological systems at a higher level in order to better understand a system, its topology and the relationships between its components is of a great importance. Gene expression, signal transduction, protein/chemical interactions, biomedical literature co-occurrences, are few of the examples captured in biological network representations where nodes represent certain bioentities and edges represent the connections between them. Today, many tools for network visualization and analysis are available. Nevertheless, most of them are standalone applications that often (i) burden users with computing and calculation time depending on the network's size and (ii) focus on handling, editing and exploring a network interactively. While such functionality is of great importance, limited efforts have been made towards the comparison of the topological analysis of multiple networks. Results: Network Analysis Provider (NAP) is a comprehensive web tool to automate network profiling and intra/inter-network topology comparison. It is designed to bridge the gap between network analysis, statistics, graph theory and partially visualization in a user-friendly way. It is freely available and aims to become a very appealing tool for the broader community. It hosts a great plethora of topological analysis methods such as node and edge rankings. Few of its powerful characteristics are: its ability to enable easy profile comparisons across multiple networks, find their intersection and provide users with simplified, high quality plots of any of the offered topological characteristics against any other within the same network. It is written in R and Shiny, it is based on the igraph library and it is able to handle medium-scale weighted/unweighted, directed/undirected and bipartite graphs. NAP is available at http://bioinformatics.med.uoc.gr/NAP.",
                "authors": [
                    {
                        "name": "Theodosiou T."
                    },
                    {
                        "name": "Efstathiou G."
                    },
                    {
                        "name": "Papanikolaou N."
                    },
                    {
                        "name": "Kyrpides N.C."
                    },
                    {
                        "name": "Bagos P.G."
                    },
                    {
                        "name": "Iliopoulos I."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    }
                ],
                "citationCount": 12,
                "date": "2017-07-14T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "NAP: The Network Analysis Profiler, a web tool for easier topological analysis and comparison of medium-scale biological networks"
            },
            "pmcid": "PMC5513407",
            "pmid": "28705239"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}