{"credit":[],"function":[{"operation":[{"term":"Read mapping","uri":"http://edamontology.org/operation_3198"},{"term":"Primer and probe design","uri":"http://edamontology.org/operation_2419"},{"term":"Microarray probe design","uri":"http://edamontology.org/operation_0309"},{"term":"Nucleic acid thermodynamic property calculation","uri":"http://edamontology.org/operation_0455"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"ChIP-on-chip","uri":"http://edamontology.org/topic_3179"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"chipD is a web server that facilitates design of DNA oligonucleotide probes for high-density tiling arrays, which can be used in a number of genomic applications such as ChIP-chip or gene-expression profiling. The server implements a probe selection algorithm that takes as an input, in addition to the target sequences, a set of parameters that allow probe design to be tailored to specific applications, protocols or the array manufacturer's requirements. The algorithm optimizes probes to meet three objectives: (i) probes should be specific; (ii) probes should have similar thermodynamic properties; and (iii) the target sequence coverage should be homogeneous and avoid significant gaps. The output provides in a text format, the list of probe sequences with their genomic locations, targeted strands and hybridization characteristics. chipD has been used successfully to design tiling arrays for bacteria and yeast. chipD is available at http://chipd.uwbacter.org/. © The Author(s) 2010. Published by Oxford University Press.","authors":["Dufour Y.S.","Wesenberg G.E.","Tritt A.J.","Glasner J.D.","Perna N.T.","Mitchell J.C.","Donohue T.J."],"cit_count":20,"journal":"Nucleic Acids Research","pmid":"20529880","title":"chipD: A web tool to design oligonucleotide probes for high-density tiling arrays","year":"2010-06-05"}],"summary":{"biotoolsCURIE":"biotools:chipd","biotoolsID":"chipd","description":"Web server that facilitates the design of DNA oligonucleotide probes for high-density tiling arrays. The algorithm ensures probe specificity, thermodynamic properties amongst probe sets and target sequence coverage.","homepage":"http://chipd.uwbacter.org","name":"chipD"}}