{
    "additionDate": "2021-01-18T11:37:42Z",
    "biotoolsCURIE": "biotools:fijiyama",
    "biotoolsID": "fijiyama",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "romainfernandez06@gmail.com",
            "name": "Romain Fernandez",
            "typeEntity": "Person"
        }
    ],
    "description": "The plugin Fijiyama (Yet Another Matching and Alignment tool for Fiji) is a generic tool for registration and alignment of 3D image series collected from various imaging modalities (MRI, X-rays, Microscopy, Photography, etc.).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://imagej.github.io/Fijiyama",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-11T08:54:46Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://doi.org/10.5281/zenodo.3695736"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Rocsg/Fijiyama/"
        }
    ],
    "name": "Fijiyama",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA846",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.SUMMARY: The increasing interest of animal and plant research communities for biomedical 3D imaging devices results in the emergence of new topics. The anatomy, structure and function of tissues can be observed non-destructively in time-lapse multimodal imaging experiments by combining the outputs of imaging devices such as X-ray CT and MRI scans. However, living samples cannot remain in these devices for a long period. Manual positioning and natural growth of the living samples induce variations in the shape, position and orientation in the acquired images that require a preprocessing step of 3D registration prior to analyses. This registration step becomes more complex when combining observations from devices that highlight various tissue structures. Identifying image invariants over modalities is challenging and can result in intractable problems. Fijiyama, a Fiji plugin built upon biomedical registration algorithms, is aimed at non-specialists to facilitate automatic alignment of 3D images acquired either at successive times and/or with different imaging systems. Its versatility was assessed on four case studies combining multimodal and time series data, spanning from micro to macro scales. AVAILABILITY AND IMPLEMENTATION: Fijiyama is an open source software (GPL license) implemented in Java. The plugin is available through the official Fiji release. An extensive documentation is available at the official page: https://imagej.github.io/Fijiyama. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Fernandez R."
                    },
                    {
                        "name": "Moisy C."
                    }
                ],
                "citationCount": 2,
                "date": "2021-06-16T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Fijiyama: a registration tool for 3D multimodal time-lapse imaging"
            },
            "pmid": "32997734"
        }
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
