{
    "additionDate": "2021-01-18T10:06:46Z",
    "biotoolsCURIE": "biotools:bridging-age-gap",
    "biotoolsID": "bridging-age-gap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "geoff.r.holmes@sheffield.ac.uk",
            "name": "G. R. Holmes",
            "typeEntity": "Person"
        }
    ],
    "description": "Bridging Age Gap is a prognostic model that predicts survival and aids in primary treatment decisions for older women with oestrogen receptor-positive early breast cancer. A tool designed to allow for the comparison of breast cancer treatments for older women. The treatments considered within this tool are surgery, primary endocrine therapy and chemotherapy. This tool is designed for use by clinicians with appropriate knowledge of breast cancer and the two types of treatment that are addressed here.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://agegap.shef.ac.uk/",
    "lastUpdate": "2021-02-06T19:59:53Z",
    "name": "Bridging Age Gap",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/BJS.11748",
            "metadata": {
                "abstract": "© 2020 The Authors. British Journal of Surgery published by John Wiley & Sons Ltd on behalf of BJS Society Ltd.Background: A prognostic model was developed and validated using cancer registry data. This underpins an online decision support tool, informing primary treatment choice for women aged 70 years or older with hormone receptor-positive early breast cancer. Methods: Data from women diagnosed between 2002 and 2010 in the English Northern and Yorkshire and West Midlands regions were used to develop the model. Primary treatment options of surgery with adjuvant endocrine therapy or primary endocrine therapy were compared. Models predicting the hazard of breast cancer-specific mortality and hazard of other-cause mortality were combined to derive survival probabilities. The model was validated externally using data from the Eastern Cancer Registration and Information Centre. Results: The model was developed using data from 23 842 women, and validated externally on a data set from 14 526 patients. The overall model calibration was good. At 2 and 5 years, predicted mortality from breast cancer and other causes differed from the observed rate by less than 1 per cent. At 5 years, there were slight overpredictions in breast cancer mortality (2629 predicted versus 2556 observed deaths; P = 0·142) and mortality from all causes (6399 versus 6320 respectively; P = 0·583). The discrepancy varied between subgroups. Model discrimination was 0·75 or above for all mortality measures. Conclusion: A prognostic model for older women with oestrogen receptor-positive early breast cancer was developed and validated in the present study. This forms a basis for an online decision support tool (https://agegap.shef.ac.uk/).",
                "authors": [
                    {
                        "name": "Broggio J.W."
                    },
                    {
                        "name": "Collins K."
                    },
                    {
                        "name": "Holmes G.R."
                    },
                    {
                        "name": "Morgan J.L."
                    },
                    {
                        "name": "Reed M.W.R."
                    },
                    {
                        "name": "Richards P.D."
                    },
                    {
                        "name": "Ward S.E."
                    },
                    {
                        "name": "Wyld L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-01T00:00:00Z",
                "journal": "British Journal of Surgery",
                "title": "Bridging the Age Gap: a prognostic model that predicts survival and aids in primary treatment decisions for older women with oestrogen receptor-positive early breast cancer"
            },
            "pmid": "32602959"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
