{
    "additionDate": "2018-03-04T17:35:00Z",
    "biotoolsCURIE": "biotools:picnic",
    "biotoolsID": "picnic",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "antoniotti@disco.unimib.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An effective pipeline to extract ensemble-level cancer progression models from cross-sectional data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/troncopackage/picnic",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "maturity": "Mature",
    "name": "PicNiC",
    "owner": "ELIXIR-ITA-BICOCCA",
    "publication": [
        {
            "doi": "10.1073/pnas.1520213113",
            "metadata": {
                "abstract": "© 2016, National Academy of Sciences. All rights reserved.The genomic evolution inherent to cancer relates directly to a renewed focus on the voluminous next-generation sequencing data and machine learning for the inference of explanatory models of how the (epi)genomic events are choreographed in cancer initiation and development. However, despite the increasing availability of multiple additional -omics data, this quest has been frustrated by various theoretical and technical hurdles, mostly stemming from the dramatic heterogeneity of the disease. In this paper, we build on our recent work on the \"selective advantage\" relation among driver mutations in cancer progression and investigate its applicability to the modeling problem at the population level. Here, we introduce PiCnIc (Pipeline for Cancer Inference), a versatile, modular, and customizable pipeline to extract ensemble-level progression models from cross-sectional sequenced cancer genomes. The pipeline has many translational implications because it combines state-of-the-art techniques for sample stratification, driver selection, identification of fitness-equivalent exclusive alterations, and progression model inference. We demonstrate PiCnIc's ability to reproduce much of the current knowledge on colorectal cancer progression as well as to suggest novel experimentally verifiable hypotheses.",
                "authors": [
                    {
                        "name": "Caravagna G."
                    },
                    {
                        "name": "Graudenzi A."
                    },
                    {
                        "name": "Ramazzotti D."
                    },
                    {
                        "name": "Sanz-Pamplona R."
                    },
                    {
                        "name": "De Sano L."
                    },
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Moreno V."
                    },
                    {
                        "name": "Antoniotti M."
                    },
                    {
                        "name": "Mishra B."
                    }
                ],
                "citationCount": 38,
                "date": "2016-07-12T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Algorithmic methods to infer the evolutionary trajectories in cancer progression"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}