{
    "additionDate": "2018-05-12T10:21:27Z",
    "biotoolsCURIE": "biotools:itar",
    "biotoolsID": "itar",
    "credit": [
        {
            "email": "chao.cheng@dartmouth.edu",
            "name": "Chao Cheng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server for identifying target genes of transcription factors using ChIP-seq or ChIP-chip data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://syslab3.nchu.edu.tw/iTAR/Tutorial.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://syslab3.nchu.edu.tw/iTAR/",
    "homepage_status": 1,
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "iTAR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-016-2963-0",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Chromatin immunoprecipitation followed by massively parallel DNA sequencing (ChIP-seq) or microarray hybridization (ChIP-chip) has been widely used to determine the genomic occupation of transcription factors (TFs). We have previously developed a probabilistic method, called TIP (Target Identification from Profiles), to identify TF target genes using ChIP-seq/ChIP-chip data. To achieve high specificity, TIP applies a conservative method to estimate significance of target genes, with the trade-off being a relatively low sensitivity of target gene identification compared to other methods. Additionally, TIP's output does not render binding-peak locations or intensity, information highly useful for visualization and general experimental biological use, while the variability of ChIP-seq/ChIP-chip file formats has made input into TIP more difficult than desired. Description: To improve upon these facets, here we present are fined TIP with key extensions. First, it implements a Gaussian mixture model for p-value estimation, increasing target gene identification sensitivity and more accurately capturing the shape of TF binding profile distributions. Second, it enables the incorporation of TF binding-peak data by identifying their locations in significant target gene promoter regions and quantifies their strengths. Finally, for full ease of implementation we have incorporated it into a web server (http://syslab3.nchu.edu.tw/iTAR/) that enables flexibility of input file format, can be used across multiple species and genome assembly versions, and is freely available for public use. The web server additionally performs GO enrichment analysis for the identified target genes to reveal the potential function of the corresponding TF. Conclusions: The iTAR web server provides a user-friendly interface and supports target gene identification in seven species, ranging from yeast to human. To facilitate investigating the quality of ChIP-seq/ChIP-chip data, the web server generates the chart of the characteristic binding profiles and the density plot of normalized regulatory scores. The iTAR web server is a useful tool in identifying TF target genes from ChIP-seq/ChIP-chip data and discovering biological insights.",
                "authors": [
                    {
                        "name": "Yang C.-C."
                    },
                    {
                        "name": "Andrews E.H."
                    },
                    {
                        "name": "Chen M.-H."
                    },
                    {
                        "name": "Wang W.-Y."
                    },
                    {
                        "name": "Chen J.J.W."
                    },
                    {
                        "name": "Gerstein M."
                    },
                    {
                        "name": "Liu C.-C."
                    },
                    {
                        "name": "Cheng C."
                    }
                ],
                "citationCount": 1,
                "date": "2016-08-12T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "iTAR: A web server for identifying target genes of transcription factors using ChIP-seq or ChIP-chip data"
            },
            "pmcid": "PMC4983039",
            "pmid": "27519564"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}