{
    "additionDate": "2017-09-19T09:25:19Z",
    "biotoolsCURIE": "biotools:microtss",
    "biotoolsID": "microtss",
    "credit": [
        {
            "email": "artemis.hatzigeorgiou@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.microrna.gr"
        }
    ],
    "description": "microTSS is a machine-learning algorithm that provides highly accurate, single-nucleotide resolution predictions for intergenic miRNA transcription start sites (TSSs). MicroTSS integrates high-resolution RNA-sequencing data with active transcription marks derived from chromatin immunoprecipitation and DNase-sequencing to enable the characterization of tissue-specific promoters",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "homepage": "http://www.microrna.gr/microTSS",
    "lastUpdate": "2019-03-12T15:33:18Z",
    "name": "microTSS",
    "owner": "dianalab",
    "publication": [
        {
            "doi": "10.1038/ncomms6700",
            "metadata": {
                "abstract": "© 2014 Macmillan Publishers Limited. All rights reserved.A large fraction of microRNAs (miRNAs) are derived from intergenic non-coding loci and the identification of their promoters remains 'elusive'. Here, we present microTSS, a machine-learning algorithm that provides highly accurate, single-nucleotide resolution predictions for intergenic miRNA transcription start sites (TSSs). MicroTSS integrates high-resolution RNA-sequencing data with active transcription marks derived from chromatin immunoprecipitation and DNase-sequencing to enable the characterization of tissue-specific promoters. MicroTSS is validated with a specifically designed Drosha-null/conditional-null mouse model, generated using the conditional by inversion (COIN) methodology. Analyses of global run-on sequencing data revealed numerous pri-miRNAs in human and mouse either originating from divergent transcription at promoters of active genes or partially overlapping with annotated long non-coding RNAs. MicroTSS is readily applicable to any cell or tissue samples and constitutes the missing part towards integrating the regulation of miRNA transcription into the modelling of tissue-specific regulatory networks.",
                "authors": [
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Vlachos I.S."
                    },
                    {
                        "name": "Paraskevopoulou M.D."
                    },
                    {
                        "name": "Yang P."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Economides A.N."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 36,
                "date": "2014-12-10T00:00:00Z",
                "journal": "Nature Communications",
                "title": "microTSS: Accurate microRNA transcription start site identification reveals a significant number of divergent pri-miRNAs"
            },
            "pmid": "25492647"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}