{
    "additionDate": "2019-11-14T19:57:02Z",
    "biotoolsCURIE": "biotools:QuartetScores",
    "biotoolsID": "QuartetScores",
    "confidence_flag": "tool",
    "description": "Quartet-based computations of internode certainty provide robust measures of phylogenetic incongruence | Code for computing various support scores for internodes | See http://www.biorxiv.org/content/early/2017/07/27/168526 for the preprint | If you cannot find our supplementary text, please download it from here: https://github.com/lutteropp/QuartetScores/issues/4",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                },
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lutteropp/QuartetScores",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-11T15:07:58Z",
    "license": "GPL-3.0",
    "name": "QuartetScores",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/SYSBIO/SYZ058",
            "metadata": {
                "abstract": "© 2019 The Author(s). All rights reserved.Incongruence, or topological conflict, is prevalent in genome-scale data sets. Internode certainty (IC) and related measures were recently introduced to explicitly quantify the level of incongruence of a given internal branch among a set of phylogenetic trees and complement regular branch support measures (e.g., bootstrap, posterior probability) that instead assess the statistical confidence of inference. Since most phylogenomic studies contain data partitions (e.g., genes) with missing taxa and IC scores stem from the frequencies of bipartitions (or splits) on a set of trees, IC score calculation typically requires adjusting the frequencies of bipartitions from these partial gene trees. However, when the proportion of missing taxa is high, the scores yielded by current approaches that adjust bipartition frequencies in partial gene trees differ substantially from each other and tend to be overestimates. To overcome these issues, we developed three new IC measures based on the frequencies of quartets, which naturally apply to both complete and partial trees. Comparison of our new quartet-based measures to previous bipartition-based measures on simulated data shows that: (1) on complete data sets, both quartet-based and bipartition-based measures yield very similar IC scores; (2) IC scores of quartet-based measures on a given data set with and without missing taxa are more similar than the scores of bipartition-based measures; and (3) quartet-based measures are more robust to the absence of phylogenetic signal and errors in phylogenetic inference than bipartition-based measures. Additionally, the analysis of an empirical mammalian phylogenomic data set using our quartet-based measures reveals the presence of substantial levels of incongruence for numerous internal branches. An efficient open-source implementation of these quartet-based measures is freely available in the program QuartetScores (https://github.com/lutteropp/QuartetScores).",
                "authors": [
                    {
                        "name": "Czech L."
                    },
                    {
                        "name": "Looz M.V."
                    },
                    {
                        "name": "Lutteropp S."
                    },
                    {
                        "name": "Rokas A."
                    },
                    {
                        "name": "Stamatakis A."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "citationCount": 10,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "Quartet-Based Computations of Internode Certainty Provide Robust Measures of Phylogenetic Incongruence"
            },
            "pmid": "31504977"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ],
    "validated": 1
}
