{
    "additionDate": "2021-03-19T09:16:10Z",
    "biotoolsCURIE": "biotools:deepncca",
    "biotoolsID": "deepncca",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michael.platten@ki.se",
            "name": "Michael Platten",
            "orcidid": "https://orcid.org/0000-0001-6297-487X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DeepnCCA is a tool for deep learning corpus callosum segmentation as a neurodegenerative marker in multiple sclerosis. The tool extracts the intracranial and corpus callosum area as a biomarker, normalized corpus callosum, for neurodegeneration in multiple sclerosis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/plattenmichael/DeepnCCA/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-27T19:01:53Z",
    "name": "DeepnCCA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/JON.12838",
            "metadata": {
                "abstract": "© 2021 The Authors. Journal of Neuroimaging published by Wiley Periodicals LLC on behalf of American Society of NeuroimagingBackground and Purpose: Corpus callosum atrophy is a sensitive biomarker of multiple sclerosis (MS) neurodegeneration but typically requires manual 2D or volumetric 3D-based segmentations. We developed a supervised machine learning algorithm, DeepnCCA, for corpus callosum segmentation and relate callosal morphology to clinical disability using conventional MRI scans collected in clinical routine. Methods: In a prospective study of 553 MS patients with 704 acquisitions, 200 unique 2D T2-weighted MRI scans were delineated to develop, train, and validate DeepnCCA. Comparative FreeSurfer segmentations were obtained in 504 3D T1-weighted scans. Both FreeSurfer and DeepnCCA outputs were correlated with clinical disability. Using principal component analysis of the DeepnCCA output, the morphological changes were explored in relation to clinical disease burden. Results: DeepnCCA and manual segmentations had high similarity (Dice coefficients 98.1 (Formula presented.).11%, 89.3 (Formula presented.).76%, for intracranial and corpus callosum area, respectively through 10-fold cross-validation). DeepnCCA had numerically stronger correlations with cognitive and physical disability as compared to FreeSurfer: Expanded disability status scale (EDSS) ±6 months (r = –.22 P =.002; r = –.17, P =.013), future EDSS (r = –.26, P<.001; r = –.17, P =.012), and future symbol digit modalities test (r =.26, P =.001; r =.24, P =.003). The corpus callosum became thinner with increasing cognitive and physical disability. Increasing physical disability, additionally, significantly correlated with a more angled corpus callosum. Conclusions: DeepnCCA (https://github.com/plattenmichael/DeepnCCA/) is an openly available tool that can provide fast and accurate corpus callosum measurements applicable to large MS cohorts, potentially suitable for monitoring disease progression and therapy response.",
                "authors": [
                    {
                        "name": "Platten M."
                    },
                    {
                        "name": "Brusini I."
                    },
                    {
                        "name": "Andersson O."
                    },
                    {
                        "name": "Ouellette R."
                    },
                    {
                        "name": "Piehl F."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Granberg T."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Journal of Neuroimaging",
                "title": "Deep Learning Corpus Callosum Segmentation as a Neurodegenerative Marker in Multiple Sclerosis"
            },
            "pmid": "33587820"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}