{
    "accessibility": "Open access",
    "additionDate": "2020-01-09T18:04:16Z",
    "biotoolsCURIE": "biotools:DeepScreening",
    "biotoolsID": "DeepScreening",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xielw@gdim.cn",
            "name": "Liwei Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning-based screening web server for accelerating drug discovery.\nDeepScreening is a useful platform to help drug researchers do virtual screening conveniently and fast through deep learning.\nDeepScreening is a user-friendly web server for constructing deep learning models using public dataset or user provided dataset, which would help biologist and chemist virtual screening the chemical probes or drugs for a specific target of interest.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "http://deepscreening.xielab.net",
    "lastUpdate": "2020-12-20T11:32:28Z",
    "name": "DeepScreening",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ104",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Deep learning contributes significantly to researches in biological sciences and drug discovery. Previous studies suggested that deep learning techniques have shown superior performance to other machine learning algorithms in virtual screening, which is a critical step to accelerate the drug discovery. However, the application of deep learning techniques in drug discovery and chemical biology are hindered due to the data availability, data further processing and lacking of the user-friendly deep learning tools and interface. Therefore, we developed a user-friendly web server with integration of the state of art deep learning algorithm, which utilizes either the public or user-provided dataset to help biologists or chemists perform virtual screening either the chemical probes or drugs for a specific target of interest. With DeepScreening, user could conveniently construct a deep learning model and generate the target-focused de novo libraries. The constructed classification and regression models could be subsequently used for virtual screening against the generated de novo libraries, or diverse chemical libraries in stock. From deep models training to virtual screening, and target focused de novo library generation, all those tasks could be finished with DeepScreening. We believe this deep learning-based web server will benefit to both biologists and chemists for probes or drugs discovery.",
                "authors": [
                    {
                        "name": "Du J."
                    },
                    {
                        "name": "Fang J."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Xu G."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 13,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "DeepScreening: A deep learning-based screening web server for accelerating drug discovery"
            },
            "pmcid": "PMC6790966",
            "pmid": "31608949"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
