{
    "additionDate": "2020-01-14T09:34:11Z",
    "biotoolsCURIE": "biotools:FindSV",
    "biotoolsID": "FindSV",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anna.lindstrand@ki.se",
            "name": "Anna Lindstrand",
            "orcidid": "https://orcid.org/0000-0003-0806-5602",
            "typeEntity": "Person"
        }
    ],
    "description": "whole-genome sequencing as a first-line test comprehensively captures the diverse spectrum of disease-causing genetic variation underlying intellectual disability.\n\nFindSV is a structural variation pipeline written in nextflow and python. FindSV performs variant calling using TIDDIT and CNVnator. similar variants are merged, and the variants are annotated using VEP, frequency database, genmod, and custom annotation using the annotator script. FindSV outputs one unfilered vcf file per caller, a merged and unfiltered vcf file (_Combined.vcf), as well as an annotated and filtered vcf file \"_FindSV.vcf\". In addition, FindSV outputs a ploidy tab file, that describes the ploidy for each chromosome.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/J35P312/FindSV",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2020-12-28T20:15:18Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/J35P312/FindSV/issues"
        }
    ],
    "name": "FindSV",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-019-0675-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Since different types of genetic variants, from single nucleotide variants (SNVs) to large chromosomal rearrangements, underlie intellectual disability, we evaluated the use of whole-genome sequencing (WGS) rather than chromosomal microarray analysis (CMA) as a first-line genetic diagnostic test. Methods: We analyzed three cohorts with short-read WGS: (i) a retrospective cohort with validated copy number variants (CNVs) (cohort 1, n = 68), (ii) individuals referred for monogenic multi-gene panels (cohort 2, n = 156), and (iii) 100 prospective, consecutive cases referred to our center for CMA (cohort 3). Bioinformatic tools developed include FindSV, SVDB, Rhocall, Rhoviz, and vcf2cytosure. Results: First, we validated our structural variant (SV)-calling pipeline on cohort 1, consisting of three trisomies and 79 deletions and duplications with a median size of 850 kb (min 500 bp, max 155 Mb). All variants were detected. Second, we utilized the same pipeline in cohort 2 and analyzed with monogenic WGS panels, increasing the diagnostic yield to 8%. Next, cohort 3 was analyzed by both CMA and WGS. The WGS data was processed for large (> 10 kb) SVs genome-wide and for exonic SVs and SNVs in a panel of 887 genes linked to intellectual disability as well as genes matched to patient-specific Human Phenotype Ontology (HPO) phenotypes. This yielded a total of 25 pathogenic variants (SNVs or SVs), of which 12 were detected by CMA as well. We also applied short tandem repeat (STR) expansion detection and discovered one pathologic expansion in ATXN7. Finally, a case of Prader-Willi syndrome with uniparental disomy (UPD) was validated in the WGS data. Important positional information was obtained in all cohorts. Remarkably, 7% of the analyzed cases harbored complex structural variants, as exemplified by a ring chromosome and two duplications found to be an insertional translocation and part of a cryptic unbalanced translocation, respectively. Conclusion: The overall diagnostic rate of 27% was more than doubled compared to clinical microarray (12%). Using WGS, we detected a wide range of SVs with high accuracy. Since the WGS data also allowed for analysis of SNVs, UPD, and STRs, it represents a powerful comprehensive genetic test in a clinical diagnostic laboratory setting.",
                "authors": [
                    {
                        "name": "Anderlid B.-M."
                    },
                    {
                        "name": "Bjerin O."
                    },
                    {
                        "name": "Carvalho C.M.B."
                    },
                    {
                        "name": "Eisfeldt J."
                    },
                    {
                        "name": "Georgii-Hemming P."
                    },
                    {
                        "name": "Grigelioniene G."
                    },
                    {
                        "name": "Gustavsson P."
                    },
                    {
                        "name": "Hammarsjo A."
                    },
                    {
                        "name": "Iwarsson E."
                    },
                    {
                        "name": "Johansson-Soller M."
                    },
                    {
                        "name": "Kvarnung M."
                    },
                    {
                        "name": "Lagerstedt-Robinson K."
                    },
                    {
                        "name": "Lieden A."
                    },
                    {
                        "name": "Lindstrand A."
                    },
                    {
                        "name": "Lundin J."
                    },
                    {
                        "name": "Magnusson M."
                    },
                    {
                        "name": "Malmgren H."
                    },
                    {
                        "name": "Martin M."
                    },
                    {
                        "name": "Nilsson D."
                    },
                    {
                        "name": "Nordenskjold M."
                    },
                    {
                        "name": "Nordgren A."
                    },
                    {
                        "name": "Norling A."
                    },
                    {
                        "name": "Pettersson M."
                    },
                    {
                        "name": "Sahlin E."
                    },
                    {
                        "name": "Stranneheim H."
                    },
                    {
                        "name": "Tham E."
                    },
                    {
                        "name": "Wedell A."
                    },
                    {
                        "name": "Wincent J."
                    },
                    {
                        "name": "Wirta V."
                    },
                    {
                        "name": "Ygberg S."
                    }
                ],
                "citationCount": 31,
                "date": "2019-11-07T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "From cytogenetics to cytogenomics: Whole-genome sequencing as a first-line test comprehensively captures the diverse spectrum of disease-causing genetic variation underlying intellectual disability"
            },
            "pmcid": "PMC6836550",
            "pmid": "31694722"
        }
    ],
    "toolType": [
        "Script",
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
