{
    "additionDate": "2021-01-18T10:50:44Z",
    "biotoolsCURIE": "biotools:eatomics",
    "biotoolsID": "eatomics",
    "confidence_flag": "tool",
    "description": "Eatomics is an R-Shiny based web application that enables interactive exploration of quantitative proteomics data generated by MaxQuant software. Eatomics enables fast exploration of differential expression and pathway analysis to researchers with limited bioinformatics knowledge. The application aids in quality control of the quantitative proteomics data, visualization, differential expression and pathway analysis. Highlights of the application are an extensive experimental setup module, the data and report generation feature and the multiple ways to interact and customize the analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Millchmaedchen/Eatomics",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-05T15:05:25Z",
    "license": "GPL-3.0",
    "name": "Eatomics",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00398",
            "metadata": {
                "abstract": "© 2021 American Chemical Society. All rights reserved.Quantitative proteomics data are becoming increasingly more available, and as a consequence are being analyzed and interpreted by a larger group of users. However, many of these users have less programming experience. Furthermore, experimental designs and setups are getting more complicated, especially when tissue biopsies are analyzed. Luckily, the proteomics community has already established some best practices on how to conduct quality control, differential abundance analysis and enrichment analysis. However, an easy-to-use application that wraps together all steps for the exploration and flexible analysis of quantitative proteomics data is not yet available. For Eatomics, we utilize the R Shiny framework to implement carefully chosen parts of established analysis workflows to (i) make them accessible in a user-friendly way, (ii) add a multitude of interactive exploration possibilities, and (iii) develop a unique experimental design setup module, which interactively translates a given research hypothesis into a differential abundance and enrichment analysis formula. In this, we aim to fulfill the needs of a growing group of inexperienced quantitative proteomics data analysts. Eatomics may be tested with demo data directly online via https://we.analyzegenomes.com/now/eatomics/ or with the user's own data by installation from the Github repository at https://github.com/Millchmaedchen/Eatomics.",
                "authors": [
                    {
                        "name": "Kraus M."
                    },
                    {
                        "name": "Mathew Stephen M."
                    },
                    {
                        "name": "Schapranow M.-P."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Eatomics: Shiny Exploration of Quantitative Proteomics Data"
            },
            "pmid": "32954734"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
