{
    "additionDate": "2017-12-18T00:14:26Z",
    "biotoolsCURIE": "biotools:atram",
    "biotoolsID": "atram",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/juliema/aTRAM"
        },
        {
            "email": "daisie.huang@botany.ubc.ca",
            "name": "Daisie Iris Huang",
            "orcidid": "http://orcid.org/0000-0002-1497-1284",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Performs targeted de novo assembly of loci from paired-end Illumina runs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/juliema/aTRAM"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/juliema/aTRAM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-01-11T00:38:42Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/atram-automated-target-restricted-assembly-method.html"
        }
    ],
    "name": "aTRAM",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0515-2",
            "metadata": {
                "abstract": "© 2015 Allen et al.; licensee BioMed Central.Background: Assembling genes from next-generation sequencing data is not only time consuming but computationally difficult, particularly for taxa without a closely related reference genome. Assembling even a draft genome using de novo approaches can take days, even on a powerful computer, and these assemblies typically require data from a variety of genomic libraries. Here we describe software that will alleviate these issues by rapidly assembling genes from distantly related taxa using a single library of paired-end reads: aTRAM, automated Target Restricted Assembly Method. The aTRAM pipeline uses a reference sequence, BLAST, and an iterative approach to target and locally assemble the genes of interest. Results: Our results demonstrate that aTRAM rapidly assembles genes across distantly related taxa. In comparative tests with a closely related taxon, aTRAM assembled the same sequence as reference-based and de novo approaches taking on average < 1 min per gene. As a test case with divergent sequences, we assembled >1,000 genes from six taxa ranging from 25 - 110 million years divergent from the reference taxon. The gene recovery was between 97 - 99% from each taxon. Conclusions: aTRAM can quickly assemble genes across distantly-related taxa, obviating the need for draft genome assembly of all taxa of interest. Because aTRAM uses a targeted approach, loci can be assembled in minutes depending on the size of the target. Our results suggest that this software will be useful in rapidly assembling genes for phylogenomic projects covering a wide taxonomic range, as well as other applications. The software is freely available http://www.github.com/juliema/aTRAM.",
                "authors": [
                    {
                        "name": "Allen J.M."
                    },
                    {
                        "name": "Huang D.I."
                    },
                    {
                        "name": "Cronk Q.C."
                    },
                    {
                        "name": "Johnson K.P."
                    }
                ],
                "citationCount": 39,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "aTRAM - automated target restricted assembly method: A fast method for assembling loci across divergent taxa from next-generation sequencing data"
            },
            "pmcid": "PMC4380108",
            "pmid": "25887972",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.04"
    ]
}