{
    "additionDate": "2018-10-31T10:27:56Z",
    "biotoolsCURIE": "biotools:nparact",
    "biotoolsID": "nparact",
    "credit": [
        {
            "email": "christine.blume@sbg.ac.at",
            "name": "Christine Blume",
            "orcidid": "http://orcid.org/0000-0003-2328-9612",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "nparACT computes the interdaily stability (IS), intradaily variability (IV) and relative amplitude (RA) of activity and gives the start times and average activity values of M10 (i.e. the ten hours with maximal activity) and L5 (i.e. the five hours with least activity) from actigraphy data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/nparACT/nparACT.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/nparACT/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-13T16:50:43Z",
    "license": "GPL-2.0",
    "name": "nparACT",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.mex.2016.05.006",
            "metadata": {
                "abstract": "© 2016 The Author(s).For many studies, participants' sleep-wake patterns are monitored and recorded prior to, during and following an experimental or clinical intervention using actigraphy, i.e. the recording of data generated by movements. Often, these data are merely inspected visually without computation of descriptive parameters, in part due to the lack of user-friendly software. To address this deficit, we developed a package for R Core Team [6], that allows computing several non-parametric measures from actigraphy data. Specifically, it computes the interdaily stability (IS), intradaily variability (IV) and relative amplitude (RA) of activity and gives the start times and average activity values of M10 (i.e. the ten hours with maximal activity) and L5 (i.e. the five hours with least activity). Two functions compute these 'classical' parameters and handle either single or multiple files. Two other functions additionally allow computing an L-value (i.e. the least activity value) for a user-defined time span termed 'Lflex' value. A plotting option is included in all functions. The package can be downloaded from the Comprehensive R Archives Network (CRAN). The package 'nparACT' for R serves the non-parametric analysis of actigraphy data.Computed parameters include interdaily stability (IS), intradaily variability (IV) and relative amplitude (RA) as well as start times and average activity during the 10 h with maximal and the 5 h with minimal activity (i.e. M10 and L5).",
                "authors": [
                    {
                        "name": "Blume C."
                    },
                    {
                        "name": "Santhi N."
                    },
                    {
                        "name": "Schabus M."
                    }
                ],
                "citationCount": 31,
                "date": "2016-01-01T00:00:00Z",
                "journal": "MethodsX",
                "title": "'nparACT' package for R: A free software tool for the non-parametric analysis of actigraphy data"
            },
            "pmcid": "PMC4890079",
            "pmid": "27294030",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ],
    "validated": 1,
    "version": [
        "0.8"
    ]
}