{
    "additionDate": "2015-06-29T10:26:14Z",
    "biotoolsCURIE": "biotools:netoglyc",
    "biotoolsID": "netoglyc",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "hirenj@cbs.dtu.dk",
            "name": "Hiren Joshi",
            "note": "Contact for scientific problems",
            "orcidid": "http://orcid.org/0000-0002-8192-2829",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "webmaster@cbs.dtu.dk",
            "name": "CBS",
            "note": "Contact for technical problems",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Produce neural network predictions of mucin type GalNAc O-glycosylation sites in mammalian proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbs.dtu.dk/services/NetOGlyc-4.0/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Produces neural network predictions of mucin type GalNAc O-glycosylation sites in mammalian proteins",
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    },
                    "format": [
                        {
                            "term": "GFF2",
                            "uri": "http://edamontology.org/format_1974"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.cbs.dtu.dk/services/NetOGlyc/",
    "lastUpdate": "2024-11-25T14:19:53.058447Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "NetOGlyc",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1042/bj3080801",
            "metadata": {
                "abstract": "The specificity of the enzyme(s) catalysing the covalent link between the hydroxyl side chains of serine or threonine and the sugar moiety N-acetylgalactosamine (GalNAc) is unknown. Pattern recognition by artificial neural networks and weight matrix algorithms was performed to determine the exact position of in vivo O-linked GalNAc-glycosylated serine and threonine residues from the primary sequence exclusively. The acceptor sequence context for O-glycosylation of serine was found to differ from that of threonine and the two types were therefore treated separately. The context of the sites showed a high abundance of proline, serine and threonine extending far beyond the previously reported region covering positions -4 through +4 relative to the glycosylated residue. The O-glycosylation sites were found to cluster and to have a high abundance in the N-terminal part of the protein. The sites were also found to have an increased preference for three different classes of β-turns. No simple consensus-like rule could be deduced for the complex glycosylation sequence acceptor patterns. The neural networks were trained on the hitherto largest data material consisting of 48 carefully examined mammalian glycoproteins comprising 264 O-glycosylation sites. For detection neural network algorithms were much more reliable than weight matrices. The networks correctly found 60-95% of the O-glycosylated serine/threonine residues and 88-97% of the non-glycosylated residues in two independent test sets of known glycoproteins. A computer server using E-mail for prediction of O-glycosylation sites has been implemented and made publicly available.",
                "authors": [
                    {
                        "name": "Bohr H."
                    },
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Engelbrecht J."
                    },
                    {
                        "name": "Hansen J.-E.S."
                    },
                    {
                        "name": "Hansen J.-E.S."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Nielsen J.O."
                    }
                ],
                "citationCount": 240,
                "date": "1995-01-01T00:00:00Z",
                "journal": "Biochemical Journal",
                "title": "Prediction of O-glycosylation of mammalian proteins: Specificity patterns of UDP-GalNAc:polypeptide N-acetylgalactosaminyltransferase"
            },
            "pmcid": "PMC1136796",
            "pmid": "8948436"
        },
        {
            "doi": "10.1093/nar/25.1.278",
            "metadata": {
                "abstract": "O-GLYCBASE is an updated database of information on glycoproteins and their O-linked glycosylation sites. Entries are compiled and revised from the literature, and from the SWISS-PROT database. Entries include information about species, sequence, glycosylation sites and glycan type. O-GLYCBASE is now fully cross-referenced to the SWISS-PROT, PIR, PROSITE, PDB, EMBL, HSSP, LISTA and MIM databases. Compared with version 1.0 the number of entries have increased by 34%. Revision of the O-glycan assignment was performed on 20% of the entries. Sequence logos displaying the acceptor specificity patterns for the GalNAc, mannose and GlcNAc transferases are shown. The O-GLYCBASE database is available through WWW or by anonymous FTP.",
                "authors": [
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Hansen J.E."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Rapacki K."
                    }
                ],
                "citationCount": 104,
                "date": "1997-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "O-GLYCBASE version 2.0: A revised database of O-glycosylated proteins"
            },
            "pmcid": "PMC146398",
            "pmid": "9016554"
        },
        {
            "doi": "10.1038/emboj.2013.79",
            "metadata": {
                "abstract": "Glycosylation is the most abundant and diverse posttranslational modification of proteins. While several types of glycosylation can be predicted by the protein sequence context, and substantial knowledge of these glycoproteomes is available, our knowledge of the GalNAc-type O-glycosylation is highly limited. This type of glycosylation is unique in being regulated by 20 polypeptide GalNAc-transferases attaching the initiating GalNAc monosaccharides to Ser and Thr (and likely some Tyr) residues. We have developed a genetic engineering approach using human cell lines to simplify O-glycosylation (SimpleCells) that enables proteome-wide discovery of O-glycan sites using 'bottom-up' ETD-based mass spectrometric analysis. We implemented this on 12 human cell lines from different organs, and present a first map of the human O-glycoproteome with almost 3000 glycosites in over 600 O-glycoproteins as well as an improved NetOGlyc4.0 model for prediction of O-glycosylation. The finding of unique subsets of O-glycoproteins in each cell line provides evidence that the O-glycoproteome is differentially regulated and dynamic. The greatly expanded view of the O-glycoproteome should facilitate the exploration of how site-specific O-glycosylation regulates protein function. © 2013 European Molecular Biology Organization.",
                "authors": [
                    {
                        "name": "Brunak So."
                    },
                    {
                        "name": "Clausen H."
                    },
                    {
                        "name": "Dabelsteen S."
                    },
                    {
                        "name": "Gupta R."
                    },
                    {
                        "name": "Joshi H.J."
                    },
                    {
                        "name": "Kong Y."
                    },
                    {
                        "name": "Lavrsen K."
                    },
                    {
                        "name": "Levery S.B."
                    },
                    {
                        "name": "Mandel U."
                    },
                    {
                        "name": "Marcos-Silva L."
                    },
                    {
                        "name": "Paul Bennett E."
                    },
                    {
                        "name": "Pedersen N.B."
                    },
                    {
                        "name": "Schjoldager K.T.-B.G."
                    },
                    {
                        "name": "Steentoft C."
                    },
                    {
                        "name": "Vakhrushev S.Y."
                    },
                    {
                        "name": "Vester-Christensen M.B."
                    },
                    {
                        "name": "Wandall H.H."
                    }
                ],
                "citationCount": 1069,
                "date": "2013-05-15T00:00:00Z",
                "journal": "EMBO Journal",
                "title": "Precision mapping of the human O-GalNAc glycoproteome through SimpleCell technology"
            },
            "pmcid": "PMC3655468",
            "pmid": "23584533",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1023/a:1006960004440",
            "metadata": {
                "abstract": "The specificities of the UDP-GalNAc:polypeptide N- acetylgalactosaminyltransferases which link the carbohydrate GalNAc to the side-chain of certain serine and threonine residues in mucin type glycoproteins, are presently unknown. The specificity seems to be modulated by sequence context, secondary structure and surface accessibility. The sequence context of glycosylated threonines was found to differ from that of serine, and the sites were found to cluster. Non-clustered sites had a sequence context different from that of clustered sites. Charged residues were disfavoured at position - 1 and +3. A jury of artificial neural networks was trained to recognize the sequence context and surface accessibility of 299 known and verified mucin type O-glycosylation sites extracted from O- GLYCBASE. The cross-validated NetOglyc network system correctly found 83% of the glycosylated and 90% of the non-glycosylated serine and threonine residues in independent test sets, thus proving more accurate than matrix statistics and vector projection methods. Predictions of O-glycosylation sites in the envelope glycoprotein gp120 from the primate lentiviruses HIV- 1, HIV-2 and SIV are presented. The most conserved O-glycosylation signals in these evolutionary-related glycoproteins were found in their first hypervariable loop, V1. However, the strain variation for HIV-1 gp120 was significant. A computer server, available through WWW or E-mail, has been developed for prediction of mucin type O-glycosylation sites in proteins based on the amino acid sequence.",
                "authors": [
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Gooley A.A."
                    },
                    {
                        "name": "Hansen J.E."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Tolstrup N."
                    },
                    {
                        "name": "Williams K.L."
                    }
                ],
                "citationCount": 467,
                "date": "1998-06-18T00:00:00Z",
                "journal": "Glycoconjugate Journal",
                "title": "NetOglyc: Prediction of mucin type O-glycosylation sites based on sequence context and surface accessibility"
            },
            "pmid": "9557871"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1,
    "version": [
        "4.0"
    ]
}
