
{
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "kathleen.marchal@intec.ugent.be",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioinformatics.intec.ugent.be/sominaclust/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mutation identifier",
                        "uri": "http://edamontology.org/data_2538"
                    }
                }
            ],
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence cluster (nucleic acid)",
                        "uri": "http://edamontology.org/data_1246"
                    }
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BIG N2N",
            "UGent"
        ],
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© Van den Eynden et al.; licensee BioMed Central. Background: With the advances in high throughput technologies, increasing amounts of cancer somatic mutation data are being generated and made available. Only a small number of (driver) mutations occur in driver genes and are responsible for carcinogenesis, while the majority of (passenger) mutations do not influence tumour biology. In this study, SomInaClust is introduced, a method that accurately identifies driver genes based on their mutation pattern across tumour samples and then classifies them into oncogenes or tumour suppressor genes respectively. Results: SomInaClust starts from the observation that oncogenes mainly contain mutations that, due to positive selection, cluster at similar positions in a gene across patient samples, whereas tumour suppressor genes contain a high number of protein-truncating mutations throughout the entire gene length. The method was shown to prioritize driver genes in 9 different solid cancers. Furthermore it was found to be complementary to existing similar-purpose methods with the additional advantages that it has a higher sensitivity, also for rare mutations (occurring in less than 1% of all samples), and it accurately classifies candidate driver genes in putative oncogenes and tumour suppressor genes. Pathway enrichment analysis showed that the identified genes belong to known cancer signalling pathways, and that the distinction between oncogenes and tumour suppressor genes is biologically relevant. Conclusions: SomInaClust was shown to detect candidate driver genes based on somatic mutation patterns of inactivation and clustering and to distinguish oncogenes from tumour suppressor genes. The method could be used for the identification of new cancer genes or to filter mutation data for further data-integration purposes.",
            "authors": [
                "Van den Eynden J.",
                "Fierro A.C.",
                "Verbeke L.P.C.",
                "Marchal K."
            ],
            "cit_count": 14,
            "doi": "10.1186/s12859-015-0555-7",
            "journal": "BMC Bioinformatics",
            "title": "SomInaClust: Detection of cancer genes based on somatic mutation patterns of inactivation and clustering",
            "type": "Primary",
            "year": "2015-04-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sominaclust",
        "biotoolsID": "sominaclust",
        "description": "Detection of cancer genes based on somatic mutation patterns of inactivation and clustering.",
        "homepage": "http://bioinformatics.intec.ugent.be/sominaclust",
        "name": "SomInaClust",
        "version": [
            "1"
        ]
    }
}