{
    "additionDate": "2018-01-21T16:59:23Z",
    "biotoolsCURIE": "biotools:mirpub",
    "biotoolsID": "mirpub",
    "credit": [
        {
            "email": "diwis@imis.athena-innovation.gr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database and a related web application which provides a powerful and intuitive interface to the researchers that want to search for publications related to particular microRNA molecules. It also provides useful information about the correlation of these microRNAs to any diseases, tissues and genes. It facilitates publication search by considering microRNA families and the history of the microRNA nomenclature.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://snf-515788.vm.okeanos.grnet.gr/index.php?r=site/help&topic=mirpath"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://diana.imis.athena-innovation.gr/DianaTools/index.php?r=mirpub/index",
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://diana.imis.athena-innovation.gr/DianaTools/index.php?r=mirpub/index"
        }
    ],
    "name": "mirPub",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "diwis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu819",
            "metadata": {
                "abstract": "© 2014 The Author. Published by Oxford University Press.Identifying, amongst millions of publications available in MEDLINE, those that are relevant to specific microRNAs (miRNAs) of interest based on keyword search faces major obstacles. References to miRNA names in the literature often deviate from standard nomenclature for various reasons, since even the official nomenclature evolves. For instance, a single miRNA name may identify two completely different molecules or two different names may refer to the same molecule. mirPub is a database with a powerful and intuitive interface, which facilitates searching for miRNA literature, addressing the aforementioned issues. To provide effective search services, mirPub applies text mining techniques on MEDLINE, integrates data from several curated databases and exploits data from its user community following a crowdsourcing approach. Other key features include an interactive visualization service that illustrates intuitively the evolution of miRNA data, tag clouds summarizing the relevance of publications to particular diseases, cell types or tissues and access to TarBase 6.0 data to oversee genes related to miRNA publications.",
                "authors": [
                    {
                        "name": "Dalamagas T."
                    },
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Hatzigeorgiou A."
                    },
                    {
                        "name": "Kanellos I."
                    },
                    {
                        "name": "Kostoulas N."
                    },
                    {
                        "name": "Sellis T."
                    },
                    {
                        "name": "Vergoulis T."
                    }
                ],
                "citationCount": 14,
                "date": "2015-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MirPub: A database for searching microRNA publications"
            },
            "pmcid": "PMC4410649",
            "pmid": "25527833",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}
