{"credit":[],"labels":{"topic":[{"term":"Oncology","uri":"http://edamontology.org/topic_2640"},{"term":"Public health and epidemiology","uri":"http://edamontology.org/topic_3305"}]},"publication":[{"abstract":"INTRODUCTION: Breast cancer is the most common cancer in women worldwide, for which the survival rate is increasing over time. Growing evidence are showing that the effect of lifestyle could have the same weight of the effect of the usual clinical-pathological risk factors on survival rate. The DianaWeb study responds to the pressing request of patients diagnosed with breast cancer to know the most advanced point of scientific research on the prevention of recurrences, to have a virtual space to meet, where to receive advice and practical information for the daily management the lifestyle change. DianaWeb is a community-based participatory research, dedicated to breast cancer patients, aimed to monitor lifestyle, provide them tips to encourage sustainable lifestyle changes, and to analyze clinical outcomes. In order to achieve these aims, DianaWeb uses a specific interactive website (http://www.dianaweb.org/). METHODS: The web architecture has been designed essential and light, with a rigorous implantation that brings the figure of the woman to the center. In order to humanized the project the acronym used to identify the study was Diana (Diet and Androgens), a classical female name, who was illustrated as a female avatar, aimed to symbolize all women. The graphical interface was developed using seven pastel tones colors, which become a fundamental elements of the layout, such as frame, navigation menu, and separation interspaces. RESULTS: The project started in 2015, and in 4 days the web site was visited by more than 1000 people. A total of 2823 persons enrolled in the study, but 2182 did not send the full documentations, 61 persons abandoned the study, 641 timely answered to the questionnaires. CONCLUSIONS: The high number of participants' interaction within the web page, confirmed the high usability of the web page and the great interest of patients. Prevention of breast cancer recurrences with low cost technologies, easily available to everybody, is a priority for both public health and public finances.","authors":["Gianfredi V.","Nucci D.","Balzarini M.","Acito M.","Moretti M.","Villarini A.","Villarini M."],"cit_count":0,"doi":"10.7417/CT.2020.2190","journal":"La Clinica terapeutica","pmid":"31850486","title":"E-Coaching: the DianaWeb study to prevent breast cancer recurrences","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:DianaWeb","biotoolsID":"DianaWeb","description":"the DianaWeb study to prevent breast cancer recurrences.\n\nISCRIVITI IL TUO CONTRIBUTO E' IMPORTANTE.\n\nDIANAWEB: articolo del SOLE 24 ORE. 16 dicembre 2019.\n\nStudio clinico per saggiare l’ipotesi che il nuovo stile di vita possa ridurre.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'E-Coaching'","homepage":"http://www.dianaweb.org/","name":"DianaWeb"}}