{"credit":[],"function":[{"operation":[{"term":"Haplotype mapping","uri":"http://edamontology.org/operation_0487"},{"term":"Linkage disequilibrium calculation","uri":"http://edamontology.org/operation_0488"},{"term":"Genetic mapping","uri":"http://edamontology.org/operation_0282"},{"term":"Linkage analysis","uri":"http://edamontology.org/operation_0283"},{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"publication":[{"abstract":"SNPAnalyzer is a software that performs four essential statistical analyses of SNPs in a common computational environment. It is composed of three main modules: (i) data manipulation, (ii) analysis and (iii) visualization. The data manipulation module is responsible for data input and output, and handles genotype, phenotype and genetic distance data. To ensure user convenience, the data format is simple. The analysis module performs statistical calculations and consists of four subcomponents: (i) Hardy-Weinberg equilibrium, (ii) Haplotype Estimation, (iii) linkage disequilibrium (LD) and (iv) quantitative trait locus analysis. The main feature of the analysis module is multiple implementations of different algorithms and indices for haplotype estimation and for LD analysis. This enables users to compare separate results generated by different algorithms, which help to avoid biased results acquired by applying a single statistical algorithm. The performance of all implemented algorithms has been validated using experimentally proven datasets. The visualization module presents most of the analyzed results as figures, rather than as simple text, which aids in the intuitive understanding of complex data. The SNPAnalyzer has been developed using C and C++ and is available at http://www.istech. info/istech/board/login∀rm.jsp. © 2005 Oxford University Press.","authors":["Yoo J.","Seo B.","Kim Y."],"cit_count":45,"journal":"Nucleic Acids Research","pmid":"15980517","title":"SNPAnalyzer: A web-based integrated workbench for single-nucleotide polymorphism analysis","year":"2005-07-01"}],"summary":{"biotoolsCURIE":"biotools:istech_snpanalyzer","biotoolsID":"istech_snpanalyzer","description":"Tool for the statistical analysis of SNP data that includes Hardy Weinberg equilibrium (HWE), haplotype estimation, linkage disequilibrium (LD), and QTL analyses. Registration required, some browser requirements and set-up necessary.","homepage":"http://snp.istech.info/istech/board/login_form.jsp","name":"ISTECH SNPAnalyzer"}}