{
    "additionDate": "2021-01-18T07:11:23Z",
    "biotoolsCURIE": "biotools:vampr",
    "biotoolsID": "vampr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "David.Greenberg@UTSouthwestern.edu",
            "name": "David E. Greenberg",
            "orcidid": "https://orcid.org/0000-0002-5101-3106",
            "typeEntity": "Person"
        },
        {
            "email": "Xiaowei.Zhan@UTSouthwestern.edu",
            "name": "Xiaowei Zhan",
            "orcidid": "https://orcid.org/0000-0002-6249-7193",
            "typeEntity": "Person"
        }
    ],
    "description": "VAriant Mapping and Prediction of antibiotic resistance via explainable features and machine learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jiwoongbio/VAMPr",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-03-11T08:57:02Z",
    "name": "VAMPr",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007511",
            "metadata": {
                "abstract": "© 2020 Kim et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Antimicrobial resistance (AMR) is an increasing threat to public health. Current methods of determining AMR rely on inefficient phenotypic approaches, and there remains incomplete understanding of AMR mechanisms for many pathogen-antimicrobial combinations. Given the rapid, ongoing increase in availability of high-density genomic data for a diverse array of bacteria, development of algorithms that could utilize genomic information to predict phenotype could both be useful clinically and assist with discovery of heretofore unrecognized AMR pathways. To facilitate understanding of the connections between DNA variation and phenotypic AMR, we developed a new bioinformatics tool, variant mapping and prediction of antibiotic resistance (VAMPr), to (1) derive gene ortholog-based sequence features for protein variants; (2) interrogate these explainable gene-level variants for their known or novel associations with AMR; and (3) build accurate models to predict AMR based on whole genome sequencing data. We curated the publicly available sequencing data for 3,393 bacterial isolates from 9 species that contained AMR phenotypes for 29 antibiotics. We detected 14,615 variant genotypes and built 93 association and prediction models. The association models confirmed known genetic antibiotic resistance mechanisms, such as blaKPC and carbapenem resistance consistent with the accurate nature of our approach. The prediction models achieved high accuracies (mean accuracy of 91.1% for all antibiotic-pathogen combinations) internally through nested cross validation and were also validated using external clinical datasets. The VAMPr variant detection method, association and prediction models will be valuable tools for AMR research for basic scientists with potential for clinical applicability.",
                "authors": [
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Greenberg D.E."
                    },
                    {
                        "name": "Pifer R."
                    },
                    {
                        "name": "Jiang S."
                    },
                    {
                        "name": "Xiao G."
                    },
                    {
                        "name": "Shelburne S.A."
                    },
                    {
                        "name": "Koh A."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Zhan X."
                    }
                ],
                "citationCount": 9,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "VaMPR: VAriant Mapping and Prediction of antibiotic resistance via explainable features and machine learning"
            },
            "pmcid": "PMC7015433",
            "pmid": "31929521"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}