
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/projects/BARGEN/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ebi.ac.uk/sites/ebi.ac.uk/files/groups/kersey_service_team/HyperLasso/readme.txt"
        },
        {
            "type": "GENERAL",
            "url": "http://www.ebi.ac.uk/sites/ebi.ac.uk/files/groups/kersey_service_team/FREGEN/documentation.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/hyperlasso-simultaneous-analysis-gwas.html"
        }
    ],
    "publication": [
        {
            "abstract": "Penalized regression methods offer an attractive alternative to single marker testing in genetic association analysis. Penalized regression methods shrink down to zero the coefficient of markers that have little apparent effect on the trait of interest, resulting in a parsimonious subset of what we hope are true pertinent predictors. Here we explore the performance of penalization in selecting SNPs as predictors in genetic association studies. The strength of the penalty can be chosen either to select a good predictive model (via methods such as computationally expensive cross validation), through maximum likelihood-based model selection criterion (such as the BIC), or to select a model that controls for type I error, as done here. We have investigated the performance of several penalized logistic regression approaches, simulating data under a variety of disease locus effect size and linkage disequilibrium patterns. We compared several penalties, including the elastic net, ridge, Lasso, MCP and the normal-exponential-γ shrinkage prior implemented in the hyperlasso software, to standard single locus analysis and simple forward stepwise regression. We examined how markers enter the model as penalties and P-value thresholds are varied, and report the sensitivity and specificity of each of the methods. Results show that penalized methods outperform single marker analysis, with the main difference being that penalized methods allow the simultaneous inclusion of a number of markers, and generally do not allow correlated variables to enter the model, producing a sparse model in which most of the identified explanatory markers are accounted for. © 2010 Wiley-Liss, Inc.",
            "authors": [
                "Ayers K.L.",
                "Cordell H.J."
            ],
            "cit_count": 98,
            "journal": "Genetic Epidemiology",
            "pmid": "21104890",
            "title": "SNP Selection in genome-wide and candidate gene studies via penalized logistic regression",
            "year": "2010-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hyperlasso",
        "biotoolsID": "hyperlasso",
        "description": "Software of simultaneous analysis of many SNPs and covariates.",
        "homepage": "http://www.ebi.ac.uk/projects/BARGEN/",
        "name": "HyperLasso"
    }
}