{
    "additionDate": "2019-11-14T18:27:12Z",
    "biotoolsCURIE": "biotools:RESULTSCellMinerCDB",
    "biotoolsID": "RESULTSCellMinerCDB",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "pommier@nih.gov",
            "name": "Yves Pommier",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/CellMinerCDB (DISCOVER.NCI.NIH.GOV/cellminercdb), bio.tools/mammalian_gene_collection (NCI.NIH.GOV), bio.tools/rcellminer (NCI.NIH.GOV/cellminer), bio.tools/cgap (NCI.NIH.GOV), bio.tools/pid (NCI.NIH.GOV) | > CORRECT NAME OF TOOL COULD ALSO BE 'DESIGN:CellMinerCDB', 'indenoisoquinolines', 'LMP400 olaparib', 'LMP400' | The Indenoisoquinoline TOP1 Inhibitors Selectively Target Homologous Recombination-Deficient and Schlafen 11-Positive Cancer Cells and Synergize with Olaparib | CellMiner Cross Database (CellMinerCDB) is the first web application to allow translational researchers to conduct analyses across all major cancer cell line pharmacogenomic data sources from NCI-DTP NCI-60, Sanger GDSC, and Broad CCLE/CTRP | Skip over navigation CellMiner NCI-60 NCI/DCTD/DTP",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://discover.nci.nih.gov/cellminercdb",
    "lastUpdate": "2019-11-14T18:27:12Z",
    "name": "RESULTS:CellMinerCDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1158/1078-0432.CCR-19-0419",
            "metadata": {
                "abstract": "© 2019 American Association for Cancer Research.Purpose: Irinotecan and topotecan are used to treat a variety of different cancers. However, they have limitations, including chemical instability and severe side effects. To overcome these limitations, we developed the clinical indenoisoquinolines: LMP400 (indotecan), LMP776 (indimitecan), and LMP744. The purpose of the study is to build the molecular rationale for phase II clinical trials. Experimental Design: CellMinerCDB (http://discover.nci. nih.gov/cellminercdb) was used to mine the cancer cell lines genomic databases. The causality of Schlafen11 (SLFN11) was validated in isogenic cell lines. Because topoisomerase I (TOP1)-mediated replication DNA damage is repaired by homologous recombination (HR), we tested the \"synthetic lethality\" of HR-deficient (HRD) cells. Survival and cell-cycle alterations were performed after drug treatments in isogenic DT40, DLD1, and OVCAR cell lines with BRCA1, BRCA2, or PALB2 deficiencies and in organoids cultured from prostate cancer patient-derived xenografts with BRCA2 loss. We also used an ovarian orthotopic allograft model with BRCA1 loss to validate the efficacy of LMP400 and olaparib combination. Results: CellMinerCDB reveals that SLFN11, which kills cells undergoing replicative stress, is a dominant drug determinant to the clinical indenoisoquinolines. In addition, BRCA1-, BRCA2-, and PALB2-deficient cells were hypersensitive to the indenoisoquinolines. All 3 clinical indenoisoquinolines were also synergistic with olaparib, especially in the HRD cells. The synergy between LMP400 and olaparib was confirmed in the orthotopic allograft model harboring BRCA1 loss. Conclusions: Our results provide a rationale for molecularly designed clinical trials with the indenoisoquinolines as single agents and in combination with PARP inhibitors in HRD cancers expressing SLFN11.",
                "authors": [
                    {
                        "name": "Marzi L."
                    },
                    {
                        "name": "Szabova L."
                    },
                    {
                        "name": "Gordon M."
                    },
                    {
                        "name": "Ohler Z.W."
                    },
                    {
                        "name": "Sharan S.K."
                    },
                    {
                        "name": "Beshiri M.L."
                    },
                    {
                        "name": "Etemadi M."
                    },
                    {
                        "name": "Murai J."
                    },
                    {
                        "name": "Kelly K."
                    },
                    {
                        "name": "Pommier Y."
                    }
                ],
                "citationCount": 5,
                "date": "2019-10-15T00:00:00Z",
                "journal": "Clinical Cancer Research",
                "title": "The indenoisoquinoline TOP1 inhibitors selectively target homologous recombinationdeficient and Schlafen 11-positive cancer cells and synergize with olaparib"
            },
            "pmcid": "PMC6801079",
            "pmid": "31409613"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}