{
    "name": "FlexProt", 
    "description": "Detect the optimal flexible structural alignment of a pair of protein structures. The first structure is assumed to be rigid, while in the second structure potential flexible regions are automatically detected.", 
    "homepage": "http://bioinfo3d.cs.tau.ac.il/FlexProt/", 
    "biotoolsID": "flexprot", 
    "biotoolsCURIE": "biotools:flexprot", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0503", 
                    "term": "Pairwise structure alignment"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_2814", 
            "term": "Protein structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/flexprot-pairwise-alignment-flexible-protein-structures.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bioinfo3d.cs.tau.ac.il/FlexProt/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12112693", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Flexible protein alignment and hinge detection", 
                "abstract": "Here we present a novel technique for the alignment of flexible proteins. The method does not require an a priori knowledge of the flexible hinge regions. The FlexProt algorithm simultaneously detects the hinge regions and aligns the rigid subparts of the molecules. Our technique is not sensitive to insertions and deletions. Numerous methods have been developed to solve rigid structural comparisons. Unlike FlexProt, all previously developed methods designed to solve the protein flexible alignment require an a priori knowledge of the hinge regions. The FlexProt method is based on 3-D pattern-matching algorithms combined with graph theoretic techniques. The algorithm is highly efficient. For example, it performs a structural comparison of a pair of proteins with 300 amino acids in about 7 s on a 400-MHz desktop PC. We provide experimental results obtained with this algorithm. First, we flexibly align pairs of proteins taken from the database of motions. These are extended by taking additional proteins from the same SCOP family. Next, we present some of the results obtained from exhaustive all-against-all flexible structural comparisons of 1329 SCOP family representatives. Our results include relatively high-scoring flexible structural alignments between the C-terminal merozoite surface protein vs. tissue factor; class II aminoacyl-tRNA synthase, histocompatibility antigen vs. neonatal FC receptor; tyrosine-protein kinase C-SRC vs. haematopoetic cell kinase (HCK); tyrosine-protein kinase C-SRC vs. titine protein (autoinhibited serine kinase domain); and tissue factor vs. hormone-binding protein. These are illustrated and discussed, showing the capabilities of this structural alignment algorithm, which allows un-predefined hinge-based motions. © 2002 Wiley-Liss, Inc.", 
                "date": "2002-08-01T00:00:00Z", 
                "citationCount": 105, 
                "authors": [
                    {
                        "name": "Shatsky M."
                    }, 
                    {
                        "name": "Nussinov R."
                    }, 
                    {
                        "name": "Wolfson H.J."
                    }
                ], 
                "journal": "Proteins: Structure, Function and Genetics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "max.shatsky@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:43:33Z", 
    "lastUpdate": "2018-12-10T12:58:45Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}