{
    "name": "MouseDivGeno", 
    "description": "R package specifically designed to genotype the Mouse Diversity Genotyping Array, an Affymetrix mouse genotyping array similar to the human SNP 6.0. It contains functions which allow you to perform genotyping, identify probe sets potentially harboring a new mutation (Variable INtensity Oligonucleotide or VINO, here we call it a vinotyping) and perform CNV analysis.", 
    "homepage": "http://cgd.jax.org/tools/mousedivgeno/", 
    "biotoolsID": "mousedivgeno", 
    "biotoolsCURIE": "biotools:mousedivgeno", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3196", 
                    "term": "Genotyping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0621", 
            "term": "Model organisms"
        }, 
        {
            "uri": "http://edamontology.org/topic_0625", 
            "term": "Genotype and phenotype"
        }, 
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "DNA polymorphism"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mousedivgeno-1-0-4-genotype-mouse-diversity-genotyping-array.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://cgd.jax.org/tools/mousedivgeno/MouseDivGeno.pdf", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "22260749", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Discovery of novel variants in genotyping arrays improves genotype retention and reduces ascertainment bias", 
                "abstract": "Background: High-density genotyping arrays that measure hybridization of genomic DNA fragments to allele-specific oligonucleotide probes are widely used to genotype single nucleotide polymorphisms (SNPs) in genetic studies, including human genome-wide association studies. Hybridization intensities are converted to genotype calls by clustering algorithms that assign each sample to a genotype class at each SNP. Data for SNP probes that do not conform to the expected pattern of clustering are often discarded, contributing to ascertainment bias and resulting in lost information - as much as 50% in a recent genome-wide association study in dogs.Results: We identified atypical patterns of hybridization intensities that were highly reproducible and demonstrated that these patterns represent genetic variants that were not accounted for in the design of the array platform. We characterized variable intensity oligonucleotide (VINO) probes that display such patterns and are found in all hybridization-based genotyping platforms, including those developed for human, dog, cattle, and mouse. When recognized and properly interpreted, VINOs recovered a substantial fraction of discarded probes and counteracted SNP ascertainment bias. We developed software (MouseDivGeno) that identifies VINOs and improves the accuracy of genotype calling. MouseDivGeno produced highly concordant genotype calls when compared with other methods but it uniquely identified more than 786000 VINOs in 351 mouse samples. We used whole-genome sequence from 14 mouse strains to confirm the presence of novel variants explaining 28000 VINOs in those strains. We also identified VINOs in human HapMap 3 samples, many of which were specific to an African population. Incorporating VINOs in phylogenetic analyses substantially improved the accuracy of a Mus species tree and local haplotype assignment in laboratory mouse strains.Conclusion: The problems of ascertainment bias and missing information due to genotyping errors are widely recognized as limiting factors in genetic studies. We have conducted the first formal analysis of the effect of novel variants on genotyping arrays, and we have shown that these variants account for a large portion of miscalled and uncalled genotypes. Genetic studies will benefit from substantial improvements in the accuracy of their results by incorporating VINOs in their analyses. © 2012 Didion et al; licensee BioMed Central Ltd.", 
                "date": "2012-01-19T00:00:00Z", 
                "citationCount": 41, 
                "authors": [
                    {
                        "name": "Didion J.P."
                    }, 
                    {
                        "name": "Yang H."
                    }, 
                    {
                        "name": "Sheppard K."
                    }, 
                    {
                        "name": "Fu C.-P."
                    }, 
                    {
                        "name": "McMillan L."
                    }, 
                    {
                        "name": "De Villena F.P.-M."
                    }, 
                    {
                        "name": "Churchill G.A."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Jessica Seavey", 
            "email": "Jessica.Seavey@jax.org", 
            "url": "http://churchill.jax.org/index.shtml", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:51:52Z", 
    "lastUpdate": "2018-12-10T12:58:49Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}