{
    "additionDate": "2021-03-19T08:50:27Z",
    "biotoolsCURIE": "biotools:deeprei",
    "biotoolsID": "deeprei",
    "confidence_flag": "tool",
    "description": "DeepReI is a deep learning-based gas chromatographic retention index predictor.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TomasVrzal/DeepReI",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-27T19:14:38Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/TomasVrzal/DeepReI/issues"
        }
    ],
    "name": "DeepReI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.ACA.2020.12.043",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Retention index in gas chromatographic analyses is an essential tool for appropriate analyte identification. Currently, many libraries providing retention indices for a huge number of compounds on distinct stationary phase chemistries are available. However, situation could be complicated in the case of unknown unknowns not present in such libraries. The importance of identification of these compounds have risen together with a rapidly expanding interest in non-targeted analyses in the last decade. Therefore, precise in silico computation/prediction of retention indices based on a suggested molecular structure will be highly appreciated in such situations. On this basis, a predictive model based on deep learning was developed and presented in this paper. It is designed for user-friendly and accurate prediction of retention indices of compounds in gas chromatography with the semi-standard non-polar stationary phase. Simplified Molecular Input Entry System (SMILES) is used as the model's input. Architecture of the model consists of 2D-convolutional layers, together with batch normalization, max pooling, dropout, and three residual connections. The model reaches median absolute error of prediction of the retention index for validation and test set at 16.4 and 16.0 units, respectively. Median percentage error is lower than or equal to 0.81% in the case of all mentioned data sets. Finally, the DeepReI model is presented in R package, and is available on https://github.com/TomasVrzal/DeepReI together with a user-friendly graphical user interface.",
                "authors": [
                    {
                        "name": "Vrzal T."
                    },
                    {
                        "name": "Maleckova M."
                    },
                    {
                        "name": "Olsovska J."
                    }
                ],
                "citationCount": 5,
                "date": "2021-02-22T00:00:00Z",
                "journal": "Analytica Chimica Acta",
                "title": "DeepReI: Deep learning-based gas chromatographic retention index predictor"
            },
            "pmid": "33485586"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}