{
    "accessibility": "Open access",
    "additionDate": "2022-10-01T21:04:29.789731Z",
    "biotoolsCURIE": "biotools:maude_database",
    "biotoolsID": "maude_database",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Avram, Mathew M."
        },
        {
            "name": "Vazirnia, Aria"
        },
        {
            "name": "Wulkan, Adam J."
        }
    ],
    "description": "A Cross-sectional Analysis of the US Food and Drug Administration Manufacturer and User Facility Device Experience Database.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfmaude/search.cfm",
    "lastUpdate": "2024-11-24T15:32:22.628079Z",
    "name": "MAUDE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1097/dss.0000000000003501",
            "metadata": {
                "abstract": "BACKGROUND AND OBJECTIVEThe US FDA mandates that manufacturers and device operators disclose medical device reports (MDRs) to monitor suspected injuries and device malfunctions by submitting information to the Manufacturer and User Facility Device Experience (MAUDE) database. Given the rapid growth in the noninvasive fat and cellulite reduction market, it is essential that physicians be aware of associated adverse events.STUDY DESIGN/MATERIALS AND METHODSUsing the MAUDE electronic database on the FDA website, the authors performed a comprehensive search of reported complications of noninvasive fat reduction and cellulite reduction devices from January 1, 2014 to January 1, 2020 at http://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfmaude/search.cfm. Medical device reports that likely represented medical adverse events from device use were included.RESULTSThe search yielded 165 MDRs, a majority submitted by patients. There were 68 MDRs reported on cryolipolysis (41.2%), 34 MDRs reported on 1,060-nm laser lipolysis (20.6%), 19 MDRs reported on high-intensity focused ultrasound (11.5%), 17 MDRs reported on vacuum-assisted subcision (10.3%), 10 MDRs reported on 1,440-nm laser-assisted subcision (6.1%), 8 MDRs reported on monopolar radiofrequency (4.8%), 6 MDRs reported on focused ultrasound (3.6%), and 4 MDRs reported for a combination infrared light, bipolar radiofrequency energy, massage, and gentle suction treatment (2.4%).CONCLUSIONIt can be safely presumed that most physicians do not regularly report adverse events to the FDA; however, the MAUDE database remains the largest global repository of adverse events reported for noninvasive body contouring devices, an area that has grown tremendously over the last few years. Some MDRs may be unrelated and/or unsubstantiated, and MDRs for any given device must be correlated to the total number of procedures performed. Nevertheless, the MAUDE database allows a glimpse into potential adverse events that can occur. The authors hope that physician awareness of this database and the adverse events it reports will help improve patient safety.",
                "authors": [
                    {
                        "name": "Avram M.M."
                    },
                    {
                        "name": "Vazirnia A."
                    },
                    {
                        "name": "Wulkan A.J."
                    }
                ],
                "citationCount": 3,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Dermatologic Surgery",
                "title": "Complications With Noninvasive Fat and Cellulite Reduction Devices: A Cross-sectional Analysis of the US Food and Drug Administration Manufacturer and User Facility Device Experience Database"
            },
            "pmid": "35778250"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        }
    ],
    "validated": 1
}
