
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/yongchaosoftware/"
        }
    ],
    "documentation": [
        {
            "url": "https://cuda-meme.sourceforge.io/homepage.htm#installation"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/cuda-meme-2-73-mcuda-meme-3-0-12-motif-discovery-software-based-meme.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motif discovery in biological sequences is of prime importance and a major challenge in computational biology. Consequently, numerous motif discovery tools have been developed to date. However, the rapid growth of both genomic sequence and gene transcription data, establishes the need for the development of scalable motif discovery tools. An approach to improve the runtime of motif discovery by an order-of-magnitude without losing sensitivity is to employ emerging many-core architectures such as CUDA-enabled GPUs. In this paper, we present a highly parallel formulation and implementation of the MEME motif discovery algorithm using the CUDA programming model. To achieve high efficiency, we introduce two parallelization approaches: sequence-level and substring-level parallelization. Furthermore, a hybrid computing framework is described to take advantage of both CPU and GPU compute resources. Our performance evaluation on a GeForce GTX 280 GPU, results in average runtime speedups of 21.4 (19.3) for the starting point search and 20.5 (16.4) for the overall runtime using the OOPS (ZOOPS) motif search model. The runtime speedups of CUDA-MEME on a single GPU are also comparable to those of ParaMEME running on 16 CPU cores of a high-performance workstation cluster. In addition to the fast speed, CUDA-MEME has the capability of finding motif instances consistent with the sequential MEME. © 2009 Elsevier B.V. All rights reserved.",
            "authors": [
                "Liu Y.",
                "Schmidt B.",
                "Liu W.",
                "Maskell D.L."
            ],
            "cit_count": 56,
            "doi": "10.1016/j.patrec.2009.10.009",
            "journal": "Pattern Recognition Letters",
            "title": "CUDA-MEME: Accelerating motif discovery in biological sequences using CUDA-enabled graphics processing units",
            "type": "Primary",
            "year": "2010-10-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cuda-meme",
        "biotoolsID": "cuda-meme",
        "description": "Motif discovery software based on MEME algorithm for a single GPU device using CUDA programming model. At present, it only supports the OOPS and ZOOPS models.",
        "homepage": "https://sites.google.com/site/yongchaosoftware/Home/cuda-meme",
        "name": "CUDA-MEME",
        "version": [
            "2.74"
        ]
    }
}