{
    "additionDate": "2021-01-18T09:59:26Z",
    "biotoolsCURIE": "biotools:pfbnet",
    "biotoolsID": "pfbnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shun.guo1@siat.ac.cn",
            "name": "Shun Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "PFBNet: Prior fused boosting method for gene regulatory network inference.\n\nwe present a novel method, namely prior fused boosting network inference method (PFBNet), to infer GRNs from time-series expression data by using the non-linear model of Boosting and the prior information (e.g., the knockout data) fusion scheme. The experiments on the benchmark datasets from DREAM challenge as well as the E.coli datasets show that PFBNet achieves significantly better performance than other state-of-the-art methods (HiDi, iRafNet and BiXGBoost).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ddche/PFBNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T13:40:49Z",
    "name": "PFBNet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03639-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Inferring gene regulatory networks (GRNs) from gene expression data remains a challenge in system biology. In past decade, numerous methods have been developed for the inference of GRNs. It remains a challenge due to the fact that the data is noisy and high dimensional, and there exists a large number of potential interactions. Results: We present a novel method, namely priori-fused boosting network inference method (PFBNet), to infer GRNs from time-series expression data by using the non-linear model of Boosting and the prior information (e.g., the knockout data) fusion scheme. Specifically, PFBNet first calculates the confidences of the regulation relationships using the boosting-based model, where the information about the accumulation impact of the gene expressions at previous time points is taken into account. Then, a newly defined strategy is applied to fuse the information from the prior data by elevating the confidences of the regulation relationships from the corresponding regulators. Conclusions: The experiments on the benchmark datasets from DREAM challenge as well as the E.c o l i datasets show that PFBNet achieves significantly better performance than other state-of-the-art methods (Jump3, GEINE3-lag, HiDi, iRafNet and BiXGBoost).",
                "authors": [
                    {
                        "name": "Che D."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Guo S."
                    },
                    {
                        "name": "Jiang Q."
                    }
                ],
                "date": "2020-07-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PFBNet: A priori-fused boosting method for gene regulatory network inference"
            },
            "pmcid": "PMC7362553",
            "pmid": "32664870"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
