{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T09:01:16.003775Z",
    "biotoolsCURIE": "biotools:alpha-tri",
    "biotoolsID": "alpha-tri",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yu_lab@sdfmu.edu.cn",
            "name": "Changbin Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep neural network for scoring the similarity between predicted and measured spectra improves peptide identification of DIA data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YuAirLab/Alpha-Tri",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2022-06-08T09:01:16.006294Z",
    "license": "Not licensed",
    "name": "Alpha-Tri",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB878",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Peptide identification of data-independent acquisition (DIA) mass spectrometry applying the peptide-centric approach heavily relies on the spectral library matching, such as the fragment intensity similarity. If the intensity similarity is calculated through all possible fragment ions of a targeted peptide instead of just a few fragment ions provided by the spectral library, the matching will be more comprehensive and reliable, and thus the identification will be more confident. In addition, the emergence of high precision spectrum predictors, like Prosit, also makes it possible to capitalize on the predicted spectrum, which contains all possible fragment ion intensities, to calculate the intensity similarity for DIA data. Results: In this work, we propose Alpha-Tri, a neural-network-based model to calculate intensity similarity as a post-processing score using the predicted spectrum, measured spectrum and correlation spectrum (triple-spectrum). The predicted spectrum is generated by Prosit, the measured spectrum is retrieved from the apex of the chromatograms of all possible fragment ions and the correlation spectrum is used to indicate the present probabilities of these fragment ions as the link between the precursor and its fragment ions is lost in DIA. By adopting a data-driven method, Alpha-Tri is able to learn the intensity similarity from the triple-spectrum. This learned value is appended to initial scores from DIA-NN, allowing the ensuing statistical validation tool to report more peptides at the same false discovery rate (FDR). In our evaluation of the HeLa dataset with gradient lengths ranging from 0.5 to 2 h, Alpha-Tri delivered 3.0-7.2% gains in peptide detections at 1% FDR. On LFQbench dataset, a mixed-species dataset with known ratios, Alpha-Tri identified more peptides and proteins fell within the valid ratio ranges by up to 8.6% and 7.6%, respectively, compared with DIA-NN solely.",
                "authors": [
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Yu C."
                    }
                ],
                "date": "2022-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Alpha-Tri: A deep neural network for scoring the similarity between predicted and measured spectra improves peptide identification of DIA data"
            },
            "pmid": "34999750"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
