{
    "accessibility": "Open access",
    "additionDate": "2023-04-20T13:24:47.136692Z",
    "biotoolsCURIE": "biotools:ava-net",
    "biotoolsID": "ava-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Xincheng Yao"
        }
    ],
    "description": "An open-source deep learning network for arterial-venous area segmentation in OCT angiography.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mansour2002/AVA-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:49:34.044723Z",
    "license": "MIT",
    "name": "AVA-Net",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/s43856-023-00287-9",
            "metadata": {
                "abstract": "Background: Differential artery-vein (AV) analysis in optical coherence tomography angiography (OCTA) holds promise for the early detection of eye diseases. However, currently available methods for AV analysis are limited for binary processing of retinal vasculature in OCTA, without quantitative information of vascular perfusion intensity. This study is to develop and validate a method for quantitative AV analysis of vascular perfusion intensity. Method: A deep learning network AVA-Net has been developed for automated AV area (AVA) segmentation in OCTA. Seven new OCTA features, including arterial area (AA), venous area (VA), AVA ratio (AVAR), total perfusion intensity density (T-PID), arterial PID (A-PID), venous PID (V-PID), and arterial-venous PID ratio (AV-PIDR), were extracted and tested for early detection of diabetic retinopathy (DR). Each of these seven features was evaluated for quantitative evaluation of OCTA images from healthy controls, diabetic patients without DR (NoDR), and mild DR. Results: It was observed that the area features, i.e., AA, VA and AVAR, can reveal significant differences between the control and mild DR. Vascular perfusion parameters, including T-PID and A-PID, can differentiate mild DR from control group. AV-PIDR can disclose significant differences among all three groups, i.e., control, NoDR, and mild DR. According to Bonferroni correction, the combination of A-PID and AV-PIDR can reveal significant differences in all three groups. Conclusions: AVA-Net, which is available on GitHub for open access, enables quantitative AV analysis of AV area and vascular perfusion intensity. Comparative analysis revealed AV-PIDR as the most sensitive feature for OCTA detection of early DR. Ensemble AV feature analysis, e.g., the combination of A-PID and AV-PIDR, can further improve the performance for early DR assessment.",
                "authors": [
                    {
                        "name": "Abtahi M."
                    },
                    {
                        "name": "Dadzie A.K."
                    },
                    {
                        "name": "Ebrahimi B."
                    },
                    {
                        "name": "Le D."
                    },
                    {
                        "name": "Lim J.I."
                    },
                    {
                        "name": "Yao X."
                    }
                ],
                "citationCount": 9,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Communications Medicine",
                "title": "An open-source deep learning network AVA-Net for arterial-venous area segmentation in optical coherence tomography angiography"
            },
            "pmcid": "PMC10110614",
            "pmid": "37069396"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
