{"credit":[{"email":"nchandra@biochem.iisc.ernet.in","name":"Nagasuma Chandra","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Transcription factor binding site prediction","uri":"http://edamontology.org/operation_0445"},{"term":"Protein binding site prediction","uri":"http://edamontology.org/operation_2575"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Protein binding sites","uri":"http://edamontology.org/topic_3534"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"},{"term":"DNA binding sites","uri":"http://edamontology.org/topic_3125"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"A computational pipeline PocketAnnotate for functional annotation of proteins at the level of binding sites has been proposed in this study. The pipeline integrates three in-house algorithms for site-based function annotation: PocketDepth, for prediction of binding sites in protein structures; PocketMatch, for rapid comparison of binding sites and PocketAlign, to obtain detailed alignment between pair of binding sites. A novel scheme has been developed to rapidly generate a database of non-redundant binding sites. For a given input protein structure, putative ligand-binding sites are identified, matched in real time against the database and the query substructure aligned with the promising hits, to obtain a set of possible ligands that the given protein could bind to. The input can be either whole protein structures or merely the substructures corresponding to possible binding sites. Structure-based function annotation at the level of binding sites thus achieved could prove very useful for cases where no obvious functional inference can be obtained based purely on sequence or fold-level analyses. An attempt has also been made to analyse proteins of no known function from Protein Data Bank. PocketAnnotate would be a valuable tool for the scientific community and contribute towards structure-based functional inference. The web server can be freely accessed at http://proline.biochem.iisc.ernet.in/pocketannotate/. © 2012 The Author(s).","authors":["Anand P.","Yeturu K.","Chandra N."],"cit_count":14,"journal":"Nucleic Acids Research","pmid":"22618878","title":"PocketAnnotate: Towards site-based function annotation","year":"2012-07-01"}],"summary":{"biotoolsCURIE":"biotools:pocketannotate","biotoolsID":"pocketannotate","description":"PocketAnnotate performs binding site level annotation of query proteins.","homepage":"http://proline.biochem.iisc.ernet.in/pocketannotate/","name":"PocketAnnotate"}}