{
    "additionDate": "2021-01-18T07:09:54Z",
    "biotoolsCURIE": "biotools:falco-rna",
    "biotoolsID": "falco-rna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jwkho@hku.hk",
            "name": "Joshua W. K. Ho",
            "orcidid": "https://orcid.org/0000-0003-2331-7011",
            "typeEntity": "Person"
        }
    ],
    "description": "Falco is a quick and flexible single-cell RNA-seq processing framework on the cloud. Falco is a software bundle that enables bioinformatic analysis of large-scale transcriptomic data by utilising public cloud infrastructure. The framework currently provide supports for single cell RNA feature quantification, alignment and transcript assembly analyses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VCCRI/Falco",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-10T19:34:53Z",
    "name": "Falco",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6341-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Read alignment and transcript assembly are the core of RNA-seq analysis for transcript isoform discovery. Nonetheless, current tools are not designed to be scalable for analysis of full-length bulk or single cell RNA-seq (scRNA-seq) data. The previous version of our cloud-based tool Falco only focuses on RNA-seq read counting, but does not allow for more flexible steps such as alignment and read assembly. Results: The Falco framework can harness the parallel and distributed computing environment in modern cloud platforms to accelerate read alignment and transcript assembly of full-length bulk RNA-seq and scRNA-seq data. There are two new modes in Falco: alignment-only and transcript assembly. In the alignment-only mode, Falco can speed up the alignment process by 2.5-16.4x based on two public scRNA-seq datasets when compared to alignment on a highly optimised standalone computer. Furthermore, it also provides a 10x average speed-up compared to alignment using published cloud-enabled tool for read alignment, Rail-RNA. In the transcript assembly mode, Falco can speed up the transcript assembly process by 1.7-16.5x compared to performing transcript assembly on a highly optimised computer. Conclusion: Falco is a significantly updated open source big data processing framework that enables scalable and accelerated alignment and assembly of full-length scRNA-seq data on the cloud. The source code can be found at https://github.com/VCCRI/Falco.",
                "authors": [
                    {
                        "name": "Ho J.W.K."
                    },
                    {
                        "name": "Kishore A."
                    },
                    {
                        "name": "Phipps B."
                    },
                    {
                        "name": "Yang A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Cloud accelerated alignment and assembly of full-length single-cell RNA-seq data using Falco"
            },
            "pmcid": "PMC6936136",
            "pmid": "31888474"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
