{
    "additionDate": "2018-06-30T17:15:41Z",
    "biotoolsCURIE": "biotools:mgmapper",
    "biotoolsID": "mgmapper",
    "credit": [
        {
            "email": "tnp@cbs.dtu.dk",
            "name": "Thomas Nordahl Petersen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "thomas@cbs.dtu.dk",
            "name": "Thomas Sicheritz-Pontén",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Reference based mapping and taxonomy annotation of metagenomics sequence reads.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cge.cbs.dtu.dk/services/MGmapper/instructions.php"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://cge.cbs.dtu.dk/services/MGmapper/output.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://cge.cbs.dtu.dk/services/MGmapper/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "MGmapper",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0176469",
            "metadata": {
                "abstract": "© 2017 Petersen et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.An increasing amount of species and gene identification studies rely on the use of next generation sequence analysis of either single isolate or metagenomics samples. Several methods are available to perform taxonomic annotations and a previous metagenomics benchmark study has shown that a vast number of false positive species annotations are a problem unless thresholds or post-processing are applied to differentiate between correct and false annotations. MGmapper is a package to process raw next generation sequence data and perform reference based sequence assignment, followed by a post-processing analysis to produce reliable taxonomy annotation at species and strain level resolution. An in-vitro bacterial mock community sample comprised of 8 genuses, 11 species and 12 strains was previously used to benchmark metagenomics classification methods. After applying a post-processing filter, we obtained 100% correct taxonomy assignments at species and genus level. A sensitivity and precision at 75% was obtained for strain level annotations. A comparison between MGmapper and Kraken at species level, shows MGmapper assigns taxonomy at species level using 84.8% of the sequence reads, compared to 70.5% for Kraken and both methods identified all species with no false positives. Extensive read count statistics are provided in plain text and excel sheets for both rejected and accepted taxonomy annotations. The use of custom databases is possible for the command-line version of MGmapper, and the complete pipeline is freely available as a bitbucked package (https://bitbucket.org/genomicepidemiology/mgmapper). A web-version (https://cge.cbs. dtu.dk/services/MGmapper) provides the basic functionality for analysis of small fastq datasets.",
                "authors": [
                    {
                        "name": "Petersen T.N."
                    },
                    {
                        "name": "Lukjancenko O."
                    },
                    {
                        "name": "Thomsen M.C.F."
                    },
                    {
                        "name": "Sperotto M.M."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Aarestrup F.M."
                    },
                    {
                        "name": "Sicheritz-Ponten T."
                    }
                ],
                "citationCount": 35,
                "date": "2017-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "MGmapper: Reference based mapping and taxonomy annotation of metagenomics sequence reads"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}