{
    "accessibility": "Open access",
    "additionDate": "2023-02-20T17:03:25.001529Z",
    "biotoolsCURIE": "biotools:emati",
    "biotoolsID": "emati",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "michael.schroeder@tu-dresden.de",
            "name": "Michael Schroeder",
            "orcidid": "https://orcid.org/0000-0003-2848-6949",
            "typeEntity": "Person"
        }
    ],
    "description": "A recommender system for biomedical literature based on supervised learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://emati.biotec.tu-dresden.de",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2023-02-20T17:03:25.004261Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bioinfcollab/emati"
        }
    ],
    "name": "Emati",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC104",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press.The scientific literature continues to grow at an ever-increasing rate. Considering that thousands of new articles are published every week, it is obvious how challenging it is to keep up with newly published literature on a regular basis. Using a recommender system that improves the user experience in the online environment can be a solution to this problem. In the present study, we aimed to develop a web-based article recommender service, called Emati. Since the data are text-based by nature and we wanted our system to be independent of the number of users, a content-based approach has been adopted in this study. A supervised machine learning model has been proposed to generate article recommendations. Two different supervised learning approaches, namely the naïve Bayes model with Term Frequency-Inverse Document Frequency (TF-IDF) vectorizer and the state-of-The-Art language model bidirectional encoder representations from transformers (BERT), have been implemented. In the first one, a list of documents is converted into TF-IDF-weighted features and fed into a classifier to distinguish relevant articles from irrelevant ones. Multinomial naïve Bayes algorithm is used as a classifier since, along with the class label, it also gives the probability that the input belongs to this class. The second approach is based on fine-Tuning the pretrained state-of-The-Art language model BERT for the text classification task. Emati provides a weekly updated list of article recommendations and presents it to the user, sorted by probability scores. New article recommendations are also sent to users' email addresses on a weekly basis. Additionally, Emati has a personalized search feature to search online services' (such as PubMed and arXiv) content and have the results sorted by the user's classifier. Database URL: https://emati.biotec.tu-dresden.de",
                "authors": [
                    {
                        "name": "Kart O."
                    },
                    {
                        "name": "Kwasnicki R."
                    },
                    {
                        "name": "Lachmann K."
                    },
                    {
                        "name": "Mestiashvili A."
                    },
                    {
                        "name": "Schroeder M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Emati: A recommender system for biomedical literature based on supervised learning"
            },
            "pmcid": "PMC9732843",
            "pmid": "36484479"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
