{
    "accessibility": "Open access",
    "additionDate": "2023-02-07T23:51:52.854041Z",
    "biotoolsCURIE": "biotools:mlago",
    "biotoolsID": "mlago",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kmaeda@bio.kyutech.ac.jp",
            "name": "Kazuhiro Maeda",
            "typeEntity": "Person"
        },
        {
            "name": "Aoi Hatae"
        },
        {
            "name": "Fred C. Boogerd"
        },
        {
            "name": "Hiroyuki Kurata"
        },
        {
            "name": "Yukie Sakai"
        }
    ],
    "description": "Machine learning-aided global optimization for Michaelis constant estimation of kinetic modeling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/view/kazuhiro-maeda/software-tools-web-apps",
    "language": [
        "C",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2023-02-07T23:51:52.857355Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kmaeda16/MLAGO-data"
        }
    ],
    "name": "MLAGO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05009-X",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Kinetic modeling is a powerful tool for understanding the dynamic behavior of biochemical systems. For kinetic modeling, determination of a number of kinetic parameters, such as the Michaelis constant (Km), is necessary, and global optimization algorithms have long been used for parameter estimation. However, the conventional global optimization approach has three problems: (i) It is computationally demanding. (ii) It often yields unrealistic parameter values because it simply seeks a better model fitting to experimentally observed behaviors. (iii) It has difficulty in identifying a unique solution because multiple parameter sets can allow a kinetic model to fit experimental data equally well (the non-identifiability problem). Results: To solve these problems, we propose the Machine Learning-Aided Global Optimization (MLAGO) method for Km estimation of kinetic modeling. First, we use a machine learning-based Km predictor based only on three factors: EC number, KEGG Compound ID, and Organism ID, then conduct a constrained global optimization-based parameter estimation by using the machine learning-predicted Km values as the reference values. The machine learning model achieved relatively good prediction scores: RMSE = 0.795 and R2 = 0.536, making the subsequent global optimization easy and practical. The MLAGO approach reduced the error between simulation and experimental data while keeping Km values close to the machine learning-predicted values. As a result, the MLAGO approach successfully estimated Km values with less computational cost than the conventional method. Moreover, the MLAGO approach uniquely estimated Km values, which were close to the measured values. Conclusions: MLAGO overcomes the major problems in parameter estimation, accelerates kinetic modeling, and thus ultimately leads to better understanding of complex cellular systems. The web application for our machine learning-based Km predictor is accessible at https://sites.google.com/view/kazuhiro-maeda/software-tools-web-apps, which helps modelers perform MLAGO on their own parameter estimation tasks.",
                "authors": [
                    {
                        "name": "Boogerd F.C."
                    },
                    {
                        "name": "Hatae A."
                    },
                    {
                        "name": "Kurata H."
                    },
                    {
                        "name": "Maeda K."
                    },
                    {
                        "name": "Sakai Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MLAGO: machine learning-aided global optimization for Michaelis constant estimation of kinetic modeling"
            },
            "pmcid": "PMC9624028",
            "pmid": "36319952"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
