
{
    "credit": [
        {
            "email": "mdwilkerson@outlook.com",
            "name": "Matt Wilkerson",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/mwilkers/unceqr/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "R",
            "Perl"
        ],
        "license": "MIT",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "link": [
        {
            "type": "SOCIAL_MEDIA",
            "url": "https://github.com/mwilkers/unceqr"
        },
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/mwilkers/unceqr/issues"
        }
    ],
    "publication": [
        {
            "abstract": "Identifying somatic mutations is critical for cancer genome characterization and for prioritizing patient treatment. DNA whole exome sequencing (DNA-WES) is currently the most popular technology; however, this yields low sensitivity in low purity tumors. RNA sequencing (RNA-seq) covers the expressed exome with depth proportional to expression. We hypothesized that integrating DNA-WES and RNA-seq would enable superior mutation detection versus DNA-WES alone. We developed a first-of-its-kind method, called UNCeqR, that detects somatic mutations by integrating patient-matched RNA-seq and DNA-WES. In simulation, the integrated DNA and RNA model outperformed the DNA-WES only model. Validation by patient-matched whole genome sequencing demonstrated superior performance of the integrated model over DNA-WES only models, including a published method and published mutation profiles. Genome-wide mutational analysis of breast and lung cancer cohorts (n = 871) revealed remarkable tumor genomics properties. Low purity tumors experienced the largest gains in mutation detection by integrating RNA-seq and DNA-WES. RNA provided greater mutation signal than DNA in expressed mutations. Compared to earlier studies on this cohort, UNCeqR increased mutation rates of driver and therapeutically targeted genes (e.g. PIK3CA, ERBB2 and FGFR2). In summary, integrating RNA-seq with DNA-WES increases mutation detection performance, especially for low purity tumors. © 2014 The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.",
            "authors": [
                "Wilkerson M.D.",
                "Cabanski C.R.",
                "Sun W.",
                "Hoadley K.A.",
                "Walter V.",
                "Mose L.E.",
                "Troester M.A.",
                "Hammerman P.S.",
                "Parker J.S.",
                "Perou C.M.",
                "Hayes D.N."
            ],
            "cit_count": 42,
            "doi": "10.1093/nar/gku489",
            "journal": "Nucleic Acids Research",
            "title": "Integrated RNA and DNA sequencing improves mutation detection in low purity tumors",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:UNCeqR",
        "biotoolsID": "UNCeqR",
        "description": "Method and associated software for discovering somatic mutations using the integration of DNA and RNA sequencing.",
        "homepage": "https://lbc.unc.edu/~mwilkers/unceqr_dist/",
        "name": "UNCeqR"
    }
}