{
    "accessibility": "Open access",
    "additionDate": "2023-11-30T14:45:56.326488Z",
    "biotoolsCURIE": "biotools:nafld",
    "biotoolsID": "nafld",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xufengxh19@163.com",
            "name": "Feng Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of disease-related genes and construction of a gene co-expression database in non-alcoholic fatty liver disease.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Locus ID (EntrezGene)",
                        "uri": "http://edamontology.org/data_1904"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://nafld.shinyapps.io/shiny/",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-11-30T14:45:56.328933Z",
    "name": "NAFLD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2023.1070605",
            "metadata": {
                "abstract": "Background: The mechanism of NAFLD progression remains incompletely understood. Current gene-centric analysis methods lack reproducibility in transcriptomic studies. Methods: A compendium of NAFLD tissue transcriptome datasets was analyzed. Gene co-expression modules were identified in the RNA-seq dataset GSE135251. Module genes were analyzed in the R gProfiler package for functional annotation. Module stability was assessed by sampling. Module reproducibility was analyzed by the ModulePreservation function in the WGCNA package. Analysis of variance (ANOVA) and Student’s t-test was used to identify differential modules. The receiver operating characteristic (ROC) curve was used to illustrate the classification performance of modules. Connectivity Map was used to mine potential drugs for NAFLD treatment. Results: Sixteen gene co-expression modules were identified in NAFLD. These modules were associated with multiple functions such as nucleus, translation, transcription factors, vesicle, immune response, mitochondrion, collagen, and sterol biosynthesis. These modules were stable and reproducible in the other 10 datasets. Two modules were positively associated with steatosis and fibrosis and were differentially expressed between non-alcoholic steatohepatitis (NASH) and non-alcoholic fatty liver (NAFL). Three modules can efficiently separate control and NAFL. Four modules can separate NAFL and NASH. Two endoplasmic reticulum related modules were both upregulated in NAFL and NASH compared to normal control. Proportions of fibroblasts and M1 macrophages are positively correlated with fibrosis. Two hub genes Aebp1 and Fdft1 may play important roles in fibrosis and steatosis. m6A genes were strongly correlated with the expression of modules. Eight candidate drugs for NAFLD treatment were proposed. Finally, an easy-to-use NAFLD gene co-expression database was developed (available at https://nafld.shinyapps.io/shiny/). Conclusion: Two gene modules show good performance in stratifying NAFLD patients. The modules and hub genes may provide targets for disease treatment.",
                "authors": [
                    {
                        "name": "Chen D."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Luo W."
                    },
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Su M."
                    },
                    {
                        "name": "Sun M."
                    },
                    {
                        "name": "Xu F."
                    },
                    {
                        "name": "Ye H."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Identification of disease-related genes and construction of a gene co-expression database in non-alcoholic fatty liver disease"
            },
            "pmcid": "PMC10083285",
            "pmid": "37051599",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
