{"credit":[],"function":[{"operation":[{"term":"Anonymisation","uri":"http://edamontology.org/operation_3283"}]}],"labels":{"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"© 2019 Thieme Medical Publishers, Inc.. All rights reserved.Introduction and aims â,Nonalcoholic fatty liver disease (NAFLD) is increasing globally with an estimated prevalence of approximately 25âŠ%. Nonalcoholic steatohepatitis as the progressive disease entity often leads to fibrosis and end-stage disease. The magnitude of NAFLD patients are not diagnosed and have no access to further clinical assessment. Diagnostic pathways for individual risk evaluation fitting with available resources are of utmost importance in real-world clinical practice. Methods â,Retrospective analysis of 1346 anonymized outpatient datasets at Würzburg University Hospital, Germany. Transient elastography (TE) with controlled attenuation parameter and laboratory-based risk scores (NFS, FIB-4) were the main diagnostic workup tools for risk stratification. Results â,After preselection based on questionnaire information NAFLD still accounts for one-fifth of patients in the liver outpatient service. More than 80âŠ% of NAFLD patients receive their first-time diagnosis in our unit. Laboratory-based risk scores and TE are valuable tools for second-step risk assessment as shown in our clinical data analysis. Moreover, 65âŠ% of NAFLD patients use inpatient services for at least 1 day. The policy to perform liver biopsy in high-risk patients above the recommended threshold of 9.6 kPa if any clinical doubt exists regarding the diagnosis of cirrhosis leads to a histological down staging in almost 80âŠ%. Conclusion â,Questionnaire-based referral from primary care followed by broadly available fast-track TE and eventually liver biopsy for selected patients is the standard practice in our unit. This approach represents a feasible model to handle the large gap between availability and clinical need for TE facilities.","authors":["Alsenbesy M.","Alsenbesy M.","Rau M.","Weiss J.","Gotze O.","Geier A."],"cit_count":0,"doi":"10.1055/A-0981-6484","journal":"Zeitschrift fur Gastroenterologie","pmid":"31610584","title":"A 2-step fast-track elastometry service for advanced workup of nonalcoholic fatty liver disease (NAFLD) patients-single-center real-world experience of outpatient clinical practice","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:NAFLD","biotoolsID":"NAFLD","description":"A 2-step fast-track elastometry service for advanced workup of nonalcoholic fatty liver disease (NAFLD) patients.\n\nINTRODUCTION AND AIMS: Nonalcoholic fatty liver disease (NAFLD) is increasing globally with an estimated prevalence of approximately 25 %. Nonalcoholic steatohepatitis as the progressive disease entity often leads to fibrosis and end-stage disease. The magnitude of NAFLD patients are not diagnosed and have no access to further clinical assessment. Diagnostic pathways for individual risk evaluation fitting with available resources are of utmost importance in real-world clinical practice. METHODS: Retrospective analysis of 1346 anonymized outpatient datasets at Würzburg University Hospital, Germany. Transient elastography (TE) with controlled attenuation parameter and laboratory-based risk scores (NFS, FIB-4) were the main diagnostic workup tools for risk stratification.\n\n||| HOMEPAGE MISSING!","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31610584","name":"NAFLD"}}