{
    "additionDate": "2017-12-18T00:15:26Z",
    "biotoolsCURIE": "biotools:plotibd",
    "biotoolsID": "plotibd",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://faculty.washington.edu/wijsman/"
        }
    ],
    "description": "plotIBD is a perl script to assist with plotting sampled inheritance vectors in pedigrees",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/pubmed/22189471"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://faculty.washington.edu/wijsman/software.shtml",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-30T16:36:29Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/plotibd-plotting-sampled-inheritance-vectors-in-pedigrees.html"
        }
    ],
    "name": "plotIBD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1159/000334083",
            "metadata": {
                "abstract": "Linkage analysis identifies markers that appear to be co-inherited with a trait within pedigrees. The inheritance of a chromosomal segment may be probabilistically reconstructed, with missing data complicating inference. Inheritance patterns are further obscured in the analysis of complex traits, where variants in one or more genes may contribute to phenotypic variation within a pedigree. In this case, determining which relatives share a trait variant is not simple. We describe how to represent these patterns of inheritance for marker loci. We summarize how to sample patterns of inheritance consistent with genotypic and pedigree data using gl-auto, available in MORGAN v3.0. We describe identification of classes of equivalent inheritance patterns with the program IBDgraph. We finally provide an example of how these programs may be used to simplify interpretation of linkage analysis of complex traits in general pedigrees. We borrow information across loci in a parametric linkage analysis of a large pedigree. We explore the contribution of each equivalence class to a linkage signal, illustrate estimated patterns of identity-by-descent sharing, and identify a haplotype tagging the chromosomal segment driving the linkage signal. Haplotype carriers are more likely to share the linked trait variant, and can be prioritized for subsequent DNA sequencing. Copyright © 2011 S. Karger AG, Basel.",
                "authors": [
                    {
                        "name": "Marchani E.E."
                    },
                    {
                        "name": "Wijsman E.M."
                    }
                ],
                "citationCount": 6,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Human Heredity",
                "title": "Estimation and visualization of identity-by-descent within pedigrees simplifies interpretation of complex trait analysis"
            },
            "pmcid": "PMC3267995",
            "pmid": "22189471",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "20111108"
    ]
}