{
    "additionDate": "2017-01-13T13:16:44Z",
    "biotoolsCURIE": "biotools:strelka",
    "biotoolsID": "strelka",
    "credit": [
        {
            "email": "csaunders@illumina.com",
            "name": "Christopher T. Saunders",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Strelka is an analysis package designed to detect somatic SNVs and small indels from the aligned sequencing reads of matched tumor-normal samples.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bansal-lab.github.io/software/crisp.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/strelkasomaticvariantcaller/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "maturity": "Mature",
    "name": "Strelka",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Whole genome and exome sequencing of matched tumor-normal sample pairs is becoming routine in cancer research. The consequent increased demand for somatic variant analysis of paired samples requires methods specialized to model this problem so as to sensitively call variants at any practical level of tumor impurity.Results: We describe Strelka, a method for somatic SNV and small indel detection from sequencing data of matched tumor-normal samples. The method uses a novel Bayesian approach which represents continuous allele frequencies for both tumor and normal samples, while leveraging the expected genotype structure of the normal. This is achieved by representing the normal sample as a mixture of germline variation with noise, and representing the tumor sample as a mixture of the normal sample with somatic variation. A natural consequence of the model structure is that sensitivity can be maintained at high tumor impurity without requiring purity estimates. We demonstrate that the method has superior accuracy and sensitivity on impure samples compared with approaches based on either diploid genotype likelihoods or general allele-frequency tests. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Saunders C.T."
                    },
                    {
                        "name": "Wong W.S.W."
                    },
                    {
                        "name": "Swamy S."
                    },
                    {
                        "name": "Becq J."
                    },
                    {
                        "name": "Murray L.J."
                    },
                    {
                        "name": "Cheetham R.K."
                    }
                ],
                "citationCount": 451,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Strelka: Accurate somatic small-variant calling from sequenced tumor-normal sample pairs"
            },
            "pmid": "22581179"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}