{
    "additionDate": "2021-09-08T16:27:20Z",
    "biotoolsCURIE": "biotools:dsprint",
    "biotoolsID": "dsprint",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mona@cs.princeton.edu",
            "name": "Mona Singh",
            "orcidid": "https://orcid.org/0000-0001-8271-6026",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "dSPRINT is a machine learning framework for predicting DNA, RNA, ion, peptide and small molecule interaction sites within protein domains. The predictor can run on any human Pfam protein domain, and return per-position predictions of interaction-sites for five different ligand types: DNA, RNA, ion, peptide, and small molecule.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Ligand-binding site prediction",
                    "uri": "http://edamontology.org/operation_3897"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "http://protdomain.princeton.edu/dsprint",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:19:33.004350Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/Singh-Lab/dSPRINT"
        }
    ],
    "name": "dSPRINT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nar/gkab356",
            "metadata": {
                "abstract": "Domains are instrumental in facilitating protein interactions with DNA, RNA, small molecules, ions and peptides. Identifying ligand-binding domains within sequences is a critical step in protein function annotation, and the ligand-binding properties of proteins are frequently analyzed based upon whether they contain one of these domains. To date, however, knowledge of whether and how protein domains interact with ligands has been limited to domains that have been observed in co-crystal structures; this leaves approximately two-thirds of human protein domain families uncharacterized with respect to whether and how they bind DNA, RNA, small molecules, ions and peptides. To fill this gap, we introduce dSPRINT, a novel ensemble machine learning method for predicting whether a domain binds DNA, RNA, small molecules, ions or peptides, along with the positions within it that participate in these types of interactions. In stringent cross-validation testing, we demonstrate that dSPRINT has an excellent performance in uncovering ligand-binding positions and domains. We also apply dSPRINT to newly characterize the molecular functions of domains of unknown function. dSPRINT's predictions can be transferred from domains to sequences, enabling predictions about the ligand-binding properties of 95% of human genes. The dSPRINT framework and its predictions for 6503 human protein domains are freely available at http://protdomain.princeton.edu/dsprint.",
                "authors": [
                    {
                        "name": "Etzion-Fuchs A."
                    },
                    {
                        "name": "Singh M."
                    },
                    {
                        "name": "Todd D.A."
                    }
                ],
                "citationCount": 5,
                "date": "2021-07-21T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DSPRINT: Predicting DNA, RNA, ion, peptide and small molecule interaction sites within protein domains"
            },
            "pmcid": "PMC8287948",
            "pmid": "33999210",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
