{
    "accessibility": "Open access",
    "additionDate": "2022-11-03T19:19:11.833450Z",
    "biotoolsCURIE": "biotools:ressumo",
    "biotoolsID": "ressumo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leili@qdu.edu.cn",
            "name": "Lei Li",
            "typeEntity": "Person"
        },
        {
            "name": "Yafei Zhu"
        },
        {
            "name": "Yu Chen"
        },
        {
            "name": "Yuhai Liu"
        }
    ],
    "description": "ResSUMO is a web server that could predict lysine sumoylation sites prediction. It takes protein sequence data as input and uses ZScale encoding scheme and One-Dimensional Convolutional Convolutional Neural Network (1-D CNN) based on residual structure.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://bioinfogo.org/ResSUMO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-11-03T19:19:11.836314Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zhuyaf521/ResSUMO"
        }
    ],
    "name": "ResSUMO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/CELLS11172646",
            "metadata": {
                "abstract": "© 2022 by the authors.Lysine SUMOylation plays an essential role in various biological functions. Several approaches integrating various algorithms have been developed for predicting SUMOylation sites based on a limited dataset. Recently, the number of identified SUMOylation sites has significantly increased due to investigation at the proteomics scale. We collected modification data and found the reported approaches had poor performance using our collected data. Therefore, it is essential to explore the characteristics of this modification and construct prediction models with improved performance based on an enlarged dataset. In this study, we constructed and compared 16 classifiers by integrating four different algorithms and four encoding features selected from 11 sequence-based or physicochemical features. We found that the convolution neural network (CNN) model integrated with residue structure, dubbed ResSUMO, performed favorably when compared with the traditional machine learning and CNN models in both cross-validation and independent tests. The area under the receiver operating characteristic (ROC) curve for ResSUMO was around 0.80, superior to that of the reported predictors. We also found that increasing the depth of neural networks in the CNN models did not improve prediction performance due to the degradation problem, but the residual structure could be included to optimize the neural networks and improve performance. This indicates that residual neural networks have the potential to be broadly applied in the prediction of other types of modification sites with great effectiveness and robustness. Furthermore, the online ResSUMO service is freely accessible.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Cells",
                "title": "ResSUMO: A Deep Learning Architecture Based on Residual Structure for Prediction of Lysine SUMOylation Sites"
            },
            "pmcid": "PMC9454673",
            "pmid": "36078053"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
