{
    "accessibility": "Open access",
    "additionDate": "2023-03-20T09:02:00.002758Z",
    "biotoolsCURIE": "biotools:grenadine",
    "biotoolsID": "grenadine",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sergio.peignier@insa-lyon.fr",
            "name": "Sergio Peignier",
            "orcidid": "https://orcid.org/0000-0002-9004-3033",
            "typeEntity": "Person"
        }
    ],
    "description": "A Data-Driven Python Library to Infer Gene Regulatory Networks from Gene Expression Data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://grenadine.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/bf2i/grenadine",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:52:42.250607Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/GReNaDIne/"
        }
    ],
    "name": "GReNaDIne",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/genes14020269",
            "metadata": {
                "abstract": "Context: Inferring gene regulatory networks (GRN) from high-throughput gene expression data is a challenging task for which different strategies have been developed. Nevertheless, no ever-winning method exists, and each method has its advantages, intrinsic biases, and application domains. Thus, in order to analyze a dataset, users should be able to test different techniques and choose the most appropriate one. This step can be particularly difficult and time consuming, since most methods’ implementations are made available independently, possibly in different programming languages. The implementation of an open-source library containing different inference methods within a common framework is expected to be a valuable toolkit for the systems biology community. Results: In this work, we introduce GReNaDIne (Gene Regulatory Network Data-driven Inference), a Python package that implements 18 machine learning data-driven gene regulatory network inference methods. It also includes eight generalist preprocessing techniques, suitable for both RNA-seq and microarray dataset analysis, as well as four normalization techniques dedicated to RNA-seq. In addition, this package implements the possibility to combine the results of different inference tools to form robust and efficient ensembles. This package has been successfully assessed under the DREAM5 challenge benchmark dataset. The open-source GReNaDIne Python package is made freely available in a dedicated GitLab repository, as well as in the official third-party software repository PyPI Python Package Index. The latest documentation on the GReNaDIne library is also available at Read the Docs, an open-source software documentation hosting platform. Contribution: The GReNaDIne tool represents a technological contribution to the field of systems biology. This package can be used to infer gene regulatory networks from high-throughput gene expression data using different algorithms within the same framework. In order to analyze their datasets, users can apply a battery of preprocessing and postprocessing tools and choose the most adapted inference method from the GReNaDIne library and even combine the output of different methods to obtain more robust results. The results format provided by GReNaDIne is compatible with well-known complementary refinement tools such as PYSCENIC.",
                "authors": [
                    {
                        "name": "Calevro F."
                    },
                    {
                        "name": "Froute T."
                    },
                    {
                        "name": "Parisot N."
                    },
                    {
                        "name": "Peignier S."
                    },
                    {
                        "name": "Schmitt P."
                    },
                    {
                        "name": "Sorin B."
                    }
                ],
                "citationCount": 6,
                "date": "2023-02-01T00:00:00Z",
                "journal": "Genes",
                "title": "GReNaDIne: A Data-Driven Python Library to Infer Gene Regulatory Networks from Gene Expression Data"
            },
            "pmcid": "PMC9957546",
            "pmid": "36833196"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
