{
    "additionDate": "2018-05-23T15:26:26Z",
    "biotoolsCURIE": "biotools:cfinder",
    "biotoolsID": "cfinder",
    "credit": [
        {
            "email": "norbert.niklas@o.roteskreuz.at",
            "name": "Norbert Niklas",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Definition and quantification of multiple haplotypes in a mixed sample.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/cfinder/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/cfinder/",
    "language": [
        "C#"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "CC-BY-4.0",
    "name": "cFinder",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S13104-015-1382-7",
            "metadata": {
                "abstract": "© 2015 Niklas et al.Background: Next-generation sequencing allows for determining the genetic composition of a mixed sample. For instance, when performing resistance testing for BCR-ABL1 it is necessary to identify clones and define compound mutations; together with an exact quantification this may complement diagnosis and therapy decisions with additional information. Moreover, that applies not only to oncological issues but also determination of viral, bacterial or fungal infection. The efforts to retrieve multiple haplotypes (more than two) and proportion information from data with conventional software are difficult, cumbersome and demand multiple manual steps. Results: Therefore, we developed a tool called cFinder that is capable of automatic detection of haplotypes and their accurate quantification within one sample. BCR-ABL1 samples containing multiple clones were used for testing and our cFinder could identify all previously found clones together with their abundance and even refine some results. Additionally, reads were simulated using GemSIM with multiple haplotypes, the detection was very close to linear (R2 = 0.96). Our aim is not to deduce haploblocks over statistics, but to characterize one sample's composition precisely. As a result the cFinder reports the connections of variants (haplotypes) with their readcount and relative occurrence (percentage). Download is available at http://sourceforge.net/projects/cfinder/. Conclusions: Our cFinder is implemented in an efficient algorithm that can be run on a low-performance desktop computer. Furthermore, it considers paired-end information (if available) and is generally open for any current next-generation sequencing technology and alignment strategy. To our knowledge, this is the first software that enables researchers without extensive bioinformatic support to designate multiple haplotypes and how they constitute to a sample.",
                "authors": [
                    {
                        "name": "Niklas N."
                    },
                    {
                        "name": "Hafenscher J."
                    },
                    {
                        "name": "Barna A."
                    },
                    {
                        "name": "Wiesinger K."
                    },
                    {
                        "name": "Proll J."
                    },
                    {
                        "name": "Dreiseitl S."
                    },
                    {
                        "name": "Preuner-Stix S."
                    },
                    {
                        "name": "Valent P."
                    },
                    {
                        "name": "Lion T."
                    },
                    {
                        "name": "Gabriel C."
                    }
                ],
                "citationCount": 5,
                "date": "2015-09-07T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "CFinder: Definition and quantification of multiple haplotypes in a mixed sample"
            },
            "pmcid": "PMC4562109",
            "pmid": "26346608"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1
}