{
    "additionDate": "2021-01-18T07:02:15Z",
    "biotoolsCURIE": "biotools:netnmf-sc",
    "biotoolsID": "netnmf-sc",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Bianca Dumitrascu",
            "orcidid": "https://orcid.org/0000-0001-8328-2354",
            "typeEntity": "Person"
        },
        {
            "name": "Barbara E. Engelhardt",
            "orcidid": "https://orcid.org/0000-0002-6139-7334",
            "typeEntity": "Person"
        }
    ],
    "description": "Leveraging gene-gene interactions for imputation and dimensionality reduction in single-cell expression analysis.\n\n.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/raphael-group/netNMF-sc",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T13:44:04Z",
    "license": "BSD-3-Clause",
    "name": "netNMF-sc",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1101/GR.251603.119",
            "metadata": {
                "abstract": "© 2020 Elyanow et al. This article is distributed exclusively by Cold Spring Harbor Laboratory Press for the first six months after the full-issue publication date (see http://genome.cshlp.org/site/misc/terms.xhtml). After six months, it is available under a Creative Commons License (Attribution-NonCommercial 4.0 International), as described at http://creativecommons.org/licenses/by-nc/4.0/.Single-cell RNA-sequencing (scRNA-seq) enables high-throughput measurement of RNA expression in single cells. However, because of technical limitations, scRNA-seq data often contain zero counts for many transcripts in individual cells. These zero counts, or dropout events, complicate the analysis of scRNA-seq data using standard methods developed for bulk RNA-seq data. Current scRNA-seq analysis methods typically overcome dropout by combining information across cells in a lower-dimensional space, leveraging the observation that cells generally occupy a small number of RNA expression states. We introduce netNMF-sc, an algorithm for scRNA-seq analysis that leverages information across both cells and genes. netNMF-sc learns a low-dimensional representation of scRNA-seq transcript counts using network-regularized non-negative matrix factorization. The network regularization takes advantage of prior knowledge of gene-gene interactions, encouraging pairs of genes with known interactions to be nearby each other in the low-dimensional representation. The resulting matrix factorization imputes gene abundance for both zero and nonzero counts and can be used to cluster cells into meaningful subpopulations. We show that netNMF-sc outperforms existing methods at clustering cells and estimating gene-gene covariance using both simulated and real scRNA-seq data, with increasing advantages at higher dropout rates (e.g., >60%). We also show that the results from netNMF-sc are robust to variation in the input network, with more representative networks leading to greater performance gains.",
                "authors": [
                    {
                        "name": "Elyanow R."
                    },
                    {
                        "name": "Dumitrascu B."
                    },
                    {
                        "name": "Engelhardt B.E."
                    },
                    {
                        "name": "Raphael B.J."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "NetNMF-SC: Leveraging gene-gene interactions for imputation and dimensionality reduction in single-cell expression analysis"
            },
            "pmcid": "PMC7050525",
            "pmid": "31992614"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}