{
    "additionDate": "2021-03-19T08:50:15Z",
    "biotoolsCURIE": "biotools:pine-cone",
    "biotoolsID": "pine-cone",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "david.brafman@asu.edu",
            "name": "David A. Brafman",
            "typeEntity": "Person"
        },
        {
            "email": "xiaowang@asu.edu",
            "name": "Xiao Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Prime Editing Guide RNA Design Automation Using PINE-CONE.\n\nCRISPR-based technologies are paramount in genome engineering and synthetic biology. Prime editing (PE) is a technology capable of installing genomic edits without double-stranded DNA breaks (DSBs) or donor DNA. Prime editing guide RNAs (pegRNAs) simultaneously encode both guide and edit template sequences. They are more design intensive than CRISPR single guide RNAs (sgRNAs). As such, application of PE technology is hindered by the limited throughput of manual pegRNA design. To that end, we designed a software tool, Prime Induced Nucleotide Engineering Creator of New Edits (PINE-CONE), that enables high-throughput automated design of pegRNAs and prime editing strategies. PINE-CONE translates edit coordinates and sequences into pegRNA designs, accessory guides, and oligonucleotides for facile cloning workflows",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xiaowanglab/PINE-CONE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-28T12:08:31Z",
    "name": "PINE-CONE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACSSYNBIO.0C00445",
            "metadata": {
                "abstract": "© CRISPR-based technologies are paramount in genome engineering and synthetic biology. Prime editing (PE) is a technology capable of installing genomic edits without double-stranded DNA breaks (DSBs) or donor DNA. Prime editing guide RNAs (pegRNAs) simultaneously encode both guide and edit template sequences. They are more design intensive than CRISPR single guide RNAs (sgRNAs). As such, application of PE technology is hindered by the limited throughput of manual pegRNA design. To that end, we designed a software tool, Prime Induced Nucleotide Engineering Creator of New Edits (PINE-CONE), that enables high-throughput automated design of pegRNAs and prime editing strategies. PINE-CONE translates edit coordinates and sequences into pegRNA designs, accessory guides, and oligonucleotides for facile cloning workflows. To demonstrate PINE-CONE's utility in studying disease-relevant genotypes, we rapidly design a library of pegRNAs targeting Alzheimer's Disease single nucleotide polymorphisms (SNPs). Overall, PINE-CONE will accelerate the application of PEs in synthetic biology and biomedical research.",
                "authors": [
                    {
                        "name": "Standage-Beier K."
                    },
                    {
                        "name": "Tekel S.J."
                    },
                    {
                        "name": "Brafman D.A."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 2,
                "date": "2021-02-19T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "Prime Editing Guide RNA Design Automation Using PINE-CONE"
            },
            "pmcid": "PMC7901017",
            "pmid": "33464043"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}