{
    "additionDate": "2020-01-09T17:47:03Z",
    "biotoolsCURIE": "biotools:BiomeNet",
    "biotoolsID": "BiomeNet",
    "confidence_flag": "tool",
    "description": "A database for construction and analysis of functional interaction networks for any species with a sequenced genome.\n\nEarth BioGenome Project has been officially launched in November 2018 with the goal of decoding genomes of Earth’s biome over a period of 10 years. For every sequenced species, genome annotation will be followed by functional annotation for individual genes and pathways. Network biology can facilitate functional annotations of genomes in the context of collaborative interactions between genes.\n\nBiomeNet is a database of scored functional networks enabling network biology for every sequenced genome of Earth’s biome. With protein sequences of target species submitted by users, BiomeNet will transfer co-functional links between orthologous proteins from 95 source networks (comprising ~8 million links), which were previously constructed and validated for 18 species (5 animals, 6 plants, 5 bacteria, and 2 fungi)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://kobic.re.kr/biomenet/",
    "lastUpdate": "2024-11-24T20:56:21.342054Z",
    "name": "BiomeNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz776",
            "metadata": {
                "abstract": "Motivation: Owing to advanced DNA sequencing and genome assembly technology, the number of species with sequenced genomes is rapidly increasing. The aim of the recently launched Earth BioGenome Project is to sequence genomes of all eukaryotic species on Earth over the next 10 years, making it feasible to obtain genomic blueprints of the majority of animal and plant species by this time. Genetic models of the sequenced species will later be subject to functional annotation, and a comprehensive molecular network should facilitate functional analysis of individual genes and pathways. However, network databases are lagging behind genome sequencing projects as even the largest network database provides gene networks for less than 10% of sequenced eukaryotic genomes, and the knowledge gap between genomes and interactomes continues to widen. Results: We present BiomeNet, a database of 95 scored networks comprising over 8 million co-functional links, which can build and analyze gene networks for any species with the sequenced genome. BiomeNet transfers functional interactions between orthologous proteins from source networks to the target species within minutes and automatically constructs gene networks with the quality comparable to that of existing networks. BiomeNet enables assembly of the first-in-species gene networks not available through other databases, which are highly predictive of diverse biological processes and can also provide network analysis by extracting subnetworks for individual biological processes and network-based gene prioritizations. These data indicate that BiomeNet could enhance the benefits of decoding the genomes of various species, thus improving our understanding of the Earth' biodiversity.",
                "authors": [
                    {
                        "name": "Bae D."
                    },
                    {
                        "name": "Kim E."
                    },
                    {
                        "name": "Ko G."
                    },
                    {
                        "name": "Lee B."
                    },
                    {
                        "name": "Lee I."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Yang S."
                    }
                ],
                "citationCount": 5,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BiomeNet: A database for construction and analysis of functional interaction networks for any species with a sequenced genome"
            },
            "pmcid": "PMC7703761",
            "pmid": "31599923"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
