{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T11:29:20Z",
    "biotoolsCURIE": "biotools:PTMphinder",
    "biotoolsID": "PTMphinder",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jakewozniak@gmail.com",
            "name": "Jacob M. Wozniak",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Maintainer"
            ]
        }
    ],
    "description": "R package for PTM site localization and motif extraction from proteomic datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jmwozniak/PTMphinder",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "PTMphinder",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.7717/peerj.7046",
            "metadata": {
                "abstract": "Copyright 2019 Wozniak and GonzalezBackground. Mass-spectrometry-based proteomics is a prominent field of study that allows for the unbiased quantification of thousands of proteins from a particular sample. A key advantage of these techniques is the ability to detect protein post-translational modifications (PTMs) and localize them to specific amino acid residues. These approaches have led to many significant findings in a wide range of biological disciplines, from developmental biology to cancer and infectious diseases. However, there is a current lack of tools available to connect raw PTM site information to biologically meaningful results in a high-throughput manner. Furthermore, many of the available tools require significant programming knowledge to implement. Results. The R package PTMphinder was designed to enable researchers, particularly those with minimal programming background, to thoroughly analyze PTMs in proteomic data sets. The package contains three functions: parseDB, phindPTMs and extractBackground. Together, these functions allow users to reformat proteome databases for easier analysis, localize PTMs within full proteins, extract motifs surrounding the identified sites and create proteome-specific motif backgrounds for statistical purposes. Beta-testing of this R package has demonstrated its simplicity and ease of integration with existing tools. Conclusion. PTMphinder empowers researchers to fully analyze and interpret PTMs derived from proteomic data. This package is simple enough for researchers with limited programming experience to understand and implement. The data produced from this package can inform subsequent research by itself and also be used in conjunction with other tools, such as motif-x, for further analysis.",
                "authors": [
                    {
                        "name": "Wozniak J.M."
                    },
                    {
                        "name": "Gonzalez D.J."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "PTMPhinder: An R package for PTM site localization and motif extraction from proteomic datasets"
            },
            "pmcid": "PMC6555389",
            "pmid": "31198645",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1,
    "version": [
        "0.1.0"
    ]
}