{
    "additionDate": "2017-08-03T18:55:16Z",
    "biotoolsCURIE": "biotools:pathway_projector",
    "biotoolsID": "pathway_projector",
    "credit": [
        {
            "email": "ciconia@sfc.keio.ac.jp",
            "name": "Nobuaki Kono",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.g-language.org/PathwayProjector/mem.html"
        }
    ],
    "description": "This tool was implemented according to the aforementioned requirements, including the availability of a large-scale comprehensive pathway map, pathways from a wide variety of organisms, and searching and mapping capabilities.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.g-language.org/PathwayProjector/doc.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.g-language.org/PathwayProjector/",
    "language": [
        "Ruby",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pathway-projector-zoomable-pathway-browser-kegg-atlas.html"
        }
    ],
    "name": "Pathway Projector",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Biochemical pathways provide an essential context for understanding comprehensive experimental data and the systematic workings of a cell. Therefore, the availability of online pathway browsers will facilitate post-genomic research, just as genome browsers have contributed to genomics. Many pathway maps have been provided online as part of public pathway databases. Most of these maps, however, function as the gateway interface to a specific database, and the comprehensiveness of their represented entities, data mapping capabilities, and user interfaces are not always sufficient for generic usage. Methodology/Principal Findings: We have identified five central requirements for a pathway browser: (1) availability of large integrated maps showing genes, enzymes, and metabolites; (2) comprehensive search features and data access; (3) data mapping for transcriptomic, proteomic, and metabolomic experiments, as well as the ability to edit and annotate pathway maps; (4) easy exchange of pathway data; and (5) intuitive user experience without the requirement for installation and regular maintenance. According to these requirements, we have evaluated existing pathway databases and tools and implemented a web-based pathway browser named Pathway Projector as a solution. Conclusions/Significance: Pathway Projector provides integrated pathway maps that are based upon the KEGG Atlas, with the addition of nodes for genes and enzymes, and is implemented as a scalable, zoomable map utilizing the Google Maps API. Users can search pathway-related data using keywords, molecular weights, nucleotide sequences, and amino acid sequences, or as possible routes between compounds. In addition, experimental data from transcriptomic, proteomic, and metabolomic analyses can be readily mapped. Pathway Projector is freely available for academic users at http://www.g-language.org/PathwayProjector/. © 2009 Kono et al.",
                "authors": [
                    {
                        "name": "Kono N."
                    },
                    {
                        "name": "Arakawa K."
                    },
                    {
                        "name": "Ogawa R."
                    },
                    {
                        "name": "Kido N."
                    },
                    {
                        "name": "Oshita K."
                    },
                    {
                        "name": "Ikegami K."
                    },
                    {
                        "name": "Tamaki S."
                    },
                    {
                        "name": "Tomita M."
                    }
                ],
                "citationCount": 65,
                "date": "2009-11-11T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Pathway projector: Web-based zoomable pathway browser using KEGG Atlas and Google Maps API"
            },
            "pmid": "19907644"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}