{"credit":[{"email":"serghei@cs.ucla.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://zarlab.cs.ucla.edu/"}],"documentation":[{"type":"GENERAL","url":"https://grid.cs.gsu.edu/~serghei/sites/default/file/readme.txt"}],"function":[{"operation":[{"term":"Genome assembly","uri":"http://edamontology.org/operation_0525"}]}],"labels":{"language":["Python","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/vga-v1-viral-genome-assembler.html"}],"publication":[{"abstract":"Motivation: Next-generation sequencing technologies sequence viruses with ultra-deep coverage, thus promising to revolutionize our understanding of the underlying diversity of viral populations. While the sequencing coverage is high enough that even rare viral variants are sequenced, the presence of sequencing errors makes it difficult to distinguish between rare variants and sequencing errors. Results: In this article, we present a method to overcome the limitations of sequencing technologies and assemble a diverse viral population that allows for the detection of previously undiscovered rare variants. The proposed method consists of a high-fidelity sequencing protocol and an accurate viral population assembly method, referred to as Viral Genome Assembler (VGA). The proposed protocol is able to eliminate sequencing errors by using individual barcodes attached to the sequencing fragments. Highly accurate data in combination with deep coverage allow VGA to assemble rare variants. VGA uses an expectation-maximization algorithm to estimate abundances of the assembled viral variants in the population. Results on both synthetic and real datasets show that our method is able to accurately assemble an HIV viral population and detect rare variants previously undetectable due to sequencing errors. VGA outperforms state-of-the-art methods for genome-wide viral assembly. Furthermore, our method is the first viral assembly method that scales to millions of sequencing reads. © 2014 The Author. Published by Oxford University Press. All rights reserved.","authors":["Mangul S.","Wu N.C.","Mancuso N.","Zelikovsky A.","Sun R.","Eskin E."],"cit_count":24,"journal":"Bioinformatics","pmid":"24932001","title":"Accurate viral population assembly from ultra-deep sequencing data","year":"2014-06-15"}],"summary":{"biotoolsCURIE":"biotools:vga","biotoolsID":"vga","description":"Method for accurate assembly of a heterogeneous viral population consisting of individuals viral genomes (also known as quasi-species).","homepage":"http://genetics.cs.ucla.edu/vga/","name":"VGA"}}