{
    "additionDate": "2015-03-10T13:03:17Z",
    "biotoolsCURIE": "biotools:risearch",
    "biotoolsID": "risearch",
    "credit": [
        {
            "email": "wenzel@rth.dk",
            "name": "Anne Wenzel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "RTH",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Fast search for RNA-RNA interactions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://rth.dk/resources/risearch/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "RNA sequence",
                        "uri": "http://edamontology.org/data_3495"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "RNA sequence",
                        "uri": "http://edamontology.org/data_3495"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "RNA RNA interaction prediction",
            "operation": [
                {
                    "term": "Sequence alignment analysis",
                    "uri": "http://edamontology.org/operation_0258"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "DNA base pair stacking energies data",
                        "uri": "http://edamontology.org/data_1588"
                    }
                }
            ]
        }
    ],
    "homepage": "http://rth.dk/resources/risearch",
    "lastUpdate": "2019-03-12T15:50:50Z",
    "name": "RIsearch",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "RTH",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts519",
            "metadata": {
                "abstract": "Motivation: Regulatory, non-coding RNAs often function by forming a duplex with other RNAs. It is therefore of interest to predict putative RNA-RNA duplexes in silico on a genome-wide scale. Current computational methods for predicting these interactions range from fast complementary-based searches to those that take intramolecular binding into account. Together these methods constitute a trade-off between speed and accuracy, while leaving room for improvement within the context of genome-wide screens. A fast pre-filtering of putative duplexes would therefore be desirable.Results: We present RIsearch, an implementation of a simplified Turner energy model for fast computation of hybridization, which significantly reduces runtime while maintaining accuracy. Its time complexity for sequences of lengths m and n is with a much smaller pre-factor than other tools. We show that this energy model is an accurate approximation of the full energy model for near-complementary RNA-RNA duplexes. RIsearch uses a Smith-Waterman-like algorithm using a dinucleotide scoring matrix which approximates the Turner nearest-neighbor energies. We show in benchmarks that we achieve a speed improvement of at least 2.4× compared with RNAplex, the currently fastest method for searching near-complementary regions. RIsearch shows a prediction accuracy similar to RNAplex on two datasets of known bacterial short RNA (sRNA)-messenger RNA (mRNA) and eukaryotic microRNA (miRNA)-mRNA interactions. Using RIsearch as a pre-filter in genome-wide screens reduces the number of binding site candidates reported by miRNA target prediction programs, such as TargetScanS and miRanda, by up to 70. Likewise, substantial filtering was performed on bacterial RNA-RNA interaction data. © 2012 The Author.",
                "authors": [
                    {
                        "name": "Akbasli E."
                    },
                    {
                        "name": "Gorodkin J."
                    },
                    {
                        "name": "Wenzel A."
                    }
                ],
                "citationCount": 53,
                "date": "2012-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RIsearch: Fast RNA-RNA interaction search using a simplified nearest-neighbor energy model"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
