{
    "additionDate": "2017-03-30T22:04:49Z",
    "biotoolsCURIE": "biotools:rgd",
    "biotoolsID": "rgd",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://rgd.mcw.edu/contact/index.shtml"
        }
    ],
    "description": "The Rat Genome Database (RGD) is a repository of rat genetic and genomic data. As well as integrating this data with mapping, physiological and strain information, RGD also provides researchers with several tools that facilitate searching, data mining and data analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://rgd.mcw.edu"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Radiation Hybrid Mapping",
                    "uri": "http://edamontology.org/operation_0485"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://rgd.mcw.edu/",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Rat Genome Database (RGD)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The Rat Genome Database (RGD) (http://rgd.mcw.edu) aims to meet the needs of its community by providing genetic and genomic infrastructure while also annotating the strengths of rat research: biochemistry, nutrition, pharmacology and physiology. Here, we report on RGD's development towards creating a phenome database. Recent developments can be categorized into three groups. (i) Improved data collection and integration to match increased volume and biological scope of research. (ii) Knowledge representation augmented by the implementation of a new ontology and annotation system. (iii) The addition of quantitative trait loci data, from rat, mouse and human to our advanced comparative genomics tools, as well as the creation of new, and enhancement of existing, tools to enable users to efficiently browse and survey research data. The emphasis is on helping researchers find genes responsible for disease through the use of rat models. These improvements, combined with the genomic sequence of the rat, have led to a successful year at RGD with over two million page accesses that represent an over 4-fold increase in a year. Future plans call for increased annotation of biological information on the rat elucidated through its use as a model for human pathobiology. The continued development of toolsets will facilitate integration of these data into the context of rat genomic sequence, as well as allow comparisons of biological and genomic data with the human genomic sequence and of an increasing number of organisms. © Oxford University Press 2005; all rights reserved.",
                "authors": [
                    {
                        "name": "de la Cruz N."
                    },
                    {
                        "name": "Bromberg S."
                    },
                    {
                        "name": "Pasko D."
                    },
                    {
                        "name": "Shimoyama M."
                    },
                    {
                        "name": "Twigger S."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Chen C.-F."
                    },
                    {
                        "name": "Fan C."
                    },
                    {
                        "name": "Foote C."
                    },
                    {
                        "name": "Gopinath G.R."
                    },
                    {
                        "name": "Harris G."
                    },
                    {
                        "name": "Hughes A."
                    },
                    {
                        "name": "Ji Y."
                    },
                    {
                        "name": "Jin W."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Mathis J."
                    },
                    {
                        "name": "Nenasheva N."
                    },
                    {
                        "name": "Nie J."
                    },
                    {
                        "name": "Nigam R."
                    },
                    {
                        "name": "Petri V."
                    },
                    {
                        "name": "Reilly D."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Zuniga-Meyer A."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Kwitek A."
                    },
                    {
                        "name": "Tonellato P."
                    },
                    {
                        "name": "Jacob H."
                    }
                ],
                "citationCount": 46,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The Rat Genome Database (RGD): Developments towards a phenome database"
            },
            "pmid": "15608243"
        },
        {
            "metadata": {
                "abstract": "The Rat Genome Database (RGD, http://rgd.mcw.edu) is an NIH-funded project whose stated mission is 'to collect, consolidate and integrate data generated from ongoing rat genetic and genomic research efforts and make these data widely available to the scientific community'. In a collaboration between the Bioinformatics Research Center at the Medical College of Wisconsin, the Jackson Laboratory and the National Center for Biotechnology Information, RGD has been created to meet these stated aims. The rat is uniquely suited to its role as a model of human disease and the primary focus of RGD is to aid researchers in their study of the rat and in applying their results to studies in a wider context. In support of this we have integrated a large amount of rat genetic and genomic resources in RGD and these are constantly being expanded through ongoing literature and bulk dataset curation. RGD version 2.0, released in June 2001, includes curated data on rat genes, quantitative trait loci (QTL), microsatellite markers and rat strains used in genetic and genomic research. VCMap, a dynamic sequence-based homology tool was introduced, and allows researchers of rat, mouse and human to view mapped genes and sequences and their locations in the other two organisms, and essential tool for comparative genomics. In addition, RGD provides tools for gene prediction, radiation hybrid mapping, polymorphic marker selection and more. Future developments will include the introduction of disease-based curation expanding the curated information to cover popular disease systems studied in the rat. This will be integrated with the emerging rat genomic sequence and annotation pipelines to provide a high-quality disease-centric resource, applicable to human and mouse via comparative tools such as VCMap. RGD has a defined community outreach focus with a Visiting Scientist program and the Rat Community Forum, a web-based forum for rat researchers and others interested in using the rat as an experimental model. Thus, RGD is not only a valuable resource for those working with the rat but also for researchers in other model organisms wishing to harness the existing genetic and physiological data available in the rat to complement their own work.",
                "authors": [
                    {
                        "name": "Twigger S."
                    },
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "Shimoyama M."
                    },
                    {
                        "name": "Chen D."
                    },
                    {
                        "name": "Pasko D."
                    },
                    {
                        "name": "Long H."
                    },
                    {
                        "name": "Ginster J."
                    },
                    {
                        "name": "Chen C.-F."
                    },
                    {
                        "name": "Nigam R."
                    },
                    {
                        "name": "Kwitek A."
                    },
                    {
                        "name": "Eppig J."
                    },
                    {
                        "name": "Maltais L."
                    },
                    {
                        "name": "Maglott D."
                    },
                    {
                        "name": "Schuler G."
                    },
                    {
                        "name": "Jacob H."
                    },
                    {
                        "name": "Tonellato P.J."
                    }
                ],
                "citationCount": 80,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Rat Genome Database (RGD): Mapping disease onto the genome"
            },
            "pmid": "11752273"
        },
        {
            "metadata": {
                "abstract": "The Rat Genome Database (RGD, http://rgd.mcw.edu) is one of the core resources for rat genomics and recent developments have focused on providing support for disease-based research using the rat model. Recognizing the importance of the rat as a disease model we have employed targeted curation strategies to curate genes, QTL and strain data for neurological and cardiovascular disease areas. This work has centered on rat but also includes data for mouse and human to create 'disease portals' that provide a unified view of the genes, QTL and strain models for these diseases across the three species. The disease curation efforts combined with normal curation activities have served to greatly increase the content of the database, particularly for biological information, including gene ontology, disease, pathway and phenotype ontology annotations. In addition to improving the features and database content, community outreach has been expanded to demonstrate how investigators can leverage the resources at RGD to facilitate their research and to elicit suggestions and needs for future developments. We have published a number of papers that provide additional information on the ontology annotations and the tools at RGD for data mining and analysis to better enable researchers to fully utilize the database. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Twigger S.N."
                    },
                    {
                        "name": "Shimoyama M."
                    },
                    {
                        "name": "Bromberg S."
                    },
                    {
                        "name": "Kwitek A.E."
                    },
                    {
                        "name": "Jacob H.J."
                    }
                ],
                "citationCount": 105,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The Rat Genome Database, update 2007 - Easing the path from disease to data and back again"
            },
            "pmid": "17151068"
        },
        {
            "metadata": {
                "abstract": "The Rat Genome Database (RGD, http://rgd.mcw.edu) was developed to provide a core resource for rat researchers combining genetic, genomic, pathway, phenotype and strain information with a focus on disease. RGD users are provided with access to structured and curated data from the molecular level through to the level of the whole organism, including the variations associated with disease phenotypes. To fully support use of the rat as a translational model for biological systems and human disease, RGD continues to curate these datasets while enhancing and developing tools to allow efficient and effective access to the data in a variety of formats including linear genome viewers, pathway diagrams and biological ontologies. To support pathophysiological analysis of data, RGD Disease Portals provide an entryway to integrated gene, QTL and strain data specific to a particular disease. In addition to tool and content development and maintenance, RGD promotes rat research and provides user education by creating and disseminating tutorials on the curated datasets, submission processes, and tools available at RGD. By curating, storing, integrating, visualizing and promoting rat data, RGD ensures that the investment made into rat genomics and genetics can be leveraged by all interested investigators. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Dwinell M.R."
                    },
                    {
                        "name": "Worthey E.A."
                    },
                    {
                        "name": "Shimoyama M."
                    },
                    {
                        "name": "Bakir-Gungor B."
                    },
                    {
                        "name": "Depons J."
                    },
                    {
                        "name": "Laulederkind S."
                    },
                    {
                        "name": "Lowry T."
                    },
                    {
                        "name": "Nigram R."
                    },
                    {
                        "name": "Petri V."
                    },
                    {
                        "name": "Smith J."
                    },
                    {
                        "name": "Stoddard A."
                    },
                    {
                        "name": "Twigger S.N."
                    },
                    {
                        "name": "Jacob H.J."
                    }
                ],
                "citationCount": 59,
                "date": "2009-01-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The Rat Genome Database 2009: Variation, ontologies and pathways"
            },
            "pmid": "18996890"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        }
    ],
    "validated": 1
}