{
    "additionDate": "2020-01-14T19:58:48Z",
    "biotoolsCURIE": "biotools:TraceMontage",
    "biotoolsID": "TraceMontage",
    "confidence_flag": "tool",
    "description": "A method for merging multiple independent neuronal traces.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://www.cai-lab.org/tracemontage",
    "lastUpdate": "2021-01-16T16:52:44Z",
    "name": "TraceMontage",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JNEUMETH.2019.108560",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Background: The ability to reconstruct neuronal networks, local microcircuits, or the entire connectome is a central goal of modern neuroscience. Recently, advancements in sample preparation (e.g., sample expansion and Brainbow labeling) and optical (e.g., confocal and light sheet) techniques have enabled the imaging of increasingly large neural systems with high contrast. Tracing neuronal structures from these images proves challenging, however, necessitating tools that integrate multiple neuronal traces, potentially derived by various methods, into one combined (montaged) result. New method: Here, we present TraceMontage, an ImageJ/Fiji plugin for the combination of multiple neuron traces of a single image, either redundantly or non-redundantly. Internally, it uses graph theory to connect topological patterns in the 3-D spatial coordinates of neuronal trees. The software generates a single output tracing file containing the montage traces of the input tracing files and provides several measures of consistency analysis among multiple tracers. Results and comparison to existing method(s): To our knowledge, our software is the first dedicated method for the combination of tracing results. Combining multiple tracers increases the accuracy and speed of tracing of densely-labeled samples by harnessing collaborative effort. This utility is demonstrated using fluorescence microscope images from the hippocampus and primary visual cortex (V1) in Brainbow-labeled mice. Conclusions: TraceMontage provides researchers the ability to combine neuronal tracing data generated by either the same or different method(s). As datasets become larger, the ability to trace images in this parallel manner will help connectomics scale to increasingly larger neural systems.",
                "authors": [
                    {
                        "name": "Dizaji A.S."
                    },
                    {
                        "name": "Walker L.A."
                    },
                    {
                        "name": "Cai D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "TraceMontage: A method for merging multiple independent neuronal traces"
            },
            "pmid": "31874186"
        }
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}