
{
    "credit": [
        {
            "email": "valdeanda@ciencias.unam.mx",
            "name": "Valerie De Anda Torres",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "augusto.poot@iimas.unam.mx",
            "name": "Augusto Cesar Poot-Hernandez",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "bcontreras@eead.csic.es",
            "name": "Bruno Contreras Moreira",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/eead-csic-compbio/metagenome_Pfam_score"
        },
        {
            "type": "User manual",
            "url": "https://eead-csic-compbio.github.io/metagenome_Pfam_score/manual.v1.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "Python"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. The increasing number of metagenomic and genomic sequences has dramatically improved our understanding of microbial diversity, yet our ability to infer metabolic capabilities in such datasets remains challenging. We describe the Multigenomic Entropy Based Score pipeline (MEBS), a software platform designed to evaluate, compare, and infer complex metabolic pathways in large \"omic\" datasets, including entire biogeochemical cycles. MEBS is open source and available through https://github.com/eead-csic-compbio/metagenome Pfam score. To demonstrate its use, we modeled the sulfur cycle by exhaustively curating the molecular and ecological elements involved (compounds, genes, metabolic pathways, and microbial taxa). This information was reduced to a collection of 112 characteristic Pfam protein domains and a list of complete-sequenced sulfur genomes. Using the mathematical framework of relative entropy (H'), we quantitatively measured the enrichment of these domains among sulfur genomes. The entropy of each domain was used both to build up a final score that indicates whether a (meta)genomic sample contains the metabolic machinery of interest and to propose marker domains in metagenomic sequences such as DsrC (PF04358). MEBS was benchmarked with a dataset of 2107 non-redundant microbial genomes from RefSeq and 935 metagenomes from MG-RAST. Its performance, reproducibility, and robustness were evaluated using several approaches, including random sampling, linear regression models, receiver operator characteristic plots, and the area under the curve metric (AUC). Our results support the broad applicability of this algorithm to accurately classify (AUC = 0.985) hard-to-culture genomes (e.g., Candidatus Desulforudis audaxviator), previously characterized ones, and metagenomic environments such as hydrothermal vents, or deep-sea sediment. Our benchmark indicates that an entropy-based score can capture the metabolic machinery of interest and can be used to efficiently classify large genomic and metagenomic datasets, including uncultivated/unexplored taxa.",
            "authors": [
                "De Anda V.",
                "Zapata-Penasco I.",
                "Poot-Hernandez A.C.",
                "Eguiarte L.E.",
                "Contreras-Moreira B.",
                "Souza V."
            ],
            "cit_count": 3,
            "doi": "10.1093/gigascience/gix096",
            "journal": "GigaScience",
            "title": "MEBS, a software platform to evaluate large (meta)genomic collections according to their metabolic machinery: Unraveling the sulfur cycle",
            "year": "2017-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mebs",
        "biotoolsID": "mebs",
        "description": "Software platform to evaluate large (meta)genomic collections according to their metabolic machinery: unraveling the sulfur cycle.",
        "homepage": "https://github.com/eead-csic-compbio/metagenome_Pfam_score",
        "name": "MEBS"
    }
}