{
    "additionDate": "2022-01-03T07:16:13.446866Z",
    "biotoolsCURIE": "biotools:x-entropy",
    "biotoolsID": "x-entropy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Klaus.Liedl@uibk.ac.at",
            "name": "Klaus R. Liedl",
            "orcidid": "https://orcid.org/0000-0002-0985-2299",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "johannes@kraml.dev",
            "name": "Johannes Kraml",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        }
    ],
    "description": "X-Entropy is a parallelized kernel density estimator with automated bandwidth selection to calculate entropy. This library is primarily meant to calculate dihedral entropies from MD simulation data. For this, we use a KDE with automatic bandwidth selection as suggested by Z. Botev et al. We tried to keep the package as generalized as possible, therefore, the package can be used to calculate the entropy of any data, or also to simply calculate the KDE.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liedllab/X-Entropy",
    "language": [
        "Python",
        "C++"
    ],
    "lastUpdate": "2022-01-03T07:16:13.449510Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/liedllab/X-Entropy/issues"
        }
    ],
    "name": "X-Entropy",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C01375",
            "metadata": {
                "abstract": "© 2021 The Authors. Published by American Chemical Society.X-Entropy is a Python package used to calculate the entropy of a given distribution, in this case, based on the distribution of dihedral angles. The dihedral entropy facilitates an alignment-independent measure of local protein flexibility. The key feature of our approach is a Gaussian kernel density estimation (KDE) using a plug-in bandwidth selection, which is fully implemented in a C++ backend and parallelized with OpenMP. We further provide a Python frontend, with predefined wrapper functions for classical coordinate-based dihedral entropy calculations, using a 1D approximation. This makes the package very straightforward to include in any Python-based analysis workflow. Furthermore, the frontend allows full access to the C++ backend, so that the KDE can be used on any binnable one-dimensional input data. In this application note, we discuss implementation and usage details and illustrate potential applications. In particular, we benchmark the performance of our module in calculating the entropy of samples drawn from a Gaussian distribution and the analytical solution thereof. Further, we analyze the computational performance of this module compared to well-established python libraries that perform KDE analyses. X-Entropy is available free of charge on GitHub (https://github.com/liedllab/X-Entropy).",
                "authors": [
                    {
                        "name": "Kraml J."
                    },
                    {
                        "name": "Hofer F."
                    },
                    {
                        "name": "Quoika P.K."
                    },
                    {
                        "name": "Kamenik A.S."
                    },
                    {
                        "name": "Liedl K.R."
                    }
                ],
                "citationCount": 2,
                "date": "2021-04-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "X-Entropy: A Parallelized Kernel Density Estimator with Automated Bandwidth Selection to Calculate Entropy"
            },
            "pmcid": "PMC8154256",
            "pmid": "33719418",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ]
}