{
    "additionDate": "2021-03-19T08:51:04Z",
    "biotoolsCURIE": "biotools:consort-tm",
    "biotoolsID": "consort-tm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "halil@illinois.edu",
            "name": "Halil Kilicoglu",
            "orcidid": "https://orcid.org/0000-0003-3987-9393",
            "typeEntity": "Person"
        }
    ],
    "description": "CONSORT-TM is a corpus annotated with CONSORT checklist items, and studied baseline sentence classification methods as well as their combinations to recognize a subset of these items.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kilicogluh/CONSORT-TM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-26T13:56:14Z",
    "name": "CONSORT-TM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2021.01.12.21249695"
        },
        {
            "doi": "10.1016/j.jbi.2021.103717",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Objective: To annotate a corpus of randomized controlled trial (RCT) publications with the checklist items of CONSORT reporting guidelines and using the corpus to develop text mining methods for RCT appraisal. Methods: We annotated a corpus of 50 RCT articles at the sentence level using 37 fine-grained CONSORT checklist items. A subset (31 articles) was double-annotated and adjudicated, while 19 were annotated by a single annotator and reconciled by another. We calculated inter-annotator agreement at the article and section level using MASI (Measuring Agreement on Set-Valued Items) and at the CONSORT item level using Krippendorff's α. We experimented with two rule-based methods (phrase-based and section header-based) and two supervised learning approaches (support vector machine and BioBERT-based neural network classifiers), for recognizing 17 methodology-related items in the RCT Methods sections. Results: We created CONSORT-TM consisting of 10,709 sentences, 4,845 (45%) of which were annotated with 5,246 labels. A median of 28 CONSORT items (out of possible 37) were annotated per article. Agreement was moderate at the article and section levels (average MASI: 0.60 and 0.64, respectively). Agreement varied considerably among individual checklist items (Krippendorff's α= 0.06–0.96). The model based on BioBERT performed best overall for recognizing methodology-related items (micro-precision: 0.82, micro-recall: 0.63, micro-F1: 0.71). Combining models using majority vote and label aggregation further improved precision and recall, respectively. Conclusion: Our annotated corpus, CONSORT-TM, contains more fine-grained information than earlier RCT corpora. Low frequency of some CONSORT items made it difficult to train effective text mining models to recognize them. For the items commonly reported, CONSORT-TM can serve as a testbed for text mining methods that assess RCT transparency, rigor, and reliability, and support methods for peer review and authoring assistance. Minor modifications to the annotation scheme and a larger corpus could facilitate improved text mining models. CONSORT-TM is publicly available at https://github.com/kilicogluh/CONSORT-TM.",
                "authors": [
                    {
                        "name": "Hoang L."
                    },
                    {
                        "name": "Kilicoglu H."
                    },
                    {
                        "name": "Malicki M."
                    },
                    {
                        "name": "Peng Z."
                    },
                    {
                        "name": "Rosemblat G."
                    },
                    {
                        "name": "Schneider J."
                    },
                    {
                        "name": "Wadhwa S."
                    },
                    {
                        "name": "ter Riet G."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "Toward assessing clinical trial publications for reporting transparency"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
