{
    "additionDate": "2021-01-18T08:03:03Z",
    "biotoolsCURIE": "biotools:sbmlsimulator",
    "biotoolsID": "sbmlsimulator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alexander.doerr@uni-tuebingen.de",
            "name": "Alexander Dörr",
            "typeEntity": "Person"
        }
    ],
    "description": "A Java Tool for Model Simulation and Parameter Estimation in Systems Biology.\n\nSBMLsimulator is a fast, accurate, and easily usable program for dynamic model simulation and heuristic parameter optimization of models encoded in the Systems Biology Markup Language (SBML). For simulation it contains the Systems Biology Simulation Core Library, which has been benchmarked against the entire SBML Test Suite and all models from the Biomodels.net database. It includes a large collection of nature-inspired heuristic optimization procedures for efficient model calibration. SBMLsimulator provides an intuitive Graphical User Interface (GUI) and several command-line options to be suitable for large-scale batch processing and model calibration. SBMLsimulator runs on all platforms that provide a standard Java Virtual Machine and is based on the open-source library JSBML.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "http://www.cogsys.cs.uni-tuebingen.de/software/SBMLsimulator/",
    "lastUpdate": "2021-02-11T16:43:19Z",
    "name": "SBMLsimulator",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/COMPUTATION2040246",
            "metadata": {
                "abstract": "© 2014 by the authors; licensee MDPI, Basel, Switzerland.The identification of suitable model parameters for biochemical reactions has been recognized as a quite difficult endeavor. Parameter values from literature or experiments can often not directly be combined in complex reaction systems. Nature-inspired optimization techniques can find appropriate sets of parameters that calibrate a model to experimentally obtained time series data. We present SBMLsimulator, a tool that combines the Systems Biology Simulation Core Library for dynamic simulation of biochemical models with the heuristic optimization framework EvA2. SBMLsimulator provides an intuitive graphical user interface with various options as well as a fully-featured command-line interface for large-scale and script-based model simulation and calibration. In a parameter estimation study based on a published model and artificial data we demonstrate the capability of SBMLsimulator to identify parameters. SBMLsimulator is useful for both, the interactive simulation and exploration of the parameter space and for the large-scale model calibration and estimation of uncertain parameter values.",
                "authors": [
                    {
                        "name": "Dorr A."
                    },
                    {
                        "name": "Keller R."
                    },
                    {
                        "name": "Zell A."
                    },
                    {
                        "name": "Drager A."
                    }
                ],
                "citationCount": 8,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Computation",
                "title": "SBMLSimulator: A java tool for model simulation and parameter estimation in systems biology"
            },
            "pmcid": "PMC7093077",
            "pmid": "32211200"
        }
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}