{
    "additionDate": "2020-01-14T09:12:14Z",
    "biotoolsCURIE": "biotools:OSacc",
    "biotoolsID": "OSacc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xqguo@henu.edu.cn",
            "name": "Xiangqian Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "Gene Expression-Based Survival Analysis Web Tool For Adrenocortical Carcinoma.\n\nGene expression profiling data with long-term clinical follow-up information are great resources to screen, develop, evaluate and validate prognostic biomarkers in translational cancer research. However, an easy-to-use interactive online tool is needed to analyze these profiling and clinical data. In the current work, we developed OSacc (Online consensus Survival analysis of ACC), a web tool that provides rapid and user-friendly survival analysis based on seven independent transcriptomic profiles with long-term clinical follow-up information of 259 ACC patients gathered from The Cancer Genome Atlas (TCGA) and Gene Expression Omnibus (GEO) databases. OSacc allows researchers and clinicians to evaluate the prognostic value of genes of interest by Kaplan-Meier (KM) survival plot with hazard ratio (HR) and log-rank test in ACC.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.henu.edu.cn/ACC/ACCList.jsp",
    "lastUpdate": "2021-01-04T14:32:55Z",
    "name": "OSacc",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2147/CMAR.S215586",
            "metadata": {
                "abstract": "© 2019 Xie et al.Gene expression profiling data with long-term clinical follow-up information are great resources to screen, develop, evaluate and validate prognostic biomarkers in translational cancer research. However, an easy-to-use interactive online tool is needed to analyze these profiling and clinical data. In the current work, we developed OSacc (Online consensus Survival analysis of ACC), a web tool that provides rapid and user-friendly survival analysis based on seven independent transcriptomic profiles with long-term clinical follow-up information of 259 ACC patients gathered from The Cancer Genome Atlas (TCGA) and Gene Expression Omnibus (GEO) databases. OSacc allows researchers and clinicians to evaluate the prognostic value of genes of interest by Kaplan–Meier (KM) survival plot with hazard ratio (HR) and log-rank test in ACC. OSacc is freely available at http://bioinfo.henu.edu.cn/ ACC/ACCList.jsp.",
                "authors": [
                    {
                        "name": "Dang Y."
                    },
                    {
                        "name": "Dong H."
                    },
                    {
                        "name": "Ge L."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Nan F."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Zhu W."
                    }
                ],
                "citationCount": 11,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Cancer Management and Research",
                "title": "OSacc: Gene expression-based survival analysis web tool for adrenocortical carcinoma"
            },
            "pmcid": "PMC6817837",
            "pmid": "31749633"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
