{
    "name": "BioWord", 
    "description": "Powerful biological sequence editor operating in the most convenient of places: inside your usual word-processor (Microsoft Word 2007 and 2010). Easy to install and embedded into a Microsoft Office Ribbon, BioWord allows instant access to most sequence manipulation and editing needs, such as reverse-complementing, translating or FASTA formatting, and features a full suite of sequence search methods, pair-wise alignment and motif discovery.", 
    "homepage": "http://erilllab.umbc.edu/bioword-2/", 
    "biotoolsID": "bioword", 
    "biotoolsCURIE": "biotools:bioword", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0292", 
                    "term": "Sequence alignment"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0238", 
                    "term": "Sequence motif discovery"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0097", 
            "term": "Nucleic acid structure analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Visual Basic"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/bioword-20120923-sequence-manipulation-suite-microsoft-word.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.biomedcentral.com/content/pdf/1471-2105-13-124.pdf", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "22676326", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "BioWord: A sequence manipulation suite for Microsoft Word", 
                "abstract": "Background: The ability to manipulate, edit and process DNA and protein sequences has rapidly become a necessary skill for practicing biologists across a wide swath of disciplines. In spite of this, most everyday sequence manipulation tools are distributed across several programs and web servers, sometimes requiring installation and typically involving frequent switching between applications. To address this problem, here we have developed BioWord, a macro-enabled self-installing template for Microsoft Word documents that integrates an extensive suite of DNA and protein sequence manipulation tools.Results: BioWord is distributed as a single macro-enabled template that self-installs with a single click. After installation, BioWord will open as a tab in the Office ribbon. Biologists can then easily manipulate DNA and protein sequences using a familiar interface and minimize the need to switch between applications. Beyond simple sequence manipulation, BioWord integrates functionality ranging from dyad search and consensus logos to motif discovery and pair-wise alignment. Written in Visual Basic for Applications (VBA) as an open source, object-oriented project, BioWord allows users with varying programming experience to expand and customize the program to better meet their own needs.Conclusions: BioWord integrates a powerful set of tools for biological sequence manipulation within a handy, user-friendly tab in a widely used word processing software package. The use of a simple scripting language and an object-oriented scheme facilitates customization by users and provides a very accessible educational platform for introducing students to basic bioinformatics algorithms. © 2012 Anzaldi et al.; licensee BioMed Central Ltd.", 
                "date": "2012-06-07T00:00:00Z", 
                "citationCount": 6, 
                "authors": [
                    {
                        "name": "Anzaldi L.J."
                    }, 
                    {
                        "name": "Munoz-Fernandez D."
                    }, 
                    {
                        "name": "Erill I."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Ivan Erill", 
            "email": "erill@umbc.edu", 
            "url": "http://erilllab.umbc.edu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:37:42Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}