{"credit":[{"name":"NCBI","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"DRCAT","typeEntity":"Project","typeRoles":["Documentor"]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.ncbi.nlm.nih.gov/home/about/contact.shtml"}],"function":[{"input":[{"data":{"term":"Sequence accession (nucleic acid)","uri":"http://edamontology.org/data_1097"}}],"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}],"output":[{"data":{"term":"Sequence record","uri":"http://edamontology.org/data_0849"},"format":[{"term":"GenBank-HTML","uri":"http://edamontology.org/format_2532"}]}]}],"labels":{"collectionID":["DRCAT"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"GenBank (http://www.ncbi.nlm.nih.gov) is a comprehensive database that contains publicly available nucleotide sequences for almost 260000 formally described species. These sequences are obtained primarily through submissions from individual laboratories and batch submissions from large-scale sequencing projects, including whole-genome shotgun (WGS) and environmental sampling projects. Most submissions are made using the web-based BankIt or standalone Sequin programs, and GenBank staff assigns accession numbers upon data receipt. Daily data exchange with the European Nucleotide Archive (ENA) and the DNA Data Bank of Japan (DDBJ) ensures worldwide coverage. GenBank is accessible through the NCBI Entrez retrieval system, which integrates data from the major DNA and protein sequence databases along with taxonomy, genome, mapping, protein structure and domain information, and the biomedical journal literature via PubMed. BLAST provides sequence similarity searches of GenBank and other sequence databases. Complete bimonthly releases and daily updates of the GenBank database are available by FTP. To access GenBank and its related retrieval and analysis services, begin at the NCBI home page: www.ncbi.nlm.nih.gov. © The Author(s) 2012.","authors":["Benson D.A.","Cavanaugh M.","Clark K.","Karsch-Mizrachi I.","Lipman D.J.","Ostell J.","Sayers E.W."],"cit_count":1125,"doi":"10.1093/nar/gks1195","journal":"Nucleic Acids Research","title":"GenBank","type":"Primary","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:genbank","biotoolsID":"genbank","description":"A comprehensive database of public nucleotide sequences for more than 300 000 organisms named, from small and large-scale sequencing projects. Data exchange with the European Molecular Biology Laboratory Nucleotide Sequence Database in Europe and the DNA Data Bank of Japan ensures worldwide coverage.","homepage":"http://www.ncbi.nlm.nih.gov/","name":"GenBank nucleotide sequence database"}}