{
    "additionDate": "2019-11-14T20:11:57Z",
    "biotoolsCURIE": "biotools:RSQLite",
    "biotoolsID": "RSQLite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mxl7125@126.com",
            "name": "Xiaoli Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioinformatics and functional analyses of key genes in smoking-associated lung adenocarcinoma | Embeds the 'SQLite' database engine in R and provides an interface compliant with the 'DBI' package. The source for the 'SQLite' engine is included",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://CRAN.R-project.org/package=RSQLite",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-13T16:47:18Z",
    "license": "LGPL-2.0",
    "name": "RSQLite",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3892/OL.2019.10733",
            "metadata": {
                "abstract": "© 2019 Spandidos Publications. All rights reserved.Smoking is one of the most important factors associated with the development of lung cancer. However, the signaling pathways and driver genes in smoking-associated lung adenocarcinoma remain unknown. The present study analyzed 433 samples of smoking-associated lung adenocarcinoma and 75 samples of non-smoking lung adenocarcinoma from the Cancer Genome Atlas database. Gene Ontology (GO) analysis was performed using the Database for Annotation, Visualization and Integrated Discovery and the ggplot2 R/Bioconductor package. Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analysis was performed using the R packages RSQLite and org-Hs-eg-db. Multivariate Cox regression analysis was performed to screen factors associated with patient survival. Kaplan-Meier and receiver operating characteristic curves were used to analyze the potential clinical significance of the identified biomarkers as molecular prognostic markers for the five-year overall survival time. A total of 373 differentially expressed genes (DEGs; |log2-fold change|≥2.0 and P<0.01) were identified, of which 71 were downregulated and 302 were upregulated. These DEGs were associated with 28 significant GO functions and 11 significant KEGG pathways (false discovery rate <0.05). Two hundred thirty-eight proteins were associated with the 373 differentially expressed genes, and a protein-protein interaction network was constructed. Multivariate regression analysis revealed that 7 mRNAs, cytochrome P450 family 17 subfamily A member 1, PKHD1 like 1, retinoid isomerohydrolase RPE65, neurotensin receptor 1, fetuin B, insulin-like growth factor binding protein 1 and glucose-6-phosphatase catalytic subunit, significantly distinguished between non-smoking and smoking-associated adenocarcinomas. Kaplan-Meier analysis demonstrated that patients in the 7 mRNAs-high-risk group had a significantly worse prognosis than those of the low-risk group. The data obtained in the current study suggested that these genes may serve as potential novel prognostic biomarkers of smoking-associated lung adenocarcinoma.",
                "authors": [
                    {
                        "name": "Zhou D."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Jia Y."
                    },
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Ma X."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Oncology Letters",
                "title": "Bioinformatics and functional analyses of key genes in smoking-associated lung adenocarcinoma"
            },
            "pmcid": "PMC6732981",
            "pmid": "31516576"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1
}