{
    "additionDate": "2019-11-14T18:16:07Z",
    "biotoolsCURIE": "biotools:EnzyDock",
    "biotoolsID": "EnzyDock",
    "confidence_flag": "high",
    "description": "> HOMEPAGE MISSING! | Protein-Ligand Docking of Multiple Reactive States along a Reaction Coordinate in Enzymes | Enzymes play a pivotal role in all biological systems. These biomachines are the most effective catalysts known, dramatically enhancing the rate of reactions by more than 10 orders of magnitude relative to the uncatalyzed reactions in solution. Predicting the correct, mechanistically appropriate binding modes for substrate and product, as well as all reaction intermediates and transition states, along a reaction pathway is immensely challenging and remains an unsolved problem. In the present work, we developed an effective methodology for identifying probable binding modes of multiple ligand states along a reaction coordinate in an enzyme active site",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Active site prediction",
                    "uri": "http://edamontology.org/operation_3896"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31386808",
    "lastUpdate": "2019-11-14T18:16:07Z",
    "name": "EnzyDock",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.9B00366",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Enzymes play a pivotal role in all biological systems. These biomachines are the most effective catalysts known, dramatically enhancing the rate of reactions by more than 10 orders of magnitude relative to the uncatalyzed reactions in solution. Predicting the correct, mechanistically appropriate binding modes for substrate and product, as well as all reaction intermediates and transition states, along a reaction pathway is immensely challenging and remains an unsolved problem. In the present work, we developed an effective methodology for identifying probable binding modes of multiple ligand states along a reaction coordinate in an enzyme active site. The program is called EnzyDock and is a CHARMM-based multistate consensus docking program that includes a series of protocols to predict the chemically relevant orientation of substrate, reaction intermediates, transition states, product, and inhibitors. EnzyDock is based on simulated annealing molecular dynamics and Monte Carlo sampling and allows ligand, as well as enzyme side-chain and backbone flexibility. The program can employ many user-defined constraints and restraints and classical force field potentials, as well as a range of hybrid quantum mechanics-molecular mechanics potentials. Herein, we apply EnzyDock to several different kinds of problems. First, we study two terpene synthase reactions, namely bornyl diphosphate synthase and the bacterial diterpene synthase CotB2. Second, we use EnzyDock to predict reaction coordinate states in a pair of Diels-Alder reactions in the enzymes spirotetronate AbyU and LepI. Third, we study a couple of racemases: the cofactor-dependent serine racemase and the cofactor independent proline racemase. Finally, we study several cases of covalent docking involving the Michael addition reaction. For all systems we predict binding modes that are consistent with available experimental observations, as well as with theoretical modeling studies from the literature. EnzyDock provides a platform for generating mechanistic insight into enzyme reactions, useful and reliable starting points for in-depth multiscale modeling projects, and rational design of noncovalent and covalent enzyme inhibitors.",
                "authors": [
                    {
                        "name": "Das S."
                    },
                    {
                        "name": "Shimshi M."
                    },
                    {
                        "name": "Raz K."
                    },
                    {
                        "name": "Nitoker Eliaz N."
                    },
                    {
                        "name": "Mhashal A.R."
                    },
                    {
                        "name": "Ansbacher T."
                    },
                    {
                        "name": "Major D.T."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-10T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "EnzyDock: Protein-Ligand Docking of Multiple Reactive States along a Reaction Coordinate in Enzymes"
            },
            "pmid": "31386808"
        }
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ]
}