{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-01-05T16:08:48.264436Z",
    "biotoolsCURIE": "biotools:frmc",
    "biotoolsID": "frmc",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "zhke@hust.edu.cn",
            "name": "Ke Zhou"
        }
    ],
    "description": "Imputation software FRMC for single-cell RNA-Seq data, which innovates a fast and accurate singular value thresholding approximation method.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HUST-DataMan/FRMC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-05T16:08:48.267176Z",
    "name": "FRMC",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1080/15476286.2021.1960688",
            "metadata": {
                "abstract": "© 2021 Informa UK Limited, trading as Taylor & Francis Group.The high-resolution feature of single-cell transcriptome sequencing technology allows researchers to observe cellular gene expression profiles at the single-cell level, offering numerous possibilities for subsequent biomedical investigation. However, the unavoidable technical impact of high missing values in the gene-cell expression matrices generated by insufficient RNA input severely hampers the accuracy of downstream analysis. To address this problem, it is essential to develop a more rapid and stable imputation method with greater accuracy, which should not only be able to recover the missing data, but also effectively facilitate the following biological mechanism analysis. The existing imputation methods all have their drawbacks and limitations, some require pre-assumed data distribution, some cannot distinguish between technical and biological zeros, and some have poor computational performance. In this paper, we presented a novel imputation software FRMC for single-cell RNA-Seq data, which innovates a fast and accurate singular value thresholding approximation method. The experiments demonstrated that FRMC can not only precisely distinguish ‘true zeros’ from dropout events and correctly impute missing values attributed to technical noises, but also effectively enhance intracellular and intergenic connections and achieve accurate clustering of cells in biological applications. In summary, FRMC can be a powerful tool for analysing single-cell data because it ensures biological significance, accuracy, and rapidity simultaneously. FRMC is implemented in Python and is freely accessible to non-commercial users on GitHub: https://github.com/HUST-DataMan/FRMC.",
                "authors": [
                    {
                        "name": "Chu M."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Xiang R."
                    },
                    {
                        "name": "Zhou K."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "RNA Biology",
                "title": "FRMC: a fast and robust method for the imputation of scRNA-seq data"
            },
            "pmid": "34459719"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
