{
    "additionDate": "2021-01-18T09:44:27Z",
    "biotoolsCURIE": "biotools:pubrecheck",
    "biotoolsID": "pubrecheck",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhiyong.lu@nih.gov",
            "name": "Zhiyong Lu",
            "orcidid": "https://orcid.org/0000-0001-9998-916X",
            "typeEntity": "Person"
        }
    ],
    "description": "How to improve automated discoverability and interpretability.\n\nData-driven research in biomedical science requires structured, computable data. Increasingly, these data are created with support from automated text mining. Text-mining tools have rapidly matured: although not perfect, they now frequently provide outstanding results. We describe 10 straightforward writing tips-and a web tool, PubReCheck-guiding authors to help address the most common cases that remain difficult for text-mining tools. We anticipate these guides will help authors' work be found more readily and used more widely, ultimately increasing the impact of their work and the overall benefit to both authors and readers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://www.ncbi.nlm.nih.gov/research/pubrecheck",
    "lastUpdate": "2021-01-29T18:19:39Z",
    "name": "PubReCheck",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PBIO.3000716",
            "metadata": {
                "abstract": "Copyright: © This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.Data-driven research in biomedical science requires structured, computable data. Increasingly, these data are created with support from automated text mining. Text-mining tools have rapidly matured: although not perfect, they now frequently provide outstanding results. We describe 10 straightforward writing tips-and a web tool, PubReCheck-guiding authors to help address the most common cases that remain difficult for text-mining tools. We anticipate these guides will help authors' work be found more readily and used more widely, ultimately increasing the impact of their work and the overall benefit to both authors and readers. PubReCheck is available at http://www.ncbi.nlm.nih.gov/research/pubrecheck.",
                "authors": [
                    {
                        "name": "Leaman R."
                    },
                    {
                        "name": "Wei C.-H."
                    },
                    {
                        "name": "Allot A."
                    },
                    {
                        "name": "Lu Z."
                    }
                ],
                "citationCount": 3,
                "date": "2020-06-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "Ten tips for a text-mining-ready article: How to improve automated discoverability and interpretability"
            },
            "pmcid": "PMC7289435",
            "pmid": "32479517"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}