{"collectionID": [], "accessibility": [], "topic": [{"term": "Toxicology", "uri": "http://edamontology.org/topic_2840"}, {"term": "Microarray experiment", "uri": "http://edamontology.org/topic_3518"}, {"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}, {"term": "Pharmacogenomics", "uri": "http://edamontology.org/topic_0208"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "14630514", "type": null, "pmcid": null, "metadata": {"title": "Array track - Supporting toxicogenomic research at the U.S. Food and Drug Administration National Center for Toxicological Research", "abstract": "The mapping of the human genome and the determination of corresponding gene functions, pathways, and biological mechanisms are driving the emergence of the new research fields of toxicogenomics and systems toxicology. Many technological advances such as microarrays are enabling this paradigm shift that indicates an unprecedented advancement in the methods of understanding the expression of toxicity at the molecular level. At the National Center for Toxicological Research (NCTR) of the U.S. Food and Drug Administration, core facilities for genomic, proteomic, and metabonomic technologies have been established that use standardized experimental procedures to support centerwide toxicogenomic research. Collectively, these facilities are continuously producing an unprecedented volume of data. NCTR plans to develop a toxico-informatics integrated system (TIS) for the purpose of fully integrating genomic, proteomic, and metabonomic data with the data in public repositories as well as conventional in vitro and in vivo toxicology data. The TIS will enable data curation in accordance with standard ontology and provide or interface a rich collection of tools for data analysis and knowledge mining. In this article the design, practical issues, and functions of the TIS are discussed through presenting its prototype version, ArrayTrack, for the management and analysis of DNA microarray data. ArrayTrack is logically constructed of three linked components: a) a library (LIB) that mirrors critical data in public databases; b) a database (MicroarrayDB) that stores microarray experiment information that is Minimal Information About a Microarray Experiment (MIAME) compliant; and c) tools (TOOL) that operate on experimental and public data for knowledge discovery. Using ArrayTrack, we can select an analysis method from the TOOL and apply the method to selected microarray data stored in the MicroarrayDB; the analysis results can be linked directly to gene information in the LIB.", "citationCount": 178, "authors": [{"name": "Tong W."}, {"name": "Cao X."}, {"name": "Harris S."}, {"name": "Sun H."}, {"name": "Fang H."}, {"name": "Fuscoe J."}, {"name": "Harris A."}, {"name": "Hong H."}, {"name": "Xie Q."}, {"name": "Perkins R."}, {"name": "Shi L."}, {"name": "Casciano D."}], "date": "2003-01-01T00:00:00Z", "journal": "Environmental Health Perspectives"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": "Weida Tong", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "wtong@nctr.fda.gov"}], "biotoolsCURIE": "biotools:arraytrack", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.fda.gov/ScienceResearch/BioinformaticsTools/Arraytrack/", "function": [{"note": null, "input": [], "operation": [{"term": "Deposition", "uri": "http://edamontology.org/operation_3431"}, {"term": "Differential gene expression analysis", "uri": "http://edamontology.org/operation_3223"}, {"term": "Gene expression profiling", "uri": "http://edamontology.org/operation_0314"}, {"term": "Gene expression analysis", "uri": "http://edamontology.org/operation_2495"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:51Z", "otherID": [], "description": "This tool provides an integrated solution for managing, analyzing, and interpreting microarray gene expression data. Specifically, it is MIAME (Minimum Information About A Microarray Experiment)-supportive for storing both microarray data and experiment parameters associated with a pharmacogenomics or toxicogenomics study.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [], "biotoolsID": "arraytrack", "additionDate": "2017-05-01T17:08:44Z", "name": "ArrayTrack", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}