{
    "additionDate": "2018-07-30T12:39:24Z",
    "biotoolsCURIE": "biotools:ultrapse",
    "biotoolsID": "ultrapse",
    "credit": [
        {
            "email": "PufengDu@gmail.com",
            "name": "Pu-Feng Du",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A universal and extensible software platform for biological sequence representations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/pufengdu/UltraPse"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pufengdu/UltraPse",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "UltraPse",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.3390/ijms18112400",
            "metadata": {
                "abstract": "© 2017 by the authors. Licensee MDPI, Basel, Switzerland.With the avalanche of biological sequences in public databases, one of the most challenging problems in computational biology is to predict their biological functions and cellular attributes. Most of the existing prediction algorithms can only handle ﬁxed-length numerical vectors. Therefore, it is important to be able to represent biological sequences with various lengths using ﬁxed-length numerical vectors. Although several algorithms, as well as software implementations, have been developed to address this problem, these existing programs can only provide a ﬁxed number of representation modes. Every time a new sequence representation mode is developed, a new program will be needed. In this paper, we propose the UltraPse as a universal software platform for this problem. The function of the UltraPse is not only to generate various existing sequence representation modes, but also to simplify all future programming works in developing novel representation modes. The extensibility of UltraPse is particularly enhanced. It allows the users to define their own representation mode, their own physicochemical properties, or even their own types of biological sequences. Moreover, UltraPse is also the fastest software of its kind. The source code package, as well as the executables for both Linux and Windows platforms, can be downloaded from the GitHub repository.",
                "authors": [
                    {
                        "name": "Du P.-F."
                    },
                    {
                        "name": "Zhao W."
                    },
                    {
                        "name": "Miao Y.-Y."
                    },
                    {
                        "name": "Wei L.-Y."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 11,
                "date": "2017-11-14T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Ultrapse: A universal and extensible software platform for representing biological sequences"
            },
            "pmcid": "PMC5713368",
            "pmid": "29135934"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1
}