
{
    "credit": [
        {
            "email": "anthony.mathelier@ncmm.uio.no",
            "name": "Anthony Mathelier",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mathelierlab.com"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/amathelier/DNAshapedTFBS/blob/master/README.md"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence (raw)",
                        "uri": "http://edamontology.org/data_3497"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Interactions of transcription factors (TFs) with DNA comprise a complex interplay between base-specific amino acid contacts and readout of DNA structure. Recent studies have highlighted the complementarity of DNA sequence and shape in modeling TF binding in vitro. Here, we have provided a comprehensive evaluation of in vivo datasets to assess the predictive power obtained by augmenting various DNA sequence-based models of TF binding sites (TFBSs) with DNA shape features (helix twist, minor groove width, propeller twist, and roll). Results from 400 human ChIP-seq datasets for 76 TFs show that combining DNA shape features with position-specific scoring matrix (PSSM) scores improves TFBS predictions. Improvement has also been observed using TF flexible models and a machine-learning approach using a binary encoding of nucleotides in lieu of PSSMs. Incorporating DNA shape information is most beneficial for E2F and MADS-domain TF families. Our findings indicate that incorporating DNA sequence and shape information benefits the modeling of TF binding under complex in vivo conditions.",
            "authors": [
                "Mathelier A.",
                "Xin B.",
                "Chiu T.-P.",
                "Yang L.",
                "Rohs R.",
                "Wasserman W.W."
            ],
            "cit_count": 34,
            "doi": "10.1016/j.cels.2016.07.001",
            "journal": "Cell Systems",
            "title": "DNA Shape Features Improve Transcription Factor Binding Site Predictions In Vivo",
            "type": "Primary",
            "year": "2016-09-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dnashapedtfbs",
        "biotoolsID": "dnashapedtfbs",
        "description": "Tool to train and apply gradient boosting classifiers to predict TFBSs within ChIP-seq data sets by combining sequence and DNA shape information. Sequence information is encoded using either classical PWMs, TFFMs, or 4-bits. DNA shape features are obtained from the GBshape browser.",
        "homepage": "https://github.com/amathelier/DNAshapedTFBS",
        "name": "DNAshapedTFBS",
        "version": [
            "1.0"
        ]
    }
}