{
    "additionDate": "2020-01-14T09:15:22Z",
    "biotoolsCURIE": "biotools:dNEMO",
    "biotoolsID": "dNEMO",
    "confidence_flag": "tool",
    "description": "A tool for quantification of mRNA and punctate structures in time-lapse images of single cells.\nABSTRACT Many biological processes are regulated by single molecules and molecular assemblies within cells that are visible by microscopy as punctate features, often diffraction limited. Here we present detecting-NEMO (dNEMO), a computational tool optimized for accurate and rapid measurement of fluorescent puncta in fixed-cell and time-lapse images. The spot detection algorithm uses the à trous wavelet transform, a computationally inexpensive method that is robust to imaging noise. By combining automated with manual spot curation in the user interface, fluorescent puncta can be carefully selected and measured against their local background to extract high quality single-cell data. Integrated into the workflow are segmentation and spot-inspection tools that enable almost real-time interaction with images without time consuming pre-processing steps.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/recleelab/dNEMO-0.9.0",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-22T09:47:27Z",
    "license": "GPL-3.0",
    "name": "dNEMO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/855213"
        },
        {
            "doi": "10.1093/bioinformatics/btaa874",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Many biological processes are regulated by single molecules and molecular assemblies within cells that are visible by microscopy as punctate features, often diffraction limited. Here, we present detecting-NEMO (dNEMO), a computational tool optimized for accurate and rapid measurement of fluorescent puncta in fixed-cell and time-lapse images. Results: The spot detection algorithm uses the à trous wavelet transform, a computationally inexpensive method that is robust to imaging noise. By combining automated with manual spot curation in the user interface, fluorescent puncta can be carefully selected and measured against their local background to extract high-quality single-cell data. Integrated into the workflow are segmentation and spot-inspection tools that enable almost real-time interaction with images without time consuming pre-processing steps. Although the software is agnostic to the type of puncta imaged, we demonstrate dNEMO using smFISH to measure transcript numbers in single cells in addition to the transient formation of IKK/NEMO puncta from time-lapse images of cells exposed to inflammatory stimuli. We conclude that dNEMO is an ideal user interface for rapid and accurate measurement of fluorescent molecular assemblies in biological imaging data.",
                "authors": [
                    {
                        "name": "Cruz J.A."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Kowalczyk G.J."
                    },
                    {
                        "name": "Lee R.E.C."
                    },
                    {
                        "name": "Sauerwald N."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "citationCount": 1,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DNEMO: A tool for quantification of mRNA and punctate structures in time-lapse images of single cells"
            },
            "pmid": "33051642"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
