{
    "additionDate": "2023-03-20T08:44:03.506832Z",
    "biotoolsCURIE": "biotools:gm_gcn",
    "biotoolsID": "gm_gcn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "weipeng1980@gmail.com",
            "name": "Wei Peng",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of cancer driver genes based on gene-miRNA regulatory network with graph convolutional model",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/weiba/GM-GCN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:52:45.937379Z",
    "license": "Not licensed",
    "name": "GM-GCN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bfgp/elac059",
            "metadata": {
                "abstract": "The development and progression of cancer arise due to the accumulation of mutations in driver genes. Correctly identifying the driver genes that lead to cancer development can significantly assist the drug design, cancer diagnosis and treatment. Most computer methods detect cancer drivers based on gene-gene networks by assuming that driver genes tend to work together, form protein complexes and enrich pathways. However, they ignore that microribonucleic acid (RNAs; miRNAs) regulate the expressions of their targeted genes and are related to human diseases. In this work, we propose a graph convolution network (GCN) approach called GM-GCN to identify the cancer driver genes based on a gene-miRNA network. First, we constructed a gene-miRNA network, where the nodes are miRNAs and their targeted genes. The edges connecting miRNA and genes indicate the regulatory relationship between miRNAs and genes. We prepared initial attributes for miRNA and genes according to their biological properties and used a GCN model to learn the gene feature representations in the network by aggregating the features of their neighboring miRNA nodes. And then, the learned features were passed through a 1D convolution module for feature dimensionality change. We employed the learned and original gene features to optimize model parameters. Finally, the gene features learned from the network and the initial input gene features were fed into a logistic regression model to predict whether a gene is a driver gene. We applied our model and state-of-the-art methods to predict cancer drivers for pan-cancer and individual cancer types. Experimental results show that our model performs well in terms of the area under the receiver operating characteristic curve and the area under the precision-recall curve compared to state-of-the-art methods that work on gene networks. The GM-GCN is freely available via https://github.com/weiba/GM-GCN.",
                "authors": [
                    {
                        "name": "Dai W."
                    },
                    {
                        "name": "Fu X."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Ning Y."
                    },
                    {
                        "name": "Peng W."
                    },
                    {
                        "name": "Wu R."
                    }
                ],
                "citationCount": 5,
                "date": "2023-07-01T00:00:00Z",
                "journal": "Briefings in Functional Genomics",
                "title": "MiRNA-gene network embedding for predicting cancer driver genes"
            },
            "pmid": "36752023"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
