{
    "additionDate": "2017-01-17T15:00:36Z",
    "biotoolsCURIE": "biotools:cogena",
    "biotoolsID": "cogena",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "zhilongjia@gmail.com",
            "name": "Zhilong Jia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Workflow for co-expressed gene-set enrichment analysis. It aims to discovery smaller scale, but highly correlated cellular events that may be of great biological relevance. A novel pipeline for drug discovery and drug repositioning based on the workflow is proposed. Particularly, candidate drugs can be predicted based on the gene expression of disease-related data, or other similar drugs can be identified based on the gene expression of drug-related data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/cogena.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/cogena_1.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/cogena.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/zhilongjia/cogena"
        }
    ],
    "name": "cogena",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s12864-016-2737-8",
            "metadata": {
                "abstract": "© 2016 Jia et al.Background: Drug repositioning, finding new indications for existing drugs, has gained much recent attention as a potentially efficient and economical strategy for accelerating new therapies into the clinic. Although improvement in the sensitivity of computational drug repositioning methods has identified numerous credible repositioning opportunities, few have been progressed. Arguably the \"black box\" nature of drug action in a new indication is one of the main blocks to progression, highlighting the need for methods that inform on the broader target mechanism in the disease context. Results: We demonstrate that the analysis of co-expressed genes may be a critical first step towards illumination of both disease pathology and mode of drug action. We achieve this using a novel framework, co-expressed gene-set enrichment analysis (cogena) for co-expression analysis of gene expression signatures and gene set enrichment analysis of co-expressed genes. The cogena framework enables simultaneous, pathway driven, disease and drug repositioning analysis. Cogena can be used to illuminate coordinated changes within disease transcriptomes and identify drugs acting mechanistically within this framework. We illustrate this using a psoriatic skin transcriptome, as an exemplar, and recover two widely used Psoriasis drugs (Methotrexate and Ciclosporin) with distinct modes of action. Cogena out-performs the results of Connectivity Map and NFFinder webservers in similar disease transcriptome analyses. Furthermore, we investigated the literature support for the other top-ranked compounds to treat psoriasis and showed how the outputs of cogena analysis can contribute new insight to support the progression of drugs into the clinic. We have made cogena freely available within Bioconductor or https://github.com/zhilongjia/cogena. Conclusions: In conclusion, by targeting co-expressed genes within disease transcriptomes, cogena offers novel biological insight, which can be effectively harnessed for drug discovery and repositioning, allowing the grouping and prioritisation of drug repositioning candidates on the basis of putative mode of action.",
                "authors": [
                    {
                        "name": "Barnes M.R."
                    },
                    {
                        "name": "Bo X."
                    },
                    {
                        "name": "Guan N."
                    },
                    {
                        "name": "Jia Z."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Luo Z."
                    }
                ],
                "citationCount": 28,
                "date": "2016-05-27T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Cogena, a novel tool for co-expressed gene-set enrichment analysis, applied to drug repositioning and drug mode of action discovery"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.8.0"
    ]
}
