{
    "additionDate": "2017-02-10T11:35:16Z",
    "biotoolsCURIE": "biotools:vampire",
    "biotoolsID": "vampire",
    "credit": [
        {
            "email": "ckling@ucsd.edu",
            "name": "Carol Kling",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Collection of Java tools designed to perform Bayesian statistical analysis of gene expression array data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucsd.edu/microarray/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "VAMPIRE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Microarrays are invaluable high-throughput tools used to snapshot the gene expression profiles of cells and tissues. Among the most basic and fundamental questions asked of microarray data is whether individual genes are significantly activated or repressed by a particular stimulus. We have previously presented two Bayesian statistical methods for this level of analysis, collectively known as variance-modeled posterior inference with regional exponentials (VAMPIRE). These methods each require a sophisticated modeling step followed by integration of a posterior probability density. We present here a publicly available, web-based platform that allows users to easily load data, associate related samples and identify differentially expressed features using the VAMPIRE statistical framework. In addition, this suite of tools seamlessly integrates a novel gene annotation tool, known as GOby, which identifies statistically overrepresented gene groups. Unlike other tools in this genre, GOby can localize enrichment while respecting the hierarchical structure of annotation systems like Gene Ontology (GO). By identifying statistically significant enrichment of GO terms, Kyoto Encyclopedia of Genes and Genomes pathways, and TRANSFAC transcription factor binding sites, users can gain substantial insight into the physiological significance of sets of differentially expressed genes. The VAMPIRE microarray suite can be accessed at http://genome.ucsd.edu/ microarray. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Hsiao A."
                    },
                    {
                        "name": "Ideker T."
                    },
                    {
                        "name": "Olefsky J.M."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 80,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VAMPIRE microarray suite: A web-based platform for the interpretation of gene expression data"
            },
            "pmid": "15980550"
        },
        {
            "metadata": {
                "abstract": "Motivation: Microarrays are becoming an increasingly common tool for observing changes in gene expression over a large cross section of the genome. This experimental tool is particularly valuable for understanding the genome-wide changes in gene transcription in response to thiazolidinedione (TZD) treatment. The TZD class of drugs is known to improve insulin-sensitivity in diabetic patients, and is clinically used in treatment regimens. In cells, TZDs bind to and activate the transcriptional activity of peroxisome proliferator-activated receptor gamma (PPAR-γ). Large-scale array analyses will provide some insight into the mechanisms of TZD-mediated insulin sensitization. Unfortunately, a theoretical basis for analyzing array data has not kept pace with the rapid adoption of this tool. The methods that are commonly used, particularly the fold-change approach and the standard t-test, either lack statistical rigor or resort to generalized statistical models that do not accurately estimate variability at low replicate numbers. Results: We introduce a statistical framework that models the dependence of measurement variance on the level of gene expression in the context of a Bayesian hierarchical model. We compare several methods of parameter estimation and subsequently apply these to determine a set of genes in 3T3-L1 adipocytes that are differentially regulated in response to TZD treatment. When the number of experimental replicates is low (n = 2-3), this approach appears to qualitatively preserve an equivalent degree of specificity, while vastly improving sensitivity over other comparable methods. In addition, the statistical framework developed here can be readily applied to understand the implicit assumptions made in traditional fold-change approaches to array analysis. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Hsiao A."
                    },
                    {
                        "name": "Olefsky J.M."
                    },
                    {
                        "name": "Subramaniam S."
                    },
                    {
                        "name": "Worrall D.S."
                    }
                ],
                "citationCount": 71,
                "date": "2004-11-22T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Variance-modeled posterior inference of microarray data: Detecting gene-expression changes in 3T3-L1 adipocytes"
            },
            "pmid": "15217816"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
