{"collectionID": ["BioConductor"], "accessibility": [], "topic": [{"term": "Microarray experiment", "uri": "http://edamontology.org/topic_3518"}, {"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}], "owner": "bioconductor_import", "cost": null, "relation": [], "download": [{"url": "http://bioconductor/packages/release/bioc/src/contrib/nudge_1.40.0.tar.gz", "note": null, "version": null, "type": "Source code"}], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-6-173", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Normal uniform mixture differential gene expression detection for cDNA microarrays", "abstract": "Background: One of the primary tasks in analysing gene expression data is finding genes that are differentially expressed in different samples. Multiple testing issues due to the thousands of tests run make some of the more popular methods for doing this problematic. Results: We propose a simple method, Normal Uniform Differential Gene Expression (NUDGE) detection for finding differentially expressed genes in cDNA microarrays. The method uses a simple univariate normal-uniform mixture model, in combination with new normalization methods for spread as well as mean that extend the lowess normalization of Dudoit, Yang, Callow and Speed (2002) [1]. It takes account of multiple testing, and gives probabilities of differential expression as part of its output. It can be applied to either single-slide or replicated experiments, and it is very fast. Three datasets are analyzed using NUDGE, and the results are compared to those given by other popular methods: unadjusted and Bonferroni-adjusted t tests, Significance Analysis of Microarrays (SAM), and Empirical Bayes for microarrays (EBarrays) with both Gamma-Gamma and Lognormal-Normal models. Conclusion: The method gives a high probability of differential expression to genes known/suspected a priori to be differentially expressed and a low probability to the others. In terms of known false positives and false negatives, the method outperforms all multiple-replicate methods except for the Gamma-Gamma EBarrays method to which it offers comparable results with the added advantages of greater simplicity, speed, fewer assumptions and applicability to the single replicate case. An R package called nudge to implement the methods in this paper will be made available soon at http://www.bioconductor.org. © 2005 Dean and Raftery; licensee BioMed Central Ltd.", "citationCount": 45, "authors": [{"name": "Dean N."}, {"name": "Raftery A.E."}], "date": "2005-07-12T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "N. Dean", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "nemad@stat.washington.edu"}], "biotoolsCURIE": "biotools:nudge", "elixirPlatform": [], "elixirNode": [], "version": ["1.40.0"], "elixir_badge": 0, "homepage": "http://bioconductor.org/packages/release/bioc/html/nudge.html", "function": [{"note": null, "input": [], "operation": [{"term": "Standardisation and normalisation", "uri": "http://edamontology.org/operation_3435"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:53Z", "otherID": [], "description": "Package for normalizing microarray data in single and multiple replicate experiments and fitting a normal-uniform mixture to detect differentially expressed genes in the cases where the two samples are being compared directly or indirectly (via a common reference sample).", "toolType": ["Command-line tool", "Library"], "editPermission": {"type": "private", "authors": []}, "language": ["R"], "link": [], "biotoolsID": "nudge", "additionDate": "2017-01-17T15:02:28Z", "name": "nudge", "license": "GPL-2.0", "documentation": [{"url": "http://bioconductor.org/packages/release/bioc/html/nudge.html", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}