{
    "additionDate": "2021-01-18T10:59:22Z",
    "biotoolsCURIE": "biotools:sem1r",
    "biotoolsID": "sem1r",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "malinfr1@fel.cvut.cz",
            "name": "František Malinka",
            "orcidid": "https://orcid.org/0000-0002-9681-4716",
            "typeEntity": "Person"
        }
    ],
    "description": "Finding semantic patterns in omics data using concept rule learning with an ontology-based refinement operator.\n\nsem1R is a machine learning algorithm that finds interesting, hidden, and non-trivial semantic patterns in omics data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://github.com/fmalinka/sem1r",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-02-16T14:09:03Z",
    "name": "sem1R",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S13040-020-00219-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Identification of non-trivial and meaningful patterns in omics data is one of the most important biological tasks. The patterns help to better understand biological systems and interpret experimental outcomes. A well-established method serving to explain such biological data is Gene Set Enrichment Analysis. However, this type of analysis is restricted to a specific type of evaluation. Abstracting from details, the analyst provides a sorted list of genes and ontological annotations of the individual genes; the method outputs a subset of ontological terms enriched in the gene list. Here, in contrary to enrichment analysis, we introduce a new tool/framework that allows for the induction of more complex patterns of 2-dimensional binary omics data. This extension allows to discover and describe semantically coherent biclusters. Results: We present a new rapid method called sem1R that reveals interpretable hidden rules in omics data. These rules capture semantic differences between two classes: a target class as a collection of positive examples and a non-target class containing negative examples. The method is inspired by the CN2 rule learner and introduces a new refinement operator that exploits prior knowledge in the form of ontologies. In our work this knowledge serves to create accurate and interpretable rules. The novel refinement operator uses two reduction procedures: Redundant Generalization and Redundant Non-potential, both of which help to dramatically prune the rule space and consequently, speed-up the entire process of rule induction in comparison with the traditional refinement operator as is presented in CN2. Conclusions: Efficiency and effectivity of the novel refinement operator were tested on three real different gene expression datasets. Concretely, the Dresden Ovary Dataset, DISC, and m2816 were employed. The experiments show that the ontology-based refinement operator speeds-up the pattern induction drastically. The algorithm is written in C++ and is published as an R package available at http://github.com/fmalinka/sem1r.",
                "authors": [
                    {
                        "name": "Klema J."
                    },
                    {
                        "name": "Malinka F."
                    },
                    {
                        "name": "Zelezny F."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "BioData Mining",
                "title": "Finding semantic patterns in omics data using concept rule learning with an ontology-based refinement operator"
            },
            "pmcid": "PMC7466824",
            "pmid": "32905086"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
