{
    "additionDate": "2020-01-09T17:56:39Z",
    "biotoolsCURIE": "biotools:Nglyc",
    "biotoolsID": "Nglyc",
    "confidence_flag": "tool",
    "description": "A random forest method for prediction of N-Glycosylation sites in eukaryotic protein sequence.\n\nN-Glycosylation is one of the most important post-translational mechanisms in eukaryotes. It plays a vital role in various biological processes such as protein folding, stability, immunogenicity of different proteins, cell signaling and protein targeting. N-glycosylation predominantly occurs in N-X-[S T] sequon where X is any amino acid other than proline. However, not all N-X-[S T] sequons in proteins are glycosylated. Therefore, accurate prediction of N-glycosylation sites is essential to understand N-glycosylation mechanism. We developed a random forest method, Nglyc, to predict N-glycosylation sites in eukaryotic protein sequences. The method used 315 features derived from a protein sequence and its sequence homologs. Training and testing was performed using a dataset containing 895 N-glycosylation sites and 853 non-glycosylated sites obtained from 846 PDB structures",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinformaticsML/Ngly",
    "lastUpdate": "2021-01-04T08:15:04Z",
    "name": "Nglyc",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2174/0929866526666191002111404",
            "metadata": {
                "abstract": "© 2020 Bentham Science Publishers.Background: N-Glycosylation is one of the most important post-translational mechanisms in eukaryotes. N-glycosylation predominantly occurs in N-X-[S/T] sequon where X is any amino acid other than proline. However, not all N-X-[S/T] sequons in proteins are glycosylated. Therefore, accurate prediction of N-glycosylation sites is essential to understand Nglycosylation mechanism. Objective: In this article, our motivation is to develop a computational method to predict Nglycosylation sites in eukaryotic protein sequences. Methods: In this article, we report a random forest method, Nglyc, to predict N-glycosylation site from protein sequence, using 315 sequence features. The method was trained using a dataset of 600 N-glycosylation sites and 600 non-glycosylation sites and tested on the dataset containing 295 Nglycosylation sites and 253 non-glycosylation sites. Nglyc prediction was compared with NetNGlyc, EnsembleGly and GPP methods. Further, the performance of Nglyc was evaluated using human and mouse N-glycosylation sites. Result: Nglyc method achieved an overall training accuracy of 0.8033 with all 315 features. Performance comparison with NetNGlyc, EnsembleGly and GPP methods shows that Nglyc performs better than the other methods with high sensitivity and specificity rate. Conclusion: Our method achieved an overall accuracy of 0.8248 with 0.8305 sensitivity and 0.8182 specificity. Comparison study shows that our method performs better than the other methods. Applicability and success of our method was further evaluated using human and mouse N-glycosylation sites. Nglyc method is freely available at https://github.com/bioinformaticsML/ Ngly.",
                "authors": [
                    {
                        "name": "Pugalenthi G."
                    },
                    {
                        "name": "Nithya V."
                    },
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Archunan G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein and Peptide Letters",
                "title": "Nglyc: A random forest method for prediction of n-glycosylation sites in eukaryotic protein sequence"
            },
            "pmid": "31577193"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}