{
    "accessibility": "Open access",
    "additionDate": "2022-08-29T22:36:59.738819Z",
    "biotoolsCURIE": "biotools:tdthub",
    "biotoolsID": "tdthub",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jmfranco@cnb.csic.es",
            "name": "José M. Franco-Zorrilla",
            "orcidid": "https://orcid.org/0000-0001-6769-7349"
        },
        {
            "name": "Joaquín Grau"
        }
    ],
    "description": "Web server tool for the analysis of transcription factor binding sites in plants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene name",
                        "uri": "http://edamontology.org/data_2299"
                    }
                }
            ],
            "operation": [
                {
                    "term": "DNA transcription",
                    "uri": "http://edamontology.org/operation_0372"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://acrab.cnb.csic.es/TDTHub/",
    "lastUpdate": "2022-08-29T22:38:09.173089Z",
    "name": "TDTHub",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1111/TPJ.15873",
            "metadata": {
                "abstract": "© 2022 The Authors. The Plant Journal published by Society for Experimental Biology and John Wiley & Sons Ltd.Transcriptional regulation underlies most developmental programs and physiological responses to environmental changes in plants. Transcription factors (TFs) play a key role in the regulation of gene expression by binding specifically to short DNA sequences in the regulatory regions of genes: the TF binding sites (TFBSs). In recent years, several bioinformatic tools have been developed to detect TFBSs in candidate genes, either by de novo prediction or by directly mapping experimentally known TFBSs. However, most of these tools contain information for only a few species or require multi-step procedures, and are not always intuitive for non-experienced researchers. Here we present TFBS-Discovery Tool Hub (TDTHub), a web server for quick and intuitive studies of transcriptional regulation in plants. TDTHub uses pre-computed TFBSs in 40 plant species and allows the choice of two mapping algorithms, providing a higher versatility. Besides the main TFBS enrichment tool, TDTHub includes additional tools to assist in the analysis and visualization of data. In order to demonstrate the effectiveness of TDTHub, we analyzed the transcriptional regulation of the anthocyanin biosynthesis pathway. We also analyzed the transcriptional cascades in response to jasmonate and wounding in Arabidopsis and tomato (Solanum lycopersicum), respectively. In these studies, TDTHub helped to verify the most relevant TF nodes and to propose new ones with a prominent role in these pathways. TDTHub is available at http://acrab.cnb.csic.es/TDTHub/, and it will be periodically upgraded and expanded for new species and gene annotations.",
                "authors": [
                    {
                        "name": "Franco-Zorrilla J.M."
                    },
                    {
                        "name": "Grau J."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "TDTHub, a web server tool for the analysis of transcription factor binding sites in plants"
            },
            "pmid": "35713985"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
