{
    "additionDate": "2016-04-22T12:29:14Z",
    "biotoolsCURIE": "biotools:guild",
    "biotoolsID": "guild",
    "credit": [
        {
            "name": "Emre Guney",
            "orcidid": "http://orcid.org/0000-0002-3466-6535",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "upf.edu",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "baldo.oliva@upf.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Framework built for the prioritization of disease candidate genes using a priori gene-disease associations and protein interactions. It consists of implementations of 8 algorithms: NetScore, NetZcore, NetShort, NetCombo, fFlow, NetRank, NetWalk and NetProp.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sbi.imim.es/web/index.php/research/software/guildsoftware"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Prioritization of genes associated with a phenotype or disease",
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://sbi.imim.es/web/index.php/research/software/guildsoftware",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2019-01-09T15:56:56Z",
    "name": "GUILD",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "baldo.oliva@upf.edu",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0043557",
            "metadata": {
                "abstract": "Complex genetic disorders often involve products of multiple genes acting cooperatively. Hence, the pathophenotype is the outcome of the perturbations in the underlying pathways, where gene products cooperate through various mechanisms such as protein-protein interactions. Pinpointing the decisive elements of such disease pathways is still challenging. Over the last years, computational approaches exploiting interaction network topology have been successfully applied to prioritize individual genes involved in diseases. Although linkage intervals provide a list of disease-gene candidates, recent genome-wide studies demonstrate that genes not associated with any known linkage interval may also contribute to the disease phenotype. Network based prioritization methods help highlighting such associations. Still, there is a need for robust methods that capture the interplay among disease-associated genes mediated by the topology of the network. Here, we propose a genome-wide network-based prioritization framework named GUILD. This framework implements four network-based disease-gene prioritization algorithms. We analyze the performance of these algorithms in dozens of disease phenotypes. The algorithms in GUILD are compared to state-of-the-art network topology based algorithms for prioritization of genes. As a proof of principle, we investigate top-ranking genes in Alzheimer's disease (AD), diabetes and AIDS using disease-gene associations from various sources. We show that GUILD is able to significantly highlight disease-gene associations that are not used a priori. Our findings suggest that GUILD helps to identify genes implicated in the pathology of human disorders independent of the loci associated with the disorders. © 2012 Guney, Oliva.",
                "authors": [
                    {
                        "name": "Guney E."
                    },
                    {
                        "name": "Oliva B."
                    }
                ],
                "citationCount": 63,
                "date": "2012-09-21T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Exploiting Protein-Protein Interaction Networks for Genome-Wide Disease-Gene Prioritization"
            },
            "pmcid": "PMC3448640",
            "pmid": "23028459",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Systems medicine",
            "uri": "http://edamontology.org/topic_3396"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}