{
    "additionDate": "2023-02-19T11:21:43.157959Z",
    "biotoolsCURIE": "biotools:deeprmsd_vina",
    "biotoolsID": "deeprmsd_vina",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "astrozheng@gmail.com",
            "name": "Weifeng Li",
            "typeEntity": "Person"
        },
        {
            "email": "lwf@sdu.edu.cn",
            "name": "Liangzhen Zheng",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepRMSD+Vina is a computational framework that integrates ligand binding pose optimization and screening.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zchwang/DeepRMSD-Vina_Optimization",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-19T11:21:43.160725Z",
    "license": "Not licensed",
    "name": "DeepRMSD+Vina",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC520",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The recently reported machine learning- or deep learning-based scoring functions (SFs) have shown exciting performance in predicting protein-ligand binding affinities with fruitful application prospects. However, the differentiation between highly similar ligand conformations, including the native binding pose (the global energy minimum state), remains challenging that could greatly enhance the docking. In this work, we propose a fully differentiable, end-to-end framework for ligand pose optimization based on a hybrid SF called DeepRMSD+Vina combined with a multi-layer perceptron (DeepRMSD) and the traditional AutoDock Vina SF. The DeepRMSD+Vina, which combines (1) the root mean square deviation (RMSD) of the docking pose with respect to the native pose and (2) the AutoDock Vina score, is fully differentiable; thus is capable of optimizing the ligand binding pose to the energy-lowest conformation. Evaluated by the CASF-2016 docking power dataset, the DeepRMSD+Vina reaches a success rate of 94.4%, which outperforms most reported SFs to date. We evaluated the ligand conformation optimization framework in practical molecular docking scenarios (redocking and cross-docking tasks), revealing the high potentialities of this framework in drug design and discovery. Structural analysis shows that this framework has the ability to identify key physical interactions in protein-ligand binding, such as hydrogen-bonding. Our work provides a paradigm for optimizing ligand conformations based on deep learning algorithms. The DeepRMSD+Vina model and the optimization framework are available at GitHub repository https://github.com/zchwang/DeepRMSD-Vina_Optimization.",
                "authors": [
                    {
                        "name": "Kong A.W.-K."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Lin M."
                    },
                    {
                        "name": "Mu Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Zheng L."
                    }
                ],
                "date": "2023-01-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "A fully differentiable ligand pose optimization framework guided by deep learning and a traditional scoring function"
            },
            "pmid": "36502369"
        }
    ],
    "toolType": [
        "Script",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
