{
    "additionDate": "2019-11-14T18:42:42Z",
    "biotoolsCURIE": "biotools:Data",
    "biotoolsID": "Data",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "mmrojasgracia@uma.es",
            "name": "María-Mercedes Rojas-de-Gracia",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | Data set on the influence of members of a couple on family vacation decision-making | This article describes a database on the perceptions of members of a couple regarding the influence exerted in three stages (initiation, search, and final decision) and seven sub-decisions (destination, accommodation, transport, budget, date, activities, restaurants) in the family vacation decision-making process. We obtained responses from 375 couples, whose members each completed the questionnaire individually, which also enables researchers to obtain information about the consensus between the perceptions of both regarding said influence. To complement this information, we also included sociodemographic and travel behavior variables for the couples analyzed. The data are publicly available at https: github.com mmrojasgracia Data-in-Brief_Influence",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/mmrojasgracia/Data-in-Brief_Influence",
    "lastUpdate": "2019-11-14T18:42:42Z",
    "name": "Data",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.DIB.2019.104233",
            "metadata": {
                "abstract": "© 2019 The AuthorsThis article describes a database on the perceptions of members of a couple regarding the influence exerted in three stages (initiation, search, and final decision) and seven sub-decisions (destination, accommodation, transport, budget, date, activities, restaurants) in the family vacation decision-making process. We obtained responses from 375 couples, whose members each completed the questionnaire individually, which also enables researchers to obtain information about the consensus between the perceptions of both regarding said influence. To complement this information, we also included sociodemographic and travel behavior variables for the couples analyzed. The data are publicly available at https://github.com/mmrojasgracia/Data-in-Brief_Influence. For interpretation and discussion, please see the original article entitled “Is asking only one member of a couple sufficient to determine who influences tourism decisions?” (Rojas-de-Gracia et al., 2019) (Rojas-de-Gracia et al., 2019).",
                "authors": [
                    {
                        "name": "Rojas-de-Gracia M.-M."
                    },
                    {
                        "name": "Alarcon-Urbistondo P."
                    },
                    {
                        "name": "Casado-Molina A.-M."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "Data in Brief",
                "title": "Data set on the influence of members of a couple on family vacation decision-making"
            },
            "pmcid": "PMC6702380",
            "pmid": "31453280"
        }
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ]
}