{
    "accessibility": "Open access",
    "additionDate": "2019-05-25T21:03:38Z",
    "biotoolsCURIE": "biotools:BEAN-counter",
    "biotoolsID": "BEAN-counter",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Myers Lab",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://csbio.cs.umn.edu/"
        }
    ],
    "description": "Pipeline for processing barcode sequencing data from multiplexed experiments. Applicable to any experiment in which pools of genetically barcoded cells are grown under different conditions, with the resulting barcode DNA isolated from those cells combined into one 2nd-gen sequencing run via the use of indexed PCR primers.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/barseqcounterdocs/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csbio/BEAN-counter",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-25T13:45:25.914301Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "BEAN-counter",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1038/s41596-018-0099-1",
            "metadata": {
                "abstract": "The construction of genome-wide mutant collections has enabled high-throughput, high-dimensional quantitative characterization of gene and chemical function, particularly via genetic and chemical–genetic interaction experiments. As the throughput of such experiments increases with improvements in sequencing technology and sample multiplexing, appropriate tools must be developed to handle the large volume of data produced. Here, we describe how to apply our approach to high-throughput, fitness-based profiling of pooled mutant yeast collections using the BEAN-counter software pipeline (Barcoded Experiment Analysis for Next-generation sequencing) for analysis. The software has also successfully processed data from Schizosaccharomyces pombe, Escherichia coli, and Zymomonas mobilis mutant collections. We provide general recommendations for the design of large-scale, multiplexed barcode sequencing experiments. The procedure outlined here was used to score interactions for ~4 million chemical-by-mutant combinations in our recently published chemical–genetic interaction screen of nearly 14,000 chemical compounds across seven diverse compound collections. Here we selected a representative subset of these data on which to demonstrate our analysis pipeline. BEAN-counter is open source, written in Python, and freely available for academic use. Users should be proficient at the command line; advanced users who wish to analyze larger datasets with hundreds or more conditions should also be familiar with concepts in analysis of high-throughput biological data. BEAN-counter encapsulates the knowledge we have accumulated from, and successfully applied to, our multiplexed, pooled barcode sequencing experiments. This protocol will be useful to those interested in generating their own high-dimensional, quantitative characterizations of gene or chemical function in a high-throughput manner.",
                "authors": [
                    {
                        "name": "Boone C."
                    },
                    {
                        "name": "Deshpande R."
                    },
                    {
                        "name": "Li S.C."
                    },
                    {
                        "name": "Myers C.L."
                    },
                    {
                        "name": "Nelson J."
                    },
                    {
                        "name": "Osada H."
                    },
                    {
                        "name": "Piotrowski J.S."
                    },
                    {
                        "name": "Simpkins S.W."
                    },
                    {
                        "name": "Ward H.N."
                    },
                    {
                        "name": "Yashiroda Y."
                    },
                    {
                        "name": "Yoshida M."
                    }
                ],
                "citationCount": 15,
                "date": "2019-02-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Using BEAN-counter to quantify genetic interactions from multiplexed barcode sequencing experiments"
            },
            "pmcid": "PMC6818255",
            "pmid": "30635653",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
