{
    "additionDate": "2019-02-20T15:32:40Z",
    "biotoolsCURIE": "biotools:TPP_SPC",
    "biotoolsID": "TPP_SPC",
    "collectionID": [
        "Proteomics",
        "ms-utils"
    ],
    "credit": [
        {
            "email": "infoproteome@systemsbiology.org",
            "name": "see publication",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        }
    ],
    "description": "Institute for Systems Biology \"Trans-Proteomic Pipeline\"",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "homepage": "http://tools.proteomecenter.org/software.php",
    "lastUpdate": "2024-11-25T14:04:33.012260Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "name": "Trans-Proteomic Pipeline (TPP)",
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1002/pmic.200900375",
            "metadata": {
                "abstract": "The Trans-Proteomic Pipeline (TPP) is a suite of software tools for the analysis of MS/MS data sets. The tools encompass most of the steps in a proteomic data analysis workflow in a single, integrated software system. Specifically, the TPP supports all steps from spectrometer output file conversion to protein-level statistical validation, including quantification by stable isotope ratios. We describe here the full workflow of the TPP and the tools therein, along with an example on a sample data set, demonstrating that the setup and use of the tools are straightforward and well supported and do not require specialized informatic resources or knowledge.",
                "authors": [
                    {
                        "name": "Aebersold R."
                    },
                    {
                        "name": "Deutsch E.W."
                    },
                    {
                        "name": "Eng J.K."
                    },
                    {
                        "name": "Farrah T."
                    },
                    {
                        "name": "Lam H."
                    },
                    {
                        "name": "Martin D.B."
                    },
                    {
                        "name": "Mendoza L."
                    },
                    {
                        "name": "Nesvizhskii A.I."
                    },
                    {
                        "name": "Nilsson E."
                    },
                    {
                        "name": "Pratt B."
                    },
                    {
                        "name": "Prazen B."
                    },
                    {
                        "name": "Shteynberg D."
                    },
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Tasman N."
                    }
                ],
                "citationCount": 635,
                "date": "2010-03-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "A guided tour of the Trans-Proteomic Pipeline"
            },
            "pmcid": "PMC3017125",
            "pmid": "20101611"
        },
        {
            "doi": "10.1002/prca.201400164",
            "metadata": {
                "abstract": "Democratization of genomics technologies has enabled the rapid determination of genotypes. More recently the democratization of comprehensive proteomics technologies is enabling the determination of the cellular phenotype and the molecular events that define its dynamic state. Core proteomic technologies include MS to define protein sequence, protein:protein interactions, and protein PTMs. Key enabling technologies for proteomics are bioinformatic pipelines to identify, quantitate, and summarize these events. The Trans-Proteomics Pipeline (TPP) is a robust open-source standardized data processing pipeline for large-scale reproducible quantitative MS proteomics. It supports all major operating systems and instrument vendors via open data formats. Here, we provide a review of the overall proteomics workflow supported by the TPP, its major tools, and how it can be used in its various modes from desktop to cloud computing. We describe new features for the TPP, including data visualization functionality. We conclude by describing some common perils that affect the analysis of MS/MS datasets, as well as some major upcoming features.",
                "authors": [
                    {
                        "name": "Deutsch E.W."
                    },
                    {
                        "name": "Mendoza L."
                    },
                    {
                        "name": "Moritz R.L."
                    },
                    {
                        "name": "Shteynberg D."
                    },
                    {
                        "name": "Slagel J."
                    },
                    {
                        "name": "Sun Z."
                    }
                ],
                "citationCount": 271,
                "date": "2015-08-01T00:00:00Z",
                "journal": "Proteomics - Clinical Applications",
                "title": "Trans-Proteomic Pipeline, a standardized data processing pipeline for large-scale reproducible proteomics informatics"
            },
            "pmcid": "PMC4506239",
            "pmid": "25631240"
        },
        {
            "doi": "10.1007/978-1-60761-444-9_15",
            "metadata": {
                "abstract": "Mass spectrometry has quickly become an essential tool in molecular biology laboratories. Here, we describe the Trans-Proteomic Pipeline, a collection of software tools, to facilitate the analysis, exchange, and comparison of MS data. The pipeline is instrument-independent and supports most commonly used proteomics workflows, including quantitative applications such as ICAT, iTRAQ, and SILAC. Importantly, the pipeline uses open, standard data formats and calculates accurate estimates of sensitivity and error rates, thus allowing for meaningful data exchange. In this chapter, we will introduce the various components of the pipeline in the context of three typical proteomic use-case scenarios.",
                "authors": [
                    {
                        "name": "Pedrioli P.G."
                    }
                ],
                "citationCount": 123,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Methods in molecular biology (Clifton, N.J.)",
                "title": "Trans-proteomic pipeline: a pipeline for proteomic analysis."
            },
            "pmid": "20013374"
        },
        {
            "doi": "10.1007/978-1-60761-977-2_12",
            "metadata": {
                "abstract": "The LC-MS/MS shotgun proteomics workflow is widely used to identify and quantify sample peptides and proteins. The technique, however, presents a number of challenges for large-scale use, including the diverse raw data file formats output by mass spectrometers, the large false positive rate among peptide assignments to MS/MS spectra, and the loss of connectivity between identified peptides and the sample proteins that gave rise to them. Here we describe the Trans-Proteomic Pipeline, a freely available open source software suite that provides uniform analysis of LC-MS/MS data from raw data to quantified sample proteins. In a straightforward manner, users can extract MS/MS information from raw data of many instrument formats, submit them to search engines for peptide identification, validate the results to remove false hits, combine together results of multiple search engines, infer sample proteins that gave rise to the identified peptides, and perform quantitation at the peptide and protein levels.",
                "authors": [
                    {
                        "name": "Keller A."
                    },
                    {
                        "name": "Shteynberg D."
                    }
                ],
                "citationCount": 40,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Software Pipeline and Data Analysis for MS/MS Proteomics: The Trans-Proteomic Pipeline"
            },
            "pmid": "21082435"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
