{
    "additionDate": "2020-01-14T20:10:48Z",
    "biotoolsCURIE": "biotools:scCCESS",
    "biotoolsID": "scCCESS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pengyi.yang@sydney.edu.au",
            "name": "Pengyi Yang",
            "orcidid": "https://orcid.org/0000-0003-1098-3138",
            "typeEntity": "Person"
        }
    ],
    "description": "Autoencoder-based cluster ensembles for single-cell RNA-seq data analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gedcom/scCCESS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-16T12:55:57Z",
    "name": "scCCESS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3179-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Single-cell RNA-sequencing (scRNA-seq) is a transformative technology, allowing global transcriptomes of individual cells to be profiled with high accuracy. An essential task in scRNA-seq data analysis is the identification of cell types from complex samples or tissues profiled in an experiment. To this end, clustering has become a key computational technique for grouping cells based on their transcriptome profiles, enabling subsequent cell type identification from each cluster of cells. Due to the high feature-dimensionality of the transcriptome (i.e. the large number of measured genes in each cell) and because only a small fraction of genes are cell type-specific and therefore informative for generating cell type-specific clusters, clustering directly on the original feature/gene dimension may lead to uninformative clusters and hinder correct cell type identification. Results: Here, we propose an autoencoder-based cluster ensemble framework in which we first take random subspace projections from the data, then compress each random projection to a low-dimensional space using an autoencoder artificial neural network, and finally apply ensemble clustering across all encoded datasets to generate clusters of cells. We employ four evaluation metrics to benchmark clustering performance and our experiments demonstrate that the proposed autoencoder-based cluster ensemble can lead to substantially improved cell type-specific clusters when applied with both the standard k-means clustering algorithm and a state-of-the-art kernel-based clustering algorithm (SIMLR) designed specifically for scRNA-seq data. Compared to directly using these clustering algorithms on the original datasets, the performance improvement in some cases is up to 100%, depending on the evaluation metric used. Conclusions: Our results suggest that the proposed framework can facilitate more accurate cell type identification as well as other downstream analyses. The code for creating the proposed autoencoder-based cluster ensemble framework is freely available from https://github.com/gedcom/scCCESS.",
                "authors": [
                    {
                        "name": "Geddes T.A."
                    },
                    {
                        "name": "Kim T."
                    },
                    {
                        "name": "Nan L."
                    },
                    {
                        "name": "Burchfield J.G."
                    },
                    {
                        "name": "Yang J.Y.H."
                    },
                    {
                        "name": "Tao D."
                    },
                    {
                        "name": "Yang P."
                    }
                ],
                "citationCount": 6,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Autoencoder-based cluster ensembles for single-cell RNA-seq data analysis"
            },
            "pmcid": "PMC6929272",
            "pmid": "31870278"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}