{
    "additionDate": "2017-12-18T00:06:00Z",
    "biotoolsCURIE": "biotools:epces",
    "biotoolsID": "epces",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sysbio.unl.edu/"
        }
    ],
    "description": "EPCES (Epitopes ConsEnsus Scoring) is a new antigen Epitope Prediction method from six different scoring functions – residue epitope propensity, conservation score, side-chain energy score, contact number, surface planarity score, and secondary structure composition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://sysbio.unl.edu/EPCES",
    "lastUpdate": "2018-12-10T12:58:46Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/epces-prediction-of-antigenic-epitopes-on-protein-surfaces-by-consensus-scoring.html"
        }
    ],
    "name": "EPCES",
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/prot.21498",
            "metadata": {
                "abstract": "Near-native selections from docking decoys have proved challenging especially when unbound proteins are used in the molecular docking. One reason is that significant atomic clashes in docking decoys lead to poor predictions of binding affinities of near native decoys. Atomic clashes can be removed by structural refinement through energy minimization. Such an energy minimization, however, will lead to an unrealistic bias toward docked structures with large interfaces. Here, we extend an empirical energy function developed for protein design to protein-protein docking selection by introducing a simple reference state that removes the unrealistic dependence of binding affinity of docking decoys on the buried solvent accessible surface area of interface. The energy function called EMPIRE (EMpirical Protein-InteRaction Energy), when coupled with a refinement strategy, is found to provide a significantly improved success rate in near native selections when applied to RosettaDock and refined ZDOCK docking decoys. Our work underlines the importance of removing nonspecific interactions from specific ones in near native selections from docking decoys. © 2007 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Liang S."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 33,
                "date": "2007-11-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "A simple reference state makes a significant improvement in near-native selections from structurally refined docking decoys"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1
}