{
    "additionDate": "2020-01-09T18:31:20Z",
    "biotoolsCURIE": "biotools:SDRS",
    "biotoolsID": "SDRS",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "giovanitrevisan@gmail.com",
            "name": "Giovani Trevisan",
            "orcidid": "https://orcid.org/0000-0002-4980-526X",
            "typeEntity": "Person"
        },
        {
            "email": "linhares@iastate.edu",
            "name": "Leticia C. M. Linhares",
            "typeEntity": "Person"
        }
    ],
    "description": "Macroepidemiological aspects of porcine reproductive and respiratory syndrome virus detection by major United States veterinary diagnostic laboratories over time, age group, and specimen.\n\nThe Swine Disease Reporting System (SDRS) consists of multiple projects that aggregates data from participating veterinary diagnostic laboratories (VDLs) in the United States of America, and reports the major findings to the swine industry (Figure 1).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'PRRSV', 'macroepidemiological', 'swine', 'swine industry macroepidemiological'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "http://www.fieldepi.org/SDRS",
    "language": [
        "SQL",
        "SAS"
    ],
    "lastUpdate": "2020-01-09T18:31:20Z",
    "name": "SDRS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223544",
            "metadata": {
                "abstract": "© 2019 Trevisan et al.This project investigates the macroepidemiological aspects of porcine reproductive and respiratory syndrome virus (PRRSV) RNA detection by veterinary diagnostic laboratories (VDLs) for the period 2007 through 2018. Standardized submission data and PRRSV realtime reverse-transcriptase polymerase chain reaction (RT-qPCR) test results from porcine samples were retrieved from four VDLs representing 95% of all swine samples tested in NAHLN laboratories in the US. Anonymized data were retrieved and organized at the case level using SAS (SAS® Version 9.4, SAS® Institute, Inc., Cary, NC) with the use of PROC DATA, PROC MERGE, and PROC SQL scripts. The final aggregated and anonymized dataset comprised of 547,873 unique cases was uploaded to Power Business Intelligence -Power BI® (Microsoft Corporation, Redmond, Washington) to construct dynamic charts. The number of cases tested for PRRSV doubled from 2010 to 2018, with that increase mainly driven by samples typically used for monitoring purposes rather than diagnosis of disease. Apparent seasonal trends for the frequency of PRRSV detection were consistently observed with a higher percentage of positive cases occurring during fall or winter months and lower during summer months, perhaps due to increased testing associated with wellknown seasonal occurrence of swine respiratory disease. PRRSV type 2, also known as North American genotype, accounted for 94.76% of all positive cases and was distributed across the US. PRRSV type 1, also known as European genotype, was geographically restricted and accounted for 2.15% of all positive cases. Co-detection of both strains accounted for 3.09% of the positive cases. Both oral fluid and processing fluid samples, had a rapid increase in the number of submissions soon after they were described in 2008 and 2017, respectively, suggesting rapid adoption of these specimens by the US swine industry for PRRSV monitoring in swine populations. As part of this project, a bio-informatics tool defined as Swine Disease Reporting System (SDRS) was developed. This tool has realtime capability to inform the US swine industry on the macroepidemiological aspects of PRRSV detection, and is easily adaptable for other analytes relevant to the swine industry.",
                "authors": [
                    {
                        "name": "Trevisan G."
                    },
                    {
                        "name": "Linhares L.C.M."
                    },
                    {
                        "name": "Crim B."
                    },
                    {
                        "name": "Dubey P."
                    },
                    {
                        "name": "Schwartz K.J."
                    },
                    {
                        "name": "Burrough E.R."
                    },
                    {
                        "name": "Main R.G."
                    },
                    {
                        "name": "Sundberg P."
                    },
                    {
                        "name": "Thurn M."
                    },
                    {
                        "name": "Lages P.T.F."
                    },
                    {
                        "name": "Corzo C.A."
                    },
                    {
                        "name": "Torrison J."
                    },
                    {
                        "name": "Henningson J."
                    },
                    {
                        "name": "Herrman E."
                    },
                    {
                        "name": "Hanzlicek G.A."
                    },
                    {
                        "name": "Raghavan R."
                    },
                    {
                        "name": "Marthaler D."
                    },
                    {
                        "name": "Greseth J."
                    },
                    {
                        "name": "Clement T."
                    },
                    {
                        "name": "Christopher-Hennings J."
                    },
                    {
                        "name": "Linhares D.C.L."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Macroepidemiological aspects of porcine reproductive and respiratory syndrome virus detection by major United States veterinary diagnostic laboratories over time, age group, and specimen"
            },
            "pmcid": "PMC6795434",
            "pmid": "31618236"
        }
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}