{
    "additionDate": "2017-01-17T15:01:57Z",
    "biotoolsCURIE": "biotools:bridge",
    "biotoolsID": "bridge",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "raph@stat.ubc.ca",
            "name": "Raphael Gottardo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package fits a Bayesian hierarchical model for testing DE genes from microarray data, modelling outliers using a t-distribution. The model includes an exchangeable prior for the variances which allow different variances for the genes but still shrink extreme empirical variances. Our model can be used for testing DE genes among multiple samples. Parameter estimation is carried out using a novel version of Markov Chain Monte Carlo.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/bridge.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/bridge_1.38.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/bridge.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-2.0",
    "name": "bridge",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1111/j.1541-0420.2005.00397.x",
            "metadata": {
                "abstract": "We consider the problem of identifying differentially expressed genes under different conditions using gene expression microarrays. Because of the many steps involved in the experimental process, from hybridization to image analysis, cDNA microarray data often contain outliers. For example, an outlying data value could occur because of scratches or dust on the surface, imperfections in the glass, or imperfections in the array production. We develop a robust Bayesian hierarchical model for testing for differential expression. Errors are modeled explicitly using a t-distribution, which accounts for outliers. The model includes an exchangeable prior for the variances, which allows different variances for the genes but still shrinks extreme empirical variances. Our model can be used for testing for differentially expressed genes among multiple samples, and it can distinguish between the different possible patterns of differential expression when there are three or more samples. Parameter estimation is carried out using a novel version of Markov chain Monte Carlo that is appropriate when the model puts mass on subspaces of the full parameter space. The method is illustrated using two publicly available gene expression data sets. We compare our method to six other baseline and commonly used techniques, namely the t-test, the Bonferroni-adjusted t-test, significance analysis of microarrays (SAM), Efron's empirical Bayes, and EBarrays in both its lognormal-normal and gamma-gamma forms. In an experiment with HIV data, our method performed better than these alternatives, on the basis of between-replicate agreement and disagreement. © 2005, The International Biometric Society.",
                "authors": [
                    {
                        "name": "Gottardo R."
                    },
                    {
                        "name": "Raftery A.E."
                    },
                    {
                        "name": "Yee Yeung K."
                    },
                    {
                        "name": "Bumgarner R.E."
                    }
                ],
                "citationCount": 68,
                "date": "2006-03-01T00:00:00Z",
                "journal": "Biometrics",
                "title": "Bayesian robust inference for differential gene expression in microarrays with multiple samples"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.38.0"
    ]
}