{
    "accessibility": "Open access",
    "additionDate": "2021-11-09T20:26:32.298038Z",
    "biotoolsCURIE": "biotools:hemnma-3d",
    "biotoolsID": "hemnma-3d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "slavica.jonic@upmc.fr",
            "name": "Slavica Jonic",
            "typeEntity": "Person"
        },
        {
            "name": "Mohamad Harastani"
        }
    ],
    "description": "Plugin for continuous conformational flexibility analysis containing HEMNMA and StructMap",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                }
            ]
        }
    ],
    "homepage": "https://github.com/scipion-em/scipion-em-continuousflex",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-11-09T20:26:32.301127Z",
    "license": "GPL-3.0",
    "name": "HEMNMA-3D",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FMOLB.2021.663121",
            "metadata": {
                "abstract": "© Copyright © 2021 Harastani, Eltsov, Leforestier and Jonic.Cryogenic electron tomography (cryo-ET) allows structural determination of biomolecules in their native environment (in situ). Its potential of providing information on the dynamics of macromolecular complexes in cells is still largely unexploited, due to the challenges of the data analysis. The crowded cell environment and continuous conformational changes of complexes make difficult disentangling the data heterogeneity. We present HEMNMA-3D, which is, to the best of our knowledge, the first method for analyzing cryo electron subtomograms in terms of continuous conformational changes of complexes. HEMNMA-3D uses a combination of elastic and rigid-body 3D-to-3D iterative alignments of a flexible 3D reference (atomic structure or electron microscopy density map) to match the conformation, orientation, and position of the complex in each subtomogram. The elastic matching combines molecular mechanics simulation (Normal Mode Analysis of the 3D reference) and experimental, subtomogram data analysis. The rigid-body alignment includes compensation for the missing wedge, due to the limited tilt angle of cryo-ET. The conformational parameters (amplitudes of normal modes) of the complexes in subtomograms obtained through the alignment are processed to visualize the distribution of conformations in a space of lower dimension (typically, 2D or 3D) referred to as space of conformations. This allows a visually interpretable insight into the dynamics of the complexes, by calculating 3D averages of subtomograms with similar conformations from selected (densest) regions and by recording movies of the 3D reference's displacement along selected trajectories through the densest regions. We describe HEMNMA-3D and show its validation using synthetic datasets. We apply HEMNMA-3D to an experimental dataset describing in situ nucleosome conformational variability. HEMNMA-3D software is available freely (open-source) as part of ContinuousFlex plugin of Scipion V3.0 (http://scipion.i2pc.es).",
                "authors": [
                    {
                        "name": "Eltsov M."
                    },
                    {
                        "name": "Harastani M."
                    },
                    {
                        "name": "Jonic S."
                    },
                    {
                        "name": "Leforestier A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-19T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "HEMNMA-3D: Cryo Electron Tomography Method Based on Normal Mode Analysis to Study Continuous Conformational Variability of Macromolecular Complexes"
            },
            "pmcid": "PMC8170028",
            "pmid": "34095222"
        }
    ],
    "relation": [
        {
            "biotoolsID": "continuousflex",
            "type": "uses"
        },
        {
            "biotoolsID": "scipion",
            "type": "uses"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
