
{
    "credit": [
        {
            "email": "hdadmin@scripps.edu",
            "name": "Admin",
            "typeEntity": "Person",
            "typeRoles": [
                "Maintainer"
            ]
        },
        {
            "email": "bpascal@scripps.edu",
            "name": "B Pascal",
            "typeEntity": "Person",
            "typeRoles": [
                "Maintainer"
            ]
        },
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://hdx.florida.scripps.edu/hdx_workbench/tutorials/tutorials.html"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Peptide identification",
                        "uri": "http://edamontology.org/data_0945"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    },
                    "format": [
                        {
                            "term": "Thermo RAW",
                            "uri": "http://edamontology.org/format_3712"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Protein hydrogen exchange rate calculation",
                    "uri": "http://edamontology.org/operation_0404"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure report",
                        "uri": "http://edamontology.org/data_1537"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure image",
                        "uri": "http://edamontology.org/data_2992"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ms-utils",
            "Proteomics"
        ],
        "language": [
            "Java"
        ],
        "license": "Other",
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://ms-utils.org"
        }
    ],
    "publication": [
        {
            "abstract": "Background: The combination of mass spectrometry and solution phase amide hydrogen/deuterium exchange (H/D exchange) experiments is an effective method for characterizing protein dynamics, and protein-protein or protein-ligand interactions. Despite methodological advancements and improvements in instrumentation and automation, data analysis and display remains a tedious process. The factors that contribute to this bottleneck are the large number of data points produced in a typical experiment, each requiring manual curation and validation, and then calculation of the level of backbone amide exchange. Tools have become available that address some of these issues, but lack sufficient integration, functionality, and accessibility required to address the needs of the H/D exchange community. To date there is no software for the analysis of H/D exchange data that comprehensively addresses these issues. Results: We have developed an integrated software system for the automated analysis and representation of H/D exchange data that has been titled \"The Deuterator\". Novel approaches have been implemented that enable high throughput analysis, automated determination of deuterium incorporation, and deconvolution of overlapping peptides. This has been achieved by using methods involving iterative theoretical envelope fitting, and consideration of peak data within expected m/z ranges. Existing common file formats have been leveraged to allow compatibility with the output from the myriad of MS instrument platforms and peptide sequence database search engines. A web-based interface is used to integrate the components of The Deuterator that are able to analyze and present mass spectral data from instruments with varying resolving powers. The results, if necessary, can then be confirmed, adjusted, re-calculated and saved. Additional tools synchronize the curated calculation parameters with replicate time points, increasing throughput. Saved results can then be used to plot deuterium buildup curves and 3D structural overlays. The system has been used successfully in a production environment for over one year and is freely available as a web tool at the project home page http://deuterator.florida.scripps.edu. Conclusion: The automated calculation and presentation of H/D exchange data in a user interface enables scientists to organize and analyze data efficiently. Integration of the different components of The Deuterator coupled with the flexibility of common data file formats allow this system to be accessible to the broadening H/D exchange community. © 2007 Pascal et al; licensee BioMed Central Ltd.",
            "authors": [
                "Pascal B.D.",
                "Chalmers M.J.",
                "Busby S.A.",
                "Mader C.C.",
                "Southern M.R.",
                "Tsinoremas N.F.",
                "Griffin P.R."
            ],
            "cit_count": 58,
            "journal": "BMC Bioinformatics",
            "pmid": "17506883",
            "title": "The Deuterator: Software for the determination of backbone amide deuterium levels from H/D exchange MS data",
            "year": "2007-05-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:deuterator",
        "biotoolsID": "deuterator",
        "description": "Web based software platform for determining backbone amide H/D ratios.",
        "homepage": "http://hdx.florida.scripps.edu/hdx_workbench/Home.html",
        "name": "Deuterator"
    }
}