{
    "additionDate": "2017-03-27T12:32:45Z",
    "biotoolsCURIE": "biotools:prex",
    "biotoolsID": "prex",
    "credit": [
        {
            "email": "biochemrecruit@wakehealth.edu",
            "name": "Poole Group",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database of peroxiredoxin (Prx or PRDX) protein sequences unambiguously classified into one of six distinct subfamilies. Subfamily members were identified using the Deacon Active Site Profiler (DASP) bioinformatics tool to focus in on functionally relevant sequence fragments surrounding key residues required for protein activity. Searches of this database can be conducted by protein annotation, accession number, PDB ID, organism name or protein sequence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://www.csb.wfu.edu/prex/",
    "language": [
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "PREX",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "PREX (http://www.csb.wfu.edu/prex/) is a database of currently 3516 peroxiredoxin (Prx or PRDX) protein sequences unambiguously classified into one of six distinct subfamilies. Peroxiredoxins are a diverse and ubiquitous family of highly expressed, cysteine-dependent peroxidases that are important for antioxidant defense and for the regulation of cell signaling pathways in eukaryotes. Subfamily members were identified using the Deacon Active Site Profiler (DASP) bioinformatics tool to focus in on functionally relevant sequence fragments surrounding key residues required for protein activity. Searches of this database can be conducted by protein annotation, accession number, PDB ID, organism name or protein sequence. Output includes the subfamily to which each classified Prx belongs, accession and GI numbers, genus and species and the functional site signature used for classification. The query sequence is also presented aligned with a select group of Prxs for manual evaluation and interpretation by the user. A synopsis of the characteristics of members of each subfamily is also provided along with pertinent references. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Soito L."
                    },
                    {
                        "name": "Williamson C."
                    },
                    {
                        "name": "Knutson S.T."
                    },
                    {
                        "name": "Fetrow J.S."
                    },
                    {
                        "name": "Poole L.B."
                    },
                    {
                        "name": "Nelson K.J."
                    }
                ],
                "citationCount": 73,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PREX: PeroxiRedoxin classification indEX, a database of subfamily assignments across the diverse peroxiredoxin family"
            },
            "pmid": "21036863"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}