{
    "additionDate": "2020-01-14T20:06:59Z",
    "biotoolsCURIE": "biotools:GSE64617",
    "biotoolsID": "GSE64617",
    "confidence_flag": "medium",
    "description": "Prediction and analysis of weighted genes in isoflurane induced general anesthesia based on network analysis.\n\nPurpose: Isoflurane is still wildly used in the developing countries and isoflurane-induced general anesthesia gives rise to serious side effects. The aim of the present study was to investigate the molecular mechanism on isoflurane-induced general anesthesia. Materials and methods: The microarray data of GSE64617 dataset was downloaded from Gene Expression Omnibus (GEO) database. A total of 755 DEGs were identified using the limma package in the R programming language. Gene Ontology (GO) enrichment analysis and Kyoto Encyclopedia of Genes, and Genomes (KEGG) pathways enrichment were conducted for DEGs.\n\n||| NAME (GSE64617) SIMILAR TO (PUB. DIFFERENT) bio.tools/GSE33335 (GSE33335), bio.tools/GSE56348 (GSE56348), bio.tools/GSE117578 (GSE117578), bio.tools/gse (GSE).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'isoflurane', 'anesthesia', 'HMBOX1', 'isoflurane-induced'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "ftp://ftp.ncbi.nlm.nih.gov/geo/series/GSE64nnn/GSE64617/matrix/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T20:06:59Z",
    "name": "GSE64617",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/00207454.2019.1701452",
            "metadata": {
                "abstract": "© 2019, © 2019 Informa UK Limited, trading as Taylor & Francis Group.Purpose: Isoflurane is still wildly used in the developing countries and isoflurane-induced general anesthesia gives rise to serious side effects. The aim of the present study was to investigate the molecular mechanism on isoflurane-induced general anesthesia. Materials and methods: The microarray data of GSE64617 dataset was downloaded from Gene Expression Omnibus (GEO) database. A total of 755 DEGs were identified using the limma package in the R programming language. Gene Ontology (GO) enrichment analysis and Kyoto Encyclopedia of Genes, and Genomes (KEGG) pathways enrichment were conducted for DEGs. A protein-protein interaction (PPI) network was constructed for DEGs and sensory perception related genes. A global miRNA-mRNA regulatory network was constructed to reveal the interactions in miRNA and mRNA in isoflurane treated samples. Degree was used to evaluate the importance of a gene in the PPI network and miRNA-mRNA regulatory network. Results and conclusions: HMBOX1, CSNK2A1, PNN, SRRM1, PRPF40A, APCNTRK1, MAPK1, hsa-miR-16-5p, hsa-miR-424-5p, hsa-miR-497-5p and hsa-miR-17-5p were selected as weighted genes. The expression changes were further vitrificated in the rat models by performing quantitative real-time PCR (qPCR) analysis. In conclusion, we find several weighted mRNAs and miRNAs involved in isoflurane induced general anesthesia through bioinformatics analysis.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Zhou Z.-F."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "International Journal of Neuroscience",
                "title": "Prediction and analysis of weighted genes in isoflurane induced general anesthesia based on network analysis"
            },
            "pmid": "31801399"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}