{
    "additionDate": "2022-09-02T18:10:28.452839Z",
    "biotoolsCURIE": "biotools:birgrn",
    "biotoolsID": "birgrn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gwxu@dhu.edu.cn",
            "name": "Guangwei Xu",
            "typeEntity": "Person"
        },
        {
            "name": "Yanglan Gan"
        }
    ],
    "description": "A computational method BiRGRN to infer GRNs from time-series scRNA-seq data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://gitee.com/DHUDBLab/bi-rgrn",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-02T18:10:28.455442Z",
    "license": "Other",
    "name": "BiRGRN",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FONC.2022.899825",
            "metadata": {
                "abstract": "Copyright © 2022 Gan, Hu, Zou, Yan and Xu.Accurate inference of gene regulatory rules is critical to understanding cellular processes. Existing computational methods usually decompose the inference of gene regulatory networks (GRNs) into multiple subproblems, rather than detecting potential causal relationships simultaneously, which limits the application to data with a small number of genes. Here, we propose BiRGRN, a novel computational algorithm for inferring GRNs from time-series single-cell RNA-seq (scRNA-seq) data. BiRGRN utilizes a bidirectional recurrent neural network to infer GRNs. The recurrent neural network is a complex deep neural network that can capture complex, non-linear, and dynamic relationships among variables. It maps neurons to genes, and maps the connections between neural network layers to the regulatory relationship between genes, providing an intuitive solution to model GRNs with biological closeness and mathematical flexibility. Based on the deep network, we transform the inference of GRNs into a regression problem, using the gene expression data at previous time points to predict the gene expression data at the later time point. Furthermore, we adopt two strategies to improve the accuracy and stability of the algorithm. Specifically, we utilize a bidirectional structure to integrate the forward and reverse inference results and exploit an incomplete set of prior knowledge to filter out some candidate inferences of low confidence. BiRGRN is applied to four simulated datasets and three real scRNA-seq datasets to verify the proposed method. We perform comprehensive comparisons between our proposed method with other state-of-the-art techniques. These experimental results indicate that BiRGRN is capable of inferring GRN simultaneously from time-series scRNA-seq data. Our method BiRGRN is implemented in Python using the TensorFlow machine-learning library, and it is freely available at https://gitee.com/DHUDBLab/bi-rgrn.",
                "authors": [
                    {
                        "name": "Gan Y."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Xu G."
                    },
                    {
                        "name": "Yan C."
                    },
                    {
                        "name": "Zou G."
                    }
                ],
                "date": "2022-05-26T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "Inferring Gene Regulatory Networks From Single-Cell Transcriptomic Data Using Bidirectional RNN"
            },
            "pmcid": "PMC9178250",
            "pmid": "35692809"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
