{
    "additionDate": "2015-01-22T11:13:20Z",
    "biotoolsCURIE": "biotools:primer3",
    "biotoolsID": "primer3",
    "credit": [
        {
            "name": "ELIXIR-EE",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "triinu.koressaar@ut.ee",
            "name": "Triinu Kõressaar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The open-source software which is a widely used application for PCR primer design that includes more accurate thermodynamic models and the ability to use lowercase masked template sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://primer3.ut.ee/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Estonia"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "PCR primers",
                        "uri": "http://edamontology.org/data_1240"
                    }
                }
            ]
        }
    ],
    "homepage": "http://primer3.ut.ee/",
    "lastUpdate": "2019-02-15T10:24:02Z",
    "name": "Primer3",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gks596",
            "metadata": {
                "abstract": "Polymerase chain reaction (PCR) is a basic molecular biology technique with a multiplicity of uses, including deoxyribonucleic acid cloning and sequencing, functional analysis of genes, diagnosis of diseases, genotyping and discovery of genetic variants. Reliable primer design is crucial for successful PCR, and for over a decade, the opensource Primer3 software has been widely used for primer design, often in high-throughput genomics applications. It has also been incorporated into numerous publicly available software packages and web services. During this period, we have greatly expanded Primer3's functionality. In this article, we describe Primer3's current capabilities, emphasizing recent improvements. The most notable enhancements incorporate more accurate thermodynamic models in the primer design process, both to improve melting temperature prediction and to reduce the likelihood that primers will form hairpins or dimers. Additional enhancements include more precise control of primer placement- a change motivated partly by opportunities to use whole-genome sequences to improve primer specificity. We also added features to increase ease of use, including the ability to save and re-use parameter settings and the ability to require that individual primers not be used in more than one primer pair. We have made the core code more modular and provided cleaner programming interfaces to further ease integration with other software. These improvements position Primer3 for continued use with genome-scale data in the decade ahead. © The Author(s) 2012.",
                "authors": [
                    {
                        "name": "Untergasser A."
                    },
                    {
                        "name": "Cutcutache I."
                    },
                    {
                        "name": "Koressaar T."
                    },
                    {
                        "name": "Ye J."
                    },
                    {
                        "name": "Faircloth B.C."
                    },
                    {
                        "name": "Remm M."
                    },
                    {
                        "name": "Rozen S.G."
                    }
                ],
                "citationCount": 2783,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Primer3-new capabilities and interfaces"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}