{
    "additionDate": "2020-01-14T19:58:19Z",
    "biotoolsCURIE": "biotools:SweHLA",
    "biotoolsID": "SweHLA",
    "confidence_flag": "medium",
    "description": "the high confidence HLA typing bio-resource drawn from 1000 Swedish genomes.\n\nThere is a need to accurately call human leukocyte antigen (HLA) genes from existing short-read sequencing data, however there is no single solution that matches the gold standard of Sanger sequenced lab typing. Here we aimed to combine results from available software programs, minimizing the biases of applied algorithm and HLA reference. The result is a robust HLA population resource for the published 1000 Swedish genomes, and a framework for future HLA interrogation. HLA 2nd-field alleles were called using four imputation and inference methods for the classical eight genes (class I: HLA-A, HLA-B, HLA-C; class II: HLA-DPA1, HLA-DPB1, HLA-DQA1, HLA-DQB1, HLA-DRB1). A high confidence population set (SweHLA) was determined using an n-1 concordance rule for class I (four software) and class II (three software) alleles.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31844174",
    "lastUpdate": "2020-01-14T19:58:19Z",
    "name": "SweHLA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41431-019-0559-2",
            "metadata": {
                "abstract": "© 2019, The Author(s).There is a need to accurately call human leukocyte antigen (HLA) genes from existing short-read sequencing data, however there is no single solution that matches the gold standard of Sanger sequenced lab typing. Here we aimed to combine results from available software programs, minimizing the biases of applied algorithm and HLA reference. The result is a robust HLA population resource for the published 1000 Swedish genomes, and a framework for future HLA interrogation. HLA 2nd-field alleles were called using four imputation and inference methods for the classical eight genes (class I: HLA-A, HLA-B, HLA-C; class II: HLA-DPA1, HLA-DPB1, HLA-DQA1, HLA-DQB1, HLA-DRB1). A high confidence population set (SweHLA) was determined using an n−1 concordance rule for class I (four software) and class II (three software) alleles. Results were compared across populations and individual programs benchmarked to SweHLA. Per gene, 875 to 988 of the 1000 samples were genotyped in SweHLA; 920 samples had at least seven loci called. While a small fraction of reference alleles were common to all software (class I = 1.9% and class II = 4.1%), this did not affect the overall call rate. Gene-level concordance was high compared to European populations (>0.83%), with COX and PGF the dominant SweHLA haplotypes. We noted that 15/18 discordant alleles (delta allele frequency >2) were previously reported as disease-associated. These differences could in part explain across-study genetic replication failures, reinforcing the need to use multiple software solutions. SweHLA demonstrates a way to use existing NGS data to generate a population resource agnostic to individual HLA software biases.",
                "authors": [
                    {
                        "name": "Nordin J."
                    },
                    {
                        "name": "Ameur A."
                    },
                    {
                        "name": "Lindblad-Toh K."
                    },
                    {
                        "name": "Gyllensten U."
                    },
                    {
                        "name": "Meadows J.R.S."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "European Journal of Human Genetics",
                "title": "SweHLA: the high confidence HLA typing bio-resource drawn from 1000 Swedish genomes"
            },
            "pmid": "31844174"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}