{
    "additionDate": "2017-01-17T15:00:34Z",
    "biotoolsCURIE": "biotools:chrogps",
    "biotoolsID": "chrogps",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "oscar.reina@irbbarcelona.org",
            "name": "Oscar Reina",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "We provide intuitive maps to visualize the association between genetic elements, with emphasis on epigenetics. The approach is based on Multi-Dimensional Scaling. We provide several sensible distance metrics, and adjustment procedures to remove systematic biases typically observed when merging data obtained under different technologies or genetic backgrounds.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/chroGPS.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/chroGPS_1.22.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/chroGPS.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-2.0",
    "name": "chroGPS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt1186",
            "metadata": {
                "abstract": "Development of tools to jointly visualize the genome and the epigenome remains a challenge. chroGPS is a computational approach that addresses this question. chroGPS uses multidimensional scaling techniques to represent similarity between epigenetic factors, or between genetic elements on the basis of their epigenetic state, in 2D/3D reference maps. We emphasize biological interpretability, statistical robustness, integration of genetic and epigenetic data from heterogeneous sources, and computational feasibility. Although chroGPS is a general methodology to create reference maps and study the epigenetic state of any class of genetic element or genomic region, we focus on two specific kinds of maps: chroGPSfactors, which visualizes functional similarities between epigenetic factors, and chroGPSgenes, which describes the epigenetic state of genes and integrates gene expression and other functional data. We use data from the modENCODE project on the genomic distribution of a large collection of epigenetic factors in Drosophila, a model system extensively used to study genome organization and function. Our results show that the maps allow straightforward visualization of relationships between factors and elements, capturing relevant information about their functional properties that helps to interpret epigenetic information in a functional context and derive testable hypotheses. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Azorin F."
                    },
                    {
                        "name": "Font-Burgada J."
                    },
                    {
                        "name": "Reina O."
                    },
                    {
                        "name": "Rossell D."
                    }
                ],
                "citationCount": 3,
                "date": "2014-02-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ChroGPS, a global chromatin positioning system for the functional analysis and visualization of the epigenome"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        }
    ],
    "validated": 1,
    "version": [
        "1.22.0"
    ]
}
