{
    "additionDate": "2021-10-04T08:58:40.139659Z",
    "biotoolsCURIE": "biotools:jsom",
    "biotoolsID": "jsom",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "peng.qiu@bme.gatech.edu",
            "name": "Peng Qiu",
            "orcidid": "https://orcid.org/0000-0003-3256-0734",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "JSOM (Jointly Evolving Self-organzing Maps) is an algorithm aims to align two related datasets that contain similar clusters by constructing two maps—low dimensional discretized representation of datasets–that jointly evolve according to both datasets. Below, it shows how two maps evolve over time when traiend with two independent MNIST datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hlim95/JSOM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-04T09:00:29.328379Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hlim95/JSOM/issues"
        }
    ],
    "name": "JSOM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008804",
            "metadata": {
                "abstract": "© 2021 Lim, Qiu. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.With the rapid advances of various single-cell technologies, an increasing number of singlecell datasets are being generated, and the computational tools for aligning the datasets which make subsequent integration or meta-analysis possible have become critical. Typically, single-cell datasets from different technologies cannot be directly combined or concatenated, due to the innate difference in the data, such as the number of measured parameters and the distributions. Even datasets generated by the same technology are often affected by the batch effect. A computational approach for aligning different datasets and hence identifying related clusters will be useful for data integration and interpretation in large scale single-cell experiments. Our proposed algorithm called JSOM, a variation of the Self-organizing map, aligns two related datasets that contain similar clusters, by constructing two maps-low-dimensional discretized representation of datasets-that jointly evolve according to both datasets. Here we applied the JSOM algorithm to flow cytometry, mass cytometry, and single-cell RNA sequencing datasets. The resulting JSOM maps not only align the related clusters in the two datasets but also preserve the topology of the datasets so that the maps could be used for further analysis, such as clustering.",
                "authors": [
                    {
                        "name": "Lim H.S."
                    },
                    {
                        "name": "Qiu P."
                    }
                ],
                "date": "2021-03-16T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "JSOM: Jointly-evolving self-organizing maps for alignment of biological datasets and identification of related clusters"
            },
            "pmcid": "PMC7963045",
            "pmid": "33724985",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}
