{
    "additionDate": "2020-10-13T12:48:29Z",
    "biotoolsCURIE": "biotools:factorviz",
    "biotoolsID": "factorviz",
    "description": "FactorViz provides an interactive visualization and reporting environment for exploring the results of the methylome decomposition experiments carried out by MeDeCom or similar deconvolution tools.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/CompEpigen/FactorViz",
    "lastUpdate": "2020-10-13T12:48:29Z",
    "name": "FactorViz",
    "owner": "mscherer",
    "publication": [
        {
            "doi": "10.1038/s41596-020-0369-6",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.DNA methylation profiling offers unique insights into human development and diseases. Often the analysis of complex tissues and cell mixtures is the only feasible option to study methylation changes across large patient cohorts. Since DNA methylomes are highly cell type specific, deconvolution methods can be used to recover cell type–specific information in the form of latent methylation components (LMCs) from such ‘bulk’ samples. Reference-free deconvolution methods retrieve these components without the need for DNA methylation profiles of purified cell types. Currently no integrated and guided procedure is available for data preparation and subsequent interpretation of deconvolution results. Here, we describe a three-stage protocol for reference-free deconvolution of DNA methylation data comprising: (i) data preprocessing, confounder adjustment using independent component analysis (ICA) and feature selection using DecompPipeline, (ii) deconvolution with multiple parameters using MeDeCom, RefFreeCellMix or EDec and (iii) guided biological inference and validation of deconvolution results with the R/Shiny graphical user interface FactorViz. Our protocol simplifies the analysis and guides the initial interpretation of DNA methylation data derived from complex samples. The harmonized approach is particularly useful to dissect and evaluate cell heterogeneity in complex systems such as tumors. We apply the protocol to lung cancer methylomes from The Cancer Genome Atlas (TCGA) and show that our approach identifies the proportions of stromal cells and tumor-infiltrating immune cells, as well as associations of the detected components with clinical parameters. The protocol takes slightly '3 d to complete and requires basic R skills.",
                "authors": [
                    {
                        "name": "Scherer M."
                    },
                    {
                        "name": "Nazarov P.V."
                    },
                    {
                        "name": "Toth R."
                    },
                    {
                        "name": "Sahay S."
                    },
                    {
                        "name": "Kaoma T."
                    },
                    {
                        "name": "Maurer V."
                    },
                    {
                        "name": "Vedeneev N."
                    },
                    {
                        "name": "Plass C."
                    },
                    {
                        "name": "Lengauer T."
                    },
                    {
                        "name": "Walter J."
                    },
                    {
                        "name": "Lutsik P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Reference-free deconvolution, visualization and interpretation of complex DNA methylation data using DecompPipeline, MeDeCom and FactorViz"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "validated": 1,
    "version": [
        "2.1.0"
    ]
}