{
    "additionDate": "2022-11-06T13:28:38.422503Z",
    "biotoolsCURIE": "biotools:casilico",
    "biotoolsID": "casilico",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mrbakhtiari@ut.ac.ir",
            "name": "Mohammad Reza Bakhtiarizadeh",
            "typeEntity": "Person"
        }
    ],
    "description": "A versatile CRISPR package for in silico CRISPR RNA designing for Cas12, Cas13, and Cas14.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mrb20045/CaSilico",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-06T13:28:38.424908Z",
    "license": "Not licensed",
    "name": "CaSilico",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2022.957131",
            "metadata": {
                "abstract": "Copyright © 2022 Asadbeigi, Norouzi, Vafaei Sadi, Saffari and Bakhtiarizadeh.The efficiency of the CRISPR-Cas system is highly dependent on well-designed CRISPR RNA (crRNA). To facilitate the use of various types of CRISPR-Cas systems, there is a need for the development of computational tools to design crRNAs which cover different CRISPR-Cas systems with off-target analysis capability. Numerous crRNA design tools have been developed, but nearly all of them are dedicated to design crRNA for genome editing. Hence, we developed a tool matching the needs of both beginners and experts, named CaSilico, which was inspired by the limitations of the current crRNA design tools for designing crRNAs for Cas12, Cas13, and Cas14 CRISPR-Cas systems. This tool considers a comprehensive list of the principal rules that are not yet well described to design crRNA for these types. Using a list of important features such as mismatch tolerance rules, self-complementarity, GC content, frequency of cleaving base around the target site, target accessibility, and PFS (protospacer flanking site) or PAM (protospacer adjacent motif) requirement, CaSilico searches all potential crRNAs in a user-input sequence. Considering these features help users to rank all crRNAs for a sequence and make an informed decision about whether a crRNA is suited for an experiment or not. Our tool is sufficiently flexible to tune some key parameters governing the design of crRNA and identification of off-targets, which can lead to an increase in the chances of successful CRISPR-Cas experiments. CaSilico outperforms previous crRNA design tools in the following aspects: 1) supporting any reference genome/gene/transcriptome for which an FASTA file is available; 2) designing crRNAs that simultaneously target multiple sequences through conserved region detection among a set of sequences; 3) considering new CRISPR-Cas subtypes; and 4) reporting a list of different features for each candidate crRNA, which can help the user to select the best one. Given these capabilities, CaSilico addresses end-user concerns arising from the use of sophisticated bioinformatics algorithms and has a wide range of potential research applications in different areas, especially in the design of crRNA for pathogen diagnosis. CaSilico was successfully applied to design crRNAs for different genes in the SARS-CoV-2 genome, as some of the crRNAs have been experimentally tested in the previous studies.",
                "authors": [
                    {
                        "name": "Asadbeigi A."
                    },
                    {
                        "name": "Bakhtiarizadeh M.R."
                    },
                    {
                        "name": "Norouzi M."
                    },
                    {
                        "name": "Saffari M."
                    },
                    {
                        "name": "Vafaei Sadi M.S."
                    }
                ],
                "citationCount": 1,
                "date": "2022-08-09T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "CaSilico: A versatile CRISPR package for in silico CRISPR RNA designing for Cas12, Cas13, and Cas14"
            },
            "pmcid": "PMC9395711",
            "pmid": "36017348"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
