{
    "additionDate": "2017-08-03T19:08:03Z",
    "biotoolsCURIE": "biotools:qnr",
    "biotoolsID": "qnr",
    "credit": [
        {
            "email": "erik.kristiansson@chalmers.se",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python implementation of a method for searching large metagenomic dataset to identify qnr fluoroquinolone antibiotic resistance genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.math.chalmers.se/qnr/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.math.chalmers.se/qnr/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/qnr-discover-fluoroquinolone-antibiotic-resistance-qnr-genes-in-fragmented-nucleotide-sequences.html"
        }
    ],
    "name": "qnr",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Broad-spectrum fluoroquinolone antibiotics are central in modern health care and are used to treat and prevent a wide range of bacterial infections. The recently discovered qnr genes provide a mechanism of resistance with the potential to rapidly spread between bacteria using horizontal gene transfer. As for many antibiotic resistance genes present in pathogens today, qnr genes are hypothesized to originate from environmental bacteria. The vast amount of data generated by shotgun metagenomics can therefore be used to explore the diversity of qnr genes in more detail.Results: In this paper we describe a new method to identify qnr genes in nucleotide sequence data. We show, using cross-validation, that the method has a high statistical power of correctly classifying sequences from novel classes of qnr genes, even for fragments as short as 100 nucleotides. Based on sequences from public repositories, the method was able to identify all previously reported plasmid-mediated qnr genes. In addition, several fragments from novel putative qnr genes were identified in metagenomes. The method was also able to annotate 39 chromosomal variants of which 11 have previously not been reported in literature.Conclusions: The method described in this paper significantly improves the sensitivity and specificity of identification and annotation of qnr genes in nucleotide sequence data. The predicted novel putative qnr genes in the metagenomic data support the hypothesis of a large and uncharacterized diversity within this family of resistance genes in environmental bacterial communities. An implementation of the method is freely available at http://bioinformatics.math.chalmers.se/qnr/. © 2012 Boulund et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Boulund F."
                    },
                    {
                        "name": "Johnning A."
                    },
                    {
                        "name": "Pereira M.B."
                    },
                    {
                        "name": "Larsson D.G.J."
                    },
                    {
                        "name": "Kristiansson E."
                    }
                ],
                "citationCount": 17,
                "date": "2012-12-11T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A novel method to discover fluoroquinolone antibiotic resistance (qnr) genes in fragmented nucleotide sequences"
            },
            "pmid": "23231464"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}