{
    "additionDate": "2020-01-14T09:09:49Z",
    "biotoolsCURIE": "biotools:StackCBPred",
    "biotoolsID": "StackCBPred",
    "confidence_flag": "tool",
    "description": "A stacking based prediction of protein-carbohydrate binding sites from sequence.",
    "download": [
        {
            "type": "Software package",
            "url": "http://cs.uno.edu/~tamjid/Software/StackCBPred/code_data.zip"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "https://bmll.cs.uno.edu/",
    "lastUpdate": "2021-01-16T14:25:15Z",
    "name": "StackCBPred",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CARRES.2019.107857",
            "metadata": {
                "abstract": "© 2019Carbohydrate-binding proteins play vital roles in many important biological processes. The study of these protein-carbohydrate interactions, at residue level, is useful in treating many critical diseases. Analyzing the local sequential environments of the binding and non-binding regions to predict the protein-carbohydrate binding sites is one of the challenging problems in molecular and computational biology. Existing experimental methods for identifying protein-carbohydrate binding sites are laborious and expensive. Thus, prediction of such binding sites, directly from sequences, using computational methods, can be useful to fast annotate the binding sites and guide the experimental process. Because the number of carbohydrate-binding residues is significantly lower than the number of non-carbohydrate-binding residues, most of the methods developed for the prediction of protein-carbohydrate binding sites are biased towards over predicting the negative class (or non-carbohydrate-binding). Here, we propose a balanced predictor, called StackCBPred, which utilizes features, extracted from evolution-driven sequence profile, called the position-specific scoring matrix (PSSM) and several predicted structural properties of amino acids to effectively train a Stacking-based machine learning method for the accurate prediction of protein-carbohydrate binding sites (https://bmll.cs.uno.edu/).",
                "authors": [
                    {
                        "name": "Gattani S."
                    },
                    {
                        "name": "Mishra A."
                    },
                    {
                        "name": "Hoque M.T."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Carbohydrate Research",
                "title": "StackCBPred: A stacking based prediction of protein-carbohydrate binding sites from sequence"
            },
            "pmid": "31683069"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}