{
    "additionDate": "2018-04-27T11:05:51Z",
    "biotoolsCURIE": "biotools:clinqc",
    "biotoolsID": "clinqc",
    "credit": [
        {
            "email": "ramvinay.pandey@gmail.com",
            "name": "Ram Vinay Pandey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An integrated and user-friendly pipeline for quality control, filtering and trimming of Sanger and NGS sequencing data for hundred to thousands of samples/patients in a single run in clinical research.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://sourceforge.net/p/clinqc/wiki/ClinQC_Manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/clinqc/",
    "language": [
        "Java",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ClinQC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-016-0915-Y",
            "metadata": {
                "abstract": "© 2016 Pandey et al.Background: Traditional Sanger sequencing has been used as a gold standard method for genetic testing in clinic to perform single gene test, which has been a cumbersome and expensive method to test several genes in heterogeneous disease such as cancer. With the advent of Next Generation Sequencing technologies, which produce data on unprecedented speed in a cost effective manner have overcome the limitation of Sanger sequencing. Therefore, for the efficient and affordable genetic testing, Next Generation Sequencing has been used as a complementary method with Sanger sequencing for disease causing mutation identification and confirmation in clinical research. However, in order to identify the potential disease causing mutations with great sensitivity and specificity it is essential to ensure high quality sequencing data. Therefore, integrated software tools are lacking which can analyze Sanger and NGS data together and eliminate platform specific sequencing errors, low quality reads and support the analysis of several sample/patients data set in a single run. Results: We have developed ClinQC, a flexible and user-friendly pipeline for format conversion, quality control, trimming and filtering of raw sequencing data generated from Sanger sequencing and three NGS sequencing platforms including Illumina, 454 and Ion Torrent. First, ClinQC convert input read files from their native formats to a common FASTQ format and remove adapters, and PCR primers. Next, it split bar-coded samples, filter duplicates, contamination and low quality sequences and generates a QC report. ClinQC output high quality reads in FASTQ format with Sanger quality encoding, which can be directly used in down-stream analysis. It can analyze hundreds of sample/patients data in a single run and generate unified output files for both Sanger and NGS sequencing data. Our tool is expected to be very useful for quality control and format conversion of Sanger and NGS data to facilitate improved downstream analysis and mutation screening. Conclusions: ClinQC is a powerful and easy to handle pipeline for quality control and trimming in clinical research. ClinQC is written in Python with multiprocessing capability, run on all major operating systems and is available at https://sourceforge.net/projects/clinqc.",
                "authors": [
                    {
                        "name": "Pandey R.V."
                    },
                    {
                        "name": "Pabinger S."
                    },
                    {
                        "name": "Kriegner A."
                    },
                    {
                        "name": "Weinhausel A."
                    }
                ],
                "citationCount": 13,
                "date": "2016-02-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ClinQC: A tool for quality control and cleaning of Sanger and NGS data in clinical research"
            },
            "pmcid": "PMC4735967",
            "pmid": "26830926"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        }
    ],
    "validated": 1
}