{
    "additionDate": "2017-08-03T19:08:23Z",
    "biotoolsCURIE": "biotools:simurare",
    "biotoolsID": "simurare",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://c2s2.yale.edu/"
        }
    ],
    "description": "A regression-based algorithm that imputes rare variants in currently available SNP array data, and performs a resampling approachto simulate samples that contain both common and rare SNPs.",
    "documentation": [
        {
            "type": "General",
            "url": "http://c2s2.yale.edu/software/simuRare/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Simulated gene expression data generation",
                    "uri": "http://edamontology.org/operation_3566"
                }
            ]
        }
    ],
    "homepage": "http://c2s2.yale.edu/software/simuRare/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/simurare-1-1-simulating-realistic-genomic-data-with-rare-variants.html"
        }
    ],
    "name": "simuRare",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Increasing evidence suggests that rare and generally deleterious genetic variants might have a strong impact on disease risks of not only Mendelian disease, but also many common diseases. However, identifying such rare variants remains challenging, and novel statistical methods and bioinformatic software must be developed. Hence, we have to extensively evaluate various methods under reasonable genetic models. Although there are abundant genomic data, they are not most helpful for the evaluation of the methods because the disease mechanism is unknown. Thus, it is imperative that we simulate genomic data that mimic the real data containing rare variants and that enable us to impose a known disease penetrance model. Although resampling simulation methods have shown their advantages in computational efficiency and in preserving important properties such as linkage disequilibrium (LD) and allele frequency, they still have limitations as we demonstrated. We propose an algorithm that combines a regression-based imputation with resampling to simulate genetic data with both rare and common variants. Logistic regression model was employed to fit the relationship between a rare variant and its nearby common variants in the 1000 Genomes Project data and then applied to the real data to fill in one rare variant at a time using the fitted logistic model based on common variants. Individuals then were simulated using the real data with imputed rare variants. We compared our method with existing simulators and demonstrated that our method performed well in retaining the real sample properties, such as LD and minor allele frequency, qualitatively. © 2012 WILEY PERIODICALS, INC.",
                "authors": [
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Song C."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 6,
                "date": "2013-02-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Simulating Realistic Genomic Data With Rare Variants"
            },
            "pmid": "23161487"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}