{
    "accessibility": "Open access",
    "additionDate": "2023-01-27T16:54:03.079843Z",
    "biotoolsCURIE": "biotools:crit",
    "biotoolsID": "crit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jzxu01@stu.edu.cn",
            "name": "Jianzhen Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "CRIT (CircRNA Regulator Identification Tool) is a pipeline based on a non-negative matrix factorization method to integrate various omics information and to identify regulating RBPs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsSTU/CRIT",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-01-27T16:54:03.082258Z",
    "license": "Not licensed",
    "name": "CRIT",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2022.10.015",
            "metadata": {
                "abstract": "© 2022 The AuthorsCircular RNAs (circRNAs) are endogenous non-coding RNAs that regulate gene expression and participate in carcinogenesis. However, the RNA-binding proteins (RBPs) involved in circRNAs biogenesis and modulation remain largely unclear. We developed the circRNA regulator identification tool (CRIT), a non-negative matrix-factorization-based pipeline to identify regulating RBPs in cancers. CRIT uncovered 73 novel regulators across thousands of samples by effectively leveraging genomics data and functional annotations. We demonstrated that known RBPs involved in circRNA control are significantly enriched in these predictions. Analysis of circRNA-RBP interactions using two large cross-linking immunoprecipitation (CLIP) databases, we validated the consistency between CRIT prediction and the CLIP experiments. Furthermore, newly discovered RBPs are functionally connected with authentic circRNA regulators by various biological associations, such as physical interaction, similar binding motifs, common transcription factor modulation, and co-expression. When analyzing RNA sequencing (RNA-seq) datasets after short hairpin RNA (shRNA)/small interfering RNA (siRNA) knockdown, we found several novel RBPs that can affect global circRNA expression, which strengthens their role in the circRNA life cycle. The above evidence provided independent confirmation that CRIT is a useful tool to capture RBPs in circRNA processing. Finally, we show that authentic regulators are more likely the core splicing proteins and peripheral factors and usually harbor more alterations in the vast majority of cancers.",
                "authors": [
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Hao S."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Shao M."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhao X."
                    }
                ],
                "date": "2022-12-13T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "CRIT: Identifying RNA-binding protein regulator in circRNA life cycle via non-negative matrix factorization"
            },
            "pmcid": "PMC9664520",
            "pmid": "36420213"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
