{
    "additionDate": "2021-01-18T10:27:16Z",
    "biotoolsCURIE": "biotools:smocuda",
    "biotoolsID": "smocuda",
    "confidence_flag": "tool",
    "description": "SmoCuDa - The Open Smoking Cue Database. A Validated Smoking Cue Database to Reliably Induce Craving in Tobacco Use Disorder.\n\n\n\nSmoCuDa is a free open access database of 250 smoking-related images. All images were taken from open and free-to-use photo websites (creative commons license) and were chosen to cover a widespread variety of cigarette-associated content (e.g. cigarettes, ashtrays, smokers of different ages and genders). Further, all images have been rated, tested and validated by, to date, 40 mild to heavy smokers. These ratings demonstrate that SmoCuDa images cover a wide range of intensities along the stimulus dimensions “craving”, “arousal”, and “valence”. Thus, SmoCuDa images are suited particularly well to investigate cue-induced behavior and neural activity over a large continuum of intensities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://smocuda.github.io",
    "lastUpdate": "2021-02-19T16:51:58Z",
    "name": "SmoCuDa",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1159/000509758",
            "metadata": {
                "abstract": "© 2020 BMJ Publishing Group. All rights reserved.Background: Cue-reactivity paradigms provide valuable insights into the underlying mechanisms of nicotine craving in nicotine-dependent subjects. In order to study cue-driven nicotine craving, robust and validated stimulus datasets are essential. Objectives: The aim of this study was to generate and validate a large set of individually rated smoking-related cues that allow for assessment of different stimulus intensities along the dimensions craving, valence, and arousal. Methods: The image database consisted of 330 visual cues. Two hundred fifty smoking-associated pictures (Creative Commons license) were chosen from online databases and showed a widespread variety of smoking-associated content. Eighty pictures from previously published databases were included for cross-validation. Forty volunteers with tobacco use disorder rated \"urge-to-smoke,\"\"valence,\"and \"arousal\"for all images on a 100-point visual analogue scale. Pictures were also labelled according to 18 categories such as lit/unlit cigarettes in mouth, cigarette end, and cigarette in ashtray. Results: Ratings (mean ± SD) were as follows: urge to smoke, 44.9 ± 13.2; valence, 51.2 ± 7.6; and arousal, 54.6 ± 7.1. All ratings, particularly \"urge to smoke,\"were widely distributed along the whole scale spectrum. Conclusions: We present a novel image library of well-described smoking-related cues, which were rated on a continuous scale along the dimensions craving, valence, and arousal that accounts for inter-individual differences. The rating software, image database, and their ratings are publicly available at https://smocuda.github.io.",
                "authors": [
                    {
                        "name": "Manoliu A."
                    },
                    {
                        "name": "Haugg A."
                    },
                    {
                        "name": "Sladky R."
                    },
                    {
                        "name": "Hulka L."
                    },
                    {
                        "name": "Kirschner M."
                    },
                    {
                        "name": "Bruhl A.B."
                    },
                    {
                        "name": "Seifritz E."
                    },
                    {
                        "name": "Quednow B."
                    },
                    {
                        "name": "Herdener M."
                    },
                    {
                        "name": "Scharnowski F."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "European Addiction Research",
                "title": "SmoCuDa: A Validated Smoking Cue Database to Reliably Induce Craving in Tobacco Use Disorder"
            },
            "pmid": "32854096"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}