{
    "name": "Multicoil2", 
    "description": "The MultiCoil program predicts the location of coiled-coil regions in amino acid sequences and classifies the predictions as dimeric or trimeric.", 
    "homepage": "http://groups.csail.mit.edu/cb/multicoil", 
    "biotoolsID": "multicoil", 
    "biotoolsCURIE": "biotools:multicoil", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2479", 
                    "term": "Protein sequence analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequences"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/multicoil2-predicting-coiled-coils-oligomerization-states.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://theory.lcs.mit.edu/~elwolf/webcoil.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0023519", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Multicoil2: Predicting coiled coils and their oligomerization states from sequence in the twilight zone", 
                "abstract": "The alpha-helical coiled coil can adopt a variety of topologies, among the most common of which are parallel and antiparallel dimers and trimers. We present Multicoil2, an algorithm that predicts both the location and oligomerization state (two versus three helices) of coiled coils in protein sequences. Multicoil2 combines the pairwise correlations of the previous Multicoil method with the flexibility of Hidden Markov Models (HMMs) in a Markov Random Field (MRF). The resulting algorithm integrates sequence features, including pairwise interactions, through multinomial logistic regression to devise an optimized scoring function for distinguishing dimer, trimer and non-coiled-coil oligomerization states; this scoring function is used to produce Markov Random Field potentials that incorporate pairwise correlations localized in sequence. Multicoil2 significantly improves both coiled-coil detection and dimer versus trimer state prediction over the original Multicoil algorithm retrained on a newly-constructed database of coiled-coil sequences. The new database, comprised of 2,105 sequences containing 124,088 residues, includes reliable structural annotations based on experimental data in the literature. Notably, the enhanced performance of Multicoil2 is evident when tested in stringent leave-family-out cross-validation on the new database, reflecting expected performance on challenging new prediction targets that have minimal sequence similarity to known coiled-coil families. The Multicoil2 program and training database are available for download from http://multicoil2.csail.mit.edu. © 2011 Trigg et al.", 
                "date": "2011-08-25T00:00:00Z", 
                "citationCount": 36, 
                "authors": [
                    {
                        "name": "Trigg J."
                    }, 
                    {
                        "name": "Gutwin K."
                    }, 
                    {
                        "name": "Keating A.E."
                    }, 
                    {
                        "name": "Berger B."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://people.csail.mit.edu/bab/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:09:35Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}