
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://compbio.med.wayne.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://compbio.med.wayne.edu/software/primerDesign/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data rendering",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/array-design-efficacy-klab-interspecies-tiling-program.html"
        }
    ],
    "publication": [
        {
            "abstract": "A single expressing copy of the human protamine domain was randomly inserted into an intron of Cyp2c38. The transgenic locus was shown to recapitulate the level of expression observed in normal human testis while not perturbing endogenous protamine expression. The development of an interspecies tiling array was pursued to enable direct comparison of the orthologous protamine domains in a single experiment. Probe design was adapted to generate species-specific high resolution probe sets that would tolerate repetitive elements. Results from competitive hybridizations demonstrate that interspecies tiling arrays are a valuable tool for parallel analysis of highly similar DNA sequences. This approach provides a rapid and reliable means of interrogating samples prior to deep sequencing analysis. These arrays should readily compliment most DNA isolation and analysis techniques such as ChIP, nuclease sensitivity and nuclear matrix association assays. Copyright © 2011 Informa Healthcare USA, Inc.",
            "authors": [
                "Johnson G.D.",
                "Platts A.E.",
                "Lalancette C.",
                "Goodrich R.",
                "Heng H.H.",
                "Krawetz S.A."
            ],
            "cit_count": 5,
            "journal": "Systems Biology in Reproductive Medicine",
            "pmid": "21214491",
            "title": "Interrogating the transgenic genome: Development of an interspecies tiling array",
            "year": "2011-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:array_design",
        "biotoolsID": "array_design",
        "description": "Efficacy of the KLab interspecies tiling program which was demonstrated by interrogating the endogenous and human protamine loci in a transgenic mouse line. Species specific probe sets were designed by adapting a previously reported maskless array synthesis strategy.",
        "homepage": "http://compbio.med.wayne.edu/software/primerDesign/index.html",
        "name": "Array Design"
    }
}