{
    "additionDate": "2021-01-18T09:04:19Z",
    "biotoolsCURIE": "biotools:icsc",
    "biotoolsID": "icsc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asjagath@ntu.edu.sg",
            "name": "Jagath C. Rajapakse",
            "orcidid": "https://orcid.org/0000-0001-7944-1658",
            "typeEntity": "Person"
        }
    ],
    "description": "Iterative consensus spectral clustering improves detection of subject and group level brain functional modules.\n\nIterative consensus spectral clustering for brain functional modules.\n\nThe code repo for the iterative consensus spectral clustering that performs detection of subject and group level brain functional modules. We obtained the following group level modularizations for normal healthy samples:.\n\nThe proposed algorithm can also be used to obtain subject-level modules from multiple scans (of the same subject). For more details refer to the paper.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SCSE-Biomedical-Computing-Group/ICSC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-02T07:35:00Z",
    "name": "ICSC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41598-020-63552-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).Specialized processing in the brain is performed by multiple groups of brain regions organized as functional modules. Although, in vivo studies of brain functional modules involve multiple functional Magnetic Resonance Imaging (fMRI) scans, the methods used to derive functional modules from functional networks of the brain ignore individual differences in the functional architecture and use incomplete functional connectivity information. To correct this, we propose an Iterative Consensus Spectral Clustering (ICSC) algorithm that detects the most representative modules from individual dense weighted connectivity matrices derived from multiple scans. The ICSC algorithm derives group-level modules from modules of multiple individuals by iteratively minimizing the consensus-cost between the two. We demonstrate that the ICSC algorithm can be used to derive biologically plausible group-level (for multiple subjects) and subject-level (for multiple subject scans) brain modules, using resting-state fMRI scans of 589 subjects from the Human Connectome Project. We employed a multipronged strategy to show the validity of the modularizations obtained from the ICSC algorithm. We show a heterogeneous variability in the modular structure across subjects where modules involved in visual and motor processing were highly stable across subjects. Conversely, we found a lower variability across scans of the same subject. The performance of our algorithm was compared with existing functional brain modularization methods and we show that our method detects group-level modules that are more representative of the modules of multiple individuals. Finally, the experiments on synthetic images quantitatively demonstrate that the ICSC algorithm detects group-level and subject-level modules accurately under varied conditions. Therefore, besides identifying functional modules for a population of subjects, the proposed method can be used for applications in personalized neuroscience. The ICSC implementation is available at https://github.com/SCSE-Biomedical-Computing-Group/ICSC.",
                "authors": [
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Rajapakse J.C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Iterative consensus spectral clustering improves detection of subject and group level brain functional modules"
            },
            "pmcid": "PMC7200822",
            "pmid": "32371990"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}