{
    "additionDate": "2017-08-03T18:54:24Z",
    "biotoolsCURIE": "biotools:poly",
    "biotoolsID": "poly",
    "credit": [
        {
            "email": "wmchen@virginia.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://csg.sph.umich.edu/chen/Resume.htm"
        }
    ],
    "description": "Program for polygenic analysis and power analysis of human quantitative traits. It is convenient to use this to analyze multiple models / traits in large pedigrees.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://csg.sph.umich.edu/chen/public/software/poly/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://csg.sph.umich.edu/chen/public/software/poly/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/poly-0-4-0-polygenic-analysis-power-analysis-human-quantitative-traits.html"
        }
    ],
    "name": "POLY",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Variance component linkage analysis is commonly used to map quantitative trait loci (QTLs) in general pedigrees. Large pedigrees are especially attractive for these studies because they provide greater power per genotyped individual than small pedigrees. We propose accurate and computationally efficient methods to calculate the analytical power of variance component linkage analysis that can accommodate large pedigrees. Our analytical power computation involves the approximation of the noncentrality parameter for the likelihood-ratio test by its Taylor expansions. We develop efficient algorithms to compute the second and third moments of the identical by descent (IBD) sharing distribution and enable rapid computation of the Taylor expansions. Our algorithms take advantage of natural symmetries in pedigrees and can accurately analyze many large pedigrees in a few seconds. We verify the accuracy of our power calculation via simulation in pedigrees with 2-5 generations and 2-8 siblings per sibship. We apply this proposed analytical power calculation to 98 quantitative traits in a cohort study of 6,148 Sardinians in which the largest pedigree includes 625 phenotyped individuals. Simulations based on eight representative traits show that the difference between our analytical estimation of the expected LOD score and the average of simulated LOD scores is less than 0.05 (1.5%). Although our analytical calculations are for a fully informative marker locus, in the settings we examined power was similar to what could be attained with a single nucleotide polymorphism (SNP) mapping panel (with > 1 SNP/cM). Our algorithms for power analysis together with polygenic analysis are implemented in a freely available computer program, POLY. © 2006 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Chen W.-M."
                    },
                    {
                        "name": "Abecasis G.R."
                    }
                ],
                "citationCount": 20,
                "date": "2006-09-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Estimating the power of variance component linkage analysis in large pedigrees"
            },
            "pmid": "16685720"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ],
    "validated": 1
}