{
    "additionDate": "2020-01-09T18:23:38Z",
    "biotoolsCURIE": "biotools:AEDs",
    "biotoolsID": "AEDs",
    "confidence_flag": "low",
    "description": "Availability of automated external defibrillators in Hamilton, New Zealand.\n\nBACKGROUND:Last year, there were 2,000 out-of-hospital cardiac arrests (OHCA) in New Zealand, 74% received CPR but only 5.1% accessed an automated external defibrillator (AED). The average survival rate of OHCA is 13%. The aim of this study was to visit all 50 AED locations shown on www.hamiltoncentral.co.nz to assess their true availability and visibility to the public in the event of an OHCA. METHOD:All premises were visited and the first staff member encountered was asked if they were aware an AED was onsite, its location, hours of availability, if restricted access applied and whether it had been used. RESULTS:Of the 50 locations, three sites no longer exist and two AEDs were listed twice. Therefore, only 45 AEDs exist. Two sites had grossly inaccurate locations. Three AEDs (7%) were continuously available.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Hamilton'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31581184",
    "lastUpdate": "2020-01-09T18:23:38Z",
    "name": "AEDs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "BACKGROUND: Last year, there were 2,000 out-of-hospital cardiac arrests (OHCA) in New Zealand, 74% received CPR but only 5.1% accessed an automated external defibrillator (AED). The average survival rate of OHCA is 13%. The aim of this study was to visit all 50 AED locations shown on www.hamiltoncentral.co.nz to assess their true availability and visibility to the public in the event of an OHCA. METHOD: All premises were visited and the first staff member encountered was asked if they were aware an AED was onsite, its location, hours of availability, if restricted access applied and whether it had been used. RESULTS: Of the 50 locations, three sites no longer exist and two AEDs were listed twice. Therefore, only 45 AEDs exist. Two sites had grossly inaccurate locations. Three AEDs (7%) were continuously available. Nine AEDs were accessible after 6pm at least one day of the week. Thirteen AEDs were available on weekends; however, five required swipe card access. None of the AEDs were located outdoors. CONCLUSION: Far fewer than 50 listed AEDs are freely available to the public, especially after 6pm and on weekends. Lack of signposting and restrictions to access would lead to delayed defibrillation. This important health issue needs addressing.",
                "authors": [
                    {
                        "name": "O'Callaghan P.A."
                    },
                    {
                        "name": "Swampillai J."
                    },
                    {
                        "name": "Stiles M.K."
                    }
                ],
                "date": "2019-10-04T00:00:00Z",
                "journal": "The New Zealand medical journal",
                "title": "Availability of automated external defibrillators in Hamilton, New Zealand"
            },
            "pmid": "31581184"
        }
    ]
}