{
    "additionDate": "2017-01-17T15:00:12Z",
    "biotoolsCURIE": "biotools:dualks",
    "biotoolsID": "dualks",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "ericjkort@gmail.com",
            "name": "Eric J. Kort",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yarong.yang@ndsu.edu",
            "name": "Yarong Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package implements a Kolmogorov Smirnov rank-sum based algorithm for training (i.e. discriminant analysis--identification of genes that discriminate between classes) and classification of gene expression data sets.  One of the chief strengths of this approach is that it is amenable to the \"multiclass\" problem. That is, it can discriminate between more than 2 classes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/dualKS.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/dualKS_1.34.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/dualKS.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-2.0",
    "name": "dualKS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.4137/CIN.S2892",
            "metadata": {
                "abstract": "Background: Gene set enrichment analysis (GSEA) is an analytic approach which simultaneously reduces the dimensionality of microarray data and enables ready inference of the biological meaning of observed gene expression patterns. Here we invert the GSEA process to identify class-specific gene signatures. Because our approach uses the Kolmogorov-Smirnov approach both to define class specific signatures and to classify samples using those signatures, we have termed this methodology \"Dual-KS\" (DKS). Results: The optimum gene signature identified by the DKS algorithm was smaller than other methods to which it was compared in 5 out of 10 datasets. The estimated error rate of DKS using the optimum gene signature was smaller than the estimated error rate of the random forest method in 4 out of the 10 datasets, and was equivalent in two additional datasets. DKS performance relative to other benchmarked algorithms was similar to its performance relative to random forests. Conclusions: DKS is an efficient analytic methodology that can identify highly parsimonious gene signatures useful for classification in the context of microarray studies. The algorithm is available as the dualKS package for R as part of the bioconductor project. © the author(s), publisher and licensee Libertas Academica Ltd.",
                "authors": [
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Kort E.J."
                    },
                    {
                        "name": "Ebrahimi N."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Teh B.T."
                    }
                ],
                "citationCount": 1,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Cancer Informatics",
                "title": "Dual KS: Defining gene sets with tissue set enrichment analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1,
    "version": [
        "1.34.0"
    ]
}