{"credit":[{"email":"cuiqinghua@hsc.pku.edu.cn","name":"Dr. Qinghua Cui","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cuilab.cn/"}],"documentation":[{"url":"http://www.cuilab.cn/lnctar#help"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/lnctar-1-0-predicting-rna-targets-of-lncrnas.html"}],"publication":[{"abstract":"© The Author 2014. Published by Oxford University Press. Long noncoding RNAs (lncRNAs) represent a big category of noncoding RNA molecules, and increasing studies have shown that they play important roles in various critical biological processes. They show a diversity of functions through diverse mechanisms, among which regulating RNA molecules is one of the most popular ones. Given the big number of lncRNAs, it becomes urgent and important to predict the RNA targets of lncRNAs in a large scale for the comprehensive understanding of lncRNA functions and action mechanisms. Although several methods have been developed to predict RNA-RNA interactions, none of them can be used to predict the RNA targets of lncRNAs in a large scale. Here we presented a tool, LncTar, which shows the ability to efficiently predict the RNA targets of lncRNAs in a large scale. To test the accuracy of LncTar, we applied it to 10 experimentally supported lncRNA-mRNA interactions. As a result, LncTar successfully predicted 8 (80%) of the 10 lncRNA-mRNA pairs, suggesting that LncTar has a reliable accuracy. Finally, we believe that LncTar could be an efficient tool for the fast identification of the RNA targets of lncRNAs. LncTar is freely available at http://www.cuilab.cn/lnctar.","authors":["Li J.","Ma W.","Zeng P.","Wang J.","Geng B.","Yang J.","Cui Q."],"cit_count":52,"journal":"Briefings in Bioinformatics","pmid":"25524864","title":"LncTar: A tool for predicting the RNA targets of long noncoding RNAs","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:lnctar","biotoolsID":"lnctar","description":"Efficient tool for predicting RNA targets of lncRNAs (Long noncoding RNAs)","homepage":"http://www.cuilab.cn/lnctar","name":"LncTar"}}