{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-28T09:40:20.613489Z",
    "biotoolsCURIE": "biotools:mantis_index",
    "biotoolsID": "mantis_index",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "rob@cs.umd.edu",
            "name": "Rob Patro",
            "typeEntity": "Person"
        }
    ],
    "description": "Mantis is a space-efficient data structure that can be used to index thousands of raw- read experiments and facilitate large-scale sequence searches on those experiments. Mantis uses counting quotient filters instead of Bloom filters, enabling rapid index builds and queries, small indexes, and exact results, i.e., no false positives or negatives.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/splatlab/mantis/tree/mergeMSTs",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T15:59:39.148169Z",
    "license": "BSD-3-Clause",
    "name": "Mantis",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac142",
            "metadata": {
                "abstract": "Motivation: In the past few years, researchers have proposed numerous indexing schemes for searching large datasets of raw sequencing experiments. Most of these proposed indexes are approximate (i.e. with one-sided errors) in order to save space. Recently, researchers have published exact indexes-Mantis, VariMerge and Bifrost-that can serve as colored de Bruijn graph representations in addition to serving as k-mer indexes. This new type of index is promising because it has the potential to support more complex analyses than simple searches. However, in order to be useful as indexes for large and growing repositories of raw sequencing data, they must scale to thousands of experiments and support efficient insertion of new data. Results: In this paper, we show how to build a scalable and updatable exact raw sequence-search index. Specifically, we extend Mantis using the Bentley-Saxe transformation to support efficient updates, called Dynamic Mantis. We demonstrate Dynamic Mantis's scalability by constructing an index of ?40K samples from SRA by adding samples one at a time to an initial index of 10K samples. Compared to VariMerge and Bifrost, Dynamic Mantis is more efficient in terms of index-construction time and memory, query time and memory and index size. In our benchmarks, VariMerge and Bifrost scaled to only 5K and 80 samples, respectively, while Dynamic Mantis scaled to more than 39K samples. Queries were over 24× faster in Mantis than in Bifrost (VariMerge does not immediately support general search queries we require). Dynamic Mantis indexes were about 2.5× smaller than Bifrost's indexes and about half as big as VariMerge's indexes.",
                "authors": [
                    {
                        "name": "Almodaresi F."
                    },
                    {
                        "name": "Ferdman M."
                    },
                    {
                        "name": "Johnson R."
                    },
                    {
                        "name": "Khan J."
                    },
                    {
                        "name": "Madaminov S."
                    },
                    {
                        "name": "Pandey P."
                    },
                    {
                        "name": "Patro R."
                    }
                ],
                "citationCount": 4,
                "date": "2022-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "An incrementally updatable and scalable system for large-scale sequence search using the Bentley-Saxe transformation"
            },
            "pmcid": "PMC9191210",
            "pmid": "35325039"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
