{
    "name": "E-RNAi", 
    "description": "E-RNAi is a tool for designing and evaluating dsRNA constructs suitable for RNAi experiments in 12 organisms including Drosophila, C. elegans, human and other emerging model organisms. E-RNAi also facilitates the design of secondary RNAi reagents for validation experiments, evaluation of pooled siRNA reagents and batch design.", 
    "homepage": "http://e-rnai.dkfz.de/", 
    "biotoolsID": "e-rnai", 
    "biotoolsCURIE": "biotools:e-rnai", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2428", 
                    "term": "Validation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3523", 
            "term": "RNAi experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_0659", 
            "term": "Functional, regulatory and non-coding RNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0621", 
            "term": "Model organisms"
        }, 
        {
            "uri": "http://edamontology.org/topic_3678", 
            "term": "Experimental design and studies"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://b110-wiki.dkfz.de/confluence/display/ernai/Overview", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15980541", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "E-RNAi: A web application to design optimized RNAi constructs", 
                "abstract": "RNA interference (RNAi) has become a powerful genetic approach to systematically dissect gene function on a genome-wide scale. Owing to the penetrance and efficiency of RNAi in invertebrates, model organisms such as Drosophila melanogaster and Caenorhabditis elegans have contributed significantly to the identification of novel components of diverse biological pathways, ranging from early development to fat storage and aging. For the correct assessment of phenotypes, a key issue remains the stringent quality control of long double-stranded RNAs (dsRNA) to calculate potential off-target effects that may obscure the phenotypic data. We here describe a web-based tool to evaluate and design optimized dsRNA constructs. Moreover, the application also gives access to published predesigned dsRNAs. The E-RNAi web application is available at http://e-rnai.dkfz.de/. © 2005 Oxford University Press.", 
                "date": "2005-07-01T00:00:00Z", 
                "citationCount": 62, 
                "authors": [
                    {
                        "name": "Arziman Z."
                    }, 
                    {
                        "name": "Horn T."
                    }, 
                    {
                        "name": "Boutros M."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "14764878", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Genome-Wide RNAi Analysis of Growth and Viability in Drosophila Cells", 
                "abstract": "A crucial aim upon completion of whole genome sequences is the functional analysis of all predicted genes. We have applied a high-throughput RNA-interference (RNAi) screen of 19,470 double-stranded (ds) RNAs in cultured cells to characterize the function of nearly all (91%) predicted. Drosophila genes in cell growth and viability. We found 438 dsRNAs that identified essential genes, among which 80% lacked mutant alleles. A quantitative assay of cell number was applied to identify genes of known and uncharacterized functions. In particular, we demonstrate a role for the homolog of a mammalian acute myeloid leukemia gene (AML1) in cell survival. Such a systematic screen for cell phenotypes, such as cell viability, can thus be effective in characterizing functionally related genes on a genome-wide scale.", 
                "date": "2004-02-06T00:00:00Z", 
                "citationCount": 552, 
                "authors": [
                    {
                        "name": "Boutros M."
                    }, 
                    {
                        "name": "Kiger A.A."
                    }, 
                    {
                        "name": "Armknecht S."
                    }, 
                    {
                        "name": "Kerr K."
                    }, 
                    {
                        "name": "Hild M."
                    }, 
                    {
                        "name": "Koch B."
                    }, 
                    {
                        "name": "Haas S.A."
                    }, 
                    {
                        "name": "Paro R."
                    }, 
                    {
                        "name": "Perrimon N."
                    }
                ], 
                "journal": "Science"
            }
        }, 
        {
            "doi": null, 
            "pmid": "20444868", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "E-RNAi: A web application for the multi-species design of RNAi reagents-2010 update", 
                "abstract": "The design of RNA interference (RNAi) reagents is an essential step for performing loss-of-function studies in many experimental systems. The availability of sequenced and annotated genomes greatly facilitates RNAi experiments in an increasing number of organisms that were previously not genetically tractable. The E-RNAi web-service, accessible at http://www.e-rnai.org/, provides a computational resource for the optimized design and evaluation of RNAi reagents. The 2010 update of E-RNAi now covers 12 genomes, including Drosophila, Caenorhabditis elegans, human, emerging model organisms such as Schmidtea mediterranea and Acyrthosiphon pisum, as well as the medically relevant vectors Anopheles gambiae and Aedes aegypti. The web service calculates RNAi reagents based on the input of target sequences, sequence identifiers or by visual selection of target regions through a genome browser interface. It identifies optimized RNAi target-sites by ranking sequences according to their predicted specificity, efficiency and complexity. E-RNAi also facilitates the design of secondary RNAi reagents for validation experiments, evaluation of pooled siRNA reagents and batch design. Results are presented online, as a downloadable HTML report and as tab-delimited files. © The Author(s) 2010. Published by Oxford University Press.", 
                "date": "2010-05-05T00:00:00Z", 
                "citationCount": 62, 
                "authors": [
                    {
                        "name": "Horn T."
                    }, 
                    {
                        "name": "Boutros M."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "E-RNAi Support", 
            "email": "ernai@dkfz-heidelberg.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:14:02Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}