{
    "additionDate": "2022-06-08T09:20:19.912395Z",
    "biotoolsCURIE": "biotools:answer",
    "biotoolsID": "answer",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Chelsea Raulerson"
        }
    ],
    "description": "ANSWER can be used by clinical geneticists or pathologists to identify clinically actionable variants from next-generation sequencing data for the purposes of recommending personalized treatment options.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://answer-wiki.readthedocs.io",
    "language": [
        "Java",
        "Python",
        "SQL"
    ],
    "lastUpdate": "2022-06-08T09:20:19.915021Z",
    "name": "ANSWER",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1200/CCI.21.00113",
            "metadata": {
                "abstract": "© 2022 American Society of Clinical Oncology.PURPOSE: To better use genetic testing, which is used by clinicians to explain the molecular mechanism of disease and to suggest clinical actionability and new treatment options, clinical next-generation sequencing (NGS) laboratories must send the results into reports in PDF and discrete data element format (HL7). Although most clinical diagnostic tests have set molecular markers tested and have a set range of values or a binary result (positive or negative), the NGS genetic test could examine hundreds or thousands of genes with no predefined list of variants. Although there are some commercial and open-source tools for clinically reporting genomics results for oncology testing, they often lack necessary features. METHODS: Using several available software tools for data storage including MySQL and MongoDB, database querying with Python, and a web-based user application using JAVA and JAVA script, we have developed a tool to store and query complex genomics and demographics data, which can be manually curated and reported by the user. RESULTS: We have developed a tool, Annotation SoftWare for Electronic Reporting (ANSWER), that can allow molecular pathologists to (1) filter variants to find those meeting quality control metrics in the genes that are clinically actionable by diagnosis; (2) visualize variants using data generated in the bioinformatics analysis; (3) create annotations that can be reused in future reports with association specific to the gene, variant, or diagnosis; (4) select variants and annotations that should be reported to match the details of the case; and (5) generate a report that includes demographics, reported variants, clinical actionability annotation, and references that can be exported into PDF or HL7 format, which can be electronically sent to an electronic health record. CONCLUSION: ANSWER is a tool that can be installed locally and is designed to meet the clinical reporting needs of a clinical oncology NGS laboratory for reporting.",
                "authors": [
                    {
                        "name": "Cantarel B."
                    },
                    {
                        "name": "Gagan J."
                    },
                    {
                        "name": "Jimenez G."
                    },
                    {
                        "name": "Malter J."
                    },
                    {
                        "name": "Raulerson C."
                    },
                    {
                        "name": "Sorelle J."
                    },
                    {
                        "name": "Villa E."
                    },
                    {
                        "name": "Wakeland B."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "ANSWER: Annotation Software for Electronic Reporting"
            },
            "pmid": "35025668"
        }
    ],
    "toolType": [
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
