{
    "additionDate": "2021-01-18T11:15:42Z",
    "biotoolsCURIE": "biotools:hdac3i-finder",
    "biotoolsID": "hdac3i-finder",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jie Xia",
            "typeEntity": "Person"
        }
    ],
    "description": "A Machine Learning-based Computational Tool to Screen for HDAC3 Inhibitors.\n\nHDAC3i-Finder is a python GUI application for virtually screening for HDAC3 inhibitors with a thoroughly validated machine-learning model 'XGBoost_Morgan2', i.e. the model built with XGBoost as the algorithm and Morgan2 fingerprints as features. It was designed to run on any Windows-based machine.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jwxia2014/HDAC3i-Finder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T11:14:56Z",
    "license": "GPL-3.0",
    "name": "HDAC3i-Finder",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/MINF.202000105",
            "metadata": {
                "abstract": "© 2020 Wiley-VCH GmbHHistone deacetylase 3 (HDAC3) is a potential drug target for treatment of human diseases such as cancer, chronic inflammation, neurodegenerative diseases and diabetes. Machine learning (ML) as an essential cheminformatics approach has been widely used for QSAR modeling. However, none of them has been applied to HDAC3. To this end, we carefully compiled a set of 1098 compounds from the ChEMBL database that have been assayed against HDAC3 and calculated three different sets of molecular features for each compound, i. e. two-dimensional Mordred descriptors, MACCS keys (166 bits) and Morgan2 fingerprints (1024 bits). Five ML classifiers, i. e. k-Nearest Neighbour (KNN), Support Vector Machine (SVM), Random forest (RF), eXtreme Gradient Boosting (XGBoost) and Deep Neural Network (DNN) were trained on each feature set and optimized for classification. A total of 15 models were generated and carefully compared, among which the best-performing one was the XGBoost model based on the Morgan2 fingerprints, i. e. XGBoost_morgan2. Evaluated on a well-curated benchmarking set named MUBD-HDAC3, this model achieved a high early ROC enrichment (ROCE0.5 %: 41.02). A further retrospective screening of an annotated chemical library in PubChem demonstrated that the best model could identify 8 novel-scaffold HDAC3 inhibitors while assaying only 1 % of the compounds. To make this model accessible for the scientific community, we developed a python GUI application named HDAC3i-Finder to facilitate prospective screening for HDAC3 inhibitors. The source code of HDAC3i-Finder is available at https://github.com/jwxia2014/HDAC3i-Finder.",
                "authors": [
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Kirchmair J."
                    },
                    {
                        "name": "Zhu Z."
                    },
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Xia J."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Molecular Informatics",
                "title": "HDAC3i-Finder: A Machine Learning-based Computational Tool to Screen for HDAC3 Inhibitors"
            },
            "pmid": "33067876"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}