{
    "additionDate": "2017-04-21T12:31:15Z",
    "biotoolsCURIE": "biotools:stanfordmicroarraydb",
    "biotoolsID": "stanfordmicroarraydb",
    "credit": [
        {
            "email": "ball@genome.stanford.edu",
            "name": "Catherine A. Ball",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Stores raw and normalized data from microarray experiments, as well as their corresponding image files. In addition, it provides interfaces for data retrieval, analysis and visualization.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://smd.princeton.edu/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ]
        }
    ],
    "homepage": "http://genome-www5.stanford.edu/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "name": "Stanford Microarray Database (SMD)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Hundreds of researchers across the world use the Stanford Microarray Database (SMD; http://smd.stanford.edu/) to store, annotate, view, analyze and share microarray data. In addition to providing registered users at Stanford access to their own data, SMD also provides access to public data, and tools with which to analyze those data, to any public user anywhere in the world. Previously, the addition of new microarray data analysis tools to SMD has been limited by available engineering resources, and in addition, the existing suite of tools did not provide a simple way to design, execute and share analysis pipelines, or to document such pipelines for the purposes of publication. To address this, we have incorporated the GenePattern software package directly into SMD, providing access to many new analysis tools, as well as a plug-in architecture that allows users to directly integrate and share additional tools through SMD. In this article, we describe our implementation of the GenePattern microarray analysis software package into the SMD code base. This extension is available with the SMD source code that is fully and freely available to others under an Open Source license, enabling other groups to create a local installation of SMD with an enriched data analysis capability. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Hubble J."
                    },
                    {
                        "name": "Demeter J."
                    },
                    {
                        "name": "Jin H."
                    },
                    {
                        "name": "Mao M."
                    },
                    {
                        "name": "Nitzberg M."
                    },
                    {
                        "name": "Reddy T.B.K."
                    },
                    {
                        "name": "Wymore F."
                    },
                    {
                        "name": "Zachariah Z.K."
                    },
                    {
                        "name": "Sherlock G."
                    },
                    {
                        "name": "Ball C.A."
                    }
                ],
                "citationCount": 89,
                "date": "2009-01-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Implementation of GenePattern within the Stanford Microarray Database"
            },
            "pmid": "18953035"
        },
        {
            "metadata": {
                "abstract": "The Stanford Microarray Database (SMD; http://genome-www.stanford.edu/microarray/) serves as a microarray research database for Stanford investigators and their collaborators. In addition, SMD functions as a resource for the entire scientific community, by making freely available all of its source code and providing full public access to data published by SMD users, along with many tools to explore and analyze those data. SMD currently provides public access to data from 3500 microarrays, including data from 85 publications, and this total is increasing rapidly. In this article, we describe some of SMD's newer tools for accessing public data, assessing data quality and for data analysis.",
                "authors": [
                    {
                        "name": "Gollub J."
                    },
                    {
                        "name": "Ball C.A."
                    },
                    {
                        "name": "Binkley G."
                    },
                    {
                        "name": "Demeter J."
                    },
                    {
                        "name": "Finkelstein D.B."
                    },
                    {
                        "name": "Hebert J.M."
                    },
                    {
                        "name": "Hernandez-Boussard T."
                    },
                    {
                        "name": "Jin H."
                    },
                    {
                        "name": "Kaloper M."
                    },
                    {
                        "name": "Matese J.C."
                    },
                    {
                        "name": "Schroeder M."
                    },
                    {
                        "name": "Brown P.O."
                    },
                    {
                        "name": "Botstein D."
                    },
                    {
                        "name": "Sherlock G."
                    }
                ],
                "citationCount": 273,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The Stanford Microarray Database: Data access and quality assessment tools"
            },
            "pmid": "12519956"
        },
        {
            "metadata": {
                "abstract": "The Stanford Microarray Database (SMD; http://smd.stanford.edu/) is a research tool and archive that allows hundreds of researchers worldwide to store, annotate, analyze and share data generated by microarray technology. SMD supports most major microarray platforms, and is MIAME-supportive and can export or import MAGE-ML. The primary mission of SMD is to be a research tool that supports researchers from the point of data generation to data publication and dissemination, but it also provides unrestricted access to analysis tools and public data from 300 publications. In addition to supporting ongoing research, SMD makes its source code fully and freely available to others under an Open Source license, enabling other groups to create a local installation of SMD. In this article, we describe several data analysis tools implemented in SMD and we discuss features of our software release. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Demeter J."
                    },
                    {
                        "name": "Beauheim C."
                    },
                    {
                        "name": "Gollub J."
                    },
                    {
                        "name": "Hernandez-Boussard T."
                    },
                    {
                        "name": "Jin H."
                    },
                    {
                        "name": "Maier D."
                    },
                    {
                        "name": "Matese J.C."
                    },
                    {
                        "name": "Nitzberg M."
                    },
                    {
                        "name": "Wymore F."
                    },
                    {
                        "name": "Zachariah Z.K."
                    },
                    {
                        "name": "Brown P.O."
                    },
                    {
                        "name": "Sherlock G."
                    },
                    {
                        "name": "Ball C.A."
                    }
                ],
                "citationCount": 127,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The stanford microarray database: Implementation of new analysis tools and open source release of software"
            },
            "pmid": "17182626"
        },
        {
            "metadata": {
                "abstract": "The Stanford Microarray Database (SMD) (http://smd.stanford.edu) is a research tool for hundreds of Stanford researchers and their collaborators. In addition, SMD functions as a resource for the entire biological research community by providing unrestricted access to microarray data published by SMD users and by disseminating its source code. In addition to storing GenePix (Axon Instruments) and ScanAlyze output from spotted microarrays, SMD has recently added the ability to store, retrieve, display and analyze the complete raw data produced by several additional microarray platforms and image analysis software packages, so that we can also now accept data from Affymetrix GeneChips (MAS5/GCOS or dChip), Agilent Catalog or Custom arrays (using Agilent's Feature Extraction software) or data created by SpotReader (Niles Scientific). We have implemented software that allows us to accept MAGE-ML documents from array manufacturers and to submit MIAME-compliant data in MAGE-ML format directly to Array Express and GEO, greatly increasing the ease with which data from SMD can be published adhering to accepted standards and also increasing the accessibility of published microarray data to the general public. We have introduced a new tool to facilitate data sharing among our users, so that datasets can be shared during, before or after the completion of data analysis. The latest version of the source code for the complete database package was released in November 2004 (http://smd.stanford. edu/download/), allowing researchers around the world to deploy their own installations of SMD. © Oxford University Press 2005; all rights reserved.",
                "authors": [
                    {
                        "name": "Ball C.A."
                    },
                    {
                        "name": "Awad I.A.B."
                    },
                    {
                        "name": "Demeter J."
                    },
                    {
                        "name": "Gollub J."
                    },
                    {
                        "name": "Hebert J.M."
                    },
                    {
                        "name": "Hernandez-Boussard T."
                    },
                    {
                        "name": "Jin H."
                    },
                    {
                        "name": "Matese J.C."
                    },
                    {
                        "name": "Nitzberg M."
                    },
                    {
                        "name": "Wymore F."
                    },
                    {
                        "name": "Zachariah Z.K."
                    },
                    {
                        "name": "Brown P.O."
                    },
                    {
                        "name": "Sherlock G."
                    }
                ],
                "citationCount": 153,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The Stanford Microarray Database accommodates additional microarray platforms and data formats"
            },
            "pmid": "15608265"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        }
    ],
    "validated": 1
}