{
    "additionDate": "2021-01-18T11:05:21Z",
    "biotoolsCURIE": "biotools:mob-suite",
    "biotoolsID": "mob-suite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "james.robertson@canada.ca",
            "name": "James Robertson",
            "orcidid": "https://orcid.org/0000-0002-8534-5694",
            "typeEntity": "Person"
        }
    ],
    "description": "Universal whole-sequence-based plasmid typing and its utility to prediction of host range and epidemiological surveillance.\n\nMOB-suite: Software tools for clustering, reconstruction and typing of plasmids from draft assemblies.\n\nPlasmids are mobile genetic elements (MGEs), which allow for rapid evolution and adaption of bacteria to new niches through horizontal transmission of novel traits to different genetic backgrounds. The MOB-suite is designed to be a modular set of tools for the typing and reconstruction of plasmid sequences from WGS assemblies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Plasmid map drawing",
                    "uri": "http://edamontology.org/operation_0578"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/phac-nml/mob-suite",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-26T09:07:24Z",
    "name": "MOB-suite",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1099/MGEN.0.000435",
            "metadata": {
                "abstract": "© 2020 The Authors.Bacterial plasmids play a large role in allowing bacteria to adapt to changing environments and can pose a significant risk to human health if they confer virulence and antimicrobial resistance (AMR). Plasmids differ significantly in the taxonomic breadth of host bacteria in which they can successfully replicate, this is commonly referred to as ‘host range’ and is usually described in qualitative terms of ŉarrow’ or ‘broad’. Understanding the host range potential of plasmids is of great interest due to their ability to disseminate traits such as AMR through bacterial populations and into human pathogens. We developed the MOB-suite to facilitate characterization of plasmids and introduced a whole-sequence- based classification system based on clustering complete plasmid sequences using Mash distances (https:// github. com/ phac- nml/ mob- suite). We updated the MOB-suite database from 12 091 to 23 671 complete sequences, representing 17 779 unique plasmids. With advances in new algorithms for rapidly calculating average nucleotide identity (ANI), we compared clustering characteristics using two different distance measures - Mash and ANI - and three clustering algorithms on the unique set of plasmids. The plasmid nomenclature is designed to group highly similar plasmids together that are unlikely to have multiple representatives within a single cell. Based on our results, we determined that clusters generated using Mash and complete-linkage clustering at a Mash distance of 0.06 resulted in highly homogeneous clusters while maintaining cluster size. The taxonomic distribution of plasmid biomarker sequences for replication and relaxase typing, in combination with MOB-suite whole-sequence- based clusters have been examined in detail for all high-quality publicly available plasmid sequences. We have incorporated prediction of plasmid replication host range into the MOB-suite based on observed distributions of these sequence features in combination with known plasmid hosts from the literature. Host range is reported as the highest taxonomic rank that covers all of the plasmids which share replicon or relaxase biomarkers or belong to the same MOB-suite cluster code. Reporting host range based on these criteria allows for comparisons of host range between studies and provides information for plasmid surveillance.",
                "authors": [
                    {
                        "name": "Robertson J."
                    },
                    {
                        "name": "Bessonov K."
                    },
                    {
                        "name": "Schonfeld J."
                    },
                    {
                        "name": "Nash H.E."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Universal whole-sequence-based plasmid typing and its utility to prediction of host range and epidemiological surveillance"
            },
            "pmcid": "PMC7660255",
            "pmid": "32969786"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}