{
    "additionDate": "2020-01-14T20:14:00Z",
    "biotoolsCURIE": "biotools:phylosubsets",
    "biotoolsID": "phylosubsets",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nathan.upham@yale.edu",
            "name": "Nathan S. Upham",
            "orcidid": "https://orcid.org/0000-0001-5412-9342",
            "typeEntity": "Person"
        },
        {
            "email": "walter.jetz@yale.edu",
            "name": "Walter Jetz",
            "typeEntity": "Person"
        }
    ],
    "description": "This tool provides a simple way to produce distributions of trees with subsets of taxa. If larger subsets are required you can download full trees. \nThe tool first trims to a subset, and then samples trees from a chosen pseudo-posterior distribution. Note that any further analyses should only be conducted with a large sample of trees.\n\nSelect species from the list which follows the taxonomy. Then copy and paste or drag and drop them into the box to the right.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://vertlife.org/phylosubsets",
    "lastUpdate": "2021-01-10T12:11:19Z",
    "name": "phylosubsets",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PBIO.3000494",
            "metadata": {
                "abstract": "© 2019 Upham et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Big, time-scaled phylogenies are fundamental to connecting evolutionary processes to modern biodiversity patterns. Yet inferring reliable phylogenetic trees for thousands of species involves numerous trade-offs that have limited their utility to comparative biologists. To establish a robust evolutionary timescale for all approximately 6,000 living species of mammals, we developed credible sets of trees that capture root-to-tip uncertainty in topology and divergence times. Our “backbone-and-patch” approach to tree building applies a newly assembled 31-gene supermatrix to two levels of Bayesian inference: (1) backbone relationships and ages among major lineages, using fossil node or tip dating, and (2) species-level “patch” phylogenies with nonoverlapping in-groups that each correspond to one representative lineage in the backbone. Species unsampled for DNA are either excluded (“DNA-only” trees) or imputed within taxonomic constraints using branch lengths drawn from local birth–death models (“completed” trees). Joining time-scaled patches to backbones results in species-level trees of extant Mammalia with all branches estimated under the same modeling framework, thereby facilitating rate comparisons among lineages as disparate as marsupials and placentals. We compare our phylogenetic trees to previous estimates of mammal-wide phylogeny and divergence times, finding that (1) node ages are broadly concordant among studies, and (2) recent (tip-level) rates of speciation are estimated more accurately in our study than in previous “supertree” approaches, in which unresolved nodes led to branch-length artifacts. Credible sets of mammalian phylogenetic history are now available for download at http://vertlife.org/phylosubsets, enabling investigations of long-standing questions in comparative biology.",
                "authors": [
                    {
                        "name": "Upham N.S."
                    },
                    {
                        "name": "Esselstyn J.A."
                    },
                    {
                        "name": "Jetz W."
                    }
                ],
                "citationCount": 103,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "Inferring the mammal tree: Species-level sets of phylogenies for questions in ecology, evolution, and conservation"
            },
            "pmcid": "PMC6892540",
            "pmid": "31800571"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ],
    "validated": 1
}