{
    "accessibility": "Open access",
    "additionDate": "2022-04-26T16:28:42.176300Z",
    "biotoolsCURIE": "biotools:kairosight",
    "biotoolsID": "kairosight",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nposnack@childrensnational.org",
            "name": "Nikki G. Posnack",
            "typeEntity": "Person"
        },
        {
            "name": "Damon McCullough"
        },
        {
            "name": "Rafael Jaimes 3rd"
        },
        {
            "name": "Tomas Prudencio"
        }
    ],
    "description": "Open-Source Software for the Analysis of Cardiac Optical Data Collected From Multiple Species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kairosight/kairosight-2.0",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-26T16:28:42.178875Z",
    "license": "GPL-3.0",
    "name": "KairoSight",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FPHYS.2021.752940",
            "metadata": {
                "abstract": "Copyright © 2021 Cooper, Gloschat, Swift, Prudencio, McCullough, Jaimes and Posnack.Cardiac optical mapping, also known as optocardiography, employs parameter-sensitive fluorescence dye(s) to image cardiac tissue and resolve the electrical and calcium oscillations that underly cardiac function. This technique is increasingly being used in conjunction with, or even as a replacement for, traditional electrocardiography. Over the last several decades, optical mapping has matured into a “gold standard” for cardiac research applications, yet the analysis of optical signals can be challenging. Despite the refinement of software tools and algorithms, significant programming expertise is often required to analyze large optical data sets, and data analysis can be laborious and time-consuming. To address this challenge, we developed an accessible, open-source software script that is untethered from any subscription-based programming language. The described software, written in python, is aptly named “KairoSight” in reference to the Greek word for “opportune time” (Kairos) and the ability to “see” voltage and calcium signals acquired from cardiac tissue. To demonstrate analysis features and highlight species differences, we employed experimental datasets collected from mammalian hearts (Langendorff-perfused rat, guinea pig, and swine) dyed with RH237 (transmembrane voltage) and Rhod-2, AM (intracellular calcium), as well as human induced pluripotent stem cell-derived cardiomyocytes (hiPSC-CM) dyed with FluoVolt (membrane potential), and Fluo-4, AM (calcium indicator). We also demonstrate cardiac responsiveness to ryanodine (ryanodine receptor modulator) and isoproterenol (beta-adrenergic agonist) and highlight regional differences after an ablation injury. KairoSight can be employed by both basic and clinical scientists to analyze complex cardiac optical mapping datasets without requiring dedicated computer science expertise or proprietary software.",
                "authors": [
                    {
                        "name": "Cooper B.L."
                    },
                    {
                        "name": "Gloschat C."
                    },
                    {
                        "name": "Jaimes R."
                    },
                    {
                        "name": "McCullough D."
                    },
                    {
                        "name": "Posnack N.G."
                    },
                    {
                        "name": "Prudencio T."
                    },
                    {
                        "name": "Swift L.M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-10-29T00:00:00Z",
                "journal": "Frontiers in Physiology",
                "title": "KairoSight: Open-Source Software for the Analysis of Cardiac Optical Data Collected From Multiple Species"
            },
            "pmcid": "PMC8586513",
            "pmid": "34777017"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
