{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T13:59:20Z",
    "biotoolsCURIE": "biotools:scMatch",
    "biotoolsID": "scMatch",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rui.hou@research.uwa.edu.au",
            "name": "Rui Hou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Single-cell gene expression profile annotation tool using reference datasets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/forrest-lab/scMatch/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ]
        }
    ],
    "homepage": "https://github.com/forrest-lab/scMatch",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "scMatch",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz292",
            "metadata": {
                "abstract": "© 2019 The Author(s).Single-cell RNA sequencing (scRNA-seq) measures gene expression at the resolution of individual cells. Massively multiplexed single-cell profiling has enabled large-scale transcriptional analyses of thousands of cells in complex tissues. In most cases, the true identity of individual cells is unknown and needs to be inferred from the transcriptomic data. Existing methods typically cluster (group) cells based on similarities of their gene expression profiles and assign the same identity to all cells within each cluster using the averaged expression levels. However, scRNA-seq experiments typically produce low-coverage sequencing data for each cell, which hinders the clustering process. Results: We introduce scMatch, which directly annotates single cells by identifying their closest match in large reference datasets. We used this strategy to annotate various single-cell datasets and evaluated the impacts of sequencing depth, similarity metric and reference datasets. We found that scMatch can rapidly and robustly annotate single cells with comparable accuracy to another recent cell annotation tool (SingleR), but that it is quicker and can handle larger reference datasets. We demonstrate how scMatch can handle large customized reference gene expression profiles that combine data from multiple sources, thus empowering researchers to identify cell populations in any complex tissue with the desired precision.",
                "authors": [
                    {
                        "name": "Hou R."
                    },
                    {
                        "name": "Denisenko E."
                    },
                    {
                        "name": "Forrest A.R.R."
                    }
                ],
                "citationCount": 20,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScMatch: A single-cell gene expression profile annotation tool using reference datasets"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}