{
    "additionDate": "2021-10-04T13:13:14.574512Z",
    "biotoolsCURIE": "biotools:mainzelhandler",
    "biotoolsID": "mainzelhandler",
    "confidence_flag": "tool",
    "description": "MainzelHandler is library for a simple integration and usage of the Mainzelliste, a web-based first-level pseudonymization service.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/DanielPreciado-Marquez/MainzelHandler",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2021-10-04T13:13:14.577244Z",
    "license": "MIT",
    "name": "MainzelHandler",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3233/SHTI210155",
            "metadata": {
                "abstract": "Pseudonymization plays a vital role in medical research. In Germany, the Technologie- und Methodenplattform für die vernetzte medizinische Forschung e.V. (TMF) has developed guidelines on how to create pseudonyms and how to handle personally identifiable information (PII) during this process. An open-source implementation of a pseudonymization service following these guidelines and therefore recommended by the TMF is the so-called \"Mainzelliste\". This web application supports a REST-API for (de-) pseudonymization. For security reasons, a complex session and tokening mechanism for each (de-) pseudonymization is required and a careful interaction between front- and backend to ensure a correct handling of PII. The objective of this work is the development of a library to simplify the integration and usage of the Mainzelliste's API in a TMF conform way. The frontend library uses JavaScript while the backend component is based on Java with an optional Spring Boot extension. The library is available under MIT open-source license from https://github.com/DanielPreciado-Marquez/MainzelHandler.",
                "authors": [
                    {
                        "name": "Preciado-Marquez D."
                    },
                    {
                        "name": "Becker L."
                    },
                    {
                        "name": "Storck M."
                    },
                    {
                        "name": "Greulich L."
                    },
                    {
                        "name": "Dugas M."
                    },
                    {
                        "name": "Brix T.J."
                    }
                ],
                "date": "2021-05-27T00:00:00Z",
                "journal": "Studies in health technology and informatics",
                "title": "MainzelHandler: A Library for a Simple Integration and Usage of the Mainzelliste"
            },
            "pmid": "34042740"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        }
    ]
}