{
    "accessibility": "Open access",
    "additionDate": "2022-10-05T23:15:02.304189Z",
    "biotoolsCURIE": "biotools:smart2p",
    "biotoolsID": "smart2p",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "monica.moroni@outlook.com",
            "name": "Monica Moroni",
            "typeEntity": "Person"
        },
        {
            "email": "s.panzeri@uke.de",
            "name": "Stefano Panzeri",
            "typeEntity": "Person"
        },
        {
            "name": "Marco Brondi"
        },
        {
            "name": "Tommaso Fellin"
        }
    ],
    "description": "A software for generating and processing smart line recording trajectories for population two-photon calcium imaging.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/flatironinstitute/NoRMCorre/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/moni90/SmART2P",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:29:49.107491Z",
    "license": "MIT",
    "name": "SmaRT2P",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s40708-022-00166-4",
            "metadata": {
                "abstract": "Two-photon fluorescence calcium imaging allows recording the activity of large neural populations with subcellular spatial resolution, but it is typically characterized by low signal-to-noise ratio (SNR) and poor accuracy in detecting single or few action potentials when large number of neurons are imaged. We recently showed that implementing a smart line scanning approach using trajectories that optimally sample the regions of interest increases both the SNR fluorescence signals and the accuracy of single spike detection in population imaging in vivo. However, smart line scanning requires highly specialised software to design recording trajectories, interface with acquisition hardware, and efficiently process acquired data. Furthermore, smart line scanning needs optimized strategies to cope with movement artefacts and neuropil contamination. Here, we develop and validate SmaRT2P, an open-source, user-friendly and easy-to-interface Matlab-based software environment to perform optimized smart line scanning in two-photon calcium imaging experiments. SmaRT2P is designed to interface with popular acquisition software (e.g., ScanImage) and implements novel strategies to detect motion artefacts, estimate neuropil contamination, and minimize their impact on functional signals extracted from neuronal population imaging. SmaRT2P is structured in a modular way to allow flexibility in the processing pipeline, requiring minimal user intervention in parameter setting. The use of SmaRT2P for smart line scanning has the potential to facilitate the functional investigation of large neuronal populations with increased SNR and accuracy in detecting the discharge of single and few action potentials.",
                "authors": [
                    {
                        "name": "Brondi M."
                    },
                    {
                        "name": "Fellin T."
                    },
                    {
                        "name": "Moroni M."
                    },
                    {
                        "name": "Panzeri S."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Brain Informatics",
                "title": "SmaRT2P: a software for generating and processing smart line recording trajectories for population two-photon calcium imaging"
            },
            "pmcid": "PMC9352634",
            "pmid": "35927517"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
