{
    "additionDate": "2017-01-13T13:14:18Z",
    "biotoolsCURIE": "biotools:dial",
    "biotoolsID": "dial",
    "credit": [
        {
            "email": "clotelab@bc.edu",
            "name": "Clote Structural Biology Lab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server that provides structural alignment of RNA without the help of a reference genome. It takes into account nucleotide sequence similarity, dihedral angle similarity and nucleotide base-pairing similarity.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.bc.edu/clotelab/DIAL/help.html"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global structure alignment",
                    "uri": "http://edamontology.org/operation_0510"
                },
                {
                    "term": "Local structure alignment",
                    "uri": "http://edamontology.org/operation_0509"
                },
                {
                    "term": "Nucleic acid structure comparison",
                    "uri": "http://edamontology.org/operation_2518"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.bc.edu/clotelab/DIAL/",
    "language": [
        "C",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "DIAL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The most common application for the next-generation sequencing technologies is resequencing, where short reads from the genome of an individual are aligned to a reference genome sequence for the same species. These mappings can then be used to identify genetic differences among individuals in a population, and perhaps ultimately to explain phenotypic variation. Many algorithms capable of aligning short reads to the reference, and determining differences between them have been reported. Much less has been reported on how to use these technologies to determine genetic differences among individuals of a species for which a reference sequence is not available, which drastically limits the number of species that can easily benefit from these new technologies.Results: We describe a computational pipeline, called DIAL (De novo Identification of Alleles), for identifying single-base substitutions between two closely related genomes without the help of a reference genome. The method works even when the depth of coverage is insufficient for de novo assembly, and it can be extended to determine small insertions/deletions. We evaluate the software's effectiveness using published Roche/454 sequence data from the genome of Dr. James Watson (to detect heterozygous positions) and recent Illumina data from orangutan, in each case comparing our results to those from computational analysis that uses a reference genome assembly. We also illustrate the use of DIAL to identify nucleotide differences among transcriptome sequences.Conclusions: DIAL can be used for identification of nucleotide differences in species for which no reference sequence is available. Our main motivation is to use this tool to survey the genetic diversity of endangered species as the identified sequence differences can be used to design genotyping arrays to assist in the species' management. The DIAL source code is freely available at http://www.bx.psu.edu/miller_lab/. © 2010 Ratan et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hayes V.M."
                    },
                    {
                        "name": "Miller W."
                    },
                    {
                        "name": "Ratan A."
                    },
                    {
                        "name": "Schuster S.C."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 31,
                "date": "2010-03-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Calling SNPs without a reference sequence"
            },
            "pmid": "20230626"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}
