{
    "additionDate": "2018-06-16T09:53:09Z",
    "biotoolsCURIE": "biotools:sampledrift",
    "biotoolsID": "sampledrift",
    "credit": [
        {
            "email": "carl.brunius@chalmers.se",
            "name": "Carl Brunius",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A package to explore the effects of pre-centrifugation storage on plasma sample quality.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gitlab.com/CarlBrunius/sampleDrift"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/CarlBrunius/sampleDrift",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:40:52.834917Z",
    "name": "sampleDrift",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx442",
            "metadata": {
                "abstract": "Motivation Biobanks are important infrastructures for life science research. Optimal sample handling regarding e.g. collection and processing of biological samples is highly complex, with many variables that could alter sample integrity and even more complex when considering multiple study centers or using legacy samples with limited documentation on sample management. Novel means to understand and take into account such variability would enable high-quality research on archived samples. Results This study investigated whether pre-analytical sample variability could be predicted and reduced by modeling alterations in the plasma metabolome, measured by NMR, as a function of pre-centrifugation conditions (1-36 h pre-centrifugation delay time at 4 °C and 22 °C) in 16 individuals. Pre-centrifugation temperature and delay times were predicted using random forest modeling and performance was validated on independent samples. Alterations in the metabolome were modeled at each temperature using a cluster-based approach, revealing reproducible effects of delay time on energy metabolism intermediates at both temperatures, but more pronounced at 22 °C. Moreover, pre-centrifugation delay at 4 °C resulted in large, specific variability at 3 h, predominantly of lipids. Pre-analytical sample handling error correction resulted in significant improvement of data quality, particularly at 22 °C. This approach offers the possibility to predict pre-centrifugation delay temperature and time in biobanked samples before use in costly downstream applications. Moreover, the results suggest potential to decrease the impact of undesired, delay-induced variability. However, these findings need to be validated in multiple, large sample sets and with analytical techniques covering a wider range of the metabolome, such as LC-MS. Availability and implementation The sampleDrift R package is available at https://gitlab.com/CarlBrunius/sampleDrift. Contact carl.brunius@chalmers.se Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Andersson L.I."
                    },
                    {
                        "name": "Brunius C."
                    },
                    {
                        "name": "Karlsson B.G."
                    },
                    {
                        "name": "Landberg R."
                    },
                    {
                        "name": "Malmodin D."
                    },
                    {
                        "name": "Pedersen A."
                    },
                    {
                        "name": "Tybring G."
                    }
                ],
                "citationCount": 18,
                "date": "2017-11-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Prediction and modeling of pre-analytical sampling errors as a strategy to improve plasma NMR metabolomics data"
            },
            "pmcid": "PMC5870544",
            "pmid": "29036400"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}
