{
    "additionDate": "2019-11-14T19:32:29Z",
    "biotoolsCURIE": "biotools:SWPepNovo",
    "biotoolsID": "SWPepNovo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lkl@hnu.edu.cn",
            "name": "Kenli Li",
            "typeEntity": "Person"
        }
    ],
    "description": "An Efficient De Novo Peptide Sequencing Tool for Large-scale MS/MS Spectra Analysis | Introduction： As the number of the MS/MS spectra increases rapidly, the excessive computation time taken by MS/MS spectra data analysis has become a critical concern in computational biology. In this work, we designed and implemented SWPepNovo, an efficient de novo peptide sequencing tool for large-scale MS/MS spectra data analysis using a novel peptide-spectrum matches (PSMs) algorithm. To achieve the high performance, we designed an improved scoring algorithm to reduce the time complexity and eliminate the data dependence to enable all possible locality and vectorizations. Performance is also tuned by pre-fetching, double buffering mechanism, and an optimized memory access scheme, to achieve an optimum performance and best utilization of various computing resources within neo-heterogeneous many-core architecture",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChuangLi99/SWPepNovo",
    "lastUpdate": "2020-12-27T13:08:04Z",
    "name": "SWPepNovo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7150/IJBS.32142",
            "metadata": {
                "abstract": "© The author(s).Tandem mass spectrometry (MS/MS)-based de novo peptide sequencing is a powerful method for high-throughput protein analysis. However, the explosively increasing size of MS/MS spectra dataset inevitably and exponentially raises the computational demand of existing de novo peptide sequencing methods, which is an issue urgently to be solved in computational biology. This paper introduces an efficient tool based on SW26010 many-core processor, namely SWPepNovo, to process the large-scale peptide MS/MS spectra using a parallel peptide spectrum matches (PSMs) algorithm. Our design employs a two-level parallelization mechanism: (1) the task-level parallelism between MPEs using MPI based on a data transformation method and a dynamic feedback task scheduling algorithm, (2) the thread-level parallelism across CPEs using asynchronous task transfer and multithreading. Moreover, three optimization strategies, including vectorization, double buffering and memory access optimizations, have been employed to overcome both the compute-bound and the memory-bound bottlenecks in the parallel PSMs algorithm. The results of experiments conducted on multiple spectra datasets demonstrate the performance of SWPepNovo against three state-of-the-art tools for peptide sequencing, including PepNovo+, PEAKS and DeepNovo-DIA. The SWPepNovo also shows high scalability in experiments on extremely large datasets sized up to 11.22 GB. The software and the parameter settings are available at https://github.com/ChuangLi99/SWPepNovo.",
                "authors": [
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Xie X."
                    },
                    {
                        "name": "Lin F."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "International Journal of Biological Sciences",
                "title": "SWPepNovo: An efficient de novo peptide sequencing tool for large-scale MS/MS spectra analysis"
            },
            "pmcid": "PMC6743289",
            "pmid": "31523183"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}