{
    "additionDate": "2017-01-17T15:07:57Z",
    "biotoolsCURIE": "biotools:prank",
    "biotoolsID": "prank",
    "collectionID": [
        "EBI Training Tools"
    ],
    "credit": [
        {
            "email": "ari.loytynoja@helsinki.fi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Probabilistic multiple alignment program for DNA, codon and amino-acid sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wasabiapp.org/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://wasabiapp.org/software/prank/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "PRANK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ebi_training_import",
    "publication": [
        {
            "doi": "10.1007/978-1-62703-646-7_10",
            "metadata": {
                "abstract": "Evolutionary analyses require sequence alignments that correctly represent evolutionary homology. Evolutionary and structural homology are not the same and sequence alignments generated with methods designed for structural matching can be seriously misleading in comparative and phylogenetic analyses. The phylogeny-aware alignment algorithm implemented in the program prank has been shown to produce good alignments for evolutionary inferences. Unlike other alignment programs, prank makes use of phylogenetic information to distinguish alignment gaps caused by insertions or deletions and, thereafter, handles the two types of events differently. As a by-product of the correct handling of insertions and deletions, prank can provide the inferred ancestral sequences as a part of the output and mark the alignment gaps differently depending on their origin in insertion or deletion events. As the algorithm infers the evolutionary history of the sequences, prank can be sensitive to errors in the guide phylogeny and violations on the underlying assumptions about the origin and patterns of gaps. These issues are discussed in detail and practical advice for the use of prank in evolutionary analysis is provided. The prank software and other methods discussed here can be found from the program home page at http://code.google.com/p/prank-msa/. © 2014 Springer Science+Business Media, LLC.",
                "authors": [
                    {
                        "name": "Loytynoja A."
                    }
                ],
                "citationCount": 191,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Phylogeny-aware alignment with PRANK"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}