
{
    "credit": [
        {
            "email": "grand.joldes@uwa.edu.au",
            "name": "Grand Roman Joldes",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://staffhome.ecm.uwa.edu.au/~00058942/resources.html#Scripts"
        }
    ],
    "function": [
        {
            "note": "Rupture potential index estimation",
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Physiology",
                "uri": "http://edamontology.org/topic_3300"
            },
            {
                "term": "Personalised medicine",
                "uri": "http://edamontology.org/topic_3577"
            },
            {
                "term": "Trauma medicine",
                "uri": "http://edamontology.org/topic_3414"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). An abdominal aortic aneurysm (AAA) is a permanent and irreversible dilation of the lower region of the aorta. It is a symptomless condition that, if left untreated, can expand until rupture. Despite ongoing efforts, an efficient tool for accurate estimation of AAA rupture risk is still not available. Furthermore, a lack of standardisation across current approaches and specific obstacles within computational workflows limit the translation of existing methods to the clinic. This paper presents BioPARR (Biomechanics based Prediction of Aneurysm Rupture Risk), a software system to facilitate the analysis of AAA using a finite element analysis based approach. Except semi-automatic segmentation of the AAA and intraluminal thrombus (ILT) from medical images, the entire analysis is performed automatically. The system is modular and easily expandable, allows the extraction of information from images of different modalities (e.g. CT and MRI) and the simulation of different modelling scenarios (e.g. with/without thrombus). The software uses contemporary methods that eliminate the need for patient-specific material properties, overcoming perhaps the key limitation to all previous patient-specific analysis methods. The software system is robust, free, and will allow researchers to perform comparative evaluation of AAA using a standardised approach. We report preliminary data from 48 cases.",
            "authors": [
                "Joldes G.R.",
                "Miller K.",
                "Wittek A.",
                "Forsythe R.O.",
                "Newby D.E.",
                "Doyle B.J."
            ],
            "cit_count": 6,
            "doi": "10.1038/s41598-017-04699-1",
            "journal": "Scientific Reports",
            "title": "BioPARR: A software system for estimating the rupture potential index for abdominal aortic aneurysms",
            "year": "2017-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bioparr",
        "biotoolsID": "bioparr",
        "description": "Software system for estimating the rupture potential index for abdominal aortic aneurysms.",
        "homepage": "http://bioparr.mech.uwa.edu.au/",
        "name": "BioPARR"
    }
}