{
    "additionDate": "2021-01-18T07:33:25Z",
    "biotoolsCURIE": "biotools:pvpred-scm",
    "biotoolsID": "pvpred-scm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong",
            "orcidid": "https://orcid.org/0000-0002-3394-8709",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved Prediction and Analysis of Phage Virion Proteins Using a Scoring Card Method.\n\nIn this work, we developed a novel PVP predictor named PVPred-SCM which is an efficient and interpretable method for predicting and analyzing PVPs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "http://camt.pythonanywhere.com/PVPred-SCM",
    "lastUpdate": "2021-01-30T14:18:07Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Shoombuatong2527/PVPred-SCM"
        }
    ],
    "name": "PVPred-SCM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/CELLS9020353",
            "metadata": {
                "abstract": "Although, existing methods have been successful in predicting phage (or bacteriophage) virion proteins (PVPs) using various types of protein features and complex classifiers, such as support vector machine and naïve Bayes, these two methods do not allow interpretability. However, the characterization and analysis of PVPs might be of great significance to understanding the molecular mechanisms of bacteriophage genetics and the development of antibacterial drugs. Hence, we herein proposed a novel method (PVPred-SCM) based on the scoring card method (SCM) in conjunction with dipeptide composition to identify and characterize PVPs. In PVPred-SCM, the propensity scores of 400 dipeptides were calculated using the statistical discrimination approach. Rigorous independent validation test showed that PVPred-SCM utilizing only dipeptide composition yielded an accuracy of 77.56%, indicating that PVPred-SCM performed well relative to the state-of-the-art method utilizing a number of protein features. Furthermore, the propensity scores of dipeptides were used to provide insights into the biochemical and biophysical properties of PVPs. Upon comparison, it was found that PVPred-SCM was superior to the existing methods considering its simplicity, interpretability, and implementation. Finally, in an effort to facilitate high-throughput prediction of PVPs, we provided a user-friendly web-server for identifying the likelihood of whether or not these sequences are PVPs. It is anticipated that PVPred-SCM will become a useful tool or at least a complementary existing method for predicting and analyzing PVPs.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Kanthawong S."
                    },
                    {
                        "name": "Schaduangrat N."
                    },
                    {
                        "name": "Shoombuatong W."
                    },
                    {
                        "name": "Yana J."
                    }
                ],
                "citationCount": 18,
                "date": "2020-02-03T00:00:00Z",
                "journal": "Cells",
                "title": "PVPred-SCM: Improved Prediction and Analysis of Phage Virion Proteins Using a Scoring Card Method"
            },
            "pmcid": "PMC7072630",
            "pmid": "32028709"
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
