{
    "accessibility": "Restricted access",
    "additionDate": "2025-05-16T09:56:39.880752Z",
    "biotoolsCURIE": "biotools:data_integration_quality_check_tool_diqct",
    "biotoolsID": "data_integration_quality_check_tool_diqct",
    "collectionID": [
        "eucaim"
    ],
    "cost": "Commercial",
    "credit": [
        {
            "email": "ioannach@auth.gr",
            "name": "Ioanna Chouvarda",
            "orcidid": "https://orcid.org/0000-0001-8915-6658",
            "typeEntity": "Person"
        }
    ],
    "description": "The Tool performs a quality assessment of a dataset based on a series of requirements that are set specifically for each use case. The tool informs the user of corrective actions that need to be taken prior to the data provision to ensure that the data provided is of high quality and reports a series of quality metrics characterizing the specific dataset.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://docs.google.com/document/d/1EnkkmFOGAo-WhPwx3OQ8vxSb3FKFn4b-/edit?usp=sharing&ouid=106267739460923945711&rtpof=true&sd=true"
        }
    ],
    "editPermission": {
        "authors": [
            "dimfilos"
        ],
        "type": "group"
    },
    "homepage": "https://www.mdpi.com/2939712",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2025-05-16T12:48:52.350815Z",
    "license": "Proprietary",
    "maturity": "Mature",
    "name": "Data Integration Quality Check Tool (DIQCT)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "authEucaim",
    "publication": [
        {
            "doi": "10.1109/EMBC48229.2022.9871018",
            "metadata": {
                "abstract": "Data harmonization is one of the greatest challenges in cancer imaging studies, especially when it comes to multi-source data provision. Properly integrated data deriving from various sources can ensure data fairness on one side and can lead to a trusted dataset that will enhance AI engine development on the other side. Towards this direction, we are presenting a data integration quality check tool that ensures that all data uploaded to the repository are homogenized and share the same principles. The tool's aim is to report any human-induced errors and propose corrective actions. It focuses on checking the data prior to their upload to the repository in five levels: (i) clinical metadata integrity, (ii) template-imaging consistency, (iii) anonymization protocol applied, (iv) imaging analysis requirements, (v) case completeness. The tool produces reports with the corrective actions that must be followed by the user. This way the tool ensures that the data that will become available to the developers of the AI engine are homogenized, properly structured and contain all the necessary information needed for the analysis. The tool was validated in two rounds, internal and external, and at the user experience level. Clinical Relevance - Supporting the harmonized preparation and provision of medical imaging data and related clinical data will ensure data fairness and enhance the AI development.",
                "authors": [
                    {
                        "name": "Chouvarda I."
                    },
                    {
                        "name": "Filos D."
                    },
                    {
                        "name": "Fotopoulos D."
                    },
                    {
                        "name": "Kosvyra A."
                    },
                    {
                        "name": "Tsave O."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS",
                "title": "Data Quality Check in Cancer Imaging Research: Deploying and Evaluating the DIQCT Tool"
            }
        },
        {
            "doi": "10.3390/info15090533",
            "metadata": {
                "abstract": "Cancer remains a major global health challenge, affecting diverse populations across various demographics. Integrating Artificial Intelligence (AI) into clinical settings to enhance disease outcome prediction presents notable challenges. This study addresses the limitations of AI-driven cancer care due to low-quality datasets by proposing a comprehensive three-step methodology to ensure high data quality in large-scale cancer-imaging repositories. Our methodology encompasses (i) developing a Data Quality Conceptual Model with specific metrics for assessment, (ii) creating a detailed data-collection protocol and a rule set to ensure data homogeneity and proper integration of multi-source data, and (iii) implementing a Data Integration Quality Check Tool (DIQCT) to verify adherence to quality requirements and suggest corrective actions. These steps are designed to mitigate biases, enhance data integrity, and ensure that integrated data meets high-quality standards. We applied this methodology within the INCISIVE project, an EU-funded initiative aimed at a pan-European cancer-imaging repository. The use-case demonstrated the effectiveness of our approach in defining quality rules and assessing compliance, resulting in improved data integration and higher data quality. The proposed methodology can assist the deployment of big data centralized or distributed repositories with data from diverse data sources, thus facilitating the development of AI tools.",
                "authors": [
                    {
                        "name": "Chouvarda I."
                    },
                    {
                        "name": "Filos D.T."
                    },
                    {
                        "name": "Fotopoulos D.T."
                    },
                    {
                        "name": "Kosvyra A."
                    },
                    {
                        "name": "Tsave O."
                    }
                ],
                "citationCount": 1,
                "date": "2024-09-01T00:00:00Z",
                "journal": "Information (Switzerland)",
                "title": "Toward Ensuring Data Quality in Multi-Site Cancer Imaging Repositories"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ]
}
