{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T11:07:33Z",
    "biotoolsCURIE": "biotools:hybridvel",
    "biotoolsID": "hybridvel",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Pratik Chhatbar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/946703-pratik-chhatbar"
        }
    ],
    "description": "Improved blood velocity measurements with a hybrid image filtering and iterative Radon transform",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/42019/versions/2/screenshot.png"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/42019-hybridvel",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:23:09.933094Z",
    "name": "HybridVel",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/fnins.2013.00106",
            "metadata": {
                "abstract": "Neural activity leads to hemodynamic changes which can be detected by functional magnetic resonance imaging (fMRI). The determination of blood flow changes in individual vessels is an important aspect of understanding these hemodynamic signals. Blood flow can be calculated from the measurements of vessel diameter and blood velocity. When using line-scan imaging, the movement of blood in the vessel leads to streaks in space-time images, where streak angle is a function of the blood velocity. A variety of methods have been proposed to determine blood velocity from such space-time image sequences. Of these, the Radon transform is relatively easy to implement and has fast data processing. However, the precision of the velocity measurements is dependent on the number of Radon transforms performed, which creates a trade-off between the processing speed and measurement precision. In addition, factors like image contrast, imaging depth, image acquisition speed, and movement artifacts especially in large mammals, can potentially lead to data acquisition that results in erroneous velocity measurements. Here we show that pre-processing the data with a Sobel filter and iterative application of Radon transforms address these issues and provide more accurate blood velocity measurements. Improved signal quality of the image as a result of Sobel filtering increases the accuracy and the iterative Radon transform offers both increased precision and an order of magnitude faster implementation of velocity measurements. This algorithm does not use a priori knowledge of angle information and therefore is sensitive to sudden changes in blood flow. It can be applied on any set of space-time images with red blood cell (RBC) streaks, commonly acquired through line-scan imaging or reconstructed from full-frame, time-lapse images of the vasculature. © 2013 Chhatbar and Kara.",
                "authors": [
                    {
                        "name": "Chhatbar P.Y."
                    },
                    {
                        "name": "Kara P."
                    }
                ],
                "citationCount": 28,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "Improved blood velocity measurements with a hybrid image filtering and iterative Radon transform algorithm"
            },
            "pmcid": "PMC3684769",
            "pmid": "23807877",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "version": [
        "1.1.0.0"
    ]
}
