{
    "accessibility": "Open access",
    "additionDate": "2022-07-24T21:52:30.047526Z",
    "biotoolsCURIE": "biotools:smart_r",
    "biotoolsID": "smart_r",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mj2947@cumc.columbia.edu",
            "name": "Michelle Jin",
            "orcidid": "https://orcid.org/0000-0002-8696-1958",
            "typeEntity": "Person"
        },
        {
            "email": "rajtarun.madangopal@nih.gov",
            "name": "Rajtarun Madangopal",
            "orcidid": "https://orcid.org/0000-0001-6202-302X",
            "typeEntity": "Person"
        },
        {
            "email": "sagolden@uw.edu",
            "name": "Sam A. Golden",
            "orcidid": "https://orcid.org/0000-0002-2104-2272",
            "typeEntity": "Person"
        }
    ],
    "description": "An Open-Source Extension of WholeBrain for Intact Mouse Brain Registration and Segmentation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://smartrpackage.shinyapps.io/smart_sample_dataset",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-24T21:52:30.049827Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://sgoldenlab.github.io/SMART/index.html"
        }
    ],
    "name": "SMART",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1523/ENEURO.0482-21.2022",
            "metadata": {
                "abstract": "© 2022 Jin et al.Mapping immediate early gene (IEG) expression across intact mouse brains allows for unbiased identification of brain-wide activity patterns underlying complex behaviors. Accurate registration of sample brains to a common anatomic reference is critical for precise assignment of IEG-positive (“active”) neurons to known brain regions of interest (ROIs). While existing automated voxel-based registration methods provide a high-throughput solution, they require substantial computing power, can be difficult to implement and fail when brains are damaged or only partially imaged. Additionally, it is challenging to cross-validate these approaches or compare them to any preexisting literature based on serial coronal sectioning. Here, we present the open-source R package SMART (Semi-Manual Alignment to Reference Templates) that extends the WholeBrain R package framework to automated segmentation and semi-auto-mated registration of intact mouse brain light-sheet fluorescence microscopy (LSFM) datasets. The SMART package was created for novice programmers and introduces a streamlined pipeline for aligning, registering, and segmenting LSFM volumetric datasets across the anterior-posterior (AP) axis, using a simple “choice game” and interactive menus. SMART provides the flexibility to register whole brains, partial brains or discrete user-chosen images, and is fully compatible with traditional sectioned coronal slice-based analyses. We demonstrate SMART’s corefunctions using example datasets and provide step-by-step video tutorials for installation and implementation of the package. We also present a modified iDISCO+ tissue clearing procedure for uniform immunohistochemical labeling of the activity marker Fos across intact mouse brains. The SMART pipeline, in conjunction with the modified iDISCO+ Fos pro-cedure, is ideally suited for examination and orthogonal cross-validation of brain-wide neuronal activation datasets.",
                "authors": [
                    {
                        "name": "Golden S.A."
                    },
                    {
                        "name": "Jin M."
                    },
                    {
                        "name": "Madangopal R."
                    },
                    {
                        "name": "Mejias-Aponte C.A."
                    },
                    {
                        "name": "Nguyen J.D."
                    },
                    {
                        "name": "Weber S.J."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "eNeuro",
                "title": "SMART: An Open-Source Extension of WholeBrain for Intact Mouse Brain Registration and Segmentation"
            },
            "pmcid": "PMC9070730",
            "pmid": "35396258"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
