{
    "additionDate": "2022-06-25T13:52:30.521965Z",
    "biotoolsCURIE": "biotools:evitar",
    "biotoolsID": "evitar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jun.lu@yale.edu",
            "name": "Jun Lu",
            "orcidid": "https://orcid.org/0000-0003-2726-7613",
            "typeEntity": "Person"
        }
    ],
    "description": "Evitar (Emerging-Virus-Targeting RNA) is a program for (1) pre-designing siRNAs/Cas13a guide RNAs against future viruses based on existing viral sequences, and (2) designing siRNAs/Cas13a guide RNAs against a single virus based on sequences of multiple strains of this virus.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "siRNA binding specificity prediction",
                    "uri": "http://edamontology.org/operation_0465"
                },
                {
                    "term": "siRNA duplex prediction",
                    "uri": "http://edamontology.org/operation_2008"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dingyaozhang/Evitar",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2022-06-25T13:52:45.922172Z",
    "name": "Evitar",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC144",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: The coronavirus disease 2019 (COVID-19) pandemic has highlighted the threat of emerging respiratory viruses and has exposed the lack of availability of off-the-shelf therapeutics against new RNA viruses. Previous research has established the potential that siRNAs and RNA-targeting CRISPR have in combating known RNA viruses. However, the feasibility and tools for designing anti-viral RNA therapeutics against future RNA viruses have not yet been established. Results: We develop the Emerging-Virus-Targeting RNA (Evitar) pipeline for designing anti-viral siRNAs and CRISPR Cas13a guide RNA (gRNA) sequences. Within Evitar, we develop Greedy Algorithm with Redundancy and Similarity-weighted Greedy Algorithm with Redundancy to enhance the performance. Time simulations using known coronavirus genomes deposited as early as 10 years prior to the COVID-19 outbreak show that at least three SARS-CoV-2-targeting siRNAs are among the top 30 pre-designed siRNAs. In addition, among the top 19 pre-designed gRNAs, there are three SARS-CoV-2-targeting Cas13a gRNAs that could be predicted using information from 2011. Before-the-outbreak design is also possible against the MERS-CoV virus and the 2009-H1N1 swine flu virus. Designed siRNAs are further shown to suppress SARS-CoV-2 viral sequences using in vitro reporter assays. Our results support the utility of Evitar to pre-design anti-viral siRNAs/gRNAs against future viruses. Therefore, we propose the development of a collection consisting of roughly 30 pre-designed, safety-tested and off-the-shelf siRNA/CRISPR therapeutics that could accelerate responses to future RNA virus outbreaks.",
                "authors": [
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "Tian J."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang D."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Evitar: Designing anti-viral RNA therapies against future RNA viruses"
            },
            "pmcid": "PMC9048652",
            "pmid": "35294970"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
