{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bioinformatics.leeds.ac.uk/"}],"documentation":[{"type":"TRAINING_MATERIAL","url":"http://www.bioinformatics.leeds.ac.uk/BRS-nonint/example_brs.html"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Protein-protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Interactions","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/brs-nonint-balanced-random-sampling-non-interactions-proteins.html"}],"publication":[{"abstract":"Motivation: A number of methods have been reported that predict protein-protein interactions (PPIs) with high accuracy using only simple sequence-based features such as amino acid 3mer content. This is surprising, given that many protein interactions have high specificity that depends on detailed atomic recognition between physiochemically complementary surfaces. Are the reported high accuracies realistic? Results: We find that the reported accuracies of the predictions are significantly over-estimated, and strongly dependent on the structure of the training and testing datasets used. The choice of which protein pairs are deemed as non-interactions in the training data has a variable impact on the accuracy estimates, and the accuracies can be artificially inflated by a bias towards dominant samples in the positive data which result from the presence of hub proteins in the protein interaction network. To address this bias, we propose a positive set-specific method to create a 'balanced' negative set maintaining the degree distribution for each protein, leading to the conclusion that simple sequence-based features contain insufficient information to be useful for predicting PPIs, but that protein domain-based features have some predictive value. © The Author 2010. Published by Oxford University Press. All rights reserved.","authors":["Yu J.","Guo M.","Needham C.J.","Huang Y.","Cai L.","Westhead D.R."],"cit_count":60,"doi":"10.1093/bioinformatics/btq483","journal":"Bioinformatics","title":"Simple sequence-based kernels do not predict protein-protein interactions","type":"Primary","year":"2010-08-27"}],"summary":{"biotoolsCURIE":"biotools:brs-nonint","biotoolsID":"brs-nonint","description":"BRS-nonint (Balanced Random Sampling of Non-interactions) is a method of sampling non-interactions randomly from the complement graph of protein-protein interactions, while the degree of each protein in the ‘positive’ dataset (interactions) equals to that in the ‘negative’ dataset (non-interactions).","homepage":"http://www.bioinformatics.leeds.ac.uk/BRS-nonint/","name":"BRS-nonint"}}