{
    "accessibility": "Open access",
    "additionDate": "2022-05-12T19:28:40.569042Z",
    "biotoolsCURIE": "biotools:drugex",
    "biotoolsID": "drugex",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gerard@lacdr.leidenuniv.nl",
            "name": "Gerard J. P. van Westen",
            "orcidid": "https://orcid.org/0000-0003-0717-1817",
            "typeEntity": "Person"
        },
        {
            "name": "Adriaan P. IJzerman",
            "orcidid": "https://orcid.org/0000-0002-1182-2259"
        },
        {
            "name": "Herman W. T. van Vlijmen",
            "orcidid": "https://orcid.org/0000-0002-1915-3141"
        },
        {
            "name": "Michael T. M. Emmerich",
            "orcidid": "https://orcid.org/0000-0002-7342-2090"
        }
    ],
    "description": "Deep learning toolkit for Drug Design with Pareto-based Multi-Objective optimization in Polypharmacology",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://github.com/XuhanLiu/DrugEx",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-12T19:28:52.191583Z",
    "license": "MIT",
    "name": "DrugEx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13321-021-00561-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).In polypharmacology drugs are required to bind to multiple specific targets, for example to enhance efficacy or to reduce resistance formation. Although deep learning has achieved a breakthrough in de novo design in drug discovery, most of its applications only focus on a single drug target to generate drug-like active molecules. However, in reality drug molecules often interact with more than one target which can have desired (polypharmacology) or undesired (toxicity) effects. In a previous study we proposed a new method named DrugEx that integrates an exploration strategy into RNN-based reinforcement learning to improve the diversity of the generated molecules. Here, we extended our DrugEx algorithm with multi-objective optimization to generate drug-like molecules towards multiple targets or one specific target while avoiding off-targets (the two adenosine receptors, A1AR and A2AAR, and the potassium ion channel hERG in this study). In our model, we applied an RNN as the agent and machine learning predictors as the environment. Both the agent and the environment were pre-trained in advance and then interplayed under a reinforcement learning framework. The concept of evolutionary algorithms was merged into our method such that crossover and mutation operations were implemented by the same deep learning model as the agent. During the training loop, the agent generates a batch of SMILES-based molecules. Subsequently scores for all objectives provided by the environment are used to construct Pareto ranks of the generated molecules. For this ranking a non-dominated sorting algorithm and a Tanimoto-based crowding distance algorithm using chemical fingerprints are applied. Here, we adopted GPU acceleration to speed up the process of Pareto optimization. The final reward of each molecule is calculated based on the Pareto ranking with the ranking selection algorithm. The agent is trained under the guidance of the reward to make sure it can generate desired molecules after convergence of the training process. All in all we demonstrate generation of compounds with a diverse predicted selectivity profile towards multiple targets, offering the potential of high efficacy and low toxicity.",
                "authors": [
                    {
                        "name": "Emmerich M.T.M."
                    },
                    {
                        "name": "IJzerman A.P."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Ye K."
                    },
                    {
                        "name": "van Vlijmen H.W.T."
                    },
                    {
                        "name": "van Westen G.J.P."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "DrugEx v2: de novo design of drug molecules by Pareto-based multi-objective reinforcement learning in polypharmacology"
            },
            "pmcid": "PMC8588612",
            "pmid": "34772471"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
