{"credit":[{"name":"The Wall Lab at Stanford School of Medicine","typeEntity":"Institute","typeRoles":[],"url":"http://wall-lab.stanford.edu"},{"email":"dpwall@stanford.edu","name":"Dennis Wall","typeEntity":"Person","typeRoles":["Primary contact"]}],"download":[{"note":"Github repository","type":"Source code","url":"https://github.com/todddeluca/reciprocal_smallest_distance"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["Python"],"license":"MIT","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Evolutionary biology","uri":"http://edamontology.org/topic_3299"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Function analysis","uri":"http://edamontology.org/topic_1775"},{"term":"Comparative genomics","uri":"http://edamontology.org/topic_0797"}]},"publication":[{"abstract":"Summary: We developed an algorithm that improves upon the common procedure of taking reciprocal best blast hits (rbh) in the identification of orthologs. The method-reciprocal smallest distance algorithm (rsd)-relies on global sequence alignment and maximum likelihood estimation of evolutionary distances to detect orthologs between two genomes. rsd finds many putative orthologs missed by rbh because it is less likely than rbh to be misled by the presence of a close paralog.","authors":["Wall D.P.","Fraser H.B.","Hirsh A.E."],"cit_count":170,"doi":"10.1093/bioinformatics/btg213","journal":"Bioinformatics","pmid":"15593400","title":"Detecting putative orthologs","year":"2003-09-01"},{"abstract":"All protein coding genes have a phylogenetic history that when understood can lead to deep insights into the diversification or conservation of function, the evolution of developmental complexity, and the molecular basis of disease. One important part to reconstructing the relationships among genes in different organisms is an accurate method to find orthologs as well as an accurate measure of evolutionary diversification. The present chapter details such a method, called the reciprocal smallest distance algorithm (RSD). This approach improves upon the common procedure of taking reciprocal best Basic Local Alignment Search Tool hits (RBH) in the identification of orthologs by using global sequence alignment and maximum likelihood estimation of evolutionary distances to detect orthologs between two genomes. RSD finds many putative orthologs missed by RBH because it is less likely to be misled by the presence of close paralogs in genomes. The package offers a tremendous amount of flexibility in investigating parameter settings allowing the user to search for increasingly distant orthologs between highly divergent species, among other advantages. The flexibility of this tool makes it a unique and powerful addition to other available approaches for ortholog detection. © Humana Press Inc.","authors":["Wall D.P.","DeLuca T."],"cit_count":28,"doi":"10.1007/978-1-59745-515-2_7","journal":"Methods in Molecular Biology","pmid":"18025688","title":"Ortholog detection using the reciprocal smallest distance algorithm","year":"2007-11-01"}],"summary":{"biotoolsCURIE":"biotools:rsd","biotoolsID":"rsd","description":"The reciprocal smallest distance (RSD) algorithm (Wall, et al., 2003.) accurately infers orthologs between pairs of genomes by considering global sequence alignment and maximum likelihood evolutionary distance between sequences.","homepage":"https://github.com/todddeluca/reciprocal_smallest_distance","name":"Reciprocal Smallest Distance (RSD)","version":["v1.1.7"]}}