{"credit":[{"email":"disulfind@ai.dinfo.unifi.it","name":"DISULFIND Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://disulfind.dsi.unifi.it/help.php"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"},{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"},{"term":"Protein cysteine and disulfide bond assignment","uri":"http://edamontology.org/operation_1850"},{"term":"Protein feature detection","uri":"http://edamontology.org/operation_3092"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"},{"term":"Sequence composition, complexity and repeats","uri":"http://edamontology.org/topic_0157"},{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"publication":[{"abstract":"DISULFIND is a server for predicting the disulfide bonding state of cysteines and their disulfide connectivity starting from sequence alone. Optionally, disulfide connectivity can be predicted from sequence and a bonding state assignment given as input. The output is a simple visualization of the assigned bonding state (with confidence degrees) and the most likely connectivity patterns. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Ceroni A.","Passerini A.","Vullo A.","Frasconi P."],"cit_count":189,"journal":"Nucleic Acids Research","pmid":"16844986","title":"Disulfind: A disulfide bonding state and cysteine connectivity prediction server","year":"2006-07-01"},{"abstract":"Motivation: We focus on the prediction of disulfide bridges in proteins starting from their amino acid sequence and from the knowledge of the disulfide bonding state of each cysteine. The location of disulfide bridges is a structural feature that conveys important information about the protein main chain conformation and can therefore help towards the solution of the folding problem. Existing approaches based on weighted graph matching algorithms do not take advantage of evolutionary information. Recursive neural networks (RNN), on the other hand, can handle in a natural way complex data structures such as graphs whose vertices are labeled by real vectors, allowing us to incorporate multiple alignment profiles in the graphical representation of disulfide connectivity patterns. Results: The core of the method is the use of machine learning tools to rank alternative disulfide connectivity patterns. We develop an ad-hoc RNN architecture for scoring labeled undirected graphs that represent connectivity patterns. In order to compare our algorithm with previous methods, we report experimental results on the SWISS-PROT 39 dataset. We find that using multiple alignment profiles allows us to obtain significant prediction accuracy improvements, clearly demonstrating the important role played by evolutionary information. © Oxford University Press 2004; all rights reserved.","authors":["Vullo A.","Frasconi P."],"cit_count":118,"journal":"Bioinformatics","pmid":"15033872","title":"Disulfide connectivity prediction using recursive neural networks and evolutionary information","year":"2004-03-22"},{"abstract":"MetalDetector identifies CYS and HIS involved in transition metal protein binding sites, starting from sequence alone. A major new feature of release 2.0 is the ability to predict which residues are jointly involved in the coordination of the same metal ion. The server is available at http://metaldetector.dsi.unifi.it/v2.0/. © 2011 The Author(s).","authors":["Passerini A.","Lippi M.","Frasconi P."],"cit_count":27,"journal":"Nucleic Acids Research","pmid":"21576237","title":"MetalDetector v2.0: Predicting the geometry of metal binding sites from protein sequence","year":"2011-07-01"},{"abstract":"The web server MetalDetector classifies histidine residues in proteins into one of two states (free or metal bound) and cysteines into one of three states (free, metal bound or disulfide bridged). A decision tree integrates predictions from two previously developed methods (DISULFIND and Metal Ligand Predictor). Cross-validated performance assessment indicates that our server predicts disulfide bonding state at 88.6% precision and 85.1% recall, while it identifies cysteines and histidines in transition metal-binding sites at 79.9% precision and 76.8% recall, and at 60.8% precision and 40.7% recall, respectively. © The Author 2008. Published by Oxford University Press. All rights reserved.","authors":["Lippi M.","Passerini A.","Punta M.","Rost B.","Frasconi P."],"cit_count":42,"journal":"Bioinformatics","pmid":"18635571","title":"MetalDetector: A web server for predicting metal-binding sites and disulfide bridges in proteins from sequence","year":"2008-09-01"}],"summary":{"biotoolsCURIE":"biotools:disulfind","biotoolsID":"disulfind","description":"DISULFIND is a server for predicting the disulfide bonding state of cysteines and their disulfide connectivity given a protein sequence.","homepage":"http://disulfind.dsi.unifi.it/","name":"DISULFIND"}}