{
    "additionDate": "2019-11-14T20:05:16Z",
    "biotoolsCURIE": "biotools:contaminationX",
    "biotoolsID": "contaminationX",
    "confidence_flag": "tool",
    "description": "A likelihood method for estimating present-day human contamination in ancient male samples using low-depth X-chromosome data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "http://github.com/sapfo/contaminationX",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:54:44.609665Z",
    "name": "contaminationX",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz660",
            "metadata": {
                "abstract": "Motivation: The presence of present-day human contaminating DNA fragments is one of the challenges defining ancient DNA (aDNA) research. This is especially relevant to the ancient human DNA field where it is difficult to distinguish endogenous molecules from human contaminants due to their genetic similarity. Recently, with the advent of high-throughput sequencing and new aDNA protocols, hundreds of ancient human genomes have become available. Contamination in those genomes has been measured with computational methods often developed specifically for these empirical studies. Consequently, some of these methods have not been implemented and tested for general use while few are aimed at low-depth nuclear data, a common feature in aDNA datasets. Results: We develop a new X-chromosome-based maximum likelihood method for estimating present-day human contamination in low-depth sequencing data from male individuals. We implement our method for general use, assess its performance under conditions typical of ancient human DNA research, and compare it to previous nuclear data-based methods through extensive simulations. For low-depth data, we show that existing methods can produce unusable estimates or substantially underestimate contamination. In contrast, our method provides accurate estimates for a depth of coverage as low as 0.5× on the X-chromosome when contamination is below 25%. Moreover, our method still yields meaningful estimates in very challenging situations, i.e. when the contaminant and the target come from closely related populations or with increased error rates. With a running time below 5 min, our method is applicable to large scale aDNA genomic studies.",
                "authors": [
                    {
                        "name": "Albrechtsen A."
                    },
                    {
                        "name": "Dalal J."
                    },
                    {
                        "name": "Korneliussen T.S."
                    },
                    {
                        "name": "Malaspinas A.-S."
                    },
                    {
                        "name": "Moreno-Mayar J.V."
                    },
                    {
                        "name": "Nielsen R."
                    },
                    {
                        "name": "Renaud G."
                    }
                ],
                "citationCount": 11,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A likelihood method for estimating present-day human contamination in ancient male samples using low-depth X-chromosome data"
            },
            "pmcid": "PMC8215924",
            "pmid": "31504166"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}
