{
    "additionDate": "2018-09-04T10:15:41Z",
    "biotoolsCURIE": "biotools:dataup",
    "biotoolsID": "dataup",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://bitbucket.org/dataup/main/pull-requests/"
        },
        {
            "email": "carlystrasser@gmail.com",
            "name": "Carly Strasser",
            "orcidid": "http://orcid.org/0000-0001-9592-2339",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Describe and share tabular data. It includes three components: (1) the Excel add-in; (2) the public web client; and (3) the private web service that mediates between the add-in and client and the ONEShare repository",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/dataup/main/downloads/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://zenodo.org/record/7639#.W45ZrC0rzfZ",
    "language": [
        "C#"
    ],
    "lastUpdate": "2019-01-11T00:15:51Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/dataup/main/wiki/Home"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CDLUC3/dataup2"
        }
    ],
    "name": "DataUp",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.3-6.V2",
            "metadata": {
                "abstract": "© 2014 Strasser C et al.Scientific datasets have immeasurable value, but they lose their value over time without proper documentation, long-term storage, and easy discovery and access. Across disciplines as diverse as astronomy, demography, archeology, and ecology, large numbers of small heterogeneous datasets (i.e., the long tail of data) are especially at risk unless they are properly documented, saved, and shared. One unifying factor for many of these at-risk datasets is that they reside in spreadsheets. In response to this need, the California Digital Library (CDL) partnered with Microsoft Research Connections and the Gordon and Betty Moore Foundation to create the DataUp data management tool for Microsoft Excel. Many researchers creating these small, heterogeneous datasets use Excel at some point in their data collection and analysis workflow, so we were interested in developing a data management tool that fits easily into those work flows and minimizes the learning curve for researchers. The DataUp project began in August 2011. We first formally assessed the needs of researchers by conducting surveys and interviews of our target research groups: earth, environmental, and ecological scientists. We found that, on average, researchers had very poor data management practices, were not aware of data centers or metadata standards, and did not understand the benefits of data management or sharing. Based on our survey results, we composed a list of desirable components and requirements and solicited feedback from the community to prioritize potential features of the DataUp tool. These requirements were then relayed to the software developers, and DataUp was successfully launched in October 2012.",
                "authors": [
                    {
                        "name": "Strasser C."
                    },
                    {
                        "name": "Kunze J."
                    },
                    {
                        "name": "Abrams S."
                    },
                    {
                        "name": "Cruse P."
                    }
                ],
                "citationCount": 3,
                "date": "2014-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "DataUp: A tool to help researchers describe and share tabular data"
            },
            "pmcid": "PMC4304223",
            "pmid": "25653834",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1
}