{
    "additionDate": "2021-01-18T10:52:15Z",
    "biotoolsCURIE": "biotools:lime",
    "biotoolsID": "lime",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "giovanna.rosone@unipi.it",
            "name": "Giovanna Rosone",
            "orcidid": "https://orcid.org/0000-0001-5075-1214",
            "typeEntity": "Person"
        }
    ],
    "description": "Metagenomic analysis through the extended Burrows-Wheeler transform.\n\nLiME is a novel lightweight alignment-free and assembly-free framework for metagenomic classification that is combinatorial by nature and allows us to use little internal memory. In [1], a preliminary version of LiME has been introduced together with a new sequence similarity measure based on the properties of the extended Burrows–Wheeler transform. In [2], we now implement two variants of the above similarity measure and improve the overall classification. In addition, the new version of our tool allows to use multiple processors/cores.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/veronicaguerrini/LiME",
    "language": [
        "C++",
        "Shell"
    ],
    "lastUpdate": "2021-02-16T08:46:28Z",
    "name": "LiME",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03628-W",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The development of Next Generation Sequencing (NGS) has had a major impact on the study of genetic sequences. Among problems that researchers in the field have to face, one of the most challenging is the taxonomic classification of metagenomic reads, i.e., identifying the microorganisms that are present in a sample collected directly from the environment. The analysis of environmental samples (metagenomes) are particularly important to figure out the microbial composition of different ecosystems and it is used in a wide variety of fields: for instance, metagenomic studies in agriculture can help understanding the interactions between plants and microbes, or in ecology, they can provide valuable insights into the functions of environmental communities. Results: In this paper, we describe a new lightweight alignment-free and assembly-free framework for metagenomic classification that compares each unknown sequence in the sample to a collection of known genomes. We take advantage of the combinatorial properties of an extension of the Burrows-Wheeler transform, and we sequentially scan the required data structures, so that we can analyze unknown sequences of large collections using little internal memory. The tool LiME (Lightweight Metagenomics via eBWT) is available at https://github.com/veronicaguerrini/LiME. Conclusions: In order to assess the reliability of our approach, we run several experiments on NGS data from two simulated metagenomes among those provided in benchmarking analysis and on a real metagenome from the Human Microbiome Project. The experiment results on the simulated data show that LiME is competitive with the widely used taxonomic classifiers. It achieves high levels of precision and specificity - e.g. 99.9% of the positive control reads are correctly assigned and the percentage of classified reads of the negative control is less than 0.01% - while keeping a high sensitivity. On the real metagenome, we show that LiME is able to deliver classification results comparable to that of MagicBlast. Overall, the experiments confirm the effectiveness of our method and its high accuracy even in negative control samples.",
                "authors": [
                    {
                        "name": "Guerrini V."
                    },
                    {
                        "name": "Louza F.A."
                    },
                    {
                        "name": "Rosone G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Metagenomic analysis through the extended Burrows-Wheeler transform"
            },
            "pmcid": "PMC7493373",
            "pmid": "32938362"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}