{
    "accessibility": [],
    "additionDate": "2017-12-18T00:04:10Z",
    "biotoolsCURIE": "biotools:bayesmotif",
    "biotoolsID": "bayesmotif",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mleg.cse.sc.edu/index.html"
        }
    ],
    "description": "BayesMotif is a de novo identification algorithm for finding a common type of protein sorting motifs in which a highly conserved anchor is present along with a less conserved motif regions.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://mleg.cse.sc.edu/BayesMotif/manual.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [
            "samaneh"
        ],
        "type": "group"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://mleg.cse.sc.edu/BayesMotif/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/bayesmotif-1-0-sorting-motif-discovery-using-bayes-classifiers.html"
        }
    ],
    "maturity": null,
    "name": "BayesMotif",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "samaneh",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-S1-S66",
            "metadata": {
                "abstract": "Background: Protein sorting is the process that newly synthesized proteins are transported to their target locations within or outside of the cell. This process is precisely regulated by protein sorting signals in different forms. A major category of sorting signals are amino acid sub-sequences usually located at the N-terminals or C-terminals of protein sequences. Genome-wide experimental identification of protein sorting signals is extremely time-consuming and costly. Effective computational algorithms for de novo discovery of protein sorting signals is needed to improve the understanding of protein sorting mechanisms.Methods: We formulated the protein sorting motif discovery problem as a classification problem and proposed a Bayesian classifier based algorithm (BayesMotif) for de novo identification of a common type of protein sorting motifs in which a highly conserved anchor is present along with a less conserved motif regions. A false positive removal procedure is developed to iteratively remove sequences that are unlikely to contain true motifs so that the algorithm can identify motifs from impure input sequences.Results: Experiments on both implanted motif datasets and real-world datasets showed that the enhanced BayesMotif algorithm can identify anchored sorting motifs from pure or impure protein sequence dataset. It also shows that the false positive removal procedure can help to identify true motifs even when there is only 20% of the input sequences containing true motif instances.Conclusion: We proposed BayesMotif, a novel Bayesian classification based algorithm for de novo discovery of a special category of anchored protein sorting motifs from impure datasets. Compared to conventional motif discovery algorithms such as MEME, our algorithm can find less-conserved motifs with short highly conserved anchors. Our algorithm also has the advantage of easy incorporation of additional meta-sequence features such as hydrophobicity or charge of the motifs which may help to overcome the limitations of PWM (position weight matrix) motif model. © 2010 Hu and Zhang; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Zhang F."
                    }
                ],
                "citationCount": 2,
                "date": "2010-01-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BayesMotif: De novo protein sorting motif discovery from impure datasets"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein sorting",
            "uri": "http://edamontology.org/topic_0140"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}