{
    "additionDate": "2018-07-15T09:40:19Z",
    "biotoolsCURIE": "biotools:metalims",
    "biotoolsID": "metalims",
    "credit": [
        {
            "email": "cheinle@ntu.edu.sg",
            "name": "Cassie Heinle",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Simple Open-Source Laboratory Information Management System for Small Metagenomic Labs.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/cheinle/MetaLIMS"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Loading",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cheinle/MetaLIMS",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "MetaLIMS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gigascience/gix025",
            "metadata": {
                "abstract": "© The Author 2017.As the cost of sequencing continues to fall, smaller groups increasingly initiate and manage larger sequencing projects and take on the complexity of data storage for high volumes of samples. This has created a need for low-cost laboratory information management systems (LIMS) that contain flexible fields to accommodate the unique nature of individual labs. Many labs do not have a dedicated information technology position, so LIMS must also be easy to setup and maintain with minimal technical proficiency. Findings: MetaLIMS is a free and open-source web-based application available via GitHub. The focus of MetaLIMS is to store sample metadata prior to sequencing and analysis pipelines. Initially designed for environmental metagenomics labs, in addition to storing generic sample collection information and DNA/RNA processing information, the user can also add fields specific to the user's lab. MetaLIMS can also produce a basic sequencing submission form compatible with the proprietary Clarity LIMS system used by some sequencing facilities. To help ease the technical burden associated with web deployment, MetaLIMS options the use of commercial web hosting combined with MetaLIMS bash scripts for ease of setup. Conclusions: MetaLIMS overcomes key challenges common in LIMS by giving labs access to a low-cost and open-source tool that also has the flexibility to meet individual lab needs and an option for easy deployment. By making the web application open source and hosting it on GitHub, we hope to encourage the community to build upon MetaLIMS, making it more robust and tailored to the needs of more researchers.",
                "authors": [
                    {
                        "name": "Heinle C.E."
                    },
                    {
                        "name": "Gaultier N.P.E."
                    },
                    {
                        "name": "Miller D."
                    },
                    {
                        "name": "Purbojati R.W."
                    },
                    {
                        "name": "Lauro F.M."
                    }
                ],
                "citationCount": 1,
                "date": "2017-06-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "MetaLIMS, a simple open-source laboratory information management system for small metagenomic labs"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Laboratory information management",
            "uri": "http://edamontology.org/topic_0607"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}