{
    "additionDate": "2020-01-14T09:33:28Z",
    "biotoolsCURIE": "biotools:pipeline-MoNaS",
    "biotoolsID": "pipeline-MoNaS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kasacin@nih.go.jp",
            "name": "Shinji Kasai",
            "orcidid": "https://orcid.org/0000-0002-3837-6551",
            "typeEntity": "Person"
        }
    ],
    "description": "High-throughput genotyping of a full voltage-gated sodium channel gene via genomic DNA using target capture sequencing and analytical pipeline MoNaS to discover novel insecticide resistance mutations.\n\nA pipeline to genotype mosquito's voltage-gated sodium channel genes using NGS data.\n\n(Mosquito Na+ channel mutation Search).\n\nA pipeline to genotype mosquito's voltage-gated sodium channel genes using NGS data See detailed description in the GitHub repository.(https://github.com/ItokawaK/MoNaS/blob/master/README.md).\n\nAn automated pipeline to genotype mosquito's voltage-gated sodium channel genes using NGS data.\n\nMoNaS (Mosquito Na+ channel mutation Search) is an automated pipeline conducting genotyping of voltage-gated sodium channel (VGSC) in mosquitos from NGS reads.\n\n!!Upon starting your analysis, we will consider you have allowed the following condition!!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MoNaS', 'VGSC', 'insecticide resistance VGSC', 'VGSC CDSs'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ItokawaK/MoNaS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-05T11:00:18.830513Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ItokawaK/MoNaS"
        }
    ],
    "name": "pipeline-MoNaS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PNTD.0007818",
            "metadata": {
                "abstract": "© 2019 Itokawa et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In insects, the voltage-gated sodium channel (VGSC) is the primary target site of pyrethroid insecticides. Various amino acid substitutions in the VGSC protein, which are selected under insecticide pressure, are known to confer insecticide resistance. In the genome, the VGSC gene consists of more than 30 exons sparsely distributed across a large genomic region, which often exceeds 100 kbp. Due to this complex genomic structure, it is often challenging to genotype full coding nucleotide sequences (CDSs) of VGSC from individual genomic DNA (gDNA). In this study, we designed biotinylated oligonucleotide probes from CDSs of VGSC of Asian tiger mosquito, Aedes albopictus. The probe set effectively concentrated (>80,000-fold) all targeted regions of gene VGSC from pooled barcoded Illumina libraries each constructed from individual A. albopictus gDNAs. The probe set also captured all orthologous VGSC CDSs, except some tiny exons, from the gDNA of other Culicinae mosquitos, A. aegypti and Culex pipiens complex, with comparable efficiency as a result of the high nucleotide-level conservation of VGSC. To improve efficiency of the downstream bioinformatic process, we developed an automated pipeline-MoNaS (Mosquito Na+ channel mutation Search)-which calls amino acid substitutions in the VGSC from NGS reads and compares those to known resistance mutations. The proposed method and our bioinformatic tool should facilitate the discovery of novel amino acid variants conferring insecticide resistance on VGSC and population genetic studies on resistance alleles (with respect to the origin, selection, and migration etc.) in both clinically and agriculturally important insect pests.",
                "authors": [
                    {
                        "name": "Itokawa K."
                    },
                    {
                        "name": "Sekizuka T."
                    },
                    {
                        "name": "Maekawa Y."
                    },
                    {
                        "name": "Yatsu K."
                    },
                    {
                        "name": "Komagata O."
                    },
                    {
                        "name": "Sugiura M."
                    },
                    {
                        "name": "Sasaki T."
                    },
                    {
                        "name": "Tomita T."
                    },
                    {
                        "name": "Kuroda M."
                    },
                    {
                        "name": "Sawabe K."
                    },
                    {
                        "name": "Kasai S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Neglected Tropical Diseases",
                "title": "High-throughput genotyping of a full voltagegated sodium channel gene via genomic DNA using target capture sequencing and analytical pipeline MoNaS to discover novel insecticide resistance mutations"
            },
            "pmcid": "PMC6886866",
            "pmid": "31738756"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}