{
    "name": "PPfold", 
    "description": "Predicts the consensus secondary structure of RNA alignments.", 
    "homepage": "http://www.daimi.au.dk/~compbio/pfold/downloads.html#release", 
    "biotoolsID": "ppfold", 
    "biotoolsCURIE": "biotools:ppfold", 
    "version": [
        "3.1.1"
    ], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0278", 
                    "term": "RNA secondary structure prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.daimi.au.dk/~compbio/pfold/downloads.html#release", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-103", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Multithreaded comparative RNA secondary structure prediction using stochastic context-free grammars", 
                "abstract": "Background: The prediction of the structure of large RNAs remains a particular challenge in bioinformatics, due to the computational complexity and low levels of accuracy of state-of-the-art algorithms. The pfold model couples a stochastic context-free grammar to phylogenetic analysis for a high accuracy in predictions, but the time complexity of the algorithm and underflow errors have prevented its use for long alignments. Here we present PPfold, a multithreaded version of pfold, which is capable of predicting the structure of large RNA alignments accurately on practical timescales.Results: We have distributed both the phylogenetic calculations and the inside-outside algorithm in PPfold, resulting in a significant reduction of runtime on multicore machines. We have addressed the floating-point underflow problems of pfold by implementing an extended-exponent datatype, enabling PPfold to be used for large-scale RNA structure predictions. We have also improved the user interface and portability: alongside standalone executable and Java source code of the program, PPfold is also available as a free plugin to the CLC Workbenches. We have evaluated the accuracy of PPfold using BRaliBase I tests, and demonstrated its practical use by predicting the secondary structure of an alignment of 24 complete HIV-1 genomes in 65 minutes on an 8-core machine and identifying several known structural elements in the prediction.Conclusions: PPfold is the first parallelized comparative RNA structure prediction algorithm to date. Based on the pfold model, PPfold is capable of fast, high-quality predictions of large RNA secondary structures, such as the genomes of RNA viruses or long genomic transcripts. The techniques used in the parallelization of this algorithm may be of general applicability to other bioinformatics algorithms. © 2011 Sükösd et al; licensee BioMed Central Ltd.", 
                "date": "2011-04-18T00:00:00Z", 
                "citationCount": 18, 
                "authors": [
                    {
                        "name": "Sukosd Z."
                    }, 
                    {
                        "name": "Knudsen B."
                    }, 
                    {
                        "name": "Vaerum M."
                    }, 
                    {
                        "name": "Kjems J."
                    }, 
                    {
                        "name": "Andersen E.S."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }, 
        {
            "doi": "10.1093/bioinformatics/bts488", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "PPfold 3.0: Fast RNA secondary structure prediction using phylogeny and auxiliary data", 
                "abstract": "PPfold is a multi-threaded implementation of the Pfold algorithm for RNA secondary structure prediction. Here we present a new version of PPfold, which extends the evolutionary analysis with a flexible probabilistic model for incorporating auxiliary data, such as data from structure probing experiments. Our tests show that the accuracy of single-sequence secondary structure prediction using experimental data in PPfold 3.0 is comparable to RNAstructure. Furthermore, alignment structure prediction quality is improved even further by the addition of experimental data. PPfold 3.0 therefore has the potential of producing more accurate predictions than it was previously possible. © The Author 2012. Published by Oxford University Press. All rights reserved.", 
                "date": "2012-10-01T00:00:00Z", 
                "citationCount": 24, 
                "authors": [
                    {
                        "name": "Sukosd Z."
                    }, 
                    {
                        "name": "Knudsen B."
                    }, 
                    {
                        "name": "Kjems J."
                    }, 
                    {
                        "name": "Pedersen C.N.S."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "birc.au.dk", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Zsuzsanna Sukosd", 
            "email": "zs@mb.au.dk", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "runef@birc.au.dk", 
    "additionDate": "2015-03-06T15:44:50Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0
}