{
    "additionDate": "2019-11-14T18:26:20Z",
    "biotoolsCURIE": "biotools:ANMF",
    "biotoolsID": "ANMF",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jieyuehe@seu.edu.cn",
            "name": "Jieyue He",
            "orcidid": "https://orcid.org/0000-0002-3265-3351",
            "typeEntity": "Person"
        }
    ],
    "description": "Additional Neural Matrix Factorization model for computational drug repositioning | This is our implementation for the paper“Additional Neural Matrix Factorization model for Computational drug repositioning. BMC Bioinformatics ” | This is our implementation for the paper“Additional Neural Matrix Factorization model for Computational drug repositioning. BMC Bioinformatics ” #Author Xin-Xing Yang Southeast University Email:220174323@seu.edu.cn | Open the \"ANMF.py\" file and run it directly. In the Data folder is the test example we provide | We use Keras with Theano as the backend",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MortySn/ANMF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-03T11:26:14Z",
    "name": "ANMF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2983-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Computational drug repositioning, which aims to find new applications for existing drugs, is gaining more attention from the pharmaceutical companies due to its low attrition rate, reduced cost, and shorter timelines for novel drug discovery. Nowadays, a growing number of researchers are utilizing the concept of recommendation systems to answer the question of drug repositioning. Nevertheless, there still lie some challenges to be addressed: 1) Learning ability deficiencies; the adopted model cannot learn a higher level of drug-disease associations from the data. 2) Data sparseness limits the generalization ability of the model. 3)Model is easy to overfit if the effect of negative samples is not taken into consideration. Results: In this study, we propose a novel method for computational drug repositioning, Additional Neural Matrix Factorization (ANMF). The ANMF model makes use of drug-drug similarities and disease-disease similarities to enhance the representation information of drugs and diseases in order to overcome the matter of data sparsity. By means of a variant version of the autoencoder, we were able to uncover the hidden features of both drugs and diseases. The extracted hidden features will then participate in a collaborative filtering process by incorporating the Generalized Matrix Factorization (GMF) method, which will ultimately give birth to a model with a stronger learning ability. Finally, negative sampling techniques are employed to strengthen the training set in order to minimize the likelihood of model overfitting. The experimental results on the Gottlieb and Cdataset datasets show that the performance of the ANMF model outperforms state-of-the-art methods. Conclusions: Through performance on two real-world datasets, we believe that the proposed model will certainly play a role in answering to the major challenge in drug repositioning, which lies in predicting and choosing new therapeutic indications to prospectively test for a drug of interest.",
                "authors": [
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zamit L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Additional Neural Matrix Factorization model for computational drug repositioning"
            },
            "pmcid": "PMC6694624",
            "pmid": "31412762"
        }
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
