
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://crdd.osdd.net/raghava//phdcleav/contact.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://crdd.osdd.net/raghava//phdcleav/algorithm.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/phdcleav-prediction-of-human-dicer-cleavage.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Dicer, an RNase III enzyme, plays a vital role in the processing of pre-miRNAs for generating the miRNAs. The structural and sequence features on pre-miRNA which can facilitate position and efficiency of cleavage are not well known. A precise cleavage by Dicer is crucial because an inaccurate processing can produce miRNA with different seed regions which can alter the repertoire of target genes.Results: In this study, a novel method has been developed to predict Dicer cleavage sites on pre-miRNAs using Support Vector Machine. We used the dataset of experimentally validated human miRNA hairpins from miRBase, and extracted fourteen nucleotides around Dicer cleavage sites. We developed number of models using various types of features and achieved maximum accuracy of 66% using binary profile of nucleotide sequence taken from 5p arm of hairpin. The prediction performance of Dicer cleavage site improved significantly from 66% to 86% when we integrated secondary structure information. This indicates that secondary structure plays an important role in the selection of cleavage site. All models were trained and tested on 555 experimentally validated cleavage sites and evaluated using 5-fold cross validation technique. In addition, the performance was also evaluated on an independent testing dataset that achieved an accuracy of ~82%.Conclusion: Based on this study, we developed a webserver PHDcleav (http://www.imtech.res.in/raghava/phdcleav/) to predict Dicer cleavage sites in pre-miRNA. This tool can be used to investigate functional consequences of genetic variations/SNPs in miRNA on Dicer cleavage site, and gene silencing. Moreover, it would also be useful in the discovery of miRNAs in human genome and design of Dicer specific pre-miRNAs for potent gene silencing. © 2013 Ahmed et al; licensee BioMed Central Ltd.",
            "authors": [
                "Ahmed F.",
                "Kaundal R.",
                "Raghava G.P.S."
            ],
            "cit_count": 17,
            "journal": "BMC Bioinformatics",
            "pmid": "24267009",
            "title": "PHDcleav: A SVM based method for predicting human Dicer cleavage sites using sequence and secondary structure of miRNA precursors",
            "year": "2013-10-09"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phdcleav",
        "biotoolsID": "phdcleav",
        "description": "Webserver to predict Dicer cleavage sites in pre-miRNA. Dicer, an RNase III enzyme, plays vital role in RNA interference pathway, processes both pre-miRNAs (precursor microRNAs) and double-stranded (ds) RNAs to generate effector molecules. Thus it is very important to know true Dicer processing sites in the pre-miRNA molecules to understand the RNA interference pathway.",
        "homepage": "http://www.imtech.res.in/raghava/phdcleav/",
        "name": "PHDcleav"
    }
}