{
    "additionDate": "2022-10-11T07:10:44.008988Z",
    "biotoolsCURIE": "biotools:fec",
    "biotoolsID": "fec",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jianxin Wang"
        },
        {
            "name": "Jun Zhang"
        }
    ],
    "description": "Fec is a error correction tool based on two-rounds overlapping and caching.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangjuncsu/Fec.<h4",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T15:27:35.098206Z",
    "license": "Not licensed",
    "name": "Fec",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac565",
            "metadata": {
                "abstract": "The third-generation sequencing technology has advanced genome analysis with long-read length, but the reads need error correction due to the high error rate. Error correction is a time-consuming process especially when the sequencing coverage is high. Generally, for a pair of overlapping reads A and B, the existing error correction methods perform a base-level alignment from B to A when correcting the read A. And another base-level alignment from A to B is performed when correcting the read B. However, based on our observation, the base-level alignment information can be reused. In this article, we present a fast error correction tool Fec, using two-rounds overlapping and caching. Fec can be used independently or as an error correction step in an assembly pipeline. In the first round, Fec uses a large window size (20) to quickly find enough overlaps to correct most of the reads. In the second round, a small window size (5) is used to find more overlaps for the reads with insufficient overlaps in the first round. When performing base-level alignment, Fec searches the cache first. If the alignment exists in the cache, Fec takes this alignment out and deduces the second alignment from it. Otherwise, Fec performs base-level alignment and stores the alignment in the cache. We test Fec on nine datasets, and the results show that Fec has 1.24–38.56 times speedup compared to MECAT, CANU and MINICNS on five PacBio datasets and 1.16–27.8 times speed-up compared to NECAT and CANU on four nanopore datasets.",
                "authors": [
                    {
                        "name": "Huang N."
                    },
                    {
                        "name": "Luo F."
                    },
                    {
                        "name": "Ni P."
                    },
                    {
                        "name": "Nie F."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fec: a fast error correction method based on two-rounds overlapping and caching"
            },
            "pmid": "35977383"
        }
    ],
    "relation": [
        {
            "biotoolsID": "minimap2",
            "type": "uses"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
