
{
    "credit": [
        {
            "name": "ELIXIR-ITA-SAPIENZA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "fidea.biocomputing@gmail.com",
            "name": "Luigi Grassi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://circe.med.uniroma1.it/fidea/help.php"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression profile",
                        "uri": "http://edamontology.org/data_0928"
                    }
                }
            ],
            "note": "Calculates overrepresentation statistics using KEGG, Interpro, Gene Ontology Molecular Function, Gene Ontology Biological Process, Gene Ontology Cellular Component and GoSlim classifications; analyzea down-regulated and up-regulated DE genes separately or together as a single set.",
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network report",
                        "uri": "http://edamontology.org/data_2984"
                    }
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The results of differential expression analyses provide scientists with hundreds to thousands of differentially expressed genes that need to be interpreted in light of the biology of the specific system under study. This requires mapping the genes to functional classifications that can be, for example, the KEGG pathways or InterPro families they belong to, their GO Molecular Function, Biological Process or Cellular Component. A statistically significant overrepresentation of one or more category terms in the set of differentially expressed genes is an essential step for the interpretation of the biological significance of the results. Ideally, the analysis should be performed by scientists who are well acquainted with the biological problem, as they have a wealth of knowledge about the system and can, more easily than a bioinformatician, discover less obvious and, therefore, more interesting relationships. To allow experimentalists to explore their data in an easy and at the same time exhaustive fashion within a single tool and to test their hypothesis quickly and effortlessly, we developed FIDEA. The FIDEA server is located at http://www.biocomputing.it/fidea; it is free and open to all users, and there is no login requirement.",
            "authors": [
                "D'Andrea D.",
                "Grassi L.",
                "Mazzapioda M.",
                "Tramontano A."
            ],
            "cit_count": 25,
            "doi": "10.1093/nar/gkt516",
            "journal": "Nucleic acids research",
            "title": "FIDEA: a server for the functional interpretation of differential expression analysis.",
            "type": "Primary",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fidea",
        "biotoolsID": "fidea",
        "description": "A web server designed to facilitate the functional interpretation of differential expression analysis. It is aimed at allowing experimentalists to \"play with\" their RNA-Seq data in an easy and at the same time exhaustive fashion within a single tool.",
        "homepage": "http://www.biocomputing.it/fidea",
        "name": "FIDEA",
        "version": [
            "1.1"
        ]
    }
}