{"credit":[],"function":[{"operation":[{"term":"RNA-Seq quantification","uri":"http://edamontology.org/operation_3800"},{"term":"miRNA target prediction","uri":"http://edamontology.org/operation_0463"},{"term":"miRNA expression analysis","uri":"http://edamontology.org/operation_3792"}]}],"labels":{"language":["Python"],"license":"MIT","topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"RNA-Seq","uri":"http://edamontology.org/topic_3170"}]},"publication":[{"abstract":"© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Epithelial-mesenchymal transition (EMT) has been a subject of intense scrutiny as it facilitates metastasis and alters drug sensitivity. Although EMT-regulatory roles for numerous miRNAs and transcription factors are known, their functions can be difficult to disentangle, in part due to the difficulty in identifying direct miRNA targets from complex datasets and in deciding how to incorporate 'indirect' miRNA effects that may, or may not, represent biologically relevant information. To better understand how miRNAs exert effects throughout the transcriptome during EMT, we employed Exon-Intron Split Analysis (EISA), a bioinformatic technique that separates transcriptional and post-transcriptional effects through the separate analysis of RNA-Seq reads mapping to exons and introns. We find that in response to the manipulation of miRNAs, a major effect on gene expression is transcriptional. We also find extensive co-ordination of transcriptional and post-transcriptional regulatory mechanisms during both EMT and mesenchymal to epithelial transition (MET) in response to TGF-β or miR-200c respectively. The prominent transcriptional influence of miRNAs was also observed in other datasets where miRNA levels were perturbed. This work cautions against a narrow approach that is limited to the analysis of direct targets, and demonstrates the utility of EISA to examine complex regulatory networks involving both transcriptional and post-transcriptional mechanisms.","authors":["Pillman K.A.","Scheer K.G.","Hackett-Jones E.","Saunders K.","Bert A.G.","Toubia J.","Whitfield H.J.","Sapkota S.","Sourdin L.","Pham H.","Le T.D.","Cursons J.","Davis M.J.","Gregory P.A.","Goodall G.J.","Bracken C.P."],"cit_count":0,"doi":"10.1093/NAR/GKZ664","journal":"Nucleic acids research","pmid":"31372646","title":"Extensive transcriptional responses are co-ordinated by microRNAs as revealed by Exon-Intron Split Analysis (EISA)","year":"2019-09-19"}],"summary":{"biotoolsCURIE":"biotools:miRNAs","biotoolsID":"miRNAs","description":"> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'EISA', 'EMT', 'EMT-regulatory', 'miR-200c' | Extensive transcriptional responses are co-ordinated by microRNAs as revealed by Exon-Intron Split Analysis (EISA) | A collection of scripts associated with the manuscript Cursons et al (2017) - Post-transcriptional control of EMT is coordinated through distributed, combinatorial targeting by multiple microRNAs | Combinatorial miRNAs in breast cancer EMT","homepage":"https://github.com/DavisLaboratory/Combinatorial_miRNAs","name":"miRNAs"}}