{
    "additionDate": "2021-01-18T10:54:15Z",
    "biotoolsCURIE": "biotools:iddb",
    "biotoolsID": "iddb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jian.zhang@sjtu.edu.cn",
            "name": "Jian Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "xuefenglu163@163.com",
            "name": "Xuefeng Lu",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive resource featuring genes, variants and characteristics associated with infertility.\n\nInfertility Disease DataBase (IDDB) provides a versatile resource for genes, experiments and clinical records related with the infertility diseases, data in IDDB is annually updated and freely served for biologists and doctors interested in reproduction and infertility.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://mdl.shsmu.edu.cn/IDDB/",
    "lastUpdate": "2021-02-02T07:48:24Z",
    "name": "IDDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA753",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Infertility is a complex multifactorial disease that affects up to 10% of couples across the world. However, many mechanisms of infertility remain unclear due to the lack of studies based on systematic knowledge, leading to ineffective treatment and/or transmission of genetic defects to offspring. Here, we developed an infertility disease database to provide a comprehensive resource featuring various factors involved in infertility. Features in the current IDDB version were manually curated as follows: (i) a total of 307 infertility-associated genes in human and 1348 genes associated with reproductive disorder in 9 model organisms; (ii) a total of 202 chromosomal abnormalities leading to human infertility, including aneuploidies and structural variants; and (iii) a total of 2078 pathogenic variants from infertility patients' samples across 60 different diseases causing infertility. Additionally, the characteristics of clinically diagnosed infertility patients (i.e. causative variants, laboratory indexes and clinical manifestations) were collected. To the best of our knowledge, the IDDB is the first infertility database serving as a systematic resource for biologists to decipher infertility mechanisms and for clinicians to achieve better diagnosis/treatment of patients from disease phenotype to genetic factors. The IDDB is freely available at http://mdl.shsmu.edu.cn/IDDB/.",
                "authors": [
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Wei J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Rehman A.U."
                    },
                    {
                        "name": "Xia Y."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Lu X."
                    }
                ],
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IDDB: A comprehensive resource featuring genes, variants and characteristics associated with infertility"
            },
            "pmid": "32941628"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        }
    ]
}