{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://model.nmr.ru/"}],"documentation":[{"url":"http://model.nmr.ru/preddimer/manual"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["PHP","Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/preddimer-prediction-tool-for-an-ensemble-of-transmembrane-α-helical-dimer-conformations.html"}],"publication":[{"abstract":"Summary: Here we present PREDDIMER, a web tool for prediction of dimer structure of transmembrane (TM) helices. PREDDIMER allows (i) reconstruction of a number of dimer structures for given sequence(s) of TM protein fragments, (ii) ranking and filtering of predicted structures according to respective values of a scoring function, (iii) visualization of predicted 3D dimer structures and (iv) visualization of surface hydrophobicity of TM helices and their contacting (interface) regions represented as 2D maps.Results: We implemented online the original PREDDIMER algorithm and benchmarked the server on 11 TM sequences, whose 3D dimer conformations were obtained previously by nuclear magnetic resonance spectroscopy. In the most of tested cases backbone root-mean-square deviations of closest predicted conformations from the experimental reference are below 3 Å. A randomization test displays good anticorrelation (-0.82) between values of the scoring function and statistical significance of the prediction 'by chance'. Going beyond a single dimer conformation, our web tool predicts an ensemble of possible conformations, which may be useful for explanation of a functioning of bitopic membrane proteins, e.g. receptor tyrosine kinases. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.","authors":["Polyansky A.A.","Chugunov A.O.","Volynsky P.E.","Krylov N.A.","Nolde D.E.","Efremov R.G."],"cit_count":26,"doi":"10.1093/bioinformatics/btt645","journal":"Bioinformatics","pmid":"24202542","title":"PREDDIMER: A web server for prediction of transmembrane helical dimers","type":"Primary","year":"2014-03-01"}],"summary":{"biotoolsCURIE":"biotools:preddimer","biotoolsID":"preddimer","description":"PREDDIMER reconstructs putative dimer conformations for given sequences of transmembrane protein fragments, which are considered as ideal α-helices.","homepage":"http://model.nmr.ru/preddimer/","name":"PREDDIMER"}}