{"collectionID": [], "accessibility": [], "topic": [{"term": "Mapping", "uri": "http://edamontology.org/topic_0102"}, {"term": "DNA", "uri": "http://edamontology.org/topic_0654"}, {"term": "Transcription factors and regulatory sites", "uri": "http://edamontology.org/topic_0749"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "19958507", "type": null, "pmcid": null, "metadata": {"title": "TTS mapping: Integrative WEB tool for analysis of triplex formation target DNA sequences, G-quadruplets and non-protein coding regulatory DNA elements in the human genome", "abstract": "Background: DNA triplexes can naturally occur, co-localize and interact with many other regulatory DNA elements (e.g. G-quadruplex (G4) DNA motifs), specific DNA-binding proteins (e.g. transcription factors (TFs)), and micro-RNA (miRNA) precursors. Specific genome localizations of triplex target DNA sites (TTSs) may cause abnormalities in a double-helix DNA structure and can be directly involved in some human diseases. However, genome localization of specific TTSs, their interconnection with regulatory DNA elements and physiological roles in a cell are poor defined. Therefore, it is important to identify comprehensive and reliable catalogue of specific potential TTSs (pTTSs) and their co-localization patterns with other regulatory DNA elements in the human genome. Results: \"TTS mapping\" database is a web-based search engine developed here, which is aimed to find and annotate pTTSs within a region of interest of the human genome. The engine provides descriptive statistics of pTTSs in a given region and its sequence context. Different annotation tracks of TTS-overlapping gene region(s), G4 motifs, CpG Island, miRNA precursors, miRNA targets, transcription factor binding sites (TFBSs), Single Nucleotide Polymorphisms (SNPs), small nucleolar RNAs (snoRNA), and repeat elements are also mapped based onto a sequence location provided by UCSC genome browser, G4 database http://www.quadruplex.org and several other datasets. The results pages provide links to UCSC genome browser annotation tracks and relative DBs. BLASTN program was included to check the uniqueness of a given pTTS in the human genome. Recombination- and mutation-prone genes (e.g. EVI-1, MYC) were found to be significantly enriched by TTSs and multiple co-occurring with our regulatory DNA elements. TTS mapping reveals that a high-complementary and evolutionarily conserved polypurine and polypyrimidine DNA sequence pair linked by a non-conserved short DNA sequence can form miR-483 transcribed from intron 2 of IGF2 gene and bound double-strand nucleic acid TTSs forming natural triplex structures. Conclusion: TTS mapping provides comprehensive visual and analytical tools to help users to find pTTSs, G-quadruplets and other regulatory DNA elements in various genome regions. TTS Mapping not only provides sequence visualization and statistical information, but also integrates knowledge about co-localization TTS with various DNA elements and facilitates that data analysis. In particular, TTS Mapping reveals complex structural-functional regulatory module of gene IGF2 including TF MZF1 binding site and ncRNA precursor mir-483 formed by the high-complementary and evolutionarily conserved polypurine- and polypyrimidine-rich DNA pair. Such ncRNAs capable of forming helical triplex structures with a polypurine strand of a nucleic acid duplexes (DNA or RNA) via Hoogsteen or reverse Hoogsteen hydrogen bonds. Our web tool could be used to discover biologically meaningful genome modules and to optimize experimental design of anti-gene treatment. © 2009 Jenjaroenpun and Kuznetsov; licensee BioMed Central Ltd.", "citationCount": 20, "authors": [{"name": "Jenjaroenpun P."}, {"name": "Kuznetsov V.A."}], "date": "2009-12-03T00:00:00Z", "journal": "BMC Genomics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://ggeda.bii.a-star.edu.sg/~piroonj/TTS_mapping/info/contact.html", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:tts_mapping", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://ggeda.bii.a-star.edu.sg/~piroonj/TTS_mapping/TTS_mapping.php", "function": [{"note": null, "input": [], "operation": [{"term": "DNA mapping", "uri": "http://edamontology.org/operation_2520"}, {"term": "Genome annotation", "uri": "http://edamontology.org/operation_0362"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:44Z", "otherID": [], "description": "Web-based search engine to find and annotate pTTSs within human genome region of interest. The engine provides descriptive statistics of pTTSs in a given region and its sequence context.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/tts-mapping-triplex-target-dna-site-mapping.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "tts_mapping", "additionDate": "2017-08-03T19:02:59Z", "name": "TTS mapping", "license": null, "documentation": [{"url": "http://ggeda.bii.a-star.edu.sg/~piroonj/TTS_mapping/info/about.html", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}