{
    "accessibility": "Open access",
    "additionDate": "2022-01-19T22:37:14.575069Z",
    "biotoolsCURIE": "biotools:identpmp",
    "biotoolsID": "identpmp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhenyuyue@ahau.edu.cn",
            "name": "Zhenyu Yue",
            "typeEntity": "Person"
        },
        {
            "email": "yyyue@ahau.edu.cn",
            "name": "Yi Yue",
            "typeEntity": "Person"
        },
        {
            "name": "Xinyi Liu"
        },
        {
            "name": "Yueyue Shen"
        }
    ],
    "description": "IdentPMP is a web application that predict plant moonlighting protein.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "http://identpmp.aielab.net/",
    "lastUpdate": "2022-01-19T22:37:14.577701Z",
    "license": "Not licensed",
    "name": "IdentPMP",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11900",
            "metadata": {
                "abstract": "© 2021 Liu et al.Background. A moonlighting protein refers to a protein that can perform two or more functions. Since the current moonlighting protein prediction tools mainly focus on the proteins in animals and microorganisms, and there are differences in the cells and proteins between animals and plants, these may cause the existing tools to predict plant moonlighting proteins inaccurately. Hence, the availability of a benchmark data set and a prediction tool specific for plant moonlighting protein are necessary. Methods. This study used some protein feature classes from the data set constructed in house to develop a web-based prediction tool. In the beginning, we built a data set about plant protein and reduced redundant sequences. We then performed feature selection, feature normalization and feature dimensionality reduction on the training data. Next, machine learning methods for preliminary modeling were used to select feature classes that performed best in plant moonlighting protein prediction. This selected feature was incorporated into the final plant protein prediction tool. After that, we compared five machine learning methods and used grid searching to optimize parameters, and the most suitable method was chosen as the final model. Results. The prediction results indicated that the eXtreme Gradient Boosting (XGBoost) performed best, which was used as the algorithm to construct the prediction tool, called IdentPMP (Identification of Plant Moonlighting Proteins). The results of the independent test set shows that the area under the precision-recall curve (AUPRC) and the area under the receiver operating characteristic curve (AUC) of IdentPMP is 0.43 and 0.68, which are 19.44% (0.43 vs. 0.36) and 13.33% (0.68 vs. 0.60) higher than state-of-the-art non-plant specific methods, respectively. This further demonstrated that a benchmark data set and a plant-specific prediction tool was required for plant moonlighting protein studies. Finally, we implemented the tool into a web version, and users can use it freely through the URL: http://identpmp.aielab.net/.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Yue Z."
                    },
                    {
                        "name": "Yue Y."
                    }
                ],
                "date": "2021-08-06T00:00:00Z",
                "journal": "PeerJ",
                "title": "IdentPMP: Identification of moonlighting proteins in plants using sequence-based learning models"
            },
            "pmcid": "PMC8351581",
            "pmid": "34434652"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}