{
    "additionDate": "2020-01-09T17:39:19Z",
    "biotoolsCURIE": "biotools:VISDB",
    "biotoolsID": "VISDB",
    "confidence_flag": "tool",
    "description": "a manually curated database of viral integration sites in the human genome.\n\nVISDB, visdb, virus integration site, viral integration, DNA virus, retrovirus, HBV, HPV, HIV, HTLV-1, EBV, AAV2, MCV, MLV, XMRV, gene, fragile site, miRNA, database, resource, UTHealth, SBMI, Zhongming Zhao",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo.uth.edu/VISDB",
    "lastUpdate": "2024-11-24T20:51:09.578012Z",
    "name": "VISDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz867",
            "metadata": {
                "abstract": "Virus integration into the human genome occurs frequently and represents a key driving event in human disease. Many studies have reported viral integration sites (VISs) proximal to structural or functional regions of the human genome. Here, we systematically collected and manually curated all VISs reported in the literature and publicly available data resources to construct the Viral Integration Site DataBase (VISDB, https://bioinfo.uth.edu/VISDB). Genomic information including target genes, nearby genes, nearest transcription start site, chromosome fragile sites, CpG islands, viral sequences and target sequences were integrated to annotate VISs. We further curated VIS-involved oncogenes and tumor suppressor genes, virus-host interactions involved in non-coding RNA (ncRNA), target gene and microRNA expression in five cancers, among others. Moreover, we developed tools to visualize single integration events, VIS clusters, DNA elements proximal to VISs and virus-host interactions involved in ncRNA. The current version of VISDB contains a total of 77 632 integration sites of five DNA viruses and four RNA retroviruses. VISDB is currently the only active comprehensive VIS database, which provides broad usability for the study of disease, virus related pathophysiology, virus biology, host-pathogen interactions, sequence motif discovery and pattern recognition, molecular evolution and adaption, among others.",
                "authors": [
                    {
                        "name": "Hu R."
                    },
                    {
                        "name": "Jia P."
                    },
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Tan D."
                    },
                    {
                        "name": "Tang D."
                    },
                    {
                        "name": "Xu T."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "citationCount": 32,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VISDB: A manually curated database of viral integration sites in the human genome"
            },
            "pmcid": "PMC6943068",
            "pmid": "31598702"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
