{
    "additionDate": "2020-09-03T19:18:04Z",
    "biotoolsCURIE": "biotools:cvid",
    "biotoolsID": "cvid",
    "collectionID": [
        "BIG N2N",
        "UGent",
        "VIB"
    ],
    "credit": [
        {
            "email": "yvan.saeys@ugent.be",
            "name": "Yvan Saeys",
            "typeEntity": "Person"
        }
    ],
    "description": "A Computational Pipeline for the Diagnosis of CVID Patients.\n\nComputational_Pipeline_CVID.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/saeyslab/Computational_Pipeline_CVID",
    "lastUpdate": "2020-09-03T19:18:04Z",
    "name": "CVID",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2019.02009",
            "metadata": {
                "abstract": "© 2019 Emmaneel, Bogaert, Van Gassen, Tavernier, Dullaers, Haerynck and Saeys.Common variable immunodeficiency (CVID) is one of the most frequently diagnosed primary antibody deficiencies (PADs), a group of disorders characterized by a decrease in one or more immunoglobulin (sub)classes and/or impaired antibody responses caused by inborn defects in B cells in the absence of other major immune defects. CVID patients suffer from recurrent infections and disease-related, non-infectious, complications such as autoimmune manifestations, lymphoproliferation, and malignancies. A timely diagnosis is essential for optimal follow-up and treatment. However, CVID is by definition a diagnosis of exclusion, thereby covering a heterogeneous patient population and making it difficult to establish a definite diagnosis. To aid the diagnosis of CVID patients, and distinguish them from other PADs, we developed an automated machine learning pipeline which performs automated diagnosis based on flow cytometric immunophenotyping. Using this pipeline, we analyzed the immunophenotypic profile in a pediatric and adult cohort of 28 patients with CVID, 23 patients with idiopathic primary hypogammaglobulinemia, 21 patients with IgG subclass deficiency, six patients with isolated IgA deficiency, one patient with isolated IgM deficiency, and 100 unrelated healthy controls. Flow cytometry analysis is traditionally done by manual identification of the cell populations of interest. Yet, this approach has severe limitations including subjectivity of the manual gating and bias toward known populations. To overcome these limitations, we here propose an automated computational flow cytometry pipeline that successfully distinguishes CVID phenotypes from other PADs and healthy controls. Compared to the traditional, manual analysis, our pipeline is fully automated, performing automated quality control and data pre-processing, automated population identification (gating) and deriving features from these populations to build a machine learning classifier to distinguish CVID from other PADs and healthy controls. This results in a more reproducible flow cytometry analysis, and improves the diagnosis compared to manual analysis: our pipelines achieve on average a balanced accuracy score of 0.93 (±0.07), whereas using the manually extracted populations, an averaged balanced accuracy score of 0.72 (±0.23) is achieved.",
                "authors": [
                    {
                        "name": "Bogaert D.J."
                    },
                    {
                        "name": "Dullaers M."
                    },
                    {
                        "name": "Emmaneel A."
                    },
                    {
                        "name": "Haerynck F."
                    },
                    {
                        "name": "Saeys Y."
                    },
                    {
                        "name": "Tavernier S.J."
                    },
                    {
                        "name": "Van Gassen S."
                    }
                ],
                "citationCount": 7,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "A computational pipeline for the diagnosis of CVID patients"
            },
            "pmcid": "PMC6730493",
            "pmid": "31543876"
        }
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
