{
    "additionDate": "2018-07-30T12:20:29Z",
    "biotoolsCURIE": "biotools:hmmibd",
    "biotoolsID": "hmmibd",
    "credit": [
        {
            "email": "sfs@broadinstitute.org",
            "name": "Stephen F. Schaffner",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A hidden Markov model for detecting segments of shared ancestry (identity by descent) in genetic sequence data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/glipsnort/hmmIBD"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://github.com/glipsnort/hmmIBD",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "hmmIBD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12936-018-2349-7",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: A number of recent malaria studies have used identity by descent (IBD) to study epidemiological processes relevant to malaria control. In this paper, a software package, hmmIBD, is introduced for estimating pairwise IBD between haploid genomes, such as those of the malaria parasite, sampled from one or two populations. Source code is freely available. Methods: The performance of hmmIBD was verified using simulated data and benchmarked against an existing method for detecting IBD within populations. Code for all tests is freely available. The utility of hmmIBD for detecting IBD across populations was demonstrated using Plasmodium falciparum data from Cambodia and Ghana. Results: Alongside an existing method, hmmIBD was highly accurate, sensitive and specific. It is fast, requiring only 70 s on average to analyse 50 whole genome sequences on a laptop computer, and scales linearly in the number of pairwise comparisons. Treatment of different populations under hmmIBD improves detection of IBD across populations. Conclusion: Fast and accurate software for detecting IBD in malaria parasite genetic data sampled from one or two populations is presented. The latter will likely be a useful feature for malaria elimination efforts, since it could facilitate identification of imported malaria cases. Software is robust to possible misspecification of the genotyping error and the recombination rate. However, exclusion of data in regions whose rates vary greatly from their genome-wide average is recommended.",
                "authors": [
                    {
                        "name": "Schaffner S.F."
                    },
                    {
                        "name": "Taylor A.R."
                    },
                    {
                        "name": "Wong W."
                    },
                    {
                        "name": "Wirth D.F."
                    },
                    {
                        "name": "Neafsey D.E."
                    }
                ],
                "citationCount": 28,
                "date": "2018-05-15T00:00:00Z",
                "journal": "Malaria Journal",
                "title": "HmmIBD: Software to infer pairwise identity by descent between haploid genotypes"
            },
            "pmcid": "PMC5952413",
            "pmid": "29764422"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}