
{
    "credit": [
        {
            "email": "brunaplese@googlemail.com",
            "name": "Bruna Plese",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "a.riesgo@nhm.ac.uk",
            "name": "Ana Riesgo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/bplese/Trimitomics/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "Java",
            "Perl"
        ],
        "license": "MIT",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/bplese/Trimitomics/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 John Wiley & Sons LtdMitochondrial resources are of known utility to many fields of phylogenetic, population and molecular biology. Their combination of faster and slower-evolving regions and high copy number enables them to be used in many situations where other loci are unsuitable, with degraded samples and after recent speciation events.The advent of next-generation sequencing technologies (and notably the Illumina platform) has led to an explosion in the number of samples that can be studied at transcriptomic level, at relatively low cost. Here we describe a robust pipeline for the recovery of mitochondrial genomes from these RNA-sequencing resources. This pipeline can be used on sequencing of a variety of depths, and reliably recovers the protein coding and ribosomal gene complements of mitochondria from almost any transcriptomic sequencing experiment. The complete sequence of the mitochondrial genome can also be recovered when sequencing is performed in sufficient depth. We show the efficacy of our pipeline using data from eight nonmodel invertebrates of six disparate phyla. Interestingly, among our poriferan data, where microbiological symbionts are known empirically to make mitochondrial assembly difficult, this pipeline proved especially useful. Our pipeline will allow the recovery of mitochondrial data from a variety of previously sequenced samples, and add an additional angle of enquiry to future RNA-sequencing efforts, simplifying the process of mitochondrial genome assembly for even the most recalcitrant clades and adding these data to the scientific record for a range of future uses.",
            "authors": [
                "Plese B.",
                "Rossi M.E.",
                "Kenny N.J.",
                "Taboada S.",
                "Koutsouveli V.",
                "Riesgo A."
            ],
            "cit_count": 0,
            "doi": "10.1111/1755-0998.13033",
            "journal": "Molecular Ecology Resources",
            "pmid": "31070854",
            "title": "Trimitomics: An efficient pipeline for mitochondrial assembly from transcriptomic reads in nonmodel species",
            "type": "Primary",
            "year": "2019-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Trimitomics",
        "biotoolsID": "Trimitomics",
        "description": "Efficient pipeline for mitochondrial assembly from transcriptomic reads in nonmodel species.",
        "homepage": "https://github.com/bplese/Trimitomics",
        "name": "Trimitomics"
    }
}