{"credit":[{"email":"jorge.cossio@cigb.edu.cu","name":"Fernandez-de-Cossio J.","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://coco.protein.osaka-u.ac.jp/isotopica/"}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"},{"term":"Protein fragment weight comparison","uri":"http://edamontology.org/operation_2929"},{"term":"Mass spectrum visualisation","uri":"http://edamontology.org/operation_3694"},{"term":"Isotopic distributions calculation","uri":"http://edamontology.org/operation_3632"},{"term":"Peptide identification","uri":"http://edamontology.org/operation_3631"}]}],"labels":{"collectionID":["Proteomics"],"language":["C++","C#"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Carbohydrates","uri":"http://edamontology.org/topic_0152"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"publication":[{"abstract":"The web application Isotopica has been developed as an aid to the interpretation of ions that contain naturally occurring isotopes in a mass spectrum. It allows the calculation of mass values and isotopic distributions based on molecular formulas, peptides/proteins, DNA/RNA, carbohydrate sequences or combinations thereof. In addition, Isotopica takes modifications of the input molecule into consideration using a simple and flexible language as a straight-forward extension of the molecular formula syntax. This function is especially useful for biomolecules, which are often subjected to additional modifications other than normal constituents, such as the frequently occurring post-translational modification in proteins. The isotopic distribution of any molecule thus defined can be calculated by considering full widths at half maximum or mass resolution. The combined envelope of several overlapping isotopic distributions of a mixture of molecules can be determined after specifying each molecule's relative abundance. The results can be displayed graphically on a local PC using the Isotopica viewer, a standalone application that is downloadable from the sites below, as a complement to the client browser. The m/zand intensity values can also be obtained in the form of a plain ASCII text file. The software has proved to be useful for peptide mass fingerprinting and validating an observed isotopic ion distribution with reference to the theoretical one, even from a multi-component sample. The web server can be accessed at http://bioinformatica.cigb.edu/isotopica and http://coco.protein.osaka-u.ac.jp/isotopic. © Oxford University Press 2004; all rights reserved.","authors":["Fernandez-de-Cossio J.","Gonzalez L.J.","Satomi Y.","Betancourt L.","Ramos Y.","Huerta V.","Amaro A.","Besada V.","Padron G.","Minamino N.","Takao T."],"cit_count":27,"journal":"Nucleic Acids Research","pmid":"15215474","title":"Isotopica: A tool for the calculation and viewing of complex isotopic envelopes","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:isotopica","biotoolsID":"isotopica","description":"Tools developed to aid in the identification of mass spectrum that allow the calculation of mass values with isotopic distributions based on molecular formulas, peptides/proteins, DNA/RNA, carbohydrate sequences or combinations thereof.  A viewer for visualizing results is also available.","homepage":"http://coco.protein.osaka-u.ac.jp/isotopica/","name":"ISOTOPICA"}}