{
    "additionDate": "2020-01-14T08:54:56Z",
    "biotoolsCURIE": "biotools:MIENTURNET",
    "biotoolsID": "MIENTURNET",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paola.paci@iasi.cnr.it",
            "name": "Paola Paci",
            "orcidid": "https://orcid.org/0000-0002-9393-2047",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive web tool for microRNA-target enrichment and network-based analysis.\n\nBACKGROUND:miRNAs regulate the expression of several genes with one miRNA able to target multiple genes and with one gene able to be simultaneously targeted by more than one miRNA. Therefore, it has become indispensable to shorten the long list of miRNA-target interactions to put in the spotlight in order to gain insight into understanding the regulatory mechanism orchestrated by miRNAs in various cellular processes. A reasonable solution is certainly to prioritize miRNA-target interactions to maximize the effectiveness of the downstream analysis. RESULTS:We propose a new and easy-to-use web tool MIENTURNET (MicroRNA ENrichment TURned NETwork) that receives in input a list of miRNAs or mRNAs and tackles the problem of prioritizing miRNA-target interactions by performing a statistical analysis followed by a fully featured network-based visualization and analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://userver.bio.uniroma1.it/apps/mienturnet/",
    "lastUpdate": "2020-12-28T10:45:11Z",
    "name": "MIENTURNET",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3105-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: miRNAs regulate the expression of several genes with one miRNA able to target multiple genes and with one gene able to be simultaneously targeted by more than one miRNA. Therefore, it has become indispensable to shorten the long list of miRNA-target interactions to put in the spotlight in order to gain insight into understanding the regulatory mechanism orchestrated by miRNAs in various cellular processes. A reasonable solution is certainly to prioritize miRNA-target interactions to maximize the effectiveness of the downstream analysis. Results: We propose a new and easy-to-use web tool MIENTURNET (MicroRNA ENrichment TURned NETwork) that receives in input a list of miRNAs or mRNAs and tackles the problem of prioritizing miRNA-target interactions by performing a statistical analysis followed by a fully featured network-based visualization and analysis. The statistics is used to assess the significance of an over-representation of miRNA-target interactions and then MIENTURNET filters based on the statistical significance associated with each miRNA-target interaction. In addition, the holistic approach of the network theory is used to infer possible evidences of miRNA regulation by capturing emergent properties of the miRNA-target regulatory network that would be not evident through a pairwise analysis of the individual components. Conclusion: MIENTURNET offers the possibility to consistently perform both statistical and network-based analyses by using only a single tool leading to a more effective prioritization of the miRNA-target interactions. This has the potential to avoid researchers without computational and informatics skills to navigate multiple websites and thus to independently investigate miRNA activity in every cellular process of interest in an easy and at the same time exhaustive way thanks to the intuitive web interface. The web application along with a well-documented and comprehensive user guide are freely available at http://userver.bio.uniroma1.it/apps/mienturnet/ without any login requirement.",
                "authors": [
                    {
                        "name": "Conte F."
                    },
                    {
                        "name": "Fiscon G."
                    },
                    {
                        "name": "Licursi V."
                    },
                    {
                        "name": "Paci P."
                    }
                ],
                "citationCount": 31,
                "date": "2019-11-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MIENTURNET: An interactive web tool for microRNA-target enrichment and network-based analysis"
            },
            "pmcid": "PMC6829817",
            "pmid": "31684860"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
