{
    "additionDate": "2017-03-24T14:34:36Z",
    "biotoolsCURIE": "biotools:sepresa",
    "biotoolsID": "sepresa",
    "credit": [
        {
            "email": "cpiserver@gmail.com",
            "name": "SePreSA Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SePreSA is a server for the prediction of populations susceptible to serious adverse drug reactions. A drug molecule is submitted to the server and its potential interaction with multiple adverse drug reaction targets is calculated using DOCK program.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://SePreSA.Bio-X.cn/",
    "lastUpdate": "2018-12-10T12:58:46Z",
    "name": "SePreSA",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Serious adverse drug reactions (SADRs) are caused by unexpected drug-human protein interactions, and some polymorphisms within binding pockets make the population carrying these polymorphisms susceptible to SADR. Predicting which populations are likely to be susceptible to SADR will not only strengthen drug safety, but will also assist enterprises to adjust R and D and marketing strategies. Making such predictions has recently been facilitated by the introduction of a web server named SePreSA. The server has a comprehensive collection of the structural models of nearly all the well known SADR targets. Once a drug molecule is submitted, the scale of its potential interaction with multi-SADR targets is calculated using the DOCK program. The server utilizes a 2-directional Z-transformation scoring algorithm, which computes the relative drug-protein interaction strength based on the docking-score matrix of a chemical-protein interactome, thus achieve greater accuracy in prioritizing SADR targets than simply using dock scoring functions. The server also suggests the binding pattern of the lowest docking score through 3D visualization, by highlighting and visualizing amino acid residues involved in the binding on the customer's browser. Polymorphism information for different populations for each of the interactive residues will be displayed, helping users to deduce the population-specific susceptibility of their drug molecule. The server is freely available at http://SePreSA.Bio-X.cn/.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "He L."
                    },
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Xing Q."
                    },
                    {
                        "name": "Yang L."
                    }
                ],
                "citationCount": 54,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SePreSA: A server for the prediction of populations susceptible to serious adverse drug reactions implementing the methodology of a chemical-protein interactome"
            },
            "pmid": "19417066"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
