{
    "additionDate": "2021-01-18T07:10:55Z",
    "biotoolsCURIE": "biotools:flare",
    "biotoolsID": "flare",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rqthomas@vt.edu",
            "name": "R. Quinn Thomas",
            "typeEntity": "Person"
        }
    ],
    "description": "FLARE (Forecasting Lake And Reservoir Ecosystems) is a near-term iterative forecasting system successfully predicts reservoir hydrodynamics and partitions uncertainty in real time.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CareyLabVT/FLARE",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T09:30:28Z",
    "license": "MIT",
    "name": "FLARE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.01.22.915538"
        },
        {
            "doi": "10.1029/2019WR026138",
            "metadata": {
                "abstract": "©2020. The Authors.Freshwater ecosystems are experiencing greater variability due to human activities, necessitating new tools to anticipate future water quality. In response, we developed and deployed a real-time iterative water temperature forecasting system (FLARE—Forecasting Lake And Reservoir Ecosystems). FLARE is composed of water temperature and meteorology sensors that wirelessly stream data, a data assimilation algorithm that uses sensor observations to update predictions from a hydrodynamic model and calibrate model parameters, and an ensemble-based forecasting algorithm to generate forecasts that include uncertainty. Importantly, FLARE quantifies the contribution of different sources of uncertainty (driver data, initial conditions, model process, and parameters) to each daily forecast of water temperature at multiple depths. We applied FLARE to Falling Creek Reservoir (Vinton, Virginia, USA), a drinking water supply, during a 475-day period encompassing stratified and mixed thermal conditions. Aggregated across this period, root mean square error (RMSE) of daily forecasted water temperatures was 1.13°C at the reservoir's near-surface (1.0 m) for 7-day ahead forecasts and 1.62°C for 16-day ahead forecasts. The RMSE of forecasted water temperatures at the near-sediments (8.0 m) was 0.87°C for 7-day forecasts and 1.20°C for 16-day forecasts. FLARE successfully predicted the onset of fall turnover 4–14 days in advance in two sequential years. Uncertainty partitioning identified meteorology driver data as the dominant source of uncertainty in forecasts for most depths and thermal conditions, except for the near-sediments in summer, when model process uncertainty dominated. Overall, FLARE provides an open-source system for lake and reservoir water quality forecasting to improve real-time management.",
                "authors": [
                    {
                        "name": "Thomas R.Q."
                    },
                    {
                        "name": "Figueiredo R.J."
                    },
                    {
                        "name": "Daneshmand V."
                    },
                    {
                        "name": "Bookout B.J."
                    },
                    {
                        "name": "Puckett L.K."
                    },
                    {
                        "name": "Carey C.C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Water Resources Research",
                "title": "A Near-Term Iterative Forecasting System Successfully Predicts Reservoir Hydrodynamics and Partitions Uncertainty in Real Time"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Freshwater biology",
            "uri": "http://edamontology.org/topic_3573"
        }
    ]
}