{
    "additionDate": "2019-11-14T19:51:15Z",
    "biotoolsCURIE": "biotools:IMPLEMENTATIONMixMPLN",
    "biotoolsID": "IMPLEMENTATIONMixMPLN",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "shibu.yooseph@ucf.edu",
            "name": "Shibu Yooseph",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | Learning a mixture of microbial networks using minorization-maximization | \"MixMPLN\" is a package written in R, which has two features. First feature is generating a proper synthetic sample-taxa count matrix. Second feature is receiving a sample-taxa count matrix and extracting k(number of components) different interaction networks between taxa | Following packages must be installed and loaded in R environment before using \"MixMPLN\":",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Proximity map plotting",
                    "uri": "http://edamontology.org/operation_2937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sahatava/MixMPLN",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T19:51:15Z",
    "name": "IMPLEMENTATION:MixMPLN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ370",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: The interactions among the constituent members of a microbial community play a major role in determining the overall behavior of the community and the abundance levels of its members. These interactions can be modeled using a network whose nodes represent microbial taxa and edges represent pairwise interactions. A microbial network is typically constructed from a sample-taxa count matrix that is obtained by sequencing multiple biological samples and identifying taxa counts. From large-scale microbiome studies, it is evident that microbial community compositions and interactions are impacted by environmental and/or host factors. Thus, it is not unreasonable to expect that a sample-taxa matrix generated as part of a large study involving multiple environmental or clinical parameters can be associated with more than one microbial network. However, to our knowledge, microbial network inference methods proposed thus far assume that the sample-taxa matrix is associated with a single network. Results: We present a mixture model framework to address the scenario when the sample-taxa matrix is associated with K microbial networks. This count matrix is modeled using a mixture of K Multivariate Poisson Log-Normal distributions and parameters are estimated using a maximum likelihood framework. Our parameter estimation algorithm is based on the minorization-maximization principle combined with gradient ascent and block updates. Synthetic datasets were generated to assess the performance of our approach on absolute count data, compositional data and normalized data. We also addressed the recovery of sparse networks based on an l1-penalty model.",
                "authors": [
                    {
                        "name": "Tavakoli S."
                    },
                    {
                        "name": "Yooseph S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Learning a mixture of microbial networks using minorization-maximization"
            },
            "pmcid": "PMC6612855",
            "pmid": "31510709"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        }
    ]
}