{
    "additionDate": "2021-01-18T10:02:38Z",
    "biotoolsCURIE": "biotools:shadowcaster",
    "biotoolsID": "shadowcaster",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asanchez2@utpl.edu.ec",
            "name": "Aminael Sánchez-Rodríguez",
            "typeEntity": "Person"
        }
    ],
    "description": "Compositional Methods under the Shadow of Phylogenetic Models to Detect Horizontal Gene Transfers in Prokaryotes.\nA python implementation of a hybrid approach for the detection of horizontal gene transfer events in prokaryotes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://shadowcaster.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dani2s/ShadowCaster",
    "language": [
        "Python",
        "Perl",
        "R"
    ],
    "lastUpdate": "2021-02-16T15:46:28Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/dani2s/ShadowCaster"
        }
    ],
    "name": "ShadowCaster",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/GENES11070756",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Horizontal gene transfer (HGT) plays an important role for evolutionary innovations within prokaryotic communities and is a crucial event for their survival. Several computational approaches have arisen to identify HGT events in recipient genomes. However, this has been proven to be a complex task due to the generation of a great number of false positives and the prediction disagreement among the existing methods. Phylogenetic reconstruction methods turned out to be the most reliable ones, but they are not extensible to all genes/species and are computationally demanding when dealing with large datasets. In contrast, the so-called surrogate methods that use heuristic solutions either based on nucleotide composition patterns or phyletic distribution of BLAST hits can be applied easily to the genomic scale, but they fail in identifying common HGT events. Here, we present ShadowCaster, a hybrid approach that sequentially combines nucleotide composition-based predictions by support vector machines (SVMs) under the shadow of phylogenetic models independent of tree reconstruction, to improve the detection of HGT events in prokaryotes. ShadowCaster successfully predicted close and distant HGT events in both artificial and bacterial genomes. ShadowCaster detected HGT related to heavy metal resistance in the genome of Rhodanobacter denitrificans with higher accuracy than the most popular state-of-the-art computational approaches, encompassing most of the predicted cases made by other methods. ShadowCaster is released at the GitHub platform as an open-source software under the GPLv3 license.",
                "authors": [
                    {
                        "name": "Sanchez-Soto D."
                    },
                    {
                        "name": "Aguero-Chapin G."
                    },
                    {
                        "name": "Armijos-Jaramillo V."
                    },
                    {
                        "name": "Perez-Castillo Y."
                    },
                    {
                        "name": "Tejera E."
                    },
                    {
                        "name": "Antunes A."
                    },
                    {
                        "name": "Sanchez-Rodriguez A."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "Genes",
                "title": "Shadowcaster: Compositional methods under the shadow of phylogenetic models to detect horizontal gene transfers in prokaryotes"
            },
            "pmcid": "PMC7397055",
            "pmid": "32645885"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}