{
    "accessibility": "Open access",
    "additionDate": "2024-05-18T15:05:00.968261Z",
    "biotoolsCURIE": "biotools:planner",
    "biotoolsID": "planner",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Cong Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-scale deep language model for the origins of replication site prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://planner.unimelb-biotools.cloud.edu.au/",
    "lastUpdate": "2024-11-24T13:57:22.502024Z",
    "name": "PLANNER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/jbhi.2024.3349584",
            "metadata": {
                "abstract": "Origins of replication sites (ORIs) are crucial genomic regions where DNA replication initiation takes place, playing pivotal roles in fundamental biological processes like cell division, gene expression regulation, and DNA integrity. Accurate identification of ORIs is essential for comprehending cell replication, gene expression, and mutation-related diseases. However, experimental approaches for ORI identification are often expensive and time-consuming, leading to the growing popularity of computational methods. In this study, we present PLANNER (DeeP LeArNiNg prEdictor for ORI), a novel approach for species-specific and cell-specific prediction of eukaryotic ORIs. PLANNER uses the multi-scale k-tuple sequences as input and employs the DNABERT pre-training model with transfer learning and ensemble learning strategies to train accurate predictive models. Extensive empirical test results demonstrate that PLANNER achieved superior predictive performance compared to state-of-the-art approaches, including iOri-Euk, Stack-ORI, and ORI-Deep, within specific cell types and across different cell types. Furthermore, by incorporating an interpretable analysis mechanism, we provide insights into the learned patterns, facilitating the mapping from discovering important sequential determinants to comprehensively analysing their biological functions.",
                "authors": [
                    {
                        "name": "Coin L.J.M."
                    },
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Jia R."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Pan S."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "citationCount": 5,
                "date": "2024-04-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "PLANNER: A Multi-Scale Deep Language Model for the Origins of Replication Site Prediction"
            },
            "pmid": "38190667"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}
