{
    "additionDate": "2021-01-18T09:54:17Z",
    "biotoolsCURIE": "biotools:mass-p",
    "biotoolsID": "mass-p",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zheng.wang@miami.edu",
            "name": "Zheng Wang",
            "orcidid": "https://orcid.org/0000-0003-3892-6151",
            "typeEntity": "Person"
        }
    ],
    "description": "Predict the global qualities of individual protein models using random forests and novel statistical potentials.\n\nMASS: Protein Single-Model Global Quality Assessment by Random Forest and Various Energies.\n\nTong Liu and Zheng Wang. MASS: predict the global qualities of individual protein models using random forests and novel statistical potentials. BMC Bioinformatics (2020) 21:246.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                }
            ]
        }
    ],
    "homepage": "http://dna.cs.miami.edu/MASS/",
    "lastUpdate": "2021-02-20T17:08:20Z",
    "name": "MASS-p",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3383-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Protein model quality assessment (QA) is an essential procedure in protein structure prediction. QA methods can predict the qualities of protein models and identify good models from decoys. Clustering-based methods need a certain number of models as input. However, if a pool of models are not available, methods that only need a single model as input are indispensable. Results: We developed MASS, a QA method to predict the global qualities of individual protein models using random forests and various novel energy functions. We designed six novel energy functions or statistical potentials that can capture the structural characteristics of a protein model, which can also be used in other protein-related bioinformatics research. MASS potentials demonstrated higher importance than the energy functions of RWplus, GOAP, DFIRE and Rosetta when the scores they generated are used as machine learning features. MASS outperforms almost all of the four CASP11 top-performing single-model methods for global quality assessment in terms of all of the four evaluation criteria officially used by CASP, which measure the abilities to assign relative and absolute scores, identify the best model from decoys, and distinguish between good and bad models. MASS has also achieved comparable performances with the leading QA methods in CASP12 and CASP13. Conclusions: MASS and the source code for all MASS potentials are publicly available at http://dna.cs.miami.edu/MASS/.",
                "authors": [
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "date": "2020-07-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MASS: Predict the global qualities of individual protein models using random forests and novel statistical potentials"
            },
            "pmcid": "PMC7336608",
            "pmid": "32631256"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web service"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}