{
    "additionDate": "2021-10-09T17:45:36.538135Z",
    "biotoolsCURIE": "biotools:matisse",
    "biotoolsID": "matisse",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "y.vercoulen@umcutrecht.nl",
            "name": "Yvonne Vercoulen",
            "orcidid": "https://orcid.org/0000-0002-5060-2603",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MATISSE is a method for improved single cell segmentation in imaging mass cytometry. MATISSE method combines fluorescence microscopy and multiplex IMC to achieve improved segmentation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VercoulenLab/MATISSE-Pipeline",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-09T17:45:36.542087Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/VercoulenLab/MATISSE-Pipeline/issues"
        }
    ],
    "name": "MATISSE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12915-021-01043-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Visualizing and quantifying cellular heterogeneity is of central importance to study tissue complexity, development, and physiology and has a vital role in understanding pathologies. Mass spectrometry-based methods including imaging mass cytometry (IMC) have in recent years emerged as powerful approaches for assessing cellular heterogeneity in tissues. IMC is an innovative multiplex imaging method that combines imaging using up to 40 metal conjugated antibodies and provides distributions of protein markers in tissues with a resolution of 1 μm2 area. However, resolving the output signals of individual cells within the tissue sample, i.e., single cell segmentation, remains challenging. To address this problem, we developed MATISSE (iMaging mAss cyTometry mIcroscopy Single cell SegmEntation), a method that combines high-resolution fluorescence microscopy with the multiplex capability of IMC into a single workflow to achieve improved segmentation over the current state-of-the-art. Results: MATISSE results in improved quality and quantity of segmented cells when compared to IMC-only segmentation in sections of heterogeneous tissues. Additionally, MATISSE enables more complete and accurate identification of epithelial cells, fibroblasts, and infiltrating immune cells in densely packed cellular areas in tissue sections. MATISSE has been designed based on commonly used open-access tools and regular fluorescence microscopy, allowing easy implementation by labs using multiplex IMC into their analysis methods. Conclusion: MATISSE allows segmentation of densely packed cellular areas and provides a qualitative and quantitative improvement when compared to IMC-based segmentation. We expect that implementing MATISSE into tissue section analysis pipelines will yield improved cell segmentation and enable more accurate analysis of the tissue microenvironment in epithelial tissue pathologies, such as autoimmunity and cancer.",
                "authors": [
                    {
                        "name": "Baars M.J.D."
                    },
                    {
                        "name": "Sinha N."
                    },
                    {
                        "name": "Amini M."
                    },
                    {
                        "name": "Pieterman-Bos A."
                    },
                    {
                        "name": "van Dam S."
                    },
                    {
                        "name": "Ganpat M.M.P."
                    },
                    {
                        "name": "Lacle M.M."
                    },
                    {
                        "name": "Oldenburg B."
                    },
                    {
                        "name": "Vercoulen Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Biology",
                "title": "MATISSE: a method for improved single cell segmentation in imaging mass cytometry"
            },
            "pmcid": "PMC8114487",
            "pmid": "33975602",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}