{
    "additionDate": "2019-11-14T19:58:30Z",
    "biotoolsCURIE": "biotools:WormBook",
    "biotoolsID": "WormBook",
    "confidence_flag": "tool",
    "description": "Immunostainings in Nervous System Development of the Nematode C. elegans | Embryo series courtesy of Einhard Schierenberg | WormBook is a comprehensive, open-access collection of original, peer-reviewed chapters covering topics related to the biology of Caenorhabditis elegans and other nematodes. Wormbook also contains: WormMethods, a collection of protocols for nematode researchers; WormHistory, personal perspectives on C. elegans research; and the Worm Breeder's Gazette, an informal, non-refereed, biannual newsletter for the interchange of ideas and information related to C. elegans and other nematodes. Additional chapters can be found in GENETICS",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.wormbook.org",
    "lastUpdate": "2021-01-06T15:03:47Z",
    "name": "WormBook",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9732-9_16",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.The nematode C. elegans is a useful model organism for studying neuronal development and function due to its extremely simple, well-defined nervous system, translucence, short life cycle, and abundance of genetic tools (WormBase. http://wormbase.org, 2018; WormBook. The C. elegans Research Community. http://www.wormbook.org, 2018). Due to the relative ease of genetic transformation, the majority of studies in C. elegans use transgenes (e.g., green fluorescent proteins) to assess the expression and distribution of specific proteins. In addition, large-scale in situ hybridization studies have described the distribution of mRNAs for thousands of genes throughout development. However, there may be qualitative and quantitative differences between expression of transgenic markers and the endogenous protein. Specific antibodies can be difficult to generate, but once generated antibodies can be used to study protein function and changes in expression and localization during development. Thus, genetic tools and immunohistochemistry are complementary techniques for studying cellular and developmental processes in C. elegans. Protocols for immunostaining in C. elegans are similar to those in other organisms; however, some features of these nematodes provide unique challenges. These include difficulties with antibody generation and access to the nervous system through the cuticle. This chapter describes a basic immunostaining technique that works in C. elegans for a variety of neural antigens in all stages of development to use in conjunction with the many tools available in this simple animal.",
                "authors": [
                    {
                        "name": "Duerr J.S."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Immunostainings in Nervous System Development of the Nematode C. elegans"
            },
            "pmid": "31552661"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}