{
    "accessibility": "Open access",
    "additionDate": "2019-05-18T08:37:11Z",
    "biotoolsCURIE": "biotools:DEvis",
    "biotoolsID": "DEvis",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ap3637@cumc.columbia.edu",
            "name": "Adam Price",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for aggregation and visualization of differential expression data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/price0416/DEvis"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=DEVis",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "LGPL-2.0",
    "maturity": "Mature",
    "name": "DEvis",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2702-z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Existing tools for the aggregation and visualization of differential expression data have discrete functionality and require that end-users rely on multiple software packages with complex dependencies or manually manipulate data for analysis and interpretation. Furthermore, at present, data aggregation and visualization are laborious, time consuming, and subject to human error. This is a serious limitation on the current state of differential transcriptomic analysis, which makes it necessary to expend extensive time and resources to reach the point where biological meaning can be interpreted. Such an approach for analysis also leads to scattered and non-standardized code, unsystematic project management and non-reproducible result sets. Results: Here, we present a differential expression analysis toolkit, DEvis, that provides a powerful, integrated solution for the analysis of differential expression data with a rapid turnaround time. DEvis has simple installation requirements and provides a convenient, user-friendly R package that addresses the issues inherent to complex multi-factor experiments, such as multiple contrast aggregation and integration, result sorting and selection, visualization, project management, and reproducibility. This tool increases the capabilities of differential expression analysis while reducing workload and the potential for manual error. Furthermore, it provides a much-needed encapsulation of scattered functionality, making large and complex analysis more efficient and reproducible. Conclusion: DEvis provides a wide range of powerful visualization, data aggregation, and project management tools that provide flexibility and speed in analysis. The functionality provided by DEVis increases efficiency of analysis and supplies researchers with new and relevant means for the analysis of large and complicated transcriptomic experiments. DEvis furthermore incorporates automatic project management capabilities, which standardizes analysis and ensures the reproducibility of results. After the establishment of statistical frameworks that identify differentially expressed genes, this package is the next logical step for differential transcriptomic analysis, establishing the critical framework necessary to manipulate, explore, and extract biologically relevant meaning from differential expression data.",
                "authors": [
                    {
                        "name": "Caciula A."
                    },
                    {
                        "name": "Guo C."
                    },
                    {
                        "name": "Jain K."
                    },
                    {
                        "name": "Lee B."
                    },
                    {
                        "name": "Lipkin W.I."
                    },
                    {
                        "name": "Morrison J."
                    },
                    {
                        "name": "Price A."
                    },
                    {
                        "name": "Rasmussen A."
                    }
                ],
                "citationCount": 5,
                "date": "2019-03-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DEvis: an R package for aggregation and visualization of differential expression data"
            },
            "pmcid": "PMC6399874",
            "pmid": "30832568",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
