
{
    "credit": [
        {
            "email": "alexandre.bureau@msp.ulaval.ca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.crulrg.ulaval.ca/pages_perso_chercheurs/bureau_a/english.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://cervo.ulaval.ca/pages_perso_chercheurs/bureau_a/software.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/rvsharing-1-1-0-computes-estimates-of-the-probability-of-related-individuals-sharing-a-rare-variant.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Family-based designs are regaining popularity for genomic sequencing studies because they provide a way to test cosegregation with disease of variants that are too rare in the population to be tested individually in a conventional case-control study. Results: Where only a few affected subjects per family are sequenced, the probability that any variant would be shared by all affected relatives - given it occurred in any one family member - provides evidence against the null hypothesis of a complete absence of linkage and association. A P-value can be obtained as the sum of the probabilities of sharing events as (or more) extreme in one or more families. We generalize an existing closed-form expression for exact sharing probabilities to more than two relatives per family. When pedigree founders are related, we show that an approximation of sharing probabilities based on empirical estimates of kinship among founders obtained from genome-wide marker data is accurate for low levels of kinship. We also propose a more generally applicable approach based on Monte Carlo simulations. We applied this method to a study of 55 multiplex families with apparent non-syndromic forms of oral clefts from four distinct populations, with whole exome sequences available for two or three affected members per family. The rare single nucleotide variant rs149253049 in ADAMTS9 shared by affected relatives in three Indian families achieved significance after correcting for multiple comparisons (p=2×10-6). Availability and implementation: Source code and binaries of the R package RVsharing are freely available for download at http://cran.r-project.org/web/packages/ RVsharing/index.html. © Published by Oxford University Press 2014.",
            "authors": [
                "Bureau A.",
                "Younkin S.G.",
                "Parker M.M.",
                "Bailey-Wilson J.E.",
                "Marazita M.L.",
                "Murray J.C.",
                "Mangold E.",
                "Albacha-Hejazi H.",
                "Beaty T.H.",
                "Ruczinski I."
            ],
            "cit_count": 11,
            "journal": "Bioinformatics",
            "pmid": "24740360",
            "title": "Inferring rare disease risk variants based on exact probabilities of sharing by multiple affected relatives",
            "year": "2014-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rvsharing",
        "biotoolsID": "rvsharing",
        "description": "The tool computes the probability that a rare variant is shared by related subjects, given that the variant was observed in any of them.",
        "homepage": "http://www.crulrg.ulaval.ca/pages_perso_chercheurs/bureau_a/software.html",
        "name": "RVsharing"
    }
}