{
    "additionDate": "2019-11-14T19:35:45Z",
    "biotoolsCURIE": "biotools:SuAVE",
    "biotoolsID": "SuAVE",
    "confidence_flag": "tool",
    "description": "A Tool for Analyzing Curvature-Dependent Properties in Chemical Interfaces | SuAVE: Surface Assessment Via grid Evaluation",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Surface rendering",
                    "uri": "http://edamontology.org/operation_1816"
                }
            ]
        }
    ],
    "homepage": "http://www.biomatsite.net/suave-software",
    "lastUpdate": "2020-12-27T11:54:10Z",
    "name": "SuAVE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00569",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Curvature is an intrinsic feature of biological membranes underlying vital cellular processes such as endocytosis, membrane fusion-fission, trafficking, and remodeling. The continuous expansion of the spatiotemporal scales accessible to computational simulations nowadays makes possible quasi-atomistic molecular dynamics simulations of these processes. In despite of that, computation of the shapes and curvatures associated with the dynamics of biological membranes remains challenging. For this reason, the effect of curvature is often neglected in the analysis of quantities essential for the accurate description of membrane properties (e.g., area and volume per lipid, density profiles, membrane thickness). We propose an algorithm for surface assessment via grid evaluation (SuAVE) that relies on the application of a radial base function to interpolate points scattered across an interface of any shape. This enables the representation of the chemical interface as fully differentiable so that related geometrical properties can be calculated through the straightforward employment of well-established differential geometry techniques. Hence, the effect of different types or degrees of curvature can be accurately taken into account in the calculations of structural properties of any interfaces regardless of chemical composition, asymmetry, and level of atom coarseness. The main functionalities implemented in SuAVE are featured for a number of tetraacylated and hexaacylated Lipid-A membranes of distinct curvatures and a surfactant micelle. We show that the properties calculated for moderately to highly curved membranes differ significantly between curvature-dependent and -independent algorithms. The SuAVE software is freely available from www.biomatsite.net/suave-software.",
                "authors": [
                    {
                        "name": "Coutinho K."
                    },
                    {
                        "name": "Lins R.D."
                    },
                    {
                        "name": "Pontes F.J.S."
                    },
                    {
                        "name": "Santos D.E.S."
                    },
                    {
                        "name": "Soares T.A."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "SuAVE: A Tool for Analyzing Curvature-Dependent Properties in Chemical Interfaces"
            },
            "pmid": "31508962"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Neutron diffraction",
            "uri": "http://edamontology.org/topic_3448"
        }
    ],
    "validated": 1
}
