{
    "additionDate": "2015-07-31T13:13:23Z",
    "biotoolsCURIE": "biotools:aspic",
    "biotoolsID": "aspic",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bonizzoni@disco.unimib.it",
            "name": "Paola Bonizzoni",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "rizzi@disco.unimib.it",
            "name": "Raffaella Rizzi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-BICOCCA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Predicts the gene structure by aligning ESTs against a genomic region.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://algolab.eu/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "http://aspic.algolab.eu",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "maturity": "Mature",
    "name": "ASPic",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-ITA-BICOCCA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-6-244",
            "metadata": {
                "abstract": "Background: Currently available methods to predict splice sites are mainly based on the independent and progressive alignment of transcript data (mostly ESTs) to the genomic sequence. Apart from often being computationally expensive, this approach is vulnerable to several problems - hence the need to develop novel strategies. Results: We propose a method, based on a novel multiple genome-EST alignment algorithm, for the detection of splice sites. To avoid limitations of splice sites prediction (mainly, over-predictions) due to independent single EST alignments to the genomic sequence our approach performs a multiple alignment of transcript data to the genomic sequence based on the combined analysis of all available data. We recast the problem of predicting constitutive and alternative splicing as an optimization problem, where the optimal multiple transcript alignment minimizes the number of exons and hence of splice site observations. We have implemented a splice site predictor based on this algorithm in the software tool ASPIC (Alternative Splicing PredICtion). It is distinguished from other methods based on BLAT-like tools by the incorporation of entirely new ad hoc procedures for accurate and computationally efficient transcript alignment and adopts dynamic programming for the refinement of intron boundaries. ASPIC also provides the minimal set of non-mergeable transcript isoforms compatible with the detected splicing events. The ASPIC web resource is dynamically interconnected with the Ensembl and Unigene databases and also implements in upload facility. Conclusion: Extensive bench marking shows that ASPIC outperforms other existing methods in the detection of novel splicing isoforms and in the minimization of over-predictions. ASPIC also requires a lower computation time for processing a single gene and an EST cluster. The ASPIC web resource is available at http://aspic.algo.disco.unimib.it/ aspic-devel/. © 2005 Bonizzoni et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bonizzoni P."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Rizzi R."
                    }
                ],
                "citationCount": 30,
                "date": "2005-10-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ASPIC: A novel method to predict the exon-intron structure of a gene that is optimally compatible to a set of transcript sequences"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
