{
    "additionDate": "2017-08-03T18:51:03Z",
    "biotoolsCURIE": "biotools:metagun",
    "biotoolsID": "metagun",
    "credit": [
        {
            "email": "liuyc@ctb.pku.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cqb.pku.edu.cn/ZhuLab/"
        }
    ],
    "description": "Novel gene prediction method for metagenomic fragments based on a machine learning approach of SVM.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cqb.pku.edu.cn/ZhuLab/MetaGUN/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://cqb.pku.edu.cn/ZhuLab/MetaGUN/index.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/metagun-gene-prediction-in-metagenomic-fragments-based-on-the-svm-algorithm.html"
        }
    ],
    "name": "MetaGUN",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Metagenomic sequencing is becoming a powerful technology for exploring micro-ogranisms from various environments, such as human body, without isolation and cultivation. Accurately identifying genes from metagenomic fragments is one of the most fundamental issues.Results: In this article, we present a novel gene prediction method named MetaGUN for metagenomic fragments based on a machine learning approach of SVM. It implements in a three-stage strategy to predict genes. Firstly, it classifies input fragments into phylogenetic groups by a k-mer based sequence binning method. Then, protein-coding sequences are identified for each group independently with SVM classifiers that integrate entropy density profiles (EDP) of codon usage, translation initiation site (TIS) scores and open reading frame (ORF) length as input patterns. Finally, the TISs are adjusted by employing a modified version of MetaTISA. To identify protein-coding sequences, MetaGun builds the universal module and the novel module. The former is based on a set of representative species, while the latter is designed to find potential functionary DNA sequences with conserved domains.Conclusions: Comparisons on artificial shotgun fragments with multiple current metagenomic gene finders show that MetaGUN predicts better results on both 3' and 5' ends of genes with fragments of various lengths. Especially, it makes the most reliable predictions among these methods. As an application, MetaGUN was used to predict genes for two samples of human gut microbiome. It identifies thousands of additional genes with significant evidences. Further analysis indicates that MetaGUN tends to predict more potential novel genes than other current metagenomic gene finders. © 2013 Liu et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Hu G."
                    },
                    {
                        "name": "Zhu H."
                    }
                ],
                "citationCount": 46,
                "date": "2013-04-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Gene prediction in metagenomic fragments based on the SVM algorithm"
            },
            "pmid": "23735199"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}