{
    "additionDate": "2023-01-25T10:13:57.511222Z",
    "biotoolsCURIE": "biotools:acinetobase",
    "biotoolsID": "acinetobase",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "charles.vanderhenst@vub.vib.be",
            "name": "Charles Van der Henst",
            "typeEntity": "Person"
        }
    ],
    "description": "A database and repository of Acinetobacter strains",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://acinetobase.vib.be/",
    "lastUpdate": "2023-01-25T10:13:57.513756Z",
    "license": "GPL-3.0",
    "name": "Acinetobase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC099",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press.Acinetobacter baumannii is one of the most problematic nosocomial pathogens that can efficiently thrive within hospital settings, mainly due to resistances toward antibiotics, desiccation, disinfectants, human serum and oxidative stress. Recently, increased resistance against last-resort antibiotics earns this bacterium the highest priority concern classified by the Centers for Disease Control and Prevention and the World Health Organization. An obvious hallmark of this bacterium is the high heterogeneity observed among A. baumannii isolates, with a limited core genome. This feature complexifies the study of A. baumannii bacteria as an entity, subsequently reflected in a diversity of phenotypes of not only antimicrobial and environmental resistance but also virulence. A high degree of genome plasticity, along with the use of a limited subset of established strains, can lead to strain-specific observations, decreasing the global understanding of this pathogenic agent. Phenotypic variability of A. baumannii strains is easily observable such as with the macrocolony morphologies, in vitro and in vivo virulence, natural competence level, production of different capsular polysaccharide structures and cellular densities. Some strains encode an extensive amount of virulence factors, while others, including the established strains, lack several key ones. The lack/excess of genes or specific physiological processes might interfere with in vivo and in vitro experiments, thus providing a limited impact on the global understanding of Acinetobacter bacteria. As an answer to the high heterogeneity among A. baumannii strains, we propose a first comprehensive database that includes the bacterial strains and the associated phenotypic and genetic data. This new repository, freely accessible to the entire scientific community, allows selecting the best bacterial isolate(s) related to any biological question, using an efficient and fast exchange platform. Database URL: https://acinetobase.vib.be/",
                "authors": [
                    {
                        "name": "Botzki A."
                    },
                    {
                        "name": "Collier J."
                    },
                    {
                        "name": "Valcek A."
                    },
                    {
                        "name": "Van Der Henst C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Acinetobase: The comprehensive database and repository of Acinetobacter strains"
            },
            "pmid": "36412325"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
