{"credit":[],"function":[{"operation":[{"term":"Gene expression profile clustering","uri":"http://edamontology.org/operation_0313"},{"term":"Clustering","uri":"http://edamontology.org/operation_3432"},{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"Ab initio structure prediction","uri":"http://edamontology.org/operation_0476"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"}]},"publication":[{"abstract":"We present PEACE, a stand-alone tool for high-throughput ab initio clustering of transcript fragment sequences produced by Next Generation or Sanger Sequencing technologies. It is freely avail-able from www.peace-tools.org. Installed and managed through a downloadable user-friendly graphical user interface (GUI), PEACE can process large data sets of transcript fragments of length 50 bases or greater, grouping the fragments by gene associations with a sensitivity comparable to leading clustering tools. Once clustered, the user can employ the GUI's analysis functions, facilitating the easy collection of statistics and allowing them to single out specific clusters for more comprehensive study or assembly. Using a novel minimum spanning tree-based clustering method, PEACE is the equal of leading tools in the literature, with an interface making it accessible to any user. It produces results of quality virtually identical to those of the WCD tool when applied to Sanger sequences, sig-nificantly improved results over WCD and TGICL when applied to the products of Next Generation Sequencing Technology and significantly improved results over Cap3 in both cases. In short, PEACE provides an intuitive GUI and a feature-rich, parallel clustering engine that proves to be a valuable addition to the leading cDNA clustering tools. © The Author(s) 2010. Published by Oxford University Press.","authors":["Rao D.M.","Moler J.C.","Ozden M.","Zhang Y.","Liang C.","Karro J.E."],"cit_count":6,"journal":"Nucleic Acids Research","pmid":"20522511","title":"PEACE: Parallel Environment for Assembly and Clustering of Gene Expression","year":"2010-06-03"}],"summary":{"biotoolsCURIE":"biotools:peace","biotoolsID":"peace","description":"Web tool that performs high-throughput ab initio clustering of transcript fragment sequences from next-generation sequencing platforms.","homepage":"http://www.peace-tools.org","name":"PEACE"}}