{
    "additionDate": "2022-08-15T14:29:44.465150Z",
    "biotoolsCURIE": "biotools:deepm5c",
    "biotoolsID": "deepm5c",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hdeng2@tulane.edu",
            "name": "Hong-Wen Deng"
        },
        {
            "email": "mhasan1@tulane.edu",
            "name": "Md Mehedi Hasan"
        }
    ],
    "description": "A deep-learning-based hybrid framework for identifying human RNA N5-methylcytosine sites using a stacking strategy.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=35526094",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-15T14:29:44.467780Z",
    "license": "Not licensed",
    "name": "Deepm5C",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.YMTHE.2022.05.001",
            "metadata": {
                "abstract": "© 2022 The American Society of Gene and Cell TherapyAs one of the most prevalent post-transcriptional epigenetic modifications, N5-methylcytosine (m5C) plays an essential role in various cellular processes and disease pathogenesis. Therefore, it is important accurately identify m5C modifications in order to gain a deeper understanding of cellular processes and other possible functional mechanisms. Although a few computational methods have been proposed, their respective models have been developed using small training datasets. Hence, their practical application is quite limited in genome-wide detection. To overcome the existing limitations, we propose Deepm5C, a bioinformatics method for identifying RNA m5C sites throughout the human genome. To develop Deepm5C, we constructed a novel benchmarking dataset and investigated a mixture of three conventional feature-encoding algorithms and a feature derived from word-embedding approaches. Afterward, four variants of deep-learning classifiers and four commonly used conventional classifiers were employed and trained with the four encodings, ultimately obtaining 32 baseline models. A stacking strategy is effectively utilized by integrating the predicted output of the optimal baseline models and trained with a one-dimensional (1D) convolutional neural network. As a result, the Deepm5C predictor achieved excellent performance during cross-validation with a Matthews correlation coefficient and an accuracy of 0.697 and 0.855, respectively. The corresponding metrics during the independent test were 0.691 and 0.852, respectively. Overall, Deepm5C achieved a more accurate and stable performance than the baseline models and significantly outperformed the existing predictors, demonstrating the effectiveness of our proposed hybrid framework. Furthermore, Deepm5C is expected to assist community-wide efforts in identifying putative m5Cs and to formulate the novel testable biological hypothesis.",
                "authors": [
                    {
                        "name": "Alam M.A."
                    },
                    {
                        "name": "Cho J.Y."
                    },
                    {
                        "name": "Deng H.-W."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Kurata H."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Tsukiyama S."
                    }
                ],
                "date": "2022-08-03T00:00:00Z",
                "journal": "Molecular Therapy",
                "title": "Deepm5C: A deep-learning-based hybrid framework for identifying human RNA N5-methylcytosine sites using a stacking strategy"
            },
            "pmid": "35526094"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
