{
    "accessibility": "Open access",
    "additionDate": "2022-06-13T15:30:32.486842Z",
    "biotoolsCURIE": "biotools:genesis_silico",
    "biotoolsID": "genesis_silico",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tim.claridge@chem.ox.ac.uk",
            "name": "Tim D. W. Claridge",
            "orcidid": "https://orcid.org/0000-0001-5583-6460",
            "typeEntity": "Person"
        }
    ],
    "description": "GENESIS (GENEration of Supersequences In Silico) systematically generates pulse programs for arbitrary NOAH supersequences compatible with Bruker spectrometers.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://nmr-genesis.co.uk",
    "language": [
        "C"
    ],
    "lastUpdate": "2022-06-13T15:30:32.490076Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yongrenjie/genesis"
        }
    ],
    "name": "GENESIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.1C04964",
            "metadata": {
                "abstract": "© 2022 American Chemical SocietyNMR supersequences allow multiple 2D NMR data sets to be acquired in greatly reduced experiment durations through tailored detection of NMR responses within concatenated modules. In NOAH (NMR by Ordered Acquisition using 1H detection) experiments, up to five modules can be combined (or even more when parallel modules are employed), which in theory leads to thousands of plausible supersequences. However, constructing a pulse program for a supersequence is highly time-consuming, requires specialized knowledge, and is error-prone due to its complexity; this has prevented the true potential of the NOAH concept from being fully realized. We introduce here an online tool named GENESIS (GENEration of Supersequences In Silico), available via https://nmr-genesis.co.uk, which systematically generates pulse programs for arbitrary NOAH supersequences compatible with Bruker spectrometers. The GENESIS website provides a unified “one-stop” interface where users may obtain customized supersequences for specific applications, together with all associated acquisition and processing scripts, as well as detailed instructions for running NOAH experiments. Furthermore, it enables the rapid dissemination of new developments in NOAH sequences, such as new modules or improvements to existing modules. Here, we present several such enhancements, including options for solvent suppression, new modules based on pure shift NMR, and improved artifact reduction in HMBC and HMQC modules.",
                "authors": [
                    {
                        "name": "Claridge T.D.W."
                    },
                    {
                        "name": "Kupce E."
                    },
                    {
                        "name": "Yong J.R.J."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Modular Pulse Program Generation for NMR Supersequences"
            },
            "pmcid": "PMC9082496",
            "pmid": "35050622"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
