{
    "additionDate": "2020-01-14T20:15:20Z",
    "biotoolsCURIE": "biotools:Topological_Tumor_Graphs",
    "biotoolsID": "Topological_Tumor_Graphs",
    "confidence_flag": "tool",
    "description": "a graph-based spatial model to infer stromal recruitment for immunosuppression in melanoma histology.\n\nTopological-tumour-graphs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Henrik86/Topological-tumour-graphs",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T16:44:28Z",
    "name": "Topological Tumor Graphs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1158/0008-5472.CAN-19-2268",
            "metadata": {
                "abstract": "© 2019 American Association for Cancer Research.Despite the advent of immunotherapy, metastatic melanoma represents an aggressive tumor type with a poor survival outcome. The successful application of immunotherapy requires in-depth understanding of the biological basis and immunosuppressive mechanisms within the tumor microenvironment. In this study, we conducted spatially explicit analyses of the stromal-immune interface across 400 melanoma hematoxylin and eosin (H&E) specimens from The Cancer Genome Atlas. A computational pathology pipeline (CRImage) was used to classify cells in the H&E specimen into stromal, immune, or cancer cells. The estimated proportions of these cell types were validated by independent measures of tumor purity, pathologists' estimate of lymphocyte density, imputed immune cell subtypes, and pathway analyses. Spatial interactions between these cell types were computed using a graph-based algorithm (topological tumor graphs, TTG). This approach identified two stromal features, namely stromal clustering and stromal barrier, which represented the melanoma stromal microenvironment. Tumors with increased stromal clustering and barrier were associated with reduced intratumoral lymphocyte distribution and poor overall survival independent of existing prognostic factors. To explore the genomic basis of these TTG-derived stromal phenotypes, we used a deep learning approach integrating genomic (copy number) and transcriptomic data, thereby inferring a compressed representation of copy number-driven alterations in gene expression. This integrative analysis revealed that tumors with high stromal clustering and barrier had reduced expression of pathways involved in naÏve CD4 signaling, MAPK, and PI3K signaling. Taken together, our findings support the immunosuppressive role of stromal cells and T-cell exclusion within the vicinity of melanoma cells. Significance: Computational histology-based stromal phenotypes within the tumor microenvironment are significantly associated with prognosis and immune exclusion in melanoma.",
                "authors": [
                    {
                        "name": "Failmezger H."
                    },
                    {
                        "name": "Muralidhar S."
                    },
                    {
                        "name": "Rullan A."
                    },
                    {
                        "name": "de Andrea C.E."
                    },
                    {
                        "name": "Sahai E."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Cancer Research",
                "title": "Topological tumor graphs: A graph-based spatial model to infer stromal recruitment for immunosuppression in melanoma histology a C"
            },
            "pmid": "31874858"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}