{
    "additionDate": "2018-09-11T13:06:29Z",
    "biotoolsCURIE": "biotools:mzvar",
    "biotoolsID": "mzvar",
    "collectionID": [
        "Proteomics"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Thibault.robin@unige.ch",
            "name": "Thibault Robin",
            "orcidid": "https://orcid.org/0000-0001-6548-709X",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Primary contact"
            ]
        },
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "url": "https://www.sib.swiss/"
        }
    ],
    "description": "MzVar is a Java tool allowing the compilation of customized variant protein and peptide databases in the FASTA format for database searching of MS/MS data, using a VCF file as variant input and a FASTA file as transcript input. The tool is compatible with transcript sequences retrieved from either Ensembl or the UCSC Table Browser.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid features",
                        "uri": "http://edamontology.org/data_1276"
                    },
                    "format": [
                        {
                            "term": "VCF",
                            "uri": "http://edamontology.org/format_3016"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence set (nucleic acid)",
                        "uri": "http://edamontology.org/data_1234"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/sib-pig/mzvar-public/src/master/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-25T14:08:46.731404Z",
    "maturity": "Mature",
    "name": "MzVar",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "trobin",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.8b00392",
            "metadata": {
                "abstract": "The practice of data sharing in the proteomics field took off and quickly spread in recent years as a result of collective effort. Nowadays, most journal editors mandate the submission of the original raw mass spectra to one of the databases of the ProteomeXchange consortium. With the exception of large institutional initiatives such as PeptideAtlas or the GPMDB, few new studies are however based on the reanalysis of mass spectrometry data. A wealth of information is thus left unexploited in public databases and repositories. Here, we present the large-scale reanalysis of 41 publicly available data sets corresponding to experiments carried out on the HeLa cancer cell line using a custom workflow. In addition to the search of new post-translational modification sites and \"missing proteins\", our main goal is to identify single amino acid variants and evaluate their impact on protein expression and stability through the spectral counting quantification approach. The X!Tandem software was selected to perform the search of a total of 56363701 tandem mass spectra against a customized variant protein database, compiled by the application of the in-house MzVar tool on HeLa-specific somatic and genomic variants retrieved from the COSMIC cell line project. After filtering the resulting identifications with a 1% FDR threshold computed at the protein level, 49466 unique peptides were identified in 7266 protein entries, allowing the validation of 5576 protein entries in accordance with the HPP guidelines version 2.1. A new \"missing protein\" was observed (FRAT2, NX-O75474, chromosome 10), and 189 new phosphorylation and 392 new protein N-terminal acetylation sites could be identified. Twenty-four variant peptides were also identified, corresponding to 21 variants in 21 proteins. For three of the nine heterozygous cases where both the variant peptide and its wild-type counterpart were detected, the application of a two-tailed sign test showed a significant difference in the abundance of the two peptide versions.",
                "authors": [
                    {
                        "name": "Bairoch A."
                    },
                    {
                        "name": "Lane L."
                    },
                    {
                        "name": "Lisacek F."
                    },
                    {
                        "name": "Muller M."
                    },
                    {
                        "name": "Robin T."
                    }
                ],
                "citationCount": 16,
                "date": "2018-12-07T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Large-Scale Reanalysis of Publicly Available HeLa Cell Proteomics Data in the Context of the Human Proteome Project"
            },
            "pmid": "30175587"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
