{
    "additionDate": "2019-11-14T18:10:12Z",
    "biotoolsCURIE": "biotools:CyTargetLinker",
    "biotoolsID": "CyTargetLinker",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "martina.kutmon@maastrichtuniversity.nl",
            "name": "Martina Kutmon",
            "orcidid": "https://orcid.org/0000-0002-7699-8191",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'CyTargetLinker app update' | A flexible solution for network extension in Cytoscape | **Now released with Cytoscape automation feature** The CyTargetLinker app extends biological networks with regulatory interactions, for example miRNA-target, TF-target or drug-target interactions | CyTargetLinker website and tutorials | CyTargetLinker - Extend your biological networks in Cytoscape",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://cytargetlinker.github.io/",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:10:12Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://apps.cytoscape.org/apps/cytargetlinker"
        }
    ],
    "name": "CyTargetLinker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.14613.2",
            "metadata": {
                "abstract": "© 2019 Kutmon M et al.Here, we present an update of the open-source CyTargetLinker app for Cytoscape (http://apps.cytoscape.org/apps/cytargetlinker) that introduces new automation features. CyTargetLinker provides a simple interface to extend networks with links to relevant data and/or knowledge extracted from so-called linksets. The linksets are provided on the CyTargetLinker website (https://cytargetlinker.github.io/) or can be custom-made for specific use cases. The new automation feature enables users to programmatically execute the app’s functionality in Cytoscape (command line tool) and with external tools (e.g. R, Jupyter, Python, etc). This allows users to share their analysis workflows and therefore increase repeatability and reproducibility. Three use cases demonstrate automated workflows, combinations with other Cytoscape apps and core Cytoscape functionality. We first extend a protein-protein interaction network created with the stringApp, with compound-target interactions and disease-gene annotations. In the second use case, we created a workflow to load differentially expressed genes from an experimental dataset and extend it with gene-pathway associations. Lastly, we chose an example outside the biological domain and used CyTargetLinker to create an author-article-journal network for the five authors of this manuscript using a two-step extension mechanism. With 400 downloads per month in the last year and nearly 20,000 downloads in total, CyTargetLinker shows the adoption and relevance of the app in the field of network biology. In August 2019, the original publication was cited in 83 articles demonstrating the applicability in biomedical research.",
                "authors": [
                    {
                        "name": "Kutmon M."
                    },
                    {
                        "name": "Ehrhart F."
                    },
                    {
                        "name": "Willighagen E.L."
                    },
                    {
                        "name": "Evelo C.T."
                    },
                    {
                        "name": "Coort S.L."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Cytargetlinker app update: A flexible solution for network extension in cytoscape"
            },
            "pmcid": "PMC6707396",
            "pmid": "31489175"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ]
}