{
    "additionDate": "2019-11-14T18:10:12Z",
    "biotoolsCURIE": "biotools:CyTargetLinker",
    "biotoolsID": "CyTargetLinker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "martina.kutmon@maastrichtuniversity.nl",
            "name": "Martina Kutmon",
            "orcidid": "https://orcid.org/0000-0002-7699-8191",
            "typeEntity": "Person"
        }
    ],
    "description": "A flexible solution for network extension in Cytoscape | The CyTargetLinker app extends biological networks with regulatory interactions, for example miRNA-target, TF-target or drug-target interactions | CyTargetLinker website and tutorials | CyTargetLinker - Extend your biological networks in Cytoscape",
    "documentation": [
        {
            "type": [
                "Citation instructions"
            ],
            "url": "https://cytargetlinker.github.io/pages/citation"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://cytargetlinker.github.io/pages/docs"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://cytargetlinker.github.io/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-17T12:02:28Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://apps.cytoscape.org/apps/cytargetlinker"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/CyTargetLinker/cytargetlinker/issues"
        }
    ],
    "name": "CyTargetLinker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.14613.2",
            "metadata": {
                "abstract": "© 2019 Kutmon M et al.Here, we present an update of the open-source CyTargetLinker app for Cytoscape (http://apps.cytoscape.org/apps/cytargetlinker) that introduces new automation features. CyTargetLinker provides a simple interface to extend networks with links to relevant data and/or knowledge extracted from so-called linksets. The linksets are provided on the CyTargetLinker website (https://cytargetlinker.github.io/) or can be custom-made for specific use cases. The new automation feature enables users to programmatically execute the app’s functionality in Cytoscape (command line tool) and with external tools (e.g. R, Jupyter, Python, etc). This allows users to share their analysis workflows and therefore increase repeatability and reproducibility. Three use cases demonstrate automated workflows, combinations with other Cytoscape apps and core Cytoscape functionality. We first extend a protein-protein interaction network created with the stringApp, with compound-target interactions and disease-gene annotations. In the second use case, we created a workflow to load differentially expressed genes from an experimental dataset and extend it with gene-pathway associations. Lastly, we chose an example outside the biological domain and used CyTargetLinker to create an author-article-journal network for the five authors of this manuscript using a two-step extension mechanism. With 400 downloads per month in the last year and nearly 20,000 downloads in total, CyTargetLinker shows the adoption and relevance of the app in the field of network biology. In August 2019, the original publication was cited in 83 articles demonstrating the applicability in biomedical research.",
                "authors": [
                    {
                        "name": "Kutmon M."
                    },
                    {
                        "name": "Ehrhart F."
                    },
                    {
                        "name": "Willighagen E.L."
                    },
                    {
                        "name": "Evelo C.T."
                    },
                    {
                        "name": "Coort S.L."
                    }
                ],
                "citationCount": 8,
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Cytargetlinker app update: A flexible solution for network extension in cytoscape"
            },
            "pmcid": "PMC6707396",
            "pmid": "31489175"
        },
        {
            "doi": "10.1371/journal.pone.0082160",
            "metadata": {
                "abstract": "Introduction: The high complexity and dynamic nature of the regulation of gene expression, protein synthesis, and protein activity pose a challenge to fully understand the cellular machinery. By deciphering the role of important players, including transcription factors, microRNAs, or small molecules, a better understanding of key regulatory processes can be obtained. Various databases contain information on the interactions of regulators with their targets for different organisms, data recently being extended with the results of the ENCODE (Encyclopedia of DNA Elements) project. A systems biology approach integrating our understanding on different regulators is essential in interpreting the regulation of molecular biological processes. Implementation: We developed CyTargetLinker (http://projects.bigcat.unimaas.nl/cytargetlinker), a Cytoscape app, for integrating regulatory interactions in network analysis. Recently we released CyTargetLinker as one of the first apps for Cytoscape 3. It provides a user-friendly and flexible interface to extend biological networks with regulatory interactions, such as microRNA-target, transcription factor-target and/or drug-target. Importantly, CyTargetLinker employs identifier mapping to combine various interaction data resources that use different types of identifiers. Results: Three case studies demonstrate the strength and broad applicability of CyTargetLinker, (i) extending a mouse molecular interaction network, containing genes linked to diabetes mellitus, with validated and predicted microRNAs, (ii) enriching a molecular interaction network, containing DNA repair genes, with ENCODE transcription factor and (iii) building a regulatory meta-network in which a biological process is extended with information on transcription factor, microRNA and drug regulation. Conclusions: CyTargetLinker provides a simple and extensible framework for biologists and bioinformaticians to integrate different regulatory interactions into their network analysis approaches. Visualization options enable biological interpretation of complex regulatory networks in a graphical way. Importantly the incorporation of our tool into the Cytoscape framework allows the application of CyTargetLinker in combination with a wide variety of other apps for state-ofthe- art network analysis. Copyright: © 2013 Kutmon et al.",
                "authors": [
                    {
                        "name": "Kutmon M."
                    },
                    {
                        "name": "Kelder T."
                    },
                    {
                        "name": "Mandaviya P."
                    },
                    {
                        "name": "Evelo C.T.A."
                    },
                    {
                        "name": "Coort S.L."
                    }
                ],
                "citationCount": 79,
                "date": "2013-12-05T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Cytargetlinker: A Cytoscape app to integrate regulatory interactions in network analysis"
            },
            "pmcid": "PMC3855388",
            "pmid": "24340000"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}