{"credit":[],"labels":{"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"Chemistry","uri":"http://edamontology.org/topic_3314"}]},"publication":[{"abstract":"© 2019 SETACDown-the-drain exposure models provide a valuable tool for estimating environmental exposure to substances which are treated and discharged by municipal wastewater-treatment plants (WWTPs). Microplastics may enter WWTPs from consumer activities and disposal. An exposure framework was developed using the iSTREEM® model, which estimates spatially explicit concentrations of substances in riverine systems across the United States and portions of Ontario, Canada. One hundred simulations covering a range of WWTP removal and instream loss rates (proxy for net sedimentation) were incorporated into a Web-based visualization tool for user exploration of relative concentrations across simulations. Surface water concentrations specific to user-supplied tonnage were examined via interactive heat maps and cumulative distributions. Exploring the spatial aspect of iSTREEM results showed that modeling 90% WWTP removal and no instream loss resulted in 8.5% of the mass entering WWTPs discharged to marine estuaries (7.4%) or Great Lakes (1.1%) environments, with the remainder of the mass discharged (1.5%) in inland sinks or exiting the United States via rivers. Modeling an example instream loss of k = 0.1 d–1 (i.e., half-life = 7 d), terminal river segments contained 3.3% of influent mass (2.3% marine estuaries, 1.0% Great Lakes). Varying instream loss rates had substantial impacts on the total mass exported. The Web-based tool provided a user-based mechanism to visualize relative freshwater concentrations of microplastics across a large geographic area by varying simplified particle fate assumptions. Environ Toxicol Chem 2019;39:210–219. © 2019 SETAC.","authors":["Holmes C.M.","Dyer S.D.","Vamshi R.","Maples-Reynolds N.","Davies I.A."],"cit_count":0,"doi":"10.1002/ETC.4610","journal":"Environmental Toxicology and Chemistry","pmid":"31597209","title":"A National-Scale Framework for Visualizing Riverine Concentrations of Microplastics Released from Municipal Wastewater Treatment Incorporating Generalized Instream Losses","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:iSTREEM","biotoolsID":"iSTREEM","description":"A National-Scale Framework for Visualizing Riverine Concentrations of Microplastics Released from Municipal Wastewater Treatment Incorporating Generalized Instream Losses.\n\niSTREEM® is an in-stream environmental exposure model which predicts the concentration of a chemical used in \"down-the-drain\" products. It is a tool to promote product stewardship and regulatory compliance for chemical suppliers and manufacturers of formulated products of all sizes across commodity groups.\n\nPredicted environmental concentrations are calculated for the continental United States and several watersheds in Canada:.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'instream', 'microplastics'","homepage":"https://www.istreem.org/","name":"iSTREEM"}}