{
    "additionDate": "2021-01-18T10:28:17Z",
    "biotoolsCURIE": "biotools:ksp",
    "biotoolsID": "ksp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guojunsdu@gmail.com",
            "name": "Guojun Li",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated method for predicting catalyzing kinases of phosphorylation sites in proteins.\n\nKSP is a method for predicting kinase annotations for phosphorylation sites by effective integration of.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/kspscore/files/",
    "lastUpdate": "2021-02-12T10:59:47Z",
    "name": "KSP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-06895-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Protein phosphorylation by kinases plays crucial roles in various biological processes including signal transduction and tumorigenesis, thus a better understanding of protein phosphorylation events in cells is fundamental for studying protein functions and designing drugs to treat diseases caused by the malfunction of phosphorylation. Although a large number of phosphorylation sites in proteins have been identified using high-throughput phosphoproteomic technologies, their specific catalyzing kinases remain largely unknown. Therefore, computational methods are urgently needed to predict the kinases that catalyze the phosphorylation of these sites. Results: We developed KSP, a new algorithm for predicting catalyzing kinases for experimentally identified phosphorylation sites in human proteins. KSP constructs a network based on known protein-protein interactions and kinase-substrate relationships. Based on the network, it computes an affinity score between a phosphorylation site and kinases, and returns the top-ranked kinases of the score as candidate catalyzing kinases. When tested on known kinase-substrate pairs, KSP outperforms existing methods including NetworKIN, iGPS, and PKIS. Conclusions: We developed a novel accurate tool for predicting catalyzing kinases of known phosphorylation sites. It can work as a complementary network approach for sequence-based phosphorylation site predictors.",
                "authors": [
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Su Z."
                    }
                ],
                "date": "2020-08-04T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "KSP: An integrated method for predicting catalyzing kinases of phosphorylation sites in proteins"
            },
            "pmcid": "PMC7646512",
            "pmid": "32753030"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}