{
    "accessibility": "Open access",
    "additionDate": "2021-04-28T15:37:29Z",
    "biotoolsCURIE": "biotools:ms1searchpy",
    "biotoolsID": "ms1searchpy",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "markmipt@gmail.com",
            "name": "Mark Ivanov",
            "orcidid": "https://orcid.org/0000-0003-4762-2846"
        }
    ],
    "description": "DirectMS1 proteomics search engine for LC-MS1 spectra",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/markmipt/ms1searchpy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-28T15:38:09Z",
    "license": "Apache-2.0",
    "name": "ms1searchpy",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "markmipt",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.0c00863",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Proteome-wide analyses rely on tandem mass spectrometry and the extensive separation of proteolytic mixtures. This imposes considerable instrumental time consumption, which is one of the main obstacles in the broader acceptance of proteomics in biomedical and clinical research. Recently, we presented a fast proteomic method termed DirectMS1 based on ultrashort LC gradients as well as MS1-only mass spectra acquisition and data processing. The method allows significant reduction of the proteome-wide analysis time to a few minutes at the depth of quantitative proteome coverage of 1000 proteins at 1% false discovery rate (FDR). In this work, to further increase the capabilities of the DirectMS1 method, we explored the opportunities presented by the recent progress in the machine-learning area and applied the LightGBM decision tree boosting algorithm to the scoring of peptide feature matches when processing MS1 spectra. Furthermore, we integrated the peptide feature identification algorithm of DirectMS1 with the recently introduced peptide retention time prediction utility, DeepLC. Additional approaches to improve the performance of the DirectMS1 method are discussed and demonstrated, such as using FAIMS for gas-phase ion separation. As a result of all improvements to DirectMS1, we succeeded in identifying more than 2000 proteins at 1% FDR from the HeLa cell line in a 5 min gradient LC-FAIMS/MS1 analysis. The data sets generated and analyzed during the current study have been deposited to the ProteomeXchange Consortium via the PRIDE partner repository with the data set identifier PXD023977.",
                "authors": [
                    {
                        "name": "Ivanov M.V."
                    },
                    {
                        "name": "Bubis J.A."
                    },
                    {
                        "name": "Gorshkov V."
                    },
                    {
                        "name": "Abdrakhimov D.A."
                    },
                    {
                        "name": "Kjeldsen F."
                    },
                    {
                        "name": "Gorshkov M.V."
                    }
                ],
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Boosting MS1-only Proteomics with Machine Learning Allows 2000 Protein Identifications in Single-Shot Human Proteome Analysis Using 5 min HPLC Gradient"
            }
        },
        {
            "doi": "10.1021/acs.analchem.9b05095",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Proteome characterization relies heavily on tandem mass spectrometry (MS/MS) and is thus associated with instrumentation complexity, lengthy analysis time, and limited duty cycle. It was always tempting to implement approaches that do not require MS/MS, yet they were constantly failing to achieve a meaningful depth of quantitative proteome coverage within short experimental times, which is particularly important for clinical or biomarker-discovery applications. Here, we report on the first successful attempt to develop a truly MS/MS-free method, DirectMS1, for bottom-up proteomics. The method is compared with the standard MS/MS-based data-dependent acquisition approach for proteome-wide analysis using 5 min LC gradients. Specifically, we demonstrate identification of 1 »000 protein groups for a standard HeLa cell line digest. The amount of loaded sample was varied in a range from 1 to 500 ng, and the method demonstrated 10-fold higher sensitivity. Combined with the recently introduced Diffacto approach for relative protein quantification, DirectMS1 outperforms most popular MS/MS-based label-free quantitation approaches because of significantly higher protein sequence coverage.",
                "authors": [
                    {
                        "name": "Ivanov M.V."
                    },
                    {
                        "name": "Bubis J.A."
                    },
                    {
                        "name": "Gorshkov V."
                    },
                    {
                        "name": "Tarasova I.A."
                    },
                    {
                        "name": "Levitsky L.I."
                    },
                    {
                        "name": "Lobas A.A."
                    },
                    {
                        "name": "Solovyeva E.M."
                    },
                    {
                        "name": "Pridatchenko M.L."
                    },
                    {
                        "name": "Kjeldsen F."
                    },
                    {
                        "name": "Gorshkov M.V."
                    }
                ],
                "citationCount": 7,
                "date": "2020-03-17T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "DirectMS1: MS/MS-Free Identification of 1000 Proteins of Cellular Proteomes in 5 Minutes"
            }
        },
        {
            "doi": "10.1021/acs.jproteome.7b00365",
            "metadata": {
                "abstract": "© 2017 American Chemical Society.In this work, we present the results of evaluation of a workflow that employs a multienzyme digestion strategy for MS1-based protein identification in \"shotgun\" proteomic applications. In the proposed strategy, several cleavage reagents of different specificity were used for parallel digestion of the protein sample followed by MS1 and retention time (RT) based search. Proof of principle for the proposed strategy was performed using experimental data obtained for the annotated 48-protein standard. By using the developed approach, up to 90% of proteins from the standard were unambiguously identified. The approach was further applied to HeLa proteome data. For the sample of this complexity, the proposed MS1-only strategy determined correctly up to 34% of all proteins identified using standard MS/MS-based database search. It was also found that the results of MS1-only search were independent of the chromatographic gradient time in a wide range of gradients from 15-120 min. Potentially, rapid MS1-only proteome characterization can be an alternative or complementary to the MS/MS-based \"shotgun\" analyses in the studies, in which the experimental time is more important than the depth of the proteome coverage.",
                "authors": [
                    {
                        "name": "Ivanov M.V."
                    },
                    {
                        "name": "Tarasova I.A."
                    },
                    {
                        "name": "Levitsky L.I."
                    },
                    {
                        "name": "Solovyeva E.M."
                    },
                    {
                        "name": "Pridatchenko M.L."
                    },
                    {
                        "name": "Lobas A.A."
                    },
                    {
                        "name": "Bubis J.A."
                    },
                    {
                        "name": "Gorshkov M.V."
                    }
                ],
                "citationCount": 5,
                "date": "2017-11-03T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "MS/MS-Free Protein Identification in Complex Mixtures Using Multiple Enzymes with Complementary Specificity"
            }
        }
    ],
    "relation": [
        {
            "biotoolsID": "pyteomics",
            "type": "uses"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}