{
    "additionDate": "2017-03-27T07:56:18Z",
    "biotoolsCURIE": "biotools:cyclebase",
    "biotoolsID": "cyclebase",
    "credit": [
        {
            "email": "alberto.santos@cpr.ku.dk",
            "name": "Alberto Santos",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "raz@cbs.dtu.dk",
            "name": "Rasmus Wernersson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "lars.juhl.jensen@cpr.ku.dk",
            "name": "Lars Juhl Jensen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Online resource of cell-cycle-related experiments. It provides an easy-to-use web interface that facilitates visualization and download of genome-wide cell-cycle data and analysis results. Data from different experiments are normalized to a common timescale and are complimented with key cell-cycle information and derived analysis results. Included is information on cyclin-dependent kinase (CDK) substrates, predicted degradation signals and loss-of-function phenotypes from genome-wide screens.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cyclebase.org/About"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.cyclebase.org/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "Cyclebase",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Cell division involves a complex series of events orchestrated by thousands of molecules. To study this process, researchers have employed mRNA expression profiling of synchronously growing cell cultures progressing through the cell cycle. These experiments, which have been carried out in several organisms, are not easy to access, combine and evaluate. Complicating factors include variation in interdivision time between experiments and differences in relative duration of each cell-cycle phase across organisms. To address these problems, we created Cyclebase, an online resource of cell-cycle-related experiments. This database provides an easy-to-use web interface that facilitates visualization and download of genome-wide cell-cycle data and analysis results. Data from different experiments are normalized to a common timescale and are complimented with key cell-cycle information and derived analysis results. In Cyclebase version 2.0, we have updated the entire database to reflect changes to genome annotations, included information on cyclin-dependent kinase (CDK) substrates, predicted degradation signals and loss-of-function phenotypes from genome-wide screens. The web interface has been improved and provides a single, gene-centric graph summarizing the available cell-cycle experiments. Finally, key information and links to orthologous and paralogous genes are now included to further facilitate comparison of cell-cycle regulation across species. Cyclebase version 2.0 is available at http://www.cyclebase.org. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Gauthier N.P."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Wernersson R."
                    },
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Jensen T.S."
                    }
                ],
                "citationCount": 40,
                "date": "2009-11-24T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Cyclebase.org: Version 2.0, an updated comprehensive, multi-species repository of cell cycle experiments and derived analysis results"
            },
            "pmid": "19934261"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}