{
    "additionDate": "2020-01-09T18:21:08Z",
    "biotoolsCURIE": "biotools:DLITE",
    "biotoolsID": "DLITE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cdavew@alleninstitute.org",
            "name": "C. David Williams",
            "typeEntity": "Person"
        },
        {
            "email": "padmini.rangamani@eng.ucsd.edu",
            "name": "Padmini Rangamani",
            "typeEntity": "Person"
        }
    ],
    "description": "DLITE Uses Cell-Cell Interface Movement to Better Infer Cell-Cell Tensions.\n\nCell shapes and connectivities evolve over time as the colony changes shape or embryos develop. Shapes of intercellular interfaces are closely coupled with the forces resulting from actomyosin interactions, membrane tension, or cell-cell adhesions. Although it is possible to computationally infer cell-cell forces from a mechanical model of collective cell behavior, doing so for temporally evolving forces in a manner robust to digitization difficulties is challenging. Here, we introduce a method for dynamic local intercellular tension estimation (DLITE) that infers such evolution in temporal force with less sensitivity to digitization ambiguities or errors. This method builds upon previous work on single time points (cellular force-inference toolkit). We validate our method using synthetic geometries.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://dlite.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/AllenCellModeling/DLITE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-22T08:53:07Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/AllenCellModeling/DLITE/issues"
        }
    ],
    "name": "DLITE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.BPJ.2019.09.034",
            "metadata": {
                "abstract": "© 2019 Biophysical SocietyCell shapes and connectivities evolve over time as the colony changes shape or embryos develop. Shapes of intercellular interfaces are closely coupled with the forces resulting from actomyosin interactions, membrane tension, or cell-cell adhesions. Although it is possible to computationally infer cell-cell forces from a mechanical model of collective cell behavior, doing so for temporally evolving forces in a manner robust to digitization difficulties is challenging. Here, we introduce a method for dynamic local intercellular tension estimation (DLITE) that infers such evolution in temporal force with less sensitivity to digitization ambiguities or errors. This method builds upon previous work on single time points (cellular force-inference toolkit). We validate our method using synthetic geometries. DLITE's inferred cell colony tension evolutions correlate better with ground truth for these synthetic geometries as compared to tension values inferred from methods that consider each time point in isolation. We introduce cell connectivity errors, angle estimate errors, connection mislocalization, and connection topological changes to synthetic data and show that DLITE has reduced sensitivity to these conditions. Finally, we apply DLITE to time series of human-induced pluripotent stem cell colonies with endogenously expressed GFP-tagged zonulae occludentes-1. We show that DLITE offers improved stability in the inference of cell-cell tensions and supports a correlation between the dynamics of cell-cell forces and colony rearrangement.",
                "authors": [
                    {
                        "name": "Vasan R."
                    },
                    {
                        "name": "Maleckar M.M."
                    },
                    {
                        "name": "Williams C.D."
                    },
                    {
                        "name": "Rangamani P."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-05T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "DLITE Uses Cell-Cell Interface Movement to Better Infer Cell-Cell Tensions"
            },
            "pmcid": "PMC6838938",
            "pmid": "31648791"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}