{
    "additionDate": "2018-08-04T13:33:09Z",
    "biotoolsCURIE": "biotools:massmap",
    "biotoolsID": "massmap",
    "credit": [
        {
            "email": "Jiyuan.Hu@nyumc.com",
            "name": "Jiyuan Hu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A two-stage microbial association mapping framework with advanced FDR control.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/JiyuanHu/massMap/blob/master/massMap-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JiyuanHu/massMap",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-2.0",
    "name": "massMap",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s40168-018-0517-1",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: In microbiome studies, it is important to detect taxa which are associated with pathological outcomes at the lowest definable taxonomic rank, such as genus or species. Traditionally, taxa at the target rank are tested for individual association, followed by the Benjamini-Hochberg (BH) procedure to control for false discovery rate (FDR). However, this approach neglects the dependence structure among taxa and may lead to conservative results. The taxonomic tree of microbiome data represents alignment from phylum to species rank and characterizes evolutionary relationships across microbial taxa. Taxa that are closer on the tree usually have similar responses to the exposure (environment). The statistical power in microbial association tests can be enhanced by efficiently employing the prior evolutionary information via the taxonomic tree. Methods: We propose a two-stage microbial association mapping framework (massMap) which uses grouping information from the taxonomic tree to strengthen statistical power in association tests at the target rank. massMap first screens the association of taxonomic groups at a pre-selected higher taxonomic rank using a powerful microbial group test OMiAT. The method then proceeds to test the association for each candidate taxon at the target rank within the significant taxonomic groups identified in the first stage. Hierarchical BH (HBH) and selected subset testing (SST) procedures are evaluated to control the FDR for the two-stage structured tests. Results: Our simulations show that massMap incorporating OMiAT and the advanced FDR controlling methodologies largely alleviates the multiplicity issue. It is statistically more powerful than the traditional association mapping directly at the target rank while controlling the FDR at desired levels under most scenarios. In our real data analyses, massMap detects more or the same amount of associated species with smaller adjusted p values compared to the traditional method, which further illustrates the efficiency of the proposed framework. The R package of massMap is publicly available at https://sites.google.com/site/huilinli09/software and https://github.com/JiyuanHu/. Conclusions: massMap is a novel microbial association mapping framework and achieves additional efficiency by utilizing the intrinsic taxonomic structure of microbiome data.",
                "authors": [
                    {
                        "name": "Blaser M.J."
                    },
                    {
                        "name": "He L."
                    },
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Koh H."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu M."
                    }
                ],
                "citationCount": 10,
                "date": "2018-07-25T00:00:00Z",
                "journal": "Microbiome",
                "title": "A two-stage microbial association mapping framework with advanced FDR control"
            },
            "pmcid": "PMC6060480",
            "pmid": "30045760"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
