{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2018-03-05T15:06:35Z",
    "biotoolsCURIE": "biotools:simka",
    "biotoolsID": "simka",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Claire.Lemaitre@inria.fr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simka is a de novo comparative metagenomics tool. Simka represents each dataset as a k-mer spectrum and compute several classical ecological distances between them.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/GATB/simka"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://gatb.inria.fr/software/simka/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence (raw)",
                        "uri": "http://edamontology.org/data_2975"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence distance matrix generation",
                    "uri": "http://edamontology.org/operation_0289"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence distance matrix",
                        "uri": "http://edamontology.org/data_0870"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/GATB/simka",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "AGPL-3.0",
    "maturity": "Mature",
    "name": "Simka",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "olivier.collin@irisa.fr",
    "publication": [
        {
            "doi": "10.7717/peerj-cs.94",
            "metadata": {
                "abstract": "© 2016 Benoit et al. Background. Large scale metagenomic projects aim to extract biodiversity knowledge between different environmental conditions. Current methods for comparing microbial communities face important limitations. Those based on taxonomical or functional assignation rely on a small subset of the sequences that can be associated to known organisms. On the other hand, de novo methods, that compare the whole sets of sequences, either do not scale up on ambitious metagenomic projects or do not provide precise and exhaustive results. Methods. These limitations motivated the development of a new de novo metagenomic comparative method, called Simka. This method computes a large collection of standard ecological distances by replacing species counts by k-mer counts. Simka scales-up today's metagenomic projects thanks to a new parallel k-mer counting strategy on multiple datasets. Results. Experiments on public Human Microbiome Project datasets demonstrate that Simka captures the essential underlying biological structure. Simka was able to compute in a few hours both qualitative and quantitative ecological distances on hundreds of metagenomic samples (690 samples, 32 billions of reads). We also demonstrate that analyzing metagenomes at the k-mer level is highly correlated with extremely precise de novo comparison techniques which rely on all-versus-all sequences alignment strategy or which are based on taxonomic profiling.",
                "authors": [
                    {
                        "name": "Benoit G."
                    },
                    {
                        "name": "Peterlongo P."
                    },
                    {
                        "name": "Mariadassou M."
                    },
                    {
                        "name": "Drezen E."
                    },
                    {
                        "name": "Schbath S."
                    },
                    {
                        "name": "Lavenier D."
                    },
                    {
                        "name": "Lemaitre C."
                    }
                ],
                "citationCount": 9,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Multiple comparative metagenomics using multiset k-mer counting"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}