{
    "additionDate": "2017-08-03T19:06:14Z",
    "biotoolsCURIE": "biotools:ippi-esml",
    "biotoolsID": "ippi-esml",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "Ensemble classifier for identifying the interactions of proteins by incorporating their physicochemical properties and wavelet transforms into PseAAC.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/PPIEL/PPIEL_readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iPPI-Esml",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ippi-esml-identifying-interactions-of-proteins.html"
        }
    ],
    "name": "iPPI-Esml",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Elsevier Ltd.A cell contains thousands of proteins. Many important functions of cell are carried out through the proteins therein. Proteins rarely function alone. Most of their functions essential to life are associated with various types of protein-protein interactions (PPIs). Therefore, knowledge of PPIs is fundamental for both basic research and drug development. With the avalanche of proteins sequences generated in the postgenomic age, it is highly desired to develop computational methods for timely acquiring this kind of knowledge. Here, a new predictor, called \"iPPI-Emsl\", is developed. In the predictor, a protein sample is formulated by incorporating the following two types of information into the general form of PseAAC (pseudo amino acid composition): (1) the physicochemical properties derived from the constituent amino acids of a protein; and (2) the wavelet transforms derived from the numerical series along a protein chain. The operation engine to run the predictor is an ensemble classifier formed by fusing seven individual random forest engines via a voting system. It is demonstrated with the benchmark dataset from Saccharomyces cerevisiae as well as the dataset from Helicobacter pylori that the new predictor achieves remarkably higher success rates than any of the existing predictors in this area. The new predictor[U+05F3] web-server has been established at http://www.jci-bioinfo.cn/iPPI-Esml. For the convenience of most experimental scientists, we have further provided a step-by-step guide, by which users can easily get their desired results without the need to follow the complicated mathematics involved during its development.",
                "authors": [
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "citationCount": 229,
                "date": "2015-07-01T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "iPPI-Esml: AN ensemble classifier for identifying the interactions of proteins by incorporating their physicochemical properties and wavelet transforms into PseAAC"
            },
            "pmid": "25908206"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
