{
    "additionDate": "2015-02-02T11:24:01Z",
    "biotoolsCURIE": "biotools:limani",
    "biotoolsID": "limani",
    "collectionID": [
        "VIB",
        "Plant Systems Biology",
        "UGent"
    ],
    "credit": [
        {
            "name": "PSB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "stdho@psb.vib-ugent.be",
            "name": "Stijn Dhondt",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Online framework for the analysis of vascular networks in leaves.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://limani.psb.ugent.be/demonstrations/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "Binary format",
                            "uri": "http://edamontology.org/format_2333"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Genotype/phenotype report",
                        "uri": "http://edamontology.org/data_0920"
                    }
                }
            ]
        }
    ],
    "homepage": "http://limani.psb.ugent.be",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "LIMANI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "PSB",
    "publication": [
        {
            "doi": "10.1111/j.1365-313X.2011.04803.x",
            "metadata": {
                "abstract": "The study of transgenic Arabidopsis lines with altered vascular patterns has revealed key players in the venation process, but details of the vascularization process are still unclear, partly because most lines have only been assessed qualitatively. Therefore, quantitative analyses are required to identify subtle perturbations in the pattern and to test dynamic modeling hypotheses using biological measurements. We developed an online framework, designated Leaf Image Analysis Interface (LIMANI), in which venation patterns are automatically segmented and measured on dark-field images. Image segmentation may be manually corrected through use of an interactive interface, allowing supervision and rectification steps in the automated image analysis pipeline and ensuring high-fidelity analysis. This online approach is advantageous for the user in terms of installation, software updates, computer load and data storage. The framework was used to study vascular differentiation during leaf development and to analyze the venation pattern in transgenic lines with contrasting cellular and leaf size traits. The results show the evolution of vascular traits during leaf development, suggest a self-organizing mechanism for leaf venation patterning, and reveal a tight balance between the number of end-points and branching points within the leaf vascular network that does not depend on the leaf developmental stage and cellular content, but on the leaf position on the rosette. These findings indicate that development of LIMANI improves understanding of the interaction between vascular patterning and leaf growth. © 2011 The Authors. The Plant Journal © 2011 Blackwell Publishing Ltd.",
                "authors": [
                    {
                        "name": "Dhondt S."
                    },
                    {
                        "name": "Van Haerenborgh D."
                    },
                    {
                        "name": "Van Cauwenbergh C."
                    },
                    {
                        "name": "Merks R.M.H."
                    },
                    {
                        "name": "Philips W."
                    },
                    {
                        "name": "Beemster G.T.S."
                    },
                    {
                        "name": "Inze D."
                    }
                ],
                "citationCount": 38,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "Quantitative analysis of venation patterns of Arabidopsis leaves by supervised image analysis"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}