{
    "additionDate": "2017-08-03T18:39:21Z",
    "biotoolsCURIE": "biotools:catapult",
    "biotoolsID": "catapult",
    "credit": [
        {
            "email": "marcotte@icmb.utexas.edu",
            "name": "Edward Marcotte",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.marcottelab.org/"
        }
    ],
    "description": "Combining dATa Across species using Positive-Unlabeled Learning Techniques, is a supervised machine learning method that uses a biased support vector machine where the features are derived from walks in a heterogeneous gene-trait network.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.marcottelab.org/index.php/Catapult"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://www.marcottelab.org/index.php/Catapult",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/catapult-associating-new-genes-with-traits-phenotypes-and-diseases.html"
        }
    ],
    "name": "Catapult",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Correctly identifying associations of genes with diseases has long been a goal in biology. With the emergence of large-scale gene-phenotype association datasets in biology, we can leverage statistical and machine learning methods to help us achieve this goal. In this paper, we present two methods for predicting gene-disease associations based on functional gene associations and gene-phenotype associations in model organisms. The first method, the Katz measure, is motivated from its success in social network link prediction, and is very closely related to some of the recent methods proposed for gene-disease association inference. The second method, called Catapult (Combining dATa Across species using Positive-Unlabeled Learning Techniques), is a supervised machine learning method that uses a biased support vector machine where the features are derived from walks in a heterogeneous gene-trait network. We study the performance of the proposed methods and related state-of-the-art methods using two different evaluation strategies, on two distinct data sets, namely OMIM phenotypes and drug-target interactions. Finally, by measuring the performance of the methods using two different evaluation strategies, we show that even though both methods perform very well, the Katz measure is better at identifying associations between traits and poorly studied genes, whereas Catapult is better suited to correctly identifying gene-trait associations overall.The authors want to thank Jon Laurent and Kris McGary for some of the data used, and Li and Patra for making their code available. Most of Ambuj Tewari's contribution to this work happened while he was a postdoctoral fellow at the University of Texas at Austin. © 2013 Singh-Blom et al.",
                "authors": [
                    {
                        "name": "Singh-Blom U.M."
                    },
                    {
                        "name": "Natarajan N."
                    },
                    {
                        "name": "Tewari A."
                    },
                    {
                        "name": "Woods J.O."
                    },
                    {
                        "name": "Dhillon I.S."
                    },
                    {
                        "name": "Marcotte E.M."
                    }
                ],
                "citationCount": 57,
                "date": "2013-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Prediction and Validation of Gene-Disease Associations Using Methods Inspired by Social Network Analyses"
            },
            "pmid": "23650495"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}