{
    "additionDate": "2021-01-18T09:17:01Z",
    "biotoolsCURIE": "biotools:metanetc",
    "biotoolsID": "metanetc",
    "confidence_flag": "tool",
    "description": "A new paradigm for data sharing in photonics research.\n\nJonathan Fan, Stanford University.\n\nGLobal Optimization NETwork or GLOnet is a global optimizer, based on a generative neural network, which can output ensembles of highly efficient topology-optimized metasurfaces.\n\nThis is a toolbox to convert .mat files on MetaNet into GDS files.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Diffraction data integration",
                    "uri": "http://edamontology.org/operation_3453"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://metanet.stanford.edu",
    "lastUpdate": "2021-02-22T07:59:19Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://metanet.stanford.edu/code/"
        }
    ],
    "name": "MetaNetC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1364/OE.388378",
            "metadata": {
                "abstract": "© 2020 Optical Society of America under the terms of the OSA Open Access Publishing Agreement.Optimization methods are playing an increasingly important role in all facets of photonics engineering, from integrated photonics to free space diffractive optics. However, efforts in the photonics community to develop optimization algorithms remain uncoordinated, which has hindered proper benchmarking of design approaches and access to device designs based on optimization. We introduce MetaNet, an online database of photonic devices and design codes intended to promote coordination and collaboration within the photonics community. Using metagratings as a model system, we have uploaded over one hundred thousand device layouts to the database, as well as source code for implementations of local and global topology optimization methods. Further analyses of these large datasets allow the distribution of optimized devices to be visualized for a given optimization method. We expect that the coordinated research efforts enabled by MetaNet will expedite algorithm development for photonics design.",
                "authors": [
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Lupoiu R."
                    },
                    {
                        "name": "Wang E.W."
                    },
                    {
                        "name": "Sell D."
                    },
                    {
                        "name": "Hugonin J.P."
                    },
                    {
                        "name": "Lalanne P."
                    },
                    {
                        "name": "Fan J.A."
                    }
                ],
                "citationCount": 10,
                "date": "2020-04-27T00:00:00Z",
                "journal": "Optics Express",
                "title": "MetaNet: A new paradigm for data sharing in photonics research"
            },
            "pmid": "32403837"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}