{
    "additionDate": "2021-03-19T09:02:07Z",
    "biotoolsCURIE": "biotools:deepgrn",
    "biotoolsID": "deepgrn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chengji@missouri.edu",
            "name": "Jianlin Cheng",
            "orcidid": "https://orcid.org/0000-0003-0305-2853",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepGRN is a tool for predicting transcription factor binding site across cell-types using attention-based deep neural networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jianlin-cheng/DeepGRN",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-03-27T18:15:51Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/jianlin-cheng/DeepGRN/issues"
        }
    ],
    "name": "DeepGRN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03952-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Due to the complexity of the biological systems, the prediction of the potential DNA binding sites for transcription factors remains a difficult problem in computational biology. Genomic DNA sequences and experimental results from parallel sequencing provide available information about the affinity and accessibility of genome and are commonly used features in binding sites prediction. The attention mechanism in deep learning has shown its capability to learn long-range dependencies from sequential data, such as sentences and voices. Until now, no study has applied this approach in binding site inference from massively parallel sequencing data. The successful applications of attention mechanism in similar input contexts motivate us to build and test new methods that can accurately determine the binding sites of transcription factors. Results: In this study, we propose a novel tool (named DeepGRN) for transcription factors binding site prediction based on the combination of two components: single attention module and pairwise attention module. The performance of our methods is evaluated on the ENCODE-DREAM in vivo Transcription Factor Binding Site Prediction Challenge datasets. The results show that DeepGRN achieves higher unified scores in 6 of 13 targets than any of the top four methods in the DREAM challenge. We also demonstrate that the attention weights learned by the model are correlated with potential informative inputs, such as DNase-Seq coverage and motifs, which provide possible explanations for the predictive improvements in DeepGRN. Conclusions: DeepGRN can automatically and effectively predict transcription factor binding sites from DNA sequences and DNase-Seq coverage. Furthermore, the visualization techniques we developed for the attention modules help to interpret how critical patterns from different types of input features are recognized by our model.",
                "authors": [
                    {
                        "name": "Birchler J.A."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Hou J."
                    },
                    {
                        "name": "Shi X."
                    },
                    {
                        "name": "Yang H."
                    }
                ],
                "citationCount": 6,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeepGRN: prediction of transcription factor binding site across cell-types using attention-based deep neural networks"
            },
            "pmcid": "PMC7852092",
            "pmid": "33522898"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
