
{
    "credit": [
        {
            "email": "therneau.terry@mayo.edu",
            "name": "Terry M Therneau",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/RNASeqPower.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/RNASeqPower_1.14.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Given the high technical reproducibility and orders of magnitude greater resolution than microarrays, next-generation sequencing of mRNA (RNA-Seq) is quickly becoming the de facto standard for measuring levels of gene expression in biological experiments. Two important questions must be taken into consideration when designing a particular experiment, namely, 1) how deep does one need to sequence? and, 2) how many biological replicates are necessary to observe a significant change in expression? Results: Based on the gene expression distributions from 127 RNA-Seq experiments, we find evidence that 91% ± 4% of all annotated genes are sequenced at a frequency of 0.1 times per million bases mapped, regardless of sample source. Based on this observation, and combining this information with other parameters such as biological variation and technical variation that we empirically estimate from our large datasets, we developed a model to estimate the statistical power needed to identify differentially expressed genes from RNA-Seq experiments. Conclusions: Our results provide a needed reference for ensuring RNA-Seq gene expression studies are conducted with the optimally sample size, power, and sequencing depth. We also make available both R code and an Excel worksheet for investigators to calculate for their own experiments. © Mary Ann Liebert, Inc.",
            "authors": [
                "Hart S.N.",
                "Therneau T.M.",
                "Zhang Y.",
                "Poland G.A.",
                "Kocher J.-P."
            ],
            "cit_count": 67,
            "doi": "10.1089/cmb.2012.0283",
            "journal": "Journal of Computational Biology",
            "title": "Calculating sample size estimates for RNA sequencing data",
            "type": "Primary",
            "year": "2013-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnaseqpower",
        "biotoolsID": "rnaseqpower",
        "description": "Sample size and power computation for RNA-seq studies.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/RNASeqPower.html",
        "name": "RNASeqPower",
        "version": [
            "1.14.0"
        ]
    }
}