{
    "additionDate": "2021-01-18T09:18:21Z",
    "biotoolsCURIE": "biotools:dkt",
    "biotoolsID": "dkt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "razvan@csail.mit.edu",
            "typeEntity": "Person"
        }
    ],
    "description": "Disease Knowledge Transfer (DKT) is a technique for transferring biomarker information between related neurodegenerative diseases. DKT infers robust multimodal biomarker trajectories in rare neurodegenerative diseases even when only limited, unimodal data is available, by transferring information from larger multimodal datasets from common neurodegenerative diseases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mrazvan22/dkt",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:58:24Z",
    "name": "DKT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-3-030-32245-8_95",
            "metadata": {
                "abstract": "© 2019, Springer Nature Switzerland AG.We introduce Disease Knowledge Transfer (DKT), a novel technique for transferring biomarker information between related neurodegenerative diseases. DKT infers robust multimodal biomarker trajectories in rare neurodegenerative diseases even when only limited, unimodal data is available, by transferring information from larger multimodal datasets from common neurodegenerative diseases. DKT is a joint-disease generative model of biomarker progressions, which exploits biomarker relationships that are shared across diseases. Our proposed method allows, for the first time, the estimation of plausible multimodal biomarker trajectories in Posterior Cortical Atrophy (PCA), a rare neurodegenerative disease where only unimodal MRI data is available. For this we train DKT on a combined dataset containing subjects with two distinct diseases and sizes of data available: (1) a larger, multimodal typical AD (tAD) dataset from the TADPOLE Challenge, and (2) a smaller unimodal Posterior Cortical Atrophy (PCA) dataset from the Dementia Research Centre (DRC), for which only a limited number of Magnetic Resonance Imaging (MRI) scans are available. Although validation is challenging due to lack of data in PCA, we validate DKT on synthetic data and two patient datasets (TADPOLE and PCA cohorts), showing it can estimate the ground truth parameters in the simulation and predict unseen biomarkers on the two patient datasets. While we demonstrated DKT on Alzheimer’s variants, we note DKT is generalisable to other forms of related neurodegenerative diseases. Source code for DKT is available online: https://github.com/mrazvan22/dkt.",
                "authors": [
                    {
                        "name": "Marinescu R.V."
                    },
                    {
                        "name": "Lorenzi M."
                    },
                    {
                        "name": "Blumberg S.B."
                    },
                    {
                        "name": "Young A.L."
                    },
                    {
                        "name": "Planell-Morell P."
                    },
                    {
                        "name": "Oxtoby N.P."
                    },
                    {
                        "name": "Eshaghi A."
                    },
                    {
                        "name": "Yong K.X."
                    },
                    {
                        "name": "Crutch S.J."
                    },
                    {
                        "name": "Golland P."
                    },
                    {
                        "name": "Alexander D.C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Disease Knowledge Transfer Across Neurodegenerative Diseases"
            },
            "pmcid": "PMC7235145",
            "pmid": "32432230"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}