{
    "additionDate": "2021-01-18T11:11:56Z",
    "biotoolsCURIE": "biotools:instadock",
    "biotoolsID": "instadock",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mihassan@jmi.ac.in",
            "name": "Md Imtaiyaz Hassan",
            "typeEntity": "Person"
        }
    ],
    "description": "A single-click graphical user interface for molecular docking-based virtual high-throughput screening.\n\nGet in touch with Team InstaDock.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://hassanlab.org/instadock",
    "lastUpdate": "2021-02-05T07:12:52Z",
    "name": "InstaDock",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA279",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Exploring protein-ligand interactions is a subject of immense interest, as it provides deeper insights into molecular recognition, mechanism of interaction and subsequent functions. Predicting an accurate model for a protein-ligand interaction is a challenging task. Molecular docking is a computational method used for predicting the preferred orientation, binding conformations and the binding affinity of a ligand to a macromolecular target, especially protein. It has been applied in 'virtual high-throughput screening' of chemical libraries containing millions of compounds to find potential leads in drug design and discovery. Here, we have developed InstaDock, a free and open access Graphical User Interface (GUI) program that performs molecular docking and high-throughput virtual screening efficiently. InstaDock is a single-click GUI that uses QuickVina-W, a modified version of AutoDock Vina for docking calculations, made especially for the convenience of non-bioinformaticians and for people who are not experts in using computers. InstaDock facilitates onboard analysis of docking and visual results in just a single click. To sum up, InstaDock is the easiest and more interactive interface than ever existing GUIs for molecular docking and high-throughput virtual screening. InstaDock is freely available for academic and industrial research purposes via https://hassanlab.org/instadock.",
                "authors": [
                    {
                        "name": "Mohammad T."
                    },
                    {
                        "name": "Mathur Y."
                    },
                    {
                        "name": "Hassan M.I."
                    }
                ],
                "citationCount": 4,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "InstaDock: A single-click graphical user interface for molecular docking-based virtual high-throughput screening"
            },
            "pmid": "33105480"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}