
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.zbh.uni-hamburg.de/kurtz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/unwords-compute-absent-words-genomic-sequences.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Analysis of sequence composition is a routine task in genome research. Organisms are characterized by their base composition, dinucleotide relative abundance, codon usage, and so on. Unique subsequences are markers of special interest in genome comparison, expression profiling, and genetic engineering. Relative to a random sequence of the same length, unique subsequences are overrepresented in real genomes. Shortest words absent from a genome have been addressed in two recent studies. Results: We describe a new algorithm and software for the computation of absent words. It is more efficient than previous algorithms and easier to use. It directly computes unwords without the need to specify a length estimate. Moreover, it avoids the space requirements of index structures such as suffix trees and suffix arrays. Our implementation is available as an open source package. We compute unwords of human and mouse as well as some other organisms, covering a genome size range from 109 down to 105 bp. Conclusion: The new algorithm computes absent words for the human genome in 10 minutes on standard hardware, using only 2.5 Mb of space. This enables us to perform this type of analysis not only for the largest genomes available so far, but also for the emerging pan- and meta-genome data. © 2008 Herold et al; licensee BioMed Central Ltd.",
            "authors": [
                "Herold J.",
                "Kurtz S.",
                "Giegerich R."
            ],
            "cit_count": 50,
            "doi": "10.1186/1471-2105-9-167",
            "journal": "BMC Bioinformatics",
            "title": "Efficient computation of absent words in genomic sequences",
            "type": "Primary",
            "year": "2008-03-26"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:unwords",
        "biotoolsID": "unwords",
        "description": "An efficient software for computing shortest strings which do not occur in a given set of DNA sequences. It is more efficient than previous algorithms and easier to use. It uses bit vector encoding of strings and therefore we called it unwords-bits. It directly computes unwords without the need to specify a length estimate. Moreover, it avoids the space requirements of index structures such as suffix trees and suffix arrays.",
        "homepage": "http://www.zbh.uni-hamburg.de/forschung/arbeitsgruppe-genominformatik/software/unwords.html",
        "name": "UNWORDS"
    }
}