{
    "additionDate": "2019-11-14T18:46:35Z",
    "biotoolsCURIE": "biotools:mamo",
    "biotoolsID": "mamo",
    "confidence_flag": "very low",
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'BRIP1 RAD51C RAD51D', 'carriers BRIP1 RAD51C RAD51D', 'BRIP1 RAD51C', 'RAD51C RAD51D' | Recommendations for Preventive Care for Women with Rare Genetic Cause of Breast and Ovarian Cancer | Program mamografického screeningu v České republice | Výzkumný projekt řešený pod odbornou garancí Komise odborníků pro mamární diagnostiku (KOMD). Sběr a analýza dat z Programu mamografického screeningu v České republice. Organizační a edukační materiály o prevenci rakoviny prsu, on-line poradna pro veřejnost | MAMO.CZ : MAMOGRAFICKÝ SCREENING [ISSN 1804-0861]",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.mamo.cz",
    "lastUpdate": "2019-11-14T18:46:35Z",
    "name": "mamo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.14735/AMKO2019S6",
            "metadata": {
                "abstract": "© 2019, Czech Medical Association J.E. Purkyne. All rights reserved.An inherited predisposition to breast cancer underlies 5–10% of breast tumors. High-risk BRCA1 and BRCA2 genes result in an 85% lifetime risk of breast cancer and a 20–60% lifetime risk of ovarian cancer. Next-generation sequencing or massive parallel sequencing are now established testing methods that enable screening for many genes that predispose to heterogeneous hereditary cancer syndromes (22 genes are required by the health insurance companies). In addition to BRCA1 and BRCA2, inherited mutations in other genes predispose to breast and/or ovarian cancer. High-risk breast cancer genes include TP53, STK11, CDH1, PTEN, PALB2, and NF1, while moderate-risk (2–4 times increased risk) breast cancer genes include ATM, CHEK2, and NBN. Moderate risk is also suggested for Lynch syndrome, MUTYH, BRIP1, RAD51C, RAD51D, BARD1, FANCA, FANCC, FANCM, BLM, WRN genes. In heterozygotes for other recessive syndromes the risk of developing breast cancer is subject to current research. Low-risk genes are (mostly) irrelevant from a clinical perspective. Other genes that increase the risk of ovarian cancer include the genes for Lynch syndrome, the BRIP1, RAD51C and RAD51D genes. Preventive care should be proposed based on assumed cumulative breast cancer risk (see http://www.mamo.cz): A risk of >20% for BRCA1/2, TP53, PTEN, STK11, CDH1, PALB2, CHEK2, ATM, and NF1; and a risk of 10–20% for BRIP1, RAD51C, RAD51B, BARD1, FANCA, FANCC, FANCM, NBN, BLM, and WRN. The genetic risk should be assessed by a geneticist and be based on inherited mutations and empirical risk according to family history. Prophylactic mastectomy is considered for high-risk gene carriers but not for moderate-risk gene carriers; however, it may be considered if there is an underlying family history, a risk of parenchyma of the mammary gland, or other risk factors. Ovarian cancer risk increases significantly in carriers of the BRIP1, RAD51C, and RAD51D genes. For prevention of ovarian cancer, prophylactic salpingo-oophorectomy is an important component of preventive care. In ovarian cancer families with no identified risk germline mutation, preventive salpingo-oophorectomy is not routinely recommended but may be considered as the only efficient method of prevention due to the increased empirical risk (4 times) of ovarian cancer in first-degree relatives.",
                "authors": [
                    {
                        "name": "Foretova L."
                    },
                    {
                        "name": "Navratilova M."
                    },
                    {
                        "name": "Svoboda M."
                    },
                    {
                        "name": "Vasickova P."
                    },
                    {
                        "name": "Stahlova Hrabincova E."
                    },
                    {
                        "name": "Hazova J."
                    },
                    {
                        "name": "Kleiblova P."
                    },
                    {
                        "name": "Kleibl Z."
                    },
                    {
                        "name": "Machackova E."
                    },
                    {
                        "name": "Palacova M."
                    },
                    {
                        "name": "Petrakova K."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Klinicka Onkologie",
                "title": "Recommendations for preventive care for women with rare genetic cause of breast and ovarian cancer Doporučení pro sledování žen se vzácnějšími genetickými příčinami nádorů prsu a ovarií"
            },
            "pmid": "31409076"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}