
{
    "credit": [
        {
            "email": "panc@ornl.gov",
            "name": "Chongle Pan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://omega.omicsbio.org/contact/"
        }
    ],
    "documentation": [
        {
            "url": "http://omega.omicsbio.org/instructions2/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/omega-1-0-1-overlap-graph-de-novo-assembler-for-metagenomics.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 The Author.Motivation: Metagenomic sequencing allows reconstruction of microbial genomes directly from environmental samples. Omega (overlap-graph metagenome assembler) was developed for assembling and scaffolding Illumina sequencing data of microbial communities. Results: Omega found overlaps between reads using a prefix/suffix hash table. The overlap graph of reads was simplified by removing transitive edges and trimming short branches. Unitigs were generated based on minimum cost flow analysis of the overlap graph and then merged to contigs and scaffolds using mate-pair information. In comparison with three de Bruijn graph assemblers (SOAPdenovo, IDBA-UD and MetaVelvet), Omega provided comparable overall performance on a HiSeq 100-bp dataset and superior performance on a MiSeq 300-bp dataset. In comparison with Celera on the MiSeq dataset, Omega provided more continuous assemblies overall using a fraction of the computing time of existing overlap-layout-consensus assemblers. This indicates Omega can more efficiently assemble longer Illumina reads, and at deeper coverage, for metagenomic datasets.",
            "authors": [
                "Haider B.",
                "Ahn T.-H.",
                "Bushnell B.",
                "Chai J.",
                "Copeland A.",
                "Pan C."
            ],
            "cit_count": 35,
            "journal": "Bioinformatics",
            "pmid": "24947750",
            "title": "Omega: An Overlap-graph de novo Assembler for Metagenomics",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:omega",
        "biotoolsID": "omega",
        "description": "Software for assembling and scaffolding Illumina sequencing data of microbial communities.",
        "homepage": "http://omega.omicsbio.org/",
        "name": "Omega"
    }
}