
{
    "credit": [
        {
            "email": "mxli@hku.hk",
            "name": "Dr Li, Miaoxin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://statgenpro.psychiatry.hku.hk/limx/homepage/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://grass.cgs.hku.hk/limx/kgg/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/kgg-2-0-knowledge-based-mining-system-genome-wide-genetic-studies.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Motivation: Standard genome-wide association studies, testing the association between one phenotype and a large number of single nucleotide polymorphisms (SNPs), are limited in two ways: (i) traits are often multivariate, and analysis of composite scores entails loss in statistical power and (ii) gene-based analyses may be preferred, e.g. to decrease the multiple testing problem. Results: Here we present a new method, multivariate gene-based association test by extended Simes procedure (MGAS), that allows gene-based testing of multivariate phenotypes in unrelated individuals. Through extensive simulation, we show that under most trait-generating genotype-phenotype models MGAS has superior statistical power to detect associated genes compared with gene-based analyses of univariate phenotypic composite scores (i.e. GATES, multiple regression), and multivariate analysis of variance (MANOVA). Re-analysis of metabolic data revealed 32 False Discovery Rate controlled genome-wide significant genes, and 12 regions harboring multiple genes; of these 44 regions, 30 were not reported in the original analysis. Conclusion: MGAS allows researchers to conduct their multivariate gene-based analyses efficiently, and without the loss of power that is often associated with an incorrectly specified genotype-phenotype models.",
            "authors": [
                "Van Der Sluis S.",
                "Dolan C.V.",
                "Li J.",
                "Song Y.",
                "Sham P.",
                "Posthuma D.",
                "Li M.-X."
            ],
            "cit_count": 18,
            "journal": "Bioinformatics",
            "pmid": "25431328",
            "title": "MGAS: A powerful tool for multivariate gene-based genome-wide association analysis",
            "year": "2015-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kgg",
        "biotoolsID": "kgg",
        "description": "Perform knowledge-based analysis for genome-wide association studies(GWAS). At present, it has three major functions, 1) prioritizing SNPs through a knowledge-based weighting method; 2) efficiently conducting powerful gene-based association tests using SNP p-values from GWAS; 3) advanced biological module-level analysis (pathway and PPI network enrichment) of significant genes suggested by the analyses of 1) or 2).",
        "homepage": "http://statgenpro.psychiatry.hku.hk/limx/kgg/",
        "name": "KGG"
    }
}