{
    "additionDate": "2021-01-18T11:59:42Z",
    "biotoolsCURIE": "biotools:cginet",
    "biotoolsID": "cginet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chengkun_wu@nudt.edu.cn",
            "name": "Chengkun Wu",
            "orcidid": "https://orcid.org/0000-0002-9688-5311",
            "typeEntity": "Person"
        }
    ],
    "description": "CGINet is graph convolutional network-based model for identifying chemical-gene interaction in an integrated multi-relational graph containing three types of nodes: chemicals, genes, and pathways.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WebyGit/CGINet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-10T21:09:11Z",
    "name": "CGINet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03899-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Elucidation of interactive relation between chemicals and genes is of key relevance not only for discovering new drug leads in drug development but also for repositioning existing drugs to novel therapeutic targets. Recently, biological network-based approaches have been proven to be effective in predicting chemical-gene interactions. Results: We present CGINet, a graph convolutional network-based method for identifying chemical-gene interactions in an integrated multi-relational graph containing three types of nodes: chemicals, genes, and pathways. We investigate two different perspectives on learning node embeddings. One is to view the graph as a whole, and the other is to adopt a subgraph view that initial node embeddings are learned from the binary association subgraphs and then transferred to the multi-interaction subgraph for more focused learning of higher-level target node representations. Besides, we reconstruct the topological structures of target nodes with the latent links captured by the designed substructures. CGINet adopts an end-to-end way that the encoder and the decoder are trained jointly with known chemical-gene interactions. We aim to predict unknown but potential associations between chemicals and genes as well as their interaction types. Conclusions: We study three model implementations CGINet-1/2/3 with various components and compare them with baseline approaches. As the experimental results suggest, our models exhibit competitive performances on identifying chemical-gene interactions. Besides, the subgraph perspective and the latent link both play positive roles in learning much more informative node embeddings and can lead to improved prediction.",
                "authors": [
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Yang C."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CGINet: graph convolutional network-based model for identifying chemical-gene interaction in an integrated multi-relational graph"
            },
            "pmcid": "PMC7689985",
            "pmid": "33243142"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}