{"credit":[{"email":"dcode@ncbi.nlm.nih.gov","name":"rVista Support","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.ncbi.nlm.nih.gov/CBBresearch/Ovcharenko/"}],"documentation":[{"type":"GENERAL","url":"https://rvista.dcode.org/instr_rVISTA.html"}],"function":[{"operation":[{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/rvista-2-0-identification-tfbs-conserved-pairwise-alignments.html"}],"publication":[{"abstract":"Identifying and characterizing the transcription factor binding site (TFBS) patterns of cis-regulatory elements represents a challenge, but holds promise to reveal the regulatory language the genome uses to dictate transcriptional dynamics. Several studies have demonstrated that regulatory modules are under positive selection and, therefore, are often conserved between related species. Using this evolutionary principle, we have created a comparative tool, rVISTA, for analyzing the regulatory potential of noncoding sequences. Our ability to experimentally identify functional noncoding sequences is extremely limited, therefore, rVISTA attempts to fill this great gap in genomic analysis by offering a powerful approach for eliminating TFBSs least likely to be biologically relevant. The rVISTA tool combines TFBS predictions, sequence comparisons and cluster analysis to identify noncoding DNA regions that are evolutionarily conserved and present in a specific configuration within genomic sequences. Here, we present the newly developed version 2.0 of the rVISTA tool, which can process alignments generated by both the zPicture and blastz alignment programs or use pre-computed pairwise alignments of several vertebrate genomes available from the ECR Browser and GALA database. The rVISTA web server is closely interconnected with the TRANSFAC database, allowing users to either search for matrices present in the TRANSFAC library collection or search for user-defined consensus sequences. The rVISTA tool is publicly available at http://rvista.dcode.org/. © Oxford University Press 2004; all rights reserved.","authors":["Loots G.G.","Ovcharenko I."],"cit_count":306,"journal":"Nucleic Acids Research","pmid":"15215384","title":"rVISTA 2.0: Evolutionary analysis of transcription factor binding sites","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:rvista","biotoolsID":"rvista","description":"This tool combines TFBS predictions, sequence comparisons and cluster analysis to identify noncoding DNA regions that are evolutionarily conserved and present in a specific configuration within genomic sequences. The newly developed version 2.0 of the tool can process alignments generated by both the zPicture and blastz alignment programs or use pre-computed pairwise alignments of several vertebrate genomes available from the ECR Browser and GALA database.","homepage":"http://rvista.dcode.org/","name":"rVista"}}