{
    "additionDate": "2019-11-14T19:51:45Z",
    "biotoolsCURIE": "biotools:VariMerge",
    "biotoolsID": "VariMerge",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "martin.muggli@colostate.edu",
            "name": "Martin D Muggli",
            "orcidid": "https://orcid.org/0000-0002-9283-0049",
            "typeEntity": "Person"
        },
        {
            "email": "cboucher@cise.ufl.edu",
            "name": "Christina Boucher",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'IMPLEMENTATION:VariMerge' | Building large updatable colored de Bruijn graphs via merging | VARI-merge is a pair of tools (vari-merge and color-merge) capable of merging the succinct colored de Bruijn graphs produced by VARI. The VARI-merge branch includes all of VARI | Cosmo is a fast, low-memory DNA assembler that uses a succinct de Bruijn graph | VARI is an extension to Cosmo and supports offline construction of succinct colored de Bruijn graphs. It can be found in the VARi branch, however all the components are also in this branch. You should use this branch for the VARI tools because it includes an important bugfix: Palendromes are not duplicated during the revcomp generation phase of succinct de Bruijn graph construction",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cosmo-team/cosmo/tree/VARI-merge",
    "lastUpdate": "2019-11-14T19:51:45Z",
    "license": "GPL-3.0",
    "name": "VariMerge",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ350",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: There exist several large genomic and metagenomic data collection efforts, including GenomeTrakr and MetaSub, which are routinely updated with new data. To analyze such datasets, memory-efficient methods to construct and store the colored de Bruijn graph were developed. Yet, a problem that has not been considered is constructing the colored de Bruijn graph in a scalable manner that allows new data to be added without reconstruction. This problem is important for large public datasets as scalability is needed but also the ability to update the construction is also needed. Results: We create a method for constructing the colored de Bruijn graph for large datasets that is based on partitioning the data into smaller datasets, building the colored de Bruijn graph using a FM-index based representation, and succinctly merging these representations to build a single graph. The last step, merging succinctly, is the algorithmic challenge which we solve in this article. We refer to the resulting method as VariMerge. This construction method also allows the graph to be updated with new data. We validate our approach and show it produces a three-fold reduction in working space when constructing a colored de Bruijn graph for 8000 strains. Lastly, we compare VariMerge to other competing methods - including Vari, Rainbowfish, Mantis, Bloom Filter Trie, the method of Almodaresi et al. and Multi-BRWT - and illustrate that VariMerge is the only method that is capable of building the colored de Bruijn graph for 16 000 strains in a manner that allows it to be updated. Competing methods either did not scale to this large of a dataset or do not allow for additions without reconstruction.",
                "authors": [
                    {
                        "name": "Muggli M.D."
                    },
                    {
                        "name": "Alipanahi B."
                    },
                    {
                        "name": "Boucher C."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Building large updatable colored de Bruijn graphs via merging"
            },
            "pmcid": "PMC6612864",
            "pmid": "31510647"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}