{"credit":[{"email":"andrew.martin@ucl.ac.uk","name":"Andrew Martin","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.bioinf.org.uk/intpred/paper/SupplementaryMaterial.pdf"}],"function":[{"operation":[{"term":"Protein-protein interaction prediction","uri":"http://edamontology.org/operation_2464"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. Motivation Protein-protein interactions are vital for protein function with the average protein having between three and ten interacting partners. Knowledge of precise protein-protein interfaces comes from crystal structures deposited in the Protein Data Bank (PDB), but only 50% of structures in the PDB are complexes. There is therefore a need to predict protein-protein interfaces in silico and various methods for this purpose. Here we explore the use of a predictor based on structural features and which exploits random forest machine learning, comparing its performance with a number of popular established methods. Results On an independent test set of obligate and transient complexes, our IntPred predictor performs well (MCC = 0.370, ACC = 0.811, SPEC = 0.916, SENS = 0.411) and compares favourably with other methods. Overall, IntPred ranks second of six methods tested with SPPIDER having slightly better overall performance (MCC = 0.410, ACC = 0.759, SPEC = 0.783, SENS = 0.676), but considerably worse specificity than IntPred. As with SPPIDER, using an independent test set of obligate complexes enhanced performance (MCC = 0.381) while performance is somewhat reduced on a dataset of transient complexes (MCC = 0.303). The trade-off between sensitivity and specificity compared with SPPIDER suggests that the choice of the appropriate tool is application-dependent.","authors":["Northey T.C.","BaresiA A.","Martin A.C.R."],"cit_count":1,"doi":"10.1093/bioinformatics/btx585","journal":"Bioinformatics","title":"IntPred: A structure-based predictor of protein-protein interaction sites","year":"2018-01-15"}],"summary":{"biotoolsCURIE":"biotools:intpred","biotoolsID":"intpred","description":"Structure-based predictor of protein–protein interaction sites.","homepage":"http://www.bioinf.org.uk/intpred/","name":"IntPred"}}