{
    "additionDate": "2024-01-22T11:05:09.971506Z",
    "biotoolsCURIE": "biotools:reportree",
    "biotoolsID": "reportree",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vitor.borges@insa.min-saude.pt",
            "name": "Vítor Borges",
            "orcidid": "https://orcid.org/0000-0003-3767-2209",
            "typeEntity": "Person"
        }
    ],
    "description": "Surveillance-oriented tool to strengthen the linkage between pathogen genetic clusters and epidemiological data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/insapathogenomics/ReporTree/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "https://github.com/insapathogenomics/ReporTree",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-22T11:05:09.974095Z",
    "license": "GPL-3.0",
    "name": "ReporTree",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-023-01196-1",
            "metadata": {
                "abstract": "Background: Genomics-informed pathogen surveillance strengthens public health decision-making, playing an important role in infectious diseases’ prevention and control. A pivotal outcome of genomics surveillance is the identification of pathogen genetic clusters and their characterization in terms of geotemporal spread or linkage to clinical and demographic data. This task often consists of the visual exploration of (large) phylogenetic trees and associated metadata, being time-consuming and difficult to reproduce. Results: We developed ReporTree, a flexible bioinformatics pipeline that allows diving into the complexity of pathogen diversity to rapidly identify genetic clusters at any (or all) distance threshold(s) or cluster stability regions and to generate surveillance-oriented reports based on the available metadata, such as timespan, geography, or vaccination/clinical status. ReporTree is able to maintain cluster nomenclature in subsequent analyses and to generate a nomenclature code combining cluster information at different hierarchical levels, thus facilitating the active surveillance of clusters of interest. By handling several input formats and clustering methods, ReporTree is applicable to multiple pathogens, constituting a flexible resource that can be smoothly deployed in routine surveillance bioinformatics workflows with negligible computational and time costs. This is demonstrated through a comprehensive benchmarking of (i) the cg/wgMLST workflow with large datasets of four foodborne bacterial pathogens and (ii) the alignment-based SNP workflow with a large dataset of Mycobacterium tuberculosis. To further validate this tool, we reproduced a previous large-scale study on Neisseria gonorrhoeae, demonstrating how ReporTree is able to rapidly identify the main species genogroups and characterize them with key surveillance metadata, such as antibiotic resistance data. By providing examples for SARS-CoV-2 and the foodborne bacterial pathogen Listeria monocytogenes, we show how this tool is currently a useful asset in genomics-informed routine surveillance and outbreak detection of a wide variety of species. Conclusions: In summary, ReporTree is a pan-pathogen tool for automated and reproducible identification and characterization of genetic clusters that contributes to a sustainable and efficient public health genomics-informed pathogen surveillance. ReporTree is implemented in python 3.8 and is freely available at https://github.com/insapathogenomics/ReporTree .",
                "authors": [
                    {
                        "name": "Borges V."
                    },
                    {
                        "name": "Di Pasquale A."
                    },
                    {
                        "name": "Gomes J.P."
                    },
                    {
                        "name": "Mixao V."
                    },
                    {
                        "name": "Pinto M."
                    },
                    {
                        "name": "Sobral D."
                    }
                ],
                "citationCount": 3,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "ReporTree: a surveillance-oriented tool to strengthen the linkage between pathogen genetic clusters and epidemiological data"
            },
            "pmcid": "PMC10273728",
            "pmid": "37322495"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
