{
    "additionDate": "2017-12-18T00:15:30Z",
    "biotoolsCURIE": "biotools:qpms9",
    "biotoolsID": "qpms9",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.engr.uconn.edu/~man09004/"
        }
    ],
    "description": "Parallel exact qPMS (quorum Planted Motif Search) algorithm that offers significant runtime improvements on DNA and protein datasets.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/mariusmni/qpms9/tree/master/qpms9"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://code.google.com/p/qpms9/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/qpms9-parallel-algorithm-for-quorum-planted-motif-search.html"
        }
    ],
    "name": "qPMS9",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1038/srep07813",
            "metadata": {
                "abstract": "Discovering patterns in biological sequences is a crucial problem. For example, the identification of patterns inDNAsequences has resulted in the determination of open reading frames, identification of gene promoter elements, intron/exon splicing sites, and SH RNAs, location of RNA degradation signals, identification of alternative splicing sites, etc. In protein sequences, patterns have led to domain identification, location of protease cleavage sites, identification of signal peptides, protein interactions, determination of protein degradation elements, identification of protein trafficking elements, discovery of short functional motifs, etc. In this paper we focus on the identification of an important class of patterns, namely, motifs. We study the (,l d) motif search problem or Planted Motif Search (PMS). PMS receives as input n strings and two integers , andd. It returns all sequencesM of length , that occur in each input string, where each occurrence differs fromM in at most d positions. Another formulation is quorum PMS (qPMS), where the motif appears in at least q% of the strings. We introduce qPMS9, a parallel exact qPMS algorithm that offers significant runtime improvements on DNA and protein datasets. qPMS9 solves the challenging DNA (,l d)-instances (28, 12) and (30, 13). The source code is available at https://code.google.com/p/qpms9/.",
                "authors": [
                    {
                        "name": "Nicolae M."
                    },
                    {
                        "name": "Rajasekaran S."
                    }
                ],
                "citationCount": 10,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "QPMS9: An efficient algorithm for quorum planted motif search"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}