{
    "additionDate": "2019-11-14T18:04:04Z",
    "biotoolsCURIE": "biotools:AmpliSolve",
    "biotoolsID": "AmpliSolve",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "g.attard@ucl.ac.uk",
            "name": "Gerhardt Attard",
            "typeEntity": "Person"
        },
        {
            "email": "Stefano.Lise@icr.ac.uk",
            "name": "Stefano Lise",
            "orcidid": "https://orcid.org/0000-0003-4472-6893",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of single nucleotide variants using position-specific error estimation in deep sequencing data | Targeted deep sequencing is a highly effective technology to identify known and novel single nucleotide variants (SNVs) with many applications in translational medicine, disease monitoring and cancer profiling",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dkleftogi/AmpliSolve",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-02T13:22:35.194652Z",
    "name": "AmpliSolve",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0557-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Targeted deep sequencing is a highly effective technology to identify known and novel single nucleotide variants (SNVs) with many applications in translational medicine, disease monitoring and cancer profiling. However, identification of SNVs using deep sequencing data is a challenging computational problem as different sequencing artifacts limit the analytical sensitivity of SNV detection, especially at low variant allele frequencies (VAFs). Methods: To address the problem of relatively high noise levels in amplicon-based deep sequencing data (e.g. with the Ion AmpliSeq technology) in the context of SNV calling, we have developed a new bioinformatics tool called AmpliSolve. AmpliSolve uses a set of normal samples to model position-specific, strand-specific and nucleotide-specific background artifacts (noise), and deploys a Poisson model-based statistical framework for SNV detection. Results: Our tests on both synthetic and real data indicate that AmpliSolve achieves a good trade-off between precision and sensitivity, even at VAF below 5% and as low as 1%. We further validate AmpliSolve by applying it to the detection of SNVs in 96 circulating tumor DNA samples at three clinically relevant genomic positions and compare the results to digital droplet PCR experiments. Conclusions: AmpliSolve is a new tool for in-silico estimation of background noise and for detection of low frequency SNVs in targeted deep sequencing data. Although AmpliSolve has been specifically designed for and tested on amplicon-based libraries sequenced with the Ion Torrent platform it can, in principle, be applied to other sequencing platforms as well. AmpliSolve is freely available at https://github.com/dkleftogi/AmpliSolve.",
                "authors": [
                    {
                        "name": "Kleftogiannis D."
                    },
                    {
                        "name": "Punta M."
                    },
                    {
                        "name": "Jayaram A."
                    },
                    {
                        "name": "Sandhu S."
                    },
                    {
                        "name": "Wong S.Q."
                    },
                    {
                        "name": "Gasi Tandefelt D."
                    },
                    {
                        "name": "Conteduca V."
                    },
                    {
                        "name": "Wetterskog D."
                    },
                    {
                        "name": "Attard G."
                    },
                    {
                        "name": "Lise S."
                    }
                ],
                "citationCount": 4,
                "date": "2019-08-02T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Identification of single nucleotide variants using position-specific error estimation in deep sequencing data"
            },
            "pmcid": "PMC6679440",
            "pmid": "31375105"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Translational medicine",
            "uri": "http://edamontology.org/topic_3342"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}