{
    "additionDate": "2020-01-14T08:57:02Z",
    "biotoolsCURIE": "biotools:PCOSBase",
    "biotoolsID": "PCOSBase",
    "confidence_flag": "tool",
    "description": "A manually curated database of polycystic ovarian syndrome.\n\nNor Afiqah-Aleng, Sarahani Harun, Mohd Rusman Arief A-Rahman, Nor Azlan Nor Muhammad, Zeti-Azura Mohamed-Hussein, PCOSBase: a manually curated database of polycystic ovarian syndrome, Database, Volume 2017, 2017, bax098",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://pcosbase.org",
    "lastUpdate": "2021-01-05T10:17:27Z",
    "name": "PCOSBase",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAX098",
            "metadata": {
                "abstract": "© The Author(s) 2017.Polycystic ovarian syndrome (PCOS) is one of the main causes of infertility and affects 5–20% women of reproductive age. Despite the increased prevalence of PCOS, the mechanisms involved in its pathogenesis and pathophysiology remains unclear. The expansion of omics on studying the mechanisms of PCOS has lead into vast amounts of proteins related to PCOS resulting to a challenge in collating and depositing this deluge of data into one place. A knowledge-based repository named as PCOSBase was developed to systematically store all proteins related to PCOS. These proteins were compiled from various online databases and published expression studies. Rigorous criteria were developed to identify those that were highly related to PCOS. They were manually curated and analysed to provide additional information on gene ontologies, pathways, domains, tissue localizations and diseases that associate with PCOS. Other proteins that might interact with PCOS-related proteins identified from this study were also included. Currently, 8185 PCOS-related proteins were identified and assigned to 13 237 gene ontology vocabulary, 1004 pathways, 7936 domains, 29 disease classes, 1928 diseases, 91 tissues and 320 472 interactions. All publications related to PCOS are also indexed in PCOSBase. Data entries are searchable in the main page, search, browse and datasets tabs. Protein advanced search is provided to search for specific proteins. To date, PCOSBase has the largest collection of PCOS-related proteins. PCOSBase aims to become a self-contained database that can be used to further understand the PCOS pathogenesis and towards the identification of potential PCOS biomarkers.",
                "authors": [
                    {
                        "name": "A-Rahman M.R.A."
                    },
                    {
                        "name": "Afiqah-Aleng N."
                    },
                    {
                        "name": "Harun S."
                    },
                    {
                        "name": "Mohamed-Hussein Z.-A."
                    },
                    {
                        "name": "Muhammad N.A.N."
                    }
                ],
                "citationCount": 2,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Database",
                "title": "PCOSBase: A manually curated database of polycystic ovarian syndrome"
            },
            "pmid": "31725861"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
