{
    "additionDate": "2017-08-03T18:43:30Z",
    "biotoolsCURIE": "biotools:fitmunk",
    "biotoolsID": "fitmunk",
    "credit": [
        {
            "email": "wladek@iwonka.med.virginia.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Framework for fitting conformations on a fixed backbone into electron density.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://fitmunk.bitbucket.io/?"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://witold.med.virginia.edu/fitmunk/server/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/fitmunk-improving-protein-structures-by-accurate-automatic-modeling-of-side-chain-conformations.html"
        }
    ],
    "name": "Fitmunk",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016, Wiley-Blackwell. All rights reserved.Improvements in crystallographic hardware and software have allowed automated structure-solution pipelines to approach a near-‘one-click’ experience for the initial determination of macromolecular structures. However, in many cases the resulting initial model requires a laborious, iterative process of refinement and validation. A new method has been developed for the automatic modeling of side-chain conformations that takes advantage of rotamer-prediction methods in a crystallographic context. The algorithm, which is based on deterministic dead-end elimination (DEE) theory, uses new dense conformer libraries and a hybrid energy function derived from experimental data and prior information about rotamer frequencies to find the optimal conformation of each side chain. In contrast to existing methods, which incorporate the electron-density term into protein-modeling frameworks, the proposed algorithm is designed to take advantage of the highly discriminatory nature of electron-density maps. This method has been implemented in the program Fitmunk, which uses extensive conformational sampling. This improves the accuracy of the modeling and makes it a versatile tool for crystallographic model building, refinement and validation. Fitmunk was extensively tested on over 115 new structures, as well as a subset of 1100 structures from the PDB. It is demonstrated that the ability of Fitmunk to model more than 95% of side chains accurately is beneficial for improving the quality of crystallographic protein models, especially at medium and low resolutions. Fitmunk can be used for model validation of existing structures and as a tool to assess whether side chains are modeled optimally or could be better fitted into electron density. Fitmunk is available as a web service at http://kniahini.med.virginia.edu/fitmunk/ server/ or at http://fitmunk.bitbucket.org/.",
                "authors": [
                    {
                        "name": "Cymborowski M."
                    },
                    {
                        "name": "Minor W."
                    },
                    {
                        "name": "Pasenkiewicz-Gierula M."
                    },
                    {
                        "name": "Porebski P.J."
                    }
                ],
                "citationCount": 21,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "Fitmunk: Improving protein structures by accurate, automatic modeling of side-chain conformations"
            },
            "pmid": "26894674"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
