{
    "accessibility": [],
    "additionDate": "2018-07-21T09:51:40Z",
    "biotoolsCURIE": "biotools:cnn-blpred",
    "biotoolsID": "cnn-blpred",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "dbkc@ncat.edu",
            "gridid": null,
            "name": "KC Dukka",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Convolutional neural network based predictor for β-Lactamases (BL) and their classes.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein function analysis",
                    "uri": "http://edamontology.org/operation_2414"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/whiteclarence/CNN-BLPred",
    "homepage_status": 0,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "CNN-BLPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1972-6",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: The β-Lactamase (BL) enzyme family is an important class of enzymes that plays a key role in bacterial resistance to antibiotics. As the newly identified number of BL enzymes is increasing daily, it is imperative to develop a computational tool to classify the newly identified BL enzymes into one of its classes. There are two types of classification of BL enzymes: Molecular Classification and Functional Classification. Existing computational methods only address Molecular Classification and the performance of these existing methods is unsatisfactory. Results: We addressed the unsatisfactory performance of the existing methods by implementing a Deep Learning approach called Convolutional Neural Network (CNN). We developed CNN-BLPred, an approach for the classification of BL proteins. The CNN-BLPred uses Gradient Boosted Feature Selection (GBFS) in order to select the ideal feature set for each BL classification. Based on the rigorous benchmarking of CCN-BLPred using both leave-one-out cross-validation and independent test sets, CCN-BLPred performed better than the other existing algorithms. Compared with other architectures of CNN, Recurrent Neural Network, and Random Forest, the simple CNN architecture with only one convolutional layer performs the best. After feature extraction, we were able to remove ~95% of the 10,912 features using Gradient Boosted Trees. During 10-fold cross validation, we increased the accuracy of the classic BL predictions by 7%. We also increased the accuracy of Class A, Class B, Class C, and Class D performance by an average of 25.64%. The independent test results followed a similar trend. Conclusions: We implemented a deep learning algorithm known as Convolutional Neural Network (CNN) to develop a classifier for BL classification. Combined with feature selection on an exhaustive feature set and using balancing method such as Random Oversampling (ROS), Random Undersampling (RUS) and Synthetic Minority Oversampling Technique (SMOTE), CNN-BLPred performs significantly better than existing algorithms for BL classification.",
                "authors": [
                    {
                        "name": "White C."
                    },
                    {
                        "name": "Ismail H.D."
                    },
                    {
                        "name": "Saigo H."
                    },
                    {
                        "name": "KC D.B."
                    }
                ],
                "citationCount": 1,
                "date": "2017-12-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CNN-BLPred: A Convolutional neural network based predictor for β-Lactamases (BL) and their classes"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1,
    "version": []
}