{
    "additionDate": "2018-05-09T16:09:35Z",
    "biotoolsCURIE": "biotools:orio",
    "biotoolsID": "orio",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.niehs.nih.gov/about/od/ocpl/contact/"
        }
    ],
    "description": "Online Resource for Integrative Omics- a web-based platform for rapid integration of next generation sequencing data..",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://orio.niehs.nih.gov/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "https://orio.niehs.nih.gov/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "ORIO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKX270",
            "metadata": {
                "abstract": "Established and emerging next generation sequencing (NGS)-based technologies allow for genomewide interrogation of diverse biological processes. However, accessibility of NGS data remains a problem, and few user-friendly resources exist for integrative analysis of NGS data from different sources and experimental techniques. Here, we present Online Resource for Integrative Omics (ORIO; https: //orio.niehs.nih.gov/), a web-based resource with an intuitive user interface for rapid analysis and integration ofNGS data. To use ORIO, the user specifies NGS data of interest along with a list of genomic coordinates. Genomic coordinatesmay be biologically relevant features from a variety of sources, such as ChIPseq peaks for a given protein or transcription start sites from known gene models. ORIO first iteratively finds read coverage values at each genomic feature for each NGS dataset. Data are then integrated using clustering-based approaches, giving hierarchical relationships across NGS datasets and separating individual genomic features into groups. In focusing its analysis on read coverage, ORIO makes limited assumptions about the analyzed data; this allows the tool to be applied across data from a variety of experiments and techniques. Results from analysis are presented in dynamic displays alongside usercontrolled statistical tests, supporting rapid statistical validation of observed results. We emphasize the versatility of ORIO through diverse examples, ranging from NGS data quality control to characterization of enhancer regions and integration of gene expression information. Easily accessible on a public web server, we anticipate wide use of ORIO in genomewide investigations by life scientists.",
                "authors": [
                    {
                        "name": "Adelman K."
                    },
                    {
                        "name": "Bennett B.D."
                    },
                    {
                        "name": "Burkholder A.B."
                    },
                    {
                        "name": "Fargo D.C."
                    },
                    {
                        "name": "Lavender C.A."
                    },
                    {
                        "name": "Shapiro A.J."
                    }
                ],
                "citationCount": 7,
                "date": "2017-06-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ORIO (Online Resource for Integrative Omics): A web-based platform for rapid integration of next generation sequencing data"
            },
            "pmcid": "PMC5449597",
            "pmid": "28402545"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
