{
    "additionDate": "2017-12-18T00:05:32Z",
    "biotoolsCURIE": "biotools:ddna",
    "biotoolsID": "ddna",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sparks-lab.org/"
        }
    ],
    "description": "DDNA is a software for interaction energy between protein and DNA",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://sparks-lab.org/Softwares-Services_files/notices.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://sparks-lab.org/yueyang/DFIRE/ddna3-DB-service.php",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ddna-3-1-dnaprotein-complex-interaction-energy.html"
        }
    ],
    "name": "DDNA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq295",
            "metadata": {
                "abstract": "Motivation: Template-based prediction of DNA binding proteins requires not only structural similarity between target and template structures but also prediction of binding affinity between the target and DNA to ensure binding. Here, we propose to predict protein-DNA binding affinity by introducing a new volume-fraction correction to a statistical energy function based on a distance-scaled, finite, ideal-gas reference (DFIRE) state. Results: We showed that this energy function together with the structural alignment program TM-align achieves the Matthews correlation coefficient (MCC) of 0.76 with an accuracy of 98%, a precision of 93% and a sensitivity of 64%, for predicting DNA binding proteins in a benchmark of 179 DNA binding proteins and 3797 nonbinding proteins. The MCC value is substantially higher than the best MCC value of 0.69 given by previous methods. Application of this method to 2235 structural genomics targets uncovered 37 as DNA binding proteins, 27 (73%) of which are putatively DNA binding and only 1 protein whose annotated functions do not contain DNA binding, while the remaining proteins have unknown function. The method provides a highly accurate and sensitive technique for structure-based prediction of DNA binding proteins. © The Author 2010. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhao H."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 62,
                "date": "2010-06-04T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Structure-based prediction of DNA-binding proteins by structural alignment and a volume-fraction corrected DFIRE-based energy function"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "3.1"
    ]
}
