{
    "additionDate": "2020-01-14T09:24:19Z",
    "biotoolsCURIE": "biotools:PharmActa",
    "biotoolsID": "PharmActa",
    "confidence_flag": "medium",
    "description": "Personalized pharmaceutical care eHealth platform for patients and pharmacists.\n\nCommunity pharmacists are critically placed in the patient care chain being an extended frontline within primary healthcare networks across Europe. They are trained to ensure safe and effective medication use, a crucial and responsible role, extending beyond the common misconception limited to just providing timely access to medicines for the population. Technology-wise, eHealth being committed to an effective, networked, patient-centered and accessible healthcare would prove a real asset in this direction by achieving improved therapy adherence with better outcomes and direct contribution to a cost-effective healthcare system. In this work, we present PharmActa, a personalized eHealth platform that addresses key features of pharmaceutical care and enhances communication of pharmacists with patients for optimizing pharmacotherapy.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31689550",
    "lastUpdate": "2020-01-14T09:24:19Z",
    "name": "PharmActa",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JBI.2019.103336",
            "metadata": {
                "abstract": "© 2019Community pharmacists are critically placed in the patient care chain being an extended frontline within primary healthcare networks across Europe. They are trained to ensure safe and effective medication use, a crucial and responsible role, extending beyond the common misconception limited to just providing timely access to medicines for the population. Technology-wise, eHealth being committed to an effective, networked, patient-centered and accessible healthcare would prove a real asset in this direction by achieving improved therapy adherence with better outcomes and direct contribution to a cost-effective healthcare system. In this work, we present PharmActa, a personalized eHealth platform that addresses key features of pharmaceutical care and enhances communication of pharmacists with patients for optimizing pharmacotherapy. PharmActa empowers patients by providing pharmaceutical care services, such as drug interactions tools, reminders for assisting adhesion and compliance, information regarding adverse drug reactions, as well as pharmacovigilance along with related tools for healthcare management. In addition, it allows the pharmacists to review the medication history in order to provide personalized pharmaceutical care services; thus enhancing their role as healthcare providers. Finally, a mechanism allowing such a system to be interconnected with a developed medical repository following European and International interoperability standards, is also presented. Thus far, the evaluation results presented in this work indicate that PharmActa can be of great benefit to healthcare professionals, especially pharmacists and patients.",
                "authors": [
                    {
                        "name": "Spanakis M."
                    },
                    {
                        "name": "Sfakianakis S."
                    },
                    {
                        "name": "Kallergis G."
                    },
                    {
                        "name": "Spanakis E.G."
                    },
                    {
                        "name": "Sakkalis V."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "PharmActa: Personalized pharmaceutical care eHealth platform for patients and pharmacists"
            },
            "pmid": "31689550"
        }
    ],
    "topic": [
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        },
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        }
    ]
}