{
    "additionDate": "2015-07-31T13:40:10Z",
    "biotoolsCURIE": "biotools:tronco",
    "biotoolsID": "tronco",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "marco.antoniotti@unimib.it",
            "name": "Marco Antoniotti",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tronco@disco.unimib.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bimib.disco.unimib.it/"
        },
        {
            "name": "ELIXIR-ITA-BICOCCA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "An R suite for state-of-the-art algorithms for the reconstruction of causal models of cancer progressions from genomic cross-sectional data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/troncopackage/home"
        }
    ],
    "editPermission": {
        "authors": [
            "marco.antoniotti"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/troncopackage/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:23:43.414948Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tronco-inference-of-cancer-progession-models.html"
        }
    ],
    "name": "TRONCO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "marco.antoniotti",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw035",
            "metadata": {
                "abstract": "Motivation: We introduce TRanslational ONCOlogy (TRONCO), an open-source R package that implements the state-of-the-art algorithms for the inference of cancer progression models from (epi)genomic mutational profiles. TRONCO can be used to extract population-level models describing the trends of accumulation of alterations in a cohort of cross-sectional samples, e.g. retrieved from publicly available databases, and individual-level models that reveal the clonal evolutionary history in single cancer patients, when multiple samples, e.g. multiple biopsies or single-cell sequencing data, are available. The resulting models can provide key hints for uncovering the evolutionary trajectories of cancer, especially for precision medicine or personalized therapy.",
                "authors": [
                    {
                        "name": "Antoniotti M."
                    },
                    {
                        "name": "Caravagna G."
                    },
                    {
                        "name": "De Sano L."
                    },
                    {
                        "name": "Graudenzi A."
                    },
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Mishra B."
                    },
                    {
                        "name": "Ramazzotti D."
                    }
                ],
                "citationCount": 29,
                "date": "2016-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TRONCO: An R package for the inference of cancer progression models from heterogeneous genomic data"
            },
            "pmcid": "PMC6280783",
            "pmid": "26861821",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1371/journal.pone.0108358",
            "metadata": {
                "abstract": "Existing techniques to reconstruct tree models of progression for accumulative processes, such as cancer, seek to estimate causation by combining correlation and a frequentist notion of temporal priority. In this paper, we define a novel theoretical framework called CAPRESE (CAncer PRogression Extraction with Single Edges) to reconstruct such models based on the notion of probabilistic causation defined by Suppes. We consider a general reconstruction setting complicated by the presence of noise in the data due to biological variation, as well as experimental or measurement errors. To improve tolerance to noise we define and use a shrinkage-like estimator. We prove the correctness of our algorithm by showing asymptotic convergence to the correct tree under mild constraints on the level of noise. Moreover, on synthetic data, we show that our approach outperforms the state-of-the-art, that it is efficient even with a relatively small number of samples and that its performance quickly converges to its asymptote as the number of samples increases. For real cancer datasets obtained with different technologies, we highlight biologically significant differences in the progressions inferred with respect to other competing techniques and we also show how to validate conjectured biological relations with progression models.",
                "authors": [
                    {
                        "name": "Antoniotti M."
                    },
                    {
                        "name": "Caravagna G."
                    },
                    {
                        "name": "Graudenzi A."
                    },
                    {
                        "name": "Loohuis L.O."
                    },
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Mishra B."
                    },
                    {
                        "name": "Ramazzotti D."
                    }
                ],
                "citationCount": 45,
                "date": "2014-10-09T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Inferring tree causal models of cancer progression with probability raising"
            },
            "pmcid": "PMC4191986",
            "pmid": "25299648",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btv296",
            "metadata": {
                "abstract": "We devise a novel inference algorithm to effectively solve the cancer progression model reconstruction problem. Our empirical analysis of the accuracy and convergence rate of our algorithm, CAncer PRogression Inference (CAPRI), shows that it outperforms the state-of-the-art algorithms addressing similar problems. Motivation: Several cancer-related genomic data have become available (e.g. The Cancer Genome Atlas, TCGA) typically involving hundreds of patients. At present, most of these data are aggregated in a cross-sectional fashion providing all measurements at the time of diagnosis. Our goal is to infer cancer 'progression' models from such data. These models are represented as directed acyclic graphs (DAGs) of collections of 'selectivity' relations, where a mutation in a gene A 'selects' for a later mutation in a gene B. Gaining insight into the structure of such progressions has the potential to improve both the stratification of patients and personalized therapy choices. Results: The CAPRI algorithm relies on a scoring method based on a probabilistic theory developed by Suppes, coupled with bootstrap and maximum likelihood inference. The resulting algorithm is efficient, achieves high accuracy and has good complexity, also, in terms of convergence properties. CAPRI performs especially well in the presence of noise in the data, and with limited sample sizes. Moreover CAPRI, in contrast to other approaches, robustly reconstructs different types of confluent trajectories despite irregularities in the data. We also report on an ongoing investigation using CAPRI to study atypical Chronic Myeloid Leukemia, in which we uncovered non trivial selectivity relations and exclusivity patterns among key genomic events.",
                "authors": [
                    {
                        "name": "Antoniotti M."
                    },
                    {
                        "name": "Caravagna G."
                    },
                    {
                        "name": "Graudenzi A."
                    },
                    {
                        "name": "Korsunsky I."
                    },
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Mishra B."
                    },
                    {
                        "name": "Olde Loohuis L."
                    },
                    {
                        "name": "Ramazzotti D."
                    }
                ],
                "citationCount": 70,
                "date": "2015-07-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CAPRI: Efficient inference of cancer progression models from cross-sectional data"
            },
            "pmid": "25971740",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "2"
    ]
}
