{
    "additionDate": "2018-05-29T09:37:52Z",
    "biotoolsCURIE": "biotools:dcgl",
    "biotoolsID": "dcgl",
    "credit": [
        {
            "email": "bhliu@scbit.org",
            "name": "Bao-Hong Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Unveiling Differential Regulation from Differential Co-expression.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/DCGL/DCGL.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/DCGL/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "DCGL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0079729",
            "metadata": {
                "abstract": "Motivation: Differential co-expression analysis (DCEA) has emerged in recent years as a novel, systematic investigation into gene expression data. While most DCEA studies or tools focus on the co-expression relationships among genes, some are developing a potentially more promising research domain, differential regulation analysis (DRA). In our previously proposed R package DCGL v1.0, we provided functions to facilitate basic differential co-expression analyses; however, the output from DCGL v1.0 could not be translated into differential regulation mechanisms in a straightforward manner. Results: To advance from DCEA to DRA, we upgraded the DCGL package from v1.0 to v2.0. A new module named \"Differential Regulation Analysis\" (DRA) was designed, which consists of three major functions: DRsort, DRplot, and DRrank. DRsort selects differentially regulated genes (DRGs) and differentially regulated links (DRLs) according to the transcription factor (TF)-to-target information. DRrank prioritizes the TFs in terms of their potential relevance to the phenotype of interest. DRplot graphically visualizes differentially co-expressed links (DCLs) and/or TF-to-target links in a network context. In addition to these new modules, we streamlined the codes from v1.0. The evaluation results proved that our differential regulation analysis is able to capture the regulators relevant to the biological subject. Conclusions: With ample functions to facilitate differential regulation analysis, DCGL v2.0 was upgraded from a DCEA tool to a DRA tool, which may unveil the underlying differential regulation from the observed differential co-expression. DCGL v2.0 can be applied to a wide range of gene expression data in order to systematically identify novel regulators that have not yet been documented as critical. Availability: DCGL v2.0 package is available at http://cran.r-project.org/web/packages/DCGL/index.html or at our project home page http://lifecenter.sgst.cn/main/en/dcgl.jsp. © 2013 Yang et al.",
                "authors": [
                    {
                        "name": "Li Y.-X."
                    },
                    {
                        "name": "Li Y.-Y."
                    },
                    {
                        "name": "Liu B.-H."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Ma L.-X."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "citationCount": 73,
                "date": "2013-11-20T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "DCGL v2.0: An R package for unveiling differential regulation from differential co-expression"
            },
            "pmcid": "PMC3835854",
            "pmid": "24278165"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
