{
    "additionDate": "2021-01-18T09:10:59Z",
    "biotoolsCURIE": "biotools:hic-hiker",
    "biotoolsID": "hic-hiker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ryonakabayashi@g.ecc.u-tokyo.ac.jp",
            "name": "Ryo Nakabayashi",
            "orcidid": "https://orcid.org/0000-0003-0779-5929",
            "typeEntity": "Person"
        },
        {
            "email": "moris@edu.k.u-tokyo.ac.jp",
            "name": "Shinichi Morishita",
            "orcidid": "https://orcid.org/0000-0002-6201-8885",
            "typeEntity": "Person"
        }
    ],
    "description": "A probabilistic model to determine contig orientation in chromosome-length scaffolds with Hi-C.\n\nThis will install the python package (and its cli command) hic_hiker.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ryought/hic_hiker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T11:30:46Z",
    "license": "BSD-3-Clause",
    "name": "HiC-Hiker",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA288",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: De novo assembly of reference-quality genomes used to require enormously laborious tasks. In particular, it is extremely time-consuming to build genome markers for ordering assembled contigs along chromosomes; thus, they are only available for well-established model organisms. To resolve this issue, recent studies demonstrated that Hi-C could be a powerful and cost-effective means to output chromosome-length scaffolds for non-model species with no genome marker resources, because the Hi-C contact frequency between a pair of two loci can be a good estimator of their genomic distance, even if there is a large gap between them. Indeed, state-of-the-art methods such as 3D-DNA are now widely used for locating contigs in chromosomes. However, it remains challenging to reduce errors in contig orientation because shorter contigs have fewer contacts with their neighboring contigs. These orientation errors lower the accuracy of gene prediction, read alignment, and synteny block estimation in comparative genomics. Results: To reduce these contig orientation errors, we propose a new algorithm, named HiC-Hiker, which has a firm grounding in probabilistic theory, rigorously models Hi-C contacts across contigs, and effectively infers the most probable orientations via the Viterbi algorithm. We compared HiC-Hiker and 3D-DNA using human and worm genome contigs generated from short reads, evaluated their performances, and observed a remarkable reduction in the contig orientation error rate from 4.3% (3D-DNA) to 1.7% (HiC-Hiker). Our algorithm can consider long-range information between distal contigs and precisely estimates Hi-C read contact probabilities among contigs, which may also be useful for determining the ordering of contigs.",
                "authors": [
                    {
                        "name": "Nakabayashi R."
                    },
                    {
                        "name": "Morishita S."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HiC-Hiker: A probabilistic model to determine contig orientation in chromosome-length scaffolds with Hi-C"
            },
            "pmcid": "PMC7672694",
            "pmid": "32369554"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}