{
    "additionDate": "2017-08-03T18:51:06Z",
    "biotoolsCURIE": "biotools:metapsicov",
    "biotoolsID": "metapsicov",
    "credit": [
        {
            "email": "t.singh@ucl.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinf.cs.ucl.ac.uk/contact/"
        }
    ],
    "description": "Algorithm incorporating different approaches of contact predictions implemented with a neural network in order to improve the accuracies of the predicted contacts.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinf.cs.ucl.ac.uk/introduction/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.cs.ucl.ac.uk/MetaPSICOV/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/metapsicov-1-01-precise-structural-contact-prediction.html"
        }
    ],
    "name": "MetaPSICOV",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014.Motivation: Recent developments of statistical techniques to infer direct evolutionary couplings between residue pairs have rendered covariation-based contact prediction a viable means for accurate 3D modelling of proteins, with no information other than the sequence required. To extend the usefulness of contact prediction, we have designed a new meta-predictor (MetaPSICOV) which combines three distinct approaches for inferring covariation signals from multiple sequence alignments, considers a broad range of other sequence-derived features and, uniquely, a range of metrics which describe both the local and global quality of the input multiple sequence alignment. Finally, we use a two-stage predictor, where the second stage filters the output of the first stage. This two-stage predictor is additionally evaluated on its ability to accurately predict the long range network of hydrogen bonds, including correctly assigning the donor and acceptor residues. Results: Using the original PSICOV benchmark set of 150 protein families, MetaPSICOV achieves a mean precision of 0.54 for top-L predicted long range contacts - around 60% higher than PSICOV, and around 40% better than CCMpred. In de novo protein structure prediction using FRAGFOLD, MetaPSICOV is able to improve the TM-scores of models by a median of 0.05 compared with PSICOV. Lastly, for predicting long range hydrogen bonding, MetaPSICOV-HB achieves a precision of 0.69 for the top-L/10 hydrogen bonds compared with just 0.26 for the baseline MetaPSICOV.",
                "authors": [
                    {
                        "name": "Jones D.T."
                    },
                    {
                        "name": "Singh T."
                    },
                    {
                        "name": "Kosciolek T."
                    },
                    {
                        "name": "Tetchner S."
                    }
                ],
                "citationCount": 194,
                "date": "2015-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MetaPSICOV: Combining coevolution methods for accurate prediction of contacts and long range hydrogen bonding in proteins"
            },
            "pmid": "25431331"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}