{
    "additionDate": "2021-03-19T08:29:14Z",
    "biotoolsCURIE": "biotools:pcirc",
    "biotoolsID": "pcirc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "glli@snnu.edu.cn",
            "name": "Guanglin Li",
            "typeEntity": "Person"
        }
    ],
    "description": "PCirc is a pipeline to predict plant circular RNA (CircRNA) which based on Python3. It can identify circRNA from a given RNA-seq data by high-throughput. The pipeline can alignment RNA_seq and extract features ,then based on Random Forest classification, the final circRNA will be predicted. The user only needs to run the python scripts step by step to get the predicted circular RNA.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Lilab-SNNU/Pcirc",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-03-27T13:01:02Z",
    "license": "GPL-3.0",
    "name": "Pcirc",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03944-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Circular RNA (circRNA) is a novel type of RNA with a closed-loop structure. Increasing numbers of circRNAs are being identified in plants and animals, and recent studies have shown that circRNAs play an important role in gene regulation. Therefore, identifying circRNAs from increasing amounts of RNA-seq data is very important. However, traditional circRNA recognition methods have limitations. In recent years, emerging machine learning techniques have provided a good approach for the identification of circRNAs in animals. However, using these features to identify plant circRNAs is infeasible because the characteristics of plant circRNA sequences are different from those of animal circRNAs. For example, plants are extremely rich in splicing signals and transposable elements, and their sequence conservation in rice, for example is far less than that in mammals. To solve these problems and better identify circRNAs in plants, it is urgent to develop circRNA recognition software using machine learning based on the characteristics of plant circRNAs. Results: In this study, we built a software program named PCirc using a machine learning method to predict plant circRNAs from RNA-seq data. First, we extracted different features, including open reading frames, numbers of k-mers, and splicing junction sequence coding, from rice circRNA and lncRNA data. Second, we trained a machine learning model by the random forest algorithm with tenfold cross-validation in the training set. Third, we evaluated our classification according to accuracy, precision, and F1 score, and all scores on the model test data were above 0.99. Fourth, we tested our model by other plant tests, and obtained good results, with accuracy scores above 0.8. Finally, we packaged the machine learning model built and the programming script used into a locally run circular RNA prediction software, Pcirc (https://github.com/Lilab-SNNU/Pcirc). Conclusion: Based on rice circRNA and lncRNA data, a machine learning model for plant circRNA recognition was constructed in this study using random forest algorithm, and the model can also be applied to plant circRNA recognition such as Arabidopsis thaliana and maize. At the same time, after the completion of model construction, the machine learning model constructed and the programming scripts used in this study are packaged into a localized circRNA prediction software Pcirc, which is convenient for plant circRNA researchers to use.",
                "authors": [
                    {
                        "name": "Yin S."
                    },
                    {
                        "name": "Tian X."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Sun P."
                    },
                    {
                        "name": "Li G."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PCirc: random forest-based plant circRNA identification software"
            },
            "pmcid": "PMC7789375",
            "pmid": "33407069"
        }
    ],
    "toolType": [
        "Workflow",
        "Library"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}