{
    "additionDate": "2021-03-19T09:14:03Z",
    "biotoolsCURIE": "biotools:jcs",
    "biotoolsID": "jcs",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "description": "An Explainable COVID-19 Diagnosis System by Joint Classification and Segmentation.\n\nOfficial repository of the paper: JCS: An explainable COVID-19 diagnosis system by joint classification and segmentation, IEEE Transactions on Image Processing (TIP) 2021.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuhuan-wu/JCS",
    "lastUpdate": "2021-04-05T09:12:18.339256Z",
    "name": "JCS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TIP.2021.3058783",
            "metadata": {
                "abstract": "IEEERecently, the coronavirus disease 2019 (COVID-19) has caused a pandemic disease in over 200 countries, influencing billions of humans. To control the infection, identifying and separating the infected people is the most crucial step. The main diagnostic tool is the Reverse Transcription Polymerase Chain Reaction (RT-PCR) test. Still, the sensitivity of the RT-PCR test is not high enough to effectively prevent the pandemic. The chest CT scan test provides a valuable complementary tool to the RT-PCR test, and it can identify the patients in early-stage with high sensitivity. However, the chest CT scan test is usually time-consuming, requiring about 21.5 minutes per case. This paper develops a novel Joint Classification and Segmentation (JCS) system to perform real-time and explainable COVID-19 chest CT diagnosis. To train our JCS system, we construct a large scale COVID-19 Classification and Segmentation (COVID-CS) dataset, with 144,167 chest CT images of 400 COVID-19 patients and 350 uninfected cases. 3,855 chest CT images of 200 patients are annotated with fine-grained pixel-level labels of opacifications, which are increased attenuation of the lung parenchyma. We also have annotated lesion counts, opacification areas, and locations and thus benefit various diagnosis aspects. Extensive experiments demonstrate that the proposed JCS diagnosis system is very efficient for COVID-19 classification and segmentation. It obtains an average sensitivity of 95.0% and a specificity of 93.0% on the classification test set, and 78.5% Dice score on the segmentation test set of our COVID-CS dataset. The COVID-CS dataset and Code are available at https://github.com/yuhuan-wu/JCS.",
                "authors": [
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Mei J."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Fan D."
                    },
                    {
                        "name": "Zhang R."
                    },
                    {
                        "name": "Cheng M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "JCS: An Explainable COVID-19 Diagnosis System by Joint Classification and Segmentation"
            },
            "pmid": "33600316"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}