
{
    "credit": [
        {
            "email": "nicola.bombieri@univr.it",
            "name": "Nicola Bombieri",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "fedebusato@gmail.com",
            "name": "Federico Busato",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://profs.scienze.univr.it/~bombieri/APPAGATO/software/Documentation.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://bitbucket.org/federico_busato/appagato/get/c0a0a5bccbff.zip"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "C++"
        ],
        "license": "MIT",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Zoology",
                "uri": "http://edamontology.org/topic_3500"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://bitbucket.org/federico_busato/appagato"
        },
        {
            "type": "ISSUE_TRACKER",
            "url": "https://bitbucket.org/federico_busato/appagato/issues?status=new&status=open"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. Motivation: Biological network querying is a problem requiring a considerable computational effort to be solved. Given a target and a query network, it aims to find occurrences of the query in the target by considering topological and node similarities (i.e. mismatches between nodes, edges, or node labels). Querying tools that deal with similarities are crucial in biological network analysis because they provide meaningful results also in case of noisy data. In addition, as the size of available networks increases steadily, existing algorithms and tools are becoming unsuitable. This is rising new challenges for the design of more efficient and accurate solutions. Results: This paper presents APPAGATO, a stochastic and parallel algorithm to find approximate occurrences of a query network in biological networks. APPAGATO handles node, edge and node label mismatches. Thanks to its randomic and parallel nature, it applies to large networks and, compared with existing tools, it provides higher performance as well as statistically significant more accurate results. Tests have been performed on protein-protein interaction networks annotated with synthetic and real gene ontology terms. Case studies have been done by querying protein complexes among different species and tissues. Availability and implementation: APPAGATO has been developed on top of CUDA-C ++ Toolkit 7.0 framework. The software is available online http://profs.sci.univr.it/∼bombieri/APPAGATO. Contact: Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Bonnici V.",
                "Busato F.",
                "Micale G.",
                "Bombieri N.",
                "Pulvirenti A.",
                "Giugno R."
            ],
            "cit_count": 9,
            "doi": "10.1093/bioinformatics/btw223",
            "journal": "Bioinformatics",
            "title": "APPAGATO: An APproximate PArallel and stochastic GrAph querying TOol for biological networks",
            "type": "Primary",
            "year": "2016-07-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:APPAGATO",
        "biotoolsID": "APPAGATO",
        "description": "APproximate PArallel and stochastic GrAph querying TOol for biological networks.",
        "homepage": "http://profs.scienze.univr.it/~bombieri/APPAGATO/",
        "name": "APPAGATO"
    }
}