{"credit":[{"email":"jmartin@wustl.edu","name":"Webamster","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://nematode.net/NN3_frontpage.cgi?navbar_selection=home&subnav_selection=faq"}],"function":[{"operation":[{"term":"Genome feature comparison","uri":"http://edamontology.org/operation_3194"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Experimental design and studies","uri":"http://edamontology.org/topic_3678"},{"term":"Comparative genomics","uri":"http://edamontology.org/topic_0797"},{"term":"Endocrinology and metabolism","uri":"http://edamontology.org/topic_3407"},{"term":"Zoology","uri":"http://edamontology.org/topic_3500"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"Nematode.net (http://nematode.net) has been a publicly available resource for studying nematodes for over a decade. In the past 3 years, we reorganized Nematode.net to provide more user-friendly navigation through the site, a necessity due to the explosion of data from next-generation sequencing platforms. Organism-centric portals containing dynamically generated data are available for over 56 different nematode species. Next-generation data has been added to the various data-mining portals hosted, including NemaBLAST and NemaBrowse. The NemaPath metabolic pathway viewer builds associations using KOs, rather than ECs to provide more accurate and fine-grained descriptions of proteins. Two new features for data analysis and comparative genomics have been added to the site. NemaSNP enables the user to perform population genetics studies in various nematode populations using next-generation sequencing data. HelmCoP (Helminth Control and Prevention) as an independent component of Nematode.net provides an integrated resource for storage, annotation and comparative genomics of helminth genomes to aid in learning more about nematode genomes, as well as drug, pesticide, vaccine and drug target discovery. With this update, Nematode.net will continue to realize its original goal to disseminate diverse bioinformatic data sets and provide analysis tools to the broad scientific community in a useful and user-friendly manner. © The Author(s) 2011.","authors":["Martin J.","Abubucker S.","Heizer E.","Taylor C.M.","Mitreva M."],"cit_count":37,"journal":"Nucleic Acids Research","pmid":"22139919","title":"Nematode.net update 2011: Addition of data sets and tools featuring next-generation sequencing data","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:nematode.net","biotoolsID":"nematode.net","description":"Publicly available resource for studying nematodes. Next-generation data has been added to various data-mining portals. Features for data analysis and comparative genomics.","homepage":"http://nematode.net/NN3_frontpage.cgi","name":"Nematode.net"}}