{
    "accessibility": "Open access",
    "additionDate": "2021-01-02T13:27:05Z",
    "biotoolsCURIE": "biotools:kipes",
    "biotoolsID": "kipes",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Boas Pucker",
            "orcidid": "https://orcid.org/0000-0002-3321-7471",
            "typeRole": [
                "Developer",
                "Primary contact"
            ],
            "url": "https://www.cebitec.uni-bielefeld.de/~bpucker"
        }
    ],
    "description": "Knowledge-based Identification of Pathway Enzymes (KIPEs) allows the identification of players in a pathway or gene families. The identification relies of sequence similarity and phylogenetic relationships. Additionally, it is possible to consider functionally relevant amino acids.",
    "documentation": [
        {
            "type": [
                "Command-line options",
                "General"
            ],
            "url": "https://github.com/bpucker/KIPEs"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/bpucker/KIPEs"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/bpucker/KIPEs",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:51:14.589149Z",
    "maturity": "Mature",
    "name": "Knowledge-based Identification of Pathway Enzymes",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "bpucker",
    "publication": [
        {
            "doi": "10.3390/plants9091103",
            "metadata": {
                "abstract": "The flavonoid biosynthesis is a well-characterised model system for specialised metabolism and transcriptional regulation in plants. Flavonoids have numerous biological functions such as UV protection and pollinator attraction, but also biotechnological potential. Here, we present Knowledge-based Identification of Pathway Enzymes (KIPEs) as an automatic approach for the identification of players in the flavonoid biosynthesis. KIPEs combines comprehensive sequence similarity analyses with the inspection of functionally relevant amino acid residues and domains in subjected peptide sequences. Comprehensive sequence sets of flavonoid biosynthesis enzymes and knowledge about functionally relevant amino acids were collected. As a proof of concept, KIPEs was applied to investigate the flavonoid biosynthesis of the medicinal plant Croton tiglium on the basis of a transcriptome assembly. Enzyme candidates for all steps in the biosynthesis network were identified and matched to previous reports of corresponding metabolites in Croton species.",
                "authors": [
                    {
                        "name": "Pucker B."
                    },
                    {
                        "name": "Reiher F."
                    },
                    {
                        "name": "Schilbert H.M."
                    }
                ],
                "citationCount": 36,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Plants",
                "title": "Automatic identification of players in the flavonoid biosynthesis with application on the biomedicinal plant croton tiglium"
            },
            "pmcid": "PMC7570183",
            "pmid": "32867203",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}
