{
    "accessibility": "Open access",
    "additionDate": "2024-01-01T18:18:54.580683Z",
    "biotoolsCURIE": "biotools:ctd_tetramers",
    "biotoolsID": "ctd_tetramers",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "apdavis3@ncsu.edu",
            "name": "Allan Peter Davis",
            "orcidid": "https://orcid.org/0000-0002-5741-7128",
            "typeEntity": "Person"
        },
        {
            "name": "Jolene Wiegers",
            "typeEntity": "Person"
        },
        {
            "name": "Thomas C Wiegers",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool that computationally links curated chemicals, genes, phenotypes, and diseases to inform molecular mechanisms for environmental health.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://ctdbase.org/query.go?type=tetramer",
    "lastUpdate": "2024-01-01T18:18:54.583306Z",
    "name": "CTD Tetramers",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/TOXSCI/KFAD069",
            "metadata": {
                "abstract": "The molecular mechanisms connecting environmental exposures to adverse endpoints are often unknown, reflecting knowledge gaps. At the Comparative Toxicogenomics Database (CTD), we developed a bioinformatics approach that integrates manually curated, literature-based interactions from CTD to generate a \"CGPD-tetramer\": a 4-unit block of information organized as a step-wise molecular mechanism linking an initiating Chemical, an interacting Gene, a Phenotype, and a Disease outcome. Here, we describe a novel, user-friendly tool called CTD Tetramers that generates these evidence-based CGPD-tetramers for any curated chemical, gene, phenotype, or disease of interest. Tetramers offer potential solutions for the unknown underlying mechanisms and intermediary phenotypes connecting a chemical exposure to a disease. Additionally, multiple tetramers can be assembled to construct detailed modes-of-action for chemical-induced disease pathways. As well, tetramers can help inform environmental influences on adverse outcome pathways (AOPs). We demonstrate the tool's utility with relevant use cases for a variety of environmental chemicals (eg, perfluoroalkyl substances, bisphenol A), phenotypes (eg, apoptosis, spermatogenesis, inflammatory response), and diseases (eg, asthma, obesity, male infertility). Finally, we map AOP adverse outcome terms to corresponding CTD terms, allowing users to query for tetramers that can help augment AOP pathways with additional stressors, genes, and phenotypes, as well as formulate potential AOP disease networks (eg, liver cirrhosis and prostate cancer). This novel tool, as part of the complete suite of tools offered at CTD, provides users with computational datasets and their supporting evidence to potentially fill exposure knowledge gaps and develop testable hypotheses about environmental health.",
                "authors": [
                    {
                        "name": "Barkalow F."
                    },
                    {
                        "name": "Davis A.P."
                    },
                    {
                        "name": "Johnson R.J."
                    },
                    {
                        "name": "Mattingly C.J."
                    },
                    {
                        "name": "Planchart A."
                    },
                    {
                        "name": "Sciaky D."
                    },
                    {
                        "name": "Strong M."
                    },
                    {
                        "name": "Wiegers J."
                    },
                    {
                        "name": "Wiegers T.C."
                    },
                    {
                        "name": "Wyatt B."
                    }
                ],
                "citationCount": 2,
                "date": "2023-10-01T00:00:00Z",
                "journal": "Toxicological Sciences",
                "title": "CTD tetramers: a new online tool that computationally links curated chemicals, genes, phenotypes, and diseases to inform molecular mechanisms for environmental health"
            },
            "pmcid": "PMC10535784",
            "pmid": "37486259"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
