
{
    "credit": [
        {
            "email": "venclovas@ibt.lt",
            "name": "Česlovas Venclovas",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.bti.vu.lt/en/departments/department-of-bioinformatics/software/coma"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Sequence alignment comparison",
                    "uri": "http://edamontology.org/operation_0259"
                },
                {
                    "term": "Sequence profile alignment",
                    "uri": "http://edamontology.org/operation_0300"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Detection of common evolutionary origin (homology) is a primary means of inferring protein structure and function. At present, comparison of protein families represented as sequence profiles is arguably the most effective homology detection strategy. However, finding the best way to represent evolutionary information of a protein sequence family in the profile, to compare profiles and to estimate the biological significance of such comparisons, remains an active area of research.Results: Here, we present a new homology detection method based on sequence profile-profile comparison. The method has a number of new features including position-dependent gap penalties and a global score system. Position-dependent gap penalties provide a more biologically relevant way to represent and align protein families as sequence profiles. The global score system enables an analytical solution of the statistical parameters needed to estimate the statistical significance of profile-profile similarities. The new method, together with other state-of-the-art profile-based methods (HHsearch, COMPASS and PSI-BLAST), is benchmarked in all-against-all comparison of a challenging set of SCOP domains that share at most 20% sequence identity. For benchmarking, we use a reference (\"gold standard\") free model-based evaluation framework. Evaluation results show that at the level of protein domains our method compares favorably to all other tested methods. We also provide examples of the new method outperforming structure-based similarity detection and alignment. The implementation of the new method both as a standalone software package and as a web server is available at http://www.ibt.lt/bioinformatics/coma.Conclusion: Due to a number of developments, the new profile-profile comparison method shows an improved ability to match distantly related protein domains. Therefore, the method should be useful for annotation and homology modeling of uncharacterized proteins. © 2010 Margelevičius and Venclovas; licensee BioMed Central Ltd.",
            "authors": [
                "Margelevicius M.",
                "Venclovas C."
            ],
            "cit_count": 38,
            "journal": "BMC Bioinformatics",
            "pmid": "20158924",
            "title": "Detection of distant evolutionary relationships between protein families using theory of sequence profile-profile comparison",
            "year": "2010-02-17"
        },
        {
            "abstract": "Summary: Detection of distant homology is a widely used computational approach for studying protein evolution, structure and function. Here, we report a homology search web server based on sequence profile-profile comparison. The user may perform searches in one of several regularly updated profile databases using either a single sequence or a multiple sequence alignment as an input. The same profile databases can also be downloaded for local use. The capabilities of the server are illustrated with the identification of new members of the highly diverse PD-(D/E)XK nuclease superfamily. © The Author 2010. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Margelevicius M.",
                "Laganeckas M.",
                "Venclovas C."
            ],
            "cit_count": 24,
            "journal": "Bioinformatics",
            "pmid": "20529888",
            "title": "COMA server for protein distant homology search",
            "year": "2010-06-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:coma",
        "biotoolsID": "coma",
        "description": "Distant homology detection method based on sequence profile-profile comparison. It takes a protein sequence or multiple sequence alignment as input and searches for remote homologs in SCOP, PDB and PFAM databases.",
        "homepage": "http://www.ibt.lt/bioinformatics/coma/",
        "name": "COMA"
    }
}