{
    "additionDate": "2021-01-18T07:03:07Z",
    "biotoolsCURIE": "biotools:aopedf",
    "biotoolsID": "aopedf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chengf@ccf.org",
            "name": "Feixiong Cheng",
            "orcidid": "https://orcid.org/0000-0002-1736-2847",
            "typeEntity": "Person"
        }
    ],
    "description": "Network-based prediction of drug-target interactions using an arbitrary-order proximity embedded deep forest.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChengF-Lab/AOPEDF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T18:01:19Z",
    "name": "AOPEDF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA010",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Systematic identification of molecular targets among known drugs plays an essential role in drug repurposing and understanding of their unexpected side effects. Computational approaches for prediction of drug-target interactions (DTIs) are highly desired in comparison to traditional experimental assays. Furthermore, recent advances of multiomics technologies and systems biology approaches have generated large-scale heterogeneous, biological networks, which offer unexpected opportunities for network-based identification of new molecular targets among known drugs. Results: In this study, we present a network-based computational framework, termed AOPEDF, an arbitrary-order proximity embedded deep forest approach, for prediction of DTIs. AOPEDF learns a low-dimensional vector representation of features that preserve arbitrary-order proximity from a highly integrated, heterogeneous biological network connecting drugs, targets (proteins) and diseases. In total, we construct a heterogeneous network by uniquely integrating 15 networks covering chemical, genomic, phenotypic and network profiles among drugs, proteins/targets and diseases. Then, we build a cascade deep forest classifier to infer new DTIs. Via systematic performance evaluation, AOPEDF achieves high accuracy in identifying molecular targets among known drugs on two external validation sets collected from DrugCentral [area under the receiver operating characteristic curve (AUROC) = 0.868] and ChEMBL (AUROC = 0.768) databases, outperforming several state-of-the-art methods. In a case study, we showcase that multiple molecular targets predicted by AOPEDF are associated with mechanism-of-action of substance abuse disorder for several marketed drugs (such as aripiprazole, risperidone and haloperidol).",
                "authors": [
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zhu S."
                    },
                    {
                        "name": "Hou Y."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Huang L.F."
                    },
                    {
                        "name": "Lewis S.J."
                    },
                    {
                        "name": "Nussinov R."
                    },
                    {
                        "name": "Cheng F."
                    }
                ],
                "citationCount": 26,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Network-based prediction of drug-target interactions using an arbitrary-order proximity embedded deep forest"
            },
            "pmcid": "PMC7203727",
            "pmid": "31971579"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}