{
    "additionDate": "2017-08-03T19:01:59Z",
    "biotoolsCURIE": "biotools:splicingcompass",
    "biotoolsID": "splicingcompass",
    "credit": [
        {
            "email": "m.aschoff@dkfz.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ibios.dkfz.de/tbi/index.php/network-modeling"
        },
        {
            "email": "rainer.koenig@uni-jena.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The tool predicts genes that are differentially spliced between two different conditions using RNA-seq data. The software is based on geometric angles between high dimensional read count vectors and is able to predict genes that undergo differential splicing from next generation RNA sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.leibniz-hki.de/files/content/institut/oeffentliche_ressourcen/software/SplicingCompass/SplicingCompassTutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splicing model analysis",
                    "uri": "http://edamontology.org/operation_2499"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://www.ichip.de/software/SplicingCompass.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/splicingcompass-1-0-1-differential-splicing-detection-rna-seq-data.html"
        }
    ],
    "name": "SplicingCompass",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Alternative splicing is central for cellular processes and substantially increases transcriptome and proteome diversity. Aberrant splicing events often have pathological consequences and are associated with various diseases and cancer types. The emergence of next-generation RNA sequencing (RNA-seq) provides an exciting new technology to analyse alternative splicing on a large scale. However, algorithms that enable the analysis of alternative splicing from short-read sequencing are not fully established yet and there are still no standard solutions available for a variety of data analysis tasks. We present a new method and software to predict genes that are differentially spliced between two different conditions using RNA-seq data. Our method uses geometric angles between the high dimensional vectors of exon read counts. With this, differential splicing can be detected even if the splicing events are composed of higher complexity and involve previously unknown splicing patterns. We applied our approach to two case studies including neuroblastoma tumour data with favourable and unfavourable clinical courses. We show the validity of our predictions as well as the applicability of our method in the context of patient clustering. We verified our predictions by several methods including simulated experiments and complementary in silico analyses. We found a significant number of exons with specific regulatory splicing factor motifs for predicted genes and a substantial number of publications linking those genes to alternative splicing. Furthermore, we could successfully exploit splicing information to cluster tissues and patients. Finally, we found additional evidence of splicing diversity for many predicted genes in normalized read coverage plots and in reads that span exon-exon junctions. SplicingCompass is licensed under the GNU GPL and freely available as a package in the statistical language R at http://www.ichip.de/software/SplicingCompass.html",
                "authors": [
                    {
                        "name": "Aschoff M."
                    },
                    {
                        "name": "Hotz-Wagenblatt A."
                    },
                    {
                        "name": "Glatting K.H."
                    },
                    {
                        "name": "Fischer M."
                    },
                    {
                        "name": "Eils R."
                    },
                    {
                        "name": "Konig R."
                    }
                ],
                "citationCount": 38,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "SplicingCompass: differential splicing detection using RNA-seq data."
            },
            "pmid": "23449093"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}