{
    "additionDate": "2018-08-01T12:12:39Z",
    "biotoolsCURIE": "biotools:ananke",
    "biotoolsID": "ananke",
    "credit": [
        {
            "email": "mike.hall@dal.ca",
            "name": "Michael W. Hall",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Clustering marker gene data by time-series patterns.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/beiko-lab/ananke"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "https://github.com/beiko-lab/ananke",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "Ananke",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.7717/peerj.3812",
            "metadata": {
                "abstract": "© 2017 Hall et al.Taxonomic markers such as the 16S ribosomal RNA gene are widely used in microbial community analysis. A common first step in marker-gene analysis is grouping genes into clusters to reduce data sets to a more manageable size and potentially mitigate the effects of sequencing error. Instead of clustering based on sequence identity, marker-gene data sets collected over time can be clustered based on temporal correlation to reveal ecologically meaningful associations. We present Ananke, a free and open-source algorithm and software package that complements existing sequence-identity-based clustering approaches by clustering marker-gene data based on time-series profiles and provides interactive visualization of clusters, including highlighting of internal OTU inconsistencies. Ananke is able to cluster distinct temporal patterns from simulations of multiple ecological patterns, such as periodic seasonal dynamics and organism appearances/disappearances. We apply our algorithm to two longitudinal marker gene data sets: faecal communities from the human gut of an individual sampled over one year, and communities from a freshwater lake sampled over eleven years. Within the gut, the segregation of the bacterial community around a food-poisoning event was immediately clear. In the freshwater lake, we found that high sequence identity between marker genes does not guarantee similar temporal dynamics, and Ananke time-series clusters revealed patterns obscured by clustering based on sequence identity or taxonomy. Ananke is free and open-source software available at https://github.com/beiko-lab/ananke.",
                "authors": [
                    {
                        "name": "Hall M.W."
                    },
                    {
                        "name": "Rohwer R.R."
                    },
                    {
                        "name": "Perrie J."
                    },
                    {
                        "name": "McMahon K.D."
                    },
                    {
                        "name": "Beiko R.G."
                    }
                ],
                "citationCount": 5,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Ananke: Temporal clustering reveals ecological dynamics of microbial communities"
            },
            "pmcid": "PMC5621509",
            "pmid": "28966891"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}