{
    "accessibility": "Open access",
    "additionDate": "2022-10-26T09:12:43.713604Z",
    "biotoolsCURIE": "biotools:ampdeep",
    "biotoolsID": "ampdeep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "miladsalem@knights.ucf.edu",
            "name": "Milad Salem",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for hemolytic activity prediction of antimicrobial peptides using transfer learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "homepage": "https://github.com/milad73s/AMPDeep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-26T09:12:43.716440Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/record/6992526"
        }
    ],
    "name": "AMPDeep",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04952-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Deep learning’s automatic feature extraction has proven to give superior performance in many sequence classification tasks. However, deep learning models generally require a massive amount of data to train, which in the case of Hemolytic Activity Prediction of Antimicrobial Peptides creates a challenge due to the small amount of available data. Results: Three different datasets for hemolysis activity prediction of therapeutic and antimicrobial peptides are gathered and the AMPDeep pipeline is implemented for each. The result demonstrate that AMPDeep outperforms the previous works on all three datasets, including works that use physicochemical features to represent the peptides or those who solely rely on the sequence and use deep learning to learn representation for the peptides. Moreover, a combined dataset is introduced for hemolytic activity prediction to address the problem of sequence similarity in this domain. AMPDeep fine-tunes a large transformer based model on a small amount of peptides and successfully leverages the patterns learned from other protein and peptide databases to assist hemolysis activity prediction modeling. Conclusions: In this work transfer learning is leveraged to overcome the challenge of small data and a deep learning based model is successfully adopted for hemolysis activity classification of antimicrobial peptides. This model is first initialized as a protein language model which is pre-trained on masked amino acid prediction on many unlabeled protein sequences in a self-supervised manner. Having done so, the model is fine-tuned on an aggregated dataset of labeled peptides in a supervised manner to predict secretion. Through transfer learning, hyper-parameter optimization and selective fine-tuning, AMPDeep is able to achieve state-of-the-art performance on three hemolysis datasets using only the sequence of the peptides. This work assists the adoption of large sequence-based models for peptide classification and modeling tasks in a practical manner.",
                "authors": [
                    {
                        "name": "Keshavarzi Arshadi A."
                    },
                    {
                        "name": "Salem M."
                    },
                    {
                        "name": "Yuan J.S."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AMPDeep: hemolytic activity prediction of antimicrobial peptides using transfer learning"
            },
            "pmcid": "PMC9511757",
            "pmid": "36163001"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
