{
    "additionDate": "2020-01-14T20:06:18Z",
    "biotoolsCURIE": "biotools:GreatSPN",
    "biotoolsID": "GreatSPN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "beccuti@di.unito.it",
            "name": "Marco Beccuti",
            "orcidid": "https://orcid.org/0000-0001-6125-9460",
            "typeEntity": "Person"
        }
    ],
    "description": "A computational approach based on the colored Petri net formalism for studying multiple sclerosis.\n\nBACKGROUND:Multiple Sclerosis (MS) is an immune-mediated inflammatory disease of the Central Nervous System (CNS) which damages the myelin sheath enveloping nerve cells thus causing severe physical disability in patients. Relapsing Remitting Multiple Sclerosis (RRMS) is one of the most common form of MS in adults and is characterized by a series of neurologic symptoms, followed by periods of remission. Recently, many treatments were proposed and studied to contrast the RRMS progression. Among these drugs, daclizumab (commercial name Zinbryta), an antibody tailored against the Interleukin-2 receptor of T cells, exhibited promising results, but its efficacy was accompanied by an increased frequency of serious adverse events.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/greatspn",
    "lastUpdate": "2020-12-07T08:11:56Z",
    "name": "GreatSPN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3196-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Multiple Sclerosis (MS) is an immune-mediated inflammatory disease of the Central Nervous System (CNS) which damages the myelin sheath enveloping nerve cells thus causing severe physical disability in patients. Relapsing Remitting Multiple Sclerosis (RRMS) is one of the most common form of MS in adults and is characterized by a series of neurologic symptoms, followed by periods of remission. Recently, many treatments were proposed and studied to contrast the RRMS progression. Among these drugs, daclizumab (commercial name Zinbryta), an antibody tailored against the Interleukin-2 receptor of T cells, exhibited promising results, but its efficacy was accompanied by an increased frequency of serious adverse events. Manifested side effects consisted of infections, encephalitis, and liver damages. Therefore daclizumab has been withdrawn from the market worldwide. Another interesting case of RRMS regards its progression in pregnant women where a smaller incidence of relapses until the delivery has been observed. Results: In this paper we propose a new methodology for studying RRMS, which we implemented in GreatSPN, a state-of-the-art open-source suite for modelling and analyzing complex systems through the Petri Net (PN) formalism. This methodology exploits: (a) an extended Colored PN formalism to provide a compact graphical description of the system and to automatically derive a set of ODEs encoding the system dynamics and (b) the Latin Hypercube Sampling with PRCC index to calibrate ODE parameters for reproducing the real behaviours in healthy and MS subjects.To show the effectiveness of such methodology a model of RRMS has been constructed and studied. Two different scenarios of RRMS were thus considered. In the former scenario the effect of the daclizumab administration is investigated, while in the latter one RRMS was studied in pregnant women. Conclusions: We propose a new computational methodology to study RRMS disease. Moreover, we show that model generated and calibrated according to this methodology is able to reproduce the expected behaviours.",
                "authors": [
                    {
                        "name": "Pernice S."
                    },
                    {
                        "name": "Pennisi M."
                    },
                    {
                        "name": "Romano G."
                    },
                    {
                        "name": "Maglione A."
                    },
                    {
                        "name": "Cutrupi S."
                    },
                    {
                        "name": "Pappalardo F."
                    },
                    {
                        "name": "Balbo G."
                    },
                    {
                        "name": "Beccuti M."
                    },
                    {
                        "name": "Cordero F."
                    },
                    {
                        "name": "Calogero R.A."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A computational approach based on the colored Petri net formalism for studying multiple sclerosis"
            },
            "pmcid": "PMC6904991",
            "pmid": "31822261"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ],
    "validated": 1
}