{"credit":[{"email":"bumsei@skku.edu","name":"Kosmos team","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioengineering.skku.ac.kr/kosmos/tutorial.php"}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Protein modelling (backbone)","uri":"http://edamontology.org/operation_0479"},{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"},{"term":"Protein flexibility and motion analysis","uri":"http://edamontology.org/operation_0244"}]}],"labels":{"language":["JavaScript","PHP"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"KOSMOS is the first online morph server to be able to address the structural dynamics of DNA/RNA, proteins and even their complexes, such as ribosomes. The key functions of KOSMOS are the harmonic and anharmonic analyses of macromolecules. In the harmonic analysis, normal mode analysis (NMA) based on an elastic network model (ENM) is performed, yielding vibrational modes and B-factor calculations, which provide insight into the potential biological functions of macromolecules based on their structural features. Anharmonic analysis involving elastic network interpolation (ENI) is used to generate plausible transition pathways between two given conformations by optimizing a topology-oriented cost function that guarantees a smooth transition without steric clashes. The quality of the computed pathways is evaluated based on their various facets, including topology, energy cost and compatibility with the NMA results. There are also two unique features of KOSMOS that distinguish it from other morph servers: (i) the versatility in the coarse-graining methods and (ii) the various connection rules in the ENM. The models enable us to analyze macromolecular dynamics with the maximum degrees of freedom by combining a variety of ENMs from full-atom to coarse-grained, backbone and hybrid models with one connection rule, such as distance-cutoff, number-cutoff or chemical-cutoff. KOSMOS is available at http://bioengineering.skku.ac.kr/kosmos. © 2012 The Author(s).","authors":["Seo S.","Kim M.K."],"cit_count":19,"journal":"Nucleic Acids Research","pmid":"22669912","title":"KOSMOS: A universal morph server for nucleic acids, proteins and their complexes","year":"2012-07-01"}],"summary":{"biotoolsCURIE":"biotools:kosmos","biotoolsID":"kosmos","description":"KOSMOS is a web server for analysis of harmonic and anharmonic macromolecular structures for DNA, RNA, and proteins. Users can request thermal fluctuation study or transient pathway generation by submitting PDB ID or uploading personal data files. All the simulation outputs have been deposited into NMA and ENI database where most of data are disclosed to the public unless users requested.","homepage":"http://bioengineering.skku.ac.kr/kosmos","name":"KOSMOS"}}