{
    "additionDate": "2020-01-14T20:04:27Z",
    "biotoolsCURIE": "biotools:PCHi-C",
    "biotoolsID": "PCHi-C",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "juris.viksna@lumii.lv",
            "name": "Juris Viksna",
            "orcidid": "https://orcid.org/0000-0003-2283-2978",
            "typeEntity": "Person"
        }
    ],
    "description": "Topological structure analysis of chromatin interaction networks.\n\nAnalysis and visualisation tools for PCHi-C interaction networks",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IMCS-Bioinformatics/PCHiCNetworkExplorer",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-05T10:00:19Z",
    "license": "GPL-3.0",
    "name": "PCHi-C",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3237-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Current Hi-C technologies for chromosome conformation capture allow to understand a broad spectrum of functional interactions between genome elements. Although significant progress has been made into analysis of Hi-C data to identify biologically significant features, many questions still remain open, in particular regarding potential biological significance of various topological features that are characteristic for chromatin interaction networks. Results: It has been previously observed that promoter capture Hi-C (PCHi-C) interaction networks tend to separate easily into well-defined connected components that can be related to certain biological functionality, however, such evidence was based on manual analysis and was limited. Here we present a novel method for analysis of chromatin interaction networks aimed towards identifying characteristic topological features of interaction graphs and confirming their potential significance in chromatin architecture. Our method automatically identifies all connected components with an assigned significance score above a given threshold. These components can be subjected afterwards to different assessment methods for their biological role and/or significance. The method was applied to the largest PCHi-C data set available to date that contains interactions for 17 haematopoietic cell types. The results demonstrate strong evidence of well-pronounced component structure of chromatin interaction networks and provide some characterisation of this component structure. We also performed an indicative assessment of potential biological significance of identified network components with the results confirming that the network components can be related to specific biological functionality. Conclusions: The obtained results show that the topological structure of chromatin interaction networks can be well described in terms of isolated connected components of the network and that formation of these components can be often explained by biological features of functionally related gene modules. The presented method allows automatic identification of all such components and evaluation of their significance in PCHi-C dataset for 17 haematopoietic cell types. The method can be adapted for exploration of other chromatin interaction data sets that include information about sufficiently large number of different cell types, and, in principle, also for analysis of other kinds of cell type-specific networks.",
                "authors": [
                    {
                        "name": "Viksna J."
                    },
                    {
                        "name": "Melkus G."
                    },
                    {
                        "name": "Celms E."
                    },
                    {
                        "name": "Cerans K."
                    },
                    {
                        "name": "Freivalds K."
                    },
                    {
                        "name": "Kikusts P."
                    },
                    {
                        "name": "Lace L."
                    },
                    {
                        "name": "Opmanis M."
                    },
                    {
                        "name": "Rituma D."
                    },
                    {
                        "name": "Rucevskis P."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Topological structure analysis of chromatin interaction networks"
            },
            "pmcid": "PMC6933681",
            "pmid": "31881819"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}