{
    "additionDate": "2021-01-18T07:34:01Z",
    "biotoolsCURIE": "biotools:bigtop",
    "biotoolsID": "bigtop",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "swestreich@dnanexus.com",
            "name": "Samuel T. Westreich",
            "orcidid": "https://orcid.org/0000-0002-3661-179X",
            "typeEntity": "Person"
        }
    ],
    "description": "BigTop is a 3D reality tool for GWAS visualization. It demonstrates some of the potential of virtual reality for scientific visualization by providing an easy way for scientists and science enthusiasts to become immersed in their data. This provides several key advantages over more traditional 2D visualization methods.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://dnanexus.github.io/bigtop/build/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-02-04T12:16:25Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/dnanexus/bigtop#configuration"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/dnanexus/bigtop"
        }
    ],
    "name": "BigTop",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3373-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Genome-wide association studies (GWAS) are typically visualized using a two-dimensional Manhattan plot, displaying chromosomal location of SNPs along the x-axis and the negative log-10 of their p-value on the y-axis. This traditional plot provides a broad overview of the results, but offers little opportunity for interaction or expansion of specific regions, and is unable to show additional dimensions of the dataset. Results: We created BigTop, a visualization framework in virtual reality (VR), designed to render a Manhattan plot in three dimensions, wrapping the graph around the user in a simulated cylindrical room. BigTop uses the z-axis to display minor allele frequency of each SNP, allowing for the identification of allelic variants of genes. BigTop also offers additional interactivity, allowing users to select any individual SNP and receive expanded information, including SNP name, exact values, and gene location, if applicable. BigTop is built in JavaScript using the React and A-Frame frameworks, and can be rendered using commercially available VR headsets or in a two-dimensional web browser such as Google Chrome. Data is read into BigTop in JSON format, and can be provided as either JSON or a tab-separated text file. Conclusions: Using additional dimensions and interactivity options offered through VR, we provide a new, interactive, three-dimensional representation of the traditional Manhattan plot for displaying and exploring GWAS data.",
                "authors": [
                    {
                        "name": "Westreich S.T."
                    },
                    {
                        "name": "Nattestad M."
                    },
                    {
                        "name": "Meyer C."
                    }
                ],
                "date": "2020-01-31T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BigTop: A three-dimensional virtual reality tool for GWAS visualization"
            },
            "pmcid": "PMC6995189",
            "pmid": "32005132"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}