{
    "additionDate": "2017-02-14T09:34:24Z",
    "biotoolsCURIE": "biotools:rci",
    "biotoolsID": "rci",
    "description": "Method for predicting protein flexibility using secondary chemical shifts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://wishart.biology.ualberta.ca/rci/cgi-bin/rci_cgi_1_d.py",
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "RCI",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Protein motions play important roles in numerous biological processes such as enzyme catalysis, muscle contractions, antigen-antibody interactions, gene regulation and virus assembly. Knowledge of protein flexibility is also important in rational drug design, protein docking and protein engineering. However, the experimental measurement of protein motions is often difficult, requiring sophisticated experiments, complex data analysis and detailed information about the protein's tertiary structure. As a result, there is a considerable interest in developing simpler, more effective ways of quantifying protein flexibility. Recently, we described a method, called the random coil index (RCI), which is able to quantitatively estimate backbone root mean square fluctuations (RMSFs) of structural ensembles and order parameters using only chemical shifts. The RCI method is very fast (<5 s) and exceedingly robust. It also offers an excellent alternative to traditional methods of measuring protein flexibility. We have recently extended the RCI concept and implemented it as a web server. This server allows facile, accurate and fully automated predictions of MD RMSF values, NMR RMSF values and model-free order parameters (S 2) directly from chemical shift assignments. It also performs automatic chemical shift re-referencing to ensure consistency and reproducibility. On average, the correlation between RCI predictions and experimentally obtained motional amplitudes is within the range from 0.77 to 0.82. The server is available at http://wishart.biology.ualberta.ca/rci. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Berjanskii M.V."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 50,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The RCI server: Rapid and accurate calculation of protein flexibility using chemical shifts"
            },
            "pmid": "17485469"
        },
        {
            "metadata": {
                "abstract": "We present a protocol for predicting protein flexibility from NMR chemical shifts. The protocol consists of (i) ensuring that the chemical shift assignments are correctly referenced or, if not, performing a reference correction using information derived from the chemical shift index, (ii) calculating the random coil index (RCI), and (iii) predicting the expected root mean square fluctuations (RMSFs) and order parameters (S2) of the protein from the RCI. The key advantages of this protocol over existing methods for studying protein dynamics are that (i) it does not require prior knowledge of a protein's tertiary structure, (ii) it is not sensitive to the protein's overall tumbling and (iii) it does not require additional NMR measurements beyond the standard experiments for backbone assignments. When chemical shift assignments are available, protein flexibility parameters, such as S2 and RMSF, can be calculated within 1-2 h using a spreadsheet program.",
                "authors": [
                    {
                        "name": "Berjanskii M."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 58,
                "date": "2006-01-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "NMR: Prediction of protein flexibility"
            },
            "pmid": "17406296"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1
}