{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:55:14Z",
    "biotoolsCURIE": "biotools:cell-shape-classifier",
    "biotoolsID": "cell-shape-classifier",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Christof Seiler",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/3570574-christof"
        }
    ],
    "description": "Time-lapse microscopy classification of 2D cells based on cell shape (Seiler et al., TERM, 2012)",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/37497/versions/2/screenshot.png"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/37497-cell-shape-classifier",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-16T15:15:46Z",
    "name": "Cell Shape Classifier",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/term.1575",
            "metadata": {
                "abstract": "Current methods to characterize mesenchymal stem cells (MSCs) are limited to CD marker expression, plastic adherence and their ability to differentiate into adipogenic, osteogenic and chondrogenic precursors. It seems evident that stem cells undergoing differentiation should differ in many aspects, such as morphology and possibly also behaviour; however, such a correlation has not yet been exploited for fate prediction of MSCs. Primary human MSCs from bone marrow were expanded and pelleted to form high-density cultures and were then randomly divided into four groups to differentiate into adipogenic, osteogenic chondrogenic and myogenic progenitor cells. The cells were expanded as heterogeneous and tracked with time-lapse microscopy to record cell shape, using phase-contrast microscopy. The cells were segmented using a custom-made image-processing pipeline. Seven morphological features were extracted for each of the segmented cells. Statistical analysis was performed on the seven-dimensional feature vectors, using a tree-like classification method. Differentiation of cells was monitored with key marker genes and histology. Cells in differentiation media were expressing the key genes for each of the three pathways after 21 days, i.e. adipogenic, osteogenic and chondrogenic, which was also confirmed by histological staining. Time-lapse microscopy data were obtained and contained new evidence that two cell shape features, eccentricity and filopodia (= 'fingers') are highly informative to classify myogenic differentiation from all others. However, no robust classifiers could be identified for the other cell differentiation paths. The results suggest that non-invasive automated time-lapse microscopy could potentially be used to predict the stem cell fate of hMSCs for clinical application, based on morphology for earlier time-points. The classification is challenged by cell density, proliferation and possible unknown donor-specific factors, which affect the performance of morphology-based approaches. © 2012 John Wiley & Sons, Ltd.",
                "authors": [
                    {
                        "name": "Seiler C."
                    },
                    {
                        "name": "Gazdhar A."
                    },
                    {
                        "name": "Reyes M."
                    },
                    {
                        "name": "Benneker L.M."
                    },
                    {
                        "name": "Geiser T."
                    },
                    {
                        "name": "Siebenrock K.A."
                    },
                    {
                        "name": "Gantenbein-Ritter B."
                    }
                ],
                "citationCount": 19,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Journal of Tissue Engineering and Regenerative Medicine",
                "title": "Time-lapse microscopy and classification of 2D human mesenchymal stem cells based on cell shape picks up myogenic from osteogenic and adipogenic differentiation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        }
    ],
    "version": [
        "1.1.0.0"
    ]
}