{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T10:04:42.029120Z",
    "biotoolsCURIE": "biotools:mnnmda",
    "biotoolsID": "mnnmda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yangjl@geneis.cn",
            "name": "Jialiang Yang",
            "orcidid": "https://orcid.org/0000-0003-4689-8672",
            "typeEntity": "Person"
        },
        {
            "email": "hbscsmu@163.com",
            "name": "Binsheng He",
            "typeEntity": "Person"
        },
        {
            "email": "hejianjun@csmu.edu.cn",
            "name": "Jianjun He",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting human microbe-disease association via a method to minimize matrix nuclear norm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Haiyan-Liu666/MNNMDA",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2023-03-19T10:04:42.034056Z",
    "license": "Not licensed",
    "name": "MNNMDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2022.12.053",
            "metadata": {
                "abstract": "Identifying the potential associations between microbes and diseases is the first step for revealing the pathological mechanisms of microbe-associated diseases. However, traditional culture-based microbial experiments are expensive and time-consuming. Thus, it is critical to prioritize disease-associated microbes by computational methods for further experimental validation. In this study, we proposed a novel method called MNNMDA, to predict microbe-disease associations (MDAs) by applying a Matrix Nuclear Norm method into known microbe and disease data. Specifically, we first calculated Gaussian interaction profile kernel similarity and functional similarity for diseases and microbes. Then we constructed a heterogeneous information network by combining the integrated disease similarity network, the integrated microbe similarity network and the known microbe-disease bipartite network. Finally, we formulated the microbe-disease association prediction problem as a low-rank matrix completion problem, which was solved by minimizing the nuclear norm of a matrix with a few regularization terms. We tested the performances of MNNMDA in three datasets including HMDAD, Disbiome, and Combined Data with small, medium and large sizes respectively. We also compared MNNMDA with 5 state-of-the-art methods including KATZHMDA, LRLSHMDA, NTSHMDA, GATMDA, and KGNMDA, respectively. MNNMDA achieved area under the ROC curves (AUROC) of 0.9536 and 0.9364 respectively on HDMAD and Disbiome, better than the AUCs of compared methods under the 5-fold cross-validation for all microbe-disease associations. It also obtained a relatively good performance with AUROC 0.8858 in the combined data. In addition, MNNMDA was also better than other methods in area under precision and recall curve (AUPR) under the 5-fold cross-validation for all associations, and in both AUROC and AUPR under the 5-fold cross-validation for diseases and the 5-fold cross-validation for microbes. Finally, the case studies on colon cancer and inflammatory bowel disease (IBD) also validated the effectiveness of MNNMDA. In conclusion, MNNMDA is an effective method in predicting microbe-disease associations. Availability: The codes and data for this paper are freely available at Github https://github.com/Haiyan-Liu666/MNNMDA.",
                "authors": [
                    {
                        "name": "Bao M."
                    },
                    {
                        "name": "Bing P."
                    },
                    {
                        "name": "He B."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "He K."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Tian G."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang M."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "MNNMDA: Predicting human microbe-disease association via a method to minimize matrix nuclear norm"
            },
            "pmcid": "PMC9941872",
            "pmid": "36824227"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
