{
    "additionDate": "2021-01-18T10:36:58Z",
    "biotoolsCURIE": "biotools:wce-agdn",
    "biotoolsID": "wce-agdn",
    "confidence_flag": "tool",
    "description": "Attention Guided Deformation Network (AGDN) utilizes attention maps to localize and zoom in lesion regions, thus enabling better inspection in order to make better diagnosis of the small lesions in WCE images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hathawayxxh/WCE-AGDN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-21T15:03:46Z",
    "name": "WCE-AGDN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TMI.2020.3010102",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.Wireless capsule endoscopy (WCE) is a novel imaging tool that allows noninvasive visualization of the entire gastrointestinal (GI) tract without causing discomfort to patients. Convolutional neural networks (CNNs), though perform favorably against traditional machine learning methods, show limited capacity in WCE image classification due to the small lesions and background interference. To overcome these limits, we propose a two-branch Attention Guided Deformation Network (AGDN) for WCE image classification. Specifically, the attention maps of branch1 are utilized to guide the amplification of lesion regions on the input images of branch2, thus leading to better representation and inspection of the small lesions. What's more, we devise and insert Third-order Long-range Feature Aggregation (TLFA) modules into the network. By capturing long-range dependencies and aggregating contextual features, TLFAs endow the network with a global contextual view and stronger feature representation and discrimination capability. Furthermore, we propose a novel Deformation based Attention Consistency (DAC) loss to refine the attention maps and achieve the mutual promotion of the two branches. Finally, the global feature embeddings from the two branches are fused to make image label predictions. Extensive experiments show that the proposed AGDN outperforms state-of-the-art methods with an overall classification accuracy of 91.29% on two public WCE datasets. The source code is available at https://github.com/hathawayxxh/WCE-AGDN.",
                "authors": [
                    {
                        "name": "Xing X."
                    },
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Meng M.Q.-H."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Zoom in Lesions for Better Diagnosis: Attention Guided Deformation Network for WCE Image Classification"
            },
            "pmid": "32746146"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}