{
    "additionDate": "2020-01-09T17:45:29Z",
    "biotoolsCURIE": "biotools:GPseudoClust",
    "biotoolsID": "GPseudoClust",
    "confidence_flag": "tool",
    "description": "deconvolution of shared pseudo-profiles at single-cell resolution.\n\nCode for the GPseudoClust method, including pre- and postprocessing steps. Magdalena E Strauß, Paul DW Kirk, John E Reid, Lorenz Wernisch (2019); GPseudoClust: deconvolution of shared pseudo-trajectories at single-cell resolution",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/magStra/GPseudoClust",
    "lastUpdate": "2020-12-03T12:42:36Z",
    "license": "GPL-3.0",
    "name": "GPseudoClust",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ778",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Many methods have been developed to cluster genes on the basis of their changes in mRNA expression over time, using bulk RNA-seq or microarray data. However, single-cell data may present a particular challenge for these algorithms, since the temporal ordering of cells is not directly observed. One way to address this is to first use pseudotime methods to order the cells, and then apply clustering techniques for time course data. However, pseudotime estimates are subject to high levels of uncertainty, and failing to account for this uncertainty is liable to lead to erroneous and/or over-confident gene clusters. Results: The proposed method, GPseudoClust, is a novel approach that jointly infers pseudotemporal ordering and gene clusters, and quantifies the uncertainty in both. GPseudoClust combines a recent method for pseudotime inference with non-parametric Bayesian clustering methods, efficient Markov Chain Monte Carlo sampling and novel subsampling strategies which aid computation. We consider a broad array of simulated and experimental datasets to demonstrate the effectiveness of GPseudoClust in a range of settings.",
                "authors": [
                    {
                        "name": "Kirk P.D.W."
                    },
                    {
                        "name": "Reid J.E."
                    },
                    {
                        "name": "Strauss M.E."
                    },
                    {
                        "name": "Wernisch L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GPseudoClust: Deconvolution of shared pseudo-profiles at single-cell resolution"
            },
            "pmid": "31608923"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
