{
    "additionDate": "2024-04-08T10:22:04.648409Z",
    "biotoolsCURIE": "biotools:stargate_x",
    "biotoolsID": "stargate_x",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "calamo@di.uniroma1.it",
            "name": "Tiziana Calamoneri",
            "orcidid": "https://orcid.org/0000-0002-4099-1836",
            "typeEntity": "Person",
            "url": "http://www.di.uniroma1.it"
        }
    ],
    "description": "Python package for statistical analysis on the REACTOME network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marinoandrea/stargate-x",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:05:00.426650Z",
    "license": "MIT",
    "name": "StARGate-X",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1515/jib-2022-0029",
            "metadata": {
                "abstract": "Many important aspects of biological knowledge at the molecular level can be represented by pathways. Through their analysis, we gain mechanistic insights and interpret lists of interesting genes from experiments (usually omics and functional genomic experiments). As a result, pathways play a central role in the development of bioinformatics methods and tools for computing predictions from known molecular-level mechanisms. Qualitative as well as quantitative knowledge about pathways can be effectively represented through biochemical networks linking the biochemical reactions and the compounds (e.g., proteins) occurring in the considered pathways. So, repositories providing biochemical networks for known pathways play a central role in bioinformatics and in systems biology. Here we focus on Reactome, a free, comprehensive, and widely used repository for biochemical networks and pathways. In this paper, we: (1) introduce a tool StARGate-X (STatistical Analysis of the Reactome multi-GrAph Through nEtworkX) to carry out an automated analysis of the connectivity properties of Reactome biochemical reaction network and of its biological hierarchy (i.e., cell compartments, namely, the closed parts within the cytosol, usually surrounded by a membrane); the code is freely available at https://github.com/marinoandrea/stargate-x; (2) show the effectiveness of our tool by providing an analysis of the Reactome network, in terms of centrality measures, with respect to in- and out-degree. As an example of usage of StARGate-X, we provide a detailed automated analysis of the Reactome network, in terms of centrality measures. We focus both on the subgraphs induced by single compartments and on the graph whose nodes are the strongly connected components. To the best of our knowledge, this is the first freely available tool that enables automatic analysis of the large biochemical network within Reactome through easy-to-use APIs (Application Programming Interfaces).",
                "authors": [
                    {
                        "name": "Calamoneri T."
                    },
                    {
                        "name": "Marino A."
                    },
                    {
                        "name": "Sinaimeri B."
                    },
                    {
                        "name": "Tronci E."
                    }
                ],
                "date": "2023-09-01T00:00:00Z",
                "journal": "Journal of integrative bioinformatics",
                "title": "STARGATE-X: a Python package for statistical analysis on the REACTOME network"
            },
            "pmcid": "PMC10757075",
            "pmid": "37732505"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ]
}
