{
    "additionDate": "2021-03-19T08:38:15Z",
    "biotoolsCURIE": "biotools:orbit-rt",
    "biotoolsID": "orbit-rt",
    "confidence_flag": "tool",
    "description": "A Real-Time, Open Platform for Knowledge-Based Quality Control of Radiotherapy Treatment Planning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://www.orbit-rt.com/",
    "lastUpdate": "2021-03-26T12:52:57Z",
    "name": "ORBIT-RT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1200/CCI.20.00093",
            "metadata": {
                "abstract": "PURPOSE: Access to knowledge-based treatment plan quality control has been hindered by the complexity of developing models and integration with different treatment planning systems (TPS). Online Real-time Benchmarking Information Technology for RadioTherapy (ORBIT-RT) provides a free, web-based platform for knowledge-based dose estimation that can be used by clinicians worldwide to benchmark the quality of their radiotherapy plans. MATERIALS AND METHODS: The ORBIT-RT platform was developed to satisfy four primary design criteria: web-based access, TPS independence, Health Insurance Portability and Accountability Act compliance, and autonomous operation. ORBIT-RT uses a cloud-based server to automatically anonymize a user's Digital Imaging and Communications in Medicine for RadioTherapy (DICOM-RT) file before upload and processing of the case. From there, ORBIT-RT uses established knowledge-based dose-volume histogram (DVH) estimation methods to autonomously create DVH estimations for the uploaded DICOM-RT. ORBIT-RT performance was evaluated with an independent validation set of 45 volumetric modulated arc therapy prostate plans with two key metrics: (i) accuracy of the DVH estimations, as quantified by their error, DVHclinical - DVHprediction and (ii) time to process and display the DVH estimations on the ORBIT-RT platform. RESULTS: ORBIT-RT organ DVH predictions show < 1% bias and 3% error uncertainty at doses > 80% of prescription for the prostate validation set. The ORBIT-RT extensions require 3.0 seconds per organ to analyze. The DICOM upload, data transfer, and DVH output display extend the entire system workflow to 2.5-3 minutes. CONCLUSION: ORBIT-RT demonstrated fast and fully autonomous knowledge-based feedback on a web-based platform that takes only anonymized DICOM-RT as input. The ORBIT-RT system can be used for real-time quality control feedback that provides users with objective comparisons for final plan DVHs.",
                "authors": [
                    {
                        "name": "Covele B.M."
                    },
                    {
                        "name": "Kallis K."
                    },
                    {
                        "name": "Moore K.L."
                    },
                    {
                        "name": "Murphy J.D."
                    },
                    {
                        "name": "Puri K.S."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "JCO clinical cancer informatics",
                "title": "ORBIT-RT: A Real-Time, Open Platform for Knowledge-Based Quality Control of Radiotherapy Treatment Planning"
            },
            "pmid": "33513032"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
