{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-25T08:15:53.985483Z",
    "biotoolsCURIE": "biotools:dela-drug",
    "biotoolsID": "dela-drug",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Nicola Ancona"
        },
        {
            "name": "Teresa Maria Creanza"
        }
    ],
    "description": "DeLA-Drug is an artificial intelligence-based platform able to generate drug-like analogues starting from a single user-defined query compound.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://www.ba.ic.cnr.it/softwareic/deladrugportal/",
    "lastUpdate": "2022-06-25T08:15:53.988136Z",
    "name": "DeLA-Drug",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.2C00205",
            "metadata": {
                "abstract": "© 2022 American Chemical Society. All rights reserved.In this paper, we present a deep learning algorithm for automated design of druglike analogues (DeLA-Drug), a recurrent neural network (RNN) model composed of two long short-term memory (LSTM) layers and conceived for data-driven generation of similar-to-bioactive compounds. DeLA-Drug captures the syntax of SMILES strings of more than 1 million compounds belonging to the ChEMBL28 database and, by employing a new strategy called sampling with substitutions (SWS), generates molecules starting from a single user-defined query compound. Remarkably, the algorithm preserves druglikeness and synthetic accessibility of the known bioactive compounds present in the ChEMBL28 repository. The absence of any time-demanding fine-tuning procedure enables DeLA-Drug to perform a fast generation of focused libraries for further high-throughput screening and makes it a suitable tool for performing de novo design even in low-data regimes. To provide a concrete idea of its applicability, DeLA-Drug was applied to the cannabinoid receptor subtype 2 (CB2R), a known target involved in different pathological conditions such as cancer and neurodegeneration. DeLA-Drug, available as a free web platform (http://www.ba.ic.cnr.it/softwareic/deladrugportal/), can help medicinal chemists interested in generating analogues of compounds already available in their laboratories and, for this reason, good candidates for an easy and low-cost synthesis.",
                "authors": [
                    {
                        "name": "Ancona N."
                    },
                    {
                        "name": "Contino M."
                    },
                    {
                        "name": "Corriero N."
                    },
                    {
                        "name": "Creanza T.M."
                    },
                    {
                        "name": "Delre P."
                    },
                    {
                        "name": "Lamanna G."
                    },
                    {
                        "name": "Mangiatordi G.F."
                    },
                    {
                        "name": "Saviano M."
                    }
                ],
                "date": "2022-03-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "DeLA-Drug: A Deep Learning Algorithm for Automated Design of Druglike Analogues"
            },
            "pmid": "35294184"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
