{
    "accessibility": "Open access",
    "additionDate": "2022-08-27T10:52:55.938997Z",
    "biotoolsCURIE": "biotools:nteditsealer",
    "biotoolsID": "nteditsealer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "janli@bcgsc.ca",
            "name": "Janet X. Li",
            "typeEntity": "Person"
        },
        {
            "name": "Inanç Birol"
        },
        {
            "name": "Johnathan Wong"
        },
        {
            "name": "Lauren Coombe"
        },
        {
            "name": "René L. Warren"
        }
    ],
    "description": "Efficient Targeted Error Resolution and Automated Finishing of Long-Read Genome Assemblies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bcgsc/ntedit_sealer_protocol",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-27T10:52:55.942493Z",
    "license": "GPL-3.0",
    "name": "ntEdit+Sealer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/CPZ1.442",
            "metadata": {
                "abstract": "© 2022 The Authors. Current Protocols published by Wiley Periodicals LLC.High-quality genome assemblies are crucial to many biological studies, and utilizing long sequencing reads can help achieve higher assembly contiguity. While long reads can resolve complex and repetitive regions of a genome, their relatively high associated error rates are still a major limitation. Long reads generally produce draft genome assemblies with lower base quality, which must be corrected with a genome polishing step. Hybrid genome polishing solutions can greatly improve the quality of long-read genome assemblies by utilizing more accurate short reads to validate bases and correct errors. Currently available hybrid polishing methods rely on read alignments, and are therefore memory-intensive and do not scale well to large genomes. Here we describe ntEdit+Sealer, an alignment-free, k-mer-based genome finishing protocol that employs memory-efficient Bloom filters. The protocol includes ntEdit for correcting base errors and small indels, and for marking potentially problematic regions, then Sealer for filling both assembly gaps and problematic regions flagged by ntEdit. ntEdit+Sealer produces highly accurate, error-corrected genome assemblies, and is available as a Makefile pipeline from https://github.com/bcgsc/ntedit_sealer_protocol. © 2022 The Authors. Current Protocols published by Wiley Periodicals LLC. Basic Protocol: Automated long-read genome finishing with short reads. Support Protocol: Selecting optimal values for k-mer lengths (k) and Bloom filter size (b).",
                "authors": [
                    {
                        "name": "Birol I."
                    },
                    {
                        "name": "Coombe L."
                    },
                    {
                        "name": "Li J.X."
                    },
                    {
                        "name": "Warren R.L."
                    },
                    {
                        "name": "Wong J."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Current Protocols",
                "title": "ntEdit+Sealer: Efficient Targeted Error Resolution and Automated Finishing of Long-Read Genome Assemblies"
            },
            "pmcid": "PMC9196995",
            "pmid": "35567771"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
