{"credit":[{"email":"dschlauch@fas.harvard.edu","name":"Daniel Schlauch","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/dschlauch/stego/blob/master/DESCRIPTION"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"},{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"},{"term":"Molecular genetics","uri":"http://edamontology.org/topic_3321"}]},"publication":[{"abstract":"© 2017 The Author.Motivation: In order to minimize the effects of genetic confounding on the analysis of highthroughput genetic association studies, e.g. (whole-genome) sequencing (WGS) studies, genomewide association studies (GWAS), etc., we propose a general framework to assess and to test formally for genetic heterogeneity among study subjects. As the approach fully utilizes the recent ancestor information captured by rare variants, it is especially powerful in WGS studies. Even for relatively moderate sample sizes, the proposed testing framework is able to identify study subjects that are genetically too similar, e.g. cryptic relationships, or that are genetically too different, e.g. population substructure. The approach is computationally fast, enabling the application to whole-genome sequencing data, and straightforward to implement. Results: Simulation studies illustrate the overall performance of our approach. In an application to the 1000 Genomes Project, we outline an analysis/cleaning pipeline that utilizes our approach to formally assess whether study subjects are related and whether population substructure is present. In the analysis of the 1000 Genomes Project data, our approach revealed subjects that are most likely related, but had previously passed standard qc-filters. Availability and Implementation: An implementation of our method, Similarity Test for Estimating Genetic Outliers (STEGO), is available in the R package stego from Github at https://github.com/dschlauch/stego.","authors":["Schlauch D.","Fier H.","Lange C."],"cit_count":0,"doi":"10.1093/bioinformatics/btx109","journal":"Bioinformatics","title":"Identification of genetic outliers due to sub-structure and cryptic relationships","year":"2017-07-01"}],"summary":{"biotoolsCURIE":"biotools:stego","biotoolsID":"stego","description":"Identification of genetic outliers due to sub-structure and cryptic relationships.","homepage":"https://github.com/dschlauch/stego","name":"STEGO"}}