{
    "additionDate": "2020-01-09T18:22:05Z",
    "biotoolsCURIE": "biotools:PBLPI",
    "biotoolsID": "PBLPI",
    "confidence_flag": "low",
    "description": "A path-based computational model for long non-coding RNA-protein interaction prediction.\n\nRecently, lncRNAs have attracted accumulating attentions because more and more experimental researches have shown lncRNA can play critical roles in many biological processes. Predicting potential interactions between lncRNAs and proteins are key to understand the lncRNAs biological functions. But traditional biological experiments are expensive and time-consuming, network similarity methods provide a powerful solution to computationally predict lncRNA-protein interactions. In this work, a novel path-based lncRNA-protein interaction (PBLPI) prediction model is proposed by integrating protein semantic similarity, lncRNA functional similarity, known human lncRNA-protein interactions, and Gaussian interaction profile kernel similarity.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31639442",
    "lastUpdate": "2020-01-09T18:22:05Z",
    "name": "PBLPI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.YGENO.2019.09.018",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.Recently, lncRNAs have attracted accumulating attentions because more and more experimental researches have shown lncRNA can play critical roles in many biological processes. Predicting potential interactions between lncRNAs and proteins are key to understand the lncRNAs biological functions. But traditional biological experiments are expensive and time-consuming, network similarity methods provide a powerful solution to computationally predict lncRNA-protein interactions. In this work, a novel path-based lncRNA-protein interaction (PBLPI) prediction model is proposed by integrating protein semantic similarity, lncRNA functional similarity, known human lncRNA-protein interactions, and Gaussian interaction profile kernel similarity. PBLPI model utilizes three interlinked sub-graphs to construct a heterogeneous graph, and then infers potential lncRNA-protein interactions through depth-first search algorithm. Consequently, PBLPI achieves reliable performance in the frameworks of 5-fold cross validation (average AUC is 0.9244 and AUPR is 0.6478). In the case study, we use “Mus musculus” data to further validate the reliability of PBLPI method. It is anticipated that PBLPI would become a useful tool to identify potential lncRNA-protein interactions.",
                "authors": [
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Ming Z."
                    },
                    {
                        "name": "Fan C."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genomics",
                "title": "A path-based computational model for long non-coding RNA-protein interaction prediction"
            },
            "pmid": "31639442"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}