{
    "additionDate": "2019-11-14T19:59:30Z",
    "biotoolsCURIE": "biotools:ensECBS",
    "biotoolsID": "ensECBS",
    "confidence_flag": "tool",
    "description": "Machine learning-based chemical binding similarity using evolutionary relationships of target genes | ensemble evolutionary chemical binding similarity | Scripts to run ensemble evolutionary chemical binding similarity (ensECBS)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chemical redundancy removal",
                    "uri": "http://edamontology.org/operation_3564"
                },
                {
                    "term": "Chemical similarity enrichment",
                    "uri": "http://edamontology.org/operation_3502"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/keunwan-kist/ECBS",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2020-12-25T14:23:16Z",
    "name": "ensECBS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ743",
            "metadata": {
                "abstract": "© 2018 Lippincott Williams and Wilkins. All rights reserved.Chemical similarity searching is a basic research tool that can be used to find small molecules which are similar in shape to known active molecules. Despite its popularity, the retrieval of local molecular features that are critical to functional activity related to target binding often fails. To overcome this limitation, we developed a novel machine learningbased chemical binding similarity score by using various evolutionary relationships of binding targets. The chemical similarity was defined by the probability of chemical compounds binding to identical targets. Comprehensive and heterogeneous multiple target-binding chemical data were integrated into a paired data format and processed using multiple classification similarity-learning models with various levels of target evolutionary information. Encoding evolutionary information to chemical compounds through their binding targets substantially expanded available chemical-target interaction data and significantly improved model performance. The output probability of our integrated model, referred to as ensemble evolutionary chemical binding similarity (ensECBS), was effective for finding hidden chemical relationships. The developed method can serve as a novel chemical similarity tool that uses evolutionarily conserved target binding information. The Author(s) 2019.",
                "authors": [
                    {
                        "name": "Durai P."
                    },
                    {
                        "name": "Ko Y.-J."
                    },
                    {
                        "name": "Pan C.-H."
                    },
                    {
                        "name": "Park K."
                    }
                ],
                "citationCount": 5,
                "date": "2019-11-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Machine learning-based chemical binding similarity using evolutionary relationships of target genes"
            },
            "pmcid": "PMC6846180",
            "pmid": "31504818"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
