{
    "accessibility": "Open access",
    "additionDate": "2024-01-29T08:20:30.181062Z",
    "biotoolsCURIE": "biotools:binarena",
    "biotoolsID": "binarena",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hinsby@asu.edu",
            "name": "Hinsby Cadillo-Quiroz",
            "typeEntity": "Person"
        },
        {
            "email": "qiyun.zhu@asu.edu",
            "name": "Qiyun Zhu",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactive platform for human-guided exploration and binning of metagenomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qiyunlab/binarena",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:18:52.633962Z",
    "license": "BSD-3-Clause",
    "name": "BinaRena",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s40168-023-01625-8",
            "metadata": {
                "abstract": "Background: Exploring metagenomic contigs and “binning” them into metagenome-assembled genomes (MAGs) are essential for the delineation of functional and evolutionary guilds within microbial communities. Despite the advances in automated binning algorithms, their capabilities in recovering MAGs with accuracy and biological relevance are so far limited. Researchers often find that human involvement is necessary to achieve representative binning results. This manual process however is expertise demanding and labor intensive, and it deserves to be supported by software infrastructure. Results: We present BinaRena, a comprehensive and versatile graphic interface dedicated to aiding human operators to explore metagenome assemblies via customizable visualization and to associate contigs with bins. Contigs are rendered as an interactive scatter plot based on various data types, including sequence metrics, coverage profiles, taxonomic assignments, and functional annotations. Various contig-level operations are permitted, such as selection, masking, highlighting, focusing, and searching. Binning plans can be conveniently edited, inspected, and compared visually or using metrics including silhouette coefficient and adjusted Rand index. Completeness and contamination of user-selected contigs can be calculated in real time. In demonstration of BinaRena’s usability, we show that it facilitated biological pattern discovery, hypothesis generation, and bin refinement in a complex tropical peatland metagenome. It enabled isolation of pathogenic genomes within closely related populations from the gut microbiota of diarrheal human subjects. It significantly improved overall binning quality after curating results of automated binners using a simulated marine dataset. Conclusions: BinaRena is an installation-free, dependency-free, client-end web application that operates directly in any modern web browser, facilitating ease of deployment and accessibility for researchers of all skill levels. The program is hosted at https://github.com/qiyunlab/binarena , together with documentation, tutorials, example data, and a live demo. It effectively supports human researchers in intuitive interpretation and fine tuning of metagenomic data. [MediaObject not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Cadillo-Quiroz H."
                    },
                    {
                        "name": "Chede A."
                    },
                    {
                        "name": "Pavia M.J."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Zhu Q."
                    }
                ],
                "citationCount": 2,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Microbiome",
                "title": "BinaRena: a dedicated interactive platform for human-guided exploration and binning of metagenomes"
            },
            "pmcid": "PMC10439608",
            "pmid": "37596696"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
