{
    "additionDate": "2021-01-18T08:08:42Z",
    "biotoolsCURIE": "biotools:adjusted-adjust",
    "biotoolsID": "adjusted-adjust",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "moraless@umd.edu",
            "name": "Santiago Morales",
            "typeEntity": "Person"
        }
    ],
    "description": "Adjusted-ADJUST is a script for the automatic identification of artifacts in electroencephalograph (EEG) data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChildDevLab/MADE-EEG-preprocessing-pipeline/tree/master/adjusted_adjust_scripts",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-21T13:35:10Z",
    "license": "GPL-3.0",
    "name": "Adjusted-ADJUST",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/PSYP.13566",
            "metadata": {
                "abstract": "© 2020 Society for Psychophysiological ResearchA major challenge for electroencephalograph (EEG) studies on pediatric populations is that large amounts of data are lost due to artifacts (e.g., movement and blinks). Independent component analysis (ICA) can separate artifactual and neural activity, allowing researchers to remove such artifactual activity and retain a greater percentage of EEG data for analyses. However, manual identification of artifactual components is time-consuming and requires subjective judgment. Automated algorithms, like ADJUST and ICLabel, have been validated on adults, but to our knowledge, no such algorithms have been optimized for pediatric data. Therefore, in an attempt to automate artifact selection for pediatric data collected with geodesic nets, we modified ADJUST's algorithm. Our “adjusted-ADJUST” algorithm was compared to the “original-ADJUST” algorithm and ICLabel in adults, children, and infants on three different performance measures: respective classification agreement with expert coders, the number of trials retained following artifact removal, and the reliability of the EEG signal after preprocessing with each algorithm. Overall, the adjusted-ADJUST algorithm performed better than the original-ADJUST algorithm and no ICA correction with adult and pediatric data. Moreover, in some measures, it performed better than ICLabel for pediatric data. These results indicate that optimizing existing algorithms improves artifact classification and retains more trials, potentially facilitating EEG studies with pediatric populations. Adjusted-ADJUST is freely available under the terms of the GNU General Public License at: https://github.com/ChildDevLab/MADE-EEG-preprocessing-pipeline/tree/master/adjusted_adjust_scripts.",
                "authors": [
                    {
                        "name": "Leach S.C."
                    },
                    {
                        "name": "Morales S."
                    },
                    {
                        "name": "Bowers M.E."
                    },
                    {
                        "name": "Buzzell G.A."
                    },
                    {
                        "name": "Debnath R."
                    },
                    {
                        "name": "Beall D."
                    },
                    {
                        "name": "Fox N.A."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Psychophysiology",
                "title": "Adjusting ADJUST: Optimizing the ADJUST algorithm for pediatric data using geodesic nets"
            },
            "pmcid": "PMC7402217",
            "pmid": "32185818"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}