{
    "additionDate": "2021-03-19T09:00:32Z",
    "biotoolsCURIE": "biotools:modelbuildr",
    "biotoolsID": "modelbuildr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.knoll@dkfz.de",
            "name": "Maximilian Knoll",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for model building and feature selection with erroneous classifications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://github.com/mknoll/modelBuildR",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-11T09:37:24Z",
    "license": "GPL-3.0",
    "name": "modelBuildR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.7717/PEERJ.10849",
            "metadata": {
                "abstract": "© 2021 PeerJ Inc.. All rights reserved.Background Model building is a crucial part of omics based biomedical research to transfer classifications and obtain insights into underlying mechanisms. Feature selection is often based on minimizing error between model predictions and given classification (maximizing accuracy). Human ratings/classifications, however, might be error prone, with discordance rates between experts of 515%. We therefore evaluate if a feature pre-filtering step might improve identification of features associated with true underlying groups. Methods. Data was simulated for up to 100 samples and up to 10,000 features, 10% of which were associated with the ground truth comprising 210 normally distributed populations. Binary and semi-quantitative ratings with varying error probabilities were used as classification. For feature preselection standard cross-validation (V2) was compared to a novel heuristic (V1) applying univariate testing, multiplicity adjustment and cross-validation on switched dependent (classification) and independent (features) variables. Preselected features were used to train logistic regression/linear models (backward selection, AIC). Predictions were compared against the ground truth (ROC, multiclass-ROC). As use case, multiple feature selection/classification methods were benchmarked against the novel heuristic to identify prognostically different G-CIMP negative glioblastoma tumors from the TCGA-GBM 450 k methylation array data cohort, starting from a fuzzy umap based rough and erroneous separation. Results. V1 yielded higher median AUC ranks for two true groups (ground truth), with smaller differences for true graduated differences (310 groups). Lower fractions of models were successfully fit with V1. Median AUCs for binary classification and two true groups were 0.91 (range: 0.541.00) for V1 (Benjamini-Hochberg) and 0.70 (0.281.00) for V2, 13% (nD616) of V2 models showed AUCs D 50% for 25 samples and 100 features. For larger numbers of features and samples, median AUCs were 0.75 (range 0.591.00) for V1 and 0.54 (range 0.320.75) for V2. In the TCGA-GBM data, modelBuildR allowed best prognostic separation of patients with highest median overall survival difference (7.51 months) followed a difference of 6.04 months for a random forest based method. Conclusions. The proposed heuristic is beneficial for the retrieval of features associated with two true groups classified with errors. We provide the R package modelBuildR to simplify (comparative) evaluation/application of the proposed heuristic (http://github com/mknoll/modelBuildR).",
                "authors": [
                    {
                        "name": "Knoll M."
                    },
                    {
                        "name": "Furkel J."
                    },
                    {
                        "name": "Debus J."
                    },
                    {
                        "name": "Abdollahi A."
                    }
                ],
                "date": "2021-02-09T00:00:00Z",
                "journal": "PeerJ",
                "title": "Model Build R: An R package for model building and feature selection with erroneous classifications"
            },
            "pmcid": "PMC7879945",
            "pmid": "33614290"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}