{"credit":[],"function":[{"operation":[{"term":"Essential dynamics","uri":"http://edamontology.org/operation_3891"}]}],"labels":{"topic":[{"term":"Critical care medicine","uri":"http://edamontology.org/topic_3403"},{"term":"Paediatrics","uri":"http://edamontology.org/topic_3418"},{"term":"Safety sciences","uri":"http://edamontology.org/topic_3377"}]},"publication":[{"abstract":"© Canadian Association of Emergency Physicians 2019.Objectives Quality Improvement and Patient Safety (QIPS) plays an important role in addressing shortcomings in optimal healthcare delivery. However, there is little published guidance available for emergency department (ED) teams with respect to developing their own QIPS programs. We sought to create recommendations for established and aspiring ED leaders to use as a pathway to better patient care through programmatic QIPS activities, starting internally and working towards interdepartmental collaboration.Methods An expert panel comprised of ten ED clinicians with QIPS and leadership expertise was established. A scoping review was conducted to identify published literature on establishing QIPS programs and frameworks in healthcare. Stakeholder consultations were conducted among Canadian healthcare leaders, and recommendations were drafted by the expert panel based on all the accumulated information. These were reviewed and refined at the 2018 CAEP Academic Symposium in Calgary using in-person and technologically-supported feedback.Results Recommendations include: creating a sense of urgency for improvement; engaging relevant stakeholders and leaders; creating a formal local QIPS Committee; securing funding and resources; obtaining local data to guide the work; supporting QIPS training for team members; encouraging interprofessional, cross-departmental, and patient collaborations; using an established QIPS framework to guide the work; developing reward mechanisms and incentive structures; and considering to start small by focusing on a project rather than a program.Conclusion A list of 10 recommendations is presented as guiding principles for the establishment and sustainable deployment of QIPS activities in EDs throughout Canada and abroad. ED leaders are encouraged to implement our recommendations in an effort to improve patient care.","authors":["Chartier L.B.","Mondoux S.E.","Stang A.S.","Dukelow A.M.","Dowling S.K.","Kwok E.S.H.","Trivedi S.V.","Tepper J.","Lang E."],"cit_count":1,"doi":"10.1017/CEM.2019.25","journal":"Canadian Journal of Emergency Medicine","pmid":"31608859","title":"How do emergency departments and emergency leaders catalyze positive change through quality improvement collaborations?","year":"2019-07-01"},{"abstract":"PROBLEM: Quality improvement (QI) and patient safety (PS) are cornerstones of health care delivery. Accreditation organizations increasingly require that learners engage in QIPS. For many faculty, these are new domains. Additional faculty development is needed for them to teach and mentor trainees. Existing programs, such as the Association of American Medical Colleges Teaching for Quality (Te4Q) program, target individual faculty and thus accommodate only limited participants at a time, which is problematic for institutions that need to train many faculty to support their learners. APPROACH: The authors invited diverse stakeholders from across the University of California, San Francisco (UCSF) School of Medicine and related health systems to participate in a team-based adaptation of the Te4Q program. The teams completed 5 projects based on previously identified priority areas to increase local capacity for QIPS teaching: (1) online modules for faculty new to QIPS, (2) a tool kit for graduate medical education programs, (3) a module for medical school clerkship directors, (4) guidelines for faculty to integrate early learners into QI projects, and (5) a \"Teach-for-UCSF\" certificate program in teaching QIPS. OUTCOMES: Thirty-five faculty members participated in the initial Te4Q workshop in January 2015, and by fall 2016, all projects were implemented. These projects led to additional faculty development initiatives and a rapidly expanding number of faculty across campus with expertise in teaching QIPS. NEXT STEPS: Further collaborations between faculty focused on QIPS in care delivery and those focused on QIPS education to promote QIPS teaching have resulted from these initial projects.","authors":["van Schaik S.M.","Chang A.","Fogh S.","Haehn M.","Lyndon A.","O'Brien B.","O'Sullivan P.","Ranji S.","Rosenbluth G.","Sehgal N.","Tabas J.","Baron R.B."],"cit_count":0,"doi":"10.1097/ACM.0000000000002784","journal":"Academic medicine : journal of the Association of American Medical Colleges","pmid":"31663959","title":"Jump-Starting Faculty Development in Quality Improvement and Patient Safety Education: A Team-Based Approach","year":"2019-11-01"}],"summary":{"biotoolsCURIE":"biotools:QIPS","biotoolsID":"QIPS","description":"How do emergency departments and emergency leaders catalyze positive change through quality improvement collaborations?.\n\nJump-Starting Faculty Development in Quality Improvement and Patient Safety Education.\n\nIn recent years, the importance of quality improvement and patient safety (QIPS) has become evident in healthcare in general, and in emergency medicine in particular. Though this is increasingly widely acknowledged, there is still a paucity of guiding resources as to how healthcare providers can obtain the knowledge and skills to initiate meaningful change. In order to help foster the development of QIPS, the following Resource Centre was created to guide training in the science of QIPS.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'QIPS teaching', 'teaching QIPS', 'Te4Q', 'Jump-Starting Faculty Development Quality Improvement Patient Safety Education'","homepage":"https://caep.ca/qips-resources/","name":"QIPS"}}