{
    "additionDate": "2018-05-25T12:16:50Z",
    "biotoolsCURIE": "biotools:spectre",
    "biotoolsID": "spectre",
    "credit": [
        {
            "email": "remills@med.umich.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Model the overall tri­nucleotide periodicity of ribosomal occupancy using a classifier based on spectral coherence. Examine the relationship of normalized ribosome profiling read coverage over a rolling series of windows along a transcript relative to an idealized reference signal without the matched requirement of mRNA-Seq.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/mills-lab/spectre/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mills-lab/spectre",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SPECtre",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1355-4",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Active protein translation can be assessed and measured using ribosome profiling sequencing strategies. Prevailing analytical approaches applied to this technology make use of sequence fragment length profiling or reading frame occupancy enrichment to differentiate between active translation and background noise, however they do not consider additional characteristics inherent to the technology which limits their overall accuracy. Results: Here, we present an analytical tool that models the overall trinucleotide periodicity of ribosomal occupancy using a classifier based on spectral coherence. Our software, SPECtre, examines the relationship of normalized ribosome profiling read coverage over a rolling series of windows along a transcript relative to an idealized reference signal without the matched requirement of mRNA-Seq. Conclusions: A comparison of SPECtre against previously published methods on existing data shows a marked improvement in accuracy for detecting active translation and exhibits overall high accuracy at a low false discovery rate. In addition, SPECtre performs comparably to a recently published method similarly based on spectral coherence, however with reduced runtime and memory requirements. SPECtre is available as an open source software package at https://github.com/mills-lab/spectreok.",
                "authors": [
                    {
                        "name": "Chun S.Y."
                    },
                    {
                        "name": "Rodriguez C.M."
                    },
                    {
                        "name": "Todd P.K."
                    },
                    {
                        "name": "Mills R.E."
                    }
                ],
                "citationCount": 24,
                "date": "2016-11-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SPECtre: A spectral coherence-based classifier of actively translated transcripts from ribosome profiling sequence data"
            },
            "pmcid": "PMC5123373",
            "pmid": "27884106"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}