{
    "accessibility": "Open access",
    "additionDate": "2022-12-12T22:34:01.425177Z",
    "biotoolsCURIE": "biotools:rp-rep",
    "biotoolsID": "rp-rep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jgoll@emmes.com",
            "name": "Johannes B. Goll",
            "orcidid": "https://orcid.org/0000-0002-9968-4080",
            "typeEntity": "Person"
        },
        {
            "name": "Sami R. Cherikh"
        },
        {
            "name": "William F. Hooper"
        },
        {
            "name": "Travis L. Jensen",
            "orcidid": "https://orcid.org/0000-0002-0322-0469"
        }
    ],
    "description": "An open-source cloud-enabled framework for reproducible ribosomal profiling data processing, analysis, and result reporting.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/emmesgit/RPREP",
    "language": [
        "Perl",
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2022-12-12T22:34:01.427919Z",
    "license": "GPL-3.0",
    "name": "RP-REP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.40668.1",
            "metadata": {
                "abstract": "© 2021. Jensen TL et al.Ribosomal profiling is an emerging experimental technology to measure protein synthesis by sequencing short mRNA fragments undergoing translation in ribosomes. Applied on the genome wide scale, this is a powerful tool to profile global protein synthesis within cell populations of interest. Such information can be utilized for biomarker discovery and detection of treatment-responsive genes. However, analysis of ribosomal profiling data requires careful preprocessing to reduce the impact of artifacts and dedicated statistical methods for visualizing and modeling the high-dimensional discrete read count data. Here we present Ribosomal Profiling Reports (RP-REP), a new open-source cloud-enabled software that allows users to execute start-to-end gene-level ribosomal profiling and RNA-Seq analysis on a pre-configured Amazon Virtual Machine Image (AMI) hosted on AWS or on the user’s own Ubuntu Linux server. The software works with FASTQ files stored locally, on AWS S3, or at the Sequence Read Archive (SRA). RP-REP automatically executes a series of customizable steps including filtering of contaminant RNA, enrichment of true ribosomal footprints, reference alignment and gene translation quantification, gene body coverage, CRAM compression, reference alignment QC, data normalization, multivariate data visualization, identification of differentially translated genes, and generation of heatmaps, co-translated gene clusters, enriched pathways, and other custom visualizations. RP-REP provides functionality to contrast RNA-SEQ and ribosomal profiling results, and calculates translational efficiency per gene. The software outputs a PDF report and publication-ready table and figure files. As a use case, we provide RP-REP results for a dengue virus study that tested cytosol and endoplasmic reticulum cellular fractions of human Huh7 cells pre-infection and at 6 h, 12 h, 24 h, and 40 h post-infection. Case study results, Ubuntu installation scripts, and the most recent RP-REP source code are accessible at GitHub. The cloud-ready AMI is available at AWS (AMI ID: RPREP RSEQREP (Ribosome Profiling and RNA-Seq Reports) v2.1 (ami-00b92f52d763145d3)).",
                "authors": [
                    {
                        "name": "Cherikh S.R."
                    },
                    {
                        "name": "Goll J.B."
                    },
                    {
                        "name": "Hooper W.F."
                    },
                    {
                        "name": "Jensen T.L."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "RP-REP Ribosomal Profiling Reports: an open-source cloudenabled framework for reproducible ribosomal profiling data processing, analysis, and result reporting"
            },
            "pmcid": "PMC9579745",
            "pmid": "36299497"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
