{
    "additionDate": "2021-01-18T12:06:44Z",
    "biotoolsCURIE": "biotools:srcv",
    "biotoolsID": "srcv",
    "confidence_flag": "tool",
    "description": "Machine Learning Enhanced Spectrum Recognition Based on Computer Vision (SRCV) for Intelligent NMR Data Extraction.\n\nSpectrum recognition based on computer vision: A tool for 13C and 1H NMR data extraction from already analyzed spectra. This is the repository of codes for the paper entitled “Machine learning enhanced spectrum recognition system SRCV for intelligent NMR data extraction”. This repository contains the source codes, datasets for number recognition training and test, and 1D NMR spectra examples for NMR data extraction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WJmodels/SRCV",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-21T15:16:00Z",
    "license": "MIT",
    "name": "SRCV",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C01046",
            "metadata": {
                "abstract": "© A machine learning enhanced spectrum recognition system called spectrum recognition based on computer vision (SRCV) for data extraction from previously analyzed 13C and 1H NMR spectra has been developed. The intelligent system was designed with four function modules to extract data from three areas of NMR images, including 13C and 1H chemical shifts, the integral, and the range of the shift values. During this study, three machine learning models were pretrained for number recognition, which is the key procedure for NMR data extraction. The k nearest neighbor (kNN) method was selected with optimized k (k = 4), which displayed a 100% recognition rate. Subsequently, the performance of SRCV was tested and validated to have high accuracy with a short processing time (11-21 s) for each NMR spectral image. Our spectrum recognizer enables high-throughput 13C and 1H NMR data extraction from abundant spectra in the literature and has the potential to be used for spectral database construction. In addition, the system may be applicable to be developed for data import to computer-assisted structure elucidation systems, which would automate this procedure significantly. SRCV can be accessed in GitHub (https://github.com/WJmodels/SRCV).",
                "authors": [
                    {
                        "name": "Jia W."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Lei Z."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "date": "2021-01-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Machine Learning Enhanced Spectrum Recognition Based on Computer Vision (SRCV) for Intelligent NMR Data Extraction"
            },
            "pmid": "33170690"
        }
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}