{
    "additionDate": "2017-12-18T00:14:57Z",
    "biotoolsCURIE": "biotools:igpcr-drug",
    "biotoolsID": "igpcr-drug",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "Predicting interaction between GPCRs and drugs in the cellular networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/iGPCR-Drug/readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iGPCR-Drug/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/igpcr-drug-predicting-drug-gpcr-interaction-in-cellular-networking.html"
        }
    ],
    "name": "iGPCR-Drug",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0072234",
            "metadata": {
                "abstract": "Involved in many diseases such as cancer, diabetes, neurodegenerative, inflammatory and respiratory disorders, G-protein-coupled receptors (GPCRs) are among the most frequent targets of therapeutic drugs. It is time-consuming and expensive to determine whether a drug and a GPCR are to interact with each other in a cellular network purely by means of experimental techniques. Although some computational methods were developed in this regard based on the knowledge of the 3D (dimensional) structure of protein, unfortunately their usage is quite limited because the 3D structures for most GPCRs are still unknown. To overcome the situation, a sequence-based classifier, called \"iGPCR-drug\", was developed to predict the interactions between GPCRs and drugs in cellular networking. In the predictor, the drug compound is formulated by a 2D (dimensional) fingerprint via a 256D vector, GPCR by the PseAAC (pseudo amino acid composition) generated with the grey model theory, and the prediction engine is operated by the fuzzy K-nearest neighbour algorithm. Moreover, a user-friendly web-server for iGPCR-drug was established at http://www.jci-bioinfo.cn/iGPCR-Drug/. For the convenience of most experimental scientists, a step-by-step guide is provided on how to use the web-server to get the desired results without the need to follow the complicated math equations presented in this paper just for its integrity. The overall success rate achieved by iGPCR-drug via the jackknife test was 85.5%, which is remarkably higher than the rate by the existing peer method developed in 2010 although no web server was ever established for it. It is anticipated that iGPCR-Drug may become a useful high throughput tool for both basic research and drug development, and that the approach presented here can also be extended to study other drug - target interaction networks. © 2013 Xiao et al.",
                "authors": [
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Min J.-L."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 101,
                "date": "2013-08-27T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "iGPCR-Drug: A Web Server for Predicting Interaction between GPCRs and Drugs in Cellular Networking"
            },
            "pmcid": "PMC3754978",
            "pmid": "24015221",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ],
    "validated": 1
}