{
    "additionDate": "2024-04-19T08:21:06.741187Z",
    "biotoolsCURIE": "biotools:phosboost",
    "biotoolsID": "phosboost",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "taner.sen@usda.gov",
            "name": "Taner Z. Sen",
            "orcidid": "https://orcid.org/0000-0002-5553-6190",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved phosphorylation prediction recall using gradient boosting and protein language models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eporetsky/PhosBoost",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-04-19T08:21:06.743436Z",
    "license": "GPL-3.0",
    "name": "PhosBoost",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PLD3.554",
            "metadata": {
                "abstract": "Protein phosphorylation is a dynamic and reversible post-translational modification that regulates a variety of essential biological processes. The regulatory role of phosphorylation in cellular signaling pathways, protein–protein interactions, and enzymatic activities has motivated extensive research efforts to understand its functional implications. Experimental protein phosphorylation data in plants remains limited to a few species, necessitating a scalable and accurate prediction method. Here, we present PhosBoost, a machine-learning approach that leverages protein language models and gradient-boosting trees to predict protein phosphorylation from experimentally derived data. Trained on data obtained from a comprehensive plant phosphorylation database, qPTMplants, we compared the performance of PhosBoost to existing protein phosphorylation prediction methods, PhosphoLingo and DeepPhos. For serine and threonine prediction, PhosBoost achieved higher recall than PhosphoLingo and DeepPhos (.78,.56, and.14, respectively) while maintaining a competitive area under the precision-recall curve (.54,.56, and.42, respectively). PhosphoLingo and DeepPhos failed to predict any tyrosine phosphorylation sites, while PhosBoost achieved a recall score of.6. Despite the precision-recall tradeoff, PhosBoost offers improved performance when recall is prioritized while consistently providing more confident probability scores. A sequence-based pairwise alignment step improved prediction results for all classifiers by effectively increasing the number of inferred positive phosphosites. We provide evidence to show that PhosBoost models are transferable across species and scalable for genome-wide protein phosphorylation predictions. PhosBoost is freely and publicly available on GitHub.",
                "authors": [
                    {
                        "name": "Andorf C.M."
                    },
                    {
                        "name": "Poretsky E."
                    },
                    {
                        "name": "Sen T.Z."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Plant Direct",
                "title": "PhosBoost: Improved phosphorylation prediction recall using gradient boosting and protein language models"
            },
            "pmcid": "PMC10732782",
            "pmid": "38124705"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
