{
    "additionDate": "2021-01-20T11:06:05Z",
    "biotoolsCURIE": "biotools:cytof",
    "biotoolsID": "cytof",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zicheng.hu@ucsf.edu",
            "name": "Zicheng Hu",
            "orcidid": "https://orcid.org/0000-0002-4168-1725",
            "typeEntity": "Person"
        },
        {
            "email": "atul.butte@ucsf.edu",
            "name": "Atul J. Butte",
            "orcidid": "https://orcid.org/0000-0002-7433-2740",
            "typeEntity": "Person"
        }
    ],
    "description": "A robust and interpretable end-to-end deep learning model for cytometry data.\n\nAn End-to-end Deep Learning Model for CyTOF data.\n\nThis GitHub repository contains a tutorial for creating deep learning models tailored to CyTOF data. We will apply the model to diagnose latent cytomegalovirus (CMV) infection. We will also use a decision tree-based method to identify cell subsets that are associated with the CMV infection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hzc363/DeepLearningCyTOF",
    "lastUpdate": "2021-05-14T05:52:51.358186Z",
    "name": "CyTOF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1073/PNAS.2003026117",
            "metadata": {
                "abstract": "© 2020 National Academy of Sciences. All rights reserved.Cytometry technologies are essential tools for immunology research, providing high-throughput measurements of the immune cells at the single-cell level. Existing approaches in interpreting and using cytometry measurements include manual or automated gating to identify cell subsets from the cytometry data, providing highly intuitive results but may lead to significant information loss, in that additional details in measured or correlated cell signals might be missed. In this study, we propose and test a deep convolutional neural network for analyzing cytometry data in an end-to-end fashion, allowing a direct association between raw cytometry data and the clinical outcome of interest. Using nine large cytometry by time-of-flight mass spectrometry or mass cytometry (CyTOF) studies from the open-access ImmPort database, we demonstrated that the deep convolutional neural network model can accurately diagnose the latent cytomegalovirus (CMV) in healthy individuals, even when using highly heterogeneous data from different studies. In addition, we developed a permutation-based method for interpreting the deep convolutional neural network model. We were able to identify a CD27-CD94+ CD8+ T cell population significantly associated with latent CMV infection, confirming the findings in previous studies. Finally, we provide a tutorial for creating, training, and interpreting the tailored deep learning model for cytometry data using Keras and TensorFlow (https://github.com/hzc363/DeepLearningCyTOF).",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Tang A."
                    },
                    {
                        "name": "Singh J."
                    },
                    {
                        "name": "Bhattacharya S."
                    },
                    {
                        "name": "Butte A.J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "A robust and interpretable end-to-end deep learning model for cytometry data"
            },
            "pmcid": "PMC7474669",
            "pmid": "32801215"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}