
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019Advances in mass spectrometry (MS) have revolutionized the ability to measure global changes in histone post-translational modifications (PTMs). The method routinely quantifies over 60 modification states in a single sample, far exceeding the capabilities of traditional western blotting. Thus, MS-based histone analysis has become an increasingly popular tool for understanding how genetic and environmental factors influence epigenetic states. However, histone proteomics experiments exhibit unique challenges, such as batch-to-batch reproducibility, accurate peak integration, and noisy data. Here, we discuss the steps of histone PTM analysis, from sample preparation and peak integration to data analysis and validation. We outline a set of best practices for ensuring data quality, accurate normalization, and robust statistics. Using these practices, we quantify histone modifications in 5 human cell lines, revealing that each cell line exhibits a unique epigenetic signature. We also provide a reproducible workflow for histone PTM analysis in the form of an R script, which is freely available at https://github.com/DenuLab/HistoneAnalysisWorkflow.",
            "authors": [
                "Thomas S.P.",
                "Haws S.A.",
                "Borth L.E.",
                "Denu J.M."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.YMETH.2019.12.001",
            "journal": "Methods",
            "pmid": "31816396",
            "title": "A practical guide for analysis of histone post-translational modifications by mass spectrometry: Best practices and pitfalls",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:HistoneAnalysisWorkflow",
        "biotoolsID": "HistoneAnalysisWorkflow",
        "description": "A practical guide for analysis of histone post-translational modifications by mass spectrometry.\n\nWorkflow to perform data quality checks, filtering, normalization, statistics, and visualization for histone PTM data run through EpiProfile 2.0.\n\nWorkflow to perform data quality checks, filtering, normalization, statistics, and visualization for histone PTM data run through EpiProfile 2.0 or Skyline software.\n\nRaw data and example scripts can be found at: doi:10.25345/C5ZQ0F.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'histone', 'practical guide analysis histone post-translational modifications mass spectrometry', 'batch-to-batch', 'PTM'",
        "homepage": "https://github.com/DenuLab/HistoneAnalysisWorkflow",
        "name": "HistoneAnalysisWorkflow"
    }
}