{
    "additionDate": "2021-01-18T09:35:52Z",
    "biotoolsCURIE": "biotools:oslihc",
    "biotoolsID": "oslihc",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Yang An",
            "typeEntity": "Person"
        },
        {
            "name": "Qiang Wang",
            "typeEntity": "Person"
        },
        {
            "email": "xqguo@henu.edu.cn",
            "name": "Xiangqian Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "An Online Prognostic Biomarker Analysis Tool for Hepatocellular Carcinoma.\n\nLiver hepatocellular carcinoma (LIHC) is one of the most common malignant tumors in the world with an increasing number of fatalities. Identification of novel prognosis biomarker for LIHC may improve treatment and therefore patient outcomes. The availability of public gene expression profiling data offers the opportunity to discover prognosis biomarkers for LIHC. We developed an online consensus survival analysis tool named OSlihc using gene expression profiling and long-term follow-up data to identify new prognosis biomarkers. OSlihc consists of 637 cases from four independent cohorts. As a risk assessment tool, OSlihc generates the Kaplan-Meier survival plot with hazard ratio (HR) and p value to evaluate the prognostic value of a gene of interest",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.henu.edu.cn/LIHC/LIHCList.jsp",
    "lastUpdate": "2021-03-15T09:41:53Z",
    "name": "OSlihc",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FPHAR.2020.00875",
            "metadata": {
                "abstract": "© Copyright © 2020 An, Wang, Zhang, Sun, Zhang, Li, Li, Peng, Zhu, Ji and Guo.Liver hepatocellular carcinoma (LIHC) is one of the most common malignant tumors in the world with an increasing number of fatalities. Identification of novel prognosis biomarker for LIHC may improve treatment and therefore patient outcomes. The availability of public gene expression profiling data offers the opportunity to discover prognosis biomarkers for LIHC. We developed an online consensus survival analysis tool named OSlihc using gene expression profiling and long-term follow-up data to identify new prognosis biomarkers. OSlihc consists of 637 cases from four independent cohorts. As a risk assessment tool, OSlihc generates the Kaplan–Meier survival plot with hazard ratio (HR) and p value to evaluate the prognostic value of a gene of interest. To test the reliability of OSlihc, we analyzed 65 previous reported prognostic biomarkers in OSlihc and showed that all of which have significant prognostic values. Furthermore, we identified four novel potential prognostic biomarkers (ATG9A, WIPI1, CXCL1, and CSNK2A2) for LIHC, the elevated expression of which predict the unfavorable survival outcomes. These genes (ATG9A, WIPI1, CXCL1, and CSNK2A2) may be potentially new biomarkers to identify at-risk LIHC patients when further validated. By OSlihc, users can evaluate the prognostic abilities of genes of their interest, which provides a platform for researchers to identify prognostic biomarkers to further develop targeted therapy strategies for LIHC patients. OSlihc is public and free to the users at http://bioinfo.henu.edu.cn/LIHC/LIHCList.jsp.",
                "authors": [
                    {
                        "name": "An Y."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Sun F."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Peng Y."
                    },
                    {
                        "name": "Zhu W."
                    },
                    {
                        "name": "Ji S."
                    },
                    {
                        "name": "Guo X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-10T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "OSlihc: An Online Prognostic Biomarker Analysis Tool for Hepatocellular Carcinoma"
            },
            "pmcid": "PMC7298068",
            "pmid": "32587519"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}