{
    "accessibility": "Open access",
    "additionDate": "2020-01-09T17:33:30Z",
    "biotoolsCURIE": "biotools:Gall-ID",
    "biotoolsID": "Gall-ID",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "changj@science.oregonstate.edu",
            "name": "Jeff H. Chang",
            "typeEntity": "Person"
        }
    ],
    "description": "tools for genotyping gall-causing phytopathogenic bacteria.\n\nIdentify strains isolated from Agrobacterium or Rhodococcus-induced galls using MLSA and other methods.\n\nIdentify Agrobacterium isolates using MLSA or whole genome sequences.\n\nIdentify Rhodococcus isolates using MLSA or whole genome sequences.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/pgd (CGRB.OREGONSTATE.EDU)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://gall-id.cgrb.oregonstate.edu/",
    "lastUpdate": "2021-01-06T16:39:54.598337Z",
    "name": "Gall-ID",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/peerj.2222",
            "metadata": {
                "abstract": "© 2016 Davis II et al.Understanding the population structure and genetic diversity of plant pathogens, as well as the effect of agricultural practices on pathogen evolution, is important for disease management. Developments in molecular methods have contributed to increase the resolution for accurate pathogen identification, but those based on analysis of DNA sequences can be less straightforward to use. To address this, we developed Gall-ID, a web-based platform that uses DNA sequence information from 16S rDNA, multilocus sequence analysis and whole genome sequences to group disease-associated bacteria to their taxonomic units. Gall-ID was developed with a particular focus on gall-forming bacteria belonging to Agrobacterium, Pseudomonas savastanoi, Pantoea agglomerans, and Rhodococcus. Members of these groups of bacteria cause growth deformation of plants, and some are capable of infecting many species of field, orchard, and nursery crops. Gall-ID also enables the use of high-throughput sequencing reads to search for evidence for homologs of characterized virulence genes, and provides downloadable software pipelines for automating multilocus sequence analysis, analyzing genome sequences for average nucleotide identity, and constructing core genome phylogenies. Lastly, additional databases were included in Gall-ID to help determine the identity of other plant pathogenic bacteria that may be in microbial communities associated with galls or causative agents in other diseased tissues of plants.",
                "authors": [
                    {
                        "name": "Davis E.W."
                    },
                    {
                        "name": "Weisberg A.J."
                    },
                    {
                        "name": "Tabima J.F."
                    },
                    {
                        "name": "Grunwald N.J."
                    },
                    {
                        "name": "Chang J.H."
                    }
                ],
                "citationCount": 16,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Gall-ID: Tools for genotyping gall-causing phytopathogenic bacteria"
            },
            "pmcid": "PMC4958008",
            "pmid": "27547538"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}