{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T11:01:35.164977Z",
    "biotoolsCURIE": "biotools:d-bfa",
    "biotoolsID": "d-bfa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dewen Hu"
        },
        {
            "name": "Limin Peng"
        }
    ],
    "description": "A functional human brain atlas termed D-BFA (DFC-based Brain Functional Atlas)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sliderplm/D-BFA-618",
    "language": [
        "D"
    ],
    "lastUpdate": "2024-11-24T15:28:53.476709Z",
    "license": "Not licensed",
    "name": "D-BFA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/cercor/bhac293",
            "metadata": {
                "abstract": "Brain cartography has expanded substantially over the past decade. In this regard, resting-state functional connectivity (FC) plays a key role in identifying the locations of putative functional borders. However, scant attention has been paid to the dynamic nature of functional interactions in the human brain. Indeed, FC is typically assumed to be stationary across time, which may obscure potential or subtle functional boundaries, particularly in regions with high flexibility and adaptability. In this study, we developed a dynamic FC (dFC)-based parcellation framework, established a new functional human brain atlas termed D-BFA (DFC-based Brain Functional Atlas), and verified its neurophysiological plausibility by stereo-EEG data. As the first dFC-based whole-brain atlas, the proposed D-BFA delineates finer functional boundaries that cannot be captured by static FC, and is further supported by good correspondence with cytoarchitectonic areas and task activation maps. Moreover, the D-BFA reveals the spatial distribution of dynamic variability across the brain and generates more homogenous parcels compared with most alternative parcellations. Our results demonstrate the superiority and practicability of dFC in brain parcellation, providing a new template to exploit brain topographic organization from a dynamic perspective. The D-BFA will be publicly available for download at https://github.com/sliderplm/D-BFA-618.",
                "authors": [
                    {
                        "name": "Hou C."
                    },
                    {
                        "name": "Hu D."
                    },
                    {
                        "name": "Luo Z."
                    },
                    {
                        "name": "Peng L."
                    },
                    {
                        "name": "Shen H."
                    },
                    {
                        "name": "Zeng L.-L."
                    },
                    {
                        "name": "Zhou Z."
                    }
                ],
                "citationCount": 5,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Cerebral Cortex",
                "title": "Parcellating the human brain using resting-state dynamic functional connectivity"
            },
            "pmid": "35965076"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
