
{
    "credit": [
        {
            "email": "ehaghshe@sfu.ca",
            "name": "Ehsan Haghshenas",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "faraz.hach@ubc.ca",
            "name": "Faraz Hach",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/vpc-ccg/lordfast/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/vpc-ccg/lordfast/releases"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "C++"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Medicine",
                "uri": "http://edamontology.org/topic_3303"
            }
        ]
    },
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/vpc-ccg/lordfast/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Published by Oxford University Press. All rights reserved.Motivation Recent advances in genomics and precision medicine have been made possible through the application of high throughput sequencing (HTS) to large collections of human genomes. Although HTS technologies have proven their use in cataloging human genome variation, computational analysis of the data they generate is still far from being perfect. The main limitation of Illumina and other popular sequencing technologies is their short read length relative to the lengths of (common) genomic repeats. Newer (single molecule sequencing-SMS) technologies such as Pacific Biosciences and Oxford Nanopore are producing longer reads, making it theoretically possible to overcome the difficulties imposed by repeat regions. Unfortunately, because of their high sequencing error rate, reads generated by these technologies are very difficult to work with and cannot be used in many of the standard downstream analysis pipelines. Note that it is not only difficult to find the correct mapping locations of such reads in a reference genome, but also to establish their correct alignment so as to differentiate sequencing errors from real genomic variants. Furthermore, especially since newer SMS instruments provide higher throughput, mapping and alignment need to be performed much faster than before, maintaining high sensitivity. Results We introduce lordFAST, a novel long-read mapper that is specifically designed to align reads generated by PacBio and potentially other SMS technologies to a reference. lordFAST not only has higher sensitivity than the available alternatives, it is also among the fastest and has a very low memory footprint.",
            "authors": [
                "Haghshenas E.",
                "Sahinalp S.C.",
                "Hach F."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty544",
            "journal": "Bioinformatics",
            "title": "LordFAST: Sensitive and fast alignment search tool for long noisy read sequencing data",
            "type": "Primary",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lordFAST",
        "biotoolsID": "lordFAST",
        "description": "Sensitive and Fast Alignment Search Tool for LOng noisy Read sequencing Data.",
        "homepage": "https://github.com/vpc-ccg/lordfast",
        "name": "lordFAST"
    }
}