{
    "additionDate": "2020-01-14T19:58:44Z",
    "biotoolsCURIE": "biotools:rKIN",
    "biotoolsID": "rKIN",
    "confidence_flag": "tool",
    "description": "Kernel-based method for estimating isotopic niche size and overlap.\n\nThe isotopic niche of consumers represents biologically relevant information on resource and habitat use. Several tools have been developed to quantify niche size and overlap. Nonetheless, methods adapted by spatial ecologists to quantify animal home ranges can be modified for use in stable isotope ecology when data are not normally distributed in bivariate space. We offer a tool that draws on existing spatial metrics, such as Minimum Convex Polygon (MCP) and Standard Ellipse Area (SEA), and add novel metrics using Kernel Utilization Density (KUD) estimators to measure isotopic niche size and overlap. We present examples using empirical and simulated data to demonstrate the performance of the package Kernel Isotopic Niches in R (rKIN) under various scenarios.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                }
            ]
        }
    ],
    "homepage": "https://github.com/salbeke/rKIN",
    "lastUpdate": "2021-01-15T19:38:54Z",
    "name": "rKIN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/1365-2656.13159",
            "metadata": {
                "abstract": "© 2019 British Ecological SocietyThe isotopic niche of consumers represents biologically relevant information on resource and habitat use. Several tools have been developed to quantify niche size and overlap. Nonetheless, methods adapted by spatial ecologists to quantify animal home ranges can be modified for use in stable isotope ecology when data are not normally distributed in bivariate space. We offer a tool that draws on existing spatial metrics, such as minimum convex polygon (MCP) and standard ellipse area (SEA), and add novel metrics using kernel utilization density (KUD) estimators to measure isotopic niche size and overlap. We present examples using empirical and simulated data to demonstrate the performance of the package kernel isotopic niches in r (rKIN) under various scenarios. Results of niche size from MCP, SEA and KUD were highly correlated but divergent among datasets. Overall, the KUD method produced the largest niche sizes and was more sensitive to the distribution of the isotopic data. Pairwise estimates of overlap were highly variable, likely because MCP and SEA inherently include or exclude unused areas in the resulting niche estimate. Four bandwidth methods (reference, normal scale, plug-in and biased cross-validation) produced comparable estimates of niche size and overlap at various sample sizes (10–40). Niche size and overlap were consistent across sample sizes >15. Use of rKIN will allow isotope ecologists to quantify niche shifts, expansions or contractions, as well as assess the performance of several estimation methods. The package also can be applied to other data types (e.g. principal component analysis, multi-dimensional scaling) so long as axes and measurement units are identical and can be converted to Cartesian coordinates.",
                "authors": [
                    {
                        "name": "Eckrich C.A."
                    },
                    {
                        "name": "Albeke S.E."
                    },
                    {
                        "name": "Flaherty E.A."
                    },
                    {
                        "name": "Bowyer R.T."
                    },
                    {
                        "name": "Ben-David M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Journal of Animal Ecology",
                "title": "rKIN: Kernel-based method for estimating isotopic niche size and overlap"
            },
            "pmid": "31799690"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}