{
    "name": "LFPy", 
    "description": "Python package for calculation of extracellular potentials from multicompartment neuron models. It relies on the NEURON simulator and uses the Python interface it provides.", 
    "homepage": "http://lfpy.github.io/", 
    "biotoolsID": "lfpy", 
    "biotoolsCURIE": "biotools:lfpy", 
    "version": [
        "1.1.3"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3438", 
                    "term": "Calculation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3562", 
                    "term": "Network simulation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0950", 
                        "term": "Mathematical model"
                    }, 
                    "format": []
                }
            ], 
            "output": [], 
            "note": "If you have a model working in NEURON already, it is likely that it can be adapted to work with LFPy", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3304", 
            "term": "Neurobiology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3334", 
            "term": "Neurology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3306", 
            "term": "Biophysics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://lfpy.github.io/#tutorial-slides-on-lfpy", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.3389/fninf.2013.00041", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "LFPy: A tool for biophysical simulation of extracellular potentials generated by detailed model neurons", 
                "abstract": "Electrical extracellular recordings, i.e., recordings of the electrical potentials in the extracellular medium between cells, have been a main work-horse in electrophysiology for almost a century. The high-frequency part of the signal (>500 Hz), i.e., the multi-unit activity (MUA), contains information about the firing of action potentials in surrounding neurons, while the low-frequency part, the local field potential (LFP), contains information about how these neurons integrate synaptic inputs. As the recorded extracellular signals arise from multiple neural processes, their interpretation is typically ambiguous and difficult. Fortunately, a precise biophysical modeling scheme linking activity at the cellular level and the recorded signal has been established: the extracellular potential can be calculated as a weighted sum of all transmembrane currents in all cells located in the vicinity of the electrode. This computational scheme can considerably aid the modeling and analysis of MUA and LFP signals. Here, we describe LFPy, an open source Python package for numerical simulations of extracellular potentials. LFPy consists of a set of easy-to-use classes for defining cells, synapses and recording electrodes as Python objects, implementing this biophysical modeling scheme. It runs on top of the widely used NEURON simulation environment, which allows for flexible usage of both new and existing cell models. Further, calculation of extracellular potentials using the line-source-method is efficiently implemented. We describe the theoretical framework underlying the extracellular potential calculations and illustrate by examples how LFPy can be used both for simulating LFPs, i.e., synaptic contributions from single cells as well a populations of cells, and MUAs, i.e., extracellular signatures of action potentials. © 2014 Lindén, Hagen, Łeski, Norheim, Pettersen and Einevoll.", 
                "date": "2014-01-16T00:00:00Z", 
                "citationCount": 54, 
                "authors": [
                    {
                        "name": "Linden H."
                    }, 
                    {
                        "name": "Hagen E."
                    }, 
                    {
                        "name": "Leski S."
                    }, 
                    {
                        "name": "Norheim E.S."
                    }, 
                    {
                        "name": "Pettersen K.H."
                    }, 
                    {
                        "name": "Einevoll G.T."
                    }
                ], 
                "journal": "Frontiers in Neuroinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://lfpy.github.io/index.html", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "UiO", 
    "additionDate": "2017-05-10T11:43:03Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}