{
    "additionDate": "2020-01-14T09:03:39Z",
    "biotoolsCURIE": "biotools:MDiNE",
    "biotoolsID": "MDiNE",
    "confidence_flag": "tool",
    "description": "A model to estimate differential co-occurrence networks in microbiome studies.\n\n(Note: This package is currently in development) Microbiome Differential Network Estimation (mdine) allows the estimation of OTU co-occurrence networks within two separate groups, where the networks are defined through precision matrices. The difference between the two precision matrices is also estimated, along with corresponding interval estimates. This work was developed in the Greenwood Lab at McGill University.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kevinmcgregor/mdine",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-23T08:15:56Z",
    "name": "MDiNE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ824",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: The human microbiota is the collection of microorganisms colonizing the human body, and plays an integral part in human health. A growing trend in microbiome analysis is to construct a network to estimate the co-occurrence patterns among taxa through precision matrices. Existing methods do not facilitate investigation into how these networks change with respect to covariates. Results: We propose a new model called Microbiome Differential Network Estimation (MDiNE) to estimate network changes with respect to a binary covariate. The counts of individual taxa in the samples are modeled through a multinomial distribution whose probabilities depend on a latent Gaussian random variable. A sparse precision matrix over all the latent terms determines the co-occurrence network among taxa. The model fit is obtained and evaluated using Hamiltonian Monte Carlo methods. The performance of our model is evaluated through an extensive simulation study and is shown to outperform existing methods in terms of estimation of network parameters. We also demonstrate an application of the model to estimate changes in the intestinal microbial network topology with respect to Crohn’s disease. Availability and implementation: MDiNE is implemented in a freely available R package: https://github.com/kevinmcgregor/mdine.",
                "authors": [
                    {
                        "name": "McGregor K."
                    },
                    {
                        "name": "Labbe A."
                    },
                    {
                        "name": "Greenwood C.M.T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MDiNE: A model to estimate differential co-occurrence networks in microbiome studies"
            },
            "pmid": "31697315"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}