{
    "additionDate": "2021-06-14T12:44:05Z",
    "biotoolsCURIE": "biotools:ccmed",
    "biotoolsID": "ccmed",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fan.3.yang@cuanschutz.edu",
            "name": "Lin S Chen",
            "orcidid": "https://orcid.org/0000-0002-6645-5708",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "lchen@health.bsd.uchicago.edu",
            "name": "Fan Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CCmed is a package for cross-condition mediation analysis for identifying replicable trans-associations mediated by cis-gene expression. The goal of CCmed is to provide computationally efficient tools to conduct cross-condition mediation analysis. CCmed identifies trans-associations mediated by cis-effects (e.g. trans-associations of eQTLs mediated by effects on cis-gene expression levels). Mediation analyses can be performed at the gene-level or used to identify trans-associations of complex trait GWAS SNPs/variants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://github.com/kjgleason/CCmed",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:20:16.559048Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/kjgleason/CCmed/issues"
        }
    ],
    "name": "CCmed",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab139",
            "metadata": {
                "abstract": "Motivation: Trans-acting expression quantitative trait loci (eQTLs) collectively explain a substantial proportion of expression variation, yet are challenging to detect and replicate since their effects are often individually weak. A large proportion of genetic effects on distal genes are mediated through cis-gene expression. Cis-association (between SNP and cis-gene) and gene-gene correlation conditional on SNP genotype could establish trans-association (between SNP and trans-gene). Both cis-association and gene-gene conditional correlation have effects shared across relevant tissues and conditions, and trans-associations mediated by cis-gene expression also have effects shared across relevant conditions. Results: We proposed a Cross-Condition Mediation analysis method (CCmed) for detecting cis-mediated trans-associations with replicable effects in relevant conditions/studies. CCmed integrates cis-association and gene-gene conditional correlation statistics from multiple tissues/studies. Motivated by the bimodal effect-sharing patterns of eQTLs, we proposed two variations of CCmed, CCmedmostand CCmedspecfor detecting cross-tissue and tissuespecific trans-associations, respectively. We analyzed data of 13 brain tissues from the Genotype-Tissue Expression (GTEx) project, and identified trios with cis-mediated trans-associations across brain tissues, many of which showed evidence of trans-association in two replication studies. We also identified trans-genes associated with schizophrenia loci in at least two brain tissues.",
                "authors": [
                    {
                        "name": "Chen L.S."
                    },
                    {
                        "name": "Duan J."
                    },
                    {
                        "name": "Gleason K.J."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Pierce B.L."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yang F."
                    }
                ],
                "citationCount": 2,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CCmed: Cross-condition mediation analysis for identifying replicable trans-associations mediated by cis-gene expression"
            },
            "pmcid": "PMC8428610",
            "pmid": "33647928",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}
