{
    "accessibility": [],
    "additionDate": "2017-01-13T13:13:28Z",
    "biotoolsCURIE": "biotools:a5",
    "biotoolsID": "a5",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "aarondarling@ucdavis.edu",
            "gridid": null,
            "name": "Aaron E. Darling",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "A5 is an integrative pipeline for genome assembly that automates sequence data cleaning, error correction, assembly, and quality control by chaining a number of programs together with additional custom algorithms.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://sourceforge.net/p/ngopt/wiki/browse_pages/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://sourceforge.net/projects/ngopt/",
    "homepage_status": 0,
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "GPL-3.0",
    "link": [],
    "maturity": "Mature",
    "name": "A5",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0042304",
            "metadata": {
                "abstract": "Remarkable advances in DNA sequencing technology have created a need for de novo genome assembly methods tailored to work with the new sequencing data types. Many such methods have been published in recent years, but assembling raw sequence data to obtain a draft genome has remained a complex, multi-step process, involving several stages of sequence data cleaning, error correction, assembly, and quality control. Successful application of these steps usually requires intimate knowledge of a diverse set of algorithms and software. We present an assembly pipeline called A5 (Andrew And Aaron's Awesome Assembly pipeline) that simplifies the entire genome assembly process by automating these stages, by integrating several previously published algorithms with new algorithms for quality control and automated assembly parameter selection. We demonstrate that A5 can produce assemblies of quality comparable to a leading assembly algorithm, SOAPdenovo, without any prior knowledge of the particular genome being assembled and without the extensive parameter tuning required by the other assembly algorithm. In particular, the assemblies produced by A5 exhibit 50% or more reduction in broken protein coding sequences relative to SOAPdenovo assemblies. The A5 pipeline can also assemble Illumina sequence data from libraries constructed by the Nextera (transposon-catalyzed) protocol, which have markedly different characteristics to mechanically sheared libraries. Finally, A5 has modest compute requirements, and can assemble a typical bacterial genome on current desktop or laptop computer hardware in under two hours, depending on depth of coverage. © 2012 Tritt et al.",
                "authors": [
                    {
                        "name": "Tritt A."
                    },
                    {
                        "name": "Eisen J.A."
                    },
                    {
                        "name": "Facciotti M.T."
                    },
                    {
                        "name": "Darling A.E."
                    }
                ],
                "citationCount": 257,
                "date": "2012-09-13T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "An Integrated Pipeline for de Novo Assembly of Microbial Genomes"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": []
}