{"credit":[{"email":"CB-Admin@dundee.ac.uk","name":"Barton Group Secretary","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Sequence similarity search","uri":"http://edamontology.org/operation_0346"},{"term":"Protein fold recognition","uri":"http://edamontology.org/operation_0303"},{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"},{"term":"Sequence database search","uri":"http://edamontology.org/operation_0338"},{"term":"Protein feature detection","uri":"http://edamontology.org/operation_3092"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Molecular dynamics","uri":"http://edamontology.org/topic_0176"}]},"publication":[{"abstract":"SCANPS performs iterative profile searching similar to PSI-BLAST but with full dynamic programing on each cycle and on-the-fly estimation of significance. This combination gives good sensitivity and selectivity that outperforms PSI-BLAST in domain-searching benchmarks. Although computationally expensive, SCANPS exploits onchip parallelism (MMX and SSE2 instructions on Intel chips) as well as MPI parallelism to give acceptable turnround times even for large databases. A web server developed to run SCANPS searches is now available at http://www.compbio.dundee.ac.uk/www-scanps. The server interface allows a range of different protein sequence databases to be searched including the SCOP database of protein domains. The server provides the user with regularly updated versions of the main protein sequence databases and is backed up by significant computing resources which ensure that searches are performed rapidly. For SCOP searches, the results may be viewed in a new tree-based representation that reflects the structure of the SCOP hierarchy; this aids the user in placing each hit in the context of its SCOP classification and understanding its relationship to other domains in SCOP.","authors":["Walsh T.P.","Webber C.","Searle S.","Sturrock S.S.","Barton G.J."],"cit_count":7,"journal":"Nucleic acids research","pmid":"18503088","title":"SCANPS: a web server for iterative protein sequence database searching by dynamic programing, with display in a hierarchical SCOP browser.","year":"2008-01-01"}],"summary":{"biotoolsCURIE":"biotools:scanps","biotoolsID":"scanps","description":"Web server for iterative protein sequence database searching by dynamic programming. Sensitivity and selectivity outperform PSI-BLAST. The server allows a range of different protein sequence databases to be searched including the SCOP database of protein domains.","homepage":"http://www.compbio.dundee.ac.uk/www-scanps","name":"SCANPS"}}