{
    "additionDate": "2021-01-18T11:25:01Z",
    "biotoolsCURIE": "biotools:snowball-ica",
    "biotoolsID": "snowball-ica",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cong@dlut.edu.cn",
            "name": "Fengyu Cong",
            "typeEntity": "Person"
        },
        {
            "email": "lisa_nickerson@hms.harvard.edu",
            "name": "Lisa D. Nickerson",
            "typeEntity": "Person"
        }
    ],
    "description": "A Model Order Free Independent Component Analysis Strategy for Functional Magnetic Resonance Imaging Data.\n\nSnowball ICA: A Model order free Independent Component Analysis Scenario for Functional Magnetic Resonance Imaging Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GHu-DUT/Snowball-ICA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-20T08:44:15Z",
    "name": "Snowball ICA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FNINS.2020.569657",
            "metadata": {
                "abstract": "© Copyright © 2020 Hu, Waters, Aslan, Frederick, Cong and Nickerson.In independent component analysis (ICA), the selection of model order (i.e., number of components to be extracted) has crucial effects on functional magnetic resonance imaging (fMRI) brain network analysis. Model order selection (MOS) algorithms have been used to determine the number of estimated components. However, simulations show that even when the model order equals the number of simulated signal sources, traditional ICA algorithms may misestimate the spatial maps of the signal sources. In principle, increasing model order will consider more potential information in the estimation, and should therefore produce more accurate results. However, this strategy may not work for fMRI because large-scale networks are widely spatially distributed and thus have increased mutual information with noise. As such, conventional ICA algorithms with high model orders may not extract these components at all. This conflict makes the selection of model order a problem. We present a new strategy for model order free ICA, called Snowball ICA, that obviates these issues. The algorithm collects all information for each network from fMRI data without the limitations of network scale. Using simulations and in vivo resting-state fMRI data, our results show that component estimation using Snowball ICA is more accurate than traditional ICA. The Snowball ICA software is available at https://github.com/GHu-DUT/Snowball-ICA.",
                "authors": [
                    {
                        "name": "Hu G."
                    },
                    {
                        "name": "Waters A.B."
                    },
                    {
                        "name": "Aslan S."
                    },
                    {
                        "name": "Frederick B."
                    },
                    {
                        "name": "Cong F."
                    },
                    {
                        "name": "Nickerson L.D."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-18T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "Snowball ICA: A Model Order Free Independent Component Analysis Strategy for Functional Magnetic Resonance Imaging Data"
            },
            "pmcid": "PMC7530342",
            "pmid": "33071741"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ]
}