{
    "additionDate": "2023-01-28T11:21:03.788494Z",
    "biotoolsCURIE": "biotools:e-tsn",
    "biotoolsID": "e-tsn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shiliangli@ecust.edu.cn",
            "name": "Shiliang Li",
            "orcidid": "https://orcid.org/0000-0003-4414-237X",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive visual exploration platform for target-disease knowledge mapping from literature.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.lilab-ecust.cn/etsn/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-28T11:21:03.791066Z",
    "license": "Other",
    "name": "e-TSN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC465",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.Target discovery and identification processes are driven by the increasing amount of biomedical data. The vast numbers of unstructured texts of biomedical publications provide a rich source of knowledge for drug target discovery research and demand the development of specific algorithms or tools to facilitate finding disease genes and proteins. Text mining is a method that can automatically mine helpful information related to drug target discovery from massive biomedical literature. However, there is a substantial lag between biomedical publications and the subsequent abstraction of information extracted by text mining to databases. The knowledge graph is introduced to integrate heterogeneous biomedical data. Here, we describe e-TSN (Target significance and novelty explorer, http://www.lilab-ecust.cn/etsn/), a knowledge visualization web server integrating the largest database of associations between targets and diseases from the full scientific literature by constructing significance and novelty scoring methods based on bibliometric statistics. The platform aims to visualize target-disease knowledge graphs to assist in prioritizing candidate disease-related proteins. Approved drugs and associated bioactivities for each interested target are also provided to facilitate the visualization of drug-target relationships. In summary, e-TSN is a fast and customizable visualization resource for investigating and analyzing the intricate target-disease networks, which could help researchers understand the mechanisms underlying complex disease phenotypes and improve the drug discovery and development efficiency, especially for the unexpected outbreak of infectious disease pandemics like COVID-19.",
                "authors": [
                    {
                        "name": "Feng Z."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Shen Z."
                    }
                ],
                "date": "2022-11-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "e-TSN: an interactive visual exploration platform for target-disease knowledge mapping from literature"
            },
            "pmcid": "PMC9677481",
            "pmid": "36347537"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
