{
    "additionDate": "2021-01-18T12:02:08Z",
    "biotoolsCURIE": "biotools:dnmso",
    "biotoolsID": "dnmso",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "savastakan@iyte.edu.tr",
            "name": "Savaş Takan",
            "typeEntity": "Person"
        }
    ],
    "description": "DNMSO is an ontology for representing de novo sequencing results from Tandem-MS data. For the identification and sequencing of proteins, mass spectrometry (MS) has become the tool of choice and as such drives proteomics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/savastakan/dnmso",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-01T19:25:27Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://savastakan.github.io/dnmso/"
        }
    ],
    "name": "DNMSO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.10216",
            "metadata": {
                "abstract": "© 2020 Takan and Allmer.For the identification and sequencing of proteins, mass spectrometry (MS) has become the tool of choice and, as such, drives proteomics. MS/MS spectra need to be assigned a peptide sequence for which two strategies exist. Either database search or de novo sequencing can be employed to establish peptide spectrum matches. For database search, mzIdentML is the current community standard for data representation. There is no community standard for representing de novo sequencing results, but we previously proposed the de novo markup language (DNML). At the moment, each de novo sequencing solution uses different data representation, complicating downstream data integration, which is crucial since ensemble predictions may be more useful than predictions of a single tool. We here propose the de novo MS Ontology (DNMSO), which can, for example, provide many-to-many mappings between spectra and peptide predictions. Additionally, an application programming interface (API) that supports any file operation necessary for de novo sequencing from spectra input to reading, writing, creating, of the DNMSO format, as well as conversion from many other file formats, has been implemented. This API removes all overhead from the production of de novo sequencing tools and allows developers to concentrate on algorithm development completely.",
                "authors": [
                    {
                        "name": "Allmer J."
                    },
                    {
                        "name": "Takan S."
                    }
                ],
                "date": "2020-10-21T00:00:00Z",
                "journal": "PeerJ",
                "title": "DNMSO; an ontology for representing de novo sequencing results from Tandem- MS data"
            },
            "pmcid": "PMC7585381",
            "pmid": "33150092"
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
