{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T09:25:48Z",
    "biotoolsCURIE": "biotools:deepvf",
    "biotoolsID": "deepvf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jiawei.Wang@monash.edu",
            "name": "Jiawei Wang",
            "typeEntity": "Person"
        },
        {
            "email": "Jiangning.Song@monash.edu",
            "name": "Jiangning Song",
            "typeEntity": "Person"
        },
        {
            "email": "yanjuzhang@guet.edu.cn",
            "name": "Yanju Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepVF is a deep learning-based hybrid framework for recognizing virulence factors using the stacking strategy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://deepvf.erc.monash.edu/",
    "lastUpdate": "2021-02-27T15:42:27Z",
    "name": "DeepVF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA125",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Virulence factors (VFs) enable pathogens to infect their hosts. A wealth of individual, disease-focused studies has identified a wide variety of VFs, and the growing mass of bacterial genome sequence data provides an opportunity for computational methods aimed at predicting VFs. Despite their attractive advantages and performance improvements, the existing methods have some limitations and drawbacks. Firstly, as the characteristics and mechanisms of VFs are continually evolving with the emergence of antibiotic resistance, it is more and more difficult to identify novel VFs using existing tools that were previously developed based on the outdated data sets; secondly, few systematic feature engineering efforts have been made to examine the utility of different types of features for model performances, as the majority of tools only focused on extracting very few types of features. By addressing the aforementioned issues, the accuracy of VF predictors can likely be significantly improved. This, in turn, would be particularly useful in the context of genome wide predictions of VFs. In this work, we present a deep learning (DL)-based hybrid framework (termed DeepVF) that is utilizing the stacking strategy to achieve more accurate identification of VFs. Using an enlarged, up-to-date dataset, DeepVF comprehensively explores a wide range of heterogeneous features with popular machine learning algorithms. Specifically, four classical algorithms, including random forest, support vector machines, extreme gradient boosting and multilayer perceptron, and three DL algorithms, including convolutional neural networks, long short-term memory networks and deep neural networks are employed to train 62 baseline models using these features. In order to integrate their individual strengths, DeepVF effectively combines these baseline models to construct the final meta model using the stacking strategy. Extensive benchmarking experiments demonstrate the effectiveness of DeepVF: it achieves a more accurate and stable performance compared with baseline models on the benchmark dataset and clearly outperforms state-of-the-art VF predictors on the independent test. Using the proposed hybrid ensemble model, a user-friendly online predictor of DeepVF (http://deepvf.erc.monash.edu/) is implemented. Furthermore, its utility, from the user's viewpoint, is compared with that of existing toolkits. We believe that DeepVF will be exploited as a useful tool for screening and identifying potential VFs from protein-coding gene sequences in bacterial genomes.",
                "authors": [
                    {
                        "name": "Xie R."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Dai W."
                    },
                    {
                        "name": "Leier A."
                    },
                    {
                        "name": "Marquez-Lago T.T."
                    },
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Lithgow T."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "DeepVF: a deep learning-based hybrid framework for identifying virulence factors using the stacking strategy"
            },
            "pmid": "32599617"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}