{
    "additionDate": "2018-07-07T17:14:36Z",
    "biotoolsCURIE": "biotools:marginalcausality",
    "biotoolsID": "marginalcausality",
    "credit": [
        {
            "email": "gilles.monneret@upmc.fr",
            "name": "Gilles Monneret",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Assess downstream causality between two variables.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Monneret/MarginalCausality/blob/master/vignettes/marginal_causality.Rmd"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Monneret/MarginalCausality",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "MarginalCausality",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0171142",
            "metadata": {
                "abstract": "© 2017 Monneret et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Causal network inference is an important methodological challenge in biology as well as other areas of application. Although several causal network inference methods have been proposed in recent years, they are typically applicable for only a small number of genes, due to the large number of parameters to be estimated and the limited number of biological replicates available. In this work, we consider the specific case of transcriptomic studies made up of both observational and interventional data in which a single gene of biological interest is knocked out. We focus on a marginal causal estimation approach, based on the framework of Gaussian directed acyclic graphs, to infer causal relationships between the knocked-out gene and a large set of other genes. In a simulation study, we found that our proposed method accurately differentiates between downstream causal relationships and those that are upstream or simply associative. It also enables an estimation of the total causal effects between the gene of interest and the remaining genes. Our method performed very similarly to a classical differential analysis for experiments with a relatively large number of biological replicates, but has the advantage of providing a formal causal interpretation. Our proposed marginal causal approach is computationally efficient and may be applied to several thousands of genes simultaneously. In addition, it may help highlight subsets of genes of interest for a more thorough subsequent causal network inference. The method is implemented in an R package called MarginalCausality (available on GitHub).",
                "authors": [
                    {
                        "name": "Monneret G."
                    },
                    {
                        "name": "Jaffrezic F."
                    },
                    {
                        "name": "Rau A."
                    },
                    {
                        "name": "Zerjal T."
                    },
                    {
                        "name": "Nuel G."
                    }
                ],
                "citationCount": 1,
                "date": "2017-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Identification of marginal causal relationships in gene networks from observational and interventional expression data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}