{
    "additionDate": "2020-01-09T17:36:38Z",
    "biotoolsCURIE": "biotools:BBCancer",
    "biotoolsID": "BBCancer",
    "confidence_flag": "tool",
    "description": "an expression atlas of blood-based biomarkers in the early diagnosis of cancers.\n\nThe early detection of cancer holds the key to combat and control the increasing global burden of cancer morbidity and mortality. Blood-based screenings using circulating DNAs (ctDNAs), circulating RNA (ctRNAs), circulating tumor cells (CTCs) and extracellular vesicles (EVs) have shown promising prospects in the early detection of cancer. Recent high-throughput gene expression profiling of blood samples from cancer patients has provided a valuable resource for developing new biomarkers for the early detection of cancer. However, a well-organized online repository for these blood-based high-throughput gene expression data is still not available",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://bbcancer.renlab.org/",
    "lastUpdate": "2024-11-24T20:56:45.920589Z",
    "name": "BBCancer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz942",
            "metadata": {
                "abstract": "The early detection of cancer holds the key to combat and control the increasing global burden of cancer morbidity and mortality. Blood-based screenings using circulating DNAs (ctDNAs), circulating RNA (ctRNAs), circulating tumor cells (CTCs) and extracellular vesicles (EVs) have shown promising prospects in the early detection of cancer. Recent high-throughput gene expression profiling of blood samples from cancer patients has provided a valuable resource for developing new biomarkers for the early detection of cancer. However, a well-organized online repository for these blood-based high-throughput gene expression data is still not available. Here, we present BBCancer (http://bbcancer.renlab.org/), a web-accessible and comprehensive open resource for providing the expression landscape of six types of RNAs, including messenger RNAs (mRNAs), long noncoding RNAs (lncRNAs), microRNAs (miRNAs), circular RNAs (circRNAs), tRNA-derived fragments (tRFRNAs) and Piwi-interacting RNAs (piRNAs) in blood samples, including plasma, CTCs and EVs, from cancer patients with various cancer types. Currently, BBCancer contains expression data of the six RNA types from 5040 normal and tumor blood samples across 15 cancer types. We believe this database will serve as a powerful platform for developing blood biomarkers.",
                "authors": [
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Xu Q."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Zhu K."
                    },
                    {
                        "name": "Zuo Z."
                    }
                ],
                "citationCount": 43,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BBCancer: An expression atlas of blood-based biomarkers in the early diagnosis of cancers"
            },
            "pmcid": "PMC7145713",
            "pmid": "31665503"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
