{
    "additionDate": "2020-01-09T18:36:08Z",
    "biotoolsCURIE": "biotools:ssmirna",
    "biotoolsID": "ssmirna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jrgreen@sce.carleton.ca",
            "name": "James R. Green",
            "typeEntity": "Person"
        }
    ],
    "description": "A semi-supervised machine learning framework for microRNA classification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GreenCUBIC/SSmiRNA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-16T14:23:45Z",
    "name": "Semi-supervised miRNA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S40246-019-0221-7",
            "metadata": {
                "abstract": "BACKGROUND: MicroRNAs (miRNAs) are a family of short, non-coding RNAs that have been linked to critical cellular activities, most notably regulation of gene expression. The identification of miRNA is a cross-disciplinary approach that requires both computational identification methods and wet-lab validation experiments, making it a resource-intensive procedure. While numerous machine learning methods have been developed to increase classification accuracy and thus reduce validation costs, most methods use supervised learning and thus require large labeled training data sets, often not feasible for less-sequenced species. On the other hand, there is now an abundance of unlabeled RNA sequence data due to the emergence of high-throughput wet-lab experimental procedures, such as next-generation sequencing. RESULTS: This paper explores the application of semi-supervised machine learning for miRNA classification in order to maximize the utility of both labeled and unlabeled data. We here present the novel combination of two semi-supervised approaches: active learning and multi-view co-training. Results across six diverse species show that this multi-stage semi-supervised approach is able to improve classification performance using very small numbers of labeled instances, effectively leveraging the available unlabeled data. CONCLUSIONS: The proposed semi-supervised miRNA classification pipeline holds the potential to identify novel miRNA with high recall and precision while requiring very small numbers of previously known miRNA. Such a method could be highly beneficial when studying miRNA in newly sequenced genomes of niche species with few known examples of miRNA.",
                "authors": [
                    {
                        "name": "Sheikh Hassani M."
                    },
                    {
                        "name": "Green J.R."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-22T00:00:00Z",
                "journal": "Human genomics",
                "title": "A semi-supervised machine learning framework for microRNA classification"
            },
            "pmcid": "PMC6805288",
            "pmid": "31639051"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}