{
    "additionDate": "2017-01-17T14:51:44Z",
    "biotoolsCURIE": "biotools:xcomb",
    "biotoolsID": "xcomb",
    "collectionID": [
        "ms-utils",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "Interogate protein-protein interactions and protein structure using cross-links FASTA databases.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "https://goodlett.umaryland.edu/xcomb.php",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-03-26T08:42:42Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "name": "xComb",
    "owner": "msutils_import",
    "publication": [
        {
            "metadata": {
                "abstract": "We developed an informatic method to identify tandem mass spectra composed of chemically cross-linked peptides from those of linear peptides and to assign sequence to each of the two unique peptide sequences. For a given set of proteins the key software tool, xComb, combs through all theoretically feasible cross-linked peptides to create a database consisting of a subset of all combinations represented as peptide FASTA files. The xComb library of select theoretical cross-linked peptides may then be used as a database that is examined by a standard proteomic search engine to match tandem mass spectral data sets to identify cross-linked peptides. The database search may be conducted against as many as 50 proteins with a number of common proteomic search engines, e.g. Phenyx, Sequest, OMSSA, Mascot and X!Tandem. By searching against a peptide library of linearized, cross-linked peptides, rather than a linearized protein library, search times are decreased and the process is decoupled from any specific search engine. A further benefit of decoupling from the search engine is that protein cross-linking studies may be conducted with readily available informatics tools for which scoring routines already exist within the proteomic community. © 2010 American Chemical Society.",
                "authors": [
                    {
                        "name": "Panchaud A."
                    },
                    {
                        "name": "Singh P."
                    },
                    {
                        "name": "Shaffer S.A."
                    },
                    {
                        "name": "Goodlett D.R."
                    }
                ],
                "citationCount": 56,
                "date": "2010-05-07T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "XComb: A cross-linked peptide database approach to protein-protein interaction analysis"
            },
            "pmid": "20302351"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}