{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T09:51:04.891526Z",
    "biotoolsCURIE": "biotools:gb_score",
    "biotoolsID": "gb_score",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Rohoullah Firouzi"
        }
    ],
    "description": "A scoring function based on Gradient Boosting Trees algorithm for predicting ligand-protein binding affinity. PDBbind 2019v collection of the general and refined sets minus core set is used for training GB-Score and core set is used as an independent test set.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/miladrayka/GB_Score",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-19T09:51:04.896394Z",
    "license": "AGPL-3.0",
    "name": "GB-Score",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/MINF.202200135",
            "metadata": {
                "abstract": "In recent years, thanks to advances in computer hardware and dataset availability, data-driven approaches (like machine learning) have become one of the essential parts of the drug design framework to accelerate drug discovery procedures. Constructing a new scoring function, a function that can predict the binding score for a generated protein-ligand pose during docking procedure or a crystal complex, based on machine and deep learning has become an active research area in computer-aided drug design. GB-Score is a state-of-the-art machine learning-based scoring function that utilizes distance-weighted interatomic contact features, PDBbind-v2019 general set, and Gradient Boosting Trees algorithm to the binding affinity prediction. The distance-weighted interatomic contact featurization method used the distance between different ligand and protein atom types for numerical representation of the protein-ligand complex. GB-Score attains Pearson's correlation 0.862 and RMSE 1.190 on the CASF-2016 benchmark test in the scoring power metric. GB-Score's codes are freely available on the web at https://github.com/miladrayka/GB_Score.",
                "authors": [
                    {
                        "name": "Firouzi R."
                    },
                    {
                        "name": "Rayka M."
                    }
                ],
                "date": "2023-03-01T00:00:00Z",
                "journal": "Molecular Informatics",
                "title": "GB-score: Minimally designed machine learning scoring function based on distance-weighted interatomic contact features"
            },
            "pmid": "36722733"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}
