{
    "additionDate": "2017-08-03T19:03:30Z",
    "biotoolsCURIE": "biotools:treegl",
    "biotoolsID": "treegl",
    "credit": [
        {
            "email": "epxing@cs.cmu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software which builds on the l1 plus total variation penalized logistic regression to effectively estimate multiple gene networks corresponding to cell types related by a tree-genealogy, based on only a few samples from each cell type.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.sailing.cs.cmu.edu/main/?page_id=495"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "http://www.sailing.cs.cmu.edu/main/?page_id=495",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/treegl-reverse-engineering-tree-evoloving-gene-networks-underlying-developing-biological-lineages.html"
        }
    ],
    "name": "Treegl",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Estimating gene regulatory networks over biological lineages is central to a deeper understanding of how cells evolve during development and differentiation. However, one challenge in estimating such evolving networks is that their host cells not only contiguously evolve, but also branch over time. For example, a stem cell evolves into two more specialized daughter cells at each division, forming a tree of networks. Another example is in a laboratory setting: a biologist may apply several different drugs individually to malignant cancer cells to analyze the effects of each drug on the cells; the cells treated by one drug may not be intrinsically similar to those treated by another, but rather to the malignant cancer cells they were derived from. Results: We propose a novel algorithm, Treegl, an ℓ1 plus total variation penalized linear regression method, to effectively estimate multiple gene networks corresponding to cell types related by a tree-genealogy, based on only a few samples from each cell type. Treegl takes advantage of the similarity between related networks along the biological lineage, while at the same time exposing sharp differences between the networks. We demonstrate that our algorithm performs significantly better than existing methods via simulation. Furthermore we explore an application to a breast cancer dataset, and show that our algorithm is able to produce biologically valid results that provide insight into the progression and reversion of breast cancer cells. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Curtis R.E."
                    },
                    {
                        "name": "Parikh A.P."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Xing E.P."
                    }
                ],
                "citationCount": 16,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TREEGL: Reverse engineering tree-evolving gene networks underlying developing biological lineages"
            },
            "pmid": "21685070"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
