{
    "additionDate": "2019-11-14T18:30:31Z",
    "biotoolsCURIE": "biotools:PARSUC",
    "biotoolsID": "PARSUC",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "zhangdongying@whu.edu.cn",
            "name": "Dongying Zhang",
            "orcidid": "https://orcid.org/0000-0003-2488-7243",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | A Parallel Subsampling-Based Method for Clustering Remote Sensing Big Data | Remote sensing big data (RSBD) is generally characterized by huge volumes, diversity, and high dimensionality. Mining hidden information from RSBD for different applications imposes significant computational challenges. Clustering is an important data mining technique widely used in processing and analyzing remote sensing imagery. However, conventional clustering algorithms are designed for relatively small datasets. When applied to problems with RSBD, they are, in general, too slow or inefficient for practical use. In this paper, we proposed a parallel subsampling-based clustering (PARSUC) method for improving the performance of RSBD clustering in terms of both efficiency and accuracy",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31387335",
    "lastUpdate": "2019-11-14T18:30:31Z",
    "name": "PARSUC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19153438",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Remote sensing big data (RSBD) is generally characterized by huge volumes, diversity, and high dimensionality. Mining hidden information from RSBD for different applications imposes significant computational challenges. Clustering is an important data mining technique widely used in processing and analyzing remote sensing imagery. However, conventional clustering algorithms are designed for relatively small datasets. When applied to problems with RSBD, they are, in general, too slow or inefficient for practical use. In this paper, we proposed a parallel subsampling-based clustering (PARSUC) method for improving the performance of RSBD clustering in terms of both efficiency and accuracy. PARSUC leverages a novel subsampling-based data partitioning (SubDP) method to realize three-step parallel clustering, effectively solving the notable performance bottleneck of the existing parallel clustering algorithms; that is, they must cope with numerous repeated calculations to get a reasonable result. Furthermore, we propose a centroid filtering algorithm (CFA) to eliminate subsampling errors and to guarantee the accuracy of the clustering results. PARSUC was implemented on a Hadoop platform by using the MapReduce parallel model. Experiments conducted on massive remote sensing imageries with different sizes showed that PARSUC (1) provided much better accuracy than conventional remote sensing clustering algorithms in handling larger image data; (2) achieved notable scalability with increased computing nodes added; and (3) spent much less time than the existing parallel clustering algorithm in handling RSBD.",
                "authors": [
                    {
                        "name": "Xia H."
                    },
                    {
                        "name": "Huang W."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Zhou J."
                    },
                    {
                        "name": "Zhang D."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "PARSUC: A parallel subsampling-based method for clustering remote sensing big data"
            },
            "pmcid": "PMC6696378",
            "pmid": "31387335"
        }
    ]
}