{
    "additionDate": "2023-02-13T19:17:03.835834Z",
    "biotoolsCURIE": "biotools:cfa",
    "biotoolsID": "cfa",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Tzu-Hsien Yang"
        }
    ],
    "description": "An explainable deep learning model for annotating the transcriptional roles of cis-regulatory modules based on epigenetic codes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cobisLab/CFA/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:02:06.453655Z",
    "license": "Apache-2.0",
    "name": "CFA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.106375",
            "metadata": {
                "abstract": "Metazoa gene expression is controlled by modular DNA segments called cis-regulatory modules (CRMs). CRMs can convey promoter/enhancer/insulator roles, generating additional regulation layers in transcription. Experiments for understanding CRM roles are low-throughput and costly. Large-scale CRM function investigation still depends on computational methods. However, existing in silico tools only recognize enhancers or promoters exclusively, thus accumulating errors when considering CRM promoter/enhancer/insulator roles altogether. Currently, no algorithm can concurrently consider these CRM roles. In this research, we developed the CRM Function Annotator (CFA) model. CFA provides complete CRM transcriptional role labeling based on epigenetic profiling interpretation. We demonstrated that CFA achieves high performance (test macro auROC/auPRC = 94.1%/90.3%) and outperforms existing tools in promoter/enhancer/insulator identification. CFA is also inspected to recognize explainable epigenetic codes consistent with previous findings when labeling CRM roles. By considering the higher-order combinations of the epigenetic codes, CFA significantly reduces false-positive rates in CRM transcriptional role annotation. CFA is available at https://github.com/cobisLab/CFA/.",
                "authors": [
                    {
                        "name": "Wu S.-H."
                    },
                    {
                        "name": "Yang T.-H."
                    },
                    {
                        "name": "Yu Y.-H."
                    },
                    {
                        "name": "Zhang F.-Y."
                    }
                ],
                "citationCount": 4,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "CFA: An explainable deep learning model for annotating the transcriptional roles of cis-regulatory modules based on epigenetic codes"
            },
            "pmid": "36502693"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
