
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.Although messenger RNAs are key molecules for understanding life, until now, no method has existed to determine the full-length sequence of endogenous mRNAs including their poly(A) tails. Moreover, although non-A nucleotides can be incorporated in poly(A) tails, there also exists no method to accurately sequence them. Here, we present full-length poly(A) and mRNA sequencing (FLAM-seq), a rapid and simple method for high-quality sequencing of entire mRNAs. We report a complementary DNA library preparation method coupled to single-molecule sequencing to perform FLAM-seq. Using human cell lines, brain organoids and Caenorhabditis elegans we show that FLAM-seq delivers high-quality full-length mRNA sequences for thousands of different genes per sample. We find that 3′ untranslated region length is correlated with poly(A) tail length, that alternative polyadenylation sites and alternative promoters for the same gene are linked to different tail lengths, and that tails contain a substantial number of cytosines.",
            "authors": [
                "Legnini I.",
                "Alles J.",
                "Karaiskos N.",
                "Ayoub S.",
                "Rajewsky N."
            ],
            "cit_count": 0,
            "doi": "10.1038/S41592-019-0503-Y",
            "journal": "Nature Methods",
            "pmid": "31384046",
            "title": "FLAM-seq: full-length mRNA sequencing reveals principles of poly(A) tail length control",
            "year": "2019-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:FLAM-seq",
        "biotoolsID": "FLAM-seq",
        "description": "> HOMEPAGE MISSING! | full-length mRNA sequencing reveals principles of poly(A) tail length control | Although messenger RNAs are key molecules for understanding life, until now, no method has existed to determine the full-length sequence of endogenous mRNAs including their poly(A) tails. Moreover, although non-A nucleotides can be incorporated in poly(A) tails, there also exists no method to accurately sequence them. Here, we present full-length poly(A) and mRNA sequencing (FLAM-seq), a rapid and simple method for high-quality sequencing of entire mRNAs. We report a complementary DNA library preparation method coupled to single-molecule sequencing to perform FLAM-seq. Using human cell lines, brain organoids and Caenorhabditis elegans we show that FLAM-seq delivers high-quality full-length mRNA sequences for thousands of different genes per sample",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31384046",
        "name": "FLAM-seq"
    }
}