{
    "additionDate": "2021-01-18T08:59:59Z",
    "biotoolsCURIE": "biotools:ribotoolkit",
    "biotoolsID": "ribotoolkit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qi.liu2@childrens.harvard.edu",
            "name": "Qi Liu",
            "typeEntity": "Person"
        },
        {
            "email": "richard.gregory@enders.tch.harvard.edu",
            "name": "Richard I Gregory",
            "orcidid": "https://orcid.org/0000-0001-8090-8673",
            "typeEntity": "Person"
        }
    ],
    "description": "an integrated platform for analysis and annotation of ribosome profiling data to decode mRNA translation at codon resolution.\n\n\nRibosome profiling (Ribo-seq) has revolutionized the translatomics field by mapping the position of ribosome-protected fragments (RPFs), which is typically ranging from 26bp to 34bp, over the entire transcriptome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Codon usage analysis",
                    "uri": "http://edamontology.org/operation_0286"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "http://rnabioinfor.tch.harvard.edu/RiboToolkit",
    "lastUpdate": "2021-02-06T17:44:48Z",
    "name": "RiboToolkit",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA395",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Ribosome profiling (Ribo-seq) is a powerful technology for globally monitoring RNA translation; ranging from codon occupancy profiling, identification of actively translated open reading frames (ORFs), to the quantification of translational efficiency under various physiological or experimental conditions. However, analyzing and decoding translation information from Ribo-seq data is not trivial. Although there are many existing tools to analyze Ribo-seq data, most of these tools are designed for specific or limited functionalities and an easy-to-use integrated tool to analyze Ribo-seq data is lacking. Fortunately, the small size (26-34 nt) of ribosome protected fragments (RPFs) in Ribo-seq and the relatively small amount of sequencing data greatly facilitates the development of such a web platform, which is easy to manipulate for users with or without bioinformatic expertise. Thus, we developed RiboToolkit (http: //rnabioinfor.tch.harvard.edu/RiboToolkit), a convenient, freely available, web-based service to centralize Ribo-seq data analyses, including data cleaning and quality evaluation, expression analysis based on RPFs, codon occupancy, translation efficiency analysis, differential translation analysis, functional annotation, translation metagene analysis, and identification of actively translated ORFs. Besides, easy-touse web interfaces were developed to facilitate data analysis and intuitively visualize results. Thus, RiboToolkit will greatly facilitate the study of mRNA translation based on ribosome profiling.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Shvarts T."
                    },
                    {
                        "name": "Sliz P."
                    },
                    {
                        "name": "Gregory R.I."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RiboToolkit: An integrated platform for analysis and annotation of ribosome profiling data to decode mRNA translation at codon resolution"
            },
            "pmcid": "PMC7319539",
            "pmid": "32427338"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}