
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                },
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein modelling (loops)",
                    "uri": "http://edamontology.org/operation_0481"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            }
        ]
    },
    "publication": [
        {
            "abstract": "MODPROPEP is a web server for knowledge-based modeling of protein-peptide complexes, specifically peptides in complex with major histocompatibility complex (MHC) proteins and kinases. The available crystal structures of protein-peptide complexes in PDB are used as templates for modeling peptides of desired sequence in the substrate-binding pocket of MHCs or protein kinases. The substrate peptides are modeled using the same backbone conformation as in the template and the side-chain conformations are obtained by the program SCWRL. MODPROPEP provides a number of userfriendly interfaces for visualizing the structure of the modeled protein-peptide complexes and analyzing the contacts made by the modeled peptide ligand in the substrate-binding pocket of the MHC or protein kinase. Analysis of these specific inter-molecular contacts is crucial for understanding structural basis of the substrate specificity of these two protein families. This software also provides appropriate interfaces for identifying, putative MHC-binding peptides in the sequence of an antigen or phosphorylation sites on the substrate protein of a kinase, by scoring these inter-molecular contacts using residue-based statistical pair potentials. MODPROPEP would complement various available sequence-based programs (SYFPEITHI, SCANSITE, etc.) for predicting substrates of MHCs and protein kinases. The program is available at http://www.nii.res.in/modpropep.html. © 2007 The Author(s).",
            "authors": [
                "Kumar N.",
                "Mohanty D."
            ],
            "cit_count": 30,
            "journal": "Nucleic Acids Research",
            "pmid": "17478500",
            "title": "MODPROPEP: A program for knowledge-based modeling of protein-peptide complexes",
            "year": "2007-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:modpropep",
        "biotoolsID": "modpropep",
        "description": "Server for structural modeling of protein kinases and MHC proteins in complex with their substrate peptides.",
        "homepage": "http://www.nii.res.in/~narendra/PROT_PEP_INTERACTION/index.html",
        "name": "MODPROPEP"
    }
}