{
    "additionDate": "2021-11-29T11:29:24.293439Z",
    "biotoolsCURIE": "biotools:rseqnorm",
    "biotoolsID": "rseqnorm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "swang@smu.edu",
            "name": "Xinlei Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "Yang.Xie@UTSouthwestern.edu",
            "name": "Yang Xie",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RSEQNORM is a fast and accurate RNA-seq data normalization for formalin-fixed paraffin-embedded samples. RSEQNORM implements MIXnorm and SMIXnorm for RNA-seq data normalization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://lce.biohpc.swmed.edu/rseqnorm",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T11:29:24.295981Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/S-YIN/RSEQNORM"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/S-YIN/RSEQNORM/issues"
        }
    ],
    "name": "RSEQNORM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.650795",
            "metadata": {
                "abstract": "© Copyright © 2021 Yin, Zhan, Yao, Xiao, Wang and Xie.RNA-sequencing (RNA-seq) provides a comprehensive quantification of transcriptomic activities in biological samples. Formalin-Fixed Paraffin-Embedded (FFPE) samples are collected as part of routine clinical procedure, and are the most widely available biological sample format in medical research and patient care. Normalization is an essential step in RNA-seq data analysis. A number of normalization methods, though developed for RNA-seq data from fresh frozen (FF) samples, can be used with FFPE samples as well. The only extant normalization method specifically designed for FFPE RNA-seq data, MIXnorm, which has been shown to outperform the normalization methods, but at the cost of a complex mixture model and a high computational burden. It is therefore important to adapt MIXnorm for simplicity and computational efficiency while maintaining superior performance. Furthermore, it is critical to develop an integrated tool that performs commonly used normalization methods for both FF and FFPE RNA-seq data. We developed a new normalization method for FFPE RNA-seq data, named SMIXnorm, based on a simplified two-component mixture model compared to MIXnorm to facilitate computation. The expression levels of expressed genes are modeled by normal distributions without truncation, and those of non-expressed genes are modeled by zero-inflated Poisson distributions. The maximum likelihood estimates of the model parameters are obtained by a nested Expectation-Maximization algorithm with a less complicated latent variable structure, and closed-form updates are available within each iteration. Real data applications and simulation studies show that SMIXnorm greatly reduces computing time compared to MIXnorm, without sacrificing the performance. More importantly, we developed a web-based tool, RNA-seq Normalization (RSeqNorm), that offers a simple workflow to compute normalized RNA-seq data for both FFPE and FF samples. It includes SMIXnorm and MIXnorm for FFPE RNA-seq data, together with five commonly used normalization methods for FF RNA-seq data. Users can easily upload a raw RNA-seq count matrix and select one of the seven normalization methods to produce a downloadable normalized expression matrix for any downstream analysis. The R package is available at https://github.com/S-YIN/RSEQNORM. The web-based tool, RSeqNorm is available at http://lce.biohpc.swmed.edu/rseqnorm with no restriction to use or redistribute.",
                "authors": [
                    {
                        "name": "Yin S."
                    },
                    {
                        "name": "Zhan X."
                    },
                    {
                        "name": "Yao B."
                    },
                    {
                        "name": "Xiao G."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Xie Y."
                    }
                ],
                "date": "2021-03-24T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "SMIXnorm: Fast and Accurate RNA-Seq Data Normalization for Formalin-Fixed Paraffin-Embedded Samples"
            },
            "pmcid": "PMC8024626",
            "pmid": "33841507",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}