{
    "additionDate": "2021-01-18T07:59:21Z",
    "biotoolsCURIE": "biotools:visar",
    "biotoolsID": "visar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shaoli@mail.tsinghua.edu.cn",
            "name": "Shao Li",
            "typeEntity": "Person"
        }
    ],
    "description": "an interactive tool for dissecting chemical features learned by deep neural network QSAR models.\n\nHere we took a step forward to interpret the learned features from deep neural network QSAR models, and present VISAR, an interactive tool for visualizing structure-activity relationship and the chemical activity landscape based on the learned features, thus providing deeper insights of the neural network 'black-box'. For a learning task, VISAR firstly provided users with useful functions to build, train and test the deep neural network models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qid12/visar",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-13T14:37:11Z",
    "name": "VISAR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA187",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved.Although many quantitative structure?activity relationship (QSAR) models are trained and evaluated for their predictive merits, understanding what models have been learning is of critical importance. However, the interpretation and visualization of QSAR model results remain challenging, especially for ?black box? models such as deep neural network (DNN). Here, we take a step forward to interpret the learned chemical features from DNN QSAR models, and present VISAR, an interactive tool for visualizing the structure?activity relationship. VISAR first provides functions to construct and train DNN models. Then VISAR builds the activity landscapes based on a series of compounds using the trained model, showing the correlation between the chemical feature space and the experimental activity space after model training, and allowing for knowledge mining from a global perspective. VISAR also maps the gradients of the chemical features to the corresponding compounds as contribution weights for each atom, and visualizes the positive and negative contributor substructures suggested by the models from a local perspective. Using the web application of VISAR, users could interactively explore the activity landscape and the color-coded atom contributions. We propose that VISAR could serve as a helpful tool for training and interactive analysis of the DNN QSAR model, providing insights for drug design, and an additional level of model validation.",
                "authors": [
                    {
                        "name": "Ding Q."
                    },
                    {
                        "name": "Hou S."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zu S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VISAR: An interactive tool for dissecting chemical features learned by deep neural network QSAR models"
            },
            "pmid": "32170933"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
