{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://genetics.cs.ucla.edu/crypto/index.html#contact"}],"documentation":[{"type":"GENERAL","url":"http://genetics.cs.ucla.edu/crypto/manual.html"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"maturity":"Emerging","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Molecular genetics","uri":"http://edamontology.org/topic_3321"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/genocrypt-beta-identify-relatives-from-genotype-data.html"}],"publication":[{"abstract":"Motivation: High-throughput sequencing technologies have impacted many areas of genetic research. One such area is the identification of relatives from genetic data. The standard approach for the identification of genetic relatives collects the genomic data of all individuals and stores it in a database. Then, each pair of individuals is compared to detect the set of genetic relatives, and the matched individuals are informed. The main drawback of this approach is the requirement of sharing your genetic data with a trusted third party to perform the relatedness test. Results: In this work, we propose a secure protocol to detect the genetic relatives from sequencing data while not exposing any information about their genomes. We assume that individuals have access to their genome sequences but do not want to share their genomes with anyone else. Unlike previous approaches, our approach uses both common and rare variants which provide the ability to detect much more distant relationships securely. We use a simulated data generated from the 1000 genomes data and illustrate that we can easily detect up to fifth degree cousins which was not possible using the existing methods. We also show in the 1000 genomes data with cryptic relationships that our method can detect these individuals. © 2014 The Author. Published by Oxford University Press. All rights reserved.","authors":["Hormozdiari F.","Joo J.W.J.","Wadia A.","Guan F.","Ostrosky R.","Sahai A.","Eskin E."],"cit_count":6,"journal":"Bioinformatics","pmid":"24931985","title":"Privacy preserving protocol for detecting genetic relatives using rare variants","year":"2014-06-15"}],"summary":{"biotoolsCURIE":"biotools:genocrypt","biotoolsID":"genocrypt","description":"Method for identifying genetic relatives without compromising privacy by taking advantage of novel cryptographic techniques customized for secure and private comparison of genetic information.","homepage":"http://genetics.cs.ucla.edu/crypto/","name":"GenoCrypt beta"}}