
{
    "credit": [
        {
            "name": "Eric Alm",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://almlab.mit.edu/index.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://almlab.mit.edu/adaptml.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/adaptml-1-0-partitioning-gene-sequences-genetic-ecological-similarity.html"
        }
    ],
    "publication": [
        {
            "abstract": "Identifying ecologically differentiated populations within complex microbial communities remains challenging, yet is critical for interpreting the evolution and ecology of microbes in the wild. Here we describe spatial and temporal resource partitioning among Vibrionaceae strains coexisting in coastal bacterioplankton. A quantitative model (AdaptML) establishes the evolutionary history of ecological differentiation, thus revealing populations specific for seasons and life-styles (combinations of free-living, particle, or zooplankton associations). These ecological population boundaries frequently occur at deep phylogenetic levels (consistent with named species); however, recent and perhaps ongoing adaptive radiation is evident in Vibrio splendidus, which comprises numerous ecologically distinct populations at different levels of phylogenetic differentiation. Thus, environmental specialization may be an important correlate or even trigger of speciation among sympatric microbes.",
            "authors": [
                "Hunt D.E.",
                "David L.A.",
                "Gevers D.",
                "Preheim S.P.",
                "Alm E.J.",
                "Polz M.F."
            ],
            "cit_count": 290,
            "journal": "Science",
            "pmid": "18497299",
            "title": "Resource partitioning and sympatric differentiation among closely related bacterioplankton",
            "year": "2008-05-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:adaptml",
        "biotoolsID": "adaptml",
        "description": "Software package that will automatically partition groups of gene sequences according to both their genetic and ecological similarity.",
        "homepage": "http://almlab.mit.edu/adaptml.html",
        "name": "AdaptML"
    }
}