{
    "additionDate": "2015-11-09T10:32:46Z",
    "biotoolsCURIE": "biotools:repeat_explorer",
    "biotoolsID": "repeat_explorer",
    "collectionID": [
        "Czech Republic",
        "ELIXIR-CZ"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jiri Macas",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Pavel Neumann",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Petr Novak",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Biology Centre, CAS, Czech Republic",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Consortium"
        },
        {
            "name": "Czech Academy of Sciences",
            "typeEntity": "Funding agency",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "petr@umbr.cas.cz",
            "name": "Petr Novak",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "petr@umbr.cas.cz",
            "name": "Petr Novak",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RepeatExplorer is a computational pipeline designed to identify and characterize repetitive DNA elements in next-generation sequencing data from plant and animal genomes. It employs graph-based clustering of sequence reads to identify repetitive elements and several additional programs that aid in their annotation and quantification.",
    "documentation": [
        {
            "type": [
                "Terms of use",
                "Citation instructions",
                "General",
                "User manual"
            ],
            "url": "http://repeatexplorer.org"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://bitbucket.org/petrnovak/repex_tarean"
        },
        {
            "type": "Binaries",
            "url": "https://bitbucket.org/petrnovak/repex_tarean"
        },
        {
            "note": "Galaxy toolshed package",
            "type": "Software package",
            "url": "https://toolshed.g2.bx.psu.edu/view/petr-novak/repeatexplorer2"
        }
    ],
    "editPermission": {
        "authors": [
            "kavonrtep"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Computational pipeline for discovery and characterization of repetitive sequences in eukaryotic genomes. The pipeline uses high-throughput genome sequencing data as an input and performs graph-based clustering analysis of sequence read similarities to identify repetitive elements within analyzed samples User-provided shotgun  sequencing data Characterization of repetitive sequences",
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence search results",
                        "uri": "http://edamontology.org/data_0857"
                    },
                    "format": [
                        {
                            "term": "FASTA-HTML",
                            "uri": "http://edamontology.org/format_2310"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://repeatexplorer.org",
    "language": [
        "R",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2020-02-17T11:33:54Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/petrnovak/repex_tarean"
        },
        {
            "type": [
                "Galaxy service"
            ],
            "url": "https://repeatexplorer-elixir.cerit-sc.cz/"
        }
    ],
    "maturity": "Mature",
    "name": "RepeatExplorer",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-CZ",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-378",
            "metadata": {
                "abstract": "Background: The investigation of plant genome structure and evolution requires comprehensive characterization of repetitive sequences that make up the majority of higher plant nuclear DNA. Since genome-wide characterization of repetitive elements is complicated by their high abundance and diversity, novel approaches based on massively-parallel sequencing are being adapted to facilitate the analysis. It has recently been demonstrated that the low-pass genome sequencing provided by a single 454 sequencing reaction is sufficient to capture information about all major repeat families, thus providing the opportunity for efficient repeat investigation in a wide range of species. However, the development of appropriate data mining tools is required in order to fully utilize this sequencing data for repeat characterization.Results: We adapted a graph-based approach for similarity-based partitioning of whole genome 454 sequence reads in order to build clusters made of the reads derived from individual repeat families. The information about cluster sizes was utilized for assessing the proportion and composition of repeats in the genomes of two model species, Pisum sativum and Glycine max, differing in genome size and 454 sequencing coverage. Moreover, statistical analysis and visual inspection of the topology of the cluster graphs using a newly developed program tool, SeqGrapheR, were shown to be helpful in distinguishing basic types of repeats and investigating sequence variability within repeat families.Conclusions: Repetitive regions of plant genomes can be efficiently characterized by the presented graph-based analysis and the graph representation of repeats can be further used to assess the variability and evolutionary divergence of repeat families, discover and characterize novel elements, and aid in subsequent assembly of their consensus sequences. © 2010 Novák et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Novak P."
                    },
                    {
                        "name": "Neumann P."
                    },
                    {
                        "name": "Macas J."
                    }
                ],
                "citationCount": 244,
                "date": "2010-07-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Graph-based clustering and characterization of repetitive sequences in next-generation sequencing data"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btt054",
            "metadata": {
                "abstract": "Motivation: Repetitive DNA makes up large portions of plant and animal nuclear genomes, yet it remains the least-characterized genome component in most species studied so far. Although the recent availability of high-throughput sequencing data provides necessary resources for in-depth investigation of genomic repeats, its utility is hampered by the lack of specialized bioinformatics tools and appropriate computational resources that would enable large-scale repeat analysis to be run by biologically oriented researchers.Results: Here we present RepeatExplorer, a collection of software tools for characterization of repetitive elements, which is accessible via web interface. A key component of the server is the computational pipeline using a graph-based sequence clustering algorithm to facilitate de novo repeat identification without the need for reference databases of known elements. Because the algorithm uses short sequences randomly sampled from the genome as input, it is ideal for analyzing next-generation sequence reads. Additional tools are provided to aid in classification of identified repeats, investigate phylogenetic relationships of retroelements and perform comparative analysis of repeat composition between multiple species. The server allows to analyze several million sequence reads, which typically results in identification of most high and medium copy repeats in higher plant genomes.Implementation and availability: RepeatExplorer was implemented within the Galaxy environment and set up on a public server at http://repeatexplorer.umbr.cas.cz/. Source code and instructions for local installation are available at http://w3lamc.umbr.cas.cz/ lamc/resources.php.Contact: © 2013 The Author 2013. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. © The Author 2013.",
                "authors": [
                    {
                        "name": "Novak P."
                    },
                    {
                        "name": "Neumann P."
                    },
                    {
                        "name": "Pech J."
                    },
                    {
                        "name": "Steinhaisl J."
                    },
                    {
                        "name": "MacAs J."
                    }
                ],
                "citationCount": 293,
                "date": "2013-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RepeatExplorer: A Galaxy-based web server for genome-wide characterization of eukaryotic repetitive elements from next-generation sequence reads"
            }
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1,
    "version": [
        "2.3.7 (Galaxy server)",
        "0.3.7 (command line)"
    ]
}