{
    "accessibility": "Open access",
    "additionDate": "2022-03-22T14:25:52.526782Z",
    "biotoolsCURIE": "biotools:mrmodeltest2",
    "biotoolsID": "mrmodeltest2",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "johan.nylander@ebc.uu.se",
            "name": "Johan A. A. Nylander"
        },
        {
            "name": "Fredrik Ronquist"
        },
        {
            "name": "John P. Huelsenbeck"
        },
        {
            "name": "Joséluis Nieves-Aldrey"
        }
    ],
    "description": "C program for selecting DNA substitution models using PAUP*",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/nylander/MrModeltest2/releases/tag/v.2.4"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA substitution modelling",
                    "uri": "http://edamontology.org/operation_0550"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nylander/MrModeltest2",
    "language": [
        "C"
    ],
    "lastUpdate": "2022-03-22T14:25:52.529429Z",
    "license": "Not licensed",
    "name": "mrmodeltest2",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1080/10635150490264699",
            "metadata": {
                "abstract": "The recent development of Bayesian phylogenetic inference using Markov chain Monte Carlo (MCMC) techniques has facilitated the exploration of parameter-rich evolutionary models. At the same time, stochastic models have become more realistic (and complex) and have been extended to new types of data, such as morphology. Based on this foundation, we developed a Bayesian MCMC approach to the analysis of combined data sets and explored its utility in inferring relationships among gall wasps based on data from morphology and four genes (nuclear and mitochondrial, ribosomal and protein coding). Examined models range in complexity from those recognizing only a morphological and a molecular partition to those having complex substitution models with independent parameters for each gene. Bayesian MCMC analysis deals efficiently with complex models: convergence occurs faster and more predictably for complex models, mixing is adequate for all parameters even under very complex models, and the parameter update cycle is virtually unaffected by model partitioning across sites. Morphology contributed only 5% of the characters in the data set but nevertheless influenced the combined-data tree, supporting the utility of morphological data in multigene analyses. We used Bayesian criteria (Bayes factors) to show that process heterogeneity across data partitions is a significant model component, although not as important as among-site rate variation. More complex evolutionary models are associated with more topological uncertainty and less conflict between morphology and molecules. Bayes factors sometimes favor simpler models over considerably more parameter-rich models, but the best model overall is also the most complex and Bayes factors do not support exclusion of apparently weak parameters from this model. Thus, Bayes factors appear to be useful for selecting among complex models, but it is still unclear whether their use strikes a reasonable balance between model complexity and error in parameter estimates.",
                "authors": [
                    {
                        "name": "Huelsenbeck J.P."
                    },
                    {
                        "name": "Nieves-Aldrey J.L."
                    },
                    {
                        "name": "Nylander J.A.A."
                    },
                    {
                        "name": "Ronquist F."
                    }
                ],
                "citationCount": 1450,
                "date": "2004-02-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "Bayesian phylogenetic analysis of combined data"
            },
            "pmid": "14965900"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}
