{
    "additionDate": "2022-10-11T06:13:49.541613Z",
    "biotoolsCURIE": "biotools:rnacon",
    "biotoolsID": "rnacon",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/rnacon/"
        }
    ],
    "description": "RNAcon is a web-server for the prediction and classification of non-coding RNAs. It uses SVM-based model for the discrimination between coding and ncRNAs and Random Forest-based prediction model for the classification of ncRNAs into different classes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/rnacon/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/rnacon/",
    "lastUpdate": "2022-10-11T06:13:56.730136Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/rnacon/"
        }
    ],
    "name": "rnacon",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-127",
            "metadata": {
                "abstract": "Background: Evidence is accumulating that non-coding transcripts, previously thought to be functionally inert, play important roles in various cellular activities. High throughput techniques like next generation sequencing have resulted in the generation of vast amounts of sequence data. It is therefore desirable, not only to discriminate coding and non-coding transcripts, but also to assign the noncoding RNA (ncRNA) transcripts into respective classes (families). Although there are several algorithms available for this task, their classification performance remains a major concern. Acknowledging the crucial role that non-coding transcripts play in cellular processes, it is required to develop algorithms that are able to precisely classify ncRNA transcripts.Results: In this study, we initially develop prediction tools to discriminate coding or non-coding transcripts and thereafter classify ncRNAs into respective classes. In comparison to the existing methods that employed multiple features, our SVM-based method by using a single feature (tri-nucleotide composition), achieved MCC of 0.98. Knowing that the structure of a ncRNA transcript could provide insights into its biological function, we use graph properties of predicted ncRNA structures to classify the transcripts into 18 different non-coding RNA classes. We developed classification models using a variety of algorithms (BayeNet, NaiveBayes, MultilayerPerceptron, IBk, libSVM, SMO and RandomForest) and observed that model based on RandomForest performed better than other models. As compared to the GraPPLE study, the sensitivity (of 13 classes) and specificity (of 14 classes) was higher. Moreover, the overall sensitivity of 0.43 outperforms the sensitivity of GraPPLE (0.33) whereas the overall MCC measure of 0.40 (in contrast to MCC of 0.29 of GraPPLE) was significantly higher for our method. This clearly demonstrates that our models are more accurate than existing models.Conclusions: This work conclusively demonstrates that a simple feature, tri-nucleotide composition, is sufficient to discriminate between coding and non-coding RNA sequences. Similarly, graph properties based feature set along with RandomForest algorithm are most suitable to classify different ncRNA classes. We have also developed an online and standalone tool-- RNAcon (http://crdd.osdd.net/raghava/rnacon). © 2014 Panwar et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Arora A."
                    },
                    {
                        "name": "Panwar B."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 66,
                "date": "2014-02-13T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Prediction and classification of ncRNAs using structural information"
            },
            "pmcid": "PMC3925371",
            "pmid": "24521294"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
