{
    "additionDate": "2020-01-14T08:55:00Z",
    "biotoolsCURIE": "biotools:BlobServlet",
    "biotoolsID": "BlobServlet",
    "confidence_flag": "high",
    "description": "occupational exposure limits are insufficiently protecting individual worker health.\n\nIn an editorial in an earlier issue of this journal, Johanson & Tinnerberg (1) expressed serious and well-founded concern over the large number of future occupational cancer cases that will result if exposures for a number of substances are not reduced below the so-called \"binding occupational exposure limit values\" (BOELV) issued by the EU (2). The balance between what is perceived as possible to comply with and the foreseeable health gain when setting BOELV is further discussed in a letter to the Editor by Cherrie (3). This debate raises several important aspects of how to protect workers from cancer as well as other potentially lethal diseases. Herewith, we discuss some of these aspects. One problem in setting OEL is that levels that are considered safe may not be seen as feasible when accounting for technological and societal aspects",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://ec.europa.eu/social/BlobServlet?docId=10161&langId=en",
    "lastUpdate": "2020-01-14T08:55:00Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://ec.europa.eu/social/BlobServlet?docId=3879&langId=en"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://ec.europa.eu/social/BlobServlet?docId=3803&langId=en"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://ec.europa.eu/social/BlobServlet?docId=3879"
        }
    ],
    "name": "BlobServlet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.5271/SJWEH.3864",
            "metadata": {
                "abstract": "In an editorial in an earlier issue of this journal, Johanson & Tinnerberg (1) expressed serious and well-founded concern over the large number of future occupational cancer cases that will result if exposures for a number of substances are not reduced below the so-called \"binding occupational exposure limit values\" (BOELV) issued by the EU (2). The balance between what is perceived as possible to comply with and the foreseeable health gain when setting BOELV is further discussed in a letter to the Editor by Cherrie (3). This debate raises several important aspects of how to protect workers from cancer as well as other potentially lethal diseases. Herewith, we discuss some of these aspects. One problem in setting OEL is that levels that are considered safe may not be seen as feasible when accounting for technological and societal aspects. The EU has recognized this problem by distinguishing between so-called \"indicative\" (health-based) and legally binding OEL (4). However, a BOELV that does not protect from a high risk for severe health effects is not adequate. Both Johanson & Tinnerberg and Cherrie point to respirable crystalline silica (RCS) as an example: While the EU's Scientific Committee on Occupational Exposure Limits (SCOEL) recommended an OEL <0.05 (5) in order to protect workers reasonably well against negative health effects, the EU decided on a BOELV of 0.1 mg/m 3for RCS (2). The US Occupational Health and Safety administration (OSHA) has come to a different conclusion and decided on an OEL of 0.05 mg/m 3(6). The EU has presented an extensive risk assessment for RCS developed within the SHEcan project (7). We argue that a BOELV at 0.1 is insufficient and partly may be due to misinterpretations of the SHEcan report. The report estimates the future number of lung cancer cases attributable to occupational exposure to RCS in the EU up to 2069. Four scenarios are discussed: (i) a baseline scenario, essentially predicting future numbers of cases without further regulatory action, (ii) a BOELV of 0.2 mg/m3 with 99% compliance, (iii) a BOELV of 0.1 mg/m 3with 99% compliance, and (iv) a BOELV of 0.05 mg/m 3with 99% compliance. The estimations are based on an assumption of a latency period of 10-50 years from reduction of exposure until cancer risk drops. This assumption, in itself reasonable from present evidence, has the consequence that there is virtually no difference in projected annual future cases between the four scenarios for ≥40 years. The reduction in exposure in scenarios ii-iv comes into effect first only in the year 2050 (see figure 4.1 on p49 in ec.europa.eu/social/BlobServlet?docId=10161&langId=en). An assumption of 99% compliance with the BOELV in scenarios ii-iv has a dramatically stronger effect on the projected number of cases than the OEL itself: Even if the OEL was doubled to 0.2 mg/m 3the number of attributable cancer registrations in 2060 would be reduced by 70% just from the assumption of almost full compliance. The additional number of attributable cancer registrations that are prevented when an OEL of 0.1 (scenario iii) is compared to an OEL of 0.05 (scenario iv) under an assumption of almost full compliance is comparatively small (7, p123). The reason for this strong effect of a 99% compliance is that exposure often will exceed the OEL. The report may lead to the misconception that an OEL of 0.05 mg/m 3has little benefit over an OEL of 0.1 mg/m 3, especially if the cases saved are expressed as lives saved per year over the entire 60-year period. For Sweden and other countries where OEL already have legal status, the introduction of BOELV would have no legal implications. The SHEcan report shows that occupational exposure to silica will cause in all 440 000 cancer cases between 2010 and 2069 in the EU if nothing further is done (scenario i). This number must be reduced even if it will take time until preventive measures have full effect. An analogy with asbestos is obvious: it is well known that reductions in the mesothelioma rate were seen first only many decades after asbestos was banned - yet no one would argue that it was not worth reducing asbestos exposure for this reason. The report assumes an annual 7% decrease in silica exposure levels until the period 2020-2029 even if no further regulatory action is taken. This is a very questionable assumption that went unconfirmed in a recent French report (8) that gave no evidence for reduced exposure to RCS in the French construction sector during the last decade. This indicates that even the very high number of 440 000 attributable cancer registrations is underestimated by the report, to which, in addition, should be added the number of chronic obstructive pulmonary disease and kidney disease cases, for which a much shorter latency period until risk drops is likely. The concepts \"maximum tolerable risk\" and \"acceptable risk\" have been developed for exposure to genotoxic carcinogens, for which no exposure level could be considered safe. A life-time extra number of four cases per 1000 exposed workers over a 40-year working life has been suggested as a maximum tolerable risk, and four cases per 100 000 exposed workers as an acceptable risk, both in Germany and in the Netherlands (9, 10). These figures can be transformed to the individual life-time risk of contracting cancer from the exposure as 4/1000, corresponding to 0.4% individual risk. While these limits are not absolute and can be discussed, it is of interest to apply them to the case of RCS. The risk associated with an OEL of 0.1 mg/m 3for RCS is associated with risks far higher than \"maximum tolerable\", ie, 0,4%. The US OSHA estimated that exposing 1000 workers for 45 years at 0.1 mg/m3 would result in 33 extra lung cancer deaths as life-time risk, corresponding to an individual risk of 3.3% (6), exceeding the maximum tolerable risk nearly 10-fold. Since the EU Directive concerns cancer, the report did not consider other health effects, which is necessary for a general risk assessment. The US OSHA estimated there would be another 85 deaths from non-malignant lung disease (8.5%) and, roughly estimated, 39 deaths from renal disease (3.9%) that should be added to this toll. This adds up to an individual excess death risk of 15%, which by far clearly exceeds what is generally seen as the maximum tolerable risk of 0.4%! Still, this is a conservative estimate, which includes neither excess deaths from myocardial infarction that occur from 0.025 mg/m 3and up (11) nor excess autoimmune disease, eg, rheumatoid arthritis and other autoimmune diseases (12, 13). In support of Johanson & Tinnerberg (1), we argue that the lifetime excess death risk for silica-exposed workers is totally incompatible with fundamental workers' rights of health and safety. This aspect, which must be safeguarded by the OSH society, will be even more important when working life is prolonged and when exposure conditions may be more diverse, ie, workers with high exposure and excessive risk may be too few to impact the disease burden in society but in that group the burden may still be extreme. In our view, the assumption of 99% compliance is unrealistic and it is necessary to lower the OEL. In addition, leaving the BOELV at 0.1 mg/m3 means this will continue for the future, a silent epidemic that is deeply unethical to ignore. References 1. Johanson G, Tinnerberg H. Binding occupational exposure limits for carcinogens in the EU - good or bad? Scand J Work Environ Health 2019 May;45(3):213-4. https://doi.org/10.5271/sjweh.3825. 2. Directive EU. (EU) 2019/130 of the European parliament and of the council of 16 January 2019. Available from: https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32019L0130. 3. Cherrie JW. Binding occupational exposure limits for carcinogens in the EU - necessary but not sufficient to reduce risk. Scand J Work Environ Health 2019 Jul;45(4):423-4. https://doi.org/10.5271/sjweh.3836. 4. SCOEL. SCOEL's involvement in setting Occupational Exposure Limits: Webpage accessed 2019-10-23. Available from: http://ec.europa.eu/social/BlobServlet?docId=3879&langId=en. 5. SCOEL. Recommendation from the Scientific Committee on Occupational Exposure Limits for Silica, Crystalline (respirable dust). SCOEL/SUM/94. November 2003. Available from: http://ec.europa.eu/social/BlobServlet?docId=3803&langId=en. 6. OSHA. Occupational Exposure to Respriable Crystalline Silica. Federal Register/vol 81, no 58/Friday, March 25, 2016/ Rules and Regulations. Occupational Safety and Health, Department of Labour, Administration (Docket No. OSHA-2010-0034) RIN 1218/AB70. OSHA 2016. Available from: https://www.govinfo.gov/content/pkg/FR-2016-03-25/pdf/2016-04800.pdf. 7. Cherrie JW, Gorman Ng M, Searl A, Shafrir A, van Tongeren M et al. Health, socio-economic and environmental aspects of possible amendments to the EU Directive on the protection of workers from the risks related to exposure to carcinogens and mutagens at work. Respirable crystalline silica. IOM Research Project: P937/8, May 2011. Available from: https://ec.europa.eu/social/BlobServlet?docId=10161&langId=en). 8. ANSES. Agence nationale de sécurité sanitaire alimentation, environnement, et du travail (ANSES). Dangers, expositions et risques relatifs à la silice cristalline. Avis de l'Anses Raports d'expertise collective (Saisine no 2015-SA-0236). Avril 2019. Èdition scientifique. ANSES English summary: Available from: https://www.anses.fr/en/content/exposure-crystalline-silica-poses-high-risks-worker-health 9. Federal Institute for Occupational safety and Health. The risk-based concept for carcinogenic substances developed by the Committee for Hazardous Substances. Federal Institute for Occupational safety and Health (BAuA), Dortmund, Germany, 2013. Available from: www.baua.de/dok/3581564 10. Health Council of the Netherlands. Guidelines for the calculation of occupational cancer risk values. Health Council of the Netherlands, 2012. Available from: www.healthcouncil.nl/documents/advisory-reports/2012/10/26/guideline-for-the-calculation-of-occupational-cancer-risk-values. 11. Liu Y, Zhou Y, Hnizdo E, Shi T, Steenland K, He X et al. Total and Cause-Specific Mortality Risk Associated With Low-Level Exposure to Crystalline Silica: A 44-Year Cohort Study From China. Am J Epidemiol 2017 Aug;186(4):481-90. https://doi.org/10.1093/aje/kwx124. 12. Stolt P, Källberg H, Lundberg I, Sjögren B, Klareskog L, Alfredsson L; EIRA study group. Silica exposure is associated with increased risk of developing rheumatoid arthritis: results from the Swedish EIRA study. Ann Rheum Dis 2005 Apr;64(4):582-6. https://doi.org/10.1136/ard.2004.022053. 13. Parks CG, Conrad K, Cooper GS. Occupational exposure to crystalline silica and autoimmune disease. Environ Health Perspect 1999 Oct;107 Suppl 5:793-802.",
                "authors": [
                    {
                        "name": "Alblin M."
                    },
                    {
                        "name": "Gustavsson P."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Scandinavian journal of work, environment & health",
                "title": "A silent epidemic: occupational exposure limits are insufficiently protecting individual worker health"
            },
            "pmid": "31720691"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}