{
    "additionDate": "2019-02-03T21:42:55Z",
    "biotoolsCURIE": "biotools:bcseq_bias",
    "biotoolsID": "bcseq_bias",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liangche@usc.edu",
            "name": "Liang Chen"
        }
    ],
    "description": "Tool for quantifying gene expression from single cell RNA-seq.",
    "download": [
        {
            "type": "Software package",
            "url": "http://www-rcf.usc.edu/~liangche/software.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://www-rcf.usc.edu/~liangche/software.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-02-03T21:43:18Z",
    "maturity": "Emerging",
    "name": "BCseq (bias-corrected sequencing analysis)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gky308",
            "metadata": {
                "abstract": "With rapid technical advances, single cell RNA-seq (scRNA-seq) has been used to detect cell subtypes exhibiting distinct gene expression profiles and to trace cell transitions in development and disease. However, the potential of scRNA-seq for new discoveries is constrained by the robustness of subsequent data analysis. Here we propose a robust model, BCseq (bias-corrected sequencing analysis), to accurately quantify gene expression from scRNA-seq. BCseq corrects inherent bias of scRNA-seq in a data-adaptive manner and effectively removes technical noise. BCseq rescues dropouts through weighted consideration of similar cells. Cells with higher sequencing depths contribute more to the quantification nonlinearly. Furthermore, BCseq assigns a quality score for the expression of each gene in each cell, providing users an objective measure to select genes for downstream analysis. In comparison to existing scRNA-seq methods, BCseq demonstrates increased robustness in detection of differentially expressed (DE) genes and cell subtype classification.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Zheng S."
                    }
                ],
                "citationCount": 9,
                "date": "2018-08-21T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "BCseq: accurate single cell RNA-seq quantification with bias correction"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}