
{
    "credit": [
        {
            "email": "chantal.rabourdin@inserm.fr",
            "name": "C. Rabourdin-Combe",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "chantal.rabourdin@inserm.fr",
            "name": "P. O. Vidalain",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Virology",
                "uri": "http://edamontology.org/topic_0781"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Large collections of protein-encoding open reading frames (ORFs) established in a versatile recombination-based cloning system have been instrumental to study protein functions in high-throughput assays. Such 'ORFeome' resources have been developed for several organisms but in virology, plasmid collections covering a significant fraction of the virosphere are still needed. In this perspective, we present ViralORFeome 1.0 (http://www.viralorfeome.com), an open-access database and management system that provides an integrated set of bioinformatic tools to clone viral ORFs in the Gateway® system. ViralORFeome provides a convenient interface to navigate through virus genome sequences, to design ORF-specific cloning primers, to validate the sequence of generated constructs and to browse established collections of virus ORFs. Most importantly, ViralORFeome has been designed to manage all possible variants or mutants of a given ORF so that the cloning procedure can be applied to any emerging virus strain. A subset of plasmid constructs generated with ViralORFeome platform has been tested with success for heterologous protein expression in different expression systems at proteome scale. ViralORFeome should provide our community with a framework to establish a large collection of virus ORF clones, an instrumental resource to determine functions, activities and binding partners of viral proteins. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Pellet J.",
                "Tafforeau L.",
                "Lucas-Hourani M.",
                "Navratil V.",
                "Meyniel L.",
                "Achaz G.",
                "Guironnet-Paquet A.",
                "Aublin-Gex A.",
                "Caignard G.",
                "Cassonnet P.",
                "Chaboud A.",
                "Chantier T.",
                "Deloire A.",
                "Demeret C.",
                "Le Breton M.",
                "Neveu G.",
                "Jacotot L.",
                "Vaglio P.",
                "Delmotte S.",
                "Gautier C.",
                "Combet C.",
                "Deleage G.",
                "Favre M.",
                "Tangy F.",
                "Jacob Y.",
                "Andre. P.",
                "Lotteau V.",
                "Rabourdin-Combe C.",
                "Vidalain P.O."
            ],
            "cit_count": 29,
            "journal": "Nucleic Acids Research",
            "pmid": "20007148",
            "title": "ViralORFeome: An integrated database to generate a versatile collection of viral ORFs",
            "year": "2009-12-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:viralorfeome",
        "biotoolsID": "viralorfeome",
        "description": "Database and management system that provides an integrated set of bioinformatic tools to clone viral ORFs in the Gateway(R) system. It provides an interface to navigate through virus genome sequences, to design ORF-specific cloning primers, to validate the sequence of generated constructs and to browse established collections of virus ORFs. It has been designed to manage all possible variants or mutants of a given ORF so that the cloning procedure can be applied to any emerging virus strain.",
        "homepage": "https://doi.org/10.1093/nar/gkp1000",
        "name": "ViralORFeome"
    }
}