{
    "accessibility": "Open access",
    "additionDate": "2021-11-23T13:36:34.450443Z",
    "biotoolsCURIE": "biotools:compi",
    "biotoolsID": "compi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dgpena@uvigo.es",
            "name": "Daniel Glez-Peña",
            "typeEntity": "Person"
        }
    ],
    "description": "Compi is an application development framework for portable computational pipelines.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.sing-group.org/compi",
    "language": [
        "Java",
        "Shell"
    ],
    "lastUpdate": "2021-11-23T13:36:34.453260Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.sing-group.org/compihub"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sing-group/compi"
        }
    ],
    "name": "Compi",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7717/PEERJ-CS.593",
            "metadata": {
                "abstract": "© Copyright 2021 López-Fernández et al. Distributed under Creative Commons CC-BY 4.0Compi is an application framework to develop end-user, pipeline-based applications with a primary emphasis on: (i) user interface generation, by automatically generating a command-line interface based on the pipeline specific parameter definitions; (ii) application packaging, with compi-dk, which is a version-control-friendly tool to package the pipeline application and its dependencies into a Docker image; and (iii) application distribution provided through a public repository of Compi pipelines, named Compi Hub, which allows users to discover, browse and reuse them easily. By addressing these three aspects, Compi goes beyond traditional workflow engines, having been specially designed for researchers who want to take advantage of common workflow engine features (such as automatic job scheduling or logging, among others) while keeping the simplicity and readability of shell scripts without the need to learn a new programming language. Here we discuss the design of various pipelines developed with Compi to describe its main functionalities, as well as to highlight the similarities and differences with similar tools that are available. An open-source distribution under the Apache 2.0 License is available from GitHub (available at https://github.com/sing-group/compi). Documentation and installers are available from Available at https://www.sing-group.org/compi. A specific repository for Compi pipelines is available from Compi Hub (available at https://www.sing-group.org/compihub.",
                "authors": [
                    {
                        "name": "Glez-Pena D."
                    },
                    {
                        "name": "Grana-Castro O."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Nogueira-Rodriguez A."
                    },
                    {
                        "name": "Reboiro-Jato M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "PeerJ Computer Science",
                "title": "Compi: A framework for portable and reproducible pipelines"
            },
            "pmcid": "PMC8237318",
            "pmid": "34239974"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
