{
    "additionDate": "2024-04-08T10:36:15.325050Z",
    "biotoolsCURIE": "biotools:infrared",
    "biotoolsID": "infrared",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sebastian.will@polytechnique.edu",
            "name": "Sebastian Will"
        }
    ],
    "description": "Declarative tree decomposition-powered framework for bioinformatics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Protein threading",
                    "uri": "http://edamontology.org/operation_0302"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://www.lix.polytechnique.fr/~will/Software/Infrared",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-08T10:36:15.327755Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/s-will/Infrared"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.inria.fr/amibio/Infrared"
        }
    ],
    "name": "Infrared",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13015-024-00258-2",
            "metadata": {
                "abstract": "Motivation: Many bioinformatics problems can be approached as optimization or controlled sampling tasks, and solved exactly and efficiently using Dynamic Programming (DP). However, such exact methods are typically tailored towards specific settings, complex to develop, and hard to implement and adapt to problem variations. Methods: We introduce the Infrared framework to overcome such hindrances for a large class of problems. Its underlying paradigm is tailored toward problems that can be declaratively formalized as sparse feature networks, a generalization of constraint networks. Classic Boolean constraints specify a search space, consisting of putative solutions whose evaluation is performed through a combination of features. Problems are then solved using generic cluster tree elimination algorithms over a tree decomposition of the feature network. Their overall complexities are linear on the number of variables, and only exponential in the treewidth of the feature network. For sparse feature networks, associated with low to moderate treewidths, these algorithms allow to find optimal solutions, or generate controlled samples, with practical empirical efficiency. Results: Implementing these methods, the Infrared software allows Python programmers to rapidly develop exact optimization and sampling applications based on a tree decomposition-based efficient processing. Instead of directly coding specialized algorithms, problems are declaratively modeled as sets of variables over finite domains, whose dependencies are captured by constraints and functions. Such models are then automatically solved by generic DP algorithms. To illustrate the applicability of Infrared in bioinformatics and guide new users, we model and discuss variants of bioinformatics applications. We provide reimplementations and extensions of methods for RNA design, RNA sequence-structure alignment, parsimony-driven inference of ancestral traits in phylogenetic trees/networks, and design of coding sequences. Moreover, we demonstrate multidimensional Boltzmann sampling. These applications of the framework—together with our novel results—underline the practical relevance of Infrared. Remarkably, the achieved complexities are typically equivalent to the ones of specialized algorithms and implementations. Availability: Infrared is available at https://amibio.gitlabpages.inria.fr/Infrared with extensive documentation, including various usage examples and API reference; it can be installed using Conda or from source.",
                "authors": [
                    {
                        "name": "Berkemer S.J."
                    },
                    {
                        "name": "Marchand B."
                    },
                    {
                        "name": "Ponty Y."
                    },
                    {
                        "name": "Will S."
                    },
                    {
                        "name": "Yao H.-T."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Algorithms for Molecular Biology",
                "title": "Infrared: a declarative tree decomposition-powered framework for bioinformatics"
            },
            "pmcid": "PMC10943887",
            "pmid": "38493130"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}
