{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:48:17Z",
    "biotoolsCURIE": "biotools:axon-analysis",
    "biotoolsID": "axon-analysis",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Katrin Deinhardt",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/9989874-katrin-deinhardt"
        }
    ],
    "description": "Script to analyse axonal aggregates based on fluorescence variation. Use together with script baseline analysis.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/74502-axon-analysis",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-07T18:13:59Z",
    "name": "Axon analysis",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1523/JNEUROSCI.1590-19.2019",
            "metadata": {
                "abstract": "Copyright © 2019 the authors.Neurofibrillary tangles, formed of misfolded, hyperphosphorylated tau protein, are a pathological hallmark of several neurodegenerations, including Alzheimer's disease. Tau pathology spreads between neurons and propagates misfolding in a prion-like manner throughout connected neuronal circuits. Tauopathy is accompanied by significant neuronal death, but the relationships between initial tau misfolding, propagation across connected neurons and cytotoxicity remain unclear. In particular the immediate functional consequence of tau misfolding for the individual neuron is not well understood. Here, using microfluidic devices to recreate discretely organized neuronal connections, we show that the spread and propagation of misfolded tau between individual murine neurons is rapid and efficient; it occurs within days. The neurons containing and propagating tau pathology display selective axonal transport deficits but remain viable and electrically competent. Therefore, we demonstrate that seed-competent misfolded tau species do not acutely cause cell death, but instead initiate discrete cellular dysfunctions.SIGNIFICANCE STATEMENT Public awareness of progressive neurodegenerations such as dementias associated with aging or repetitive head trauma is rising. Protein misfolding underlies many neurodegenerative diseases including tauopathies, where the misfolded tau protein propagates pathology through connected brain circuits in a prion-like manner. Clinically, these diseases progress over the course of years. Here we show that the underlying protein misfolding propagates rapidly between individual neurons. Presence of misfolded tau is not directly cytotoxic to the neuron; the cells remain viable with limited deficits. This suggests that neurons with tau pathology could be rescued with a therapeutic disease modifier and highlights an under-appreciated time window for such therapeutic intervention.",
                "authors": [
                    {
                        "name": "Deinhardt K."
                    },
                    {
                        "name": "Hallinan G.I."
                    },
                    {
                        "name": "Vargas-Caballero M."
                    },
                    {
                        "name": "West J."
                    }
                ],
                "citationCount": 17,
                "date": "2019-11-27T00:00:00Z",
                "journal": "The Journal of neuroscience : the official journal of the Society for Neuroscience",
                "title": "Tau Misfolding Efficiently Propagates between Individual Intact Hippocampal Neurons"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "version": [
        "1.0.0"
    ]
}
