{
    "accessibility": "Open access",
    "additionDate": "2022-05-27T14:19:44.492972Z",
    "biotoolsCURIE": "biotools:hdmc",
    "biotoolsID": "hdmc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhanghan@nankai.edu.cn",
            "name": "Han Zhang",
            "orcidid": "https://orcid.org/0000-0001-8498-3451",
            "typeEntity": "Person"
        },
        {
            "name": "Jia Wang"
        },
        {
            "name": "Shenwei Huang"
        },
        {
            "name": "Xiao Wang"
        },
        {
            "name": "Yanbin Yin",
            "orcidid": "https://orcid.org/0000-0001-7667-881X"
        }
    ],
    "description": "HDMC (Hierarchical Distribution Matching and Contrastive learning) is a novel deep learning based framework for batch effect removal in scRNA-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhanglabNKU/HDMC",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-05-27T14:19:44.495475Z",
    "license": "Not licensed",
    "name": "HDMC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB821",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved.Motivation: With the development of single-cell RNA sequencing (scRNA-seq) techniques, increasingly more largescale gene expression datasets become available. However, to analyze datasets produced by different experiments, batch effects among different datasets must be considered. Although several methods have been recently published to remove batch effects in scRNA-seq data, two problems remain to be challenging and not completely solved: (i) how to reduce the distribution differences of different batches more accurately; and (ii) how to align samples from different batches to recover the cell type clusters. Results: We proposed a novel deep-learning approach, which is a hierarchical distribution-matching framework assisted with contrastive learning to address these two problems. Firstly, we design a hierarchical framework for distribution matching based on a deep autoencoder. This framework employs an adversarial training strategy to match the global distribution of different batches. This provides an improved foundation to further match the local distributions with a maximum mean discrepancy-based loss. For local matching, we divide cells in each batch into clusters and develop a contrastive learning mechanism to simultaneously align similar cluster pairs and keep noisy pairs apart from each other. This allows to obtain clusters with all cells of the same type (true positives), and avoid clusters with cells of different type (false positives). We demonstrate the effectiveness of our method on both simulated and real datasets. Results show that our new method significantly outperforms the state-of-the-art methods and has the ability to prevent overcorrection.",
                "authors": [
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yin Y."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 1,
                "date": "2022-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HDMC: A novel deep learning-based framework for removing batch effects in single-cell RNA-seq data"
            },
            "pmid": "34864918"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
