{
    "additionDate": "2019-11-14T18:43:10Z",
    "biotoolsCURIE": "biotools:denvax",
    "biotoolsID": "denvax",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "carl.pearson@lshtm.ac.uk",
            "name": "Carl A. B. Pearson",
            "orcidid": "https://orcid.org/0000-0003-0701-7860",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'CYD-TDV', 'test-then-vaccinate', 'net-benefits', 'dengue' | Serostatus testing and dengue vaccine cost-benefit thresholds | R package for manuscript \"Serostatus Testing & Dengue Vaccine Cost Benefit Thresholds\"",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/cabp_LSHTM/denvax/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:43:10Z",
    "name": "denvax",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1098/RSIF.2019.0234",
            "metadata": {
                "abstract": "© 2019 The Authors. Published by the Royal Society under the terms of the Creative Commons Attribution License http://creativecommons.org/licenses/by/4.0/, which permits unrestricted use, provided the original author and source are credited.The World Health Organization (WHO) currently recommends pre-screening for past infection prior to administration of the only licensed dengue vaccine, CYD-TDV. Using a threshold modelling analysis, we identify settings where this guidance prohibits positive net-benefits, and are thus unfavourable. Generally, however, our model shows test-then-vaccinate strategies can improve CYD-TDV economic viability: effective testing reduces unnecessary vaccination costs while increasing health benefits. With sufficiently low testing cost, those trends outweigh additional screening costs, expanding the range of settings with positive net-benefits. This work highlights two aspects for further analysis of test-then-vaccinate strategies. We found that starting routine testing at younger ages could increase benefits; if real tests are shown to sufficiently address safety concerns, the manufacturer, regulators and WHO should revisit guidance restricting use to 9-years-and-older recipients. We also found that repeat testing could improve return-on-investment (ROI), despite increasing intervention costs. Thus, more detailed analyses should address questions on repeat testing and testing periodicity, in addition to real test sensitivity and specificity. Our results follow from a mathematical model relating ROI to epidemiology, intervention strategy, and costs for testing, vaccination and dengue infections. We applied this model to a range of strategies, costs and epidemiological settings pertinent to CYD-TDV. However, general trends may not apply locally, so we provide our model and analyses as an R package available via CRAN, denvax. To apply to their setting, decision-makers need only local estimates of age-specific seroprevalence and costs for secondary infections.",
                "authors": [
                    {
                        "name": "Pearson C.A.B."
                    },
                    {
                        "name": "Abbas K.M."
                    },
                    {
                        "name": "Clifford S."
                    },
                    {
                        "name": "Flasche S."
                    },
                    {
                        "name": "Hladish T.J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Journal of the Royal Society Interface",
                "title": "Serostatus testing and dengue vaccine cost-benefit thresholds"
            },
            "pmcid": "PMC6731500",
            "pmid": "31431184"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}