{
    "accessibility": "Open access",
    "additionDate": "2022-05-07T09:35:56.152245Z",
    "biotoolsCURIE": "biotools:govs",
    "biotoolsID": "govs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cma@nwafu.edu.cn",
            "name": "Chuang Ma",
            "orcidid": "https://orcid.org/0000-0001-9612-7898"
        },
        {
            "email": "xwang@cau.edu.cn",
            "name": "Xiangfeng Wang",
            "orcidid": "https://orcid.org/0000-0002-0360-0859"
        },
        {
            "name": "Jianbing Yan"
        }
    ],
    "description": "Genome optimization via virtual simulation to accelerate maize hybrid breeding.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/GOVS-pack/GOVS/blob/master/GOVS-Reference-Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://govs-pack.github.io/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-05-07T09:35:56.154683Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/GOVS-pack/GOVS"
        }
    ],
    "name": "GOVS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB447",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The employment of doubled-haploid (DH) technology in maize has vastly accelerated the efficiency of developing inbred lines. The selection of superior lines has to rely on genotypes with genomic selection (GS) model, rather than phenotypes due to the high expense of field phenotyping. In this work, we implemented 'genome optimization via virtual simulation (GOVS)' using the genotype and phenotype data of 1404 maize lines and their F1 progeny. GOVS simulates a virtual genome encompassing the most abundant 'optimal genotypes' or 'advantageous alleles' in a genetic pool. Such a virtually optimized genome, although can never be developed in reality, may help plot the optimal route to direct breeding decisions. GOVS assists in the selection of superior lines based on the genomic fragments that a line contributes to the simulated genome. The assumption is that the more fragments of optimal genotypes a line contributes to the assembly, the higher the likelihood of the line favored in the F1 phenotype, e.g. grain yield. Compared to traditional GS method, GOVS-Assisted selection may avoid using an arbitrary threshold for the predicted F1 yield to assist selection. Additionally, the selected lines contributed complementary sets of advantageous alleles to the virtual genome. This feature facilitates plotting the optimal route for DH production, whereby the fewest lines and F1 combinations are needed to pyramid a maximum number of advantageous alleles in the new DH lines. In summary, incorporation of DH production, GS and genome optimization will ultimately improve genomically designed breeding in maize. Short abstract: Doubled-haploid (DH) technology has been widely applied in maize breeding industry, as it greatly shortens the period of developing homozygous inbred lines via bypassing several rounds of self-crossing. The current challenge is how to efficiently screen the large volume of inbred lines based on genotypes. We present the toolbox of genome optimization via virtual simulation (GOVS), which complements the traditional genomic selection model. GOVS simulates a virtual genome encompassing the most abundant 'optimal genotypes' in a breeding population, and then assists in selection of superior lines based on the genomic fragments that a line contributes to the simulated genome. Availability of GOVS (https://govs-pack.github.io/) to the public may ultimately facilitate genomically designed breeding in maize.",
                "authors": [
                    {
                        "name": "Cheng Q."
                    },
                    {
                        "name": "Jiang S."
                    },
                    {
                        "name": "Ma C."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Xiao Y."
                    },
                    {
                        "name": "Xu F."
                    },
                    {
                        "name": "Yan J."
                    },
                    {
                        "name": "Zhang R."
                    },
                    {
                        "name": "Zhao J."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Genome optimization via virtual simulation to accelerate maize hybrid breeding"
            },
            "pmid": "34676389"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "version": [
        "1.0"
    ]
}
