{
    "additionDate": "2017-08-03T18:45:10Z",
    "biotoolsCURIE": "biotools:genepalette",
    "biotoolsID": "genepalette",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.genepalette.org/contact.html"
        }
    ],
    "description": "Genome sequence visualization and navigation. Users can download from NCBI’s GenBank database large or small segments of genome sequence from a variety of organisms preserving the gene annotation that is associated with that sequence. Sequence elements of interest (transcription factor binding sites, etc. can be searched for and identified in the loaded sequence, and then clearly visualized within a colorful graphical representation of gene organization.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.genepalette.org/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.genepalette.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/genepalette-2-0-genome-sequence-visualization-navigation.html"
        }
    ],
    "name": "GenePalette",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "To make effective use of the growing host of complete genome sequences, biologists must have easy-to-use software tools that allow them to visualize, analyze, and modify genome data in an interactive and generalized manner. In an effort to bridge the gap between genome and researcher, we have created GenePalette (www.genepalette.org), a desktop application that can access any genome sequence and display the positions of various features [e.g., transcription factor binding sites (TFBSs)] relative to the introns and exons of annotated genes. Written in Java, GenePalette can run on all Java-supporting operating systems (Mac, PC, Unix, Linux). Annotated sequence encompassing the majority of public genome data is rapidly retrieved from GenBank or Ensembl. The software provides intuitive access to the selected genomic region through three interface components: a colorful graphical display showing a schematic of genes and features; an annotated sequence view in which features and genes are highlighted directly on the sequence; and the selectable raw sequence. The three interface components are fully integrated and presented on one page, permitting the user to move easily between representations at different levels of resolution, ranging from kilobases to individual nucleotides. GenePalette is a particularly powerful platform for analyzing the organization of cis-regulatory elements and designing wet-lab experiments to investigate them. © 2004 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Rebeiz M."
                    },
                    {
                        "name": "Posakony J.W."
                    }
                ],
                "citationCount": 60,
                "date": "2004-07-15T00:00:00Z",
                "journal": "Developmental Biology",
                "title": "GenePalette: A universal software tool for genome sequence visualization and analysis"
            },
            "pmid": "15223345"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}