{
    "additionDate": "2015-02-04T09:14:49Z",
    "biotoolsCURIE": "biotools:webmicroscope",
    "biotoolsID": "webmicroscope",
    "collectionID": [
        "BioMedBridges Tools"
    ],
    "credit": [
        {
            "name": "Mikael Lundin",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "FIMM",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "BioMedBridges",
            "typeEntity": "Consortium",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://www.biomedbridges.eu"
        },
        {
            "email": "contact@webmicroscope.net",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "johan.lundin@helsinki.fi",
            "name": "Johan Lundin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Platform for virtual microscopy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://help.webmicroscope.net/About.aspx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "TIFF",
                            "uri": "http://edamontology.org/format_3591"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Image metadata",
                        "uri": "http://edamontology.org/data_3546"
                    },
                    "format": [
                        {
                            "term": "TIFF",
                            "uri": "http://edamontology.org/format_3591"
                        }
                    ]
                }
            ],
            "note": "Topic is \"Virtual microscopy\". Including slide seminars, Quality Assurance projects, interactive educational material, research applications (Tissue Micro Array analysis), publication supplements and clinical services.",
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    }
                }
            ]
        }
    ],
    "homepage": "http://biomedbridges.webmicroscope.net",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "WebMicroscope",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "BioMedBridges",
    "publication": [
        {
            "doi": "10.1186/1746-1596-6-s1-s13",
            "metadata": {
                "abstract": "Background: We describe development and evaluation of the user-friendly web based virtual microscopy - WebMicroscope for teaching and learning dental students basic and oral pathology. Traditional students microscopes were replaced by computer workstations.Methods: The transition of the basic and oral pathology courses from light to virtual microscopy has been completed gradually over a five-year period. A pilot study was conducted in academic year 2005/2006 to estimate the feasibility of integrating virtual microscopy into a traditional light microscopy-based pathology course. The entire training set of glass slides was subsequently converted to virtual slides and placed on the WebMicroscope server. Giving access to fully digitized slides on the web with a browser and a viewer plug-in, the computer has become a perfect companion of the student.Results: The study material consists now of over 400 fully digitized slides which covering 15 entities in basic and systemic pathology and 15 entities in oral pathology. Digitized slides are linked with still macro- and microscopic images, organized with clinical information into virtual cases and supplemented with text files, syllabus, PowerPoint presentations and animations on the web, serving additionally as material for individual studies. After their examinations, the students rated the use of the software, quality of the images, the ease of handling the images, and the effective use of virtual slides during the laboratory practicals. Responses were evaluated on a standardized scale. Because of the positive opinions and support from the students, the satisfaction surveys had shown a progressive improvement over the past 5 years. The WebMicroscope as a didactic tool for laboratory practicals was rated over 8 on a 1-10 scale for basic and systemic pathology and 9/10 for oral pathology especially as various students' suggestions were implemented. Overall, the quality of the images was rated as very good.Conclusions: An overwhelming majority of our students regarded a possibility of using virtual slides at their convenience as highly desirable. Our students and faculty consider the use of the virtual microscope for the study of basic as well as oral pathology as a significant improvement over the light microscope. © 2011 Szymas and Lundin; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Szymas J."
                    },
                    {
                        "name": "Lundin M."
                    }
                ],
                "citationCount": 30,
                "date": "2011-03-30T00:00:00Z",
                "journal": "Diagnostic Pathology",
                "title": "Five years of experience teaching pathology to dental students using the WebMicroscope"
            },
            "type": [
                "Review"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}