{
    "additionDate": "2022-09-28T11:25:17.842540Z",
    "biotoolsCURIE": "biotools:antifp",
    "biotoolsID": "antifp",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/antifp/index.html"
        }
    ],
    "description": "Antifp is an in silico method, which is developed to predict and design antifungal peptides. The main dataset used in this method consists of 1459 antifungal peptides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/antifp/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/antifp/index.html",
    "lastUpdate": "2024-11-24T15:33:53.517188Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/antifp/index.html"
        }
    ],
    "name": "antifp",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.3389/fmicb.2018.00323",
            "metadata": {
                "abstract": "This paper describes in silico models developed using a wide range of peptide features for predicting antifungal peptides (AFPs). Our analyses indicate that certain types of residue (e.g., C, G, H, K, R, Y) are more abundant in AFPs. The positional residue preference analysis reveals the prominence of the particular type of residues (e.g., R, V, K) at N-terminus and a certain type of residues (e.g., C, H) at C-terminus. In this study, models have been developed for predicting AFPs using a wide range of peptide features (like residue composition, binary profile, terminal residues). The support vector machine based model developed using compositional features of peptides achieved maximum accuracy of 88.78% on the training dataset and 83.33% on independent or validation dataset. Our model developed using binary patterns of terminal residues of peptides achieved maximum accuracy of 84.88% on training and 84.64% on validation dataset. We benchmark models developed in this study and existing methods on a dataset containing compositionally similar antifungal and non-AFPs. It was observed that binary based model developed in this study preforms better than any model/method. In order to facilitate scientific community, we developed a mobile app, standalone and a user-friendly web server 'Antifp' (http://webs.iiitd.edu.in/raghava/antifp).",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Bhalla S."
                    },
                    {
                        "name": "Chaudhary K."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma M."
                    }
                ],
                "citationCount": 114,
                "date": "2018-02-26T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "In silico approach for prediction of antifungal peptides"
            },
            "pmcid": "PMC5834480",
            "pmid": "29535692"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
