{
    "additionDate": "2020-01-09T17:50:12Z",
    "biotoolsCURIE": "biotools:Dynalogo",
    "biotoolsID": "Dynalogo",
    "confidence_flag": "tool",
    "description": "Interactive sequence logo with dynamic thresholding of matched quantitative proteomic data.\n\nDynalogo can be run with the following code from within RStudio or deployed on a shiny server.\n\nTo ensure compatibility, the user can download the current list of packages and Version numbers from the Dynalogo webite by clicking on the \"Version Info\" text at the top of the application located at https://dynalogo.cam.uchc.edu.\n\nDynalogo: Dynamic Sequence Logos.\n\nDynalogo is a web application which can be used to visualize and explore binding array (ie. peptide array) datasets. It was created to allow the dynamic visualizations of sequence logos for better insight into the relationship between affinity and specificity of binding domains.\n\nPlease import your dataset or dowlnoad the sample dataset",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://dynalogo.cam.uchc.edu",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-25T10:52:30Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lafontaine-uchc/dynalogo"
        }
    ],
    "name": "Dynalogo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ766",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Summary: Current web-based sequence logo analyses for studying domain-peptide interactions are often conducted only on high affinity binders due to conservative data thresholding. We have developed Dynalogo, a combination of threshold varying tool and sequence logo generator written in the R statistical programming language, which allows on-the-fly visualization of binding specificity over a wide range of affinity interactions. Hence researchers can easily explore their dataset without the constraint of an arbitrary threshold. After importing quantitative data files, there are various data filtering and visualizing features available. Using a threshold control, users can easily track the dynamic change of enrichment and depletion of amino acid characters in the sequence logo panel. The built-in export function allows downloading filtered data and graphical outputs for further analyses. Dynalogo is optimized for analysis of modular domain-peptide binding experiments but the platform offers a broader application including quantitative proteomics.",
                "authors": [
                    {
                        "name": "Lafontaine A.T."
                    },
                    {
                        "name": "Machida K."
                    },
                    {
                        "name": "Mayer B.J."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Dynalogo: An interactive sequence logo with dynamic thresholding of matched quantitative proteomic data"
            },
            "pmid": "31609429"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
