{
    "accessibility": "Open access",
    "additionDate": "2023-01-27T14:42:31.024157Z",
    "biotoolsCURIE": "biotools:cocktail",
    "biotoolsID": "cocktail",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Saija Johanna Kiljunen"
        }
    ],
    "description": "Cocktail is a program for mathematical modelling of bacteriophage (phage) infection kinetics. Cocktail is a Windows 64-bit program and the source code can be developed in the directions that users see fit.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ASNilsson/Cocktail-phage-infection-kinetics",
    "lastUpdate": "2024-11-24T15:08:14.817784Z",
    "license": "CC-BY-NC-SA-4.0",
    "name": "Cocktail",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/v14112483",
            "metadata": {
                "abstract": "Cocktail is an easy-to-use computer program for mathematical modelling of bacteriophage (phage) infection kinetics in a chemostat. The infection of bacteria by phages results in complicated dynamic processes as both have the ability to multiply and change during the course of an infection. There is a need for a simple way to visualise these processes, not least due to the increased interest in phage therapy. Cocktail is completely self-contained and runs on a Windows 64-bit operating system. By changing the publicly available source code, the program can be developed in the directions that users see fit. Cocktail’s models consist of coupled differential equations that describe the infection of a bacterium in a vessel by one or two (interfering) phages. In the models, the bacterial population can be controlled by sixteen parameters, for example, through different growth rates, phage resistance, metabolically inactive cells or biofilm formation. The phages can be controlled by eight parameters each, such as different adsorption rates or latency periods. As the models in Cocktail describe the infection kinetics of phages in vitro, the program is primarily intended to generate hypotheses, but the results can however be indicative in the application of phage therapy.",
                "authors": [
                    {
                        "name": "Nilsson A.S."
                    }
                ],
                "citationCount": 3,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Viruses",
                "title": "Cocktail, a Computer Program for Modelling Bacteriophage Infection Kinetics"
            },
            "pmcid": "PMC9695944",
            "pmid": "36366581"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
