{
    "additionDate": "2021-03-19T08:56:15Z",
    "biotoolsCURIE": "biotools:mni-siscom",
    "biotoolsID": "mni-siscom",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jeremy T. Moreau",
            "typeEntity": "Person"
        }
    ],
    "description": "An Open-Source Tool for Computing Subtraction Ictal Single-Photon Emission CT Coregistered to MRI.\n\nMNI SISCOM is a Windows/Mac/Linux desktop and command line application for computing Subtraction ictal single-photon emission CT coregistered to MRI (SISCOM). The underlying Python library that implements the functionality of MNI SISCOM is also available on PyPi. Please cite the following paper if you use MNI SISCOM in a paper: [reference to come].\n\nA simple command line tool and GUI for computing subtraction ictal SPECT coregistered to MRI (SISCOM). mnisiscom is exclusively intended for research use!.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/jeremymoreau/mnisiscom/tree/master/examples"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jeremymoreau/mnisiscom",
    "language": [
        "Python",
        "JavaScript"
    ],
    "lastUpdate": "2021-04-11T09:35:01Z",
    "license": "MPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/mnisiscom/"
        }
    ],
    "name": "MNI SISCOM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S10278-021-00422-9",
            "metadata": {
                "abstract": "© 2021, Society for Imaging Informatics in Medicine.Subtraction ictal single-photon emission computed tomography (SPECT) coregistered to MRI (SISCOM) is a well-established technique for quantitative analysis of ictal vs interictal SPECT images that can contribute to the identification of the seizure onset zone in patients with drug‐resistant epilepsy. However, there is presently a lack of user-friendly free and open-source software to compute SISCOM results from raw SPECT and MRI images. We aimed to develop a simple graphical desktop application for computing SISCOM. MNI SISCOM is a new free and open-source software application for computing SISCOM and producing practical MRI/SPECT/SISCOM image panels for review and reporting. The graphical interface allows any user to quickly and easily obtain SISCOM images with minimal user interaction. Additionally, MNI SISCOM provides command line and Python interfaces for users who would like to integrate these features into their own scripts and pipelines. MNI SISCOM is freely available for download from: https://github.com/jeremymoreau/mnisiscom.",
                "authors": [
                    {
                        "name": "Moreau J.T."
                    },
                    {
                        "name": "Saint-Martin C."
                    },
                    {
                        "name": "Baillet S."
                    },
                    {
                        "name": "Dudley R.W.R."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "MNI SISCOM: an Open-Source Tool for Computing Subtraction Ictal Single-Photon Emission CT Coregistered to MRI"
            },
            "pmid": "33604806"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}