{
    "accessibility": "Open access",
    "additionDate": "2022-09-16T22:49:33.067295Z",
    "biotoolsCURIE": "biotools:genetolist",
    "biotoolsID": "genetolist",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "joshua.breidenbach@rockets.utoledo.edu",
            "name": "Joshua D. Breidenbach",
            "orcidid": "https://orcid.org/0000-0002-5892-1879"
        },
        {
            "name": "David J. Kennedy"
        },
        {
            "name": "E. Francis Begue III"
        },
        {
            "name": "Steven T. Haller"
        }
    ],
    "description": "A web application to assist with gene identifiers for the non-bioinformatics-savvy scientist.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene symbol",
                        "uri": "http://edamontology.org/data_1026"
                    }
                },
                {
                    "data": {
                        "term": "Locus ID (EntrezGene)",
                        "uri": "http://edamontology.org/data_1904"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.genetolist.com/",
    "lastUpdate": "2024-11-24T15:39:06.965816Z",
    "name": "GeneToList",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/biology11081113",
            "metadata": {
                "abstract": "The increasing incorporation of omics technologies into biomedical research and translational medicine presents challenges to end users of the large and complex datasets that are generated by these methods. A particular challenge in genomics is that the nomenclature for genes is not uniform between large genomic databases or between commonly used genetic analysis tools. Furthermore, outdated genomic nomenclature can still be found amongst scientific communications, including peer-reviewed manuscripts. Therefore, a web application (GeneToList) was developed to assist in gene ID conversion and alias matching, with a specific focus on achieving a user-friendly interface for the non-bioinformatics-savvy scientist. It currently includes gene information for over 38,000 different taxa retrieved from the National Center for Biotechnology and Information (NCBI) Gene resource. Supported databases of gene IDs include NCBI Gene Symbols, NCBI Gene IDs (Entrez IDs), OMIM IDs, HGNC IDs, Ensembl IDs, and 28 other taxa-specific identifiers. GeneToList is available at genetolist.com. The tool is a web application that is compatible with many standard browsers. The gene ID conversion feature of this application was found to outcompete the common gene ID conversion tools. Specifically, it was able to successfully convert all tested IDs, whereas the others were not able to recognize the gene aliases. Therefore, the gene ID disambiguation provided by this application should be beneficial for many scientists dealing with gene data when the uniformity of gene nomenclature is important for downstream analysis.",
                "authors": [
                    {
                        "name": "Begue III E.F."
                    },
                    {
                        "name": "Breidenbach J.D."
                    },
                    {
                        "name": "Haller S.T."
                    },
                    {
                        "name": "Kennedy D.J."
                    }
                ],
                "citationCount": 2,
                "date": "2022-08-01T00:00:00Z",
                "journal": "Biology",
                "title": "GeneToList: A Web Application to Assist with Gene Identifiers for the Non-Bioinformatics-Savvy Scientist"
            },
            "pmcid": "PMC9332626",
            "pmid": "35892968"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Translational medicine",
            "uri": "http://edamontology.org/topic_3342"
        }
    ],
    "validated": 1
}
