{
    "name": "HGTector", 
    "description": "Computational pipeline for genome-wide detection of putative horizontal gene transfer (HGT) events based on sequence homology search hit distribution statistics.", 
    "homepage": "https://github.com/DittmarLab/HGTector", 
    "biotoolsID": "hgtector", 
    "biotoolsCURIE": "biotools:hgtector", 
    "version": [
        "0.2.2"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2451", 
                    "term": "Sequence comparison"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/hgtector-detection-of-candidate-hgt-derived-genes.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/DittmarLab/HGTector/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25159222", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "HGTector: An automated method facilitating genome-wide discovery of putative horizontal gene transfers", 
                "abstract": "© 2014 Zhu et al.; licensee BioMed Central Ltd.Background: First pass methods based on BLAST match are commonly used as an initial step to separate the different phylogenetic histories of genes in microbial genomes, and target putative horizontal gene transfer (HGT) events. This will continue to be necessary given the rapid growth of genomic data and the technical difficulties in conducting large-scale explicit phylogenetic analyses. However, these methods often produce misleading results due to their inability to resolve indirect phylogenetic links and their vulnerability to stochastic events. Results: A new computational method of rapid, exhaustive and genome-wide detection of HGT was developed, featuring the systematic analysis of BLAST hit distribution patterns in the context of a priori defined hierarchical evolutionary categories. Genes that fall beyond a series of statistically determined thresholds are identified as not adhering to the typical vertical history of the organisms in question, but instead having a putative horizontal origin. Tests on simulated genomic data suggest that this approach effectively targets atypically distributed genes that are highly likely to be HGT-derived, and exhibits robust performance compared to conventional BLAST-based approaches. This method was further tested on real genomic datasets, including Rickettsia genomes, and was compared to previous studies. Results show consistency with currently employed categories of HGT prediction methods. In-depth analysis of both simulated and real genomic data suggests that the method is notably insensitive to stochastic events such as gene loss, rate variation and database error, which are common challenges to the current methodology. An automated pipeline was created to implement this approach and was made publicly available at: https://github.com/DittmarLab/HGTector. The program is versatile, easily deployed, has a low requirement for computational resources. Conclusions: HGTector is an effective tool for initial or standalone large-scale discovery of candidate HGT-derived genes.", 
                "date": "2014-08-26T00:00:00Z", 
                "citationCount": 19, 
                "authors": [
                    {
                        "name": "Zhu Q."
                    }, 
                    {
                        "name": "Kosoy M."
                    }, 
                    {
                        "name": "Dittmar K."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Qiyun Zhu", 
            "email": "qiyunzhu@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Katharina Dittmar", 
            "email": "katharinad@gmail.com", 
            "url": "http://katharina-dittmar.squarespace.com/contact-1/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:45:55Z", 
    "lastUpdate": "2018-12-10T12:58:43Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}