{
    "additionDate": "2019-11-14T20:03:51Z",
    "biotoolsCURIE": "biotools:PhyloCSF",
    "biotoolsID": "PhyloCSF",
    "confidence_flag": "tool",
    "description": "> LOW CONFIDENCE! | Discovery of high-confidence human protein-coding genes and exons by whole-genome PhyloCSF helps elucidate 118 GWAS loci | Phylogenetic analysis of multi-species genome sequence alignments to identify conserved protein-coding regions | +---------------------------------------------------------------------+ | Index of /compbio1/PhyloCSFtracks | : ____ __ __ ___________ ______ : | : / __ \\/ /_ __ __/ /____ / ____/ ___// ____/ : | : http://compbio.mit.edu/PhyloCSF :",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mlin/PhyloCSF/wiki",
    "language": [
        "OCaml"
    ],
    "lastUpdate": "2020-12-05T10:13:57.118855Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mlin/PhyloCSF"
        }
    ],
    "name": "PhyloCSF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/GR.246462.118",
            "metadata": {
                "abstract": "© 2019 Mudge et al.The most widely appreciated role of DNA is to encode protein, yet the exact portion of the human genome that is translated remains to be ascertained. We previously developed PhyloCSF, a widely used tool to identify evolutionary signatures of protein-coding regions using multispecies genome alignments. Here, we present the first whole-genome PhyloCSF prediction tracks for human, mouse, chicken, fly, worm, and mosquito.We develop a workflow that uses machine learning to predict novel conserved protein-coding regions and efficiently guide their manual curation. We analyze more than 1000 highscoring human PhyloCSF regions and confidently add 144 conserved protein-coding genes to the GENCODE gene set, as well as additional coding regions within 236 previously annotated protein-coding genes, and 169 pseudogenes, most of them disabled after primates diverged. The majority of these represent new discoveries, including 70 previously undetected protein-coding genes. The novel coding genes are additionally supported by single-nucleotide variant evidence indicative of continued purifying selection in the human lineage, coding-exon splicing evidence from new GENCODE transcripts using next-generation transcriptomic data sets, and mass spectrometry evidence of translation for several new genes. Our discoveries required simultaneous comparative annotation of other vertebrate genomes, which we show is essential to remove spurious ORFs and to distinguish coding from pseudogene regions. Our new coding regions help elucidate disease-associated regions by revealing that 118 GWAS variants previously thought to be noncoding are in fact protein altering. Altogether, our PhyloCSF data sets and algorithms will help researchers seeking to interpret these genomes, while our new annotations present exciting loci for further experimental characterization.",
                "authors": [
                    {
                        "name": "Mudge J.M."
                    },
                    {
                        "name": "Jungreis I."
                    },
                    {
                        "name": "Hunt T."
                    },
                    {
                        "name": "Gonzalez J.M."
                    },
                    {
                        "name": "Wright J.C."
                    },
                    {
                        "name": "Kay M."
                    },
                    {
                        "name": "Davidson C."
                    },
                    {
                        "name": "Fitzgerald S."
                    },
                    {
                        "name": "Seal R."
                    },
                    {
                        "name": "Tweedie S."
                    },
                    {
                        "name": "He L."
                    },
                    {
                        "name": "Waterhouse R.M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Bruford E."
                    },
                    {
                        "name": "Choudhary J.S."
                    },
                    {
                        "name": "Frankish A."
                    },
                    {
                        "name": "Kellis M."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Discovery of high-confidence human protein-coding genes and exons by whole-genome PhyloCSF helps elucidate 118 GWAS loci"
            },
            "pmid": "31537640"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}