{
    "accessibility": "Open access",
    "additionDate": "2022-02-09T19:24:21.479717Z",
    "biotoolsCURIE": "biotools:piika_2.5",
    "biotoolsID": "piika_2.5",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kusalik@cs.usask.ca",
            "name": "Anthony Kusalik",
            "typeEntity": "Person"
        },
        {
            "email": "scott.napper@usask.ca",
            "name": "Scott Napper",
            "typeEntity": "Person"
        },
        {
            "name": "Connor Denomy",
            "orcidid": "https://orcid.org/0000-0003-1991-5385"
        },
        {
            "name": "Conor Lazarou"
        },
        {
            "name": "Daniel Hogan"
        },
        {
            "name": "Antonio Facciuolo"
        },
        {
            "name": "Erin Scruten"
        }
    ],
    "description": "Enhanced quality control of peptide microarrays for kinome analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://saphire.usask.ca/saphire/piika_beta/piika2.5_user_guide.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "http://saphire.usask.ca",
    "lastUpdate": "2022-02-09T19:24:21.482274Z",
    "license": "CC-BY-NC-3.0",
    "name": "PIIKA 2.5",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0257232",
            "metadata": {
                "abstract": "Copyright: © 2021 Denomy et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Peptide microarrays consisting of defined phosphorylation target sites are an effective approach for high throughput analysis of cellular kinase (kinome) activity. Kinome peptide arrays are highly customizable and do not require species-specific reagents to measure kinase activity, making them amenable for kinome analysis in any species. Our group developed software, Platform for Integrated, Intelligent Kinome Analysis (PIIKA), to enable more effective extraction of meaningful biological information from kinome peptide array data. A subsequent version, PIIKA2, unveiled new statistical tools and data visualization options. Here we introduce PIIKA 2.5 to provide two essential quality control metrics and a new background correction technique to increase the accuracy and consistency of kinome results. The first metric alerts users to improper spot size and informs them of the need to perform manual resizing to enhance the quality of the raw intensity data. The second metric uses inter-array comparisons to identify outlier arrays that sometimes emerge as a consequence of technical issues. In addition, a new background correction method, background scaling, can sharply reduce spatial biases within a single array in comparison to background subtraction alone. Collectively, the modifications of PIIKA 2.5 enable identification and correction of technical issues inherent to the technology and better facilitate the extraction of meaningful biological information. We show that these metrics demonstrably enhance kinome analysis by identifying low quality data and reducing batch effects, and ultimately improve clustering of treatment groups and enhance reproducibility. The web-based and stand-alone versions of PIIKA 2.5 are freely accessible at via http://saphire.usask.ca.",
                "authors": [
                    {
                        "name": "Denomy C."
                    },
                    {
                        "name": "Lazarou C."
                    },
                    {
                        "name": "Hogan D."
                    },
                    {
                        "name": "Facciuolo A."
                    },
                    {
                        "name": "Scruten E."
                    },
                    {
                        "name": "Kusalik A."
                    },
                    {
                        "name": "Napper S."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PIIKA 2.5: Enhanced quality control of peptide microarrays for kinome analysis"
            },
            "pmcid": "PMC8432839",
            "pmid": "34506584"
        },
        {
            "doi": "10.1371/journal.pone.0080837",
            "metadata": {
                "abstract": "Kinome microarrays are comprised of peptides that act as phosphorylation targets for protein kinases. This platform is growing in popularity due to its ability to measure phosphorylation-mediated cellular signaling in a high-throughput manner. While software for analyzing data from DNA microarrays has also been used for kinome arrays, differences between the two technologies and associated biologies previously led us to develop Platform for Intelligent, Integrated Kinome Analysis (PIIKA), a software tool customized for the analysis of data from kinome arrays. Here, we report the development of PIIKA 2, a significantly improved version with new features and improvements in the areas of clustering, statistical analysis, and data visualization. Among other additions to the original PIIKA, PIIKA 2 now allows the user to: evaluate statistically how well groups of samples cluster together; identify sets of peptides that have consistent phosphorylation patterns among groups of samples; perform hierarchical clustering analysis with bootstrapping; view false negative probabilities and positive and negative predictive values for t-tests between pairs of samples; easily assess experimental reproducibility; and visualize the data using volcano plots, scatterplots, and interactive three-dimensional principal component analyses. Also new in PIIKA 2 is a web-based interface, which allows users unfamiliar with command-line tools to easily provide input and download the results. Collectively, the additions and improvements described here enhance both the breadth and depth of analyses available, simplify the user interface, and make the software an even more valuable tool for the analysis of kinome microarray data. Both the web-based and stand-alone versions of PIIKA 2 can be accessed via http://saphire.usask.ca.",
                "authors": [
                    {
                        "name": "Trost B."
                    },
                    {
                        "name": "Kindrachuk J."
                    },
                    {
                        "name": "Maattanen P."
                    },
                    {
                        "name": "Napper S."
                    },
                    {
                        "name": "Kusalik A."
                    }
                ],
                "citationCount": 40,
                "date": "2013-11-29T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PIIKA 2: An expanded, web-based platform for analysis of kinome microarray data"
            },
            "pmcid": "PMC3843739",
            "pmid": "24312246"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}