{
    "additionDate": "2024-06-18T13:48:56.722963Z",
    "biotoolsCURIE": "biotools:san",
    "biotoolsID": "san",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "junjy.park@utoronto.ca",
            "name": "Jun Young Park",
            "typeEntity": "Person"
        }
    ],
    "description": "Mitigating spatial covariance heterogeneity in cortical thickness data collected from multiple scanners or sites.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/junjypark/SAN",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:54:14.536523Z",
    "license": "MIT",
    "name": "SAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/hbm.26692",
            "metadata": {
                "abstract": "In neuroimaging studies, combining data collected from multiple study sites or scanners is becoming common to increase the reproducibility of scientific discoveries. At the same time, unwanted variations arise by using different scanners (inter-scanner biases), which need to be corrected before downstream analyses to facilitate replicable research and prevent spurious findings. While statistical harmonization methods such as ComBat have become popular in mitigating inter-scanner biases in neuroimaging, recent methodological advances have shown that harmonizing heterogeneous covariances results in higher data quality. In vertex-level cortical thickness data, heterogeneity in spatial autocorrelation is a critical factor that affects covariance heterogeneity. Our work proposes a new statistical harmonization method called spatial autocorrelation normalization (SAN) that preserves homogeneous covariance vertex-level cortical thickness data across different scanners. We use an explicit Gaussian process to characterize scanner-invariant and scanner-specific variations to reconstruct spatially homogeneous data across scanners. SAN is computationally feasible, and it easily allows the integration of existing harmonization methods. We demonstrate the utility of the proposed method using cortical thickness data from the Social Processes Initiative in the Neurobiology of the Schizophrenia(s) (SPINS) study. SAN is publicly available as an R package.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Oliver L.D."
                    },
                    {
                        "name": "Park J.Y."
                    },
                    {
                        "name": "Voineskos A.N."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "date": "2024-05-01T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "SAN: Mitigating spatial covariance heterogeneity in cortical thickness data collected from multiple scanners or sites"
            },
            "pmcid": "PMC11075170",
            "pmid": "38712767"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
