{
    "accessibility": "Open access",
    "additionDate": "2018-05-07T16:13:51Z",
    "biotoolsCURIE": "biotools:lmap",
    "biotoolsID": "lmap",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "emaldonado@ciimar.up.pt",
            "name": "Emanuel Maldonado",
            "orcidid": "https://orcid.org/0000-0002-0084-6116",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A package of user-friendly terminal/command-line and interactive applications developed in Perl, to enable the high-throughput analyses of multiple genes/datasets in PAML (codeml). LMAP was designed for the workstation multi-core environment and enables all the codeml codon substitutions models: site models, branch models, branch-site models and clade models.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://lmapaml.sourceforge.net/LMAP_Manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://lmapaml.sourceforge.net/",
            "version": "1.0.2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage analysis",
                    "uri": "http://edamontology.org/operation_0286"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                },
                {
                    "term": "Phylogenetic inference (method centric)",
                    "uri": "http://edamontology.org/operation_0539"
                }
            ]
        }
    ],
    "homepage": "http://lmapaml.sourceforge.net/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-05-11T18:59:19Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "LMAP",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "emaldonado",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1204-5",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Uncovering how phenotypic diversity arises and is maintained in nature has long been a major interest of evolutionary biologists. Recent advances in genome sequencing technologies have remarkably increased the efficiency to pinpoint genes involved in the adaptive evolution of phenotypes. Reliability of such findings is most often examined with statistical and computational methods using Maximum Likelihood codon-based models (i.e., site, branch, branch-site and clade models), such as those available in codeml from the Phylogenetic Analysis by Maximum Likelihood (PAML) package. While these models represent a well-defined workflow for documenting adaptive evolution, in practice they can be challenging for researchers having a vast amount of data, as multiple types of relevant codon-based datasets are generated, making the overall process hard and tedious to handle, error-prone and time-consuming. Results: We introduce LMAP (Lightweight Multigene Analyses in PAML), a user-friendly command-line and interactive package, designed to handle the codeml workflow, namely: directory organization, execution, results gathering and organization for Likelihood Ratio Test estimations with minimal manual user intervention. LMAP was developed for the workstation multi-core environment and provides a unique advantage for processing one, or more, if not all codeml codon-based models for multiple datasets at a time. Our software, proved efficiency throughout the codeml workflow, including, but not limited, to simultaneously handling more than 20 datasets. Conclusions: We have developed a simple and versatile LMAP package, with outstanding performance, enabling researchers to analyze multiple different codon-based datasets in a high-throughput fashion. At minimum, two file types are required within a single input directory: one for the multiple sequence alignment and another for the phylogenetic tree. To our knowledge, no other software combines all codeml codon substitution models of adaptive evolution. LMAP has been developed as an open-source package, allowing its integration into more complex open-source bioinformatics pipelines. LMAP package is released under GPLv3 license and is freely available at http://lmapaml.sourceforge.net/.",
                "authors": [
                    {
                        "name": "Almeida D."
                    },
                    {
                        "name": "Antunes A."
                    },
                    {
                        "name": "Escalona T."
                    },
                    {
                        "name": "Khan I."
                    },
                    {
                        "name": "Maldonado E."
                    },
                    {
                        "name": "Vasconcelos V."
                    }
                ],
                "citationCount": 8,
                "date": "2016-09-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LMAP: Lightweight Multigene Analyses in PAML"
            },
            "pmcid": "PMC5011788",
            "pmid": "27597435",
            "type": [
                "Primary"
            ],
            "version": "1.0.0"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular evolution",
            "uri": "http://edamontology.org/topic_3945"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.2"
    ]
}
