
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Methylated DNA immunoprecipitation",
                "uri": "http://edamontology.org/topic_3674"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.DNA methyltransferases (DNMTs) are thought to be involved in the cellular response to DNA damage, thus linking DNA repair mechanisms with DNA methylation. In this study we present Homology Assisted Repair Dependent Epigenetic eNgineering (HARDEN), a novel method of targeted DNA methylation that utilizes endogenous DNA double strand break repair pathways. This method allows for stable targeted DNA methylation through the process of homology directed repair (HDR) via an in vitro methylated exogenous repair template. We demonstrate that HARDEN can be applied to the neurodegenerative disease genes C9orf72 and APP, and methylation can be induced via HDR with both single and double stranded methylated repair templates. HARDEN allows for higher targeted DNA methylation levels than a dCas9-DNMT3a fusion protein construct at C9orf72, and genome-wide methylation analysis reveals no significant off-target methylation changes when inducing methylation via HARDEN, whereas the dCas9-DNMT3a fusion construct causes global off-target methylation. HARDEN is applied to generate a patient derived iPSC model of amyotrophic lateral sclerosis and frontotemporal dementia (ALS/FTD) that recapitulates DNA methylation patterns seen in patients, demonstrating that DNA methylation of the 5' regulatory region directly reduces C9orf72 expression and increases histone H3K9 tri-methylation levels.",
            "authors": [
                "Cali C.P.",
                "Park D.S.",
                "Lee E.B."
            ],
            "cit_count": 0,
            "doi": "10.1093/NAR/GKZ979",
            "journal": "Nucleic acids research",
            "pmid": "31680172",
            "title": "Targeted DNA methylation of neurodegenerative disease genes via homology directed repair",
            "year": "2019-12-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:HARDEN",
        "biotoolsID": "HARDEN",
        "description": "Targeted DNA methylation of neurodegenerative disease genes via homology directed repair.\n\nDNA methyltransferases (DNMTs) are thought to be involved in the cellular response to DNA damage, thus linking DNA repair mechanisms with DNA methylation. In this study we present Homology Assisted Repair Dependent Epigenetic eNgineering (HARDEN), a novel method of targeted DNA methylation that utilizes endogenous DNA double strand break repair pathways. This method allows for stable targeted DNA methylation through the process of homology directed repair (HDR) via an in vitro methylated exogenous repair template. We demonstrate that HARDEN can be applied to the neurodegenerative disease genes C9orf72 and APP, and methylation can be induced via HDR with both single and double stranded methylated repair templates.\n\n||| HOMEPAGE MISSING!",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31680172",
        "name": "HARDEN"
    }
}