{
    "additionDate": "2019-11-14T19:43:31Z",
    "biotoolsCURIE": "biotools:OutbreakFinder",
    "biotoolsID": "OutbreakFinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chieh@imst.nsysu.edu.tw",
            "name": "Chih-Chieh Chen",
            "orcidid": "https://orcid.org/0000-0002-5844-8428",
            "typeEntity": "Person"
        }
    ],
    "description": "A visualization tool for rapid detection of bacterial strain clusters based on optimized multidimensional scaling | With the evolution of next generation sequencing (NGS) technologies, whole-genome sequencing of bacterial isolates is increasingly employed to investigate epidemiology. Phylogenetic analysis is the common method for using NGS data, usually for comparing closeness between bacterial isolates to detect probable outbreaks. However, interpreting a phylogenetic tree is not easy without training in evolutionary biology. Therefore, developing an easy-to-use tool that can assist people who wish to use a phylogenetic tree to investigate epidemiological relatedness is crucial",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                },
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://github.com/skypes/Newton-method-MDS",
    "lastUpdate": "2021-01-04T14:46:32Z",
    "name": "OutbreakFinder",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7600",
            "metadata": {
                "abstract": "© 2019 Tsai et al.With the evolution of next generation sequencing (NGS) technologies, wholegenome sequencing of bacterial isolates is increasingly employed to investigate epidemiology. Phylogenetic analysis is the common method for using NGS data, usually for comparing closeness between bacterial isolates to detect probable outbreaks. However, interpreting a phylogenetic tree is not easy without training in evolutionary biology. Therefore, developing an easy-to-use tool that can assist people who wish to use a phylogenetic tree to investigate epidemiological relatedness is crucial. In this paper, we present a tool called OutbreakFinder that can accept a distance matrix in csv format; alignment files from Lyve-SET, Parsnp, and ClustalOmega; and a tree file in Newick format as inputs to compute a cluster-labeled two-dimensional plot based on multidimensional-scaling dimension reduction coupled with affinity propagation clustering. OutbreakFinder can be downloaded for free at https://github.com/skypes/Newton-method-MDS.",
                "authors": [
                    {
                        "name": "Chen C.-C."
                    },
                    {
                        "name": "Liu Y.-Y."
                    },
                    {
                        "name": "Tsai M.-H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "OutbreakFinder: A visualization tool for rapid detection of bacterial strain clusters based on optimized multidimensional scaling"
            },
            "pmcid": "PMC6717506",
            "pmid": "31523522"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
