{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T11:17:57Z",
    "biotoolsCURIE": "biotools:prokevo",
    "biotoolsID": "prokevo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "abenson1@unl.edu",
            "name": "Andrew K. Benson",
            "typeEntity": "Person"
        },
        {
            "name": "Jitender S. Deogun"
        },
        {
            "name": "Joao Carlos Gomes-Neto"
        },
        {
            "name": "Natasha Pavlovikj"
        }
    ],
    "description": "An automated, reproducible, and scalable framework for high-throughput bacterial population genomics analyses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/npavlovikj/ProkEvo",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-05-17T20:54:31.689894Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/npavlovikj/ProkEvo"
        }
    ],
    "name": "ProkEvo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.7717/peerj.11376",
            "metadata": {
                "abstract": "© 2021 PeerJ Inc.. All rights reserved.Whole Genome Sequence (WGS) data from bacterial species is used for a variety of applications ranging from basic microbiological research, diagnostics, and epidemiological surveillance. The availability of WGS data from hundreds of thousands of individual isolates of individual microbial species poses a tremendous opportunity for discovery and hypothesis-generating research into ecology and evolution of these microorganisms. Flexibility, scalability, and user-friendliness of existing pipelines for population-scale inquiry, however, limit applications of systematic, population-scale approaches. Here, we present ProkEvo, an automated, scalable, reproducible, and open-source framework for bacterial population genomics analyses using WGS data. ProkEvo was specifically developed to achieve the following goals: (1) Automation and scaling of complex combinations of computational analyses for many thousands of bacterial genomes from inputs of raw Illumina paired-end sequence reads; (2) Use of workflow management systems (WMS) such as Pegasus WMS to ensure reproducibility, scalability, modularity, fault-tolerance, and robust file management throughout the process; (3) Use of high-performance and high-throughput computational platforms; (4) Generation of hierarchical-based population structure analysis based on combinations of multi-locus and Bayesian statistical approaches for classification for ecological and epidemiological inquiries; (5) Association of antimicrobial resistance (AMR) genes, putative virulence factors, and plasmids from curated databases with the hierarchically-related genotypic classifications; and (6) Production of pan-genome annotations and data compilation that can be utilized for downstream analysis such as identification of population-specific genomic signatures. The scalability of ProkEvo was measured with two datasets comprising significantly different numbers of input genomes (one with ∼2,400 genomes, and the second with ∼23,000 genomes). Depending on the dataset and the computational platform used, the running time of ProkEvo varied from ∼3-26 days. ProkEvo can be used with virtually any bacterial species, and the Pegasus WMS uniquely facilitates addition or removal of programs from the workflow or modification of options within them. To demonstrate versatility of the ProkEvo platform, we performed a hierarchical-based population structure analyses from available genomes of three distinct pathogenic bacterial species as individual case studies. The specific case studies illustrate how hierarchical analyses of population structures, genotype frequencies, and distribution of specific gene functions can be integrated into an analysis. Collectively, our study shows that ProkEvo presents a practical viable option for scalable, automated analyses of bacterial populations with direct applications for basic microbiology research, clinical microbiological diagnostics, and epidemiological surveillance.",
                "authors": [
                    {
                        "name": "Benson A.K."
                    },
                    {
                        "name": "Deogun J.S."
                    },
                    {
                        "name": "Gomes-Neto J.C."
                    },
                    {
                        "name": "Pavlovikj N."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "ProkEvo: An automated, reproducible, and scalable framework for high-throughput bacterial population genomics analyses"
            },
            "pmcid": "PMC8142932",
            "pmid": "34055480"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
