{
    "additionDate": "2020-01-14T19:43:01Z",
    "biotoolsCURIE": "biotools:QPN",
    "biotoolsID": "QPN",
    "confidence_flag": "tool",
    "description": "A Researcher-Patient Matching Platform and Multimodal Biorepository.\n\nWELCOME TO QUEBEC PARKINSON NETWORK.\n\nQuebec Parkinson Network now allows researchers, clinicians and patients to regroup. Promoting collaboration of different actors in the fight against Parkinson's disease, the Network wants to be the new leader of the research on the disease.\n\nSupport, act and help researchers and clinicians in the fight against Parkinson's disease by participating in research projects. For more information, visit the Participants section.\n\nCongress of the “Société Francophone Posture, Équilibre et Locomotion” (SOFPEL) – December 4 & 5, 2019",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://rpq-qpn.ca/en/",
    "lastUpdate": "2020-12-11T14:35:36Z",
    "name": "QPN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3233/JPD-191775",
            "metadata": {
                "abstract": "© 2020-IOS Press and the authors. All rights reserved.Background: Genetic, biologic and clinical data suggest that Parkinson's disease (PD) is an umbrella for multiple disorders with clinical and pathological overlap, yet with different underlying mechanisms. To better understand these and to move towards neuroprotective treatment, we have established the Quebec Parkinson Network (QPN), an open-access patient registry, and data and bio-samples repository. Objective: To present the QPN and to perform preliminary analysis of the QPN data. Methods: A total of 1,070 consecutively recruited PD patients were included in the analysis. Demographic and clinical data were analyzed, including comparisons between males and females, PD patients with and without RBD, and stratified analyses comparing early and late-onset PD and different age groups. Results: QPN patients exhibit a male:female ratio of 1.8:1, an average age-at-onset of 58.6 years, an age-at-diagnosis of 60.4 years, and average disease duration of 8.9 years. REM-sleep behavior disorder (RBD) was more common among men, and RBD was associated with other motor and non-motor symptoms including dyskinesia, fluctuations, postural hypotension and hallucinations. Older patients had significantly higher rates of constipation and cognitive impairment, and longer disease duration was associated with higher rates of dyskinesia, fluctuations, freezing of gait, falls, hallucinations and cognitive impairment. Since QPN's creation, over 60 studies and 30 publications have included patients and data from the QPN. Conclusions: The QPN cohort displays typical PD demographics and clinical features. These data are open-access upon application (http://rpq-qpn.ca/en/), and will soon include genetic, imaging and bio-samples. We encourage clinicians and researchers to perform studies using these resources.",
                "authors": [
                    {
                        "name": "Gan-Or Z."
                    },
                    {
                        "name": "Rao T."
                    },
                    {
                        "name": "Leveille E."
                    },
                    {
                        "name": "Degroot C."
                    },
                    {
                        "name": "Chouinard S."
                    },
                    {
                        "name": "Cicchetti F."
                    },
                    {
                        "name": "Dagher A."
                    },
                    {
                        "name": "Das S."
                    },
                    {
                        "name": "Desautels A."
                    },
                    {
                        "name": "Drouin-Ouellet J."
                    },
                    {
                        "name": "Durcan T."
                    },
                    {
                        "name": "Gagnon J.-F."
                    },
                    {
                        "name": "Genge A."
                    },
                    {
                        "name": "Karamchandani J."
                    },
                    {
                        "name": "Lafontaine A.-L."
                    },
                    {
                        "name": "Sun S.L.W."
                    },
                    {
                        "name": "Langlois M."
                    },
                    {
                        "name": "Levesque M."
                    },
                    {
                        "name": "Melmed C."
                    },
                    {
                        "name": "Panisset M."
                    },
                    {
                        "name": "Parent M."
                    },
                    {
                        "name": "Poline J.-B."
                    },
                    {
                        "name": "Postuma R.B."
                    },
                    {
                        "name": "Pourcher E."
                    },
                    {
                        "name": "Rouleau G.A."
                    },
                    {
                        "name": "Sharp M."
                    },
                    {
                        "name": "Monchi O."
                    },
                    {
                        "name": "Dupre N."
                    },
                    {
                        "name": "Fon E.A."
                    }
                ],
                "citationCount": 10,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Parkinson's Disease",
                "title": "The Quebec Parkinson Network: A Researcher-Patient Matching Platform and Multimodal Biorepository"
            },
            "pmid": "31868683"
        }
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}