{"credit":[{"email":"lgoff@csail.mit.edu","name":"Loyal A. Goff","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/cummeRbund.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/cummeRbund_2.16.0.tar.gz"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"},{"term":"Sequence visualisation","uri":"http://edamontology.org/operation_0564"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"Artistic-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"publication":[{"abstract":"Recent advances in high-throughput cDNA sequencing (RNA-seq) can reveal new genes and splice variants and quantify expression genome-wide in a single assay. The volume and complexity of data from RNA-seq experiments necessitate scalable, fast and mathematically principled analysis software. TopHat and Cufflinks are free, open-source software tools for gene discovery and comprehensive expression analysis of high-throughput mRNA sequencing (RNA-seq) data. Together, they allow biologists to identify new genes and new splice variants of known ones, as well as compare gene and transcript expression under two or more conditions. This protocol describes in detail how to use TopHat and Cufflinks to perform such analyses. It also covers several accessory tools and utilities that aid in managing data, including CummeRbund, a tool for visualizing RNA-seq analysis results. Although the procedure assumes basic informatics skills, these tools assume little to no background with RNA-seq analysis and are meant for novices and experts alike. The protocol begins with raw sequencing reads and produces a transcriptome assembly, lists of differentially expressed and regulated genes and transcripts, and publication-quality visualizations of analysis results. The protocol's execution time depends on the volume of transcriptome sequencing data and available computing resources but takes less than 1 d of computer time for typical experiments and ∼1 h of hands-on time. © 2012 Nature America, Inc. All rights reserved.","authors":["Trapnell C.","Roberts A.","Goff L.","Pertea G.","Kim D.","Kelley D.R.","Pimentel H.","Salzberg S.L.","Rinn J.L.","Pachter L."],"cit_count":45,"doi":"10.1038/nprot.2012.016","journal":"Nature Protocols","title":"Differential gene and transcript expression analysis of RNA-seq experiments with TopHat and Cufflinks","type":"Review","year":"2012-03-01"}],"summary":{"biotoolsCURIE":"biotools:cummerbund","biotoolsID":"cummerbund","description":"Allows for persistent storage, access, exploration, and manipulation of Cufflinks high-throughput sequencing data. In addition, provides numerous plotting functions for commonly used visualizations.","homepage":"http://bioconductor.org/packages/release/bioc/html/cummeRbund.html","name":"cummeRbund","version":["2.16.0"]}}