{
    "additionDate": "2020-01-14T19:45:59Z",
    "biotoolsCURIE": "biotools:Natural_Products_Atlas",
    "biotoolsID": "Natural_Products_Atlas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rliningt@sfu.ca",
            "name": "Roger G. Linington",
            "typeEntity": "Person"
        }
    ],
    "description": "An Open Access Knowledge Base for Microbial Natural Products Discovery.\n\nThe Natural Products Atlas Network views of chemical space.\n\nThe Natural Products Atlas provides a unique tools for exploring natural products chemical space, offering perspective on the position that any molecule occupies",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://www.npatlas.org",
    "lastUpdate": "2021-01-04T07:33:16Z",
    "name": "Natural Products Atlas",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSCENTSCI.9B00806",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Despite rapid evolution in the area of microbial natural products chemistry, there is currently no open access database containing all microbially produced natural product structures. Lack of availability of these data is preventing the implementation of new technologies in natural products science. Specifically, development of new computational strategies for compound characterization and identification are being hampered by the lack of a comprehensive database of known compounds against which to compare experimental data. The creation of an open access, community-maintained database of microbial natural product structures would enable the development of new technologies in natural products discovery and improve the interoperability of existing natural products data resources. However, these data are spread unevenly throughout the historical scientific literature, including both journal articles and international patents. These documents have no standard format, are often not digitized as machine readable text, and are not publicly available. Further, none of these documents have associated structure files (e.g., MOL, InChI, or SMILES), instead containing images of structures. This makes extraction and formatting of relevant natural products data a formidable challenge. Using a combination of manual curation and automated data mining approaches we have created a database of microbial natural products (The Natural Products Atlas, www.npatlas.org) that includes 24 594 compounds and contains referenced data for structure, compound names, source organisms, isolation references, total syntheses, and instances of structural reassignment. This database is accompanied by an interactive web portal that permits searching by structure, substructure, and physical properties. The Web site also provides mechanisms for visualizing natural products chemical space and dashboards for displaying author and discovery timeline data. These interactive tools offer a powerful knowledge base for natural products discovery with a central interface for structure and property-based searching and presents new viewpoints on structural diversity in natural products. The Natural Products Atlas has been developed under FAIR principles (Findable, Accessible, Interoperable, and Reusable) and is integrated with other emerging natural product databases, including the Minimum Information About a Biosynthetic Gene Cluster (MIBiG) repository, and the Global Natural Products Social Molecular Networking (GNPS) platform. It is designed as a community-supported resource to provide a central repository for known natural product structures from microorganisms and is the first comprehensive, open access resource of this type. It is expected that the Natural Products Atlas will enable the development of new natural products discovery modalities and accelerate the process of structural characterization for complex natural products libraries.",
                "authors": [
                    {
                        "name": "Van Santen J.A."
                    },
                    {
                        "name": "Jacob G."
                    },
                    {
                        "name": "Singh A.L."
                    },
                    {
                        "name": "Aniebok V."
                    },
                    {
                        "name": "Balunas M.J."
                    },
                    {
                        "name": "Bunsko D."
                    },
                    {
                        "name": "Neto F.C."
                    },
                    {
                        "name": "Castano-Espriu L."
                    },
                    {
                        "name": "Chang C."
                    },
                    {
                        "name": "Clark T.N."
                    },
                    {
                        "name": "Cleary Little J.L."
                    },
                    {
                        "name": "Delgadillo D.A."
                    },
                    {
                        "name": "Dorrestein P.C."
                    },
                    {
                        "name": "Duncan K.R."
                    },
                    {
                        "name": "Egan J.M."
                    },
                    {
                        "name": "Galey M.M."
                    },
                    {
                        "name": "Haeckl F.P.J."
                    },
                    {
                        "name": "Hua A."
                    },
                    {
                        "name": "Hughes A.H."
                    },
                    {
                        "name": "Iskakova D."
                    },
                    {
                        "name": "Khadilkar A."
                    },
                    {
                        "name": "Lee J.-H."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Legrow N."
                    },
                    {
                        "name": "Liu D.Y."
                    },
                    {
                        "name": "Macho J.M."
                    },
                    {
                        "name": "McCaughey C.S."
                    },
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "Neupane R.P."
                    },
                    {
                        "name": "O'Donnell T.J."
                    },
                    {
                        "name": "Paula J.S."
                    },
                    {
                        "name": "Sanchez L.M."
                    },
                    {
                        "name": "Shaikh A.F."
                    },
                    {
                        "name": "Soldatou S."
                    },
                    {
                        "name": "Terlouw B.R."
                    },
                    {
                        "name": "Tran T.A."
                    },
                    {
                        "name": "Valentine M."
                    },
                    {
                        "name": "Van Der Hooft J.J.J."
                    },
                    {
                        "name": "Vo D.A."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wilson D."
                    },
                    {
                        "name": "Zink K.E."
                    },
                    {
                        "name": "Linington R.G."
                    }
                ],
                "citationCount": 70,
                "date": "2019-11-27T00:00:00Z",
                "journal": "ACS Central Science",
                "title": "The Natural Products Atlas: An Open Access Knowledge Base for Microbial Natural Products Discovery"
            },
            "pmcid": "PMC6891855",
            "pmid": "31807684"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        }
    ],
    "validated": 1
}