{"credit":[{"name":"Damjana Rozman","typeEntity":"Person","typeRoles":["Developer"]},{"name":"Miha Mraz","typeEntity":"Person","typeRoles":["Developer"]},{"name":"Tanja Cvitanović","typeEntity":"Person","typeRoles":["Developer"]},{"name":"Miha Moškon","typeEntity":"Person","typeRoles":["Developer"]},{"name":"Adviti Naik","typeRoles":["Contributor"]},{"name":"Aleš Belič","typeRoles":["Contributor"]},{"name":"Faculty of Computer and Information Science, University of Ljubljana","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"ELIXIR-SI-hackathon","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"miha.moskon@fri.uni-lj.si","name":"Miha Moškon","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://lrss.fri.uni-lj.si/bio/personal/mmoskon.html"}],"documentation":[{"type":"GENERAL","url":"http://lrss.fri.uni-lj.si/bio/sysbio/documentation.html"}],"function":[{"operation":[{"term":"Metabolic network modelling","uri":"http://edamontology.org/operation_3660"}]}],"labels":{"cost":"Free of charge","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"}]},"publication":[{"abstract":"© 2014 Naik et al. Current state-of-the-art mathematical models to investigate complex biological processes, in particular liver-associated pathologies, have limited expansiveness, flexibility, representation of integrated regulation and rely on the availability of detailed kinetic data. We generated the SteatoNet, a multi-pathway, multi-tissue model and in silico platform to investigate hepatic metabolism and its associated deregulations. SteatoNet is based on object-oriented modelling, an approach most commonly applied in automotive and process industries, whereby individual objects correspond to functional entities. Objects were compiled to feature two novel hepatic modelling aspects: the interaction of hepatic metabolic pathways with extra-hepatic tissues and the inclusion of transcriptional and post-transcriptional regulation. SteatoNet identification at normalised steady state circumvents the need for constraining kinetic parameters. Validation and identification of flux disturbances that have been proven experimentally in liver patients and animal models highlights the ability of SteatoNet to effectively describe biological behaviour. SteatoNet identifies crucial pathway branches (transport of glucose, lipids and ketone bodies) where changes in flux distribution drive the healthy liver towards hepatic steatosis, the primary stage of non-alcoholic fatty liver disease. Cholesterol metabolism and its transcription regulators are highlighted as novel steatosis factors. SteatoNet thus serves as an intuitive in silico platform to identify systemic changes associated with complex hepatic metabolic disorders.","authors":["Naik A.","Rozman D.","Belic A."],"cit_count":8,"doi":"10.1371/journal.pcbi.1003993","journal":"PLoS Computational Biology","title":"SteatoNet: The First Integrated Human Metabolic Model with Multi-layered Regulation to Investigate Liver-Associated Pathologies","type":"Primary","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:sysbio_modelica_library","biotoolsID":"sysbio_modelica_library","description":"Library which implements basic systems biology objects within the modelica environment.","homepage":"http://lrss.fri.uni-lj.si/bio/sysbio","name":"SysBio modelica library","version":["1"]}}