{
    "additionDate": "2017-12-18T00:11:19Z",
    "biotoolsCURIE": "biotools:proteininfer",
    "biotoolsID": "proteininfer",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.ust.hk/"
        }
    ],
    "description": "ProteinInfer is a softwarr for combinatorial perspective of the protein inference problem",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.ust.hk/proteininfer/supplementary.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein inference",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.ust.hk/proteininfer/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-03-26T08:34:21Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/proteininfer-a-combinatorial-perspective-of-the-protein-inference-problem.html"
        }
    ],
    "name": "ProteinInfer",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1109/TCBB.2013.110",
            "metadata": {
                "abstract": "In a shotgun proteomics experiment, proteins are the most biologically meaningful output. The success of proteomics studies depends on the ability to accurately and efficiently identify proteins. Many methods have been proposed to facilitate the identification of proteins from peptide identification results. However, the relationship between protein identification and peptide identification has not been thoroughly explained before. In this paper, we devote ourselves to a combinatorial perspective of the protein inference problem. We employ combinatorial mathematics to calculate the conditional protein probabilities (protein probability means the probability that a protein is correctly identified) under three assumptions, which lead to a lower bound, an upper bound, and an empirical estimation of protein probabilities, respectively. The combinatorial perspective enables us to obtain an analytical expression for protein inference. Our method achieves comparable results with ProteinProphet in a more efficient manner in experiments on two data sets of standard protein mixtures and two data sets of real samples. Based on our model, we study the impact of unique peptides and degenerate peptides (degenerate peptides are peptides shared by at least two proteins) on protein probabilities. Meanwhile, we also study the relationship between our model and ProteinProphet. We name our program ProteinInfer. Its Java source code, our supplementary document and experimental results are available at: >http://bioinformatics. ust.hk/proteininfer. © 2013 IEEE.",
                "authors": [
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Yu W."
                    }
                ],
                "citationCount": 3,
                "date": "2013-11-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "A combinatorial perspective of the protein inference problem"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}