{
    "additionDate": "2017-08-03T18:57:40Z",
    "biotoolsCURIE": "biotools:red",
    "biotoolsID": "red",
    "credit": [
        {
            "email": "wubupt@foxmail.com",
            "name": "Di Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/herbiguncle"
        },
        {
            "name": "Xing Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/iluhcm"
        }
    ],
    "description": "This is a program to detect and visualize RNA editing events at genomic scale using next-generation sequencing data.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/REDetector/RED#documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://github.com/REDetector/RED",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/red-rna-editing-sites-detector.html"
        }
    ],
    "name": "RED",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Sunet al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. RNA editing is one of the post- or co-transcriptional procees that can lead to amino acid substitutions in protein sequences, alternative pre-mRNA splicing, and changes in gene expreion levels. Although several methods have been suggested to identify RNA editing sites, there remains challenges to be addreed in distinguishing true RNA editing sites from its counterparts on genome and technical artifacts. In addition, there lacks a software framework to identify and visualize potential RNA editing sites. Here, we presented a software - 'RED' (RNA Editing sites Detector) - for the identification of RNA editing sites by integrating multiple rule-based and statistical filters. The potential RNA editing sites can be visualized at the genome and the site levels by graphical user interface (GUI). To improve performance, we used MySQL database management system (DBMS) for high-throughput data storage and query. We demonstrated the validity and utility of RED by identifying the presence and absence of C!U RNA-editing sites experimentally validated, in comparison with REDItools, a command line tool to perform high-throughput investigation of RNA editing. In an analysis of a sample data-set with 28 experimentally validated C!U RNA editing sites, RED had sensitivity and specificity of 0.64 and 0.5. In comparison, REDItools had a better sensitivity (0.75) but similar specificity (0.5). RED is an easy-to-use, platform-independent Java-based software, and can be applied to RNA-seq data without or with DNA sequencing data. The package is freely available under the GPLv3 license at http://github. com/REDetector/RED or https://sourceforge.net/projects/redetector.",
                "authors": [
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wu D."
                    },
                    {
                        "name": "Pan Q."
                    },
                    {
                        "name": "Ji Y."
                    },
                    {
                        "name": "Ren H."
                    },
                    {
                        "name": "Ding K."
                    }
                ],
                "citationCount": 5,
                "date": "2016-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "RED: A Java-MySQL software for identifying and visualizing RNA editing sites using rule- based and statistical filters"
            },
            "pmid": "26930599"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}