
{
    "credit": [
        {
            "email": "shunichi.kosugi@riken.jp",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/projects/gmcloser/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffold gap completion",
                    "uri": "http://edamontology.org/operation_3217"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gmcloser-gmvalue-closing-the-gaps-in-scaffolds-with-preassembled-contigs.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Genome assemblies generated with next-generation sequencing (NGS) reads usually contain a number of gaps. Several tools have recently been developed to close the gaps in these assemblies with NGS reads. Although these gap-closing tools efficiently close the gaps, they entail a high rate of misassembly at gap-closing sites. Results: We have found that the assembly error rates caused by these tools are 20-500-fold higher than the rate of errors introduced into contigs by de novo assemblers. We here describe GMcloser, a tool that accurately closes these gaps with a preassembled contig set or a long read set (i.e. error-corrected PacBio reads). GMcloser uses likelihood-based classifiers calculated from the alignment statistics between scaffolds, contigs and paired-end reads to correctly assign contigs or long reads to gap regions of scaffolds, thereby achieving accurate and efficient gap closure. We demonstrate with sequencing data from various organisms that the gap-closing accuracy of GMcloser is 3-100-fold higher than those of other available tools, with similar efficiency.",
            "authors": [
                "Kosugi S.",
                "Hirakawa H.",
                "Tabata S."
            ],
            "cit_count": 14,
            "journal": "Bioinformatics",
            "pmid": "26261222",
            "title": "GMcloser: Closing gaps in assemblies accurately with a likelihood-based selection of contig or long-read alignments",
            "year": "2015-06-18"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gmcloser",
        "biotoolsID": "gmcloser",
        "description": "Fill and close the gaps present in scaffold assemblies, especially those generated by the de novo assembly of whole genomes with next-generation sequencing (NGS) reads.",
        "homepage": "http://sourceforge.net/projects/gmcloser/",
        "name": "GMcloser"
    }
}