{
    "additionDate": "2017-03-25T13:09:54Z",
    "biotoolsCURIE": "biotools:netaligner",
    "biotoolsID": "netaligner",
    "collectionID": [
        "Proteomics"
    ],
    "description": "Network alignment tool that allows the identification of conserved protein complexes and pathways across organisms. Predictions to fill missing interaction networks is based on likely conserved interactions based on evolutionary distance. Seven model organisms are included.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Protein interaction network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                }
            ]
        }
    ],
    "homepage": "http://netaligner.irbbarcelona.org/",
    "lastUpdate": "2019-03-26T08:28:08Z",
    "name": "NetAligner",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The many ongoing genome sequencing initiatives are delivering comprehensive lists of the individual molecular components present in an organism, but these reveal little about how they work together. Follow-up initiatives are revealing thousands of interrelationships between gene products that need to be analyzed with novel bioinformatics approaches able to capture their complex emerging properties. Recently, we developed NetAligner, a novel network alignment tool that allows the identification of conserved protein complexes and pathways across organisms, providing valuable hints as to how those interaction networks evolved. NetAligner includes the prediction of likely conserved interactions, based on evolutionary distances, to counter the high number of missing interactions in current interactome networks, and a fast assessment of the statistical significance of individual alignment solutions, which increases its performance with respect to existing tools. The web server implementation of the NetAligner algorithm presented here features complex, pathway and interactome to interactome alignments for seven model organisms, namely Homo sapiens, Mus musculus, Drosophila melanogaster, Caenorhabditis elegans, Arabidopsis thaliana, Saccharomyces cerevisiae and Escherichia coli. The user can query complexes and pathways of arbitrary topology against a target species interactome, or directly compare two complete interactomes to identify conserved complexes and subnetworks. Alignment solutions can be downloaded or directly visualized in the browser. The NetAligner web server is publicly available at http://netaligner.irbbarcelona.org/. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Aloy P."
                    },
                    {
                        "name": "Ceol A."
                    },
                    {
                        "name": "Pache R.A."
                    }
                ],
                "citationCount": 22,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NetAligner-a network alignment server to compare complexes, pathways and whole interactomes"
            },
            "pmid": "22618871"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
