{
    "additionDate": "2016-10-03T14:08:37Z",
    "biotoolsCURIE": "biotools:haddock",
    "biotoolsID": "haddock",
    "collectionID": [
        "BioExcel",
        "WeNMR",
        "WestLife",
        "EOSC-Hub",
        "INSTRUCT"
    ],
    "credit": [
        {
            "name": "University of Utrecht",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "http://www.uu.nl"
        },
        {
            "email": "a.m.j.j.bonvin@uu.nl",
            "name": "Bonvin Lab",
            "orcidid": "http://orcid.org/0000-0001-7369-1322",
            "typeEntity": "Institute",
            "typeRole": [
                "Developer",
                "Primary contact",
                "Maintainer",
                "Provider",
                "Support"
            ],
            "url": "http://www.bonvinlab.org"
        },
        {
            "name": "EGI",
            "typeEntity": "Consortium",
            "url": "https://www.egi.eu"
        },
        {
            "name": "European H2020 e-Infrastructure grant, West-Life VRE, grant no. 675858",
            "typeEntity": "Funding agency"
        },
        {
            "name": "European H2020 e-Infrastructure grant, INDICO-DataCloud, grant no. 653549",
            "typeEntity": "Funding agency"
        },
        {
            "name": "European H2020 e-Infrastructure grant, EGI-Engage, grant no. 654142",
            "typeEntity": "Funding agency"
        },
        {
            "name": "European H2020 e-Infrastructure grant, BioExcel, grant no. 675728",
            "typeEntity": "Funding agency"
        },
        {
            "name": "Netherlands Organization for Scientific Research (NWO), VICI grant no. 700.96.442",
            "typeEntity": "Funding agency"
        },
        {
            "name": "Netherlands Organization for Scientific Research (NWO) , TOP-PUNT grant no. 718.015.001",
            "typeEntity": "Funding agency"
        },
        {
            "name": "European H2020 e-Infrastructure grant, BioExcel, grant no. 823830",
            "typeEntity": "Funding agency"
        },
        {
            "name": "European H2020 e-Infrastructure grant, EOSC-Hub, grant no.777536",
            "typeEntity": "Funding agency"
        }
    ],
    "description": "High Ambiguity Driven biomolecular DOCKing: an information-driven flexible docking approach for the modeling of biomolecular complexes. It distinguishes itself from ab-initio docking methods in the fact that it encodes information from identified or predicted protein interfaces in ambiguous interaction restraints (AIRs) to drive the docking process. It can deal with a large class of modeling problems including protein-protein, protein-nucleic acids and protein-ligand complexes.",
    "documentation": [
        {
            "note": "Various tutorials describing the use of the HADDOCK server for various scenarios.; Tutorial",
            "type": [
                "Training material"
            ],
            "url": "http://www.bonvinlab.org/education/"
        },
        {
            "note": "Recording of a lecture of Prof. Bonvin at the CECAM BImMS 2019 workshop in Lugano (Oct. 7th, 2019)",
            "type": [
                "Training material"
            ],
            "url": "https://youtu.be/KUbEwGv21n8"
        },
        {
            "note": "HADDOCK2.2 online manual",
            "type": [
                "User manual"
            ],
            "url": "http://www.bonvinlab.org/software/haddock2.2/manual/"
        },
        {
            "note": "HADDOCK2.4 online manual",
            "type": [
                "User manual"
            ],
            "url": "http://www.bonvinlab.org/software/haddock2.4/manual/"
        },
        {
            "note": "BioExcel2020 summerschool - Integrative modelling lecture by Alexandre Bonvin",
            "type": [
                "Training material"
            ],
            "url": "https://www.youtube.com/watch?v=AULTBI3BqRY"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "http://www.bonvinlab.org/software/haddock2.4/download/",
            "version": "2.4"
        }
    ],
    "editPermission": {
        "authors": [
            "jdianes"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Netherlands"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://www.bonvinlab.org/software/haddock2.4/",
    "lastUpdate": "2020-07-13T15:28:52Z",
    "link": [
        {
            "note": "HADDOCK2.2 software page",
            "type": [
                "Repository"
            ],
            "url": "http://www.bonvinlab.org/software/haddock2.2"
        },
        {
            "note": "HADDOCK2.4 software page",
            "type": [
                "Repository"
            ],
            "url": "http://www.bonvinlab.org/software/haddock2.4"
        },
        {
            "note": "HADDOCK2.4 web server",
            "type": [
                "Service"
            ],
            "url": "https://wenmr.science.uu.nl/haddock2.4"
        },
        {
            "note": "HADDOCK forum",
            "type": [
                "Discussion forum"
            ],
            "url": "https://ask.bioexcel.eu/c/haddock"
        }
    ],
    "maturity": "Mature",
    "name": "HADDOCK",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "a.m.j.j.bonvin@uu.nl",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2015.09.014",
            "metadata": {
                "abstract": "© 2015 The Authors.The prediction of the quaternary structure of biomolecular macromolecules is of paramount importance for fundamental understanding of cellular processes and drug design. In the era of integrative structural biology, one way of increasing the accuracy of modeling methods used to predict the structure of biomolecular complexes is to include as much experimental or predictive information as possible in the process. This has been at the core of our information-driven docking approach HADDOCK. We present here the updated version 2.2 of the HADDOCK portal, which offers new features such as support for mixed molecule types, additional experimental restraints and improved protocols, all of this in a user-friendly interface. With well over 6000 registered users and 108,000 jobs served, an increasing fraction of which on grid resources, we hope that this timely upgrade will help the community to solve important biological questions and further advance the field. The HADDOCK2.2 Web server is freely accessible to non-profit users at http://haddock.science.uu.nl/services/HADDOCK2.2.",
                "authors": [
                    {
                        "name": "Van Zundert G.C.P."
                    },
                    {
                        "name": "Rodrigues J.P.G.L.M."
                    },
                    {
                        "name": "Trellet M."
                    },
                    {
                        "name": "Schmitz C."
                    },
                    {
                        "name": "Kastritis P.L."
                    },
                    {
                        "name": "Karaca E."
                    },
                    {
                        "name": "Melquiond A.S.J."
                    },
                    {
                        "name": "Van Dijk M."
                    },
                    {
                        "name": "De Vries S.J."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ],
                "citationCount": 653,
                "date": "2016-02-22T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "The HADDOCK2.2 Web Server: User-Friendly Integrative Modeling of Biomolecular Complexes"
            },
            "pmid": "26410586",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1021/ja026939x",
            "metadata": {
                "abstract": "The structure determination of protein-protein complexes is a rather tedious and lengthy process, by both NMR and X-ray crystallography. Several methods based on docking to study protein complexes have also been well developed over the past few years. Most of these approaches are not driven by experimental data but are based on a combination of energetics and shape complementarity. Here, we present an approach called HADDOCK (High Ambiguity Driven protein-protein Docking) that makes use of biochemical and/or biophysical interaction data such as chemical shift perturbation data resulting from NMR titration experiments or mutagenesis data. This information is introduced as Ambiguous Interaction Restraints (AIRs) to drive the docking process. An AIR is defined as an ambiguous distance between all residues shown to be involved in the interaction. The accuracy of our approach is demonstrated with three molecular complexes. For two of these complexes, for which both the complex and the free protein structures have been solved, NMR titration data were available. Mutagenesis data were used in the last example. In all cases, the best structures generated by HADDOCK, that is, the structures with the lowest intermolecular energies, were the closest to the published structure of the respective complexes (within 2.0 Å backbone RMSD).",
                "authors": [
                    {
                        "name": "Dominguez C."
                    },
                    {
                        "name": "Boelens R."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ],
                "citationCount": 1849,
                "date": "2003-02-15T00:00:00Z",
                "journal": "Journal of the American Chemical Society",
                "title": "HADDOCK: A protein-protein docking approach based on biochemical or biophysical information"
            },
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1016/j.str.2015.03.014",
            "metadata": {
                "abstract": "© 2015 Elsevier Ltd.Protein-protein interactions play a central role in all cellular processes. Insight into their atomic architecture is therefore of paramount importance. Cryo-electron microscopy (cryo-EM) is capable of directly imaging large macromolecular complexes. Unfortunately, the resolution is usually not sufficient for a direct atomic interpretation. To overcome this, cryo-EM data are often combined with high-resolution atomic structures. However, current computational approaches typically do not include information from other experimental sources nor a proper physico-chemical description of the interfaces. Here we describe the integration of cryo-EM data into our data-driven docking program HADDOCK and its performance on a benchmark of 17 complexes. The approach is demonstrated on five systems using experimental cryo-EM data in the range of 8.5-21 Å resolution. For several cases, cryo-EM data are integrated with additional interface information, e.g. mutagenesis and hydroxyl radical footprinting data. The resulting models have high-quality interfaces, revealing novel details of the interactions.",
                "authors": [
                    {
                        "name": "Van Zundert G.C.P."
                    },
                    {
                        "name": "Melquiond A.S.J."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ],
                "citationCount": 40,
                "date": "2015-05-05T00:00:00Z",
                "journal": "Structure",
                "title": "Integrative modeling of biomolecular complexes: HADDOCKing with Cryo-electron microscopy data"
            },
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1111/febs.12771",
            "metadata": {
                "abstract": "Protein interactions define the homeostatic state of the cell. Our ability to understand these interactions and their role in both health and disease is tied to our knowledge of the 3D atomic structure of the interacting partners and their complexes. Despite advances in experimental method of structure determination, the majority of known protein interactions are still missing an atomic structure. High-resolution methods such as X-ray crystallography and NMR spectroscopy struggle with the high-throughput demand, while low-resolution techniques such as cryo-electron microscopy or small-angle X-ray scattering provide data that are too coarse. Computational structure prediction of protein complexes, or docking, was first developed to complement experimental research and has since blossomed into an independent and lively field of research. Its most successful products are hybrid approaches that combine powerful algorithms with experimental data from various sources to generate high-resolution models of protein complexes. This minireview introduces the concept of docking and docking with the help of experimental data, compares and contrasts the available integrative docking methods, and provides a guide for the experimental researcher for what types of data and which particular software can be used to model a protein complex. © 2014 FEBS.",
                "authors": [
                    {
                        "name": "Rodrigues J.P.G.L.M."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ],
                "citationCount": 66,
                "date": "2014-01-01T00:00:00Z",
                "journal": "FEBS Journal",
                "title": "Integrative computational modeling of protein interactions"
            },
            "type": [
                "Review"
            ]
        },
        {
            "doi": "10.1016/j.yjsbx.2019.100006",
            "metadata": {
                "abstract": "© 2019 The Author(s)The West-Life project (https://about.west-life.eu/)is a Horizon 2020 project funded by the European Commission to provide data processing and data management services for the international community of structural biologists, and in particular to support integrative experimental approaches within the field of structural biology. It has developed enhancements to existing web services for structure solution and analysis, created new pipelines to link these services into more complex higher-level workflows, and added new data management facilities. Through this work it has striven to make the benefits of European e-Infrastructures more accessible to life-science researchers in general and structural biologists in particular.",
                "authors": [
                    {
                        "name": "Morris C."
                    },
                    {
                        "name": "Andreetto P."
                    },
                    {
                        "name": "Banci L."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    },
                    {
                        "name": "Chojnowski G."
                    },
                    {
                        "name": "Cano L.D."
                    },
                    {
                        "name": "Carazo J.M."
                    },
                    {
                        "name": "Conesa P."
                    },
                    {
                        "name": "Daenke S."
                    },
                    {
                        "name": "Damaskos G."
                    },
                    {
                        "name": "Giachetti A."
                    },
                    {
                        "name": "Haley N.E.C."
                    },
                    {
                        "name": "Hekkelman M.L."
                    },
                    {
                        "name": "Heuser P."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Kouril D."
                    },
                    {
                        "name": "Krenek A."
                    },
                    {
                        "name": "Kulhanek T."
                    },
                    {
                        "name": "Lamzin V.S."
                    },
                    {
                        "name": "Nadzirin N."
                    },
                    {
                        "name": "Perrakis A."
                    },
                    {
                        "name": "Rosato A."
                    },
                    {
                        "name": "Sanderson F."
                    },
                    {
                        "name": "Segura J."
                    },
                    {
                        "name": "Schaarschmidt J."
                    },
                    {
                        "name": "Sobolev E."
                    },
                    {
                        "name": "Traldi S."
                    },
                    {
                        "name": "Trellet M.E."
                    },
                    {
                        "name": "Velankar S."
                    },
                    {
                        "name": "Verlato M."
                    },
                    {
                        "name": "Winn M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Structural Biology: X",
                "title": "West-Life: A Virtual Research Environment for structural biology"
            },
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1007/s10723-012-9246-z",
            "metadata": {
                "abstract": "The WeNMR (http://www. wenmr. eu) project is a European Union funded international effort to streamline and automate analysis of Nuclear Magnetic Resonance (NMR) and Small Angle X-Ray scattering (SAXS) imaging data for atomic and near-atomic resolution molecular structures. Conventional calculation of structure requires the use of various software packages, considerable user expertise and ample computational resources. To facilitate the use of NMR spectroscopy and SAXS in life sciences the WeNMR consortium has established standard computational workflows and services through easy-to-use web interfaces, while still retaining sufficient flexibility to handle more specific requests. Thus far, a number of programs often used in structural biology have been made available through application portals. The implementation of these services, in particular the distribution of calculations to a Grid computing infrastructure, involves a novel mechanism for submission and handling of jobs that is independent of the type of job being run. With over 450 registered users (September 2012), WeNMR is currently the largest Virtual Organization (VO) in life sciences. With its large and worldwide user community, WeNMR has become the first Virtual Research Community officially recognized by the European Grid Infrastructure (EGI). © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Wassenaar T.A."
                    },
                    {
                        "name": "van Dijk M."
                    },
                    {
                        "name": "Loureiro-Ferreira N."
                    },
                    {
                        "name": "van der Schot G."
                    },
                    {
                        "name": "de Vries S.J."
                    },
                    {
                        "name": "Schmitz C."
                    },
                    {
                        "name": "van der Zwan J."
                    },
                    {
                        "name": "Boelens R."
                    },
                    {
                        "name": "Giachetti A."
                    },
                    {
                        "name": "Ferella L."
                    },
                    {
                        "name": "Rosato A."
                    },
                    {
                        "name": "Bertini I."
                    },
                    {
                        "name": "Herrmann T."
                    },
                    {
                        "name": "Jonker H.R.A."
                    },
                    {
                        "name": "Bagaria A."
                    },
                    {
                        "name": "Jaravine V."
                    },
                    {
                        "name": "Guntert P."
                    },
                    {
                        "name": "Schwalbe H."
                    },
                    {
                        "name": "Vranken W.F."
                    },
                    {
                        "name": "Doreleijers J.F."
                    },
                    {
                        "name": "Vriend G."
                    },
                    {
                        "name": "Vuister G.W."
                    },
                    {
                        "name": "Franke D."
                    },
                    {
                        "name": "Kikhney A."
                    },
                    {
                        "name": "Svergun D.I."
                    },
                    {
                        "name": "Fogh R.H."
                    },
                    {
                        "name": "Ionides J."
                    },
                    {
                        "name": "Laue E.D."
                    },
                    {
                        "name": "Spronk C."
                    },
                    {
                        "name": "Jurksa S."
                    },
                    {
                        "name": "Verlato M."
                    },
                    {
                        "name": "Badoer S."
                    },
                    {
                        "name": "Dal Pra S."
                    },
                    {
                        "name": "Mazzucato M."
                    },
                    {
                        "name": "Frizziero E."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ],
                "citationCount": 137,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Journal of Grid Computing",
                "title": "WeNMR: Structural Biology on the Grid"
            },
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1038/nprot.2010.32",
            "metadata": {
                "abstract": "Computational docking is the prediction or modeling of the three-dimensional structure of a biomolecular complex, starting from the structures of the individual molecules in their free, unbound form. HADDOC K is a popular docking program that takes a datadriven approach to docking, with support for a wide range of experimental data. Here we present the HADDOC K web server protocol, facilitating the modeling of biomolecular complexes for a wide community. The main web interface is user-friendly, requiring only the structures of the individual components and a list of interacting residues as input. Additional web interfaces allow the more advanced user to exploit the full range of experimental data supported by HADDOC K and to customize the docking process. The HADDOC K server has access to the resources of a dedicated cluster and of the e-NMR GRID infrastructure. Therefore, a typical docking run takes only a few minutes to prepare and a few hours to complete. © 2010 Nature Publishing Group.",
                "authors": [
                    {
                        "name": "De Vries S.J."
                    },
                    {
                        "name": "Van Dijk M."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ],
                "citationCount": 811,
                "date": "2010-04-15T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "The HADDOCK web server for data-driven biomolecular docking"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Web service",
        "Suite"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1,
    "version": [
        "2.2",
        "2.4"
    ]
}