{
    "name": "HADDOCK", 
    "description": "High Ambiguity Driven biomolecular DOCKing: an information-driven flexible docking approach for the modeling of biomolecular complexes. It distinguishes itself from ab-initio docking methods in the fact that it encodes information from identified or predicted protein interfaces in ambiguous interaction restraints (AIRs) to drive the docking process. It can deal with a large class of modeling problems including protein-protein, protein-nucleic acids and protein-ligand complexes.", 
    "homepage": "http://www.bonvinlab.org/software/haddock2.2/", 
    "biotoolsID": "haddock", 
    "biotoolsCURIE": "biotools:haddock", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0478", 
                    "term": "Molecular docking"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application", 
        "Web service", 
        "Suite"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0128", 
            "term": "Protein interactions"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [
        "BioExcel"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/haddock-2-1-docking-approach-for-the-modeling-of-biomolecular-complexes.html", 
            "type": "Registry", 
            "note": null
        }, 
        {
            "url": "http://www.bonvinlab.org/software/", 
            "type": "Repository", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.bonvinlab.org/education/", 
            "type": "Training material", 
            "note": null
        }, 
        {
            "url": "http://www.bonvinlab.org/education/HADDOCK-protein-protein-basic/", 
            "type": "Other", 
            "note": null
        }, 
        {
            "url": "http://www.bonvinlab.org/software/haddock2.2/manual/", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.jmb.2015.09.014", 
            "pmid": "26410586", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "The HADDOCK2.2 Web Server: User-Friendly Integrative Modeling of Biomolecular Complexes", 
                "abstract": "© 2015 The Authors. The prediction of the quaternary structure of biomolecular macromolecules is of paramount importance for fundamental understanding of cellular processes and drug design. In the era of integrative structural biology, one way of increasing the accuracy of modeling methods used to predict the structure of biomolecular complexes is to include as much experimental or predictive information as possible in the process. This has been at the core of our information-driven docking approach HADDOCK. We present here the updated version 2.2 of the HADDOCK portal, which offers new features such as support for mixed molecule types, additional experimental restraints and improved protocols, all of this in a user-friendly interface. With well over 6000 registered users and 108,000 jobs served, an increasing fraction of which on grid resources, we hope that this timely upgrade will help the community to solve important biological questions and further advance the field. The HADDOCK2.2 Web server is freely accessible to non-profit users at http://haddock.science.uu.nl/services/HADDOCK2.2.", 
                "date": "2016-02-22T00:00:00Z", 
                "citationCount": 232, 
                "authors": [
                    {
                        "name": "Van Zundert G.C.P."
                    }, 
                    {
                        "name": "Rodrigues J.P.G.L.M."
                    }, 
                    {
                        "name": "Trellet M."
                    }, 
                    {
                        "name": "Schmitz C."
                    }, 
                    {
                        "name": "Kastritis P.L."
                    }, 
                    {
                        "name": "Karaca E."
                    }, 
                    {
                        "name": "Melquiond A.S.J."
                    }, 
                    {
                        "name": "Van Dijk M."
                    }, 
                    {
                        "name": "De Vries S.J."
                    }, 
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ], 
                "journal": "Journal of Molecular Biology"
            }
        }, 
        {
            "doi": "10.1021/ja026939x", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "HADDOCK: A protein-protein docking approach based on biochemical or biophysical information", 
                "abstract": "The structure determination of protein-protein complexes is a rather tedious and lengthy process, by both NMR and X-ray crystallography. Several methods based on docking to study protein complexes have also been well developed over the past few years. Most of these approaches are not driven by experimental data but are based on a combination of energetics and shape complementarity. Here, we present an approach called HADDOCK (High Ambiguity Driven protein-protein Docking) that makes use of biochemical and/or biophysical interaction data such as chemical shift perturbation data resulting from NMR titration experiments or mutagenesis data. This information is introduced as Ambiguous Interaction Restraints (AIRs) to drive the docking process. An AIR is defined as an ambiguous distance between all residues shown to be involved in the interaction. The accuracy of our approach is demonstrated with three molecular complexes. For two of these complexes, for which both the complex and the free protein structures have been solved, NMR titration data were available. Mutagenesis data were used in the last example. In all cases, the best structures generated by HADDOCK, that is, the structures with the lowest intermolecular energies, were the closest to the published structure of the respective complexes (within 2.0 Å backbone RMSD).", 
                "date": "2003-02-15T00:00:00Z", 
                "citationCount": 1557, 
                "authors": [
                    {
                        "name": "Dominguez C."
                    }, 
                    {
                        "name": "Boelens R."
                    }, 
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ], 
                "journal": "Journal of the American Chemical Society"
            }
        }
    ], 
    "credit": [
        {
            "name": "University of Utrech", 
            "email": null, 
            "url": "http://www.uu.nl/organisatie/contact", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Bonvin Lab", 
            "email": "a.m.j.j.bonvin@uu.nl", 
            "url": "http://www.bonvinlab.org", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "jdianes", 
    "additionDate": "2016-10-03T14:08:37Z", 
    "lastUpdate": "2018-12-10T12:58:42Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "adam.hospital@irbbarcelona.org"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}