{
    "additionDate": "2021-01-18T07:01:36Z",
    "biotoolsCURIE": "biotools:dcn",
    "biotoolsID": "dcn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qdong@luc.edu",
            "name": "Qunfeng Dong",
            "typeEntity": "Person"
        }
    ],
    "description": "Disease Correlation Network (DCN) Analyser is a pipeline of disease correlation analysis with retrospective matched cohort study design using Cox Proportional Hazards (Cox-PH) regression in combination of interactive network display using graph theory.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qunfengdong/DCN",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-22T15:46:55Z",
    "name": "DCN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/JAMIAOPEN/OOZ031",
            "metadata": {
                "abstract": "© The Author 2019.Objective: To provide an open-source software package for determining temporal correlations between disease states using longitudinal electronic medical records (EMR). Materials and Methods: We have developed an R-based package, Disease Correlation Network (DCN), which builds retrospective matched cohorts from longitudinal medical records to assess for significant temporal correlations between diseases using two independent methodologies: Cox proportional hazards regression and random forest survival analysis. This optimizable package has the potential to control for relevant confounding factors such as age, gender, and other demographic and medical characteristics. Output is presented as a DCN which may be analyzed using a JavaScript-based interactive visualization tool for users to explore statistically significant correlations between disease states of interest using graph-theory-based network topology. Results: We have applied this package to a longitudinal dataset at Loyola University Chicago Medical Center with 654 084 distinct initial diagnoses of 51 conditions in 175 539 patients. Over 90% of disease correlations identified are supported by literature review. DCN is available for download at https://github.com/qunfengdong/DCN. Conclusions: DCN allows screening of EMR data to identify potential relationships between chronic disease states. This data may then be used to formulate novel research hypotheses for further characterization of these relationships.",
                "authors": [
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Rong R."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Revanna K."
                    },
                    {
                        "name": "Zhao M."
                    },
                    {
                        "name": "Bajic P."
                    },
                    {
                        "name": "Jin D."
                    },
                    {
                        "name": "Hu C."
                    },
                    {
                        "name": "Dong Q."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "Disease correlation network: A computational package for identifying temporal correlations between disease states from Large-Scale longitudinal medical records"
            },
            "pmcid": "PMC6952009",
            "pmid": "31984368"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}