{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T22:24:12.248346Z",
    "biotoolsCURIE": "biotools:alignstein",
    "biotoolsID": "alignstein",
    "cost": "Free of charge",
    "description": "LC-MS alignment algorithm based on Wasserstein distance.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/grzsko/Alignstein",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:21:46.157922Z",
    "license": "MIT",
    "maturity": "Emerging",
    "name": "Alignstein",
    "owner": "grzsko",
    "publication": [
        {
            "doi": "10.1093/gigascience/giac101",
            "metadata": {
                "abstract": "Background: Reproducibility of liquid chromatography separation is limited by retention time drift. As a result, measured signals lack correspondence over replicates of the liquid chromatography-mass spectrometry (LC-MS) experiments. Correction of these errors is named retention time alignment and needs to be performed before further quantitative analysis. Despite the availability of numerous alignment algorithms, their accuracy is limited (e.g., for retention time drift that swaps analytes' elution order). Results: We present the Alignstein, an algorithm for LC-MS retention time alignment. It correctly finds correspondence even for swapped signals. To achieve this, we implemented the generalization of the Wasserstein distance to compare multidimensional features without any reduction of the information or dimension of the analyzed data. Moreover, Alignstein by design requires neither a reference sample nor prior signal identification. We validate the algorithm on publicly available benchmark datasets obtaining competitive results. Finally, we show that it can detect the information contained in the tandem mass spectrum by the spatial properties of chromatograms. Conclusions: We show that the use of optimal transport effectively overcomes the limitations of existing algorithms for statistical analysis of mass spectrometry datasets. The algorithm's source code is available at https://github.com/grzsko/Alignstein.",
                "authors": [
                    {
                        "name": "Gambin A."
                    },
                    {
                        "name": "Miasojedow Bl."
                    },
                    {
                        "name": "Skoraczynski G."
                    }
                ],
                "citationCount": 5,
                "date": "2022-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Alignstein: Optimal transport for improved LC-MS retention time alignment"
            },
            "pmcid": "PMC9633278",
            "pmid": "36329619"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "version": [
        "1.0"
    ]
}
