{
    "additionDate": "2021-01-18T12:35:41Z",
    "biotoolsCURIE": "biotools:thresholdnet",
    "biotoolsID": "thresholdnet",
    "confidence_flag": "tool",
    "description": "ThresholdNet with Confidence-Guided Manifold Mixup for Polyp Segmentation.\n\nThe automatic segmentation of polyp in endoscopy images is crucial for early diagnosis and cure of colorectal cancer. Existing deep learning-based methods for polyp segmentation, however, are inadequate due to the limited annotated dataset and the class imbalance problems. Moreover, these methods obtained the final polyp segmentation results by simply thresholding the likelihood maps at an eclectic and equivalent value (often set to 0.5). In this paper, we propose a novel ThresholdNet with a confidence-guided manifold mixup (CGMMix) data augmentation method, mainly for addressing the aforementioned issues in polyp segmentation. The CGMMix conducts manifold mixup at the image and feature levels, and adaptively lures the decision boundary away from the under-represented polyp class with the confidence guidance to alleviate the limited training dataset and the class imbalance problems",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Guo-Xiaoqing/ThresholdNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T09:25:36Z",
    "license": "MIT",
    "name": "ThresholdNet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TMI.2020.3046843",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.The automatic segmentation of polyp in endoscopy images is crucial for early diagnosis and cure of colorectal cancer. Existing deep learning-based methods for polyp segmentation, however, are inadequate due to the limited annotated dataset and the class imbalance problems. Moreover, these methods obtained the final polyp segmentation results by simply thresholding the likelihood maps at an eclectic and equivalent value (often set to 0.5). In this paper, we propose a novel ThresholdNet with a confidence-guided manifold mixup (CGMMix) data augmentation method, mainly for addressing the aforementioned issues in polyp segmentation. The CGMMix conducts manifold mixup at the image and feature levels, and adaptively lures the decision boundary away from the under-represented polyp class with the confidence guidance to alleviate the limited training dataset and the class imbalance problems. Two consistency regularizations, mixup feature map consistency (MFMC) loss and mixup confidence map consistency (MCMC) loss, are devised to exploit the consistent constraints in the training of the augmented mixup data. We then propose a two-branch approach, termed ThresholdNet, to collaborate the segmentation and threshold learning in an alternative training strategy. The threshold map supervision generator (TMSG) is embedded to provide supervision for the threshold map, thereby inducing better optimization of the threshold branch. As a consequence, ThresholdNet is able to calibrate the segmentation result with the learned threshold map. We illustrate the effectiveness of the proposed method on two polyp segmentation datasets, and our methods achieved the state-of-the-art result with 87.307% and 87.879% dice score on the EndoScene dataset and the WCE polyp dataset. The source code is available at https://github.com/Guo-Xiaoqing/ThresholdNet.",
                "authors": [
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Learn to Threshold: ThresholdNet with Confidence-Guided Manifold Mixup for Polyp Segmentation"
            },
            "pmid": "33360986"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
