{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:10:49Z",
    "biotoolsCURIE": "biotools:Muscle_Gene_Sets",
    "biotoolsID": "Muscle_Gene_Sets",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "w.duddy@ulster.ac.uk",
            "name": "William Duddy",
            "orcidid": "https://orcid.org/0000-0003-2239-9094",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Versatile methodological aid to functional genomics in the neuromuscular field.",
    "download": [
        {
            "type": "Biological data",
            "url": "https://www.sys-myo.com/muscle_gene_sets/downloads/MuscleGeneSets_v3_FINAL1517.gmt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.sys-myo.com/muscle_gene_sets",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "Muscle Gene Sets",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S13395-019-0196-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The approach of building large collections of gene sets and then systematically testing hypotheses across these collections is a powerful tool in functional genomics, both in the pathway analysis of omics data and to uncover the polygenic effects associated with complex diseases in genome-wide association study. The Molecular Signatures Database includes collections of oncogenic and immunologic signatures enabling researchers to compare transcriptional datasets across hundreds of previous studies and leading to important insights in these fields, but such a resource does not currently exist for neuromuscular research. In previous work, we have shown the utility of gene set approaches to understand muscle cell physiology and pathology. Methods: Following a systematic survey of public muscle data, we passed gene expression profiles from 4305 samples through a robust pre-processing and standardized data analysis pipeline. Two hundred eighty-two samples were discarded based on a battery of rigorous global quality controls. From among the remaining studies, 578 comparisons of interest were identified by a combination of text mining and manual curation of the study meta-data. For each comparison, significantly dysregulated genes (FDR adjusted p < 0.05) were identified. Results: Lists of dysregulated genes were divided between upregulated and downregulated to give 1156 Muscle Gene Sets (MGS). This resource is available for download (www.sys-myo.com/muscle-gene-sets) and is accessible through three commonly used functional genomics platforms (GSEA, EnrichR, and WebGestalt). Basic guidance and recommendations are provided for the use of MGS through these platforms. In addition, consensus muscle gene sets were created to capture the overlap between the results of similar studies, and analysis of these highlighted the potential for novel disease-relevant findings. Conclusions: The MGS resource can be used to investigate the behaviour of any list of genes across previous comparisons of muscle conditions, to compare previous studies to one another, and to explore the functional relationship of muscle dysregulation to the Gene Ontology. Its major intended use is in enrichment testing for functional genomics analysis.",
                "authors": [
                    {
                        "name": "Malatras A."
                    },
                    {
                        "name": "Duguez S."
                    },
                    {
                        "name": "Duddy W."
                    }
                ],
                "citationCount": 3,
                "date": "2019-05-03T00:00:00Z",
                "journal": "Skeletal Muscle",
                "title": "Muscle Gene Sets: A versatile methodological aid to functional genomics in the neuromuscular field"
            },
            "pmcid": "PMC6498474",
            "pmid": "31053169",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}