{
    "additionDate": "2017-08-03T18:46:45Z",
    "biotoolsCURIE": "biotools:ice",
    "biotoolsID": "ice",
    "credit": [
        {
            "name": "Hector Plahar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/hplahar"
        }
    ],
    "description": "Cloud-based freely open-source DNA part, plasmid, microbial strain, and Arabidopsis seed repository with physical sample tracking capabilities.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://ice.jbei.org/install/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JBEI/ice",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ice-4-5-3-biological-part-registry-platform-and-tools.html"
        }
    ],
    "name": "ICE",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The Joint BioEnergy Institute Inventory of Composable Elements (JBEI-ICEs) is an open source registry platform for managing information about biological parts. It is capable of recording information about 'legacy' parts, such as plasmids, microbial host strains and Arabidopsis seeds, as well as DNA parts in various assembly standards. ICE is built on the idea of a web of registries and thus provides strong support for distributed interconnected use. The information deposited in an ICE installation instance is accessible both via a web browser and through the web application programming interfaces, which allows automated access to parts via third-party programs. JBEI-ICE includes several useful web browser-based graphical applications for sequence annotation, manipulation and analysis that are also open source. As with open source software, users are encouraged to install, use and customize JBEI-ICE and its components for their particular purposes. As a web application programming interface, ICE provides well-developed parts storage functionality for other synthetic biology software projects. A public instance is available at public-registry.jbei.org, where users can try out features, upload parts or simply use it for their projects. The ICE software suite is available via Google Code, a hosting site for community-driven open source projects. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Ham T.S."
                    },
                    {
                        "name": "Dmytriv Z."
                    },
                    {
                        "name": "Plahar H."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Hillson N.J."
                    },
                    {
                        "name": "Keasling J.D."
                    }
                ],
                "citationCount": 89,
                "date": "2012-10-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Design, implementation and practice of JBEI-ICE: An open source biological part registry platform and tools"
            },
            "pmid": "22718978"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Microbial collection",
            "uri": "http://edamontology.org/topic_3339"
        }
    ],
    "validated": 1
}