{
    "additionDate": "2021-01-18T09:36:30Z",
    "biotoolsCURIE": "biotools:drymass",
    "biotoolsID": "drymass",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paul.mueller@mpl.mpg.de",
            "name": "Paul Müller",
            "orcidid": "https://orcid.org/0000-0002-5734-3130",
            "typeEntity": "Person"
        }
    ],
    "description": "DryMass is a Python library and a command-line tool for manipulating and analyzing quantitative phase microscopy images of cell-sized objects.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://drymass.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RI-imaging/DryMass",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-03T19:59:26Z",
    "license": "MIT",
    "name": "DryMass",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03553-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Quantitative phase imaging (QPI) is an established tool for the marker-free classification and quantitative characterization of biological samples. For spherical objects, such as cells in suspension, microgel beads, or liquid droplets, a single QPI image is sufficient to extract the radius and the average refractive index. This technique is invaluable, as it allows the characterization of large sample populations at high measurement rates. However, until now, no universal software existed that could perform this type of analysis. Besides the choice of imaging modality and the variety in imaging software, the main difficulty has been to automate the entire analysis pipeline from raw data to ensemble statistics. Results: We present DryMass, a powerful tool for QPI that covers all relevant steps from loading experimental data (multiple file formats supported), computing the phase data (built-in, automated hologram analysis), performing phase background corrections (offset, tilt, second order polynomial) to fitting scattering models (light projection, Rytov approximation, Mie simulations) to spherical phase objects for the extraction of dry mass, radius, and average refractive index. The major contribution of DryMass is a user-convenient, reliable, reproducible, and automated analysis pipeline for an arbitrary number of QPI datasets of arbitrary sizes. Conclusion: DryMass is a leap forward for data analysis in QPI, as it not only makes it easier to visualize raw QPI data and reproduce previous results in the field, but it also opens up QPI analysis to users without a background in programming or phase imaging.",
                "authors": [
                    {
                        "name": "Muller P."
                    },
                    {
                        "name": "Cojoc G."
                    },
                    {
                        "name": "Guck J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DryMass: Handling and analyzing quantitative phase microscopy images of spherical, cell-sized objects"
            },
            "pmcid": "PMC7268593",
            "pmid": "32493205"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}