{
    "additionDate": "2020-01-14T19:57:15Z",
    "biotoolsCURIE": "biotools:pQCT",
    "biotoolsID": "pQCT",
    "confidence_flag": "tool",
    "description": "pQCT is a tool for identifying and assessing Inter-Muscular Fat at the Distal Diaphyseal Femur Measured by Peripheral Quantitative Computed Tomography (pQCT).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tjrantal/pQCT",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-13T17:14:23Z",
    "license": "BSD-2-Clause",
    "name": "pQCT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JOCD.2019.11.001",
            "metadata": {
                "abstract": "© 2019 The International Society for Clinical DensitometryIntroduction: Inter-/intramuscular fat can be assessed with peripheral Quantitative Computed Tomography (pQCT) and is of interest as an indicator of “muscle quality.” Typical pQCT scan sites (forearm, lower leg) have a low amount of inter-/intramuscular fat, however distal diaphyseal femur scan sites with conspicuous inter-/intramuscular fat have been identified as potentially more prudent scan sites, even in healthy adolescents. However, current state of the art analysis methods require labor-intensive manual segmentation of the scan. The purpose of the present study was to evaluate the reliability of a novel open source automated enclosing convex polygon approach (source code https://github.com/tjrantal/pQCT, commit cec9bce) to quantify inter-/intramuscular fat from femoral pQCT scans in healthy adults. Methodology: The distal diaphyseal femur (25% of tibial length from the knee joint towards the hip) of 27 adults aged 18–50 yr were scanned twice, 1 wk apart, using pQCT. Subcutaneous fat, muscle, inter-/intramuscular fat, and marrow areas, and corresponding densities were evaluated using a method we have reported previously, as well as the novel enclosing convex polygon method. Results: The session-to-session reliability of the assessments was fair to excellent using the previously reported method as indicated by intraclass correlation coefficient (ICC2,1) ranging from 0.45 to 1.00, while the novel method produced excellent reliability (ICC2,1 0.78–1.00). Conclusion: Distal diaphyseal femur appears to be a potentially informative and prudent scan site for inter-/intramuscular fat evaluation with pQCT.",
                "authors": [
                    {
                        "name": "Hart N.H."
                    },
                    {
                        "name": "Hendy A.M."
                    },
                    {
                        "name": "Lamon S."
                    },
                    {
                        "name": "Latella C."
                    },
                    {
                        "name": "Owen P.J."
                    },
                    {
                        "name": "Rantalainen T."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Clinical Densitometry",
                "title": "Identifying and Assessing Inter-Muscular Fat at the Distal Diaphyseal Femur Measured by Peripheral Quantitative Computed Tomography (pQCT)"
            },
            "pmid": "31848038"
        }
    ],
    "topic": [
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
