{
    "accessibility": "Open access",
    "additionDate": "2019-05-29T09:21:55Z",
    "biotoolsCURIE": "biotools:Barnaba",
    "biotoolsID": "Barnaba",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Small RNAs in silico",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.srnas.sissa.it/"
        }
    ],
    "description": "Software for analysis of nucleic acid structures and trajectories.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure comparison",
                    "uri": "http://edamontology.org/operation_2518"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Nucleic acid folding analysis",
                    "uri": "http://edamontology.org/operation_0279"
                }
            ]
        }
    ],
    "homepage": "https://github.com/srnas/barnaba",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Barnaba",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1261/rna.067678.118",
            "metadata": {
                "abstract": "© 2019 Bottaro et al. This article is distributed exclusively by the RNA Society for the first 12 months after the full-issue publication dateRNA molecules are highly dynamic systems characterized by a complex interplay between sequence, structure, dynamics, and function. Molecular simulations can potentially provide powerful insights into the nature of these relationships. The analysis of structures and molecular trajectories of nucleic acids can be nontrivial because it requires processing very high-dimensional data that are not easy to visualize and interpret. Here we introduce Barnaba, a Python library aimed at facilitating the analysis of nucleic acid structures and molecular simulations. The software consists of a variety of analysis tools that allow the user to (i) calculate distances between three-dimensional structures using different metrics, (ii) back-calculate experimental data from three-dimensional structures, (iii) perform cluster analysis and dimensionality reductions, (iv) search three-dimensional motifs in PDB structures and trajectories, and (v) construct elastic network models for nucleic acids and nucleic acids–protein complexes. In addition, Barnaba makes it possible to calculate torsion angles, pucker conformations, and to detect base-pairing/base-stacking interactions. Barnaba produces graphics that conveniently visualize both extended secondary structure and dynamics for a set of molecular conformations. The software is available as a command-line tool as well as a library, and supports a variety of file formats such as PDB, dcd, and xtc files. Source code, documentation, and examples are freely available at https://github.com/srnas/barnaba under GNU GPLv3 license.",
                "authors": [
                    {
                        "name": "Bottaro S."
                    },
                    {
                        "name": "Bussi G."
                    },
                    {
                        "name": "Pinamonti G."
                    },
                    {
                        "name": "Reiber S."
                    },
                    {
                        "name": "Boomsma W."
                    },
                    {
                        "name": "Lindorff-Larsen K."
                    }
                ],
                "citationCount": 15,
                "date": "2019-02-01T00:00:00Z",
                "journal": "RNA",
                "title": "Barnaba: software for analysis of nucleic acid structures and trajectories"
            },
            "pmid": "30420522",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}