
{
    "credit": [
        {
            "email": "douglasm@illinois.edu",
            "name": "Prof. Douglas Mitchell",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.scs.illinois.edu/mitchell/contact.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ripprodeo.org/advanced.html"
        },
        {
            "url": "http://www.ripprodeo.org/manual.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein expression",
                "uri": "http://edamontology.org/topic_0108"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Nature America, Inc., part of Springer Nature. Ribosomally synthesized and post-translationally modified peptide (RiPP) natural products are attractive for genome-driven discovery and re-engineering, but limitations in bioinformatic methods and exponentially increasing genomic data make large-scale mining of RiPP data difficult. We report RODEO (Rapid ORF Description and Evaluation Online), which combines hidden-Markov-model-based analysis, heuristic scoring, and machine learning to identify biosynthetic gene clusters and predict RiPP precursor peptides. We initially focused on lasso peptides, which display intriguing physicochemical properties and bioactivities, but their hypervariability renders them challenging prospects for automated mining. Our approach yielded the most comprehensive mapping to date of lasso peptide space, revealing >1,300 compounds. We characterized the structures and bioactivities of six lasso peptides, prioritized based on predicted structural novelty, including one with an unprecedented handcuff-like topology and another with a citrulline modification exceptionally rare among bacteria. These combined insights significantly expand the knowledge of lasso peptides and, more broadly, provide a framework for future genome-mining efforts.",
            "authors": [
                "Tietz J.I.",
                "Schwalen C.J.",
                "Patel P.S.",
                "Maxson T.",
                "Blair P.M.",
                "Tai H.-C.",
                "Zakai U.I.",
                "Mitchell D.A."
            ],
            "cit_count": 48,
            "doi": "10.1038/nchembio.2319",
            "journal": "Nature Chemical Biology",
            "title": "A new genome-mining tool redefines the lasso peptide biosynthetic landscape",
            "year": "2017-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rodeo",
        "biotoolsID": "rodeo",
        "description": "Rapid ORF Description & Evaluation Online- an algorithm to help biosynthetic gene cluster (BGC) analysis, with an emphasis on ribosomal natural product (RiPP) discovery.",
        "homepage": "http://www.ripprodeo.org/advanced.html",
        "name": "RODEO"
    }
}