{
    "accessibility": "Open access",
    "additionDate": "2019-05-31T12:21:28Z",
    "biotoolsCURIE": "biotools:RADProc",
    "biotoolsID": "RADProc",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dr. Beiko's Lab",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://kiwi.cs.dal.ca/~beiko/"
        }
    ],
    "description": "Computationally efficient de novo locus assembler for population studies using RADseq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/beiko-lab/RADProc",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "RADProc",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1111/1755-0998.12954",
            "metadata": {
                "abstract": "© 2018 John Wiley & Sons LtdRestriction site-associated DNA sequencing (RADseq) is a powerful tool for genotyping of individuals, but the identification of loci and assignment of sequence reads is a crucial and often challenging step. The optimal parameter settings for a given de novo RADseq assembly vary between data sets and can be difficult and computationally expensive to determine. Here, we introduce RADProc, a software package that uses a graph data structure to represent all sequence reads and their similarity relationships. Storing sequence–comparison results in a graph eliminates unnecessary and redundant sequence similarity calculations. De novo locus formation for a given parameter set can be performed on the precomputed graph, making parameter sweeps far more efficient. RADProc also uses a clustering approach for faster nucleotide-distance calculation. The performance of RADProc compares favourably with that of the widely used Stacks software. The run-time comparisons between RADProc and Stacks for 32 different parameter settings using 20 green-crab (Carcinus maenas) samples showed that RADProc took as little as 2 hr 40 min compared to 78 hr by Stacks, while 16 brown trout (Salmo trutta L.) samples were processed by RADProc and Stacks in 23 and 263 hr, respectively. Comparisons of the de novo loci formed, and catalog built using both the methods demonstrate that the improvement in processing speeds achieved by RADProc does not affect much the actual loci formed and the results of downstream analyses based on those loci.",
                "authors": [
                    {
                        "name": "Nadukkalam Ravindran P."
                    },
                    {
                        "name": "Bentzen P."
                    },
                    {
                        "name": "Bradbury I.R."
                    },
                    {
                        "name": "Beiko R.G."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "RADProc: A computationally efficient de novo locus assembler for population studies using RADseq data"
            },
            "pmid": "30312001",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}