{
    "additionDate": "2018-07-03T15:19:05Z",
    "biotoolsCURIE": "biotools:genomedisco",
    "biotoolsID": "genomedisco",
    "credit": [
        {
            "email": "akundaje@stanford.edu",
            "name": "Anshul Kundaje",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "oursu@stanford.edu",
            "name": "Oana Ursu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software for comparing contact maps from HiC, CaptureC and other 3D genome data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/kundajelab/genomedisco"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kundajelab/genomedisco",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "GenomeDISCO",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty164",
            "metadata": {
                "abstract": "© The Author(s) 2018.Motivation: The three-dimensional organization of chromatin plays a critical role in gene regulation and disease. High-throughput chromosome conformation capture experiments such as Hi-C are used to obtain genome-wide maps of three-dimensional chromatin contacts. However, robust estimation of data quality and systematic comparison of these contact maps is challenging due to the multi-scale, hierarchical structure of chromatin contacts and the resulting properties of experimental noise in the data. Measuring concordance of contact maps is important for assessing reproducibility of replicate experiments and for modeling variation between different cellular contexts. Results: We introduce a concordance measure called DIfferences between Smoothed COntact maps (GenomeDISCO) for assessing the similarity of a pair of contact maps obtained from chromosome conformation capture experiments. The key idea is to smooth contact maps using random walks on the contact map graph, before estimating concordance. We use simulated datasets to benchmark GenomeDISCO's sensitivity to different types of noise that affect chromatin contact maps. When applied to a large collection of Hi-C datasets, GenomeDISCO accurately distinguishes biological replicates from samples obtained from different cell types. GenomeDISCO also generalizes to other chromosome conformation capture assays, such as HiChIP.",
                "authors": [
                    {
                        "name": "Boley N."
                    },
                    {
                        "name": "Kundaje A."
                    },
                    {
                        "name": "Noble W.S."
                    },
                    {
                        "name": "Taranova M."
                    },
                    {
                        "name": "Ursu O."
                    },
                    {
                        "name": "Wang Y.X.R."
                    },
                    {
                        "name": "Yardimci G.G."
                    }
                ],
                "citationCount": 23,
                "date": "2018-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GenomeDISCO: A concordance score for chromosome conformation capture experiments using random walks on contact map graphs"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
