{
    "accessibility": "Open access",
    "additionDate": "2024-01-30T15:29:35.429336Z",
    "biotoolsCURIE": "biotools:fhir-pyrate",
    "biotoolsID": "fhir-pyrate",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "giulia.baldini@uk-essen.de",
            "name": "Giulia Baldini",
            "orcidid": "https://orcid.org/0000-0002-5929-0271",
            "typeEntity": "Person"
        },
        {
            "name": "René Hosch",
            "typeEntity": "Person"
        },
        {
            "name": "Vicky Parmar",
            "typeEntity": "Person"
        }
    ],
    "description": "Python package to query FHIR servers. This package is meant to provide a simple abstraction to query and structure FHIR resources as pandas DataFrames.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UMEssen/FHIR-PYrate",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:18:08.871451Z",
    "license": "MIT",
    "name": "FHIR-PYrate",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12913-023-09498-1",
            "metadata": {
                "abstract": "Background: We present FHIR-PYrate, a Python package to handle the full clinical data collection and extraction process. The software is to be plugged into a modern hospital domain, where electronic patient records are used to handle the entire patient’s history. Most research institutes follow the same procedures to build study cohorts, but mainly in a non-standardized and repetitive way. As a result, researchers spend time writing boilerplate code, which could be used for more challenging tasks. Methods: The package can improve and simplify existing processes in the clinical research environment. It collects all needed functionalities into a straightforward interface that can be used to query a FHIR server, download imaging studies and filter clinical documents. The full capacity of the search mechanism of the FHIR REST API is available to the user, leading to a uniform querying process for all resources, thus simplifying the customization of each use case. Additionally, valuable features like parallelization and filtering are included to make it more performant. Results: As an exemplary practical application, the package can be used to analyze the prognostic significance of routine CT imaging and clinical data in breast cancer with tumor metastases in the lungs. In this example, the initial patient cohort is first collected using ICD-10 codes. For these patients, the survival information is also gathered. Some additional clinical data is retrieved, and CT scans of the thorax are downloaded. Finally, the survival analysis can be computed using a deep learning model with the CT scans, the TNM staging and positivity of relevant markers as input. This process may vary depending on the FHIR server and available clinical data, and can be customized to cover even more use cases. Conclusions: FHIR-PYrate opens up the possibility to quickly and easily retrieve FHIR data, download image data, and search medical documents for keywords within a Python package. With the demonstrated functionality, FHIR-PYrate opens an easy way to assemble research collectives automatically.",
                "authors": [
                    {
                        "name": "Arzideh K."
                    },
                    {
                        "name": "Baldini G."
                    },
                    {
                        "name": "Borys K."
                    },
                    {
                        "name": "Engelke M."
                    },
                    {
                        "name": "Hosch R."
                    },
                    {
                        "name": "Koitka S."
                    },
                    {
                        "name": "Nensa F."
                    },
                    {
                        "name": "Parmar V."
                    },
                    {
                        "name": "Ulrich M."
                    }
                ],
                "citationCount": 8,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Health Services Research",
                "title": "FHIR-PYrate: a data science friendly Python package to query FHIR servers"
            },
            "pmcid": "PMC10326955",
            "pmid": "37415138"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
