{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-09-03T14:47:34Z",
    "biotoolsCURIE": "biotools:ProteoRE",
    "biotoolsID": "ProteoRE",
    "credit": [
        {
            "email": "yves.vandenbrouck@cea.fr",
            "name": "Yves Vandenbrouck",
            "orcidid": "http://orcid.org/0000-0002-1292-373X",
            "typeEntity": "Person"
        }
    ],
    "description": "ProteoRE (Proteomics Research Environment) is a Galaxy-based instance for the functional analysis and the exploration of proteomics and transcriptomics data in biomedical research;  ProteoRE comprises 18 tools organized into five subsections for: i) data manipulation; ii) human and iii ) mouse species database annotation; iv) functional analysis; and v) pathway analysis along with graphical representations.",
    "editPermission": {
        "authors": [
            "yvandenbrouck"
        ],
        "type": "group"
    },
    "elixirNode": [
        "France"
    ],
    "homepage": "http://www.proteore.org/",
    "lastUpdate": "2020-04-07T12:48:30Z",
    "link": [
        {
            "note": "All ProteoRE's tools are publicly developped on GitHub",
            "type": "Repository",
            "url": "https://github.com/ifb-git/ProteoRE"
        },
        {
            "note": "These tools can be installed on any Galaxy instance through the Galaxy ToolShed",
            "type": "Repository",
            "url": "https://toolshed.g2.bx.psu.edu/view/proteore"
        },
        {
            "note": "Tutorials available on the Galaxy Training Network",
            "type": "Other",
            "url": "https://galaxyproject.github.io/training-material/topics/proteomics"
        }
    ],
    "maturity": "Mature",
    "name": "ProteoRE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "yvandenbrouck",
    "publication": [
        {
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Knowledge-based approaches using large-scale biological (“omics”) data are a powerful way to identify mechanistic biomarkers, provided that scientists have access to computational solutions even when they have little programming experience or bioinformatics support. To achieve this goal, we designed a set of tools under the Galaxy framework to allow biologists to define their own strategy for reproducible biomarker selection. These tools rely on retrieving experimental data from public databases, and applying successive filters derived from information relating to disease pathophysiology. A step-by-step protocol linking these tools was implemented to select tissue-leakage biomarker candidates of myocardial infarction. A list of 24 candidates suitable for experimental assessment by MS-based proteomics is proposed. These tools have been made publicly available at http://www.proteore.org, allowing researchers to reuse them in their quest for biomarker discovery.",
                "authors": [
                    {
                        "name": "Nguyen L."
                    },
                    {
                        "name": "Brun V."
                    },
                    {
                        "name": "Combes F."
                    },
                    {
                        "name": "Loux V."
                    },
                    {
                        "name": "Vandenbrouck Y."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Designing an in silico strategy to select tissue-leakage biomarkers using the galaxy framework"
            },
            "pmid": "30852829"
        }
    ],
    "toolType": [
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "version": [
        "2.0"
    ]
}