{
    "accessibility": "Open access",
    "additionDate": "2019-09-03T14:47:34Z",
    "biotoolsCURIE": "biotools:ProteoRE",
    "biotoolsID": "ProteoRE",
    "credit": [
        {
            "email": "yves.vandenbrouck@cea.fr",
            "name": "Yves Vandenbrouck",
            "orcidid": "http://orcid.org/0000-0002-1292-373X",
            "typeEntity": "Person"
        }
    ],
    "description": "ProteoRE (Proteomics Research Environment) is a Galaxy-based instance for the functional analysis and the exploration of proteomics and transcriptomics data in biomedical research;  ProteoRE comprises 18 tools organized into five subsections for: i) data manipulation; ii) human and iii ) mouse species database annotation; iv) functional analysis; and v) pathway analysis along with graphical representations.",
    "editPermission": {
        "authors": [
            "yvandenbrouck"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "Galaxy"
    ],
    "elixirNode": [
        "France"
    ],
    "homepage": "https://proteore.org/",
    "lastUpdate": "2021-08-17T13:08:17Z",
    "link": [
        {
            "note": "All ProteoRE's tools are publicly developped on GitHub",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/vloux/ProteoRE/"
        },
        {
            "note": "These tools can be installed on any Galaxy instance through the Galaxy ToolShed",
            "type": [
                "Repository"
            ],
            "url": "https://toolshed.g2.bx.psu.edu/view/proteore"
        },
        {
            "note": "Tutorials available on the Galaxy Training Network",
            "type": [
                "Other"
            ],
            "url": "https://training.galaxyproject.org/training-material/topics/proteomics"
        }
    ],
    "maturity": "Mature",
    "name": "ProteoRE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "yvandenbrouck",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-1641-3_11",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive license to Springer Science+Business Media, LLC, part of Springer Nature.With the increased simplicity of producing proteomics data, the bottleneck has now shifted to the functional analysis of large lists of proteins to translate this primary level of information into meaningful biological knowledge. Tools implementing such approach are a powerful way to gain biological insights related to their samples, provided that biologists/clinicians have access to computational solutions even when they have little programming experience or bioinformatics support. To achieve this goal, we designed ProteoRE (Proteomics Research Environment), a unified online research service that provides end-users with a set of tools to interpret their proteomics data in a collaborative and reproducible manner. ProteoRE is built upon the Galaxy framework, a workflow system allowing for data and analysis persistence, and providing user interfaces to facilitate the interaction with tools dedicated to the functional and the visual analysis of proteomics datasets. A set of tools relying on computational methods selected for their complementarity in terms of functional analysis was developed and made accessible via the ProteoRE web portal. In this chapter, a step-by-step protocol linking these tools is designed to perform a functional annotation and GO-based enrichment analyses applied to a set of differentially expressed proteins as a use case. Analytical practices, guidelines as well as tips related to this strategy are also provided. Tools, datasets, and results are freely available at http://www.proteore.org, allowing researchers to reuse them.",
                "authors": [
                    {
                        "name": "Combes F."
                    },
                    {
                        "name": "Loux V."
                    },
                    {
                        "name": "Vandenbrouck Y."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "GO Enrichment Analysis for Differential Proteomics Using ProteoRE"
            },
            "pmid": "34236662",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1007/978-1-4939-9164-8_18",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Knowledge-based approaches using large-scale biological (“omics”) data are a powerful way to identify mechanistic biomarkers, provided that scientists have access to computational solutions even when they have little programming experience or bioinformatics support. To achieve this goal, we designed a set of tools under the Galaxy framework to allow biologists to define their own strategy for reproducible biomarker selection. These tools rely on retrieving experimental data from public databases, and applying successive filters derived from information relating to disease pathophysiology. A step-by-step protocol linking these tools was implemented to select tissue-leakage biomarker candidates of myocardial infarction. A list of 24 candidates suitable for experimental assessment by MS-based proteomics is proposed. These tools have been made publicly available at http://www.proteore.org, allowing researchers to reuse them in their quest for biomarker discovery.",
                "authors": [
                    {
                        "name": "Brun V."
                    },
                    {
                        "name": "Combes F."
                    },
                    {
                        "name": "Loux V."
                    },
                    {
                        "name": "Nguyen L."
                    },
                    {
                        "name": "Vandenbrouck Y."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Designing an in silico strategy to select tissue-leakage biomarkers using the galaxy framework"
            },
            "pmid": "30852829",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1,
    "version": [
        "2.2"
    ]
}
