
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://strimmerlab.org/korbinian.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://strimmerlab.org/software/genenet/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/genenet-1-2-6-modeling-inferring-gene-networks.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: The use of correlation networks is widespread in the analysis of gene expression and proteomics data, even though it is known that correlations not only confound direct and indirect associations but also provide no means to distinguish between cause and effect. For \"causal\" analysis typically the inference of a directed graphical model is required. However, this is rather difficult due to the curse of dimensionality. Results: We propose a simple heuristic forthe statistical learning of a high-dimensional \"causal\" network. The method first converts a correlation network into a partial correlation graph. Subsequently, a partial ordering of the nodes is established by multiple testing of the log-ratio of standardized partial variances. This allows identifying a directed acyclic causal network as a subgraph of the partial correlation network. We illustrate the approach by analyzing a large Arabidopsis thaliana expression data set. Conclusion: The proposed approach is a heuristic algorithm that is based on a number of approximations, such as substituting lower order partial correlations by full order partial correlations. Nevertheless, for small samples and for sparse networks the algorithm not only yield sensible first order approximations of the causal structure in high-dimensional genomic data but is also computationally highly efficient. Availability and Requirements: The method is implemented in the \"GeneNet\" R package (version 1.2.0), available from CRAN and from http://strimmerlab.org/software/genets/. The software includes an R script for reproducing the network analysis of the Arabidopsis thaliana data. © 2007 Opgen-Rhein and Strimmer; licensee BioMed Central Ltd.",
            "authors": [
                "Opgen-Rhein R.",
                "Strimmer K."
            ],
            "cit_count": 209,
            "journal": "BMC Systems Biology",
            "pmid": "17683609",
            "title": "From correlation to causation networks: A simple approximate learning algorithm and its application to high-dimensional plant gene expression data",
            "year": "2007-08-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genenet",
        "biotoolsID": "genenet",
        "description": "Package for analyzing gene expression (time series) data with focus on the inference of gene networks.",
        "homepage": "http://strimmerlab.org/software/genenet/index.html",
        "name": "GeneNet"
    }
}