{
    "accessibility": "Open access",
    "additionDate": "2024-05-20T14:36:02.829851Z",
    "biotoolsCURIE": "biotools:ibdirp",
    "biotoolsID": "ibdirp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "niekai1988@126.com",
            "name": "Nie Kai",
            "typeEntity": "Person"
        },
        {
            "email": "wangxiaoyan@csu.edu.cn",
            "name": "Wang Xiaoyan",
            "typeEntity": "Person"
        }
    ],
    "description": "An Inflammatory Bowel Diseases Integrated Resources Portal (IBDIRP).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://www.ibdirp.com",
    "lastUpdate": "2024-05-20T14:36:02.832054Z",
    "name": "IBDIRP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/baad097",
            "metadata": {
                "abstract": "IBD, including ulcerative colitis and Crohn's disease, is a chronic and debilitating gastrointestinal disorder that affects millions of people worldwide. Research on IBD has generated massive amounts of data, including literature, metagenomics, metabolomics, bioresources and databases. We aim to create an IBD Integrated Resources Portal (IBDIRP) that provides the most comprehensive resources for IBD. An integrated platform was developed that provides information on different aspects of IBD research resources, such as single-nucleotide polymorphisms (SNPs), genes, transcriptome, microbiota, metabolomics, single cells and other resources. Valuable and comprehensive IBD-related data were collected from PubMed, Google, GMrepo, gutMega, gutMDisorder, Single Cell Portal and other sources. Then, the data were systematically sorted, and these resources were manually curated. We systematically sorted and cataloged more than 320 unique risk SNPs associated with IBD in the SNP section. We presented over 289 IBD-related genes based on the database collection in the gene section. We also obtained 153 manually curated IBD transcriptomics data, including 12 388 samples, on the Gene Expression Omnibus database. The sorted IBD-related microbiota data from three primary microbiome databases (GMrepo, gutMega and gutMDisorder) were available for download. We selected 23 149 IBD-related taxonomic records from these databases. Additionally, we collected 24 IBD metabolomics studies with 2896 participants in the metabolomics section. We introduced two interactive single-cell data plug-in units that provided data visualization based on cells and genes. Finally, we listed 18 significant IBD web resources, such as the official European Crohn's and Colitis Organisation and International Organization for the Study of IBD websites, IBD scoring tools, IBD genetic and multi-omics resources, IBD biobanks and other useful research resources. The IBDIRP website is the first integrated resource for global IBD researchers. This portal will help researchers by providing comprehensive knowledge and enabling them to reinforce the multidimensional impression of IBD. The IBDIRP website is accessible via www.ibdirp.com Database URL: www.ibdirp.com.",
                "authors": [
                    {
                        "name": "Kai N."
                    },
                    {
                        "name": "Kejia M."
                    },
                    {
                        "name": "Lixia C."
                    },
                    {
                        "name": "Minzi D."
                    },
                    {
                        "name": "Qingsong C."
                    },
                    {
                        "name": "Weiwei L."
                    },
                    {
                        "name": "Xiaoyan W."
                    },
                    {
                        "name": "Xing W."
                    },
                    {
                        "name": "Xuejie C."
                    },
                    {
                        "name": "Yuanyuan Y."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Database",
                "title": "An Inflammatory Bowel Diseases Integrated Resources Portal (IBDIRP)"
            },
            "pmcid": "PMC10791110",
            "pmid": "38227799"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gastroenterology",
            "uri": "http://edamontology.org/topic_3409"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
