
{
    "credit": [
        {
            "email": "jgahn@inu.ac.kr",
            "name": "Jaegyoon Ahn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://github.com/mathcom/CPR/blob/master/manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation Identification of genes that can be used to predict prognosis in patients with cancer is important in that it can lead to improved therapy, and can also promote our understanding of tumor progression on the molecular level. One of the common but fundamental problems that render identification of prognostic genes and prediction of cancer outcomes difficult is the heterogeneity of patient samples. Results To reduce the effect of sample heterogeneity, we clustered data samples using K-means algorithm and applied modified PageRank to functional interaction (FI) networks weighted using gene expression values of samples in each cluster. Hub genes among resulting prioritized genes were selected as biomarkers to predict the prognosis of samples. This process outperformed traditional feature selection methods as well as several network-based prognostic gene selection methods when applied to Random Forest. We were able to find many cluster-specific prognostic genes for each dataset. Functional study showed that distinct biological processes were enriched in each cluster, which seems to reflect different aspect of tumor progression or oncogenesis among distinct patient groups. Taken together, these results provide support for the hypothesis that our approach can effectively identify heterogeneous prognostic genes, and these are complementary to each other, improving prediction accuracy. Availability and implementation https://github.com/mathcom/CPR Contact jgahn@inu.ac.kr Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Choi J.",
                "Park S.",
                "Yoon Y.",
                "Ahn J."
            ],
            "cit_count": 5,
            "doi": "10.1093/bioinformatics/btx487",
            "journal": "Bioinformatics",
            "title": "Improved prediction of breast cancer outcome by identifying heterogeneous biomarkers",
            "year": "2017-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cpr",
        "biotoolsID": "cpr",
        "description": "Identify prognostic genes (biomarkers) and use them to predict prognosis of cancer patients.",
        "homepage": "https://github.com/mathcom/CPR",
        "name": "CPR"
    }
}