
{
    "credit": [
        {
            "email": "hnakaya@usp.br",
            "name": "Helder Nakaya",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/manuals/CEMiTool/man/CEMiTool.pdf"
        }
    ],
    "download": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/CEMiTool_1.4.2.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "http://bioconductor.org/packages/CEMiTool/"
        },
        {
            "type": "Repository",
            "url": "https://git.bioconductor.org/packages/CEMiTool"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 The Author(s).Background: The analysis of modular gene co-expression networks is a well-established method commonly used for discovering the systems-level functionality of genes. In addition, these studies provide a basis for the discovery of clinically relevant molecular pathways underlying different diseases and conditions. Results: In this paper, we present a fast and easy-to-use Bioconductor package named CEMiTool that unifies the discovery and the analysis of co-expression modules. Using the same real datasets, we demonstrate that CEMiTool outperforms existing tools, and provides unique results in a user-friendly html report with high quality graphs. Among its features, our tool evaluates whether modules contain genes that are over-represented by specific pathways or that are altered in a specific sample group, as well as it integrates transcriptomic data with interactome information, identifying the potential hubs on each network. We successfully applied CEMiTool to over 1000 transcriptome datasets, and to a new RNA-seq dataset of patients infected with Leishmania, revealing novel insights of the disease's physiopathology. Conclusion: The CEMiTool R package provides users with an easy-to-use method to automatically implement gene co-expression network analyses, obtain key information about the discovered gene modules using additional downstream analyses and retrieve publication-ready results via a high-quality interactive report.",
            "authors": [
                "Russo P.S.T.",
                "Ferreira G.R.",
                "Cardozo L.E.",
                "Burger M.C.",
                "Arias-Carrasco R.",
                "Maruyama S.R.",
                "Hirata T.D.C.",
                "Lima D.S.",
                "Passos F.M.",
                "Fukutani K.F.",
                "Lever M.",
                "Silva J.S.",
                "Maracaja-Coutinho V.",
                "Nakaya H.I."
            ],
            "cit_count": 4,
            "doi": "10.1186/s12859-018-2053-1",
            "journal": "BMC Bioinformatics",
            "title": "CEMiTool: A Bioconductor package for performing comprehensive modular co-expression analyses",
            "type": "Primary",
            "year": "2018-02-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cemitool",
        "biotoolsID": "cemitool",
        "description": "It unifies the discovery and the analysis of coexpression gene modules in a fully automatic manner, while providing a user-friendly html report with high quality graphs. Our tool evaluates if modules contain genes that are over-represented by specific pathways or that are altered in a specific sample group. Additionally, CEMiTool is able to integrate transcriptomic data with interactome information, identifying the potential hubs on each network.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/CEMiTool.html",
        "name": "CEMiTool",
        "version": [
            "1.4.2"
        ]
    }
}