{
    "additionDate": "2018-06-15T13:10:55Z",
    "biotoolsCURIE": "biotools:logminer",
    "biotoolsID": "logminer",
    "credit": [
        {
            "email": "steven.kleinstein@yale.edu",
            "name": "Steven Kleinstein",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "stefan.avey@yale.edu",
            "name": "Stefan Avey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Logistic Multiple Network-constrained Regression.",
    "documentation": [
        {
            "type": "General",
            "url": "https://bitbucket.org/kleinstein/logminer"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/kleinstein/logminer",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "LogMiNeR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx260",
            "metadata": {
                "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved.Motivation: Systems immunology leverages recent technological advancements that enable broad profiling of the immune system to better understand the response to infection and vaccination, as well as the dysregulation that occurs in disease. An increasingly common approach to gain insights from these large-scale profiling experiments involves the application of statistical learning methods to predict disease states or the immune response to perturbations. However, the goal of many systems studies is not to maximize accuracy, but rather to gain biological insights. The predictors identified using current approaches can be biologically uninterpretable or present only one of many equally predictive models, leading to a narrow understanding of the underlying biology. Results: Here we show that incorporating prior biological knowledge within a logistic modeling framework by using network-level constraints on transcriptional profiling data significantly improves interpretability. Moreover, incorporating different types of biological knowledge produces models that highlight distinct aspects of the underlying biology, while maintaining predictive accuracy. We propose a new framework, Logistic Multiple Network-constrained Regression (LogMiNeR), and apply it to understand the mechanisms underlying differential responses to influenza vaccination. Although standard logistic regression approaches were predictive, they were minimally interpretable. Incorporating prior knowledge using LogMiNeR led to models that were equally predictive yet highly interpretable. In this context, B cell-specific genes and mTOR signaling were associated with an effective vaccination response in young adults. Overall, our results demonstrate a new paradigm for analyzing high-dimensional immune profiling data in which multiple networks encoding prior knowledge are incorporated to improve model interpretability.",
                "authors": [
                    {
                        "name": "Avey S."
                    },
                    {
                        "name": "Mohanty S."
                    },
                    {
                        "name": "Wilson J."
                    },
                    {
                        "name": "Zapata H."
                    },
                    {
                        "name": "Joshi S.R."
                    },
                    {
                        "name": "Siconolfi B."
                    },
                    {
                        "name": "Tsang S."
                    },
                    {
                        "name": "Shaw A.C."
                    },
                    {
                        "name": "Kleinstein S.H."
                    }
                ],
                "citationCount": 2,
                "date": "2017-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Multiple network-constrained regressions expand insights into influenza vaccination responses"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}