{
    "additionDate": "2017-08-03T18:51:43Z",
    "biotoolsCURIE": "biotools:modpred",
    "biotoolsID": "modpred",
    "credit": [
        {
            "email": "predrag@indiana.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.informatics.indiana.edu/predrag/"
        },
        {
            "email": "vpejaver@indiana.edu",
            "name": "Pejaver, V",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software package and web tool that predicts up to 23 types of post-translational modifications.",
    "documentation": [
        {
            "type": "General",
            "url": "http://montana.informatics.indiana.edu/ModPred/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://montana.informatics.indiana.edu/ModPred/",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/modpred-predictor-of-post-translational-modification-sites-in-proteins.html"
        }
    ],
    "name": "ModPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The structural, functional, and mechanistic characterization of several types of posttranslational modifications (PTMs) is well-documented. PTMs, however, may interact or interfere with one another when regulating protein function. Yet, characterization of the structural and functional signatures of their crosstalk has been hindered by the scarcity of data. To this end, we developed a unified sequence-based predictor of 23 types of PTM sites that, we believe, is a useful tool in guiding biological experiments and data interpretation. We then used experimentally determined and predicted PTM sites to investigate two particular cases of potential PTM crosstalk in eukaryotes. First, we identified proteins statistically enriched in multiple types of PTM sites and found that they show preferences toward intrinsically disordered regions as well as functional roles in transcriptional, posttranscriptional, and developmental processes. Second, we observed that target sites modified by more than one type of PTM, referred to as shared PTM sites, show even stronger preferences toward disordered regions than their single-PTM counterparts; we explain this by the need for these regions to accommodate multiple partners. Finally, we investigated the influence of single and shared PTMs on differential regulation of protein-protein interactions. We provide evidence that molecular recognition features (MoRFs) show significant preferences for PTM sites, particularly shared PTM sites, implicating PTMs in the modulation of this specific type of macromolecular recognition. We conclude that intrinsic disorder is a strong structural prerequisite for complex PTM-based regulation, particularly in context-dependent protein-protein interactions related to transcriptional and developmental processes. Availability: www.modpred.org. © 2014 The Protein Society.",
                "authors": [
                    {
                        "name": "Pejaver V."
                    },
                    {
                        "name": "Hsu W.-L."
                    },
                    {
                        "name": "Xin F."
                    },
                    {
                        "name": "Dunker A.K."
                    },
                    {
                        "name": "Uversky V.N."
                    },
                    {
                        "name": "Radivojac P."
                    }
                ],
                "citationCount": 117,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "The structural and functional signatures of proteins that undergo multiple events of post-translational modification"
            },
            "pmid": "24888500"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}