{
    "additionDate": "2020-01-09T17:49:11Z",
    "biotoolsCURIE": "biotools:DORMAN",
    "biotoolsID": "DORMAN",
    "confidence_flag": "tool",
    "description": "Database Of Reconstructed MetAbolic Networks.\n\nWe apologize for the inconvenience, but it appears that an internal error has occurred in the Dorman system. If this is the first time you have encountered this message, please use the Back button on your browser and try your last action again. If you are receiving this message repeatedly, please send an e-mail to (aec51 [at] case [dot] edu) with a detailed description of what you were doing when this message occurred so that we may try and resolve this issue. Thank you!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://ciceklab.cs.bilkent.edu.tr/dorman",
    "lastUpdate": "2020-12-22T10:26:22Z",
    "name": "DORMAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCBB.2019.2944905",
            "metadata": {
                "abstract": "© 2004-2012 IEEE.Genome-scale reconstructed metabolic networks have provided an organism specific understanding of cellular processes and their relations to phenotype. As they are deemed essential to study metabolism, the number of organisms with reconstructed metabolic networks continues to increase. This everlasting research interest lead to the development of online systems/repositories that store existing reconstructions and enable new model generation, integration, and constraint-based analyses. While features that support model reconstruction are widely available, current systems lack the means to help users who are interested in analyzing the topology of the reconstructed networks. Here, we present the Database of Reconstructed Metabolic Networks - DORMAN. DORMAN is a centralized online database that stores SBML-based reconstructed metabolic networks published in the literature, and provides web-based computational tools for visualizing and analyzing the model topology. Novel features of DORMAN are (i) interactive visualization interface that allows rendering of the complete network as well as editing and exporting the model, (ii) hierarchical navigation that provides efficient access to connected entities in the model, (iii) built-in query interface that allow posing topological queries, and finally, and (iv) model comparison tool that enables comparing models with different nomenclatures, using approximate string matching. DORMAN is online and freely accessible at http://ciceklab.cs.bilkent.edu.tr/dorman.",
                "authors": [
                    {
                        "name": "Ozden F."
                    },
                    {
                        "name": "Siper M.C."
                    },
                    {
                        "name": "Acarsoy N."
                    },
                    {
                        "name": "Elmas T."
                    },
                    {
                        "name": "Marty B."
                    },
                    {
                        "name": "Qi X."
                    },
                    {
                        "name": "Cicek A.E."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "DORMAN: Database of reconstructed MetAbolic networks"
            },
            "pmid": "31581093"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}