
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sfb.kaust.edu.sa/Pages/ContactUs.aspx"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sfb.kaust.edu.sa/Pages/Software.aspx"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/polyamotif-predict-polya-motifs-in-human-dna-sequence.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Polyadenylation is the addition of a poly(A) tail to an RNA molecule. Identifying DNA sequence motifs that signal the addition of poly(A) tails is essential to improved genome annotation and better understanding of the regulatory mechanisms and stability of mRNA.Existing poly(A) motif predictors demonstrate that information extracted from the surrounding nucleotide sequences of candidate poly(A) motifs can differentiate true motifs from the false ones to a great extent. A variety of sophisticated features has been explored, including sequential, structural, statistical, thermodynamic and evolutionary properties. However, most of these methods involve extensive manual feature engineering, which can be time-consuming and can require in-depth domain knowledge.Results: We propose a novel machine-learning method for poly(A) motif prediction by marrying generative learning (hidden Markov models) and discriminative learning (support vector machines). Generative learning provides a rich palette on which the uncertainty and diversity of sequence information can be handled, while discriminative learning allows the performance of the classification task to be directly optimized. Here, we used hidden Markov models for fitting the DNA sequence dynamics, and developed an efficient spectral algorithm for extracting latent variable information from these models. These spectral latent features were then fed into support vector machines to fine-tune the classification performance.We evaluated our proposed method on a comprehensive human poly(A) dataset that consists of 14 740 samples from 12 of the most abundant variants of human poly(A) motifs. Compared with one of the previous state-of-the-art methods in the literature (the random forest model with expert-crafted features), our method reduces the average error rate, false-negative rate and false-positive rate by 26, 15 and 35%, respectively. Meanwhile, our method makes ∼30% fewer error predictions relative to the other string kernels. Furthermore, our method can be used to visualize the importance of oligomers and positions in predicting poly(A) motifs, from which we can observe a number of characteristics in the surrounding regions of true and false motifs that have not been reported before. © The Author 2013.",
            "authors": [
                "Xie B.",
                "Jankovic B.R.",
                "Bajic V.B.",
                "Song L.",
                "Gao X."
            ],
            "cit_count": 15,
            "journal": "Bioinformatics",
            "pmid": "23813000",
            "title": "Poly(A) motif prediction using spectral latent features from human DNA sequences",
            "year": "2013-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:polyamotif",
        "biotoolsID": "polyamotif",
        "description": "Predict the 12 main variants of human poly(A) motifs, i.e., AATAAA, ATTAAA, AAAAAG, AAGAAA, TATAAA, AATACA, AGTAAA, ACTAAA, GATAAA, CATAAA, AATATA, and AATAGA.",
        "homepage": "http://sfb.kaust.edu.sa/Pages/Software.aspx",
        "name": "PolyAMotif"
    }
}