{
    "accessibility": "Open access",
    "additionDate": "2023-08-30T13:52:19.501334Z",
    "biotoolsCURIE": "biotools:dbaqp-snp",
    "biotoolsID": "dbaqp-snp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rsankar@iitk.ac.in",
            "name": "Ramasubbu Sankararamakrishnan",
            "orcidid": "https://orcid.org/0000-0002-8527-5614",
            "typeEntity": "Person"
        }
    ],
    "description": "Database of missense single-nucleotide polymorphisms in human aquaporins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.iitk.ac.in/dbAQP-SNP",
    "lastUpdate": "2024-11-24T14:42:36.052257Z",
    "name": "dbAQP-SNP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/baad012",
            "metadata": {
                "abstract": "Aquaporins and aquaglyceroporins belong to the superfamily of major intrinsic proteins (MIPs), and they transport water and other neutral solutes such as glycerol. These channel proteins are involved in vital physiological processes and are implicated in several human diseases. Experimentally determined structures of MIPs from diverse organisms reveal a unique hour-glass fold with six transmembrane helices and two half-helices. MIP channels have two constrictions formed by Asn-Pro-Ala (NPA) motifs and aromatic/arginine selectivity filters (Ar/R SFs). Several reports have found associations among single-nucleotide polymorphisms (SNPs) in human aquaporins (AQPs) with diseases in specific populations. In this study, we have compiled 2798 SNPs that give rise to missense mutations in 13 human AQPs. To understand the nature of missense substitutions, we have systematically analyzed the pattern of substitutions. We found several examples in which substitutions could be considered as non-conservative that include small to big or hydrophobic to charged residues. We also analyzed these substitutions in the context of structure. We have identified SNPs that occur in NPA motifs or Ar/R SFs, and they will most certainly disrupt the structure and/or transport properties of human AQPs. We found 22 examples in which missense SNP substitutions that are mostly non-conservative in nature have given rise to pathogenic conditions as found in the Online Mendelian Inheritance in Man database. It is most likely that not all missense SNPs in human AQPs will result in diseases. However, understanding the effect of missense SNPs on the structure and function of human AQPs is important. In this direction, we have developed a database dbAQP-SNP that contains information about all 2798 SNPs. This database has several features and search options that can help the user to find SNPs in specific positions of human AQPs including the functionally and/or structurally important regions. dbAQP-SNP (http://bioinfo.iitk.ac.in/dbAQP-SNP) is freely available to the academic community. Database URL http://bioinfo.iitk.ac.in/dbAQP-SNP",
                "authors": [
                    {
                        "name": "Dande R."
                    },
                    {
                        "name": "Sankararamakrishnan R."
                    }
                ],
                "citationCount": 3,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Database",
                "title": "dbAQP-SNP: a database of missense single-nucleotide polymorphisms in human aquaporins"
            },
            "pmcid": "PMC10010469",
            "pmid": "36913438"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
