{
    "additionDate": "2018-05-06T10:06:33Z",
    "biotoolsCURIE": "biotools:mlasso-hum",
    "biotoolsID": "mlasso-hum",
    "credit": [
        {
            "email": "shibiao.wan@connect.polyu.hk",
            "name": "Shibiao Wan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "enmwmak@polyu.edu.hk",
            "name": "Man-Wai Mak",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A LASSO-based interpretable human-protein subcellular localization predictor.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.eie.polyu.edu.hk/mLASSOHumServer/instructions.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.eie.polyu.edu.hk/mLASSOHumServer/index.html",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "mLASSO-Hum",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1016/J.JTBI.2015.06.042",
            "metadata": {
                "abstract": "© 2015 Elsevier Ltd.Knowing the subcellular compartments of human proteins is essential to shed light on the mechanisms of a broad range of human diseases. In computational methods for protein subcellular localization, knowledge-based methods (especially gene ontology (GO) based methods) are known to perform better than sequence-based methods. However, existing GO-based predictors often lack interpretability and suffer from overfitting due to the high dimensionality of feature vectors. To address these problems, this paper proposes an interpretable multi-label predictor, namely mLASSO-Hum, which can yield sparse and interpretable solutions for large-scale prediction of human protein subcellular localization. By using the one-vs-rest LASSO-based classifiers, 87 out of more than 8000 GO terms are found to play more significant roles in determining the subcellular localization. Based on these 87 essential GO terms, we can decide not only where a protein resides within a cell, but also why it is located there. To further exploit information from the remaining GO terms, a method based on the GO hierarchical information derived from the depth distance of GO terms is proposed. Experimental results show that mLASSO-Hum performs significantly better than state-of-the-art predictors. We also found that in addition to the GO terms from the cellular component category, GO terms from the other two categories also play important roles in the final classification decisions.",
                "authors": [
                    {
                        "name": "Wan S."
                    },
                    {
                        "name": "Mak M.-W."
                    },
                    {
                        "name": "Kung S.-Y."
                    }
                ],
                "citationCount": 21,
                "date": "2015-10-07T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "MLASSO-Hum: A LASSO-based interpretable human-protein subcellular localization predictor"
            },
            "pmid": "26164062"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}