
{
    "credit": [
        {
            "email": "thomas.girke@ucr.edu",
            "name": "Thomas Girke",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/baoe/SEED"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Similarity clustering of next-generation sequences (NGS) is an important computational problem to study the population sizes of DNA/RNA molecules and to reduce the redundancies in NGS data. Currently, most sequence clustering algorithms are limited by their speed and scalability, and thus cannot handle data with tens of millions of reads. Results: Here, we introduce SEED-an efficient algorithm for clustering very large NGS sets. It joins sequences into clusters that can differ by up to three mismatches and three overhanging residues from their virtual center. It is based on a modified spaced seed method, called block spaced seeds. Its clustering component operates on the hash tables by first identifying virtual center sequences and then finding all their neighboring sequences that meet the similarity parameters. SEED can cluster 100 million short read sequences in <4 h with a linear time and memory performance. When using SEED as a preprocessing tool on genome/transcriptome assembly data, it was able to reduce the time and memory requirements of the Velvet/Oasis assembler for the datasets used in this study by 60-85% and 21-41%, respectively. In addition, the assemblies contained longer contigs than non-preprocessed data as indicated by 12-27% larger N50 values. Compared with other clustering tools, SEED showed the best performance in generating clusters of NGS data similar to true cluster results with a 2- to 10-fold better time performance. While most of SEED's utilities fall into the preprocessing area of NGS data, our tests also demonstrate its efficiency as stand-alone tool for discovering clusters of small RNA sequences in NGS data from unsequenced organisms. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Bao E.",
                "Jiang T.",
                "Kaloshian I.",
                "Girke T."
            ],
            "cit_count": 34,
            "journal": "Bioinformatics",
            "pmid": "21810899",
            "title": "SEED: Efficient clustering of next-generation sequences",
            "year": "2011-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:seed",
        "biotoolsID": "seed",
        "description": "Tool to cluster sequence reads prior to assembly or other operations.",
        "homepage": "http://manuals.bioinformatics.ucr.edu/home/seed",
        "name": "SEED"
    }
}