{
    "additionDate": "2020-01-09T17:36:11Z",
    "biotoolsCURIE": "biotools:GASAL2",
    "biotoolsID": "GASAL2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "n.ahmed@tudelft.nl",
            "name": "Nauman Ahmed",
            "typeEntity": "Person"
        }
    ],
    "description": "a GPU accelerated sequence alignment library for high-throughput NGS data.\n\nGASAL2 - GPU-accelerated DNA alignment library.\n\nGASAL2 is an easy-to-use CUDA library for DNA/RNA sequence alignment algorithms. Currently it supports different kind of alignments:.\n\nA Linux platform with CUDA toolkit 8 or higher is required, along with usual build environment for C and C++ code. GASAL2 has been tested over NVIDIA GPUs with compute capabilities of 2.0, 3.5 and 5.0. Although lower versions of the CUDA framework might work, they have not been tested",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nahmedraja/GASAL2",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:57:03.265906Z",
    "license": "Apache-2.0",
    "name": "GASAL2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-019-3086-9",
            "metadata": {
                "abstract": "Background: Due the computational complexity of sequence alignment algorithms, various accelerated solutions have been proposed to speedup this analysis. NVBIO is the only available GPU library that accelerates sequence alignment of high-throughput NGS data, but has limited performance. In this article we present GASAL2, a GPU library for aligning DNA and RNA sequences that outperforms existing CPU and GPU libraries. Results: The GASAL2 library provides specialized, accelerated kernels for local, global and all types of semi-global alignment. Pairwise sequence alignment can be performed with and without traceback. GASAL2 outperforms the fastest CPU-optimized SIMD implementations such as SeqAn and Parasail, as well as NVIDIA's own GPU-based library known as NVBIO. GASAL2 is unique in performing sequence packing on GPU, which is up to 750x faster than NVBIO. Overall on Geforce GTX 1080 Ti GPU, GASAL2 is up to 21x faster than Parasail on a dual socket hyper-threaded Intel Xeon system with 28 cores and up to 13x faster than NVBIO with a query length of up to 300 bases and 100 bases, respectively. GASAL2 alignment functions are asynchronous/non-blocking and allow full overlap of CPU and GPU execution. The paper shows how to use GASAL2 to accelerate BWA-MEM, speeding up the local alignment by 20x, which gives an overall application speedup of 1.3x vs. CPU with up to 12 threads. Conclusions: The library provides high performance APIs for local, global and semi-global alignment that can be easily integrated into various bioinformatics tools.",
                "authors": [
                    {
                        "name": "Ahmed N."
                    },
                    {
                        "name": "Al-Ars Z."
                    },
                    {
                        "name": "Bertels K."
                    },
                    {
                        "name": "Levy J."
                    },
                    {
                        "name": "Mushtaq H."
                    },
                    {
                        "name": "Ren S."
                    }
                ],
                "citationCount": 49,
                "date": "2019-10-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GASAL2: A GPU accelerated sequence alignment library for high-throughput NGS data"
            },
            "pmcid": "PMC6815017",
            "pmid": "31653208"
        },
        {
            "doi": "10.1186/s12859-019-3185-7",
            "metadata": {
                "abstract": "Following publication of the original article [1], the author requested changes to the figures 4, 7, 8, 9, 12 and 14 to align these with the text. The corrected figures are supplied below. The original article [1] has been corrected. [Typesetter, please insert new supplied figure in package].",
                "authors": [
                    {
                        "name": "Ahmed N."
                    },
                    {
                        "name": "Al-Ars Z."
                    },
                    {
                        "name": "Bertels K."
                    },
                    {
                        "name": "Levy J."
                    },
                    {
                        "name": "Mushtaq H."
                    },
                    {
                        "name": "Ren S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Correction to: GASAL2: A GPU accelerated sequence alignment library for high-Throughput NGS data (BMC Bioinformatics (2019) 20 (520) DOI: 10.1186/s12859-019-3086-9)"
            },
            "pmcid": "PMC6862790",
            "pmid": "31744474"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
