{
    "additionDate": "2020-01-14T09:07:03Z",
    "biotoolsCURIE": "biotools:Loxodonta_Localizer",
    "biotoolsID": "Loxodonta_Localizer",
    "confidence_flag": "tool",
    "description": "A Software Tool for Inferring the Provenance of African Elephants and Their Ivory Using Mitochondrial DNA.\n\ngit clone https://github.com/kaizhao86/loxodontalocalizer.\n\nLoxodonta Localizer maps the localities from which mitochondrial DNA sequences have been reported for African elephants, Loxodonta africana and L. cyclotis, using the dataset described in Ishida et al., 2013, updated with additional sequences.\n\n#first, install Python 2.7, pip and git",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.loxodontalocalizer.org",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2020-12-22T13:03:23Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kaizhao86/loxodontalocalizer"
        }
    ],
    "name": "Loxodonta Localizer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/JHERED/ESZ058",
            "metadata": {
                "abstract": "© 2019 The Author(s).Illegal hunting is a major threat to the elephants of Africa, with more elephants killed by poachers than die from natural causes. DNA from tusks has been used to infer the source populations for confiscated ivory, relying on nuclear genetic markers. However, mitochondrial DNA (mtDNA) sequences can also provide information on the geographic origins of elephants due to female elephant philopatry. Here, we introduce the Loxodonta Localizer (LL; www.loxodontalocalizer.org), an interactive software tool that uses a database of mtDNA sequences compiled from previously published studies to provide information on the potential provenance of confiscated ivory. A 316 bp control region sequence, which can be readily generated from DNA extracted from ivory, is used as a query. The software generates a listing of haplotypes reported among 1917 African elephants in 24 range countries, sorted in order of similarity to the query sequence. The African locations from which haplotype sequences have been previously reported are shown on a map. We demonstrate examples of haplotypes reported from only a single locality or country, examine the utility of the program in identifying elephants from countries with varying degrees of sampling, and analyze batches of confiscated ivory. The LL allows for the source of confiscated ivory to be assessed within days, using widely available molecular methods that do not depend on a particular platform or laboratory. The program enables identification of potential regions or localities from which elephants are being poached, with capacity for rapid identification of populations newly or consistently targeted by poachers.",
                "authors": [
                    {
                        "name": "Zhao K."
                    },
                    {
                        "name": "Ishida Y."
                    },
                    {
                        "name": "Green C.E."
                    },
                    {
                        "name": "Davidson A.G."
                    },
                    {
                        "name": "Sitam F.A.T."
                    },
                    {
                        "name": "Donnelly C.L."
                    },
                    {
                        "name": "De Flamingh A."
                    },
                    {
                        "name": "Perrin-Stowe T.I.N."
                    },
                    {
                        "name": "Bourgeois S."
                    },
                    {
                        "name": "Brandt A.L."
                    },
                    {
                        "name": "Mundis S.J."
                    },
                    {
                        "name": "Van Aarde R.J."
                    },
                    {
                        "name": "Greenberg J.A."
                    },
                    {
                        "name": "Malhi R.S."
                    },
                    {
                        "name": "Georgiadis N.J."
                    },
                    {
                        "name": "McEwing R."
                    },
                    {
                        "name": "Roca A.L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Journal of Heredity",
                "title": "Loxodonta localizer: A software tool for inferring the provenance of african elephants and their ivory using mitochondrial DNA"
            },
            "pmid": "31674643"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}