{
    "additionDate": "2021-03-19T08:36:37Z",
    "biotoolsCURIE": "biotools:icn",
    "biotoolsID": "icn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shuochen@som.umaryland.edu",
            "name": "Shuo Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Extracting interconnected communities in gene Co-expression networks.\n\nThis is an implementation of ICN detection for gene co-expression network (GCN) in Matlab. In constrast to the community structure, we consider a pair of communities be interconnected if a subset of genes from one community is correlated with a subset of genes from another community. Please refer to the paper \"Extracting Interconnected Communities in Gene co-expression Networks\" for details.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://figshare.com/articles/software/ICN-package/13229093",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-31T18:18:10Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/qwu1221/ICN"
        }
    ],
    "name": "ICN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB047",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: The analysis of gene co-expression network (GCN) is critical in examining the gene-gene interactions and learning the underlying complex yet highly organized gene regulatory mechanisms. Numerous clustering methods have been developed to detect communities of co-expressed genes in the large network. The assumed independent community structure, however, can be oversimplified and may not adequately characterize the complex biological processes. Results: We develop a new computational package to extract interconnected communities from gene co-expression network. We consider a pair of communities be interconnected if a subset of genes from one community is correlated with a subset of genes from another community. The interconnected community structure is more flexible and provides a better fit to the empirical co-expression matrix. To overcome the computational challenges, we develop efficient algorithms by leveraging advanced graph norm shrinkage approach. We validate and show the advantage of our method by extensive simulation studies. We then apply our interconnected community detection method to an RNA-seq data from The Cancer Genome Atlas (TCGA) Acute Myeloid Leukemia (AML) study and identify essential interacting biological pathways related to the immune evasion mechanism of tumor cells. Availabilityand implementation: The software is available at Github: https://github.com/qwu1221/ICN and Figshare: https://figshare.com/articles/software/ICN-package/13229093.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Ma T."
                    },
                    {
                        "name": "Milton D.K."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2021-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ICN: Extracting interconnected communities in gene co-expression networks"
            },
            "pmid": "33508087"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
