{
    "additionDate": "2020-01-14T09:17:37Z",
    "biotoolsCURIE": "biotools:WiseNET",
    "biotoolsID": "WiseNET",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "julien.dubois@u-bourgogne.fr",
            "name": "Julien Dubois",
            "typeEntity": "Person"
        }
    ],
    "description": "An indoor multi-camera multi-space dataset with contextual information and annotations for people detection and tracking.\n\nNowadays, camera networks are part of our every-day life environments, consequently, they represent a massive source of information for monitoring human activities and to propose new services to the building users. To perform human activity monitoring, people must be detected and the analysis has to be done according to the information relative to the environment and the context. Available multi-camera datasets furnish videos with few (or none) information of the environment where the network was deployed. The proposed dataset provides multi-camera multi-space video sets along with the complete contextual information of the environment. The dataset regroups 11 video sets (composed of 62 single videos) recorded using 6 indoor cameras deployed on multiple spaces",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://wisenet.checksem.fr/",
    "lastUpdate": "2021-01-03T16:38:44Z",
    "name": "WiseNET",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.DIB.2019.104654",
            "metadata": {
                "abstract": "© 2019 The Author(s)Nowadays, camera networks are part of our every-day life environments, consequently, they represent a massive source of information for monitoring human activities and to propose new services to the building users. To perform human activity monitoring, people must be detected and the analysis has to be done according to the information relative to the environment and the context. Available multi-camera datasets furnish videos with few (or none) information of the environment where the network was deployed. The proposed dataset provides multi-camera multi-space video sets along with the complete contextual information of the environment. The dataset regroups 11 video sets (composed of 62 single videos) recorded using 6 indoor cameras deployed on multiple spaces. The video sets represent more than 1 h of video footage, include 77 people tracks and captured different human actions such as walking around, standing/sitting, motionless, entering/leaving a space and group merging/splitting. Moreover, each video has been manually and automatically annotated to include people detection and tracking meta-information. The automatic people detection annotations were obtained by using different complexity and robustness detectors, from machine learning to state-of-art deep Convolutional Neural Network (CNN) models. Concerning the contextual information, the Industry Foundation Classes (IFC) file that represents the environment's Building Information Modeling (BIM) data is also provided. The BIM/IFC file describes the complete structure of the environment, it's topology and the elements contained in it. To our knowledge, the WiseNET dataset is the first to provide a set of videos along with the complete information of the environment. The WiseNET dataset is publicly available at https://doi.org/10.4121/uuid:c1fb5962-e939-4c51-bfd5-eac6f2935d44, as well as at the project's website http://wisenet.checksem.fr/#/dataset.",
                "authors": [
                    {
                        "name": "Marroquin R."
                    },
                    {
                        "name": "Dubois J."
                    },
                    {
                        "name": "Nicolle C."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Data in Brief",
                "title": "WiseNET: An indoor multi-camera multi-space dataset with contextual information and annotations for people detection and tracking"
            },
            "pmcid": "PMC6838453",
            "pmid": "31720321"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}