{
    "additionDate": "2019-11-14T20:03:15Z",
    "biotoolsCURIE": "biotools:IonSpattern",
    "biotoolsID": "IonSpattern",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "o.vitek@neu.edu",
            "name": "Olga Vitek",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'DGMM', 'morphology-specific', 'single-ion', 'MSI' (bio.tools/msi) | Unsupervised segmentation of mass spectrometric ion images characterizes morphology of tissues | Spatial Dirichlet Gaussian Mixture Model for single ion images | run W_matrix.R GMM.R k_DGMM.R S_DGMM.R first | run CpG_Sal_mouse brain.R to get results of CpG and Sal preconditioned mouse brain data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Vitek-Lab/IonSpattern",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T20:03:15Z",
    "name": "IonSpattern",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ345",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Mass spectrometry imaging (MSI) characterizes the spatial distribution of ions in complex biological samples such as tissues. Since many tissues have complex morphology, treatments and conditions often affect the spatial distribution of the ions in morphology-specific ways. Evaluating the selectivity and the specificity of ion localization and regulation across morphology types is biologically important. However, MSI lacks algorithms for segmenting images at both single-ion and spatial resolution. Results: This article contributes spatial-Dirichlet Gaussian mixture model (DGMM), an algorithm and a workflow for the analyses of MSI experiments, that detects components of single-ion images with homogeneous spatial composition. The approach extends DGMMs to account for the spatial structure of MSI. Evaluations on simulated and experimental datasets with diverse MSI workflows demonstrated that spatial-DGMM accurately segments ion images, and can distinguish ions with homogeneous and heterogeneous spatial distribution. We also demonstrated that the extracted spatial information is useful for downstream analyses, such as detecting morphology-specific ions, finding groups of ions with similar spatial patterns, and detecting changes in chemical composition of tissues between conditions.",
                "authors": [
                    {
                        "name": "Guo D."
                    },
                    {
                        "name": "Bemis K."
                    },
                    {
                        "name": "Rawlins C."
                    },
                    {
                        "name": "Agar J."
                    },
                    {
                        "name": "Vitek O."
                    }
                ],
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Unsupervised segmentation of mass spectrometric ion images characterizes morphology of tissues"
            },
            "pmcid": "PMC6612871",
            "pmid": "31510675"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}