{
    "additionDate": "2021-01-18T09:31:51Z",
    "biotoolsCURIE": "biotools:solo",
    "biotoolsID": "solo",
    "confidence_flag": "tool",
    "description": "Doublet Identification in Single-Cell RNA-Seq via Semi-Supervised Deep Learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/calico/solo",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T09:31:35Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://www.github.com/calico/Solo"
        }
    ],
    "name": "Solo",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2020.05.010",
            "metadata": {
                "abstract": "© 2020 The AuthorsSingle-cell RNA sequencing (scRNA-seq) measurements of gene expression enable an unprecedented high-resolution view into cellular state. However, current methods often result in two or more cells that share the same cell-identifying barcode; these “doublets” violate the fundamental premise of single-cell technology and can lead to incorrect inferences. Here, we describe Solo, a semi-supervised deep learning approach that identifies doublets with greater accuracy than existing methods. Solo embeds cells unsupervised using a variational autoencoder and then appends a feed-forward neural network layer to the encoder to form a supervised classifier. We train this classifier to distinguish simulated doublets from the observed data. Solo can be applied in combination with experimental doublet detection methods to further purify scRNA-seq data to true single cells. It is freely available from https://github.com/calico/solo. A record of this paper's transparent peer review process is included in the Supplemental Information. © 2020 The AuthorsCurrent single-cell RNA sequencing technologies occasionally allow multiple cells to be combined into a single profile, which challenges downstream analyses. Bernstein et al. introduce a semi-supervised deep learning method called Solo that identifies these “doublet” cells with greater accuracy than existing methods.",
                "authors": [
                    {
                        "name": "Bernstein N.J."
                    },
                    {
                        "name": "Fong N.L."
                    },
                    {
                        "name": "Hendrickson D.G."
                    },
                    {
                        "name": "Kelley D.R."
                    },
                    {
                        "name": "Lam I."
                    },
                    {
                        "name": "Roy M.A."
                    }
                ],
                "citationCount": 14,
                "date": "2020-07-22T00:00:00Z",
                "journal": "Cell Systems",
                "title": "Solo: Doublet Identification in Single-Cell RNA-Seq via Semi-Supervised Deep Learning"
            },
            "pmid": "32592658"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
