{
    "additionDate": "2017-12-18T00:11:46Z",
    "biotoolsCURIE": "biotools:rlims-p",
    "biotoolsID": "rlims-p",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pir.georgetown.edu/pirwww/"
        }
    ],
    "description": "Rule-based text-mining program specifically designed to extract protein phosphorylation information on protein kinase, substrate and phosphorylation sites from biomedical literature.",
    "documentation": [
        {
            "type": "General",
            "url": "https://research.bioinformatics.udel.edu/rlimsp/files/rlims_patterns_as_supplementary_material.docx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Literature mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://research.bioinformatics.udel.edu/rlimsp/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rlims-p-2-0-rule-based-literature-mining-system-for-protein-phosphorylation.html"
        }
    ],
    "name": "RLIMS-P",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1109/TCBB.2014.2372765",
            "metadata": {
                "abstract": "© 2004-2012 IEEE.We introduce RLIMS-P version 2.0, an enhanced rule-based information extraction (IE) system for mining kinase, substrate, and phosphorylation site information from scientific literature. Consisting of natural language processing and IE modules, the system has integrated several new features, including the capability of processing full-text articles and generalizability towards different post-translational modifications (PTMs). To evaluate the system, sets of abstracts and full-text articles, containing a variety of textual expressions, were annotated. On the abstract corpus, the system achieved F-scores of 0.91, 0.92, and 0.95 for kinases, substrates, and sites, respectively. The corresponding scores on the full-text corpus were 0.88, 0.91, and 0.92. It was additionally evaluated on the corpus of the 2013 BioNLP-ST GE task, and achieved an F-score of 0.87 for the phosphorylation core task, improving upon the results previously reported on the corpus. Full-scale processing of all abstracts in MEDLINE and all articles in PubMed Central Open Access Subset has demonstrated scalability for mining rich information in literature, enabling its adoption for biocuration and for knowledge discovery. The new system is generalizable and it will be adapted to tackle other major PTM types. RLIMS-P 2.0 online system is available online (http://proteininformationresource.org/rlimsp/) and the developed corpora are available from iProLINK (http://proteininformationresource.org/iprolink/).",
                "authors": [
                    {
                        "name": "Torii M."
                    },
                    {
                        "name": "Arighi C.N."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Wu C.H."
                    },
                    {
                        "name": "Vijay-Shanker K."
                    }
                ],
                "citationCount": 15,
                "date": "2015-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "RLIMS-P 2.0: A generalizable rule-based information extraction system for literature mining of protein phosphorylation information"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Literature mining",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}