{
    "additionDate": "2021-01-18T10:02:25Z",
    "biotoolsCURIE": "biotools:gtmix",
    "biotoolsID": "gtmix",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yufeng.wu@uconn.edu",
            "name": "Yufeng Wu",
            "orcidid": "https://orcid.org/0000-0003-4988-3521",
            "typeEntity": "Person"
        }
    ],
    "description": "Inference of population admixture network from local gene genealogies.\n\nInference of population admixture network from local gene genealogies under coalescent theory.\n\nGTmix is a computer program for inferring population admixture networks from inferred local gene genealogies. If you use GTmix, please cite:.\n\nThe key feature of GTmix is that it works with local gene genealogies inferred from haplotypes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yufengwudcs/GTmix",
    "lastUpdate": "2021-01-25T11:56:47Z",
    "license": "GPL-3.0",
    "name": "GTmix",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA465",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Population admixture is an important subject in population genetics. Inferring population demographic history with admixture under the so-called admixture network model from population genetic data is an established problem in genetics. Existing admixture network inference approaches work with single genetic polymorphisms. While these methods are usually very fast, they do not fully utilize the information [e.g. linkage disequilibrium (LD)] contained in population genetic data. Results: In this article, we develop a new admixture network inference method called GTmix. Different from existing methods, GTmix works with local gene genealogies that can be inferred from population haplotypes. Local gene genealogies represent the evolutionary history of sampled haplotypes and contain the LD information. GTmix performs coalescent-based maximum likelihood inference of admixture networks with inferred local genealogies based on the well-known multispecies coalescent (MSC) model. GTmix utilizes various techniques to speed up the likelihood computation on the MSC model and the optimal network search. Our simulations show that GTmix can infer more accurate admixture networks with much smaller data than existing methods, even when these existing methods are given much larger data. GTmix is reasonably efficient and can analyze population genetic datasets of current interests. Availability and implementation: The program GTmix is available for download at: https://github.com/yufengwudcs/GTmix.",
                "authors": [
                    {
                        "name": "Wu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Inference of population admixture network from local gene genealogies: A coalescent-based maximum likelihood approach"
            },
            "pmcid": "PMC7355278",
            "pmid": "32657366"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}