{
    "additionDate": "2017-08-20T15:08:28Z",
    "biotoolsCURIE": "biotools:bayz",
    "biotoolsID": "bayz",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "luc.janss@mbg.au.dk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Bayz is a statistical analysis software using Bayesian models. Bayz is a command-line tool that shares similarities with other statistical analysis software such as SAS, R, or Genstat: the general set-up is to import/describe the contents of data files, and then to specify the analysis model to be built in terms of the response variable(s), possible link function and factors or covariates to be fitted.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.bayz.biz/IntroGeneral.html"
        },
        {
            "type": "General",
            "url": "http://www.bayz.biz/Bayz.GenomicModels.dec2010.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://www.bayz.biz",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-09-04T08:37:55Z",
    "license": "Proprietary",
    "name": "Bayz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/s12863-017-0491-9",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: With the development of SNP chips, SNP information provides an efficient approach to further disentangle different patterns of genomic variances and covariances across the genome for traits of interest. Due to the interaction between genotype and environment as well as possible differences in genetic background, it is reasonable to treat the performances of a biological trait in different populations as different but genetic correlated traits. In the present study, we performed an investigation on the patterns of region-specific genomic variances, covariances and correlations between Chinese and Nordic Holstein populations for three milk production traits. Results: Variances and covariances between Chinese and Nordic Holstein populations were estimated for genomic regions at three different levels of genome region (all SNP as one region, each chromosome as one region and every 100 SNP as one region) using a novel multi-trait random regression model which uses latent variables to model heterogeneous variance and covariance. In the scenario of the whole genome as one region, the genomic variances, covariances and correlations obtained from the new multi-trait Bayesian method were comparable to those obtained from a multi-trait GBLUP for all the three milk production traits. In the scenario of each chromosome as one region, BTA 14 and BTA 5 accounted for very large genomic variance, covariance and correlation for milk yield and fat yield, whereas no specific chromosome showed very large genomic variance, covariance and correlation for protein yield. In the scenario of every 100 SNP as one region, most regions explained <0.50% of genomic variance and covariance for milk yield and fat yield, and explained <0.30% for protein yield, while some regions could present large variance and covariance. Although overall correlations between two populations for the three traits were positive and high, a few regions still showed weakly positive or highly negative genomic correlations for milk yield and fat yield. Conclusions: The new multi-trait Bayesian method using latent variables to model heterogeneous variance and covariance could work well for estimating the genomic variances and covariances for all genome regions simultaneously. Those estimated genomic parameters could be useful to improve the genomic prediction accuracy for Chinese and Nordic Holstein populations using a joint reference data in the future.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Lund M.S."
                    },
                    {
                        "name": "Janss L."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Ding X."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Su G."
                    }
                ],
                "citationCount": 2,
                "date": "2017-03-15T00:00:00Z",
                "journal": "BMC Genetics",
                "title": "The patterns of genomic variances and covariances across genome for milk production traits between Chinese and Nordic Holstein populations"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ],
    "validated": 1,
    "version": [
        "2.59"
    ]
}