{
    "additionDate": "2021-01-18T07:27:15Z",
    "biotoolsCURIE": "biotools:iread",
    "biotoolsID": "iread",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Nathan.Price@systemsbiology.org",
            "name": "Nathan D. Price",
            "orcidid": "https://orcid.org/0000-0002-4157-0267",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for intron retention detection from RNA-seq data.\n\niREAD (intron REtention Analysis and Detector)is a tool to detect intron retention(IR) events from RNA-seq datasets. Independent introns, referring to those introns that do not overlap with any exons of any splice isoforms, are used for detecting IRs. iREAD takes two input files: (1) a BAM file representing transcritome, and a bed-like text file containing independent intron coordinates, and output intron retention events based on a set of criteria that filter for reliable IR events. These criteria involves the number of reads/fragments in intronic regions, FPKM, junction reads, read distribution patterns within an intron.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-seq read count analysis",
                    "uri": "http://edamontology.org/operation_3563"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/genemine/iread",
    "language": [
        "Perl",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-11T09:56:39Z",
    "name": "iREAD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6541-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Intron retention (IR) has been traditionally overlooked as 'noise' and received negligible attention in the field of gene expression analysis. In recent years, IR has become an emerging field for interrogating transcriptomes because it has been recognized to carry out important biological functions such as gene expression regulation and it has been found to be associated with complex diseases such as cancers. However, methods for detecting IR today are limited. Thus, there is a need to develop novel methods to improve IR detection. Results: Here we present iREAD (intron REtention Analysis and Detector), a tool to detect IR events genome-wide from high-throughput RNA-seq data. The command line interface for iREAD is implemented in Python. iREAD takes as input a BAM file, representing the transcriptome, and a text file containing the intron coordinates of a genome. It then 1) counts all reads that overlap intron regions, 2) detects IR events by analyzing the features of reads such as depth and distribution patterns, and 3) outputs a list of retained introns into a tab-delimited text file. iREAD provides significant added value in detecting IR compared with output from IRFinder with a higher AUC on all datasets tested. Both methods showed low false positive rates and high false negative rates in different regimes, indicating that use together is generally beneficial. The output from iREAD can be directly used for further exploratory analysis such as differential intron expression and functional enrichment. The software is freely available at https://github.com/genemine/iread. Conclusion: Being complementary to existing tools, iREAD provides a new and generic tool to interrogate poly-A enriched transcriptomic data of intron regions. Intron retention analysis provides a complementary approach for understanding transcriptome.",
                "authors": [
                    {
                        "name": "Li H.-D."
                    },
                    {
                        "name": "Funk C.C."
                    },
                    {
                        "name": "Price N.D."
                    }
                ],
                "citationCount": 9,
                "date": "2020-02-06T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "IREAD: A tool for intron retention detection from RNA-seq data"
            },
            "pmcid": "PMC7006120",
            "pmid": "32028886"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}