{
    "additionDate": "2021-12-13T12:44:15.273022Z",
    "biotoolsCURIE": "biotools:vaximmutordb",
    "biotoolsID": "vaximmutordb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wug@ohsu.edu",
            "name": "Guanming Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yongqunh@med.umich.edu",
            "name": "Yongqun He",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "VaximmutorDB is database for vaccine immune factors. A \"vaximmutor\" is coined here to represent an immune factors that is triggered by a vaccination and plays a role in vaccine-induced host immunity. Vaximmuntors are specifically targeted by the innate or acquired immune system of the host and are able to induce acquired immunity and protection in the host against infectious and non-infectious diseases. Vaximmutors play important roles in development of vaccines and biological markers for disease diagnosis and analysis of fundamental host immunity against diseases. VaximmutorDB is a web-based central database and analysis system that curates, stores, and analyzes various vaccine-induced immune factors (i.e., Vaximmutors).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                }
            ]
        }
    ],
    "homepage": "http://www.violinet.org/vaximmutordb",
    "lastUpdate": "2021-12-13T12:44:15.275657Z",
    "name": "VaximmutorDB",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2021.639491",
            "metadata": {
                "abstract": "© Copyright © 2021 Berke, Sun, Ong, Sanati, Huffman, Brunson, Loney, Ostrow, Racz, Zhao, Xiang, Masci, Zheng, Wu and He.Vaccines stimulate various immune factors critical to protective immune responses. However, a comprehensive picture of vaccine-induced immune factors and pathways have not been systematically collected and analyzed. To address this issue, we developed VaximmutorDB, a web-based database system of vaccine immune factors (abbreviated as “vaximmutors”) manually curated from peer-reviewed articles. VaximmutorDB currently stores 1,740 vaccine immune factors from 13 host species (e.g., human, mouse, and pig). These vaximmutors were induced by 154 vaccines for 46 pathogens. Top 10 vaximmutors include three antibodies (IgG, IgG2a and IgG1), Th1 immune factors (IFN-γ and IL-2), Th2 immune factors (IL-4 and IL-6), TNF-α, CASP-1, and TLR8. Many enriched host processes (e.g., stimulatory C-type lectin receptor signaling pathway, SRP-dependent cotranslational protein targeting to membrane) and cellular components (e.g., extracellular exosome, nucleoplasm) by all the vaximmutors were identified. Using influenza as a model, live attenuated and killed inactivated influenza vaccines stimulate many shared pathways such as signaling of many interleukins (including IL-1, IL-4, IL-6, IL-13, IL-20, and IL-27), interferon signaling, MARK1 activation, and neutrophil degranulation. However, they also present their unique response patterns. While live attenuated influenza vaccine FluMist induced significant signal transduction responses, killed inactivated influenza vaccine Fluarix induced significant metabolism of protein responses. Two different Yellow Fever vaccine (YF-Vax) studies resulted in overlapping gene lists; however, they shared more portions of pathways than gene lists. Interestingly, live attenuated YF-Vax simulates significant metabolism of protein responses, which was similar to the pattern induced by killed inactivated Fluarix. A user-friendly web interface was generated to access, browse and search the VaximmutorDB database information. As the first web-based database of vaccine immune factors, VaximmutorDB provides systematical collection, standardization, storage, and analysis of experimentally verified vaccine immune factors, supporting better understanding of protective vaccine immunity.",
                "authors": [
                    {
                        "name": "Berke K."
                    },
                    {
                        "name": "Sun P."
                    },
                    {
                        "name": "Ong E."
                    },
                    {
                        "name": "Sanati N."
                    },
                    {
                        "name": "Huffman A."
                    },
                    {
                        "name": "Brunson T."
                    },
                    {
                        "name": "Loney F."
                    },
                    {
                        "name": "Ostrow J."
                    },
                    {
                        "name": "Racz R."
                    },
                    {
                        "name": "Zhao B."
                    },
                    {
                        "name": "Xiang Z."
                    },
                    {
                        "name": "Masci A.M."
                    },
                    {
                        "name": "Zheng J."
                    },
                    {
                        "name": "Wu G."
                    },
                    {
                        "name": "He Y."
                    }
                ],
                "date": "2021-03-12T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "VaximmutorDB: A Web-Based Vaccine Immune Factor Database and Its Application for Understanding Vaccine-Induced Immune Mechanisms"
            },
            "pmcid": "PMC7994782",
            "pmid": "33777032",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Vaccinology",
            "uri": "http://edamontology.org/topic_3966"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        }
    ]
}