
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Tomography",
                "uri": "http://edamontology.org/topic_3452"
            },
            {
                "term": "Mathematics",
                "uri": "http://edamontology.org/topic_3315"
            },
            {
                "term": "Physics",
                "uri": "http://edamontology.org/topic_3318"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Monte Carlo (MC) simulation method plays an essential role in the refinement and development of positron emission tomography (PET) systems. However, most existing MC simulation packages suffer from long execution time for practical PET simulations. To fully address this issue, we developed and validated gPET, a graphics processing unit (GPU)-based MC simulation tool for PET. gPET was built on the NVidia CUDA platform. The simulation process was modularized into three functional parts and carried out by the GPU parallel threads: (1) source management, including positron decay, transport and annihilation; (2) gamma transport inside the phantom; and (3) signal detection and processing inside the detector. A hybrid of voxelized (for patient phantoms) and parametrized (for detectors) geometries were employed to sufficiently support particle navigations. Multiple inputs and outputs were available. Hence, a user can flexibly examine different aspects of a PET simulation. We evaluated the performance of gPET in three test cases with benchmark work from GATE8.0, in terms of the testing of the functional modules, the physics models used for gamma transport inside the detector, and the geometric configuration of an irregularly shaped PET detector. Both accuracy and efficiency were quantified. In all test cases, the differences between gPET and GATE for the coincidences with respect to the energy and crystal index distributions are below 3.18% and 2.54%, respectively. The speedup factor is 500 for gPET on a single Titan Xp GPU (1.58 GHz) over GATE8.0 on a single core of Intel i7-6850K CPU (3.6 GHz) for all test cases. In summary, gPET is an accurate and efficient MC simulation tool for PET.",
            "authors": [
                "Lai Y.",
                "Zhong Y.",
                "Chalise A.",
                "Shao Y.",
                "Jin M.",
                "Jia X.",
                "Chi Y."
            ],
            "cit_count": 0,
            "doi": "10.1088/1361-6560/AB5610",
            "journal": "Physics in medicine and biology",
            "pmid": "31711051",
            "title": "gPET: a GPU-based, accurate and efficient Monte Carlo simulation tool for PET",
            "year": "2019-12-13"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gPET",
        "biotoolsID": "gPET",
        "description": "a GPU-based, accurate and efficient Monte Carlo simulation tool for PET.\n\nMonte Carlo (MC) simulation method plays an essential role in the refinement and development of positron emission tomography (PET) systems. However, most existing MC simulation packages suffer from long execution time for practical PET simulations. To fully address this issue, we developed and validated gPET, a graphics processing unit (GPU)-based MC simulation tool for PET. gPET was built on the NVidia CUDA platform. The simulation process was modularized into three functional parts and carried out by the GPU parallel threads: (1) source management, including positron decay, transport and annihilation; (2) gamma transport inside the phantom; and (3) signal detection and processing inside the detector. A hybrid of voxelized (for patient phantoms) and parametrized (for detectors) geometries were employed to sufficiently support particle navigations.\n\n||| HOMEPAGE MISSING!",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31711051",
        "name": "gPET"
    }
}