{
    "additionDate": "2021-06-14T13:36:03Z",
    "biotoolsCURIE": "biotools:complexfinder",
    "biotoolsID": "complexfinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "h.nolte@age.mpg.de",
            "name": "Hendrik Nolte",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ComplexFinder is a software package for the analysis of native protein complex fractionation experiments. It finds complexes from Blue-Native and SEC Fractionation analyzed by Liquid Chromatogrpahy coupled to Mass Spectrometry. In principal it works with any separation technique resulting in co-elution signal profiles.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SILAC",
                    "uri": "http://edamontology.org/operation_3638"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Label-free quantification",
                    "uri": "http://edamontology.org/operation_3634"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hnolCol/ComplexFinder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-23T14:02:04.264756Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hnolCol/ComplexFinder/issues"
        }
    ],
    "name": "ComplexFinder",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.BBABIO.2021.148444",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Identification of protein complexes and quantitative distribution of a single protein across different complexes are fundamental to unravel cellular mechanisms and of biological and clinical relevance. A recently introduced method, complexome profiling, combines fractionation techniques to separate native protein complexes with high-resolution mass spectrometry and allows to identify protein complexes in an unbiased manner. Due to recent advances in mass spectrometry instrumentation, the analysis time can be reduced dramatically while the coverage of thousands of proteins remains constant, which leads to an increased data acquisition rate and reduces the burden to initiate such complex experiments. Therefore, the development of novel computational pipelines for the analysis of such comprehensive complexome profiles is required. Usually, potential complex formations are assembled by correlation analysis. However, a major challenge in such an analysis is, that a protein can occur in multiple complexes of varying composition. Hence, signal profiles of proteins of the same complex might show high local similarities but do correlate poorly over all acquired fractions. Here, we describe ComplexFinder; a python-based computational pipeline that enables machine-learning based prediction of novel protein-protein interactions incorporating numerous measures of distance between signal profiles. Importantly, each signal profile is represented by an ensemble of peak-like models. These models allow the calculation of local similarities, enabling peak-centric comparison between biological conditions and the estimation of the composition of specific complexes. From the predicted protein-protein interactions, a protein connectivity network is constructed, which is used to assemble proteins into macromolecular complexes incorporating peak-centric information. ComplexFinder enables the peak-centric analysis of complexome profiling data utilizing various LC-MS/MS quantification strategies including label-free, SILAC, TMT as well as pulseSILAC. The source code is freely available at https://github.com/hnolcol/ComplexFinder.",
                "authors": [
                    {
                        "name": "Nolte H."
                    },
                    {
                        "name": "Langer T."
                    }
                ],
                "citationCount": 1,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Bioenergetics",
                "title": "ComplexFinder: A software package for the analysis of native protein complex fractionation experiments"
            },
            "pmid": "33940038",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}