{
    "additionDate": "2019-11-14T18:15:24Z",
    "biotoolsCURIE": "biotools:CMDO",
    "biotoolsID": "CMDO",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lifen@hanyang.ac.kr",
            "name": "Young Soo Song",
            "typeEntity": "Person"
        },
        {
            "email": "juhan@snu.ac.kr",
            "name": "Ju Han Kim",
            "orcidid": "https://orcid.org/0000-0003-1522-9038",
            "typeEntity": "Person"
        }
    ],
    "description": "A simple classification scheme for data elements of clinical data based on semantics",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                }
            ]
        }
    ],
    "homepage": "http://www.snubi.org/software/CMDO/",
    "lastUpdate": "2020-12-16T15:41:36Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bioportal.bioontology.org/ontologies/CMDO/"
        }
    ],
    "name": "Clinical MetaData Ontology (CMDO)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0877-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The increasing use of common data elements (CDEs) in numerous research projects and clinical applications has made it imperative to create an effective classification scheme for the efficient management of these data elements. We applied high-level integrative modeling of entire clinical documents from real-world practice to create the Clinical MetaData Ontology (CMDO) for the appropriate classification and integration of CDEs that are in practical use in current clinical documents. Methods: CMDO was developed using the General Formal Ontology method with a manual iterative process comprising five steps: (1) defining the scope of CMDO by conceptualizing its first-level terms based on an analysis of clinical-practice procedures, (2) identifying CMDO concepts for representing clinical data of general CDEs by examining how and what clinical data are generated with flows of clinical care practices, (3) assigning hierarchical relationships for CMDO concepts, (4) developing CMDO properties (e.g., synonyms, preferred terms, and definitions) for each CMDO concept, and (5) evaluating the utility of CMDO. Results: We created CMDO comprising 189 concepts under the 4 first-level classes of Description, Event, Finding, and Procedure. CMDO has 256 definitions that cover the 189 CMDO concepts, with 459 synonyms for 139 (74.0%) of the concepts. All of the CDEs extracted from 6 HL7 templates, 25 clinical documents of 5 teaching hospitals, and 1 personal health record specification were successfully annotated by 41 (21.9%), 89 (47.6%), and 13 (7.0%) of the CMDO concepts, respectively. We created a CMDO Browser to facilitate navigation of the CMDO concept hierarchy and a CMDO-enabled CDE Browser for displaying the relationships between CMDO concepts and the CDEs extracted from the clinical documents that are used in current practice. Conclusions: CMDO is an ontology and classification scheme for CDEs used in clinical documents. Given the increasing use of CDEs in many studies and real-world clinical documentation, CMDO will be a useful tool for integrating numerous CDEs from different research projects and clinical documents. The CMDO Browser and CMDO-enabled CDE Browser make it easy to search, share, and reuse CDEs, and also effectively integrate and manage CDEs from different studies and clinical documents.",
                "authors": [
                    {
                        "name": "Kim H.H."
                    },
                    {
                        "name": "Park Y.R."
                    },
                    {
                        "name": "Lee K.H."
                    },
                    {
                        "name": "Song Y.S."
                    },
                    {
                        "name": "Kim J.H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-20T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Clinical MetaData ontology: A simple classification scheme for data elements of clinical data based on semantics"
            },
            "pmcid": "PMC6701018",
            "pmid": "31429750"
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}