{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-01T12:31:16.250059Z",
    "biotoolsCURIE": "biotools:excessmort",
    "biotoolsID": "excessmort",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Acosta, Rolando J."
        },
        {
            "name": "Irizarry, Rafael A."
        }
    ],
    "description": "A Flexible Statistical Framework for Estimating Excess Mortality.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://cran.r-project.org/web/packages/excessmort/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-01T12:31:16.252521Z",
    "license": "Artistic-2.0",
    "name": "excessmort",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1097/EDE.0000000000001445",
            "metadata": {
                "abstract": "© 2022 Lippincott Williams and Wilkins. All rights reserved.Quantifying the impact of natural disasters or epidemics is critical for guiding policy decisions and interventions. When the effects of an event are long-lasting and difficult to detect in the short term, the accumulated effects can be devastating. Mortality is one of the most reliably measured health outcomes, partly due to its unambiguous definition. As a result, excess mortality estimates are an increasingly effective approach for quantifying the effect of an event. However, the fact that indirect effects are often characterized by small, but enduring, increases in mortality rates present a statistical challenge. This is compounded by sources of variability introduced by demographic changes, secular trends, seasonal and day of the week effects, and natural variation. Here, we present a model that accounts for these sources of variability and characterizes concerning increases in mortality rates with smooth functions of time that provide statistical power. The model permits discontinuities in the smooth functions to model sudden increases due to direct effects. We implement a flexible estimation approach that permits both surveillance of concerning increases in mortality rates and careful characterization of the effect of a past event. We demonstrate our tools' utility by estimating excess mortality after hurricanes in the United States and Puerto Rico. We use Hurricane Maria as a case study to show appealing properties that are unique to our method compared with current approaches. Finally, we show the flexibility of our approach by detecting and quantifying the 2014 Chikungunya outbreak in Puerto Rico and the COVID-19 pandemic in the United States. We make our tools available through the excessmort R package available from https://cran.r-project.org/web/packages/excessmort/.",
                "authors": [
                    {
                        "name": "Acosta R.J."
                    },
                    {
                        "name": "Irizarry R.A."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Epidemiology",
                "title": "A Flexible Statistical Framework for Estimating Excess Mortality"
            },
            "pmid": "35383642"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
