{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:07:25Z",
    "biotoolsCURIE": "biotools:DoGNet",
    "biotoolsID": "DoGNet",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "v.kulikov@skoltech.ru",
            "name": "Victor Kulikov",
            "orcidid": "https://orcid.org/0000-0002-4264-8572",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Deep architecture for synapse detection in multiplexed fluorescence images.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/kulikovv/dognet/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kulikovv/dognet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/kulikovv/dognet/issues"
        }
    ],
    "maturity": "Mature",
    "name": "DoGNet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007012",
            "metadata": {
                "abstract": "© 2019 Kulikov et al.Neuronal synapses transmit electrochemical signals between cells through the coordinated action of presynaptic vesicles, ion channels, scaffolding and adapter proteins, and membrane receptors. In situ structural characterization of numerous synaptic proteins simultaneously through multiplexed imaging facilitates a bottom-up approach to synapse classification and phenotypic description. Objective automation of efficient and reliable synapse detection within these datasets is essential for the high-throughput investigation of synaptic features. Convolutional neural networks can solve this generalized problem of synapse detection, however, these architectures require large numbers of training examples to optimize their thousands of parameters. We propose DoGNet, a neural network architecture that closes the gap between classical computer vision blob detectors, such as Difference of Gaussians (DoG) filters, and modern convolutional networks. DoGNet is optimized to analyze highly multiplexed microscopy data. Its small number of training parameters allows DoGNet to be trained with few examples, which facilitates its application to new datasets without overfitting. We evaluate the method on multiplexed fluorescence imaging data from both primary mouse neuronal cultures and mouse cortex tissue slices. We show that DoG-Net outperforms convolutional networks with a low-to-moderate number of training examples, and DoGNet is efficiently transferred between datasets collected from separate research groups. DoGNet synapse localizations can then be used to guide the segmentation of individual synaptic protein locations and spatial extents, revealing their spatial organization and relative abundances within individual synapses. The source code is publicly available: https://github.com/kulikovv/dognet.",
                "authors": [
                    {
                        "name": "Kulikov V."
                    },
                    {
                        "name": "Guo S.-M."
                    },
                    {
                        "name": "Stone M."
                    },
                    {
                        "name": "Goodman A."
                    },
                    {
                        "name": "Carpenter A."
                    },
                    {
                        "name": "Bathe M."
                    },
                    {
                        "name": "Lempitsky V."
                    }
                ],
                "citationCount": 3,
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "DoGNet: A deep architecture for synapse detection in multiplexed fluorescence images"
            },
            "pmcid": "PMC6533009",
            "pmid": "31083649",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        }
    ],
    "validated": 1
}