{
    "additionDate": "2015-04-24T11:30:35Z",
    "biotoolsCURIE": "biotools:blossoc",
    "biotoolsID": "blossoc",
    "credit": [
        {
            "email": "mailund@birc.au.dk",
            "name": "Thomas Mailund",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "birc.au.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Block-Association Mapping.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.daimi.au.dk/~mailund/Blossoc/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Haplotype map",
                        "uri": "http://edamontology.org/data_1863"
                    }
                },
                {
                    "data": {
                        "term": "Sequence coordinates",
                        "uri": "http://edamontology.org/data_2012"
                    }
                }
            ],
            "note": "Blossoc is a linkage disequilibrium association mapping tool A file containing the positions of markers A file containing haplotype data",
            "operation": [
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.daimi.au.dk/~mailund/Blossoc/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-25T14:19:01.506114Z",
    "name": "Blossoc",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "runef@birc.au.dk",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-454",
            "metadata": {
                "abstract": "Background: With current technology, vast amounts of data can be cheaply and efficiently produced in association studies, and to prevent data analysis to become the bottleneck of studies, fast and efficient analysis methods that scale to such data set sizes must be developed. Results: We present a fast method for accurate localisation of disease causing variants in high density case-control association mapping experiments with large numbers of cases and controls. The method searches for significant clustering of case chromosomes in the \"perfect\" phylogenetic tree defined by the largest region around each marker that is compatible with a single phylogenetic tree. This perfect phylogenetic tree is treated as a decision tree for determining disease status, and scored by its accuracy as a decision tree. The rationale for this is that the perfect phylogeny near a disease affecting mutation should provide more information about the affected/unaffected classification than random trees. If regions of compatibility contain few markers, due to e.g. large marker spacing, the algorithm can allow the inclusion of incompatibility markers in order to enlarge the regions prior to estimating their phylogeny. Haplotype data and phased genotype data can be analysed. The power and efficiency of the method is investigated on 1) simulated genotype data under different models of disease determination 2) artificial data sets created from the HapMap ressource, and 3) data sets used for testing of other methods in order to compare with these. Our method has the same accuracy as single marker association (SMA) in the simplest case of a single disease causing mutation and a constant recombination rate. However, when it comes to more complex scenarios of mutation heterogeneity and more complex haplotype structure such as found in the HapMap data our method outperforms SMA as well as other fast, data mining approaches such as HapMiner and Haplotype Pattern Mining (HPM) despite being significantly faster. For unphased genotype data, an initial step of estimating the phase only slightly decreases the power of the method. The method was also found to accurately localise the known susceptibility variants in an empirical data set - the ΔF508 mutation for cystic fibrosis - where the susceptibility variant is already known - and to find significant signals for association between the CYP2D6 gene and poor drug metabolism, although for this dataset the highest association score is about 60 kb from the CYP2D6 gene. Conclusion: Our method has been implemented in the Blossoc (BLOck aSSOCiation) software. Using Blossoc, genome wide chip-based surveys of 3 million SNPs in 1000 cases and 1000 controls can be analysed in less than two CPU hours. © 2006 Mailund et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Besenbacher S."
                    },
                    {
                        "name": "Mailund T."
                    },
                    {
                        "name": "Schierup M.H."
                    }
                ],
                "citationCount": 33,
                "date": "2006-10-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Whole genome association mapping by incompatibilities and local perfect phylogenies"
            },
            "pmcid": "PMC1624851",
            "pmid": "17042942",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1534/genetics.108.092643",
            "metadata": {
                "abstract": "We present a new method, termed QBlossoc, for linkage disequilibrium (LD) mapping of genetic variants underlying a quantitative trait. The method uses principles similar to a previously published method, Blossoc, for LD mapping of case/control studies. The method builds local genealogies along the genome and looks for a significant clustering of quantitative trait values in these trees. We analyze its efficiency in terms of localization and ranking of true positives among a large number of negatives and compare the results with single-marker approaches. Simulation results of markers at densities comparable to contemporary genotype chips show that QBlossoc is more accurate in localization of true positives as expected since it uses the additional information of LD between markers simultaneously. More importantly, however, for genomewide surveys, QBlossoc places regions with true positives higher on a ranked list than single-marker approaches, again suggesting that a true signal displays itself more strongly in a set of adjacent markers than a spurious (false) signal. The method is both memory and central processing unit (CPU) efficient. It has been tested on a real data set of height data for 5000 individuals measured at ∼317,000 markers and completed analysis within 5 CPU days. Copyright © 2009 by the Genetics Society of America.",
                "authors": [
                    {
                        "name": "Besenbacher S."
                    },
                    {
                        "name": "Mailund T."
                    },
                    {
                        "name": "Schierup M.H."
                    }
                ],
                "citationCount": 14,
                "date": "2009-02-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Local phylogeny mapping of quantitative traits: Higher accuracy and better ranking than single-marker association in genomewide scans"
            },
            "pmcid": "PMC2644962",
            "pmid": "19064712",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.0"
    ]
}
