{
    "accessibility": "Open access",
    "additionDate": "2023-01-09T01:07:21.921693Z",
    "biotoolsCURIE": "biotools:efmsdti",
    "biotoolsID": "efmsdti",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yyzhang1217@163.com",
            "name": "Yuanyuan Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Mengjie Wu"
        },
        {
            "name": "Shudong Wang"
        },
        {
            "name": "Wei Chen"
        }
    ],
    "description": "Drug-target interaction prediction based on an efficient fusion of multi-source data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://github.com/meng-jie/EFMSDTI",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:13:38.324187Z",
    "license": "Not licensed",
    "name": "EFMSDTI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fphar.2022.1009996",
            "metadata": {
                "abstract": "Accurate identification of Drug Target Interactions (DTIs) is of great significance for understanding the mechanism of drug treatment and discovering new drugs for disease treatment. Currently, computational methods of DTIs prediction that combine drug and target multi-source data can effectively reduce the cost and time of drug development. However, in multi-source data processing, the contribution of different source data to DTIs is often not considered. Therefore, how to make full use of the contribution of different source data to predict DTIs for efficient fusion is the key to improving the prediction accuracy of DTIs. In this paper, considering the contribution of different source data to DTIs prediction, a DTIs prediction approach based on an effective fusion of drug and target multi-source data is proposed, named EFMSDTI. EFMSDTI first builds 15 similarity networks based on multi-source information networks classified as topological and semantic graphs of drugs and targets according to their biological characteristics. Then, the multi-networks are fused by selective and entropy weighting based on similarity network fusion (SNF) according to their contribution to DTIs prediction. The deep neural networks model learns the embedding of low-dimensional vectors of drugs and targets. Finally, the LightGBM algorithm based on Gradient Boosting Decision Tree (GBDT) is used to complete DTIs prediction. Experimental results show that EFMSDTI has better performance (AUROC and AUPR are 0.982) than several state-of-the-art algorithms. Also, it has a good effect on analyzing the top 1000 prediction results, while 990 of the first 1000DTIs were confirmed. Code and data are available at https://github.com/meng-jie/EFMSDTI.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2022-09-23T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "EFMSDTI: Drug-target interaction prediction based on an efficient fusion of multi-source data"
            },
            "pmcid": "PMC9538487",
            "pmid": "36210804"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
