{
    "additionDate": "2021-06-14T13:27:05Z",
    "biotoolsCURIE": "biotools:cancersiamese",
    "biotoolsID": "cancersiamese",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yufei.huang@utsa.edu",
            "name": "Yufei Huang",
            "orcidid": "https://orcid.org/0000-0001-6268-5357",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "cheny8@uthscsa.edu",
            "name": "Yidong Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CancerSiamese is a tool for one-shot learning for predicting primary and metastatic tumor types unseen during model training.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MMostavi/CancerSiamese",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-18T11:35:46Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MMostavi/CancerSiamese/issues"
        }
    ],
    "name": "CancerSiamese",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04157-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The state-of-the-art deep learning based cancer type prediction can only predict cancer types whose samples are available during the training where the sample size is commonly large. In this paper, we consider how to utilize the existing training samples to predict cancer types unseen during the training. We hypothesize the existence of a set of type-agnostic expression representations that define the similarity/dissimilarity between samples of the same/different types and propose a novel one-shot learning model called CancerSiamese to learn this common representation. CancerSiamese accepts a pair of query and support samples (gene expression profiles) and learns the representation of similar or dissimilar cancer types through two parallel convolutional neural networks joined by a similarity function. Results: We trained CancerSiamese for cancer type prediction for primary and metastatic tumors using samples from the Cancer Genome Atlas (TCGA) and MET500. Network transfer learning was utilized to facilitate the training of the CancerSiamese models. CancerSiamese was tested for different N-way predictions and yielded an average accuracy improvement of 8% and 4% over the benchmark 1-Nearest Neighbor (1-NN) classifier for primary and metastatic tumors, respectively. Moreover, we applied the guided gradient saliency map and feature selection to CancerSiamese to examine 100 and 200 top marker-gene candidates for the prediction of primary and metastatic cancers, respectively. Functional analysis of these marker genes revealed several cancer related functions between primary and metastatic tumors. Conclusion: This work demonstrated, for the first time, the feasibility of predicting unseen cancer types whose samples are limited. Thus, it could inspire new and ingenious applications of one-shot and few-shot learning solutions for improving cancer diagnosis, prognostic, and our understanding of cancer.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Chiu Y.-C."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Mostavi M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CancerSiamese: one-shot learning for predicting primary and metastatic tumor types unseen during model training"
            },
            "pmcid": "PMC8117642",
            "pmid": "33980137",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
