{
    "additionDate": "2018-07-13T09:00:29Z",
    "biotoolsCURIE": "biotools:rgmql",
    "biotoolsID": "rgmql",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "simonepallotta@hotmail.com",
            "name": "Simone Pallotta",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "This package brings the GenoMetric Query Language functionalities into the R environment. It is a high-level, declarative language to manage heterogeneous genomic datasets for biomedical purposes, using simple queries to process genomic regions and their metadata and properties. It adopts algorithms efficiently designed for big data using cloud-computing technologies allowing GMQL to run on modern infrastructures, in order to achieve scalability and high performance.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/manuals/RGMQL/man/RGMQL.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/RGMQL_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-POLIMI"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/RGMQL.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:28:57.471652Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://bioconductor.org/packages/RGMQL/"
        },
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://git.bioconductor.org/packages/RGMQL"
        }
    ],
    "name": "RGMQL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04648-4",
            "metadata": {
                "abstract": "Background: Heterogeneous omics data, increasingly collected through high-throughput technologies, can contain hidden answers to very important and still unsolved biomedical questions. Their integration and processing are crucial mostly for tertiary analysis of Next Generation Sequencing data, although suitable big data strategies still address mainly primary and secondary analysis. Hence, there is a pressing need for algorithms specifically designed to explore big omics datasets, capable of ensuring scalability and interoperability, possibly relying on high-performance computing infrastructures. Results: We propose RGMQL, a R/Bioconductor package conceived to provide a set of specialized functions to extract, combine, process and compare omics datasets and their metadata from different and differently localized sources. RGMQL is built over the GenoMetric Query Language (GMQL) data management and computational engine, and can leverage its open curated repository as well as its cloud-based resources, with the possibility of outsourcing computational tasks to GMQL remote services. Furthermore, it overcomes the limits of the GMQL declarative syntax, by guaranteeing a procedural approach in dealing with omics data within the R/Bioconductor environment. But mostly, it provides full interoperability with other packages of the R/Bioconductor framework and extensibility over the most used genomic data structures and processing functions. Conclusions: RGMQL is able to combine the query expressiveness and computational efficiency of GMQL with a complete processing flow in the R environment, being a fully integrated extension of the R/Bioconductor framework. Here we provide three fully reproducible example use cases of biological relevance that are particularly explanatory of its flexibility of use and interoperability with other R/Bioconductor packages. They show how RGMQL can easily scale up from local to parallel and cloud computing while it combines and analyzes heterogeneous omics data from local or remote datasets, both public and private, in a completely transparent way to the user.",
                "authors": [
                    {
                        "name": "Cascianelli S."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Pallotta S."
                    }
                ],
                "citationCount": 4,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RGMQL: scalable and interoperable computing of heterogeneous omics big data and metadata in R/Bioconductor"
            },
            "pmcid": "PMC8991469",
            "pmid": "35392801"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}
