{
    "additionDate": "2017-08-03T18:36:13Z",
    "biotoolsCURIE": "biotools:allerdictor",
    "biotoolsID": "allerdictor",
    "credit": [
        {
            "email": "hd@vt.edu",
            "name": "Ha Dang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.vbi.vt.edu/about/group/Lawrence-Research-Group"
        }
    ],
    "description": "Fast and accurate sequence-based allergen prediction tool that models protein sequences as text documents and employs support vector machine in text classification for allergen prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://allerdictor.vbi.vt.edu/home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://allerdictor.vbi.vt.edu/",
    "lastUpdate": "2024-11-25T14:19:21.319247Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/allerdictor-fast-allergen-prediction-using-text-classification-with-svm.html"
        }
    ],
    "name": "Allerdictor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu004",
            "metadata": {
                "abstract": "Motivation: Accurately identifying and eliminating allergens from biotechnology-derived products are important for human health. From a biomedical research perspective, it is also important to identify allergens in sequenced genomes. Many allergen prediction tools have been developed during the past years. Although these tools have achieved certain levels of specificity, when applied to large-scale allergen discovery (e.g. at a whole-genome scale), they still yield many false positives and thus low precision (even at low recall) due to the extreme skewness of the data (allergens are rare). Moreover, the most accurate tools are relatively slow because they use protein sequence alignment to build feature vectors for allergen classifiers. Additionally, only web server implementations of the current allergen prediction tools are publicly available and are without the capability of large batch submission. These weaknesses make large-scale allergen discovery ineffective and inefficient in the public domain.Results: We developed Allerdictor, a fast and accurate sequence-based allergen prediction tool that models protein sequences as text documents and uses support vector machine in text classification for allergen prediction. Test results on multiple highly skewed datasets demonstrated that Allerdictor predicted allergens with high precision over high recall at fast speed. For example, Allerdictor only took ∼6 min on a single core PC to scan a whole Swiss-Prot database of ∼540 000 sequences and identified <1% of them as allergens. © 2014 The Author.",
                "authors": [
                    {
                        "name": "Dang H.X."
                    },
                    {
                        "name": "Lawrence C.B."
                    }
                ],
                "citationCount": 48,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Allerdictor: Fast allergen prediction using text classification techniques"
            },
            "pmcid": "PMC3982160",
            "pmid": "24403538"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}
