{
    "additionDate": "2021-01-18T09:43:46Z",
    "biotoolsCURIE": "biotools:deepsmp",
    "biotoolsID": "deepsmp",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Wei Du",
            "typeEntity": "Person"
        }
    ],
    "description": "DEEPSMP is a deep learning model for predicting the ectodomain shedding events of membrane proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "http://www.csbg-jlu.info/DeepSMP/",
    "lastUpdate": "2021-02-27T15:15:10Z",
    "name": "DEEPSMP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1142/S0219720020500171",
            "metadata": {
                "abstract": "© 2020 World Scientific Publishing Europe Ltd.Membrane proteins play essential roles in modern medicine. In recent studies, some membrane proteins involved in ectodomain shedding events have been reported as the potential drug targets and biomarkers of some serious diseases. However, there are few effective tools for identifying the shedding event of membrane proteins. So, it is necessary to design an effective tool for predicting shedding event of membrane proteins. In this study, we design an end-to-end prediction model using deep neural networks with long short-term memory (LSTM) units and attention mechanism, to predict the ectodomain shedding events of membrane proteins only by sequence information. Firstly, the evolutional profiles are encoded from original sequences of these proteins by Position-Specific Iterated BLAST (PSI-BLAST) on Uniref50 database. Then, the LSTM units which contain memory cells are used to hold information from past inputs to the network and the attention mechanism is applied to detect sorting signals in proteins regardless of their position in the sequence. Finally, a fully connected dense layer and a softmax layer are used to obtain the final prediction results. Additionally, we also try to reduce overfitting of the model by using dropout, L2 regularization, and bagging ensemble learning in the model training process. In order to ensure the fairness of performance comparison, firstly we use cross validation process on training dataset obtained from an existing paper. The average accuracy and area under a receiver operating characteristic curve (AUC) of five-fold cross-validation are 81.19% and 0.835 using our proposed model, compared to 75% and 0.78 by a previously published tool, respectively. To better validate the performance of the proposed model, we also evaluate the performance of the proposed model on independent test dataset. The accuracy, sensitivity, and specificity are 83.14%, 84.08%, and 81.63% using our proposed model, compared to 70.20%, 71.97%, and 67.35% by the existing model. The experimental results validate that the proposed model can be regarded as a general tool for predicting ectodomain shedding events of membrane proteins. The pipeline of the model and prediction results can be accessed at the following URL: http://www.csbg-jlu.info/DeepSMP/.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Cao Z."
                    },
                    {
                        "name": "Du W."
                    },
                    {
                        "name": "Li G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "DEEPSMP: A deep learning model for predicting the ectodomain shedding events of membrane proteins"
            },
            "pmid": "32576054"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
