{
    "accessibility": [],
    "additionDate": "2018-07-03T15:51:46Z",
    "biotoolsCURIE": "biotools:psamm",
    "biotoolsID": "psamm",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "yingzhang@uri.edu",
            "gridid": null,
            "name": "Ying Zhang",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Open source software that is designed for the curation and analysis of metabolic models. It supports model version tracking, model annotation, data integration, data parsing and formatting, consistency checking, automatic gap filling, and model simulations.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://psamm.readthedocs.io/en/stable/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://zhanglab.github.io/psamm/",
    "homepage_status": 0,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "PSAMM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0192891",
            "metadata": {
                "abstract": "© 2018 Steffensen et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The metabolism of individual organisms and biological communities can be viewed as a network of metabolites connected to each other through chemical reactions. In metabolic networks, chemical reactions transform reactants into products, thereby transferring elements between these metabolites. Knowledge of how elements are transferred through reactant/ product pairs allows for the identification of primary compound connections through a metabolic network. However, such information is not readily available and is often challenging to obtain for large reaction databases or genome-scale metabolic models. In this study, a new algorithm was developed for automatically predicting the element-transferring reactant/ product pairs using the limited information available in the standard representation of metabolic networks. The algorithm demonstrated high efficiency in analyzing large datasets and provided accurate predictions when benchmarked with manually curated data. Applying the algorithm to the visualization of metabolic networks highlighted pathways of primary reactant/product connections and provided an organized view of element-transferring biochemical transformations. The algorithm was implemented as a new function in the open source software package PSAMM in the release v0.30 (https://zhanglab.github.io/psamm/).",
                "authors": [
                    {
                        "name": "Steffensen J.L."
                    },
                    {
                        "name": "Dufault-Thompson K."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 0,
                "date": "2018-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FindPrimaryPairs: An efficient algorithm for predicting element-transferring reactant/ product pairs in metabolic networks"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": []
}