
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "LGPL-3.0",
        "topic": [
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Physics",
                "uri": "http://edamontology.org/topic_3318"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 OSA - The Optical Society. All rights reserved.AOtools is a Python package that is open-source and aimed at providing tools for adaptive optics users and researchers. We present version 1.0, which contains tools for adaptive optics processing, including analysing data in the pupil plane, images and point spread functions in the focal plane, wavefront sensors, modelling of atmospheric turbulence, physical optical propagation of wavefronts, and conversion between frequently used adaptive optics and astronomical units. The main drivers behind AOtools is that it should be easy to install and use. To achieve this the project features extensive documentation, automated unit testing and is registered on the Python Package Index. AOtools is under continuous active development to expand the features available, and we encourage everyone involved in adaptive optics to become involved and contribute to the project.",
            "authors": [
                "Townson M.J.",
                "Farley O.J.D.",
                "Orban De Xivry G.",
                "Osborn J.",
                "Reeves A.P."
            ],
            "cit_count": 0,
            "doi": "10.1364/OE.27.031316",
            "journal": "Optics Express",
            "pmid": "31684366",
            "title": "Aotools: A Python package for adaptive optics modelling and analysis",
            "year": "2019-10-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:AOtools",
        "biotoolsID": "AOtools",
        "description": "a Python package for adaptive optics modelling and analysis.\n\nCorrectness tests for AOtools modules and functions",
        "homepage": "https://github.com/AOtools/aotools_tests",
        "name": "AOtools"
    }
}