{"credit":[{"email":"manu.sharma@uni-tuebingen.de","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.zbit.uni-tuebingen.de/"}],"documentation":[{"type":"GENERAL","url":"http://www.ra.cs.uni-tuebingen.de/software/MACLEAPS/doc/index.htm"}],"function":[{"operation":[{"term":"Modelling and simulation","uri":"http://edamontology.org/operation_2426"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/macleaps-0-5-machine-learning-analysis-pipeline-genome-wide-accociation-study-snp-data.html"}],"publication":[{"abstract":"The success of genome-wide association studies (GWAS) in deciphering the genetic architecture of complex diseases has fueled the expectations whether the individual risk can also be quantified based on the genetic architecture. So far, disease risk prediction based on top-validated single-nucleotide polymorphisms (SNPs) showed little predictive value. Here, we applied a support vector machine (SVM) to Parkinson disease (PD) and type 1 diabetes (T1D), to show that apart from magnitude of effect size of risk variants, heritability of the disease also plays an important role in disease risk prediction. Furthermore, we performed a simulation study to show the role of uncommon (frequency 1-5%) as well as rare variants (frequency <1%) in disease etiology of complex diseases. Using a cross-validation model, we were able to achieve predictions with an area under the receiver operating characteristic curve (AUC) of ∼0.88 for T1D, highlighting the strong heritable component (∼90%). This is in contrast to PD, where we were unable to achieve a satisfactory prediction (AUC ∼0.56; heritability ∼38%). Our simulations showed that simultaneous inclusion of uncommon and rare variants in GWAS would eventually lead to feasible disease risk prediction for complex diseases such as PD. The used software is available at http://www.ra.cs.uni-tuebingen.de/software/MACLEAPS/. © 2012 Wiley Periodicals, Inc.","authors":["Mittag F.","Buchel F.","Saad M.","Jahn A.","Schulte C.","Bochdanovits Z.","Simon-Sanchez J.","Nalls M.A.","Keller M.","Hernandez D.G.","Gibbs J.R.","Lesage S.","Brice A.","Heutink P.","Martinez M.","Wood N.W.","Hardy J.","Singleton A.B.","Zell A.","Gasser T.","Sharma M."],"cit_count":22,"journal":"Human Mutation","pmid":"22777693","title":"Use of support vector machines for disease risk prediction in genome-wide association studies: Concerns and opportunities","year":"2012-12-01"}],"summary":{"biotoolsCURIE":"biotools:macleaps","biotoolsID":"macleaps","description":"Automated pipeline that uses state-of-the-art machine learning algorithms to create a disease risk model based on a given GWAS SNP dataset and assesses its predictive performance for unseen datasets. The pipeline can either use a first dataset for training the model and a second for validation, or perform a nested k-fold cross-validation on a single dataset.","homepage":"http://www.ra.cs.uni-tuebingen.de/software/MACLEAPS/index.htm","name":"MACLEAPS"}}