{
    "additionDate": "2021-11-29T07:02:48.120197Z",
    "biotoolsCURIE": "biotools:privacy-net",
    "biotoolsID": "privacy-net",
    "confidence_flag": "tool",
    "description": "Privacy-Net is an adversarial approach for identity-obfuscated segmentation of medical images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bachkimn/Privacy-Net-An-Adversarial-Approach-forIdentity-Obfuscated-Segmentation-of-MedicalImages",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-29T07:02:48.122878Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bachkimn/Privacy-Net-An-Adversarial-Approach-forIdentity-Obfuscated-Segmentation-of-MedicalImages/issues"
        }
    ],
    "name": "Privacy-Net",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3065727",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.This paper presents a client/server privacy-preserving network in the context of multicentric medical image analysis. Our approach is based on adversarial learning which encodes images to obfuscate the patient identity while preserving enough information for a target task. Our novel architecture is composed of three components: 1) an encoder network which removes identity-specific features from input medical images, 2) a discriminator network that attempts to identify the subject from the encoded images, 3) a medical image analysis network which analyzes the content of the encoded images (segmentation in our case). By simultaneously fooling the discriminator and optimizing the medical analysis network, the encoder learns to remove privacy-specific features while keeping those essentials for the target task. Our approach is illustrated on the problem of segmenting brain MRI from the large-scale Parkinson Progression Marker Initiative (PPMI) dataset. Using longitudinal data from PPMI, we show that the discriminator learns to heavily distort input images while allowing for highly accurate segmentation results. Our results also demonstrate that an encoder trained on the PPMI dataset can be used for segmenting other datasets, without the need for retraining. The code is made available at: https://github.com/bachkimn/Privacy-Net-An-Adversarial-Approach-forIdentity-Obfuscated-Segmentation-of-MedicalImages",
                "authors": [
                    {
                        "name": "Kim B.N."
                    },
                    {
                        "name": "Dolz J."
                    },
                    {
                        "name": "Jodoin P.-M."
                    },
                    {
                        "name": "Desrosiers C."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Privacy-Net: An Adversarial Approach for Identity-Obfuscated Segmentation of Medical Images"
            },
            "pmid": "33710953",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}