{
    "accessibility": "Open access",
    "additionDate": "2022-08-27T23:55:05.298800Z",
    "biotoolsCURIE": "biotools:mesocosm",
    "biotoolsID": "mesocosm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Ali Ayadi"
        },
        {
            "name": "Camille de Garidel-Thoron"
        },
        {
            "name": "Christine Hendren"
        },
        {
            "name": "Jérôme Rose"
        },
        {
            "name": "Mark R. Wiesner"
        },
        {
            "name": "Mélanie Auffan"
        }
    ],
    "description": "A mesocosm database management system for environmental nanosafety.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://aliayadi.github.io/MESOCOSM-database/",
    "lastUpdate": "2024-11-24T15:46:35.225650Z",
    "name": "mesocosm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.impact.2020.100288",
            "metadata": {
                "abstract": "Engineered nanomaterials (ENMs) are intentionally designed and produced by humans to revolutionize the manufacturing sector, such as electronic goods, paints, tires, clothes, cosmetic products, and biomedicine. With the spread of these ENMs in our daily lives, scientific research have generated a huge amount of data related to their potential impacts on human and environment health. To date, these data are gathered in databases mainly focused on the (eco)toxicity and occupational exposure to ENMs. These databases are therefore not suitable to build well-informed environmental exposure scenarios covering the life cycle of ENMs. In this paper, we report the construction of one of the first centralized mesocosm database management system for environmental nanosafety (called MESOCOSM) containing experimental data collected from mesocosm experiments suited for understanding and quantifying both the environmental hazard and exposure. The database, which is publicly available through https://aliayadi.github.io/MESOCOSM-database/, contains 5200 entities covering tens of unique experiments investigating Ag, CeO2, CuO, TiO2-based ENMs as well as nano-enabled products. These entities are divided into different groups i.e. physicochemical properties of ENMS, environmental, exposure and hazard endpoints, and other general information about the mesocosm testing, resulting in more than forty parameters in the database. The MESOCOSM database is equipped with a powerful application, consisting of a graphical user interface (GUI), allowing users to manage and search data using complex queries without relying on programmers. MESOCOSM aims to predict and explain ENMs behavior and fate in different ecosystems as well as their potential impacts on the environment at different stages of the nanoproducts lifecycle. MESOCOSM is expected to benefit the nanosafety community by providing a continuous source of critical information and additional characterization factors for predicting ENMs interactions with the environment and their risks.",
                "authors": [
                    {
                        "name": "Auffan M."
                    },
                    {
                        "name": "Ayadi A."
                    },
                    {
                        "name": "Hendren C."
                    },
                    {
                        "name": "Rose J."
                    },
                    {
                        "name": "Wiesner M.R."
                    },
                    {
                        "name": "de Garidel-Thoron C."
                    }
                ],
                "citationCount": 8,
                "date": "2021-01-01T00:00:00Z",
                "journal": "NanoImpact",
                "title": "MESOCOSM: A mesocosm database management system for environmental nanosafety"
            },
            "pmid": "35559777"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Freshwater biology",
            "uri": "http://edamontology.org/topic_3573"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ],
    "validated": 1
}
