{
    "additionDate": "2019-11-14T18:09:18Z",
    "biotoolsCURIE": "biotools:XG-PseU",
    "biotoolsID": "XG-PseU",
    "confidence_flag": "tool",
    "description": "> HOMEPAGE MISSING! | an eXtreme Gradient Boosting based method for identifying pseudouridine sites | As one of the most popular post-transcriptional modifications, pseudouridine (Ψ) participates in a series of biological processes. Therefore, the efficient detection of pseudouridine sites is very important in revealing its functions in biological processes. Although experimental techniques have been proposed for identifying Ψ sites at single-base resolution, they are still labor intensive and expensive. Recently, to fill the experimental method's gap, computational methods have been proposed for identifying Ψ sites. However, their performances are still unsatisfactory. In this paper, we proposed an eXtreme Gradient Boosting (xgboost)-based method, called XG-PseU, to identify Ψ sites based on the optimal features obtained using the forward feature selection together with increment feature selection method",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.bioml.cn/",
    "lastUpdate": "2021-01-06T15:54:06.402134Z",
    "name": "XG-PseU",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S00438-019-01600-9",
            "metadata": {
                "abstract": "© 2019, Springer-Verlag GmbH Germany, part of Springer Nature.As one of the most popular post-transcriptional modifications, pseudouridine (Ψ) participates in a series of biological processes. Therefore, the efficient detection of pseudouridine sites is very important in revealing its functions in biological processes. Although experimental techniques have been proposed for identifying Ψ sites at single-base resolution, they are still labor intensive and expensive. Recently, to fill the experimental method’s gap, computational methods have been proposed for identifying Ψ sites. However, their performances are still unsatisfactory. In this paper, we proposed an eXtreme Gradient Boosting (xgboost)-based method, called XG-PseU, to identify Ψ sites based on the optimal features obtained using the forward feature selection together with increment feature selection method. Our results demonstrated that XG-PseU is superior or at least complementary to existing methods for identifying pseudouridine sites. Finally, a freely available online web server for XG-PseU was established at http://www.bioml.cn/. We wish that XG-PseU will become a useful tool for computationally identifying Ψ sites.",
                "authors": [
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomics",
                "title": "XG-PseU: an eXtreme Gradient Boosting based method for identifying pseudouridine sites"
            },
            "pmid": "31392406"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}