
{
    "credit": [
        {
            "email": "webmaster@gene-regulation.com",
            "name": "Webmaster",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://gene-regulation.com/faqs/register.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The TRANSFAC® database on eukaryotic transcriptional regulation, comprising data on transcription factors, their target genes and regulatory binding sites, has been extended and further developed, both in number of entries and in the scope and structure of the collected data. Structured fields for expression patterns have been introduced for transcription factors from human and mouse, using the CYTOMER® database on anatomical structures and developmental stages. The functionality of Match™, a tool for matrix-based search of transcription factor binding sites, has been enhanced. For instance, the program now comes along with a number of tissue-(or state-)specific profiles and new profiles can be created and modified with Match™ Profiler. The GENE table was extended and gained in importance, containing amongst others links to LocusLink, RefSeq and OMIM now. Further, (direct) links between factor and target gene on one hand and between gene and encoded factor on the other hand were introduced. The TRANSFAC® public release is available at http://www.gene-regulation.com. For yeast an additional release including the latest data was made available separately as TRANSFAC® Saccharomyces Module (TSM) at http://transfac.gbf.de. For CYTOMER® free download versions are available at http://www.biobase.de:8080/index.html.",
            "authors": [
                "Matys V.",
                "Fricke E.",
                "Geffers R.",
                "Gossling E.",
                "Haubrock M.",
                "Hehl R.",
                "Hornischer K.",
                "Karas D.",
                "Kel A.E.",
                "Kel-Margoulis O.V.",
                "Kloos D.-U.",
                "Land S.",
                "Lewicki-Potapov B.",
                "Michael H.",
                "Munch R.",
                "Reuter I.",
                "Rotert S.",
                "Saxel H.",
                "Scheer M.",
                "Thiele S.",
                "Wingender E."
            ],
            "cit_count": 1457,
            "journal": "Nucleic Acids Research",
            "pmid": "12520026",
            "title": "TRANSFAC®: Transcriptional regulation, from patterns to profiles",
            "year": "2003-01-01"
        },
        {
            "abstract": "TRANSFAC is a database on transcription factors, their genomic binding sites and DNA-binding profiles (http://transfac.gbf.de/TRANSFAC/). Its content has been enhanced, in particular by information about training sequences used for the construction of nucleotide matrices as well as by data on plant sites and factors. Moreover, TRANSFAC has been extended by two new modules: PathoDB provides data on pathologically relevant mutations in regulatory regions and transcription factor genes, whereas S/MARt DB compiles features of scaffold/matrix attached regions (S/MARs) and the proteins binding to them. Additionally, the databases TRANSPATH, about signal transduction, and CYTOMER, about organs and cell types, have been extended and are increasingly integrated with the TRANSFAC data sources.",
            "authors": [
                "Wingender E.",
                "Chen X.",
                "Hehl R.",
                "Karas H.",
                "Liebich I.",
                "Matys V.",
                "Meinhardt T.",
                "Pruss M.",
                "Reuter I.",
                "Schacherer F."
            ],
            "cit_count": 969,
            "journal": "Nucleic Acids Research",
            "pmid": "10592259",
            "title": "TRANSFAC: An integrated system for gene expression regulation",
            "year": "2000-01-01"
        },
        {
            "abstract": "The TRANSFAC database on transcription factors and their DNA-binding sites and profiles (http:// www.gene-regulation.de/) has been quantitatively extended and supplemented by a number of modules. These modules give information about pathologically relevant mutations in regulatory regions and transcription factor genes (PathoDB), scaffold/matrix attached regions (S/MARt DB), signal transduction (TRANSPATH) and gene expression sources (CYTOMER). Altogether, these distinct database modules constitute the TRANSFAC system. They are accompanied by a number of program routines for identifying potential transcription factor binding sites or for localizing individual components in the regulatory network of a cell.",
            "authors": [
                "Wingender E.",
                "Chen X.",
                "Fricke E.",
                "Geffers R.",
                "Hehl R.",
                "Liebich I.",
                "Krull M.",
                "Matys V.",
                "Michael H.",
                "Ohnhauser R.",
                "Pruss M.",
                "Schacherer F.",
                "Thiele S.",
                "Urbach S."
            ],
            "cit_count": 527,
            "journal": "Nucleic Acids Research",
            "pmid": "11125113",
            "title": "The TRANSFAC system on gene expression regulation",
            "year": "2001-01-01"
        },
        {
            "abstract": "The TRANSFAC database on transcription factors, their binding sites, nucleotide distribution matrices and regulated genes as well as the complementing database TRANSCompel on composite elements have been further enhanced on various levels. A new web interface with different search options and integrated versions of Match and Patch provides increased functionality for TRANSFAC. The list of databases which are linked to the common GENE table of TRANSFAC and TRANSCompel has been extended by: Ensembl, UniGene, EntrezGene, HumanPSD and TRANSPRO. Standard gene names from HGNC, MGI and RGD, are included for human, mouse and rat genes, respectively. With the help of InterProScan, Pfam, SMART and PROSITE domains are assigned automatically to the protein sequences of the transcription factors. TRANSCompel contains now, in addition to the COMPEL table, a separate table for detailed information on the experimental EVIDENCE on which the composite elements are based. Finally, for TRANSFAC, in respect of data growth, in particular the gain of Drosophila transcription factor binding sites (by courtesy of the Drosophila DNase I footprint database) and of Arabidopsis factors (by courtesy of DATF, Database of Arabidopsis Transcription Factors) has to be stressed. The here described public releases, TRANSFAC 7.0 and TRANSCompel 7.0, are accessible under http://www.gene-regulation.com/pub/databases.html.",
            "authors": [
                "Matys V.",
                "Kel-Margoulis O.V.",
                "Fricke E.",
                "Liebich I.",
                "Land S.",
                "Barre-Dirrie A.",
                "Reuter I.",
                "Chekmenev D.",
                "Krull M.",
                "Hornischer K.",
                "Voss N.",
                "Stegmaier P.",
                "Lewicki-Potapov B.",
                "Saxel H.",
                "Kel A.E.",
                "Wingender E."
            ],
            "cit_count": 1366,
            "journal": "Nucleic acids research",
            "pmid": "16381825",
            "title": "TRANSFAC and its module TRANSCompel: transcriptional gene regulation in eukaryotes.",
            "year": "2006-01-01"
        },
        {
            "abstract": "Since its beginning as a data collection more than 20 years ago, the TRANSFAC project underwent an evolution to become the basis for a complex platform for the description and analysis of gene regulatory events and networks. In the following, I describe what the original concepts were, what their present status is and how they may be expected to contribute to future system biology approaches. © The Author 2008. Published by Oxford University Press.",
            "authors": [
                "Wingender E."
            ],
            "cit_count": 260,
            "journal": "Briefings in Bioinformatics",
            "pmid": "18436575",
            "title": "The TRANSFAC project as an example of framework technology that supports the analysis of genomic regulation",
            "year": "2008-07-01"
        },
        {
            "abstract": "TRANSFAC is a database about eukaryotic transcription regulating DNA sequence elements and the transcription factors binding to and acting through them. This report summarizes the present status of this database and accompanying retrieval tools.",
            "authors": [
                "Wingender E.",
                "Dietze P.",
                "Karas H.",
                "Knuppel R."
            ],
            "cit_count": 701,
            "journal": "Nucleic Acids Research",
            "pmid": "8594589",
            "title": "TRANSFAC: A database on transcription factors and their DNA binding sites",
            "year": "1996-03-27"
        },
        {
            "abstract": "TRANSFAC is a database on transcription factors, their genomic binding sites and DNA-binding profiles. In addition to being updated and extended by new features, it has been complemented now by a series of additional database modules. Among them, modules which provide data about signal transduction pathways (TRANSPATH) or about cell types/organs/developmental stages (CYTOMER) are available as well as an updated version of the previously described COMPEL database. The databases are available on the WWW at http://transfac.gbf.de/.",
            "authors": [
                "Heinemeyer T.",
                "Chen X.",
                "Karas H.",
                "Kel A.E.",
                "Kel O.V.",
                "Liebich I.",
                "Meinhardt T.",
                "Reuter I.",
                "Schacherer F.",
                "Wingender E."
            ],
            "cit_count": 266,
            "journal": "Nucleic Acids Research",
            "pmid": "9847216",
            "title": "Expanding the TRANSFAC database towards an expert system of regulatory molecular mechanisms",
            "year": "1999-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:transfac",
        "biotoolsID": "transfac",
        "description": "Transcription Factor Database of eukaryotic cis-acting regulatory DNA elements and trans-acting factors; free for non-commercial use.",
        "homepage": "http://www.gene-regulation.com/pub/databases.html#transfac",
        "name": "TRANSFAC"
    }
}