{
    "name": "GerOSS", 
    "description": "German Obstetric Surveillance System (GerOSS) - project to improve the treatment of obstetric rare diseases and complications using a web based documentation and information platform.", 
    "homepage": "https://www.geross.de/Default_en.aspx", 
    "biotoolsID": "GerOSS", 
    "biotoolsCURIE": "biotools:GerOSS", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3283", 
                    "term": "Anonymisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3325", 
            "term": "Rare diseases"
        }, 
        {
            "uri": "http://edamontology.org/topic_3411", 
            "term": "Gynaecology and obstetrics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": "Other", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge (with restrictions)", 
    "accessibility": [
        "Restricted access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.3414/ME14-01-0141", 
            "pmid": "26065375", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "GerOSS (German obstetric surveillance system): A project to improve the treatment of obstetric rare diseases and complications using a web based documentation and information platform", 
                "abstract": "© Schattauer 2015. All rights reserved.Background: Severe and very rare obstetric complications (e.g. eclampsia, postpartum haemorrhage or uterine rupture), typically culminate in a chaotic, uncontrollable sequence of events. Outcome for mother and child depends on whether doctors and midwives are able to quickly take correct decisions and initiate optimal treatment. Objectives: GerOSS (German Obstetric Surveillance System) aims at generating deeper insight into relevant risk factors to improve diagnosis and treatment of severe complications during pregnancy and delivery. As such it is primarily conceived as a system for quality improvement and less as a register. Another focus is the provision of an information and communication platform for dissemination of these insights. Finally, incidences of selected rare obstetric events may be derived. Methods: These rare events are monitored for two to five years in Lower Saxony, Bavaria and Berlin. Quantitative analyses of aggregate data are complemented with in depth case based anonymised evaluations by experts. The temporal sequence of measures taken as well as the management of care is inspected. Participants receive a feedback of comments on the synopsis of individual cases. Aggregate data results are published and made available through the GerOSS platform. A scientific advisory committee ensures the link with the professional scientific bodies. A comparison within INOSS (International Network of Obstetric Survey Systems) allows additional insights into the treatment of obstetric rare diseases and complications. More reliable estimates of the incidence of such events can be computed and compared within a larger database. Results: Following the implementation in three federal states in Germany in 2010, participation in GerOSS-Project has increased to 100% of all hospitals with a delivery unit in Lower Saxony, 30% in Bavaria and 80% in Berlin. Feasibility of the project is shown by successful implementation of GerOSS. Quantitative analyses enable construction of risk profiles (e.g. for the prevalence of hys - terectomies and uterine ruptures) such that tailored treatment algorithms may be derived. Age, body mass index and previous caesarean section are common risk factors when complications occur. Respective recommendations have not always been adhered to in the diagnosis and therapy of such cases. The presentation of initial GerOSS results has paved the path for first changes in obstetric care. Conclusions: The envisaged expansion of GerOSS to an interactive platform will allow dissemination of insights such that optimal obstetric care and transferal among all involved medical facilities may see future enhancements via the internet or even through smartphone applications.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Berlage S."
                    }, 
                    {
                        "name": "Grussner S."
                    }, 
                    {
                        "name": "Lack N."
                    }, 
                    {
                        "name": "Franz H.B.G."
                    }
                ], 
                "journal": "Methods of Information in Medicine"
            }
        }
    ], 
    "credit": [
        {
            "name": "Silvia Berlage", 
            "email": "silvia.berlage@aekn.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Nicholas Lack", 
            "email": "n.lack@baq-bayern.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "Ruta", 
    "additionDate": "2019-05-11T07:37:07Z", 
    "lastUpdate": "2019-06-14T10:53:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}