{
    "additionDate": "2022-09-29T09:17:33.395047Z",
    "biotoolsCURIE": "biotools:cancercsp",
    "biotoolsID": "cancercsp",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/cancercsp/index.php"
        }
    ],
    "description": "CancerCSP (clear cell renal cancer stage prediction) is a web-bench developed for predicting Early and Late stage of clear cell renal cell carcinoma (ccRCC) patients using gene expression data derived from RNA-seq experiments in the form of RNA-Seq by Expectation Maximization (RSEM) values.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cancercsp/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/cancercsp/index.php",
    "lastUpdate": "2022-09-29T11:04:17.411454Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cancercsp/index.php"
        }
    ],
    "name": "CancerCSP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1038/srep44997",
            "metadata": {
                "abstract": "© 2017 The Author(s).In this study, an attempt has been made to identify expression-based gene biomarkers that can discriminate early and late stage of clear cell renal cell carcinoma (ccRCC) patients. We have analyzed the gene expression of 523 samples to identify genes that are differentially expressed in the early and late stage of ccRCC. First, a threshold-based method has been developed, which attained a maximum accuracy of 71.12% with ROC 0.67 using single gene NR3C2. To improve the performance of threshold-based method, we combined two or more genes and achieved maximum accuracy of 70.19% with ROC of 0.74 using eight genes on the validation dataset. These eight genes include four underexpressed (NR3C2, ENAM, DNASE1L3, FRMPD2) and four overexpressed (PLEKHA9, MAP6D1, SMPD4, C11orf73) genes in the late stage of ccRCC. Second, models were developed using state-of-art techniques and achieved maximum accuracy of 72.64% and 0.81 ROC using 64 genes on validation dataset. Similar accuracy was obtained on 38 genes selected from subset of genes, involved in cancer hallmark biological processes. Our analysis further implied a need to develop gender-specific models for stage classification. A web server, CancerCSP, has been developed to predict stage of ccRCC using gene expression data derived from RNAseq experiments.",
                "authors": [
                    {
                        "name": "Bhalla S."
                    },
                    {
                        "name": "Chaudhary K."
                    },
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sehgal M."
                    },
                    {
                        "name": "Sharma S."
                    }
                ],
                "citationCount": 54,
                "date": "2017-03-28T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Gene expression-based biomarkers for discriminating early and late stage of clear cell renal cancer"
            },
            "pmid": "28349958"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
