{
    "additionDate": "2021-01-18T08:03:52Z",
    "biotoolsCURIE": "biotools:hdmac",
    "biotoolsID": "hdmac",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tough0857@icloud.com",
            "name": "Chia-Cheng Yu",
            "typeEntity": "Person"
        },
        {
            "email": "jimsheu@mail.nsysu.edu.tw",
            "name": "Jim Jinn-Chyuan Sheu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web-Based Interactive Program for High-Dimensional Analysis of Molecular Alterations in Cancer.\n\nHDMAC is a web-based shiny App that provides high-dimension regression analysis for both survival (Cox PH regression) and binary outcomes (logistic regression), including ridge, lasso, adaptive lasso regression analysis. Users can use this App to do high dimensional regression analysis online without downloading or installing any software. In ad….",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chung-R/HD-MAC",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-30T11:17:29Z",
    "name": "HDMAC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41598-020-60791-Z",
            "metadata": {
                "abstract": "© 2020, The Author(s).Recent advances in high-throughput genomic technologies have nurtured a growing demand for statistical tools to facilitate identification of molecular changes as potential prognostic biomarkers or drugable targets for personalized precision medicine. In this study, we developed a web-based interactive and user-friendly platform for high-dimensional analysis of molecular alterations in cancer (HDMAC) (https://ripsung26.shinyapps.io/rshiny/). On HDMAC, several penalized regression models that are suitable for high-dimensional data analysis, Ridge, Lasso and adaptive Lasso, are offered, with Cox regression for survival and logistic regression for binary outcomes. Choice of a first-step screening is provided to address the multiple-comparison issue that often arises with large-volume genomic data. Hazard ratio or estimated coefficient is provided with each selected gene so that a multivariate regression model may be built based on the genes selected. Cross validation is provided as the method to estimate the prediction power of each regression model. In addition, R codes are also provided to facilitate download of whole sets of molecular variables from TCGA. In this study, illustration of the use of HDMAC was made through a set of data on gene mutations and a set on mRNA expression from ovarian cancer patients and a set on mRNA expression from bladder cancer patient. From the analysis of each set of data, a list of candidate genes was obtained that might be associated with mutations or abnormal expression of genes in ovarian and bladder cancers. HDMAC offers a solution for rigorous and validation analysis of high-dimensional genomic data.",
                "authors": [
                    {
                        "name": "Chang C."
                    },
                    {
                        "name": "Sung C.-Y."
                    },
                    {
                        "name": "Hsiao H."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Chen I.-H."
                    },
                    {
                        "name": "Kuo W.-T."
                    },
                    {
                        "name": "Cheng L.-F."
                    },
                    {
                        "name": "Korla P.K."
                    },
                    {
                        "name": "Chung M.-J."
                    },
                    {
                        "name": "Wu P.-J."
                    },
                    {
                        "name": "Yu C.-C."
                    },
                    {
                        "name": "Sheu J.J.-C."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "HDMAC: A Web-Based Interactive Program for High-Dimensional Analysis of Molecular Alterations in Cancer"
            },
            "pmcid": "PMC7054321",
            "pmid": "32127576"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}