
{
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://nonb-abcc.ncifcrf.gov/apps/site/contact_us"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://nonb-abcc.ncifcrf.gov/apps/site/help_nBMST"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Quadruplex formation site detection",
                    "uri": "http://edamontology.org/operation_0429"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "DNA structure prediction",
                    "uri": "http://edamontology.org/operation_2442"
                },
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Although the capability of DNA to form a variety of non-canonical (non-B) structures has long been recognized, the overall significance of these alternate conformations in biology has only recently become accepted en masse. In order to provide access to genome-wide locations of these classes of predicted structures, we have developed non-B DB, a database integrating annotations and analysis\\ of non-B DNA-forming sequence motifs. The database provides the most complete list of alternative DNA structure predictions available, including Z-DNA motifs, quadruplex-forming motifs, inverted repeats, mirror repeats and direct repeats and their associated subsets of cruciforms, triplex and slipped structures, respectively. The database also contains motifs predicted to form static DNA bends, short tandem repeats and homo(purine-pyrimidine) tracts that have been associated with disease. The database has been built using the latest releases of the human, chimp, dog, macaque and mouse genomes, so that the results can be compared directly with other data sources. In order to make the data interpretable in a genomic context, features such as genes, single-nucleotide polymorphisms and repetitive elements (SINE, LINE, etc.) have also been incorporated. The database is accessed through query pages that produce results with links to the UCSC browser and a GBrowse-based genomic viewer. It is freely accessible at http://nonb.abcc .ncifcrf.gov. © The Author(s) 2010.",
            "authors": [
                "Cer R.Z.",
                "Bruce K.H.",
                "Mudunuri U.S.",
                "Yi M.",
                "Volfovsky N.",
                "Luke B.T.",
                "Bacolla A.",
                "Collins J.R.",
                "Stephens R.M."
            ],
            "cit_count": 43,
            "journal": "Nucleic Acids Research",
            "pmid": "21097885",
            "title": "Non-B DB: A database of predicted non-B DNA-forming motifs in mammalian genomes",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:non-b_db",
        "biotoolsID": "non-b_db",
        "description": "It is a non-canonical (non-B) structure database database integrating annotations and analysis of non-B DNA-forming sequence motifs. The database provides alternative DNA structure predictions, including Z-DNA motifs, quadruplex-forming motifs, inverted repeats, mirror repeats and direct repeats and their associated subsets of cruciforms, triplex and slipped structures, respectively.",
        "homepage": "https://nonb-abcc.ncifcrf.gov/apps/nBMST/default/",
        "name": "Non-B DB"
    }
}