{
    "additionDate": "2021-01-18T11:55:57Z",
    "biotoolsCURIE": "biotools:rnanet",
    "biotoolsID": "rnanet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fariza.tahi@univ-evry.fr",
            "name": "Fariza Tahi",
            "typeEntity": "Person"
        },
        {
            "email": "louis.becquey@univ-evry.fr",
            "name": "Louis Becquey",
            "typeEntity": "Person"
        }
    ],
    "description": "an automatically built dual-source dataset integrating homologous sequences and RNA structures.\n\nA major part of any data-science work consists in finding appropriate data which contains enough signal to tackle the problem we are interested in. Then, cleaning the data to ensure uniformity of the measures, compatibility of the various data sources and protocols, and a reasonable amount of noise is sometimes the most time-consuming step.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "homepage": "https://evryrna.ibisc.univ-evry.fr/evryrna/rnanet",
    "lastUpdate": "2021-02-07T12:27:58Z",
    "name": "RNANet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA944",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Applied research in machine learning progresses faster when a clean dataset is available and ready to use. Several datasets have been proposed and released over the years for specific tasks such as image classification, speech-recognition and more recently for protein structure prediction. However, for the fundamental problem of RNA structure prediction, information is spread between several databases depending on the level we are interested in: sequence, secondary structure, 3D structure or interactions with other macromolecules. In order to speed-up advances in machine-learning based approaches for RNA secondary and/or 3D structure prediction, a dataset integrating all this information is required, to avoid spending time on data gathering and cleaning. Results: Here, we propose the first attempt of a standardized and automatically generated dataset dedicated to RNA combining together: RNA sequences, homology information (under the form of position-specific scoring matrices) and information derived by annotation of available 3D structures (including secondary structure, canonical and non-canonical interactions and backbone torsion angles). The data are retrieved from public databases PDB, Rfam and SILVA. The paper describes the procedure to build such dataset and the RNA structure descriptors we provide. Some statistical descriptions of the resulting dataset are also provided.",
                "authors": [
                    {
                        "name": "Angel E."
                    },
                    {
                        "name": "Becquey L."
                    },
                    {
                        "name": "Tahi F."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RNANet: An automatically built dual-source dataset integrating homologous sequences and RNA structures"
            },
            "pmid": "33135044"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
