{
    "accessibility": "Open access",
    "additionDate": "2024-05-01T09:04:12.913221Z",
    "biotoolsCURIE": "biotools:afrbase",
    "biotoolsID": "afrbase",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "manish@south.du.ac.in",
            "name": "Manish Kumar",
            "orcidid": "https://orcid.org/0000-0002-7936-9892",
            "typeEntity": "Person"
        },
        {
            "email": "antoniop.camargo@lbl.gov",
            "name": "Antonio Pedro Camargo",
            "typeEntity": "Person"
        }
    ],
    "description": "Database of protein mutations responsible for antifungal resistance.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://proteininformatics.org/mkumar/afrbase/",
    "lastUpdate": "2024-05-01T09:04:12.915997Z",
    "name": "AFRbase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD677",
            "metadata": {
                "abstract": "Motivation: Fungal pathogens are known to cause life threatening invasive infections with rising global mortality rates. Besides, the indiscriminate use of antifungals in both clinics and agriculture has promoted antifungal drug resistance in the last decade. Fungi can show drug resistance by a variety of mechanisms. But primary driver in all these hitherto documented mechanisms is stable and heritable point mutations in the key proteins. Therefore, cataloguing mutations that can confer resistance is the first step toward understanding the mechanisms leading to the emergence of antifungal resistance. Results: In the present, work we have described a database of all the mutations responsible for antifungal resistance. Named as antifungal resistance database (AFRbase), it is better than the existing databases of antifungal resistance namely, FunResDB and MARDy which have a limited scope and inadequate information. Data of AFRbase was collected using both text mining and manual curation. AFRbase provides a separate window for visualization of mutations in the 2D and 3D formats making it easy for researchers to analyze the mutation data and ensures interoperability with other standard molecular biology databases like NCBI and UniProtKB. We hope AFRbase can be useful to both clinicians and basic biomedical scientists as we envision it as an important resource for genotypic susceptibility testing of fungi and to study/predict the course of evolution of antifungal resistance. The current version of AFRbase contains manually curated 3691 unique mutations present in 29 proteins of 32 fungal species along with the information of drugs against which resistance is caused.",
                "authors": [
                    {
                        "name": "Jain A."
                    },
                    {
                        "name": "Kumar M."
                    },
                    {
                        "name": "Singhal N."
                    }
                ],
                "date": "2023-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AFRbase: a database of protein mutations responsible for antifungal resistance"
            },
            "pmcid": "PMC10656092",
            "pmid": "37947313"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ]
}
