{
    "additionDate": "2020-01-09T18:22:52Z",
    "biotoolsCURIE": "biotools:NiceBot",
    "biotoolsID": "NiceBot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tonio.ball@uniklinik-freiburg.de",
            "name": "Tonio Ball",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring Continuous Subjective Ratings With Deep Regression.\n\nData and code of the BrainLinks-BrainTools NiceBot project, manuscript \"Human-Compliant Robot Behavior: Combining Continuous Subjective Evaluation with Multimodal Deep Regression Analysis\".",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TNTLFreiburg/NiceBot",
    "language": [
        "Java",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-01-04T08:22:44Z",
    "name": "NiceBot",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNBOT.2019.00076",
            "metadata": {
                "abstract": "© 2019 Fiederer, Völker, Schirrmeister, Burgard, Boedecker and Ball.Appropriate robot behavior during human-robot interaction is a key part in the development of human-compliant assistive robotic systems. This study poses the question of how to continuously evaluate the quality of robotic behavior in a hybrid brain-computer interfacing (BCI) task, combining brain and non-brain signals, and how to use the collected information to adapt the robot's behavior accordingly. To this aim, we developed a rating system compatible with EEG recordings, requiring the users to execute only small movements with their thumb on a wireless controller to rate the robot's behavior on a continuous scale. The ratings were recorded together with dry EEG, respiration, ECG, and robotic joint angles in ROS. Pilot experiments were conducted with three users that had different levels of previous experience with robots. The results demonstrate the feasibility to obtain continuous rating data that give insight into the subjective user perception during direct human-robot interaction. The rating data suggests differences in subjective perception for users with no, moderate, or substantial previous robot experience. Furthermore, a variety of regression techniques, including deep CNNs, allowed us to predict the subjective ratings. Performance was better when using the position of the robotic hand than when using EEG, ECG, or respiration. A consistent advantage of features expected to be related to a motor bias could not be found. Across-user predictions showed that the models most likely learned a combination of general and individual features across-users. A transfer of pre-trained regressor to a new user was especially accurate in users with more experience. For future research, studies with more participants will be needed to evaluate the methodology for its use in practice. Data and code to reproduce this study are available at https://github.com/TNTLFreiburg/NiceBot.",
                "authors": [
                    {
                        "name": "Ball T."
                    },
                    {
                        "name": "Boedecker J."
                    },
                    {
                        "name": "Burgard W."
                    },
                    {
                        "name": "Fiederer L.D.J."
                    },
                    {
                        "name": "Schirrmeister R.T."
                    },
                    {
                        "name": "Volker M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Neurorobotics",
                "title": "Hybrid brain-computer-interfacing for human-compliant robots: Inferring continuous subjective ratings with deep regression"
            },
            "pmcid": "PMC6795684",
            "pmid": "31649523"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
