{
    "additionDate": "2019-11-14T18:36:43Z",
    "biotoolsCURIE": "biotools:SEMpl",
    "biotoolsID": "SEMpl",
    "confidence_flag": "tool",
    "description": "Predicting the effects of SNPs on transcription factor binding affinity | MOTIVATION:GWAS have revealed that 88% of disease associated SNPs reside in noncoding regions. However, noncoding SNPs remain understudied, partly because they are challenging to prioritize for experimental validation. To address this deficiency, we developed the SNP effect matrix pipeline (SEMpl). RESULTS:SEMpl estimates transcription factor binding affinity by observing differences in ChIP-seq signal intensity for SNPs within functional transcription factor binding sites genome-wide. By cataloging the effects of every possible mutation within the transcription factor binding site motif, SEMpl can predict the consequences of SNPs to transcription factor binding. This knowledge can be used to identify potential disease-causing regulatory loci",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Boyle-Lab/SEM_CPP",
    "lastUpdate": "2020-12-19T14:48:37Z",
    "name": "SEMpl",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ612",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Genome-wide association studies have revealed that 88% of disease-associated single-nucleotide polymorphisms (SNPs) reside in noncoding regions. However, noncoding SNPs remain understudied, partly because they are challenging to prioritize for experimental validation. To address this deficiency, we developed the SNP effect matrix pipeline (SEMpl). Results: SEMpl estimates transcription factor-binding affinity by observing differences in chromatin immunoprecipitation followed by deep sequencing signal intensity for SNPs within functional transcription factor-binding sites (TFBSs) genome-wide. By cataloging the effects of every possible mutation within the TFBS motif, SEMpl can predict the consequences of SNPs to transcription factor binding. This knowledge can be used to identify potential disease-causing regulatory loci.",
                "authors": [
                    {
                        "name": "Asman C."
                    },
                    {
                        "name": "Boyle A.P."
                    },
                    {
                        "name": "Dong S."
                    },
                    {
                        "name": "Morterud C."
                    },
                    {
                        "name": "Ng N."
                    },
                    {
                        "name": "Nishizaki S.S."
                    },
                    {
                        "name": "Porter R.S."
                    },
                    {
                        "name": "Switzenberg J.A."
                    },
                    {
                        "name": "Williams C."
                    }
                ],
                "citationCount": 9,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Predicting the effects of SNPs on transcription factor binding affinity"
            },
            "pmid": "31373606"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
