{
    "additionDate": "2019-11-14T18:24:53Z",
    "biotoolsCURIE": "biotools:NUQA",
    "biotoolsID": "NUQA",
    "confidence_flag": "tool",
    "description": "Estimating cancer spatial and temporal heterogeneity and evolution through alignment-free methods | NGS tool for Unsupervised analysis of fastQ files using Alignment-free | A software to support an alignment-free sequence comparison of large-scale fastq files using a k-mer counting methods paired with distance metrics, Jensen-Shannon divergence and Hellinger Distance | git clone https://github.com/ARoddy/NUQA.git | NUQA reads in a set of raw fastq files - ideally, these are DNA-seq files produced from multiple samples taken from the same patient. Based on these it will identify differences between the files and produce a distance matrix and a newick tree file | Eigen (where /Eigen file containing the headers is located at /usr/local/include for an example run check file 'Eigen_help.txt')",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ACRoddy/NUQA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:50:51.613310Z",
    "name": "NUQA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/molbev/msz182",
            "metadata": {
                "abstract": "Longitudinal next-generation sequencing of cancer patient samples has enhanced our understanding of the evolution and progression of various cancers. As a result, and due to our increasing knowledge of heterogeneity, such sampling is becoming increasingly common in research and clinical trial sample collections. Traditionally, the evolutionary analysis of these cohorts involves the use of an aligner followed by subsequent stringent downstream analyses. However, this can lead to large levels of information loss due to the vast mutational landscape that characterizes tumor samples. Here, we propose an alignment-free approach for sequence comparison - a well-established approach in a range of biological applications including typical phylogenetic classification. Such methods could be used to compare information collated in raw sequence files to allow an unsupervised assessment of the evolutionary trajectory of patient genomic profiles. In order to highlight this utility in cancer research we have applied our alignment-free approach using a previously established metric, Jensen-Shannon divergence, and a metric novel to this area, Hellinger distance, to two longitudinal cancer patient cohorts in glioma and clear cell renal cell carcinoma using our software, NUQA. We hypothesize that this approach has the potential to reveal novel information about the heterogeneity and evolutionary trajectory of spatiotemporal tumor samples, potentially revealing early events in tumorigenesis and the origins of metastases and recurrences. Key words: alignment-free, Hellinger distance, exome-seq, evolution, phylogenetics, longitudinal.",
                "authors": [
                    {
                        "name": "Gilmore A."
                    },
                    {
                        "name": "Gonzalez De Castro D."
                    },
                    {
                        "name": "Jurek-Loughrey A."
                    },
                    {
                        "name": "McArt D.G."
                    },
                    {
                        "name": "O'Reilly P.G."
                    },
                    {
                        "name": "Prise K.M."
                    },
                    {
                        "name": "Roddy A.C."
                    },
                    {
                        "name": "Salto-Tellez M."
                    },
                    {
                        "name": "Souza J."
                    },
                    {
                        "name": "Stupnikov A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "NUQA: Estimating Cancer Spatial and Temporal Heterogeneity and Evolution through Alignment-Free Methods"
            },
            "pmcid": "PMC6878956",
            "pmid": "31424551"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
