
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JSP"
        ],
        "topic": [
            {
                "term": "Allergy, clinical immunology and immunotherapeutics",
                "uri": "http://edamontology.org/topic_3400"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Surgery",
                "uri": "http://edamontology.org/topic_3421"
            }
        ]
    },
    "link": [
        {
            "type": "Other",
            "url": "http://www.freepatentsonline.com"
        },
        {
            "type": "Other",
            "url": "http://www.freshpatents.com"
        }
    ],
    "publication": [
        {
            "abstract": "Copyright© Bentham Science Publishers; For any queries, please email at epub@benthamscience.net.BACKGROUND: Inflammation has become pathology in the majority of the prevalent diseases such as diabetes, atherosclerosis, epilepsy and neurodegenerative disorders. Anti-inflammatory drugs work wonder in all these conditions, where the patient has become refractory to standard treatment. However, available anti-inflammatory agents have side effects associated with chronic use, thus if we could develop safe and efficacious molecules, quality of health care provided will improve. Since plant sources have been extensively explored, the focus needs to be shifted on the alternative natural sources of anti-inflammatory agents. Water bodies especially the sea and ocean are under investigation to find agents which can tackle inflammation. OBJECTIVE: This article reviews anti-inflammatory agents obtained from five types of marine organisms namely microalgae, sea cucumber, mussels, sponges and corals. METHODS: A literature search was conducted using PubMed/Science Direct with keywords marine organisms, inflammation, marine sponges, sea cucumber, mussels, corals and microalgae. Patents were searched using the key terms inflammation, marine agents from www.google.com/patents, www.uspto.gov, http://espacenet.com, www.freepatentsonline.com, www.wipo.int/pctdb/en/searchsimp. jsp and www.freshpatents.com. RESULTS: Literature and current patents have revealed applications of anti-inflammatory agents from marine organisms in pharmaceuticals and cosmeceuticals. These agents are used to treat inflammatory disorders ranging from minor allergy to chronic conditions like rheumatoid arthritis. Marine waste is also a valuable resource for nutraceuticals and anti-inflammatory agents. CONCLUSION: The findings reveal that marine organisms could be a promising source of novel antiinflammatory agents. However, further investigations are suggested for the isolation and identification of bioactive, exploring the mechanism of action and evaluating the efficacy in various inflammatory conditions.",
            "authors": [
                "Kapoor S.",
                "Nailwal N.",
                "Kumar M.",
                "Barve K."
            ],
            "cit_count": 0,
            "doi": "10.2174/1872213X13666190426164717",
            "journal": "Recent patents on inflammation & allergy drug discovery",
            "pmid": "31814546",
            "title": "Recent Patents and Discovery of Anti-inflammatory Agents from Marine Source",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:patents",
        "biotoolsID": "patents",
        "description": "Recent Patents and Discovery of Anti-inflammatory Agents from Marine Source.\n\nGoogle er tilgængelig på: Føroyskt.\n\nComplete Patent Searching Database and Patent Data Analytics Services.\n\nDiscover the latest inventions. Find the future.\n\nNew US patent applications weekly - BEFORE the USPTO decision to grant/deny.\n\nLearn more about our industry leading patent landscaping and analytics tool, AcclaimIP.\n\nDistillation of data, trends, news, and top thoughts of the week in the world of Intellectual Property.\n\nRecent documents: US Patents US Applications US Design Patents.\n\nFull Directory of Top Organizations Login for PDFs & Patent Monitoring INVENTOR'S EDGE - Marketing for Inventors.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'uspto', 'searchsimp', 'freshpatents', 'freepatentsonline'",
        "homepage": "http://www.google.com/patents",
        "name": "patents"
    }
}