{
    "additionDate": "2020-01-14T08:55:25Z",
    "biotoolsCURIE": "biotools:NCPHLDA",
    "biotoolsID": "NCPHLDA",
    "confidence_flag": "tool",
    "description": "A novel method for human lncRNA-disease association prediction based on network consistency projection.\n\nCopyright (C) 2019 Zecheng Huang(2111705162@mail2.gdut.edu.cn),Guobo Xie(xiegb@gdut.edu.cn).\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\nType: Package Title: NCPHLDA:A Novel Method for Human LncRNA-Disease Association Prediction Based on Network Consistency Projection.\n\nTo analyze these data on NCPHLDA to further infer potential associations between lncRNAs and diseases, you should input the appropriate code in the matlab Command Window:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bryanze/NCPHLDA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-04T07:40:49Z",
    "license": "GPL-2.0",
    "name": "NCPHLDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1039/C9MO00092E",
            "metadata": {
                "abstract": "© 2019 The Royal Society of Chemistry.In recent years, an increasing number of biological experiments and clinical reports have shown that lncRNA is closely related to the development of various complex human diseases. Therefore, studying the relationship between lncRNA and disease is necessary. Doing so not only helps to understand the disease mechanism, but also facilitates the diagnosis, treatment, and prognosis of disease. However, understanding the relationship between lncRNA and disease through biological experiments and clinical studies requires considerable time and money. Over the years, many researchers have developed computational methods to predict potential lncRNA-disease associations. In this study, on the basis of the assumption that functionally similar lncRNAs tend to associate with phenotypically similar diseases, and vice versa, we propose a novel computational method called network consistency projection for human lncRNA-disease associations (NCPHLDA) to predict potential lncRNA-disease associations. This method integrates a lncRNA cosine similarity network, a disease cosine similarity network, and the known lncRNA-disease association network. NCPHLDA is not only a parameterless method but also does not require a negative sample. More importantly, NCPHLDA can predict lncRNA without any known associated diseases. AUC values of 0.9273 and 0.9179 ± 0.0043 are obtained by implementing leave-one-out cross-validation and 5-fold cross-validation for NCPHLDA, respectively. Case studies of three diseases (breast cancer, cervical cancer, and hepatocellular carcinoma) indicate that NCPHLDA has reliable predictive performance. The source code of NCPHLDA is freely available at https://github.com/bryanze/NCPHLDA.",
                "authors": [
                    {
                        "name": "Huang Z."
                    },
                    {
                        "name": "Lin Z."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Xie G."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Omics",
                "title": "NCPHLDA: A novel method for human lncRNA-disease association prediction based on network consistency projection"
            },
            "pmid": "31686064"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
