{"credit":[{"email":"bpasaniu@hsph.harvard.edu","name":"Bogdan Pasaniuc","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bogdan.bioinformatics.ucla.edu/"},{"email":"aprice@hsph.harvard.edu","name":"Alkes L. Price","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bogdan.bioinformatics.ucla.edu/software/"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mixscore-1-0-disease-scoring-admixed-populations.html"}],"publication":[{"abstract":"While genome-wide association studies (GWAS) have primarily examined populations of European ancestry, more recent studies often involve additional populations, including admixed populations such as African Americans and Latinos. In admixed populations, linkage disequilibrium (LD) exists both at a fine scale in ancestral populations and at a coarse scale (admixture-LD) due to chromosomal segments of distinct ancestry. Disease association statistics in admixed populations have previously considered SNP association (LD mapping) or admixture association (mapping by admixture-LD), but not both. Here, we introduce a new statistical framework for combining SNP and admixture association in case-control studies, as well as methods for local ancestry-aware imputation. We illustrate the gain in statistical power achieved by these methods by analyzing data of 6,209 unrelated African Americans from the CARe project genotyped on the Affymetrix 6.0 chip, in conjunction with both simulated and real phenotypes, as well as by analyzing the FGFR2 locus using breast cancer GWAS data from 5,761 African-American women. We show that, at typed SNPs, our method yields an 8% increase in statistical power for finding disease risk loci compared to the power achieved by standard methods in case-control studies. At imputed SNPs, we observe an 11% increase in statistical power for mapping disease loci when our local ancestry-aware imputation framework and the new scoring statistic are jointly employed. Finally, we show that our method increases statistical power in regions harboring the causal SNP in the case when the causal SNP is untyped and cannot be imputed. Our methods and our publicly available software are broadly applicable to GWAS in admixed populations.","authors":["Pasaniuc B.","Zaitlen N.","Lettre G.","Chen G.K.","Tandon A.","Kao W.H.L.","Ruczinski I.","Fornage M.","Siscovick D.S.","Zhu X.","Larkin E.","Lange L.A.","Cupples L.A.","Yang Q.","Akylbekova E.L.","Musani S.K.","Divers J.","Mychaleckyj J.","Li M.","Papanicolaou G.J.","Millikan R.C.","Ambrosone C.B.","John E.M.","Bernstein L.","Zheng W.","Hu J.J.","Ziegler R.G.","Nyante S.J.","Bandera E.V.","Ingles S.A.","Press M.F.","Chanock S.J.","Deming S.L.","Rodriguez-Gil J.L.","Palmer C.D.","Buxbaum S.","Ekunwe L.","Hirschhorn J.N.","Henderson B.E.","Myers S.","Haiman C.A.","Reich D.","Patterson N.","Wilson J.G.","Price A.L."],"cit_count":68,"journal":"PLoS Genetics","pmid":"21541012","title":"Enhanced statistical tests for GWAS in admixed populations: Assessment using african americans from CARe and a breast cancer consortium","year":"2011-04-01"}],"summary":{"biotoolsCURIE":"biotools:mixscore","biotoolsID":"mixscore","description":"Software for disease scoring (combining case-only admixture and case-control SNP association signals) in Admixed Populations such as African Americans.","homepage":"http://bogdan.bioinformatics.ucla.edu/software/","name":"MIXSCORE"}}