{
    "additionDate": "2020-01-14T09:30:26Z",
    "biotoolsCURIE": "biotools:US200_CN200",
    "biotoolsID": "US200_CN200",
    "confidence_flag": "tool",
    "description": "Sample sizes and population differences in brain template construction.\n\nCaucasian and Chinese Brain templates [US200 CN200]",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.nitrc.org/projects/us200_cn200/",
    "lastUpdate": "2021-01-02T10:12:42Z",
    "name": "US200 CN200",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2019.116318",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.Spatial normalization or deformation to a standard brain template is routinely used as a key module in various pipelines for the processing of magnetic resonance imaging (MRI) data. Brain templates are often constructed using MRI data from a limited number of subjects. Individual brains show significant variabilities in their morphology; thus, sample sizes and population differences are two key factors that influence brain template construction. To address these influences, we employed two independent groups from the Human Connectome Project (HCP) and the Chinese Human Connectome Project (CHCP) to quantify the impacts of sample sizes and population on brain template construction. We first assessed the effect of sample size on the construction of volumetric brain templates using data subsets from the HCP and CHCP datasets. We applied a voxel-wise index of the deformation variability and a logarithmically transformed Jacobian determinant to quantify the variability associated with the template construction and modeled the brain template variability as a power function of the sample size. At the system level, the frontoparietal control network and dorsal attention network demonstrated higher deformation variability and logged Jacobian determinants, whereas other primary networks showed lower variability. To investigate the population differences, we constructed Caucasian and Chinese standard brain atlases (namely, US200 and CN200). The two demographically matched templates, particularly the language-related areas, exhibited dramatic bilaterally in supramarginal gyri and inferior frontal gyri differences in their deformation variability and logged Jacobian determinant. Using independent data from the HCP and CHCP, we examined the segmentation and registration accuracy and observed significant reduction in the performance of the brain segmentation and registration when the population-mismatched templates were used in the spatial normalization. Our findings provide evidence to support the use of population-matched templates in human brain mapping studies. The US200 and CN200 templates have been released on the Neuroimage Informatics Tools and Resources Clearinghouse (NITRC) website (https://www.nitrc.org/projects/us200_cn200/).",
                "authors": [
                    {
                        "name": "Yang G."
                    },
                    {
                        "name": "Zhou S."
                    },
                    {
                        "name": "Bozek J."
                    },
                    {
                        "name": "Dong H.-M."
                    },
                    {
                        "name": "Han M."
                    },
                    {
                        "name": "Zuo X.-N."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Gao J.-H."
                    }
                ],
                "citationCount": 9,
                "date": "2020-02-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Sample sizes and population differences in brain template construction"
            },
            "pmid": "31689538"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ],
    "validated": 1
}