{"credit":[{"name":"ELIXIR-ITA-TORVERGATA","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"citterich@uniroma2.it","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://phosfinder.bio.uniroma2.it/usage.html"}],"function":[{"operation":[{"term":"Protein feature detection","uri":"http://edamontology.org/operation_3092"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"}]},"publication":[{"abstract":"Phosfinder is a web server for the identification of phosphate binding sites in protein structures. Phosfinder uses a structural comparison algorithm to scan a query structure against a set of known 3D phosphate binding motifs. Whenever a structural similarity between the query protein and a phosphate binding motif is detected, the phosphate bound by the known motif is added to the protein structure thus representing a putative phosphate binding site. Predicted binding sites are then evaluated according to (i) their position with respect to the query protein solvent-excluded surface and (ii) the conservation of the binding residues in the protein family. The server accepts as input either the PDB code of the protein to be analyzed or a user-submitted structure in PDB format. All the search parameters are user modifiable. Phosfinder outputs a list of predicted binding sites with detailed information about their structural similarity with known phosphate binding motifs, and the conservation of the residues involved. A graphical applet allows the user to visualize the predicted binding sites on the query protein structure. The results on a set of 52 apo/holo structure pairs show that the performance of our method is largely unaffected by ligand-induced conformational changes. Phosfinder is available at http://phosfinder.bio.uniroma2.it. © 2011 The Author(s).","authors":["Parca L.","Mangone I.","Gherardini P.F.","Ausiello G.","Helmer-Citterich M."],"cit_count":8,"doi":"10.1093/nar/gkr389","journal":"Nucleic Acids Research","title":"Phosfinder: A web server for the identification of phosphate-binding sites on protein structures","type":"Primary","year":"2011-07-01"}],"summary":{"biotoolsCURIE":"biotools:phosfinder","biotoolsID":"phosfinder","description":"A web server for the identification of phosphate-binding sites on protein structures.","homepage":"http://phosfinder.bio.uniroma2.it","name":"Phosfinder","version":["1"]}}