{
    "additionDate": "2021-01-18T10:16:54Z",
    "biotoolsCURIE": "biotools:ribominer",
    "biotoolsID": "ribominer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yangxuerui@tsinghua.edu.cn",
            "name": "Xuerui Yang",
            "orcidid": "https://orcid.org/0000-0002-7731-2147",
            "typeEntity": "Person"
        }
    ],
    "description": "a toolset for mining multi-dimensional features of the translatome with ribosome profiling data.\n\nA python toolset for mining multi-dimensional features of the translatome with ribosome profiling data.\n\nThe RiboMiner is a python toolset for mining multi-dimensional features of the translatome with ribosome profiling data. This package has four function parts:.\n\n\nRiboMiner could offer other useful functions that would help users analyze ribosome profiling data, such as statistics of read coverage, visualization of read density for a single transcript or some transcript sets.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/yanglab/ribocode_ribominer"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xryanglab/RiboMiner",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-06T17:43:22Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/RiboMiner"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/xryanglab/RiboMiner/blob/master/Implementation.md"
        }
    ],
    "name": "RiboMiner",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03670-8",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Ribosome profiling has been widely used for studies of translation under a large variety of cellular and physiological contexts. Many of these studies have greatly benefitted from a series of data-mining tools designed for dissection of the translatome from different aspects. However, as the studies of translation advance quickly, the current toolbox still falls in short, and more specialized tools are in urgent need for deeper and more efficient mining of the important and new features of the translation landscapes. Results: Here, we present RiboMiner, a bioinformatics toolset for mining of multi-dimensional features of the translatome with ribosome profiling data. RiboMiner performs extensive quality assessment of the data and integrates a spectrum of tools for various metagene analyses of the ribosome footprints and for detailed analyses of multiple features related to translation regulation. Visualizations of all the results are available. Many of these analyses have not been provided by previous methods. RiboMiner is highly flexible, as the pipeline could be easily adapted and customized for different scopes and targets of the studies. Conclusions: Applications of RiboMiner on two published datasets did not only reproduced the main results reported before, but also generated novel insights into the translation regulation processes. Therefore, being complementary to the current tools, RiboMiner could be a valuable resource for dissections of the translation landscapes and the translation regulations by mining the ribosome profiling data more comprehensively and with higher resolution. RiboMiner is freely available at https://github.com/xryanglab/RiboMiner and https://pypi.org/project/RiboMiner.",
                "authors": [
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Xing X."
                    },
                    {
                        "name": "Xiao Z."
                    },
                    {
                        "name": "Xu G."
                    },
                    {
                        "name": "Yang X."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RiboMiner: A toolset for mining multi-dimensional features of the translatome with ribosome profiling data"
            },
            "pmcid": "PMC7430821",
            "pmid": "32738892"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}