{
    "additionDate": "2017-04-21T12:26:42Z",
    "biotoolsCURIE": "biotools:neuroscinfframework",
    "biotoolsID": "neuroscinfframework",
    "credit": [
        {
            "email": "info@neuinfo.org",
            "name": "NIF Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A dynamic inventory of Web-based neuroscience resources: data, materials, and tools accessible via any computer connected to the Internet. An initiative of the NIH Blueprint for Neuroscience Research, the Neuroscience Information Framework advances neuroscience research by enabling discovery and access to public research data and tools worldwide through an open source, networked environment.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://neuinfo.org/about/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "http://neuinfo.org",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "Neuroscience Information Framework",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The overarching goal of the NIF (Neuroscience Information Framework) project is to be a one-stop-shop for Neuroscience. This paper provides a technical overview of how the system is designed. The technical goal of the first version of the NIF system was to develop an information system that a neuroscientist can use to locate relevant information from a wide variety of information sources by simple keyword queries. Although the user would provide only keywords to retrieve information, the NIF system is designed to treat them as concepts whose meanings are interpreted by the system. Thus, a search for term should find a record containing synonyms of the term. The system is targeted to find information from web pages, publications, databases, web sites built upon databases, XML documents and any other modality in which such information may be published. We have designed a system to achieve this functionality. A central element in the system is an ontology called NIFSTD (for NIF Standard) constructed by amalgamating a number of known and newly developed ontologies. NIFSTD is used by our ontology management module, called OntoQuest to perform ontology-based search over data sources. The NIF architecture currently provides three different mechanisms for searching heterogeneous data sources including relational databases, web sites, XML documents and full text of publications. Version 1.0 of the NIF system is currently in beta test and may be accessed through http://nif.nih.gov . © 2008 Humana Press Inc.",
                "authors": [
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Bug W."
                    },
                    {
                        "name": "Marenco L."
                    },
                    {
                        "name": "Qian X."
                    },
                    {
                        "name": "Condit C."
                    },
                    {
                        "name": "Rangarajan A."
                    },
                    {
                        "name": "Muller H.M."
                    },
                    {
                        "name": "Miller P.L."
                    },
                    {
                        "name": "Sanders B."
                    },
                    {
                        "name": "Grethe J.S."
                    },
                    {
                        "name": "Astakhov V."
                    },
                    {
                        "name": "Shepherd G."
                    },
                    {
                        "name": "Sternberg P.W."
                    },
                    {
                        "name": "Martone M.E."
                    }
                ],
                "citationCount": 63,
                "date": "2008-09-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "Federated access to heterogeneous information resources in the Neuroscience Information Framework (NIF)"
            },
            "pmid": "18958629"
        },
        {
            "metadata": {
                "abstract": "With support from the Institutes and Centers forming the NIH Blueprint for Neuroscience Research, we have designed and implemented a new initiative for integrating access to and use of Web-based neuroscience resources: the Neuroscience Information Framework. The Framework arises from the expressed need of the neuroscience community for neuroinformatic tools and resources to aid scientific inquiry, builds upon prior development of neuroinformatics by the Human Brain Project and others, and directly derives from the Society for Neuroscience's Neuroscience Database Gateway. Partnered with the Society, its Neuroinformatics Committee, and volunteer consultant-collaborators, our multi-site consortium has developed: (1) a comprehensive, dynamic, inventory of Web-accessible neuroscience resources, (2) an extended and integrated terminology describing resources and contents, and (3) a framework accepting and aiding concept-based queries. Evolving instantiations of the Framework may be viewed at http://nif.nih.gov, http://neurogateway.org , and other sites as they come on line. © 2008 Humana Press Inc.",
                "authors": [
                    {
                        "name": "Gardner D."
                    },
                    {
                        "name": "Akil H."
                    },
                    {
                        "name": "Ascoli G.A."
                    },
                    {
                        "name": "Bowden D.M."
                    },
                    {
                        "name": "Bug W."
                    },
                    {
                        "name": "Donohue D.E."
                    },
                    {
                        "name": "Goldberg D.H."
                    },
                    {
                        "name": "Grafstein B."
                    },
                    {
                        "name": "Grethe J.S."
                    },
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Halavi M."
                    },
                    {
                        "name": "Kennedy D.N."
                    },
                    {
                        "name": "Marenco L."
                    },
                    {
                        "name": "Martone M.E."
                    },
                    {
                        "name": "Miller P.L."
                    },
                    {
                        "name": "Muller H.-M."
                    },
                    {
                        "name": "Robert A."
                    },
                    {
                        "name": "Shepherd G.M."
                    },
                    {
                        "name": "Sternberg P.W."
                    },
                    {
                        "name": "Van Essen D.C."
                    },
                    {
                        "name": "Williams R.W."
                    }
                ],
                "citationCount": 141,
                "date": "2008-09-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "The neuroscience information framework: A data and knowledge environment for neuroscience"
            },
            "pmid": "18946742"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}