{
    "additionDate": "2021-01-18T07:42:44Z",
    "biotoolsCURIE": "biotools:iot-stream",
    "biotoolsID": "iot-stream",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "t.elsaleh@surrey.ac.uk",
            "name": "Tarek Elsaleh",
            "orcidid": "https://orcid.org/0000-0002-9134-0232",
            "typeEntity": "Person"
        }
    ],
    "description": "A Lightweight Ontology for Internet of Things Data Streams and Its Use with Data Analytics and Event Detection Services.\n\nA Lightweight Ontology for IoT Data Streams.\n\nT. Elsaleh, M. Bermudez-Edo, S. Enshaeifar, S. T. Acton, R. Rezvani and P. Barnaghi, \"IoT-Stream: A Lightweight Ontology for Internet of Things Data Streams,\" 2019 Global IoT Summit (GIoTS), Aarhus, Denmark, 2019, pp. 1-6.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'IoT' (bio.tools/IoT)",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://iot.ee.surrey.ac.uk/iot-crawler/ontology/iot-stream",
    "lastUpdate": "2021-02-05T07:48:21Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://purl.org/iot/ontology/iot-stream"
        }
    ],
    "name": "IoT-Stream",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/S20040953",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.With the proliferation of sensors and IoT technologies, stream data are increasingly stored and analyzed, but rarely combined, due to the heterogeneity of sources and technologies. Semantics are increasingly used to share sensory data, but not so much for annotating stream data. Semantic models for stream annotation are scarce, as generally semantics are heavy to process and not ideal for Internet of things (IoT) environments, where the data are frequently updated. We present a light model to semantically annotate streams, IoT-Stream. It takes advantage of common knowledge sharing of the semantics, but keeping the inferences and queries simple. Furthermore, we present a system architecture to demonstrate the adoption the semantic model, and provide examples of instantiation of the system for different use cases. The system architecture is based on commonly used architectures in the field of IoT, such as web services, microservices and middleware. Our system approach includes the semantic annotations that take place in the pipeline of IoT services and sensory data analytics. It includes modules needed to annotate, consume, and query data annotated with IoT-Stream. In addition to this, we present tools that could be used in conjunction to the IoT-Stream model and facilitate the use of semantics in IoT.",
                "authors": [
                    {
                        "name": "Elsaleh T."
                    },
                    {
                        "name": "Enshaeifar S."
                    },
                    {
                        "name": "Rezvani R."
                    },
                    {
                        "name": "Acton S.T."
                    },
                    {
                        "name": "Janeiko V."
                    },
                    {
                        "name": "Bermudez-Edo M."
                    }
                ],
                "citationCount": 11,
                "date": "2020-02-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "LoT-stream: A lightweight ontology for internet of things data streams and its use with data analytics and event detection services"
            },
            "pmcid": "PMC7071512",
            "pmid": "32053898"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}