{
    "additionDate": "2017-03-27T07:56:16Z",
    "biotoolsCURIE": "biotools:dbdepc",
    "biotoolsID": "dbdepc",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "dbdepc@scbit.org",
            "name": "dbdepc Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A database of differentially expressed proteins in human cancers (dbDEPC) collects curated cancer proteomics data, provides a resource for information on protein-level expression changes, and explores protein profile differences among different cancers. dbDEPC currently contains 1803 proteins differentially expressed in 15 cancers, curated from 65 mass spectrometry (MS) experiments in peer-reviewed publications.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                }
            ]
        }
    ],
    "homepage": "http://lifecenter.sgst.cn/dbdepc/index.do",
    "lastUpdate": "2019-03-26T08:15:00Z",
    "name": "dbDEPC",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Cancer-related investigations have long been in the limelight of biomedical research. Years of effort from scientists and doctors worldwide have generated large amounts of data at the genome, transcriptome, proteome and even metabolome level, and DNA and RNA cancer signature databases have been established. Here we present a database of differentially expressed proteins in human cancers (dbDEPC), with the goal of collecting curated cancer proteomics data, providing a resource for information on protein-level expression changes, and exploring protein profile differences among different cancers. dbDEPC currently contains 1803 proteins differentially expressed in 15 cancers, curated from 65 mass spectrometry (MS) experiments in peer-reviewed publications. In addition to MS experiments, low-throughput experiment data from the same literatures and cancer-associated genes from external databases were also integrated to provide some validation information. Furthermore, dbDEPC associates differential proteins with important structural variations in the human genome, such as copy number variations or single nucleotide polymorphisms, which might be helpful for explaining changes in protein expression at the DNA level. Data in dbDEPC can be queried by protein identifier, description or sequence; the retrieved protein entry provides the differential expression pattern seen in cancers, along with detailed annotations. dbDEPC is expected to be a reference database for cancer signatures at the protein level. This database is provided at http://dbdepc.biosino.org/index/. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Ding G."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Li Y."
                    }
                ],
                "citationCount": 15,
                "date": "2009-11-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "dbDEPC: A database of differentially expressed proteins in human cancers"
            },
            "pmid": "19900968"
        },
        {
            "metadata": {
                "abstract": "A large amount of differentially expressed proteins (DEPs) have been identified in various cancer proteomics experiments, curation and annotation of these proteins are important in deciphering their roles in oncogenesis and tumor progression, and may further help to discover potential protein biomarkers for clinical applications. In 2009, we published the first database of DEPs in human cancers (dbDEPCs). In this updated version of 2011, dbDEPC 2.0 has more than doubly expanded to over 4000 protein entries, curated from 331 experiments across 20 types of human cancers. This resource allows researchers to search whether their interested proteins have been reported changing in certain cancers, to compare their own proteomic discovery with previous studies, to picture selected protein expression heatmap across multiple cancers and to relate protein expression changes with aberrance in other genetic level. New important developments include addition of experiment design information, advanced filter tools for customer-specified analysis and a network analysis tool. We expect dbDEPC 2.0 to be a much more powerful tool than it was in its first release and can serve as reference to both proteomics and cancer researchers. dbDEPC 2.0 is available at http://lifecenter.sgst.cn/dbdepc/index. do. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Ju Y."
                    },
                    {
                        "name": "Yu Z."
                    },
                    {
                        "name": "Lv D."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Yuan W."
                    },
                    {
                        "name": "He F."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Wang-Sattler R."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Xie L."
                    }
                ],
                "citationCount": 15,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "dbDEPC 2.0: Updated database of differentially expressed proteins in human cancers"
            },
            "pmid": "22096234"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ]
}