{
    "additionDate": "2021-01-18T10:25:46Z",
    "biotoolsCURIE": "biotools:bmltux",
    "biotoolsID": "bmltux",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "troje@yorku.ca",
            "name": "Nikolaus F. Troje",
            "orcidid": "https://orcid.org/0000-0002-1533-2847",
            "typeEntity": "Person"
        }
    ],
    "description": "The BiomotionLab Toolkit for Unity Experiments (bmlTUX) helps you design and run experiments in Unity quickly and iteratively without fussing over coding details. The toolkit includes tools to aid in both the design and the execution of experiments in Unity. The toolkit is designed to simplify the setup and reduce the required code needed to get experiments up and running quickly. The toolkit can automatically handle the difficult task creating trial tables, combinatorics randomization, blocking, etc. Such functionality removes one of the most difficult aspects of creating experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://biomotionlab.github.io/TUX/",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-02-04T16:29:24Z",
    "license": "CC-BY-NC-SA-4.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.biomotionlab.ca/tux/"
        }
    ],
    "name": "bmlTUX",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1177/2041669520938400",
            "metadata": {
                "abstract": "© The Author(s) 2020.Advances in virtual reality technology have made it a valuable new tool for vision and perception researchers. Coding virtual reality experiments from scratch can be difficult and time-consuming, so researchers rely on software such as Unity game engine to create and edit virtual scenes. However, Unity lacks built-in tools for controlling experiments. Existing third-party add-ins requires complicated scripts to define experiments. This can be difficult and requires advanced coding knowledge, especially for multifactorial experimental designs. In this article, we describe a new free and open-source tool called the BiomotionLab Toolkit for Unity Experiments (bmlTUX) that provides a simple interface for controlling experiments in Unity. In contrast to existing tools, bmlTUX provides a graphical interface to automatically handle combinatorics, counterbalancing, randomization, mixed designs, and blocking of trial order. The toolbox works out-of-the-box since simple experiments can be created with almost no coding. Furthermore, multiple design configurations can be swapped with a drag-and-drop interface allowing researchers to test new configurations iteratively while maintaining the ability to easily revert to previous configurations. Despite its simplicity, bmlTUX remains highly flexible and customizable, catering to coding novices and experts alike.",
                "authors": [
                    {
                        "name": "Bebko A.O."
                    },
                    {
                        "name": "Troje N.F."
                    }
                ],
                "citationCount": 3,
                "date": "2020-07-01T00:00:00Z",
                "journal": "i-Perception",
                "title": "bmlTUX: Design and Control of Experiments in Virtual Reality and Beyond"
            },
            "pmcid": "PMC7370570",
            "pmid": "32733664"
        }
    ],
    "toolType": [
        "Plug-in",
        "Suite"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ]
}