{
    "additionDate": "2021-01-18T10:27:32Z",
    "biotoolsCURIE": "biotools:fastbmd",
    "biotoolsID": "fastbmd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jeff.xia@mcgill.ca",
            "name": "Jianguo Xia",
            "typeEntity": "Person"
        },
        {
            "email": "niladri.basu@mcgill.ca",
            "name": "Niladri Basu",
            "typeEntity": "Person"
        }
    ],
    "description": "FastBMD is an online tool for rapid benchmark dose-response analysis of transcriptomics data. FastBMD is a computationally efficient implementation of the National Toxicology Program Approach to Genomic Dose-Response Modeling. Key features include a simplified workflow, ability to download results at each step, and interactive exploration of pathway-level BMDs. In addition to model organisms, FastBMD is designed to support non-model organisms by enabling an annotation-free pipeline that includes feature sensitivity-based point-of-departure analysis. The final part of the analysis is designed to allow users to interactively explore BMDs at different levels of organization:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.fastbmd.ca",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-10T20:17:14Z",
    "name": "FastBMD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA700",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Transcriptomics dose-response analysis is a promising new approach method for toxicity testing. While international regulatory agencies have spent substantial effort establishing a standardized statistical approach, existing software that follows this approach is computationally inefficient and must be locally installed. Results: FastBMD is a web-based tool that implements standardized methods for transcriptomics benchmark dose-response analysis in R. It is >60 times faster than the current leading software, supports transcriptomics data from 13 species, and offers a comprehensive analytical pipeline that goes from processing and normalization of raw gene expression values to interactive exploration of pathway-level benchmark dose results.",
                "authors": [
                    {
                        "name": "Ewald J."
                    },
                    {
                        "name": "Soufan O."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Basu N."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FastBMD: An online tool for rapid benchmark dose-response analysis of transcriptomics data"
            },
            "pmid": "32761065"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}