{
    "additionDate": "2021-01-18T07:37:03Z",
    "biotoolsCURIE": "biotools:bhi-cect",
    "biotoolsID": "bhi-cect",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "taniguchi@riken.jp",
            "name": "Yuichi Taniguchi",
            "orcidid": "https://orcid.org/0000-0001-5677-8901",
            "typeEntity": "Person"
        }
    ],
    "description": "BHi-Cect aims to find preferentially self-interacting chromosome clusters using Hi-C data. It only assumes that chromosome architecture consists of a nested hierarchy where we expect to find smaller-sized clusters nested within larger-sized clusters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/princeps091-binf/BHi-Cect",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-31T18:25:08Z",
    "license": "MIT",
    "name": "BHi-Cect",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA004",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput chromosome conformation capture (Hi-C) technology enables the investigation of genome-wide interactions among chromosome loci. Current algorithms focus on topologically associating domains (TADs), that are contiguous clusters along the genome coordinate, to describe the hierarchical structure of chromosomes. However, high resolution Hi-C displays a variety of interaction patterns beyond what current TAD detection methods can capture. Here, we present BHi-Cect, a novel top-down algorithm that finds clusters by considering every locus with no assumption of genomic contiguity using spectral clustering. Our results reveal that the hierarchical structure of chromosome is organized as 'enclaves', which are complex interwoven clusters at both local and global scales. We show that the nesting of local clusters within global clusters characterizing enclaves, is associated with the epigenomic activity found on the underlying DNA. Furthermore, we show that the hierarchical nesting that links different enclaves integrates their respective function. BHi-Cect provides means to uncover the general principles guiding chromatin architecture.",
                "authors": [
                    {
                        "name": "Kumar V."
                    },
                    {
                        "name": "Leclerc S."
                    },
                    {
                        "name": "Taniguchi Y."
                    }
                ],
                "date": "2020-03-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BHi-Cect: A top-down algorithm for identifying the multi-scale hierarchical structure of chromosomes"
            },
            "pmcid": "PMC7049727",
            "pmid": "32009153"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}