{
    "additionDate": "2017-12-06T18:14:08Z",
    "biotoolsCURIE": "biotools:coev-web",
    "biotoolsID": "coev-web",
    "credit": [
        {
            "email": "coev@unil.ch",
            "name": "Coev Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Coev-Web platform is a user-friendly interface of the command-line program Coev. The platform allows the evaluation of coevolving positions and their evolutionary profile based on the aligned sequences and a phylogenetic tree. It can also simulate coevolving pairs of positions along a given phylogenetic tree.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://coev.vital-it.ch/#/manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ]
        }
    ],
    "homepage": "http://coev.vital-it.ch/#/",
    "lastUpdate": "2024-11-25T14:06:05.766638Z",
    "name": "Coev-Web",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu012",
            "metadata": {
                "abstract": "Motivation: The analysis of molecular coevolution provides information on the potential functional and structural implication of positions along DNA sequences, and several methods are available to identify coevolving positions using probabilistic or combinatorial approaches. The specific nucleotide or amino acid profile associated with the coevolution process is, however, not estimated, but only known profiles, such as the Watson-Crick constraint, are usually considered a priori in current measures of coevolution. Results: Here, we propose a new probabilistic model, Coev, to identify coevolving positions and their associated profile in DNA sequences while incorporating the underlying phylogenetic relationships. The process of coevolution is modeled by a 1616 instantaneous rate matrix that includes rates of transition as well as a profile of coevolution. We used simulated, empirical and illustrative data to evaluate our model and to compare it with a model of 'independent' evolution using Akaike Information Criterion.We showed that the Coev model is able to discriminate between coevolving and non-coevolving positions and provides better specificity and specificity than other available approaches. We further demonstrate that the identification of the profile of coevolution can shed new light on the process of dependent substitution during lineage evolution. © The Author 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Dib L."
                    },
                    {
                        "name": "Salamin N."
                    },
                    {
                        "name": "Silvestro D."
                    }
                ],
                "citationCount": 17,
                "date": "2014-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Evolutionary footprint of coevolving positions in genes"
            },
            "pmid": "24413673",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}
