{
    "additionDate": "2018-07-28T09:11:50Z",
    "biotoolsCURIE": "biotools:dmrfinder",
    "biotoolsID": "dmrfinder",
    "credit": [
        {
            "email": "jsh58@wildcats.unh.edu",
            "name": "John M. Gaspar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identifying differentially methylated regions from MethylC-seq (bisulfite-sequencing) data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/jsh58/DMRfinder/blob/master/UserGuide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jsh58/DMRfinder",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "DMRfinder",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1909-0",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: DNA methylation is an epigenetic modification that is studied at a single-base resolution with bisulfite treatment followed by high-throughput sequencing. After alignment of the sequence reads to a reference genome, methylation counts are analyzed to determine genomic regions that are differentially methylated between two or more biological conditions. Even though a variety of software packages is available for different aspects of the bioinformatics analysis, they often produce results that are biased or require excessive computational requirements. Results: DMRfinder is a novel computational pipeline that identifies differentially methylated regions efficiently. Following alignment, DMRfinder extracts methylation counts and performs a modified single-linkage clustering of methylation sites into genomic regions. It then compares methylation levels using beta-binomial hierarchical modeling and Wald tests. Among its innovative attributes are the analyses of novel methylation sites and methylation linkage, as well as the simultaneous statistical analysis of multiple sample groups. To demonstrate its efficiency, DMRfinder is benchmarked against other computational approaches using a large published dataset. Contrasting two replicates of the same sample yielded minimal genomic regions with DMRfinder, whereas two alternative software packages reported a substantial number of false positives. Further analyses of biological samples revealed fundamental differences between DMRfinder and another software package, despite the fact that they utilize the same underlying statistical basis. For each step, DMRfinder completed the analysis in a fraction of the time required by other software. Conclusions: Among the computational approaches for identifying differentially methylated regions from high-throughput bisulfite sequencing datasets, DMRfinder is the first that integrates all the post-alignment steps in a single package. Compared to other software, DMRfinder is extremely efficient and unbiased in this process. DMRfinder is free and open-source software, available on GitHub ( github.com/jsh58/DMRfinder ); it is written in Python and R, and is supported on Linux.",
                "authors": [
                    {
                        "name": "Gaspar J.M."
                    },
                    {
                        "name": "Hart R.P."
                    }
                ],
                "citationCount": 19,
                "date": "2017-11-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DMRfinder: Efficiently identifying differentially methylated regions from MethylC-seq data"
            },
            "pmcid": "PMC5817627",
            "pmid": "29187143"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}