{
    "additionDate": "2021-01-18T10:39:03Z",
    "biotoolsCURIE": "biotools:photochemcad",
    "biotoolsID": "photochemcad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jlindsey@ncsu.edu",
            "name": "Jonathan S. Lindsey",
            "typeEntity": "Person"
        },
        {
            "email": "mtanigu@ncsu.edu",
            "name": "Masahiko Taniguchi",
            "typeEntity": "Person"
        }
    ],
    "description": "Absorption and Fluorescence Spectral Database of Chlorophylls and Analogues.\n\ncalculational modules and databases of absorption and emission spectra for diverse compounds.\n\nPhotochemCAD™ is a program of calculational modules and accompanying database of spectra aimed at advancing the photosciences. A streamlined version of the same database of spectra can now be viewed on our new website. The user is directed to the following journal articles for full description of the program and database:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.photochemcad.com",
    "lastUpdate": "2021-01-23T15:32:37Z",
    "name": "PhotochemCAD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/PHP.13319",
            "metadata": {
                "abstract": "© 2020 American Society for PhotobiologyAbsorption spectra and fluorescence spectra are essential for use across the photosciences, yet such spectra along with the all-important values for molar absorption coefficient (ε) and fluorescence quantum yield (Φf) often are found with great difficulty. Here, a literature survey concerning the vital class of chlorophyll compounds has led to identification of spectra for 150 members. Spectra in print form have been digitized (with baseline corrections) and assembled into a database along with literature references, solvent identity and values for ε and Φf (where available). The database encompasses photosynthetic tetrapyrroles wherein the chromophore is a porphyrin (e.g. chlorophyll c1, protochlorophyll a), chlorin (e.g. chlorophyll a, bacteriochlorophyll c) or bacteriochlorin (e.g. bacteriochlorophyll a). Altogether, the database contains 305 absorption spectra (from 19 porphyrins, 109 chlorins and 22 bacteriochlorins) and 72 fluorescence spectra (from 10 porphyrins, 30 chlorins and 4 bacteriochlorins). The spectral database should facilitate comparisons and quantitative calculations. All spectra are available in print form in the Supporting Information. The entire database in digital form is available with the PhotochemCAD program for free downloading and further use at http://www.photochemcad.com.",
                "authors": [
                    {
                        "name": "Lindsey J.S."
                    },
                    {
                        "name": "Taniguchi M."
                    }
                ],
                "citationCount": 8,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Photochemistry and Photobiology",
                "title": "Absorption and Fluorescence Spectral Database of Chlorophylls and Analogues"
            },
            "pmid": "32757305"
        }
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
