{
    "additionDate": "2022-09-05T13:47:33.700935Z",
    "biotoolsCURIE": "biotools:cansarchem",
    "biotoolsID": "cansarchem",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Albert.Antolin@icr.ac.uk",
            "name": "Albert A. Antolin",
            "typeEntity": "Person"
        },
        {
            "email": "ballazikani@mdanderson.org",
            "name": "Bissan Al-Lazikani",
            "typeEntity": "Person"
        }
    ],
    "description": "canSAR is a chemistry registration and standardization pipeline.",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "https://www.knime.com/terms-forum-hub"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://cansar.icr.ac.uk",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-05T13:47:33.703349Z",
    "license": "CC-BY-SA-4.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://hub.knime.com/danieladolciami/spaces/Public/latest/canSARchem_RDKit~7Qe3vnQZ9zpIla4Z"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://hub.knime.com/danieladolciami/spaces/Public/latest/canSARchem~hquSdFp3di4kiEv"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.icr.ac.uk/cansar-public/compound-registration-pipeline"
        }
    ],
    "name": "canSARchem",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S13321-022-00606-7",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Integration of medicinal chemistry data from numerous public resources is an increasingly important part of academic drug discovery and translational research because it can bring a wealth of important knowledge related to compounds in one place. However, different data sources can report the same or related compounds in various forms (e.g., tautomers, racemates, etc.), thus highlighting the need of organising related compounds in hierarchies that alert the user on important bioactivity data that may be relevant. To generate these compound hierarchies, we have developed and implemented canSARchem, a new compound registration and standardization pipeline as part of the canSAR public knowledgebase. canSARchem builds on previously developed ChEMBL and PubChem pipelines and is developed using KNIME. We describe the pipeline which we make publicly available, and we provide examples on the strengths and limitations of the use of hierarchies for bioactivity data exploration. Finally, we identify canonicalization enrichment in FDA-approved drugs, illustrating the benefits of our approach. Results: We created a chemical registration and standardization pipeline in KNIME and made it freely available to the research community. The pipeline consists of five steps to register the compounds and create the compounds’ hierarchy: 1. Structure checker, 2. Standardization, 3. Generation of canonical tautomers and representative structures, 4. Salt strip, and 5. Generation of abstract structure to generate the compound hierarchy. Unlike ChEMBL’s RDKit pipeline, we carry out compound canonicalization ahead of getting the parent structure, similar to PubChem’s OpenEye pipeline. canSARchem has a lower rejection rate compared to both PubChem and ChEMBL. We use our pipeline to assess the impact of grouping the compounds in hierarchies for bioactivity data exploration. We find that FDA-approved drugs show statistically significant sensitivity to canonicalization compared to the majority of bioactive compounds which demonstrates the importance of this step. Conclusions: We use canSARchem to standardize all the compounds uploaded in canSAR (> 3 million) enabling efficient data integration and the rapid identification of alternative compound forms with useful bioactivity data. Comparison with PubChem and ChEMBL pipelines evidenced comparable performances in compound standardization, but only PubChem and canSAR canonicalize tautomers and canSAR has a slightly lower rejection rate. Our results highlight the importance of compound hierarchies for bioactivity data exploration. We make canSARchem available under a Creative Commons Attribution-ShareAlike 4.0 International License (CC BY-SA 4.0) at https://gitlab.icr.ac.uk/cansar-public/compound-registration-pipeline.",
                "authors": [
                    {
                        "name": "Al-Lazikani B."
                    },
                    {
                        "name": "Antolin A.A."
                    },
                    {
                        "name": "Dolciami D."
                    },
                    {
                        "name": "Kannas C."
                    },
                    {
                        "name": "Meniconi M."
                    },
                    {
                        "name": "Villasclaras-Fernandez E."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "canSAR chemistry registration and standardization pipeline"
            },
            "pmcid": "PMC9148294",
            "pmid": "35643512"
        }
    ],
    "toolType": [
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Synthetic chemistry",
            "uri": "http://edamontology.org/topic_3371"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
