{
    "additionDate": "2020-01-09T17:48:35Z",
    "biotoolsCURIE": "biotools:CP-North",
    "biotoolsID": "CP-North",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "ann.alriksson-schmidt@med.lu.se",
            "name": "Ann I Alriksson-Schmidt",
            "typeEntity": "Person"
        }
    ],
    "description": "living life in the Nordic countries? A retrospective register research protocol on individuals with cerebral palsy and their parents living in Sweden, Norway, Denmark, Finland and Iceland.\n\nLiving life with cerebral palsy in the Nordic countries.\n\nSixty-three applicants applied for the doctoral position with CPNorth that recently closed. Health economist, and will be supervisor Associate Professor Johan Jarl was pleased with the turn-out “We are delighted that there were so many qualified applicants who were interested in working with CPNorth” Now, the journey has begun to select the candidate who will become the first official CPNorth PhD student",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://rdi.arcada.fi/cpnorth/en/",
    "lastUpdate": "2020-01-09T17:48:35Z",
    "name": "CP-North",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1136/BMJOPEN-2018-024438",
            "metadata": {
                "abstract": "© 2019 Author(s).Introduction Cerebral palsy (CP) is one of the most common neurodevelopmental disabilities. Yet, most individuals with CP are adults. How individuals with CP fare in terms of health, quality of life (QoL), education, employment and income is largely unknown. Further, little is known about the effects of having a child with CP on the parents. The Nordic countries are known for their strong welfare systems, yet it is unknown to what extent the added burden related to disability is actually compensated for. We will explore how living with CP affects health, QoL, healthcare utilisation, education, labour market outcomes, socioeconomic status and mortality throughout the lifespan of individuals with CP and their parents. We will also investigate if these effects differ between subgroups, within and across the Nordic countries. Methods and analyses CP-North is a multidisciplinary 4-year (1 August 2017 to 31 July 2021) register research project. The research consortium comprises researchers and users from Sweden, Norway, Denmark, Iceland and Finland. Data from CP registries and follow-up programmes, or cohorts of individuals with CP, will be merged with general national registries. All individual studies are structured under three themes: medical outcomes, social and public health outcomes, and health economics. Both case-control and cohort designs will be included depending on the particular research question. Data will be analysed in the individual countries and later merged across nations. Ethics and dissemination The ethics approval processes in each individual country are followed. Findings will be published (open access) in international peer-reviewed journals in related fields. Updates on CP-North will be published online at http://rdi.arcada.fi/cpnorth/en/",
                "authors": [
                    {
                        "name": "Alriksson-Schmidt A.I."
                    },
                    {
                        "name": "Ahonen M."
                    },
                    {
                        "name": "Andersen G.L."
                    },
                    {
                        "name": "Eggertsdottir G."
                    },
                    {
                        "name": "Haula T."
                    },
                    {
                        "name": "Jahnsen R."
                    },
                    {
                        "name": "Jarl J."
                    },
                    {
                        "name": "Jeglinsky-Kankainen I."
                    },
                    {
                        "name": "Jonsdottir G."
                    },
                    {
                        "name": "Seid A.K."
                    },
                    {
                        "name": "Asgeirsdottir T.L."
                    },
                    {
                        "name": "Moller-Madsen B."
                    },
                    {
                        "name": "Nordbye-Nielsen K."
                    },
                    {
                        "name": "Saha S."
                    },
                    {
                        "name": "Steskal D."
                    },
                    {
                        "name": "Saaksvuori L."
                    },
                    {
                        "name": "Hagglund G."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "BMJ Open",
                "title": "CP-North: Living life in the Nordic countries? A retrospective register research protocol on individuals with cerebral palsy and their parents living in Sweden, Norway, Denmark, Finland and Iceland"
            },
            "pmcid": "PMC6797311",
            "pmid": "31575533"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ]
}