{
    "additionDate": "2024-06-17T18:40:29.288870Z",
    "biotoolsCURIE": "biotools:markerscan",
    "biotoolsID": "markerscan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mb35@sanger.ac.uk",
            "name": "Mark L. Blaxter",
            "orcidid": "https://orcid.org/0000-0001-5902-6641",
            "typeEntity": "Person"
        }
    ],
    "description": "Separation and assembly of cobionts sequenced alongside target species in biodiversity genomics projects.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CobiontID/MarkerScan",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-06-17T18:40:29.293101Z",
    "license": "CC-BY-4.0",
    "name": "MarkerScan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/wellcomeopenres.20730.1",
            "metadata": {
                "abstract": "Contamination of public databases by mislabelled sequences has been highlighted for many years and the avalanche of novel sequencing data now being deposited has the potential to make databases difficult to use effectively. It is therefore crucial that sequencing projects and database curators perform pre-submission checks to remove obvious contamination and avoid propagating erroneous taxonomic relationships. However, it is important also to recognise that biological contamination of a target sample with unexpected species’ DNA can also lead to the discovery of fascinating biological phenomena through the identification of environmental organisms or endosymbionts. Here, we present a novel, integrated method for detection and generation of high-quality genomes of all non-target genomes co-sequenced in eukaryotic genome sequencing projects. After performing taxonomic profiling of an assembly from the raw data, and leveraging the identity of small rRNA sequences discovered therein as markers, a targeted classification approach retrieves and assembles high-quality genomes. The genomes of these cobionts are then not only removed from the target species’ genome but also available for further interrogation. Source code is available from https://github.com/CobiontID/MarkerScan. MarkerScan is written in Python and is deployed as a Docker container. This article addresses a common issue in genetic research: the accidental mixing of genetic information from different species in public databases, often due to mislabelling or contamination. Interestingly, this ‘contamination’ can sometimes lead to exciting discoveries, like identifying DNA from unexpected species in a sample, revealing insights about organisms that live in the environment of the target organism. In our study, we developed a tool called MarkerScan for identifying these additional species found alongside the target species in eukaryotic genome sequencing projects. The method includes a way to sequence the whole genomes of the additional species. Our method involves sorting through the genetic data to identify certain small RNA sequences, which we then use as markers. These markers help to classify and assemble high-quality genomes from these additional species. This not only cleans up the main target species’ genome data but also provides new, valuable genomes for further exploration.",
                "authors": [
                    {
                        "name": "Blaxter M.L."
                    },
                    {
                        "name": "Vancaester E."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Wellcome Open Research",
                "title": "MarkerScan: Separation and assembly of cobionts sequenced alongside target species in biodiversity genomics projects"
            },
            "pmcid": "PMC11016177",
            "pmid": "38617467"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
