{
    "name": "VESPA", 
    "description": "Interactive visual analysis software tool focused on assisting scientists with the annotation of prokaryotic genomes though the integration of proteomics and transcriptomics data with current genome location coordinates.", 
    "homepage": "http://cbb.pnnl.gov/portal/software/vespa.html", 
    "biotoolsID": "VESPA", 
    "biotoolsCURIE": "biotools:VESPA", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0362", 
                    "term": "Genome annotation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2269", 
            "term": "Statistics and probability"
        }, 
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3308", 
            "term": "Transcriptomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/vespa-1-1-1-visual-analytics-platform-exploring-proteogenomics-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://cbb.pnnl.gov/portal/software/vespa.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "22480257", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "VESPA: Software to facilitate genomic annotation of prokaryotic organisms through integration of proteomic and transcriptomic data", 
                "abstract": "Background: The procedural aspects of genome sequencing and assembly have become relatively inexpensive, yet the full, accurate structural annotation of these genomes remains a challenge. Next-generation sequencing transcriptomics (RNA-Seq), global microarrays, and tandem mass spectrometry (MS/MS)-based proteomics have demonstrated immense value to genome curators as individual sources of information, however, integrating these data types to validate and improve structural annotation remains a major challenge. Current visual and statistical analytic tools are focused on a single data type, or existing software tools are retrofitted to analyze new data forms. We present Visual Exploration and Statistics to Promote Annotation (VESPA) is a new interactive visual analysis software tool focused on assisting scientists with the annotation of prokaryotic genomes though the integration of proteomics and transcriptomics data with current genome location coordinates.Results: VESPA is a desktop Java™ application that integrates high-throughput proteomics data (peptide-centric) and transcriptomics (probe or RNA-Seq) data into a genomic context, all of which can be visualized at three levels of genomic resolution. Data is interrogated via searches linked to the genome visualizations to find regions with high likelihood of mis-annotation. Search results are linked to exports for further validation outside of VESPA or potential coding-regions can be analyzed concurrently with the software through interaction with BLAST. VESPA is demonstrated on two use cases (Yersinia pestis Pestoides F and Synechococcus sp. PCC 7002) to demonstrate the rapid manner in which mis-annotations can be found and explored in VESPA using either proteomics data alone, or in combination with transcriptomic data.Conclusions: VESPA is an interactive visual analytics tool that integrates high-throughput data into a genomic context to facilitate the discovery of structural mis-annotations in prokaryotic genomes. Data is evaluated via visual analysis across multiple levels of genomic resolution, linked searches and interaction with existing bioinformatics tools. We highlight the novel functionality of VESPA and core programming requirements for visualization of these large heterogeneous datasets for a client-side application. The software is freely available at https://www.biopilot.org/docs/Software/Vespa.php. © 2012 Peterson et al; licensee BioMed Central Ltd.", 
                "date": "2012-04-05T00:00:00Z", 
                "citationCount": 26, 
                "authors": [
                    {
                        "name": "Peterson E.S."
                    }, 
                    {
                        "name": "McCue L.A."
                    }, 
                    {
                        "name": "Schrimpe-Rutledge A.C."
                    }, 
                    {
                        "name": "Jensen J.L."
                    }, 
                    {
                        "name": "Walker H."
                    }, 
                    {
                        "name": "Kobold M.A."
                    }, 
                    {
                        "name": "Webb S.R."
                    }, 
                    {
                        "name": "Payne S.H."
                    }, 
                    {
                        "name": "Ansong C."
                    }, 
                    {
                        "name": "Adkins J.N."
                    }, 
                    {
                        "name": "Cannon W.R."
                    }, 
                    {
                        "name": "Webb-Robertson B.-J.M."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Elena Peterson", 
            "email": "elena.peterson@pnnl.gov", 
            "url": "http://cbb.pnnl.gov/portal/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:03:52Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}