{"credit":[{"email":"submissions@gwascentral.org","name":"For study authors to request data updates or submit new data","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"help@gwascentral.org","name":"For general help inquiries and site feedback","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://help.gwascentral.org/about/"}],"function":[{"operation":[{"term":"SNP detection","uri":"http://edamontology.org/operation_0484"},{"term":"Haplotype mapping","uri":"http://edamontology.org/operation_0487"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["Perl","Visual Basic"],"toolType":["Database portal"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Human biology","uri":"http://edamontology.org/topic_2815"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"publication":[{"abstract":"HGVbase (Human Genome Variation database; http://hgvbase.cgb.ki.se, formerly known as HGBASE) is an academic effort to provide a high quality and non-redundant database of available genomic variation data of all types, mostly comprising single nucleotide polymorphisms (SNPs). Records include neutral polymorphisms as well as disease-related mutations. Online search tools facilitate data interrogation by sequence similarity and keyword queries, and searching by genome coordinates is now being implemented. Downloads are freely available in XML, Fasta, SRS, SQL and tagged-text file formats. Each entry is presented in the context of its surrounding sequence and many records are related to neighboring human genes and affected features therein. Population allele frequencies are included wherever available. Thorough semi-automated data checking ensures internal consistency and addresses common errors in the source information. To keep pace with recent growth in the field, we have developed tools for fully automated annotation. All variants have been uniquely mapped to the draft genome sequence and are referenced to positions in EMBL/GenBank files. Data utility is enhanced by provision of genotyping assays and functional predictions. Recent data structure extensions allow the capture of haplotype and genotype information, and a new initiative (along with BiSC and HUGO-MDI) aims to create a central repository for the broad collection of clinical mutations and associated disease phenotypes of interest.","authors":["Fredman D.","Siegfried M.","Yuan Y.P.","Bork P.","Lehvaslaiho H.","Brookes A.J."],"cit_count":109,"journal":"Nucleic Acids Research","pmid":"11752345","title":"HGVbase: A human sequence variation database emphasizing data quality and a broad spectrum of data sources","year":"2002-01-01"}],"summary":{"biotoolsCURIE":"biotools:hgvbase","biotoolsID":"hgvbase","description":"Attempt to summarize all known sequence variations in the human genome, to facilitate research into how genotypes affect common diseases, drug responses, and other complex phenotypes.","homepage":"http://www.hgvbaseg2p.org/index","name":"HGVbase"}}