{
    "additionDate": "2019-11-14T19:40:14Z",
    "biotoolsCURIE": "biotools:rnaSPAdes_autogenerated",
    "biotoolsID": "rnaSPAdes_autogenerated",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "andrewprzh@gmail.com",
            "name": "Andrey D Prjibelski",
            "orcidid": "https://orcid.org/0000-0003-2816-4608",
            "typeEntity": "Person"
        }
    ],
    "description": "> NAME (rnaSPAdes) SIMILAR TO (PUB. DIFFERENT) bio.tools/rnaspades (rnaspades) | a de novo transcriptome assembler and its application to RNA-Seq data | rnaSPAdes – Center for Algorithmic Biotechnology | While RNA-Seq is commonly used for model organisms with well-known genomes, multiple projects study species with previously unsequenced genome. Since finishing a genome can be costly and challenging (especially when the genome is large), RNA-Seq can be used for the purpose of de novo transcriptome a.. | While RNA-Seq is commonly used for model organisms with well-known genomes, multiple projects study species with previously unsequenced genome | 2.1. Downloading SPAdes Linux binaries | 2.2. Downloading SPAdes binaries for Mac",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "http://cab.spbu.ru/software/rnaspades/",
    "lastUpdate": "2019-11-14T19:40:14Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/ablab/spades"
        }
    ],
    "name": "rnaSPAdes_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ100",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: The possibility of generating large RNA-sequencing datasets has led to development of various reference-based and de novo transcriptome assemblers with their own strengths and limitations. While reference-based tools are widely used in various transcriptomic studies, their application is limited to the organisms with finished and well-annotated genomes. De novo transcriptome reconstruction from short reads remains an open challenging problem, which is complicated by the varying expression levels across different genes, alternative splicing, and paralogous genes. Results: Herein we describe the novel transcriptome assembler rnaSPAdes, which has been developed on top of the SPAdes genome assembler and explores computational parallels between assembly of transcriptomes and single-cell genomes. We also present quality assessment reports for rnaSPAdes assemblies, compare it with modern transcriptome assembly tools using several evaluation approaches on various RNA-sequencing datasets, and briefly highlight strong and weak points of different assemblers. Conclusions: Based on the performed comparison between different assembly methods, we infer that it is not possible to detect the absolute leader according to all quality metrics and all used datasets. However, rnaSPAdes typically outperforms other assemblers by such important property as the number of assembled genes and isoforms, and at the same time has higher accuracy statistics on average comparing to the closest competitors.",
                "authors": [
                    {
                        "name": "Bushmanova E."
                    },
                    {
                        "name": "Antipov D."
                    },
                    {
                        "name": "Lapidus A."
                    },
                    {
                        "name": "Prjibelski A.D."
                    }
                ],
                "citationCount": 21,
                "date": "2019-09-18T00:00:00Z",
                "journal": "GigaScience",
                "title": "RnaSPAdes: A de novo transcriptome assembler and its application to RNA-Seq data"
            },
            "pmcid": "PMC6736328",
            "pmid": "31494669"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}