{
    "additionDate": "2021-03-19T08:50:31Z",
    "biotoolsCURIE": "biotools:prosregnet",
    "biotoolsID": "prosregnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "weishao@stanford.edu",
            "name": "Wei Shao",
            "typeEntity": "Person"
        },
        {
            "email": "mirabela.rusu@stanford.edu",
            "name": "Mirabela Rusu",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning framework for registration of MRI and histopathology images of the prostate.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pimed//ProsRegNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-30T12:35:08Z",
    "name": "ProsRegNet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2020.101919",
            "metadata": {
                "abstract": "© 2020 The Author(s)Magnetic resonance imaging (MRI) is an increasingly important tool for the diagnosis and treatment of prostate cancer. However, interpretation of MRI suffers from high inter-observer variability across radiologists, thereby contributing to missed clinically significant cancers, overdiagnosed low-risk cancers, and frequent false positives. Interpretation of MRI could be greatly improved by providing radiologists with an answer key that clearly shows cancer locations on MRI. Registration of histopathology images from patients who had radical prostatectomy to pre-operative MRI allows such mapping of ground truth cancer labels onto MRI. However, traditional MRI-histopathology registration approaches are computationally expensive and require careful choices of the cost function and registration hyperparameters. This paper presents ProsRegNet, a deep learning-based pipeline to accelerate and simplify MRI-histopathology image registration in prostate cancer. Our pipeline consists of image preprocessing, estimation of affine and deformable transformations by deep neural networks, and mapping cancer labels from histopathology images onto MRI using estimated transformations. We trained our neural network using MR and histopathology images of 99 patients from our internal cohort (Cohort 1) and evaluated its performance using 53 patients from three different cohorts (an additional 12 from Cohort 1 and 41 from two public cohorts). Results show that our deep learning pipeline has achieved more accurate registration results and is at least 20 times faster than a state-of-the-art registration algorithm. This important advance will provide radiologists with highly accurate prostate MRI answer keys, thereby facilitating improvements in the detection of prostate cancer on MRI. Our code is freely available at https://github.com/pimed//ProsRegNet.",
                "authors": [
                    {
                        "name": "Shao W."
                    },
                    {
                        "name": "Banh L."
                    },
                    {
                        "name": "Kunder C.A."
                    },
                    {
                        "name": "Fan R.E."
                    },
                    {
                        "name": "Soerensen S.J.C."
                    },
                    {
                        "name": "Wang J.B."
                    },
                    {
                        "name": "Teslovich N.C."
                    },
                    {
                        "name": "Madhuripan N."
                    },
                    {
                        "name": "Jawahar A."
                    },
                    {
                        "name": "Ghanouni P."
                    },
                    {
                        "name": "Brooks J.D."
                    },
                    {
                        "name": "Sonn G.A."
                    },
                    {
                        "name": "Rusu M."
                    }
                ],
                "citationCount": 5,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "ProsRegNet: A deep learning framework for registration of MRI and histopathology images of the prostate"
            },
            "pmcid": "PMC7856244",
            "pmid": "33385701"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}