
{
    "credit": [
        {
            "email": "mahmoud.ibrahim@mdc-berlin.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/mahmoudibrahim/jamm"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/mahmoudibrahim/JAMM/blob/master/readme"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Shell",
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/jamm-1-0-5-peak-finder-for-ngs-datasets.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 The Author. Motivation: Although peak finding in next-generation sequencing (NGS) datasets has been addressed extensively, there is no consensus on how to analyze and process biological replicates. Furthermore, most peak finders do not focus on accurate determination of enrichment site widths and are not widely applicable to different types of datasets. Results: We developed JAMM (Joint Analysis of NGS replicates via Mixture Model clustering): a peak finder that can integrate information from biological replicates, determine enrichment site widths accurately and resolve neighboring narrow peaks. JAMM is a universal peak finder that is applicable to different types of datasets. We show that JAMM is among the best performing peak finders in terms of site detection accuracy and in terms of accurate determination of enrichment sites widths. In addition, JAMM's replicate integration improves peak spatial resolution, sorting and peak finding accuracy. Availability and implementation: JAMM is available for free and can run on Linux machines through the command line: http://code.google.com/p/jamm-peak-finder Contact: or uwe.ohler@mdc-berlin.de. Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Ibrahim M.M.",
                "Lacadie S.A.",
                "Ohler U."
            ],
            "cit_count": 22,
            "journal": "Bioinformatics",
            "pmid": "25223640",
            "title": "JAMM: A peak finder for joint analysis of NGS replicates",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jamm",
        "biotoolsID": "jamm",
        "description": "Peak finder for NGS datasets that can integrate replicates and assign peak boundaries accurately.",
        "homepage": "https://github.com/mahmoudibrahim/jamm",
        "name": "JAMM"
    }
}