{
    "additionDate": "2017-01-13T13:16:51Z",
    "biotoolsCURIE": "biotools:tapyr",
    "biotoolsID": "tapyr",
    "credit": [
        {
            "email": "tapyr@kdbio.inesc-id.pt",
            "name": "TAPyR Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Efficient BWT-based read aligner supporting multiple sequencing platforms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.tapyr.net"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://www.tapyr.net",
    "homepage_status": 1,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "TAPyR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Over the past few years, new massively parallel DNA sequencing technologies have emerged. These platforms generate massive amounts of data per run, greatly reducing the cost of DNA sequencing. However, these techniques also raise important computational difficulties mostly due to the huge volume of data produced, but also because of some of their specific characteristics such as read length and sequencing errors. Among the most critical problems is that of efficiently and accurately mapping reads to a reference genome in the context of re-sequencing projects.Results: We present an efficient method for the local alignment of pyrosequencing reads produced by the GS FLX (454) system against a reference sequence. Our approach explores the characteristics of the data in these re-sequencing applications and uses state of the art indexing techniques combined with a flexible seed-based approach, leading to a fast and accurate algorithm which needs very little user parameterization. An evaluation performed using real and simulated data shows that our proposed method outperforms a number of mainstream tools on the quantity and quality of successful alignments, as well as on the execution time.Conclusions: The proposed methodology was implemented in a software tool called TAPyR--Tool for the Alignment of Pyrosequencing Reads--which is publicly available from http://www.tapyr.net. © 2011 Fernandes et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Fernandes F."
                    },
                    {
                        "name": "Freitas A.T."
                    },
                    {
                        "name": "Oliveira A.L."
                    },
                    {
                        "name": "Russo L.M.S."
                    },
                    {
                        "name": "da Fonseca P.G.S."
                    }
                ],
                "citationCount": 9,
                "date": "2011-05-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Efficient alignment of pyrosequencing reads for re-sequencing applications"
            },
            "pmid": "21672185"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
