{
    "additionDate": "2019-11-14T18:32:00Z",
    "biotoolsCURIE": "biotools:BayesianPredictiveFutility",
    "biotoolsID": "BayesianPredictiveFutility",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Dung-Tsa.Chen@moffitt.org",
            "name": "Dung-Tsa Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Application of Bayesian predictive probability for interim futility analysis in single-arm phase II trial | The tool provides futility interim analysis plan using the Bayesian predictive design in single arm early phase II clinical trial. It also generates statistical plan so clinicians could easily incorporate it into the clinical trial protocol. (reference: Application of Bayesian predictive probability for interim analysis in single-arm early phase II trial. Chen et al; submitted) | devtools::install_github(\"dungtsa/BayesianPredictiveFutility\",force = TRUE) | The shiny applictaion provides futility interim analysis plan for the Bayesian predictive design design in single arm early phase II clinical trial and generates a statistical plan to be easily incorporated into the clinical trial protocol | Simply run the following from an R console:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dungtsa/BayesianPredictiveFutility",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-03T10:40:04Z",
    "name": "BayesianPredictiveFutility",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.21037/TCR.2019.05.17",
            "metadata": {
                "abstract": "© Translational Cancer Research. All rights reserved.Background: Bayesian predictive probability design, with a binary endpoint, is gaining attention for the phase II trial due to its innovative strategy. To make the Bayesian design more accessible, we elucidate this Bayesian approach with a R package to streamline a statistical plan, so biostatisticians and clinicians can easily integrate the design into clinical trial. Methods: We utilize a Bayesian framework using Bayesian posterior probability and predictive probability to build a R package and develop a statistical plan for the trial design. With pre-defined sample sizes, the approach employs the posterior probability with a threshold to calculate the minimum number of responders needed at end of the study to claim efficacy. Then the predictive probability is applied to evaluate future success at interim stages and form stopping rule at each stage. Results: An R package, 'BayesianPredictiveFutility', with associated graphical interface is developed for easy utilization of the trial design. The statistical tool generates a professional statistical plan with comprehensive results including a summary, details of study design, a series of tables and figures from stopping boundary for futility, Bayesian predictive probability, performance [probability of early termination (PET), type I error, and power], PET at each interim analysis, sensitivity analysis for predictive probability, posterior probability, sample size, and beta prior distribution. The statistical plan presents the methodology in a readable language fashion while preserving rigorous statistical arguments. The output formats (Word or PDF) are available to communicate with physicians or to be incorporated in the trial protocol. Two clinical trials in lung cancer are used to demonstrate its usefulness. Conclusions: Bayesian predictive probability method presents a flexible design in clinical trial. The statistical tool brings an added value to broaden the application.",
                "authors": [
                    {
                        "name": "Chen D.-T."
                    },
                    {
                        "name": "Fulp W.J."
                    },
                    {
                        "name": "Gray J.E."
                    },
                    {
                        "name": "Haura E.B."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Pettersson F."
                    },
                    {
                        "name": "Schell M.J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Translational Cancer Research",
                "title": "Application of Bayesian predictive probability for interim futility analysis in single-arm phase II trial"
            },
            "pmcid": "PMC6711387",
            "pmid": "31456910"
        }
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
