{
    "additionDate": "2020-01-14T09:31:01Z",
    "biotoolsCURIE": "biotools:FUMOSO",
    "biotoolsID": "FUMOSO",
    "confidence_flag": "tool",
    "description": "Fuzzy modeling and global optimization to predict novel therapeutic targets in cancer cells.\n\nMOTIVATION:The elucidation of dysfunctional cellular processes that can induce the onset of a disease is a challenging issue from both experimental and computational perspectives. Here we introduce a novel computational method based on the coupling between fuzzy logic modeling and a global optimization algorithm, whose aims are to (1) predict the emergent dynamical behaviors of highly heterogeneous systems in unperturbed and perturbed conditions, regardless the availability of quantitative parameters, (2) determine a minimal set of system components whose perturbation can lead to a desired system response, therefore facilitating the design of a more appropriate experimental strategy. RESULTS:We applied this method to investigate what drives K-ras induced cancer cells, displaying the typical Warburg effect, to death or survival upon progressive glucose depletion",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aresio/FUMOSO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T12:15:53Z",
    "license": "GPL-2.0",
    "name": "FUMOSO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ868",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: The elucidation of dysfunctional cellular processes that can induce the onset of a disease is a challenging issue from both the experimental and computational perspectives. Here we introduce a novel computational method based on the coupling between fuzzy logic modeling and a global optimization algorithm, whose aims are to (1) predict the emergent dynamical behaviors of highly heterogeneous systems in unperturbed and perturbed conditions, regardless of the availability of quantitative parameters, and (2) determine a minimal set of system components whose perturbation can lead to a desired system response, therefore facilitating the design of a more appropriate experimental strategy. Results: We applied this method to investigate what drives K-ras-induced cancer cells, displaying the typical Warburg effect, to death or survival upon progressive glucose depletion. The optimization analysis allowed to identify new combinations of stimuli that maximize pro-apoptotic processes. Namely, our results provide different evidences of an important protective role for protein kinase A in cancer cells under several cellular stress conditions mimicking tumor behavior. The predictive power of this method could facilitate the assessment of the response of other complex heterogeneous systems to drugs or mutations in fields as medicine and pharmacology, therefore paving the way for the development of novel therapeutic treatments.",
                "authors": [
                    {
                        "name": "Nobile M.S."
                    },
                    {
                        "name": "Votta G."
                    },
                    {
                        "name": "Palorini R."
                    },
                    {
                        "name": "Spolaor S."
                    },
                    {
                        "name": "De Vitto H."
                    },
                    {
                        "name": "Cazzaniga P."
                    },
                    {
                        "name": "Ricciardiello F."
                    },
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Alberghina L."
                    },
                    {
                        "name": "Chiaradonna F."
                    },
                    {
                        "name": "Besozzi D."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fuzzy modeling and global optimization to predict novel therapeutic targets in cancer cells"
            },
            "pmid": "31750879"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}