{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://zhanglab.ccmb.med.umich.edu/"}],"function":[{"operation":[{"term":"Molecular model refinement","uri":"http://edamontology.org/operation_0322"}]}],"labels":{"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/modrefiner-20111024-high-resolution-protein-structure-refinement.html"}],"publication":[{"abstract":"Most protein structural prediction algorithms assemble structures as reduced models that represent amino acids by a reduced number of atoms to speed up the conformational search. Building accurate full-atom models from these reduced models is a necessary step toward a detailed function analysis. However, it is difficult to ensure that the atomic models retain the desired global topology while maintaining a sound local atomic geometry because the reduced models often have unphysical local distortions. To address this issue, we developed a new program, called ModRefiner, to construct and refine protein structures from Cα traces based on a two-step, atomic-level energy minimization. The main-chain structures are first constructed from initial Cα traces and the side-chain rotamers are then refined together with the backbone atoms with the use of a composite physics- and knowledge-based force field. We tested the method by performing an atomic structure refinement of 261 proteins with the initial models constructed from both ab initio and template-based structure assemblies. Compared with other state-of-art programs, ModRefiner shows improvements in both global and local structures, which have more accurate side-chain positions, better hydrogen-bonding networks, and fewer atomic overlaps. ModRefiner is freely available at http://zhanglab.ccmb.med. umich.edu/ModRefiner. © 2011 Biophysical Society.","authors":["Xu D.","Zhang Y."],"cit_count":283,"doi":"10.1016/j.bpj.2011.10.024","journal":"Biophysical Journal","title":"Improving the physical realism and structural accuracy of protein models by a two-step atomic-level energy minimization","type":"Primary","year":"2011-11-16"}],"summary":{"biotoolsCURIE":"biotools:modrefiner","biotoolsID":"modrefiner","description":"An algorithm for atomic-level, high-resolution protein structure refinement, which can start from either C-alpha trace, main-chain model or full-atomic model. Both side-chain and backbone atoms are completely flexible during structure refinement simulations, where conformational search is guided by a composite of physics- and knowledge-based force field.","homepage":"http://zhanglab.ccmb.med.umich.edu/ModRefiner/","name":"ModRefiner","version":["20111024"]}}