{
    "additionDate": "2021-01-18T09:32:36Z",
    "biotoolsCURIE": "biotools:rwrmtn",
    "biotoolsID": "rwrmtn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hauldhut@gmail.com",
            "name": "Duc-Hau Le",
            "orcidid": "https://orcid.org/0000-0002-4951-5916",
            "typeEntity": "Person"
        }
    ],
    "description": "a tool for predicting disease-associated microRNAs based on a microRNA-target gene network.\n\nThe misregulation of microRNA (miRNA) has been shown to cause diseases. Recently, we have proposed a computational method based on a random walk framework on a miRNA-target gene network to predict disease-associated miRNAs. The prediction performance of our method is better than that of some existing state-of-the-art network- and machine learning-based methods since it exploits the mutual regulation between miRNAs and their target genes in the miRNA-target gene interaction networks.\n\nTo facilitate the use of this method, we have developed a Cytoscape app, named RWRMTN, to predict disease-associated miRNAs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://apps.cytoscape.org/apps/rwrmtn",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-10T13:12:51Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hauldhut/RWRMTN"
        }
    ],
    "name": "RWRMTN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03578-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The misregulation of microRNA (miRNA) has been shown to cause diseases. Recently, we have proposed a computational method based on a random walk framework on a miRNA-target gene network to predict disease-associated miRNAs. The prediction performance of our method is better than that of some existing state-of-the-art network- and machine learning-based methods since it exploits the mutual regulation between miRNAs and their target genes in the miRNA-target gene interaction networks. Results: To facilitate the use of this method, we have developed a Cytoscape app, named RWRMTN, to predict disease-associated miRNAs. RWRMTN can work on any miRNA-target gene network. Highly ranked miRNAs are supported with evidence from the literature. They then can also be visualized based on the rankings and in relationships with the query disease and their target genes. In addition, automation functions are also integrated, which allow RWRMTN to be used in workflows from external environments. We demonstrate the ability of RWRMTN in predicting breast and lung cancer-associated miRNAs via workflows in Cytoscape and other environments. Conclusions: Considering a few computational methods have been developed as software tools for convenient uses, RWRMTN is among the first GUI-based tools for the prediction of disease-associated miRNAs which can be used in workflows in different environments.",
                "authors": [
                    {
                        "name": "Le D.-H."
                    },
                    {
                        "name": "Tran T.T.H."
                    }
                ],
                "date": "2020-06-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RWRMTN: A tool for predicting disease-associated microRNAs based on a microRNA-target gene network"
            },
            "pmcid": "PMC7296691",
            "pmid": "32539680"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}