{
    "accessibility": "Open access",
    "additionDate": "2022-04-10T11:17:26.966540Z",
    "biotoolsCURIE": "biotools:npars",
    "biotoolsID": "npars",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "djjohann@uams.edu",
            "name": "Donald J. Johann",
            "typeEntity": "Person"
        },
        {
            "name": "Jason Muesse"
        },
        {
            "name": "Katy Marino"
        },
        {
            "name": "Matthew A Steliga"
        }
    ],
    "description": "Novel Approach to Address Accuracy and Reproducibility in Genomic Data Science.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/erichpeterson/npars-analysis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-10T11:17:26.969068Z",
    "license": "Not licensed",
    "name": "NPARS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FDATA.2021.725095",
            "metadata": {
                "abstract": "© Copyright © 2021 Ma, Peterson, Shin, Muesse, Marino, Steliga and Johann.Background: Accuracy and reproducibility are vital in science and presents a significant challenge in the emerging discipline of data science, especially when the data are scientifically complex and massive in size. Further complicating matters, in the field of genomic-based science high-throughput sequencing technologies generate considerable amounts of data that needs to be stored, manipulated, and analyzed using a plethora of software tools. Researchers are rarely able to reproduce published genomic studies. Results: Presented is a novel approach which facilitates accuracy and reproducibility for large genomic research data sets. All data needed is loaded into a portable local database, which serves as an interface for well-known software frameworks. These include python-based Jupyter Notebooks and the use of RStudio projects and R markdown. All software is encapsulated using Docker containers and managed by Git, simplifying software configuration management. Conclusion: Accuracy and reproducibility in science is of a paramount importance. For the biomedical sciences, advances in high throughput technologies, molecular biology and quantitative methods are providing unprecedented insights into disease mechanisms. With these insights come the associated challenge of scientific data that is complex and massive in size. This makes collaboration, verification, validation, and reproducibility of findings difficult. To address these challenges the NGS post-pipeline accuracy and reproducibility system (NPARS) was developed. NPARS is a robust software infrastructure and methodology that can encapsulate data, code, and reporting for large genomic studies. This paper demonstrates the successful use of NPARS on large and complex genomic data sets across different computational platforms.",
                "authors": [
                    {
                        "name": "Johann D.J."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Marino K."
                    },
                    {
                        "name": "Muesse J."
                    },
                    {
                        "name": "Peterson E.A."
                    },
                    {
                        "name": "Shin I.J."
                    },
                    {
                        "name": "Steliga M.A."
                    }
                ],
                "date": "2021-09-27T00:00:00Z",
                "journal": "Frontiers in Big Data",
                "title": "NPARS—A Novel Approach to Address Accuracy and Reproducibility in Genomic Data Science"
            },
            "pmcid": "PMC8503682",
            "pmid": "34647017"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
