{
    "accessibility": "Open access",
    "additionDate": "2022-09-26T06:13:49.529781Z",
    "biotoolsCURIE": "biotools:eldbeta",
    "biotoolsID": "eldbeta",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenxg@bme.cams.cn",
            "name": "Xiaogang Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "A large eldercare-oriented BEnchmark database of SSVEP-BCI for The Aging population (eldBETA)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://doi.org/10.6084/m9.figshare.18032669",
    "lastUpdate": "2022-09-26T06:13:49.532255Z",
    "license": "CC-BY-4.0",
    "name": "eldBETA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/S41597-022-01372-9",
            "metadata": {
                "abstract": "© 2022, The Author(s).Global population aging poses an unprecedented challenge and calls for a rising effort in eldercare and healthcare. Steady-state visual evoked potential based brain-computer interface (SSVEP-BCI) boasts its high transfer rate and shows great promise in real-world applications to support aging. Public database is critically important for designing the SSVEP-BCI systems. However, the SSVEP-BCI database tailored for the elder is scarce in existing studies. Therefore, in this study, we present a large eldercare-oriented BEnchmark database of SSVEP-BCI for The Aging population (eldBETA). The eldBETA database consisted of the 64-channel electroencephalogram (EEG) from 100 elder participants, each of whom performed seven blocks of 9-target SSVEP-BCI task. The quality and characteristics of the eldBETA database were validated by a series of analyses followed by a classification analysis of thirteen frequency recognition methods. We expect that the eldBETA database would provide a substrate for the design and optimization of the BCI systems intended for the elders. The eldBETA database is open-access for research and can be downloaded from the website https://doi.org/10.6084/m9.figshare.18032669.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "eldBETA: A Large Eldercare-oriented Benchmark Database of SSVEP-BCI for the Aging Population"
            },
            "pmcid": "PMC9156785",
            "pmid": "35641547"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
