{
    "additionDate": "2016-11-28T10:07:16Z",
    "biotoolsCURIE": "biotools:protoss",
    "biotoolsID": "protoss",
    "collectionID": [
        "COVID-19",
        "de.NBI"
    ],
    "credit": [
        {
            "email": "rarey-office@zbh.uni-hambugr.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "University of Hamburg - Center for Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Fully automated hydrogen prediction tool for protein-ligand complexes. It adds missing hydrogen atoms to protein structures and detects reasonable protonation states, tautomers, and hydrogen coordinates of both protein and ligand molecules. It investigates hydrogen bonds, metal interactions and repulsive atom contacts for all possible states and calculates an optimal hydrogen bonding network within these degrees of freedom.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proteinsplus.zbh.uni-hamburg.de/help/index"
        }
    ],
    "editPermission": {
        "authors": [
            "Bietz"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein-ligand complex",
                        "uri": "http://edamontology.org/data_1461"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein-ligand complex",
                        "uri": "http://edamontology.org/data_1461"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://proteinsplus.zbh.uni-hamburg.de/#protoss",
    "lastUpdate": "2024-11-25T13:58:11.718436Z",
    "name": "Protoss",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "stierand",
    "publication": [
        {
            "doi": "10.1186/1758-2946-1-13",
            "metadata": {
                "abstract": "Background. Hydrogen bonds play a major role in the stabilization of protein-ligand complexes. The ability of a functional group to form them depends on the position of its hydrogen atoms. An accurate knowledge of the positions of hydrogen atoms in proteins is therefore important to correctly identify hydrogen bonds and their properties. The high mobility of hydrogen atoms introduces several degrees of freedom: Tautomeric states, where a hydrogen atom alters its binding partner, torsional changes where the position of the hydrogen atom is rotated around the last heavy-atom bond in a residue, and protonation states, where the number of hydrogen atoms at a functional group may change. Also, side-chain flips in glutamine and asparagine and histidine residues, which are common crystallographic ambiguities must be identified before structure-based calculations can be conducted. Results. We have implemented a method to determine the most probable hydrogen atom positions in a given protein-ligand complex. Optimality of hydrogen bond geometries is determined by an empirical scoring function which is used in molecular docking. This allows to evaluate protein-ligand interactions with an established model. Also, our method allows to resolve common crystallographic ambiguities such as as flipped amide groups and histidine residues. To ensure high speed, we make use of a dynamic programming approach. Conclusion. Our results were checked against selected high-resolution structures from an external dataset, for which the positions of the hydrogen atoms have been validated manually. The quality of our results is comparable to that of other programs, with the advantage of being fast enough to be applied on-the-fly for interactive usage or during score evaluation. © 2009 Lippert and Rarey; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lippert T."
                    },
                    {
                        "name": "Rarey M."
                    }
                ],
                "citationCount": 58,
                "date": "2009-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Fast automated placement of polar hydrogen atoms in protein-ligand complexes"
            },
            "pmcid": "PMC3225823",
            "pmid": "20298519",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1186/1758-2946-6-12",
            "metadata": {
                "abstract": "The calculation of hydrogen positions is a common preprocessing step when working with crystal structures of protein-ligand complexes. An explicit description of hydrogen atoms is generally needed in order to analyze the binding mode of particular ligands or to calculate the associated binding energies. Due to the large number of degrees of freedom resulting from different chemical moieties and the high degree of mutual dependence this problem is anything but trivial. In addition to an efficient algorithm to take care of the complexity resulting from complicated hydrogen bonding networks, a robust chemical model is needed to describe effects such as tautomerism and ionization consistently. We present a novel method for the placement of hydrogen coordinates in protein-ligand complexes which takes tautomers and protonation states of both protein and ligand into account. Our method generates the most probable hydrogen positions on the basis of an optimal hydrogen bonding network using an empirical scoring function. The high quality of our results could be verified by comparison to the manually adjusted Astex diverse set and a remarkably low rate of undesirable hydrogen contacts compared to other tools. © 2014 Bietz et al.; licensee Chemistry Central Ltd.",
                "authors": [
                    {
                        "name": "Bietz S."
                    },
                    {
                        "name": "Rarey M."
                    },
                    {
                        "name": "Schulz B."
                    },
                    {
                        "name": "Urbaczek S."
                    }
                ],
                "citationCount": 153,
                "date": "2014-04-03T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Protoss: A holistic approach to predict tautomers and protonation states in protein-ligand complexes"
            },
            "pmcid": "PMC4019353",
            "pmid": "24694216",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
