{
    "name": "MAPPER Database", 
    "description": "Contains putative Transcription Factor Binding Sites (TFBSs) located in the upstream sequences of genes from the human, mouse and D.melanogaster genomes.", 
    "homepage": "http://genome.ufl.edu/mapperdb", 
    "biotoolsID": "mapperdb", 
    "biotoolsCURIE": "biotools:mapperdb", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3222", 
                    "term": "Peak calling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0445", 
                    "term": "Transcription factor binding site prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2575", 
                    "term": "Protein binding site prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0438", 
                    "term": "Transcriptional regulatory element prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0749", 
            "term": "Transcription factors and regulatory sites"
        }, 
        {
            "uri": "http://edamontology.org/topic_2815", 
            "term": "Humans"
        }, 
        {
            "uri": "http://edamontology.org/topic_3512", 
            "term": "Gene transcripts"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "22121218", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The MAPPER 2 Database: A multi-genome catalog of putative transcription factor binding sites", 
                "abstract": "The MAPPER 2 Database (http://genome.ufl.edu/mapperdb) is a component of MAPPER 2, a web-based system for the analysis of transcription factor binding sites in multiple genomes. The database contains predicted binding sites identified in the promoters of all human, mouse and Drosophila genes using 1017 probabilistic models representing over 600 different transcription factors. In this article we outline the current contents of the database and we describe its web-based user interface in detail. We then discuss ongoing work to extend the database contents to experimental data and to add analysis capabilities. Finally, we provide information about recent improvements to the hardware and software platform that MAPPER 2 is based on. © The Author(s) 2011. Published by Oxford University Press.", 
                "date": "2012-01-01T00:00:00Z", 
                "citationCount": 14, 
                "authors": [
                    {
                        "name": "Riva A."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15608292", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The MAPPER database: A multi-genome catalog of putative transcription factor binding sites", 
                "abstract": "We describe a comprehensive map of putative transcription factor binding sites (TFBSs) across multiple genomes created using a search method that relies on hidden Markov models built from experimentally determined TFBSs. Using the information in the TRANSFAC and JASPAR databases, we built 1134 models for TFBSs and used them to scan regions 10 kb upstream of the start of the transcript for all known genes in the human, mouse and Drosophila melanogaster genomes. The results, together with homology information on clusters of ortholog genes across the three genomes, were used to create a multi-organism catalog of annotated TFBSs. The catalog can be queried through a web interface accessible at http://bio.chip.org/mapper that allows the identification, visualization and selection of TFBSs occurring in the promoter of a gene of interest and also the common factors predicted to bind across the cluster of orthologs that includes that gene. Alternatively, the interface allows the user to retrieve binding sites for a single transcription factor of interest in a single gene or in all genes of the human, mouse or fruit fly genomes. © Oxford University Press 2005; all rights reserved.", 
                "date": "2005-01-01T00:00:00Z", 
                "citationCount": 103, 
                "authors": [
                    {
                        "name": "Marinescu V.D."
                    }, 
                    {
                        "name": "Kohane I.S."
                    }, 
                    {
                        "name": "Riva A."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15799782", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MAPPER: A search engine for the computational identification of putative transcription factor binding sites in multiple genomes", 
                "abstract": "Background: Cis-regulatory modules are combinations of regulatory elements occurring in close proximity to each other that control the spatial and temporal expression of genes. The ability to identify them in a genome-wide manner depends on the availability of accurate models and of search methods able to detect putative regulatory elements with enhanced sensitivity and specificity. Results: We describe the implementation of a search method for putative transcription factor binding sites (TFBSs) based on hidden Markov models built from alignments of known sites. We built 1,079 models of TFBSs using experimentally determined sequence alignments of sites provided by the TRANSFAC and JASPAR databases and used them to scan sequences of the human, mouse, fly, worm and yeast genomes. In several cases tested the method identified correctly experimentally characterized sites, with better specificity and sensitivity than other similar computational methods. Moreover, a large-scale comparison using synthetic data showed that in the majority of cases our method performed significantly better than a nucleotide weight matrixbased method. Conclusion: The search engine, available at http://mapper.chip.org, allows the identification, visualization and selection of putative TFBSs occurring in the promoter or other regions of a gene from the human, mouse, fly, worm and yeast genomes. In addition it allows the user to upload a sequence to query and to build a model by supplying a multiple sequence alignment of binding sites for a transcription factor of interest. Due to its extensive database of models, powerful search engine and flexible interface, MAPPER represents an effective resource for the large-scale computational analysis of transcriptional regulation. © 2005 Marinescu et al; licensee BioMed Central Ltd.", 
                "date": "2005-03-30T00:00:00Z", 
                "citationCount": 175, 
                "authors": [
                    {
                        "name": "Marinescu V.D."
                    }, 
                    {
                        "name": "Kohane I.S."
                    }, 
                    {
                        "name": "Riva A."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:15:11Z", 
    "lastUpdate": "2018-12-10T12:58:40Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}