{
    "additionDate": "2018-06-18T10:17:03Z",
    "biotoolsCURIE": "biotools:mutalisk",
    "biotoolsID": "mutalisk",
    "credit": [
        {
            "email": "dwhong@ncc.re.kr",
            "name": "Dongwan Hong",
            "orcidid": "https://orcid.org/0000-0002-7816-1299",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MUTation AnaLyIS toolKit. Comprehensive analysis of somatic DNA mutations with genome regulation elements and DNA sequence contexts.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://mutalisk.org/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://mutalisk.org",
    "lastUpdate": "2018-12-16T16:11:14Z",
    "name": "mutalisk",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky406",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Somatic genome mutations occur due to combinations of various intrinsic/extrinsic mutational processes and DNA repair mechanisms. Different molecular processes frequently generate different signatures of somatic mutations in their own favored contexts. As a result, the regional somatic mutation rate is dependent on the local DNA sequence, the DNA replication/RNA transcription dynamics and epigenomic chromatin organization landscape in the genome. Here, we propose an online computational framework, termed Mutalisk, which correlates somatic mutations with various genomic, transcriptional and epigenomic features in order to understand mutational processes that contribute to the generation of the mutations. This user-friendly tool explores the presence of localized hypermutations (kataegis), dissects the spectrum of mutations into the maximum likelihood combination of known mutational signatures and associates the mutation density with numerous regulatory elements in the genome. As a result, global patterns of somatic mutations in any query sample can be efficiently screened, thus enabling a deeper understanding of various mutagenic factors. This tool will facilitate more effective downstream analyses of cancer genome sequences to elucidate the diversity of mutational processes underlying the development and clonal evolution of cancer cells. Mutalisk is freely available at http://mutalisk.org.",
                "authors": [
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Lee A.J."
                    },
                    {
                        "name": "Lee J.-K."
                    },
                    {
                        "name": "Park J."
                    },
                    {
                        "name": "Kwon Y."
                    },
                    {
                        "name": "Park S."
                    },
                    {
                        "name": "Chun H."
                    },
                    {
                        "name": "Ju Y.S."
                    },
                    {
                        "name": "Hong D."
                    }
                ],
                "citationCount": 22,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Mutalisk: A web-based somatic MUTation AnaLyIS toolKit for genomic, transcriptional and epigenomic signatures"
            },
            "pmid": "29790943",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        }
    ],
    "validated": 1
}