{
    "accessibility": "Open access",
    "additionDate": "2022-02-12T21:49:51.842073Z",
    "biotoolsCURIE": "biotools:olfactionbase",
    "biotoolsID": "olfactionbase",
    "collectionID": [
        "gpcr"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pritish@iiita.ac.in",
            "name": "Pritish Kumar Varadwaj",
            "typeEntity": "Person"
        },
        {
            "name": "Anju Sharma"
        },
        {
            "name": "Bishal Kumar Saha"
        },
        {
            "name": "Rajnish Kumar"
        }
    ],
    "description": "OlfactionBase is a manually-curated comprehensive database that incorporates multidimensional facets of major components involved in the olfaction process, i.e., odors, chemicals (both odorants and odourless), Olfactory Receptors (ORs), odorant-OR interaction, and other associated proteins (odorant-binding proteins (OBPs), pheromone binding proteins (PBPs), and chemosensory proteins).",
    "editPermission": {
        "authors": [
            "mbermudez1"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "https://bioserver.iiita.ac.in/olfactionbase/",
    "lastUpdate": "2024-02-15T12:49:02.256806Z",
    "name": "OlfactionBase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB763",
            "metadata": {
                "abstract": "Olfaction is a multi-stage process that initiates with the odorants entering the nose and terminates with the brain recognizing the odor associated with the odorant. In a very intricate way, the process incorporates various components functioning together and in synchronization. OlfactionBase is a free, open-access web server that aims to bring together knowledge about many aspects of the olfaction mechanism in one place. OlfactionBase contains detailed information of components like odors, odorants, and odorless compounds with physicochemical and ADMET properties, olfactory receptors (ORs), odorant-and pheromone binding proteins, OR-odorant interactions in Human and Mus musculus. The dynamic, user-friendly interface of the resource facilitates exploration of different entities: finding chemical compounds having desired odor, finding odorants associated with OR, associating chemical features with odor and OR, finding sequence information of ORs and related proteins. Finally, the data in OlfactionBase on odors, odorants, olfactory receptors, human and mouse OR-odorant pairs, and other associated proteins could aid in the inference and improved understanding of odor perception, which might provide new insights into the mechanism underlying olfaction. The OlfactionBase is available at https://bioserver.iiita.ac.in/olfactionbase/.",
                "authors": [
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Saha B.K."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Varadwaj P.K."
                    }
                ],
                "citationCount": 15,
                "date": "2022-01-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OlfactionBase: A repository to explore odors, odorants, olfactory receptors and odorant-receptor interactions"
            },
            "pmid": "34469532"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
