{
    "additionDate": "2021-01-18T11:56:13Z",
    "biotoolsCURIE": "biotools:mescan",
    "biotoolsID": "mescan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chi.wang@uky.edu",
            "name": "Chi Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A powerful statistical framework for Genome-Scale mutual exclusivity analysis of cancer mutations.\n\nMEScan is an accurate and efficient statistical framework for genome-scale mutual exclusivity analysis of cancer mutations.\n\nWe provide an example dataset from TCGA Ovarian Cancer to demonstrate the pipeline for large scale ME patterns survey using MEScan. The pipeline has several steps as shown in the DAG below.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MarkeyBBSRF/MEScan",
    "language": [
        "R",
        "Python",
        "C"
    ],
    "lastUpdate": "2021-02-20T18:06:25Z",
    "name": "MEScan",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA957",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: Cancer somatic driver mutations associated with genes within a pathway often show a mutually exclusive pattern across a cohort of patients. This mutually exclusive mutational signal has been frequently used to distinguish driver from passenger mutations and to investigate relationships among driver mutations. Current methods for de novo discovery of mutually exclusive mutational patterns are limited because the heterogeneity in background mutation rate can confound mutational patterns, and the presence of highly mutated genes can lead to spurious patterns. In addition, most methods only focus on a limited number of pre-selected genes and are unable to perform genome-wide analysis due to computational inefficiency. Results: We introduce a statistical framework, MEScan, for accurate and efficient mutual exclusivity analysis at the genomic scale. Our framework contains a fast and powerful statistical test for mutual exclusivity with adjustment of the background mutation rate and impact of highly mutated genes, and a multi-step procedure for genome-wide screening with the control of false discovery rate. We demonstrate that MEScan more accurately identifies mutually exclusive gene sets than existing methods and is at least two orders of magnitude faster than most methods. By applying MEScan to data from four different cancer types and pan-cancer, we have identified several biologically meaningful mutually exclusive gene sets.",
                "authors": [
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Zhai T."
                    },
                    {
                        "name": "Hinderer E.W."
                    },
                    {
                        "name": "Stromberg A.J."
                    },
                    {
                        "name": "Vanderford N.L."
                    },
                    {
                        "name": "Kolesar J.M."
                    },
                    {
                        "name": "Moseley H.N.B."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEScan: A powerful statistical framework for genome-scale mutual exclusivity analysis of cancer mutations"
            },
            "pmid": "33165532"
        }
    ],
    "toolType": [
        "Library",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}