{"collectionID": [], "accessibility": [], "topic": [{"term": "Phenotyping", "uri": "http://edamontology.org/topic_0625"}, {"term": "Genetics", "uri": "http://edamontology.org/topic_3053"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1471-2229-13-122", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "P-TRAP: A Panicle Trait Phenotyping tool", "abstract": "Background: In crops, inflorescence complexity and the shape and size of the seed are among the most important characters that influence yield. For example, rice panicles vary considerably in the number and order of branches, elongation of the axis, and the shape and size of the seed. Manual low-throughput phenotyping methods are time consuming, and the results are unreliable. However, high-throughput image analysis of the qualitative and quantitative traits of rice panicles is essential for understanding the diversity of the panicle as well as for breeding programs.Results: This paper presents P-TRAP software (Panicle TRAit Phenotyping), a free open source application for high-throughput measurements of panicle architecture and seed-related traits. The software is written in Java and can be used with different platforms (the user-friendly Graphical User Interface (GUI) uses Netbeans Platform 7.3). The application offers three main tools: a tool for the analysis of panicle structure, a spikelet/grain counting tool, and a tool for the analysis of seed shape. The three tools can be used independently or simultaneously for analysis of the same image. Results are then reported in the Extensible Markup Language (XML) and Comma Separated Values (CSV) file formats. Images of rice panicles were used to evaluate the efficiency and robustness of the software. Compared to data obtained by manual processing, P-TRAP produced reliable results in a much shorter time. In addition, manual processing is not repeatable because dry panicles are vulnerable to damage. The software is very useful, practical and collects much more data than human operators.Conclusions: P-TRAP is a new open source software that automatically recognizes the structure of a panicle and the seeds on the panicle in numeric images. The software processes and quantifies several traits related to panicle structure, detects and counts the grains, and measures their shape parameters. In short, P-TRAP offers both efficient results and a user-friendly environment for experiments. The experimental results showed very good accuracy compared to field operator, expert verification and well-known academic methods. © 2013 AL-Tam et al.; licensee BioMed Central Ltd.", "citationCount": 21, "authors": [{"name": "AL-Tam F."}, {"name": "Adam H."}, {"name": "Anjos A.D."}, {"name": "Lorieux M."}, {"name": "Larmande P."}, {"name": "Ghesquiere A."}, {"name": "Jouannic S."}, {"name": "Shahbazkia H.R."}], "date": "2013-08-29T00:00:00Z", "journal": "BMC Plant Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "https://bioinfo.mpl.ird.fr", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:p-trap", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://bioinfo.mpl.ird.fr/index.php?option=com_content&view=article&id=102&Itemid=2", "function": [{"note": null, "input": [], "operation": [{"term": "Processing", "uri": "http://edamontology.org/operation_2409"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:59Z", "otherID": [], "description": "It is a free and new open source software that automatically recognizes, from numeric images, the structure of a panicle and the seeds on the panicle. The software processes and quantifies several traits related to the structures of the panicles, detects and counts the grains, and measures their shape parameters. It offers both efficient results and friendly environment for users to perform their experiments. Manual processing is not repeatable because dry panicles are vulnerable to damage.", "toolType": ["Desktop application"], "editPermission": {"type": "group", "authors": ["vipparlabh"]}, "language": ["Java"], "link": [{"url": "http://www.mybiosoftware.com/p-trap-panicle-trait-phenotyping-tool.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "p-trap", "additionDate": "2017-12-18T00:09:58Z", "name": "P-TRAP", "license": null, "documentation": [{"url": "http://bioinfo.mpl.ird.fr/images/ptrap/P-TRAP_manual.pdf", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}