{
    "additionDate": "2018-09-20T03:21:39Z",
    "biotoolsCURIE": "biotools:bianca",
    "biotoolsID": "bianca",
    "credit": [
        {
            "email": "ludovica.griffanti@ndcn.ox.ac.uk",
            "name": "Ludovica Griffanti",
            "orcidid": "http://orcid.org/0000-0002-0540-9353",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BIANCA (Brain Intensity AbNormality Classification Algorithm) is a fully automated, supervised method for white matter hyperintensities detection, based on the k-nearest neighbour (k-NN) algorithm.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://fsl.fmrib.ox.ac.uk/fsl/fslwiki/BIANCA/Userguide"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://fsl.fmrib.ox.ac.uk/fsl/fslwiki/BIANCA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-01-13T17:03:57Z",
    "license": "Proprietary",
    "name": "BIANCA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2016.07.018",
            "metadata": {
                "abstract": "© 2016 The AuthorsReliable quantification of white matter hyperintensities of presumed vascular origin (WMHs) is increasingly needed, given the presence of these MRI findings in patients with several neurological and vascular disorders, as well as in elderly healthy subjects. We present BIANCA (Brain Intensity AbNormality Classification Algorithm), a fully automated, supervised method for WMH detection, based on the k-nearest neighbour (k-NN) algorithm. Relative to previous k-NN based segmentation methods, BIANCA offers different options for weighting the spatial information, local spatial intensity averaging, and different options for the choice of the number and location of the training points. BIANCA is multimodal and highly flexible so that the user can adapt the tool to their protocol and specific needs. We optimised and validated BIANCA on two datasets with different MRI protocols and patient populations (a “predominantly neurodegenerative” and a “predominantly vascular” cohort). BIANCA was first optimised on a subset of images for each dataset in terms of overlap and volumetric agreement with a manually segmented WMH mask. The correlation between the volumes extracted with BIANCA (using the optimised set of options), the volumes extracted from the manual masks and visual ratings showed that BIANCA is a valid alternative to manual segmentation. The optimised set of options was then applied to the whole cohorts and the resulting WMH volume estimates showed good correlations with visual ratings and with age. Finally, we performed a reproducibility test, to evaluate the robustness of BIANCA, and compared BIANCA performance against existing methods. Our findings suggest that BIANCA, which will be freely available as part of the FSL package, is a reliable method for automated WMH segmentation in large cross-sectional cohort studies.",
                "authors": [
                    {
                        "name": "Griffanti L."
                    },
                    {
                        "name": "Zamboni G."
                    },
                    {
                        "name": "Khan A."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Bonifacio G."
                    },
                    {
                        "name": "Sundaresan V."
                    },
                    {
                        "name": "Schulz U.G."
                    },
                    {
                        "name": "Kuker W."
                    },
                    {
                        "name": "Battaglini M."
                    },
                    {
                        "name": "Rothwell P.M."
                    },
                    {
                        "name": "Jenkinson M."
                    }
                ],
                "citationCount": 93,
                "date": "2016-11-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "BIANCA (Brain Intensity AbNormality Classification Algorithm): A new tool for automated segmentation of white matter hyperintensities"
            },
            "pmcid": "PMC5035138",
            "pmid": "27402600",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1
}