{"credit":[{"email":"vtrevino@itesm.mx","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatica.mty.itesm.mx/"}],"documentation":[{"type":"GENERAL","url":"http://bioinformatica.mty.itesm.mx:8080/Biomatec/Survmicro.jsp"}],"function":[{"operation":[{"term":"miRNA expression analysis","uri":"http://edamontology.org/operation_3792"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Oncology","uri":"http://edamontology.org/topic_2640"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/survmicro-v0-9-assessment-of-prognostic-mirna-signatures.html"}],"publication":[{"abstract":"Summary: MicroRNAs (miRNAs) play a key role in post-transcriptional regulation of mRNA levels. Their function in cancer has been studied by high-throughput methods generating valuable sources of public information. Thus, miRNA signatures predicting cancer clinical outcomes are emerging. An important step to propose miRNA-based biomarkers before clinical validation is their evaluation in independent cohorts. Although it can be carried out using public data, such task is time-consuming and requires a specialized analysis. Therefore, to aid and simplify the evaluation of prognostic miRNA signatures in cancer, we developed SurvMicro, a free and easy-to-use web tool that assesses miRNA signatures from publicly available miRNA profiles using multivariate survival analysis. SurvMicro is composed of a wide and updated database of >40 cohorts in different tissues and a web tool where survival analysis can be done in minutes. We presented evaluations to portray the straightforward functionality of SurvMicro in liver and lung cancer. To our knowledge, SurvMicro is the only bioinformatic tool that aids the evaluation of multivariate prognostic miRNA signatures in cancer. © 2014 The Author 2014.","authors":["Aguirre-Gamboa R.","Trevino V."],"cit_count":26,"journal":"Bioinformatics","pmid":"24519378","title":"SurvMicro: Assessment of miRNA-based prognostic signatures for cancer clinical outcomes by multivariate survival analysis","year":"2014-06-01"}],"summary":{"biotoolsCURIE":"biotools:survmicro","biotoolsID":"survmicro","description":"A free and easy-to-use web tool that assesses miRNA signatures from publicly available miRNA profiles using multivariate survival analysis.","homepage":"http://bioinformatica.mty.itesm.mx:8080/Biomatec/Survmicro.jsp","name":"SurvMicro"}}