{
    "additionDate": "2015-01-22T11:40:47Z",
    "biotoolsCURIE": "biotools:mismax",
    "biotoolsID": "mismax",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "cinzia.pizzi@dei.unipd.it",
            "name": "Cinzia Pizzi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~twins"
        }
    ],
    "description": "A tool for the computation of the similarity matrix among a set of sequences. The tool uses an alignment-free approach to compute sequence similarity measures based on shared maximal words allowing mismatches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Definition of similarity measures between sequences",
            "operation": [
                {
                    "term": "Sequence alignment analysis",
                    "uri": "http://edamontology.org/operation_0258"
                }
            ]
        }
    ],
    "homepage": "http://www.dei.unipd.it/~twins/sw/MisMax.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:34Z",
    "name": "MisMax",
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1109/DCC.2014.57",
            "metadata": {
                "abstract": "A growing number of measures of sequence similarity is being based on some underlying notion of relative compressibility. Within this paradigm, similar sequences are expected to share a large number of common substrings, or subsequences, or more complex patterns or motifs, and so on. The computational complexity of such measures varies, and it increases with the complexion of the patterns taken into account. At the low end of the spectrum, most measures based on the bags of shared substrings are typically afforded in linear time. This performance is no longer achievable as soon as some degree of distortion is accepted. In this paper, measures of sequence similarity are introduced and studied in which patterns in a pair are considered similar if they coincide up to a preset number of mismatches, that is, within a bounded Hamming distance. It is shown here that for some such measures bounds are achievable that are slightly better than O(n2). Preliminary experiments demonstrate the potential applicability to phylogeny and classification of similarity measures that are rougher than previously adopted ones. © 2014 IEEE.",
                "authors": [
                    {
                        "name": "Apostolico A."
                    },
                    {
                        "name": "Guerra C."
                    },
                    {
                        "name": "Pizzi C."
                    }
                ],
                "citationCount": 12,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Data Compression Conference Proceedings",
                "title": "Alignment free sequence similarity with bounded hamming distance"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}