
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.csiro.au/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://bioinformatics.csiro.au/public/files/reference.pdf"
        },
        {
            "type": "User manual",
            "url": "https://bioinformatics.csiro.au/public/files/tileHMM.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "ChIP-on-chip",
                "uri": "http://edamontology.org/topic_3179"
            },
            {
                "term": "ChiP",
                "uri": "http://edamontology.org/topic_3179"
            },
            {
                "term": "ChIP-chip",
                "uri": "http://edamontology.org/topic_3179"
            },
            {
                "term": "ChIP-chip",
                "uri": "http://edamontology.org/topic_3179"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tilehmm-1-0-6-hidden-markov-models-for-chip-on-chip-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Tiling arrays are an important tool for the study of transcriptional activity, protein-DNA interactions and chromatin structure on a genome-wide scale at high resolution. Although hidden Markov models have been used successfully to analyse tiling array data, parameter estimation for these models is typically ad hoc. Especially in the context of ChIP-chip experiments, no standard procedures exist to obtain parameter estimates from the data. Common methods for the calculation of maximum likelihood estimates such as the Baum-Welch algorithm or Viterbi training are rarely applied in the context of tiling array analysis. Results: Here we develop a hidden Markov model for the analysis of chromatin structure ChIP-chip tiling array data, using t emission distributions to increase robustness towards outliers. Maximum likelihood estimates are used for all model parameters. Two different approaches to parameter estimation are investigated and combined into an efficient procedure. Conclusion: We illustrate an efficient parameter estimation procedure that can be used for HMM based methods in general and leads to a clear increase in performance when compared to the use of ad hoc estimates. The resulting hidden Markov model outperforms established methods like TileMap in the context of histone modification studies. © 2008 Humburg et al; licensee BioMed Central Ltd.",
            "authors": [
                "Humburg P.",
                "Bulger D.",
                "Stone G."
            ],
            "cit_count": 22,
            "doi": "10.1186/1471-2105-9-343",
            "journal": "BMC Bioinformatics",
            "title": "Parameter estimation for robust HMM analysis of ChIP-chip data",
            "type": "Primary",
            "year": "2008-08-18"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tilehmm",
        "biotoolsID": "tilehmm",
        "description": "Hidden Markov Models for ChIP-on-Chip Analysis. It provides methods and classes to build HMMs that are suitable for the analysis of ChIP-on-chip data. The provided parameter estimation methods include the Baum-Welch algorithm and Viterbi training as well as a combination of both.",
        "homepage": "http://www.bioinformatics.csiro.au/tilehmm/",
        "name": "TileHMM",
        "version": [
            "1.0-6"
        ]
    }
}