{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T10:39:11Z",
    "biotoolsCURIE": "biotools:Haplin",
    "biotoolsID": "Haplin",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hakon.gjessing@uib.no",
            "name": "Hakon K. Gjessing",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for power and sample size calculations in genetic association analyses of family triads and unrelated controls.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/cran/Haplin"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=Haplin",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Haplin",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2727-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Log-linear and multinomial modeling offer a flexible framework for genetic association analyses of offspring (child), parent-of-origin and maternal effects, based on genotype data from a variety of child-parent configurations. Although the calculation of statistical power or sample size is an important first step in the planning of any scientific study, there is currently a lack of software for genetic power calculations in family-based study designs. Here, we address this shortcoming through new implementations of power calculations in the R package Haplin, which is a flexible and robust software for genetic epidemiological analyses. Power calculations in Haplin can be performed analytically using the asymptotic variance-covariance structure of the parameter estimator, or else by a straightforward simulation approach. Haplin performs power calculations for child, parent-of-origin and maternal effects, as well as for gene-environment interactions. The power can be calculated for both single SNPs and haplotypes, either autosomal or X-linked. Moreover, Haplin enables power calculations for different child-parent configurations, including (but not limited to) case-parent triads, case-mother dyads, and case-parent triads in combination with unrelated control-parent triads. Results: We compared the asymptotic power approximations to the power of analysis attained with Haplin. For external validation, the results were further compared to the power of analysis attained by the EMIM software using data simulations from Haplin. Consistency observed between Haplin and EMIM across various genetic scenarios confirms the computational accuracy of the inference methods used in both programs. The results also demonstrate that power calculations in Haplin are applicable to genetic association studies using either log-linear or multinomial modeling approaches. Conclusions: Haplin provides a robust and reliable framework for power calculations in genetic association analyses for a wide range of genetic effects and etiologic scenarios, based on genotype data from a variety of child-parent configurations.",
                "authors": [
                    {
                        "name": "Gjerdevik M."
                    },
                    {
                        "name": "Jugessur A."
                    },
                    {
                        "name": "Haaland O.A."
                    },
                    {
                        "name": "Romanowska J."
                    },
                    {
                        "name": "Lie R.T."
                    },
                    {
                        "name": "Cordell H.J."
                    },
                    {
                        "name": "Gjessing H.K."
                    }
                ],
                "citationCount": 6,
                "date": "2019-04-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Haplin power analysis: A software module for power and sample size calculations in genetic association analyses of family triads and unrelated controls"
            },
            "pmcid": "PMC6444579",
            "pmid": "30940094",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "version": [
        "7.1.0"
    ]
}