{
    "additionDate": "2020-01-09T18:28:06Z",
    "biotoolsCURIE": "biotools:group18",
    "biotoolsID": "group18",
    "confidence_flag": "low",
    "description": "Massive in Silico Study of Noble Gas Binding to the Structural Proteome.\n\nNoble gases are chemically inert, and it was therefore thought they would have little effect on biology. Paradoxically, it was found that they do exhibit a wide range of biological effects, many of which are target-specific and potentially useful and some of which have been demonstrated in vivo. The underlying mechanisms by which useful pharmacology, such as tissue and neuroprotection, anti-addiction effects, and analgesia, is elicited are relatively unexplored. Experiments to probe the interactions of noble gases with specific proteins are more difficult with gases than those with other chemicals.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/harman (CSIRO.AU), bio.tools/tilehmm (CSIRO.AU), bio.tools/k-link (CSIRO.AU), bio.tools/blue (CSIRO.AU).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'noble gases', 'gases', 'noble', 'gas-protein'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://group18.csiro.au",
    "lastUpdate": "2020-01-09T18:28:06Z",
    "name": "group18",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00640",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Noble gases are chemically inert, and it was therefore thought they would have little effect on biology. Paradoxically, it was found that they do exhibit a wide range of biological effects, many of which are target-specific and potentially useful and some of which have been demonstrated in vivo. The underlying mechanisms by which useful pharmacology, such as tissue and neuroprotection, anti-addiction effects, and analgesia, is elicited are relatively unexplored. Experiments to probe the interactions of noble gases with specific proteins are more difficult with gases than those with other chemicals. It is clearly impractical to conduct the large number of gas-protein experiments required to gain a complete picture of noble gas biology. Given the simplicity of atoms as ligands, in silico methods provide an opportunity to gain insight into which noble gas-protein interactions are worthy of further experimental or advanced computational investigation. Our previous validation studies showed that in silico methods can accurately predict experimentally determined noble gas binding sites in X-ray structures of proteins. Here, we summarize the largest reported in silico reverse docking study involving 127 854 protein structures and the five nonradioactive noble gases. We describe how these computational screening methods are implemented, summarize the main types of interactions that occur between noble gases and target proteins, describe how the massive data set that this study generated can be analyzed (freely available at group18.csiro.au), and provide the NDMA receptor as an example of how these data can be used to understand the molecular pharmacology underlying the biology of the noble gases. We encourage chemical biologists to access the data and use them to expand the knowledge base of noble gas pharmacology, and to use this information, together with more efficient delivery systems, to develop \"atomic drugs\" that can fully exploit their considerable and relatively unexplored potential in medicine.",
                "authors": [
                    {
                        "name": "Winkler D.A."
                    },
                    {
                        "name": "Warden A.C."
                    },
                    {
                        "name": "Prange T."
                    },
                    {
                        "name": "Colloc'H N."
                    },
                    {
                        "name": "Thornton A.W."
                    },
                    {
                        "name": "Ramirez-Gil J.-F."
                    },
                    {
                        "name": "Farjot G."
                    },
                    {
                        "name": "Katz I."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Massive in Silico Study of Noble Gas Binding to the Structural Proteome"
            },
            "pmid": "31613613"
        }
    ],
    "topic": [
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ]
}