{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T10:06:49Z",
    "biotoolsCURIE": "biotools:fetal-dose",
    "biotoolsID": "fetal-dose",
    "confidence_flag": "tool",
    "description": "Fetal dose is a calculator for calculating the radiation dose a fetus is exposed to during Computed tomography (CT) imaging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://www.fetaldose.org",
    "lastUpdate": "2021-03-10T21:45:49Z",
    "name": "Fetal dose",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1097/RLI.0000000000000701",
            "metadata": {
                "abstract": "© Wolters Kluwer Health, Inc. All rights reserved.Objective Estimations of radiation dose absorbed by the fetus from computed tomography (CT) in pregnant patients is mandatory, but currently available methods are not feasible in clinical routine. The aims of this study were to develop and validate a tool for assessment of fetal dose from CT of pregnant patients and to develop a user-friendly web interface for fast fetal dose calculations. Methods In the first study part, 750 Monte Carlo (MC) simulations were performed on phantoms representing pregnant patients at various gestational stages. The MC code simulating vendor-independent dose distributions was validated against CT dose index (CTDI) measurements performed on CT scanners of 2 vendors. The volume CTDI-normalized fetal dose values from MC simulations were used for developing the computational algorithm enabling fetal dose assessments from CT of various body regions at different exposure settings. In the institutional review board-approved second part, the algorithm was validated against patient-specific MC simulations performed on CT data of 29 pregnant patients (gestational ages 8-35 weeks) who underwent CT. Furthermore, the tool was compared with a commercially available software. A user-friendly web-based interface for fetal dose calculations was created. Results Weighted CTDI values obtained from MC simulations were in excellent agreement with measurements performed on the 2 CT systems (average error, 4%). The median fetal dose from abdominal CT in pregnant patients was 2.7 mGy, showing moderate correlation with maternal perimeter (r = 0.69). The algorithm provided accurate estimates of fetal doses (average error, 11%), being more accurate than the commercially available tool. The web-based interface (www.fetaldose.org) enabling vendor-independent calculations of fetal doses from CT requires the input of gestational age, volume CTDI, tube voltage, and scan region. Conclusions A tool for fetal dose assessments from CT of pregnant patients was developed and validated being freely available on a user-friendly web interface.",
                "authors": [
                    {
                        "name": "Alkadhi H."
                    },
                    {
                        "name": "Hinzpeter R."
                    },
                    {
                        "name": "Merce M.S."
                    },
                    {
                        "name": "Platon A."
                    },
                    {
                        "name": "Poletti P.-A."
                    },
                    {
                        "name": "Saltybaeva N."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Investigative Radiology",
                "title": "Radiation Dose to the Fetus from Computed Tomography of Pregnant Patients - Development and Validation of a Web-Based Tool"
            },
            "pmid": "32604386"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
