{
    "additionDate": "2018-05-18T15:25:11Z",
    "biotoolsCURIE": "biotools:ipro54-pseknc",
    "biotoolsID": "ipro54-pseknc",
    "credit": [
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Sequence-based predictor for identifying\nσ54 promoters with pseudo k-tuple nucleotide composition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/server/iPro54-PseKNC",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "iPro54-PseKNC",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gku1019",
            "metadata": {
                "abstract": "© 2014 The Author(s).The σ54 promoters are unique in prokaryotic genome and responsible for transcripting carbon and nitrogen-related genes. With the avalanche of genome sequences generated in the postgenomic age, it is highly desired to develop automated methods for rapidly and effectively identifying the σ54 promoters. Here, a predictor called 'iPro54-PseKNC' was developed. In the predictor, the samples of DNA sequences were formulated by a novel feature vector called 'pseudo k-tuple nucleotide composition', which was further optimized by the incremental feature selection procedure. The performance of iPro54-PseKNC was examined by the rigorous jackknife cross-validation tests on a stringent benchmark data set. As a user-friendly web-server, iPro54-PseKNC is freely accessible at http://lin.uestc.edu.cn/server/iPro54-PseKNC. For the convenience of the vast majority of experimental scientists, a step-by-step protocol guide was provided on how to use the web-server to get the desired results without the need to follow the complicated mathematics that were presented in this paper just for its integrity. Meanwhile, we also discovered through an in-depth statistical analysis that the distribution of distances between the transcription start sites and the translation initiation sites were governed by the gamma distribution, which may provide a fundamental physical principle for studying the σ54 promoters.",
                "authors": [
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Deng E.-Z."
                    },
                    {
                        "name": "Ding H."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 386,
                "date": "2014-12-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IPro54-PseKNC: A sequence-based predictor for identifying sigma-54 promoters in prokaryote with pseudo k-tuple nucleotide composition"
            },
            "pmcid": "PMC4245931",
            "pmid": "25361964"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}