{
    "additionDate": "2020-01-09T18:21:57Z",
    "biotoolsCURIE": "biotools:pascal",
    "biotoolsID": "pascal",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mariacristina.rodriguez.fontenla@usc.es",
            "name": "Cristina Rodriguez-Fontenla",
            "orcidid": "https://orcid.org/0000-0002-9829-6393",
            "typeEntity": "Person"
        },
        {
            "email": "angel.carracedo@usc.es",
            "name": "Angel Carracedo",
            "typeEntity": "Person"
        }
    ],
    "description": "a biological insight into the novel associated genes.\n\nBACKGROUND:Attention-Deficit Hyperactivity Disorder (ADHD) is a complex neurodevelopmental disorder (NDD) which may significantly impact on the affected individual's life. ADHD is acknowledged to have a high heritability component (70-80%). Recently, a meta-analysis of GWAS (Genome Wide Association Studies) has demonstrated the association of several independent loci. Our main aim here, is to apply PASCAL (pathway scoring algorithm), a new gene-based analysis (GBA) method, to the summary statistics obtained in this meta-analysis. PASCAL will take into account the linkage disequilibrium (LD) across genomic regions in a different way than the most commonly employed GBA methods (MAGMA or VEGAS (Versatile Gene-based Association Study)).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://www2.unil.ch/cbg/index.php?title=Pascal",
    "language": [
        "Pascal"
    ],
    "lastUpdate": "2020-12-13T14:59:09Z",
    "name": "PASCAL",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0593-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Attention-Deficit Hyperactivity Disorder (ADHD) is a complex neurodevelopmental disorder (NDD) which may significantly impact on the affected individual's life. ADHD is acknowledged to have a high heritability component (70-80%). Recently, a meta-analysis of GWAS (Genome Wide Association Studies) has demonstrated the association of several independent loci. Our main aim here, is to apply PASCAL (pathway scoring algorithm), a new gene-based analysis (GBA) method, to the summary statistics obtained in this meta-analysis. PASCAL will take into account the linkage disequilibrium (LD) across genomic regions in a different way than the most commonly employed GBA methods (MAGMA or VEGAS (Versatile Gene-based Association Study)). In addition to PASCAL analysis a gene network and an enrichment analysis for KEGG and GO terms were carried out. Moreover, GENE2FUNC tool was employed to create gene expression heatmaps and to carry out a (DEG) (Differentially Expressed Gene) analysis using GTEX v7 and BrainSpan data. Results: PASCAL results have revealed the association of new loci with ADHD and it has also highlighted other genes previously reported by MAGMA analysis. PASCAL was able to discover new associations at a gene level for ADHD: FEZF1 (p-value: 2.2 × 10- 7) and FEZF1-AS1 (p-value: 4.58 × 10- 7). In addition, PASCAL has been able to highlight association of other genes that share the same LD block with some previously reported ADHD susceptibility genes. Gene network analysis has revealed several interactors with the associated ADHD genes and different GO and KEGG terms have been associated. In addition, GENE2FUNC has demonstrated the existence of several up and down regulated expression clusters when the associated genes and their interactors were considered. Conclusions: PASCAL has been revealed as an efficient tool to extract additional information from previous GWAS using their summary statistics. This study has identified novel ADHD associated genes that were not previously reported when other GBA methods were employed. Moreover, a biological insight into the biological function of the ADHD associated genes across brain regions and neurodevelopmental stages is provided.",
                "authors": [
                    {
                        "name": "Alonso-Gonzalez A."
                    },
                    {
                        "name": "Calaza M."
                    },
                    {
                        "name": "Rodriguez-Fontenla C."
                    },
                    {
                        "name": "Carracedo A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-24T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Gene-based analysis of ADHD using PASCAL: A biological insight into the novel associated genes"
            },
            "pmcid": "PMC6813133",
            "pmid": "31651322"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}