{
    "additionDate": "2019-11-14T19:33:28Z",
    "biotoolsCURIE": "biotools:TADA",
    "biotoolsID": "TADA",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "smirarabbaygi@eng.ucsd.edu",
            "name": "Siavash Mirarab",
            "typeEntity": "Person"
        }
    ],
    "description": "phylogenetic augmentation of microbiome samples enhances phenotype classification | TADA is a new data augmentation technique for classifying phenotypes based on the microbiome. Our algorithm, TADA, uses available data and a statistical generative model to create new samples augmenting existing ones, addressing issues of low-sample-size. In generating new samples, TADA takes into account phylogenetic relationships between microbial species. Adding these synthetic samples to the training set improves the accuracy of downstream classification, especially when the training data have an unbalanced representation of classes",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/tada-alg/TADA",
    "language": [
        "R",
        "Shell",
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:33:28Z",
    "name": "TADA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ394",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Learning associations of traits with the microbial composition of a set of samples is a fundamental goal in microbiome studies. Recently, machine learning methods have been explored for this goal, with some promise. However, in comparison to other fields, microbiome data are high-dimensional and not abundant; leading to a high-dimensional low-sample-size under-determined system. Moreover, microbiome data are often unbalanced and biased. Given such training data, machine learning methods often fail to perform a classification task with sufficient accuracy. Lack of signal is especially problematic when classes are represented in an unbalanced way in the training data; with some classes under-represented. The presence of inter-correlations among subsets of observations further compounds these issues. As a result, machine learning methods have had only limited success in predicting many traits from microbiome. Data augmentation consists of building synthetic samples and adding them to the training data and is a technique that has proved helpful for many machine learning tasks. Results: In this paper, we propose a new data augmentation technique for classifying phenotypes based on the microbiome. Our algorithm, called TADA, uses available data and a statistical generative model to create new samples augmenting existing ones, addressing issues of low-sample-size. In generating new samples, TADA takes into account phylogenetic relationships between microbial species. On two real datasets, we show that adding these synthetic samples to the training set improves the accuracy of downstream classification, especially when the training data have an unbalanced representation of classes.",
                "authors": [
                    {
                        "name": "Sayyari E."
                    },
                    {
                        "name": "Kawas B."
                    },
                    {
                        "name": "Mirarab S."
                    }
                ],
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TADA: Phylogenetic augmentation of microbiome samples enhances phenotype classification"
            },
            "pmcid": "PMC6612822",
            "pmid": "31510701"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}