{
    "additionDate": "2021-01-18T11:05:02Z",
    "biotoolsCURIE": "biotools:cpe-sldi",
    "biotoolsID": "cpe-sldi",
    "confidence_flag": "tool",
    "description": "CPE-SLDI is a model for predicting coding potential. It uses oversampling technology and increase the number of positive instances and alleviate the problem of local data imbalance, and propose a coding potential prediction method, CPE-SLDI, which constructs a prediction model by combining various sequence-derived features based on the augmented data.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/chenxgscuec/CPESLDI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T14:27:59Z",
    "name": "CPE-SLDI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.3021800",
            "metadata": {
                "abstract": "IEEENon-coding RNAs (ncRNAs) play an important role in various biological processes and are associated with diseases. Distinguishing between coding RNAs and ncRNAs, also known as predicting coding potential of RNA sequences, is critical for downstream biological function analysis. Many machine learning-based methods have been proposed for predicting coding potential of RNA sequences. Recent studies reveal that most existing methods have poor performance on RNA sequences with short Open Reading Frames (sORF, ORF length&lt;303nt). In this work, we analyze the distribution of ORF length of RNA sequences, and observe that the number of coding RNAs with sORF is inadequate and coding RNAs with sORF are much less than ncRNAs with sORF. Thus, there exists the problem of local data imbalance in RNA sequences with sORF. We propose a coding potential prediction method CPE-SLDI, which uses data oversampling techniques to augment samples for coding RNAs with sORF so as to alleviate local data imbalance. Compared with existing methods, CPE-SLDI produces the better performances, and studies reveal that the data augmentation by various data oversampling techniques can enhance the performance of coding potential prediction, especially for RNA sequences with sORF. The implementation of the proposed method is available at https://github.com/chenxgscuec/CPESLDI.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Predicting Coding Potential of RNA Sequences by Solving Local Data Imbalance"
            },
            "pmid": "32886613"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}