{"credit":[],"function":[{"operation":[{"term":"Protein folding analysis","uri":"http://edamontology.org/operation_2415"},{"term":"Molecular dynamics","uri":"http://edamontology.org/operation_2476"},{"term":"Molecular docking","uri":"http://edamontology.org/operation_0478"}]}],"labels":{"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Molecular dynamics","uri":"http://edamontology.org/topic_0176"},{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"}]},"publication":[{"abstract":"© 2019 Bentham Science Publishers.Background: Cyclin-Dependent Kinases-6 (CDK-6) is a serine/threonine protein kinase with regular activity in the cell cycle. Some inhibitors, such as abemaciclib, hymenialdisine, and in-dirubin, cause cell arrest by decreasing its activity. Objectives: The purpose of this study was to evaluate the Molecular Dynamic (MD) effects of abe-maciclib, hymenialdisine, and indirubin on the structure of CDK-6. Methods: The PDB file of CDK-6 was obtained from the Protein Data Bank (http://www.rcsb.org). After the simulation of CDK-6 in the Gromacs software, 200 stages of molecular docking were run on CDK-6 in the presence of the inhibitors using AutoDock 4.2. The simulation of CDK-6 in the presence of inhibitors was performed after docking. Results: Abemaciclib showed the greatest tendency to bind CDK-6 via binding 16 residues in the binding site with hydrogen bonds and hydrophobic bonding. CDK-6 docked to hymenialdisine and indirubin increased the Total Energy (TE) and decreased the radius of gyration (Rg). CDK-6 docked to hymenialdisine significantly decreased the coil secondary structure. Conclusion: CDK-6 is inhibited via high binding affinity to abemaciclib, hymenialdisine, and indi-rubin inhibitors and induces variation in the secondary structure and Rg in the CDK-6 docked to the three inhibitors. It seems that developing a drug with a binding tendency to CDK6 that is similar to those of abemaciclib, indirubin, and hymenialdisine can change the secondary structure of CDK6, possibly more potently, and can be used to develop anticancer drugs. However, additional studies are needed to confirm this argument.","authors":["Basati G.","Saffari-Chaleshtori J.","Abbaszadeh S.","Asadi-Samani M.","Ashrafi-Dehkordi K."],"cit_count":0,"doi":"10.2174/2589977511666191018180001","journal":"Current Drug Research Reviews","pmid":"31875784","title":"Molecular dynamics mechanisms of the inhibitory effects of abemaciclib, hymenialdisine, and indirubin on CDK-6","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:abemaciclib_indirubin_hymenialdisine","biotoolsID":"abemaciclib_indirubin_hymenialdisine","description":"Molecular Dynamics Mechanisms of the Inhibitory Effects of Abemaciclib, Hymenialdisine, and Indirubin on CDK-6.\n\nBACKGROUND:Cyclin-Dependent Kinases-6 (CDK-6) is a serine threonine protein kinase with regular activity in the cell cycle. Some inhibitors, such as abemaciclib, hymenialdisine, and indirubin, cause cell arrest by decreasing its activity. OBJECTIVES:The purpose of this study was to evaluate the Molecular Dynamic (MD) effects of abemaciclib, hymenialdisine, and indirubin on the structure of CDK-6. METHODS:The PDB file of CDK-6 was obtained from the Protein Data Bank (http: www.rcsb.org). After the simulation of CDK-6 in the Gromacs software, 200 stages of molecular docking were run on CDK-6 in the presence of the inhibitors using AutoDock 4.2.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'abemaciclib hymenialdisine indirubin', 'abemaciclib hymenialdisine indirubin inhibitors', 'hymenialdisine indirubin', 'abemaciclib hymenialdisine'","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31875784","name":"abemaciclib indirubin hymenialdisine"}}