{
    "additionDate": "2021-01-18T07:02:05Z",
    "biotoolsCURIE": "biotools:mog",
    "biotoolsID": "mog",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mash@iastate.edu",
            "name": "Eve Syrkin Wurtele",
            "typeEntity": "Person"
        }
    ],
    "description": "A workbench for interactive exploratory data analysis of large expression datasets.\n\nMetaOmGraph (MOG) is a Java software to interactively explore and visualize large datasets. MOG overcomes the challenges posed by big size and complexity of big datasets by efficient handling of data files by using a combination of data indexing and buffering schemes. By incorporating metadata, MOG adds another dimension to the analyses and provides flexibility in data exploration. MOG allows users to explore their own data on their local machines.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/urmi-21/MetaOmGraph/tree/master/manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Box-Whisker plot plotting",
                    "uri": "http://edamontology.org/operation_2943"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://github.com/urmi-21/MetaOmGraph/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-22T08:01:51Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://metnetweb.gdcb.iastate.edu/MetNet_MetaOmGraph.htm"
        }
    ],
    "name": "MOG",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1209",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.The diverse and growing omics data in public domains provide researchers with tremendous opportunity to extract hidden, yet undiscovered, knowledge. However, the vast majority of archived data remain unused. Here, we present MetaOmGraph (MOG), a free, open-source, standalone software for exploratory analysis of massive datasets. Researchers, without coding, can interactively visualize and evaluate data in the context of its metadata, honing-in on groups of samples or genes based on attributes such as expression values, statistical associations, metadata terms and ontology annotations. Interaction with data is easy via interactive visualizations such as line charts, box plots, scatter plots, histograms and volcano plots. Statistical analyses include co-expression analysis, differential expression analysis and differential correlation analysis, with significance tests. Researchers can send data subsets to R for additional analyses. Multithreading and indexing enable efficient big data analysis. A researcher can create new MOG projects from any numerical data; or explore an existing MOG project. MOG projects, with history of explorations, can be saved and shared. We illustrate MOG by case studies of large curated datasets from human cancer RNA-Seq, where we identify novel putative biomarker genes in different tumors, and microarray and metabolomics data from Arabidopsis thaliana. MOG executable and code: http://metnetweb.gdcb.iastate.edu/ and https://github.com/urmi-21/MetaOmGraph/.",
                "authors": [
                    {
                        "name": "Dorman K."
                    },
                    {
                        "name": "Hur M."
                    },
                    {
                        "name": "Singh U."
                    },
                    {
                        "name": "Wurtele E.S."
                    }
                ],
                "citationCount": 4,
                "date": "2020-02-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaOmGraph: A workbench for interactive exploratory data analysis of large expression datasets"
            },
            "pmcid": "PMC7039010",
            "pmid": "31956905"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
