{"collectionID": [], "accessibility": [], "topic": [{"term": "Molecular modelling", "uri": "http://edamontology.org/topic_2275"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-13-7", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Protein docking prediction using predicted protein-protein interface", "abstract": "Background: Many important cellular processes are carried out by protein complexes. To provide physical pictures of interacting proteins, many computational protein-protein prediction methods have been developed in the past. However, it is still difficult to identify the correct docking complex structure within top ranks among alternative conformations.Results: We present a novel protein docking algorithm that utilizes imperfect protein-protein binding interface prediction for guiding protein docking. Since the accuracy of protein binding site prediction varies depending on cases, the challenge is to develop a method which does not deteriorate but improves docking results by using a binding site prediction which may not be 100% accurate. The algorithm, named PI-LZerD (using Predicted Interface with Local 3D Zernike descriptor-based Docking algorithm), is based on a pair wise protein docking prediction algorithm, LZerD, which we have developed earlier. PI-LZerD starts from performing docking prediction using the provided protein-protein binding interface prediction as constraints, which is followed by the second round of docking with updated docking interface information to further improve docking conformation. Benchmark results on bound and unbound cases show that PI-LZerD consistently improves the docking prediction accuracy as compared with docking without using binding site prediction or using the binding site prediction as post-filtering.Conclusion: We have developed PI-LZerD, a pairwise docking algorithm, which uses imperfect protein-protein binding interface prediction to improve docking accuracy. PI-LZerD consistently showed better prediction accuracy over alternative methods in the series of benchmark experiments including docking using actual docking interface site predictions as well as unbound docking cases. © 2012 Li and Kihara; licensee BioMed Central Ltd.", "citationCount": 35, "authors": [{"name": "Li B."}, {"name": "Kihara D."}], "date": "2012-01-10T00:00:00Z", "journal": "BMC Bioinformatics"}}, {"doi": "10.1002/prot.24079", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Multi-LZerD: Multiple protein docking for asymmetric complexes", "abstract": "The tertiary structures of protein complexes provide a crucial insight about the molecular mechanisms that regulate their functions and assembly. However, solving protein complex structures by experimental methods is often more difficult than single protein structures. Here, we have developed a novel computational multiple protein docking algorithm, Multi-LZerD, that builds models of multimeric complexes by effectively reusing pairwise docking predictions of component proteins. A genetic algorithm is applied to explore the conformational space followed by a structure refinement procedure. Benchmark on eleven hetero-multimeric complexes resulted in near-native conformations for all but one of them (a root mean square deviation smaller than 2.5Å). We also show that our method copes with unbound docking cases well, outperforming the methodology that can be directly compared with our approach. Multi-LZerD was able to predict near-native structures for multimeric complexes of various topologies. © 2012 Wiley Periodicals, Inc.", "citationCount": 30, "authors": [{"name": "Esquivel-Rodriguez J."}, {"name": "Yang Y.D."}, {"name": "Kihara D."}], "date": "2012-07-01T00:00:00Z", "journal": "Proteins: Structure, Function and Bioinformatics"}}, {"doi": "10.1186/1753-6561-6-S7-S4", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Effect of conformation sampling strategies in genetic algorithm for multiple protein docking", "abstract": "© 2012 Esquivel-Rodríguez and Kihara; licensee BioMed Central Ltd. Background: Macromolecular protein complexes play important roles in a cell and their tertiary structure can help understand key biological processes of their functions. Multiple protein docking is a valuable computational tool for providing structure information of multimeric protein complexes. In a previous study we developed and implemented an algorithm for this purpose, named Multi-LZerD. This method represents a conformation of a multimeric protein complex as a graph, where nodes denote subunits and each edge connecting nodes denotes a pairwise docking conformation of the two subunits. Multi-LZerD employs a genetic algorithm to sample different topologies of the graph and pairwise transformations between subunits, seeking for the conformation of the optimal (lowest) energy. In this study we explore different configurations of the genetic algorithm, namely, the population size, whether to include a crossover operation, as well as the threshold for structural clustering, to find the optimal experimental setup. Methods: Multi-LZerD was executed to predict the structures of three multimeric protein complexes, using different population sizes, clustering thresholds, and configurations of mutation and crossover. We analyzed the impact of varying these parameters on the computational time and the prediction accuracy. Results and conclusions: Given that computational resources is a key for handling complexes with a large number of subunits and also for computing a large number of protein complexes in a genome-scale study, finding a proper setting for sampling the conformation space is of the utmost importance. Our results show that an excessive sampling of the conformational space by increasing the population size or by introducing the crossover operation is not necessary for improving accuracy for predicting structures of small complexes. The clustering is effective in reducing redundant pairwise predictions, which leads to successful identification of near-native conformations.", "citationCount": 4, "authors": [{"name": "Esquivel-Rodriguez J."}, {"name": "Kihara D."}], "date": "2012-11-13T00:00:00Z", "journal": "BMC Proceedings"}}, {"doi": "10.1007/978-1-4939-0366-5_15", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Pairwise and multimeric protein–protein docking using the lzerd program suite", "abstract": "© Springer Science+Business Media New York 2014. Physical interactions between proteins are involved in many important cell functions and are key for understanding the mechanisms of biological processes. Protein–protein docking programs provide a means to computationally construct three-dimensional (3D) models of a protein complex structure from its component protein units. A protein docking program takes two or more individual 3D protein structures, which are either experimentally solved or computationally modeled, and outputs a series of probable complex structures. In this chapter we present the LZerD protein docking suite, which includes programs for pairwise docking, LZerD and PI-LZerD, and multiple protein docking, Multi-LZerD, developed by our group. PI-LZerD takes protein docking interface residues as additional input information. The methods use a combination of shape-based protein surface features as well as physics-based scoring terms to generate protein complex models. The programs are provided as stand-alone programs and can be downloaded from http://kiharalab.org/proteindocking .", "citationCount": 15, "authors": [{"name": "Esquivel-Rodriguez J."}, {"name": "Filos-Gonzalez V."}, {"name": "Li B."}, {"name": "Kihara D."}], "date": "2014-01-01T00:00:00Z", "journal": "Methods in Molecular Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://kiharalab.org/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:lzerd", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://kiharalab.org/proteindocking/lzerd.php", "function": [{"note": null, "input": [], "operation": [{"term": "Protein docking", "uri": "http://edamontology.org/operation_0478"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:57Z", "otherID": [], "description": "LZerD: Protein-Protein Docking Algorithm", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["C++"], "link": [{"url": "http://www.mybiosoftware.com/lzerd-multi-lzerd-pi-lzerd-multiple-protein-protein-docking-algorithm.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "lzerd", "additionDate": "2017-12-18T00:08:22Z", "name": "LZerD", "license": null, "documentation": [{"url": "http://kiharalab.org/proteindocking/lzerd.php#aim_tutorial", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}