{
    "additionDate": "2019-11-14T19:37:19Z",
    "biotoolsCURIE": "biotools:SeqSero2",
    "biotoolsID": "SeqSero2",
    "confidence_flag": "tool",
    "description": "rapid and improved Salmonella serotype determination using whole genome sequencing data | SeqSero-Salmonella Serotyping by Whole Genome Sequencing | Salmonella Serotyping by Whole Genome Sequencing | Online version: http://www.denglab.info/SeqSero2 | Salmonella serotype prediction from genome sequencing data | Citation: SeqSero, Zhang et al. 2015; SeqSero2, Zhang et al. 2019 | Salmonella serotype derterminants databases | Upon executing the command, a directory named 'SeqSero_result_Time_your_run' will be created. Your result will be stored in 'SeqSero_result.txt' in that directory. And the assembled alleles can also be found in the directory if using \"-m a\" (allele mode)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                }
            ]
        }
    ],
    "homepage": "http://denglab.info/SeqSero2",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-19T15:17:32Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/denglab/SeqSero2"
        }
    ],
    "name": "SeqSero2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/AEM.01746-19",
            "metadata": {
                "abstract": "© 2019 American Society for Microbiology.SeqSero, launched in 2015, is a software tool for Salmonella serotype determination from whole-genome sequencing (WGS) data. Despite its routine use in public health and food safety laboratories in the United States and other countries, the original SeqSero pipeline is relatively slow (minutes per genome using sequencing reads), is not optimized for draft genome assemblies, and may assign multiple serotypes for a strain. Here, we present SeqSero2 (github.com/denglab/Seq- Sero2; denglab.info/SeqSero2), an algorithmic transformation and functional update of the original SeqSero. Major improvements include (i) additional sequence markers for identification of Salmonella species and subspecies and certain serotypes, (ii) a k-mer based algorithm for rapid serotype prediction from raw reads (seconds per genome) and improved serotype prediction from assemblies, and (iii) a targeted assembly approach for specific retrieval of serotype determinants from WGS for serotype prediction, new allele discovery, and prediction troubleshooting. Evaluated using 5,794 genomes representing 364 common U.S. serotypes, including 2,280 human isolates of 117 serotypes from the National Antimicrobial Resistance Monitoring System, SeqSero2 is up to 50 times faster than the original SeqSero while maintaining equivalent accuracy for raw reads and substantially improving accuracy for assemblies. SeqSero2 further suggested that 3% of the tested genomes contained reads from multiple serotypes, indicating a use for contamination detection. In addition to short reads, SeqSero2 demonstrated potential for accurate and rapid serotype prediction directly from long nanopore reads despite base call errors. Testing of 40 nanopore-sequenced genomes of 17 serotypes yielded a single H antigen misidentification.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Deng X."
                    },
                    {
                        "name": "Dinsmore B.A."
                    },
                    {
                        "name": "Fields P.I."
                    },
                    {
                        "name": "Lane C."
                    },
                    {
                        "name": "Lauer A.C."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "den Bakker H.C."
                    }
                ],
                "citationCount": 29,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Applied and Environmental Microbiology",
                "title": "SeqSero2: Rapid and improved salmonella serotype determination using whole-genome sequencing data"
            },
            "pmid": "31540993"
        }
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
