{
    "additionDate": "2021-01-18T08:12:36Z",
    "biotoolsCURIE": "biotools:community-simulator",
    "biotoolsID": "community-simulator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "marsland@bu.edu",
            "name": "Robert Marsland",
            "orcidid": "https://orcid.org/0000-0002-5007-6877",
            "typeEntity": "Person"
        }
    ],
    "description": "Community Simulator is a Python package for microbial ecology. It is designed for simulating batch culture experiments on complex microbial communities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Emergent-Behaviors-in-Biology/community-simulator",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-17T13:31:31Z",
    "license": "MIT",
    "name": "Community Simulator",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0230430",
            "metadata": {
                "abstract": "© 2020 Marsland et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Natural microbial communities contain hundreds to thousands of interacting species. For this reason, computational simulations are playing an increasingly important role in microbial ecology. In this manuscript, we present a new open-source, freely available Python package called Community Simulator for simulating microbial population dynamics in a reproducible, transparent and scalable way. The Community Simulator includes five major elements: Tools for preparing the initial states and environmental conditions for a set of samples, automatic generation of dynamical equations based on a dictionary of modeling assumptions, random parameter sampling with tunable levels of metabolic and taxonomic structure, parallel integration of the dynamical equations, and support for metacommunity dynamics with migration between samples. To significantly speed up simulations using Community Simulator, our Python package implements a new Expectation-Maximization (EM) algorithm for finding equilibrium states of community dynamics that exploits a recently discovered duality between ecological dynamics and convex optimization. We present data showing that this EM algorithm improves performance by between one and two orders compared to direct numerical integration of the corresponding ordinary differential equations. We conclude by listing several recent applications of the Community Simulator to problems in microbial ecology, and discussing possible extensions of the package for directly analyzing microbiome compositional data.",
                "authors": [
                    {
                        "name": "Cui W."
                    },
                    {
                        "name": "Goldford J."
                    },
                    {
                        "name": "Marsland R."
                    },
                    {
                        "name": "Mehta P."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "The Community Simulator: A Python package for microbial ecology"
            },
            "pmcid": "PMC7092969",
            "pmid": "32208436"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
