{
    "additionDate": "2020-01-14T20:16:03Z",
    "biotoolsCURIE": "biotools:ngphubinh",
    "biotoolsID": "ngphubinh",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "susantorahardja@ieee.org",
            "name": "Susanto Rahardja",
            "typeEntity": "Person"
        }
    ],
    "description": "Classification of adaptor proteins using recurrent neural networks and PSSM profiles.\n\nAdaptor proteins are carrier proteins that play a crucial role in signal transduction.\n\nWe collected all the proteins from UniProt with GO molecular function annotations related to adaptor proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ngphubinh/adaptors",
    "lastUpdate": "2021-01-04T08:15:44Z",
    "name": "ngphubinh",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6335-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Adaptor proteins are carrier proteins that play a crucial role in signal transduction. They commonly consist of several modular domains, each having its own binding activity and operating by forming complexes with other intracellular-signaling molecules. Many studies determined that the adaptor proteins had been implicated in a variety of human diseases. Therefore, creating a precise model to predict the function of adaptor proteins is one of the vital tasks in bioinformatics and computational biology. Few computational biology studies have been conducted to predict the protein functions, and in most of those studies, position specific scoring matrix (PSSM) profiles had been used as the features to be fed into the neural networks. However, the neural networks could not reach the optimal result because the sequential information in PSSMs has been lost. This study proposes an innovative approach by incorporating recurrent neural networks (RNNs) and PSSM profiles to resolve this problem. Results: Compared to other state-of-the-art methods which had been applied successfully in other problems, our method achieves enhancement in all of the common measurement metrics. The area under the receiver operating characteristic curve (AUC) metric in prediction of adaptor proteins in the cross-validation and independent datasets are 0.893 and 0.853, respectively. Conclusions: This study opens a research path that can promote the use of RNNs and PSSM profiles in bioinformatics and computational biology. Our approach is reproducible by scientists that aim to improve the performance results of different protein function prediction problems. Our source code and datasets are available at https://github.com/ngphubinh/adaptors.",
                "authors": [
                    {
                        "name": "Khanh Le N.Q."
                    },
                    {
                        "name": "Nguyen Q.H."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Rahardja S."
                    },
                    {
                        "name": "Nguyen B.P."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Classification of adaptor proteins using recurrent neural networks and PSSM profiles"
            },
            "pmcid": "PMC6929330",
            "pmid": "31874633"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}