{
    "additionDate": "2021-01-18T12:26:58Z",
    "biotoolsCURIE": "biotools:pzres-net",
    "biotoolsID": "pzres-net",
    "confidence_flag": "tool",
    "description": "Hyperspectral Image Super-Resolution via Deep Progressive Zero-Centric Residual Learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zbzhzhy/PZRes-Net",
    "lastUpdate": "2021-03-20T16:14:46Z",
    "license": "MIT",
    "name": "PZRes-Net",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.3044214",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.This paper explores the problem of hyperspectral image (HSI) super-resolution that merges a low resolution HSI (LR-HSI) and a high resolution multispectral image (HR-MSI). The cross-modality distribution of the spatial and spectral information makes the problem challenging. Inspired by the classic wavelet decomposition-based image fusion, we propose a novel lightweight deep neural network-based framework, namely progressive zero-centric residual network (PZRes-Net), to address this problem efficiently and effectively. Specifically, PZRes-Net learns a high resolution and zero-centric residual image, which contains high-frequency spatial details of the scene across all spectral bands, from both inputs in a progressive fashion along the spectral dimension. And the resulting residual image is then superimposed onto the up-sampled LR-HSI in a mean-value invariant manner, leading to a coarse HR-HSI, which is further refined by exploring the coherence across all spectral bands simultaneously. To learn the residual image efficiently and effectively, we employ spectral-spatial separable convolution with dense connections. In addition, we propose zero-mean normalization implemented on the feature maps of each layer to realize the zero-mean characteristic of the residual image. Extensive experiments over both real and synthetic benchmark datasets demonstrate that our PZRes-Net outperforms state-of-the-art methods to a significant extent in terms of both 4 quantitative metrics and visual quality, e.g., our PZRes-Net improves the PSNR more than 3dB, while saving 2.3\\times parameters and consuming 15\\times less FLOPs. The code is publicly available at https://github.com/zbzhzhy/PZRes-Net",
                "authors": [
                    {
                        "name": "Zhu Z."
                    },
                    {
                        "name": "Hou J."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Zeng H."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Hyperspectral Image Super-Resolution via Deep Progressive Zero-Centric Residual Learning"
            },
            "pmid": "33332269"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}