{
    "additionDate": "2017-03-27T08:35:20Z",
    "biotoolsCURIE": "biotools:tmpad",
    "biotoolsID": "tmpad",
    "credit": [
        {
            "email": "tsung@iis.sinica.edu.tw",
            "name": "Ting-Yi Sung",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Integrates experimentally observed helix-helix interactions and related structural information of membrane proteins. It offers pre-calculated geometric descriptors at the helix-packing interface. It also includes the corresponding sequence, topology, lipid accessibility, ligand-binding information and supports structural classification, schematic diagrams and visualization of the above structural features of TM helix-packing.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://en.wikipedia.org/wiki/TMPad"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                }
            ]
        }
    ],
    "homepage": "http://bio-cluster.iis.sinica.edu.tw/TMPad",
    "homepage_status": 1,
    "language": [
        "Java",
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "TMPad",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "α-Helical transmembrane (TM) proteins play an important role in many critical and diverse biological processes, and specific associations between TM helices are important determinants for membrane protein folding, dynamics and function. In order to gain insights into the above phenomena, it is necessary to investigate different types of helix-packing modes and interactions. However, such information is difficult to obtain because of the experimental impediment and a lack of a well-annotated source of helix-packing folds in TM proteins. We have developed the TMPad (TransMembrane Protein Helix- Packing Database) which addresses the above issues by integrating experimentally observed helix-helix interactions and related structural information of membrane proteins. Specifically, the TMPad offers pre-calculated geometric descriptors at the helix-packing interface including residue backbone/side-chain contacts, interhelical distances and crossing angles, helical translational shifts and rotational angles. The TMPad also includes the corresponding sequence, topology, lipid accessibility, ligand-binding information and supports structural classification, schematic diagrams and visualization of the above structural features of TM helix-packing. Through detailed annotations and visualizations of helix-packing, this online resource can serve as an information gateway for deciphering the relationship between helix-helix interactions and higher levels of organization in TM protein structure and function. The website of the TMPad is freely accessible to the public at http://bio-cluster.iis.sinica.edu.tw/ TMPad. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Cheng C.-W."
                    },
                    {
                        "name": "Chiu Y.-Y."
                    },
                    {
                        "name": "Hsu W.-L."
                    },
                    {
                        "name": "Lo A."
                    },
                    {
                        "name": "Sung T.-Y."
                    }
                ],
                "citationCount": 16,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TMPad: An integrated structural database for helix-packing folds in transmembrane proteins"
            },
            "pmid": "21177659"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1
}
