
{
    "credit": [
        {
            "email": "souparno.ghosh@ttu.edu",
            "name": "Souparno Ghosh",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "joshua.mayer@ttu.edu",
            "name": "Joshua Mayer",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/jomayer/SMuRF"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Script"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. Motivation Random forest (RF) has become a widely popular prediction generating mechanism. Its strength lies in its flexibility, interpretability and ability to handle large number of features, typically larger than the sample size. However, this methodology is of limited use if one wishes to identify statistically significant features. Several ranking schemes are available that provide information on the relative importance of the features, but there is a paucity of general inferential mechanism, particularly in a multi-variate set up. We use the conditional inference tree framework to generate a RF where features are deleted sequentially based on explicit hypothesis testing. The resulting sequential algorithm offers an inferentially justifiable, but model-free, variable selection procedure. Significant features are then used to generate predictive RF. An added advantage of our methodology is that both variable selection and prediction are based on conditional inference framework and hence are coherent. Results We illustrate the performance of our Sequential Multi-Response Feature Selection approach through simulation studies and finally apply this methodology on Genomics of Drug Sensitivity for Cancer dataset to identify genetic characteristics that significantly impact drug sensitivities. Significant set of predictors obtained from our method are further validated from biological perspective.",
            "authors": [
                "Mayer J.",
                "Rahman R.",
                "Ghosh S.",
                "Pal R."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btx784",
            "journal": "Bioinformatics",
            "title": "Sequential feature selection and inference using multi-variate random forests",
            "year": "2018-04-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:smurfs",
        "biotoolsID": "smurfs",
        "description": "Sequential feature selection and inference using multi-variate random forests.",
        "homepage": "https://github.com/jomayer/SMuRF",
        "name": "SMuRFS"
    }
}