{
    "name": "CAPIU", 
    "description": "Novel approach for clustering samples (treatments, patients, condition etc) by using annotational information about the genes. The algorithm searches all pre-defined gene classes for classes that exhibit a strong clustering of the samples. These are then used to split the samples in two groups until no significant splits can be found. The result is visualized as a tree with gene classes as nodes and groups of samples as leaves.", 
    "homepage": "http://bioinformatics.mpimp-golm.mpg.de/research-projects-publications/tools-services/capiu", 
    "biotoolsID": "capiu", 
    "biotoolsCURIE": "biotools:capiu", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0291", 
                    "term": "Sequence clustering"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3277", 
            "term": "Sample collections"
        }, 
        {
            "uri": "http://edamontology.org/topic_3518", 
            "term": "Microarray experiment"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/capiu-0-2-clustering-priori-information-unsupervised-decision-trees.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://www.ncbi.nlm.nih.gov/pubmed/17476945", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17476945", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Integrating functional knowledge during sample clustering for microarray data using unsupervised decision trees", 
                "abstract": "Clustering of microarray gene expression data is performed routinely, for genes as well as for samples. Clustering of genes can exhibit functional relationships between genes; clustering of samples on the other hand is important for finding e.g. disease subtypes, relevant patient groups for stratification or related treatments. Usually this is done by first filtering the genes for high-variance under the assumption that they carry most of the information needed for separating different sample groups. If this assumption is violated, important groupings in the data might be lost. Furthermore, classical clustering methods do not facilitate the biological interpretation of the results. Therefore, we propose to methodologically integrate the clustering algorithm with prior biological information. This is different from other approaches as knowledge about classes of genes can be directly used to ease the interpretation of the results and possibly boost clustering performance. Our approach computes dendrograms that resemble decision trees with gene classes used to split the data at each node which can help to find biologically meaningful differences between the sample groups. We have tested the proposed method both on simulated and real data and conclude its usefulness as a complementary method, especially when assumptions of few differentially expressed genes along with an informative mapping of genes to different classes are met. © 2007 WILEY-VCH Verlag GmbH & Co. KGaA.", 
                "date": "2007-04-01T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Redestig H."
                    }, 
                    {
                        "name": "Repsilber D."
                    }, 
                    {
                        "name": "Sohler F."
                    }, 
                    {
                        "name": "Selbig J."
                    }
                ], 
                "journal": "Biometrical Journal"
            }
        }
    ], 
    "credit": [
        {
            "name": "Henning Redestig", 
            "email": "redestig@5Dmpimp-golm.mpg.de", 
            "url": "http://bioinformatics.mpimp-golm.mpg.de/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:38:04Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}