{
    "accessibility": "Open access",
    "additionDate": "2024-05-24T10:12:06.841711Z",
    "biotoolsCURIE": "biotools:aptadb",
    "biotoolsID": "aptadb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ytang234@ecust.edu.cn",
            "name": "Yun Tang",
            "orcidid": "https://orcid.org/0000-0003-2340-1109",
            "typeEntity": "Person"
        },
        {
            "name": "Long Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "AptaDB is an online database that integrated comprehensive information on aptamers. It collects thousands of aptamers obtained from SELEX-based screening in the literature and and other databases, which may facilitate biologists to develop novel aptamers and accelerate aptamer-related researches.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "homepage": "http://lmmd.ecust.edu.cn/aptadb/",
    "lastUpdate": "2024-05-24T10:12:06.843909Z",
    "name": "AptaDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1261/rna.079784.123",
            "metadata": {
                "abstract": "Aptamers have emerged as research hotspots of the next generation due to excellent performance benefits and application potentials in pharmacology, medicine, and analytical chemistry. Despite the numerous aptamer investigations, the lack of comprehensive data integration has hindered the development of computational methods for aptamers and the reuse of aptamers. A public access database named AptaDB, derived from experimentally validated data manually collected from the literature, was hence developed, integrating comprehensive aptamer-related data, which include six key components: (i) experimentally validated aptamer–target interaction information, (ii) aptamer property information, (iii) structure information of aptamer, (iv) target information, (v) experimental activity information, and (vi) algorithmically calculated similar aptamers. AptaDB currently contains 1350 experimentally validated aptamer–target interactions, 1230 binding affinity constants, 1293 aptamer sequences, and more. Compared to other aptamer databases, it contains twice the number of entries found in available databases. The collection and integration of the above information categories is unique among available aptamer databases and provides a user-friendly interface. AptaDB will also be continuously updated as aptamer research evolves. We expect that AptaDB will become a powerful source for aptamer rational design and a valuable tool for aptamer screening in the future. For access to AptaDB, please visit http://lmmd.ecust.edu.cn/aptadb/.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Yu X."
                    },
                    {
                        "name": "Zhou M."
                    },
                    {
                        "name": "Zhuohang Y.U."
                    }
                ],
                "date": "2024-03-01T00:00:00Z",
                "journal": "RNA",
                "title": "AptaDB: a comprehensive database integrating aptamer–target interactions"
            },
            "pmid": "38164624"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Analytical chemistry",
            "uri": "http://edamontology.org/topic_3370"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
