{"credit":[{"email":"mcodev31@gmail.com","name":"Marcus Johansson","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/mcodev31/libmsym"}],"function":[{"operation":[{"term":"Structure analysis","uri":"http://edamontology.org/operation_2480"}]}],"labels":{"language":["Python","C"],"license":"MIT","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Cheminformatics","uri":"http://edamontology.org/topic_2258"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Simulation experiment","uri":"http://edamontology.org/topic_3524"},{"term":"Synthetic chemistry","uri":"http://edamontology.org/topic_3371"},{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"}]},"publication":[{"abstract":"© 2017 The Author(s). Automatic detection of point groups as well as symmetrisation of molecular geometry and wavefunctions are useful tools in computational quantum chemistry. Algorithms for developing these tools as well as an implementation are presented. The symmetry detection algorithm is a clustering algorithm for symmetry invariant properties, combined with logical deduction of possible symmetry elements using the geometry of sets of symmetrically equivalent atoms. An algorithm for determining the symmetry adapted linear combinations (SALCs) of atomic orbitals is also presented. The SALCs are constructed with the use of projection operators for the irreducible representations, as well as subgroups for determining splitting fields for a canonical basis. The character tables for the point groups are auto generated, and the algorithm is described. Symmetrisation of molecules use a projection into the totally symmetric space, whereas for wavefunctions projection as well and partner function determination and averaging is used. The software has been released as a stand-alone, open source library under the MIT license and integrated into both computational and molecular modelling software. Graphical abstract.","authors":["Johansson M.","Veryazov V."],"cit_count":1,"doi":"10.1186/s13321-017-0193-3","journal":"Journal of Cheminformatics","title":"Automatic procedure for generating symmetry adapted wavefunctions","year":"2017-02-02"}],"summary":{"biotoolsCURIE":"biotools:libmsym","biotoolsID":"libmsym","description":"C library dealing with point group symmetry in molecules.","homepage":"https://github.com/mcodev31/libmsym","name":"libmsym"}}