{
    "additionDate": "2021-03-19T08:49:34Z",
    "biotoolsCURIE": "biotools:straitrazor",
    "biotoolsID": "straitrazor",
    "confidence_flag": "tool",
    "description": "An enhanced user interface to facilitate interpretation of MPS data.\n\nSTRait Razor Online (SRO) serves as the user-interface (UI) for analyzing sequencing data with STRait Razor. Using the SRO, converts STRait Razor* sequence-based allele calls into genotype tables for and/or bar plots for downstream analysis. STRait Razor Online also allows the user to control the genotype calls using several thresholds (e.g., heterozygous balance, strand balance, etc.). Read strands are merged and reported as single strand (Default = Forward) in Genotype Tables.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://www.unthsc.edu/straitrazor",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-10T09:29:35Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ExpectationsManaged/STRaitRazorOnline"
        }
    ],
    "name": "STRaitRazor",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.FSIGEN.2021.102463",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Since 2013, STRait Razor has enabled analysis of massively parallel sequencing (MPS) data from various marker systems such as short tandem repeats, single nucleotide polymorphisms, insertion/deletions, and mitochondrial DNA. In this paper, STRait Razor Online (SRO), available at https://www.unthsc.edu/straitrazor, is introduced as an interactive, Shiny-based user interface for primary analysis of MPS data and secondary analysis of STRait Razor haplotype pileups. This software can be accessed from any common browser via desktop, tablet, or smartphone device. SRO is available also as a standalone application and open-source R script available at https://github.com/ExpectationsManaged/STRaitRazorOnline. The local application is capable of batch processing of both fastq files and primary analysis output. Processed batches generate individual report folders and summary reports at the locus- and haplotype-level in a matter of minutes. For example, the processing of data from ∼700 samples generated with the ForenSeq Signature Preparation Kit from allsequences.txt to a final table can be performed in ∼40 min whereas the Excel-based workbooks can take 35−60 h to compile a subset of the tables generated by SRO. To facilitate analysis of single-source, reference samples, a preliminary triaging system was implemented that calls potential alleles and flags loci suspected of severe heterozygote imbalance. When compared to published, manually curated data sets, 98.72 % of software-assigned allele calls without manual interpretation were consistent with curated data sets, 0.99 % loci were presented to the user for interpretation due to heterozygote imbalance, and the remaining 0.29 % of loci were inconsistent due to the analytical thresholds used across the studies.",
                "authors": [
                    {
                        "name": "King J.L."
                    },
                    {
                        "name": "Woerner A.E."
                    },
                    {
                        "name": "Mandape S.N."
                    },
                    {
                        "name": "Kapema K.B."
                    },
                    {
                        "name": "Moura-Neto R.S."
                    },
                    {
                        "name": "Silva R."
                    },
                    {
                        "name": "Budowle B."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Forensic Science International: Genetics",
                "title": "STRait Razor Online: An enhanced user interface to facilitate interpretation of MPS data"
            },
            "pmid": "33493821"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}