{
    "additionDate": "2021-01-18T10:12:33Z",
    "biotoolsCURIE": "biotools:rudrec",
    "biotoolsID": "rudrec",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "AlimovaIlseyar@gmail.com",
            "name": "Ilseyar Alimova",
            "typeEntity": "Person"
        },
        {
            "email": "elvtutubalina@kpfu.ru",
            "name": "Elena Tutubalina",
            "typeEntity": "Person"
        }
    ],
    "description": "The Russian Drug Reaction Corpus and Neural Models for Drug Reactions and Effectiveness Detection in User Reviews.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cimm-kzn/RuDReC",
    "lastUpdate": "2021-03-20T11:02:29Z",
    "name": "RuDReC",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA675",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Drugs and diseases play a central role in many areas of biomedical research and healthcare. Aggregating knowledge about these entities across a broader range of domains and languages is critical for information extraction (IE) applications. To facilitate text mining methods for analysis and comparison of patient's health conditions and adverse drug reactions reported on the Internet with traditional sources such as drug labels, we present a new corpus of Russian language health reviews. Results: The Russian Drug Reaction Corpus (RuDReC) is a new partially annotated corpus of consumer reviews in Russian about pharmaceutical products for the detection of health-related named entities and the effectiveness of pharmaceutical products. The corpus itself consists of two parts, the raw one and the labeled one. The raw part includes 1.4 million health-related user-generated texts collected from various Internet sources, including social media. The labeled part contains 500 consumer reviews about drug therapy with drug- and disease-related information. Labels for sentences include health-related issues or their absence. The sentences with one are additionally labeled at the expression level for identification of fine-grained subtypes such as drug classes and drug forms, drug indications and drug reactions. Further, we present a baseline model for named entity recognition (NER) and multilabel sentence classification tasks on this corpus. The macro F1 score of 74.85% in the NER task was achieved by our RuDR-BERT model. For the sentence classification task, our model achieves the macro F1 score of 68.82% gaining 7.47% over the score of BERT model trained on Russian data.",
                "authors": [
                    {
                        "name": "Alimova I."
                    },
                    {
                        "name": "Malykh V."
                    },
                    {
                        "name": "Miftahutdinov Z."
                    },
                    {
                        "name": "Nikolenko S."
                    },
                    {
                        "name": "Sakhovskiy A."
                    },
                    {
                        "name": "Tutubalina E."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "The Russian Drug Reaction Corpus and neural models for drug reactions and effectiveness detection in user reviews"
            },
            "pmid": "32722774"
        }
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        }
    ]
}
