{
    "name": "FlexPred", 
    "description": "FlexPred is a web-server for predicting residue positions involved in conformational switches in proteins.The server accepts either a protein sequence or a PDB file to predict residue positions involved in conformational switches.", 
    "homepage": "http://flexpred.rit.albany.edu/", 
    "biotoolsID": "flexpred", 
    "biotoolsCURIE": "biotools:flexpred", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2479", 
                    "term": "Protein sequence analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/flexpred-predicting-residue-positions-involved-conformational-switches-proteins.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://flexpred.rit.albany.edu/help.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1002/prot.21899", 
            "pmid": "18186479", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Ordered conformational change in the protein backbone: Prediction of conformationally variable positions from sequence and low-resolution structural data", 
                "abstract": "Ordered conformational changes are an important structural property of proteins and are involved in a variety of fundamental biological activities. Large-scale analyses of the implications of such changes for protein function and dysfunction require efficient methods for automated recognition of conformationally variable residue positions. The goal of this work was to study sequence and low-resolution structural properties of residue positions that change backbone conformation upon changes in protein environment and the utility of these properties for automated recognition of such conformationally variable positions. This study was performed using a large nonredundant set of experimentally characterized proteins that undergo ordered conformational transitions obtained from the Database of Macromolecular Movements. The results of this study show that ordered changes in backbone conformation are not limited to solvent accessible loop regions. A considerable fraction of conformationally variable positions is observed in helices and strands, and in buried positions. Conformationally variable positions are less conserved in evolution. Local patterns of (a) sequence neighbors, (b) evolutionary conservation, and (c) solvent accessibility can be used to predict conformationally variable positions with balanced sensitivity and specificity, albeit with large variance at the level of individual proteins. However, including a pattern of secondary structure into the prediction scheme results in a highly unbalanced performance when all conformationally variable positions located in regular secondary structure are misclassified. Application of the present methodology to the prion protein (PrP) shows that conformationally variable positions predicted in its ordered C-terminal domain are located within segments presumed to be involved in refolding of PrP. © 2008 Wiley-Liss, Inc.", 
                "date": "2008-07-01T00:00:00Z", 
                "citationCount": 20, 
                "authors": [
                    {
                        "name": "Kuznetsov I.B."
                    }
                ], 
                "journal": "Proteins: Structure, Function and Genetics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "19238251", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": null
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.albany.edu/cancergenomics/people/kuznetsov.html", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:06:33Z", 
    "lastUpdate": "2018-12-24T22:24:29Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}