{
    "additionDate": "2022-10-11T08:38:15.479057Z",
    "biotoolsCURIE": "biotools:thpdb",
    "biotoolsID": "thpdb",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/thpdb/"
        }
    ],
    "description": "THPdb is a comprehensive database based on approved and approved/investigational therapeutic peptides compiling important information about these peptides, like their description, sequence, indication, mechanism of action, pharmacodynamics, toxicity, metabolism, absorption, half life, volume of distribution, clearance rate, patent information, interaction with other drugs, targets, physicochemical properties, etc.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/thpdb/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/thpdb/",
    "lastUpdate": "2022-10-11T08:38:21.491227Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/thpdb/"
        }
    ],
    "name": "thpdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0181748",
            "metadata": {
                "abstract": "© 2017 Usmani et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.THPdb (http://crdd.osdd.net/raghava/thpdb/) is a manually curated repository of Food and Drug Administration (FDA) approved therapeutic peptides and proteins. The information in THPdb has been compiled from 985 research publications, 70 patents and other resources like DrugBank. The current version of the database holds a total of 852 entries, providing comprehensive information on 239 US-FDA approved therapeutic peptides and proteins and their 380 drug variants. The information on each peptide and protein includes their sequences, chemical properties, composition, disease area, mode of activity, physical appearance, category or pharmacological class, pharmacodynamics, route of administration, toxicity, target of activity, etc. In addition, we have annotated the structure of most of the protein and peptides. A number of user-friendly tools have been integrated to facilitate easy browsing and data analysis. To assist scientific community, a web interface and mobile App have also been developed.",
                "authors": [
                    {
                        "name": "Ahuja A.A."
                    },
                    {
                        "name": "Bedi G."
                    },
                    {
                        "name": "Gautam A."
                    },
                    {
                        "name": "Kalra S."
                    },
                    {
                        "name": "Kumar P."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Samuel J.S."
                    },
                    {
                        "name": "Sharma M."
                    },
                    {
                        "name": "Singh S."
                    },
                    {
                        "name": "Usmani S.S."
                    }
                ],
                "citationCount": 256,
                "date": "2017-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "THPdb: Database of FDA-approved peptide and protein therapeutics"
            },
            "pmcid": "PMC5536290",
            "pmid": "28759605"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
