{
    "accessibility": "Open access",
    "additionDate": "2021-05-28T06:54:25Z",
    "biotoolsCURIE": "biotools:rawrr",
    "biotoolsID": "rawrr",
    "cost": "Free of charge",
    "description": "Direct Access to Orbitrap Data and Beyond.\nR interface for Thermo Fisher Scientific raw files branched from rawDiag. This package wraps the functionality of the RawFileReader .NET assembly. Within the R environment, spectra and chromatograms are represented by S3 objects.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fgcz/rawrr",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-28T06:54:25Z",
    "name": "rawrr",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00866",
            "metadata": {
                "abstract": "© 2021 The Authors. Published by American Chemical Society.The Bioconductor project (Nat. Methods 2015, 12 (2), 115-121) has shown that the R statistical environment is a highly valuable tool for genomics data analysis, but with respect to proteomics, we are still missing low-level infrastructure to enable performant and robust analysis workflows in R. Fundamentally important are libraries that provide raw data access. Our R package rawDiag (J. Proteome Res. 2018, 17 (8), 2908-2914) has provided the proof-of-principle how access to mass spectrometry raw files can be realized by wrapping a vendor-provided advanced programming interface (API) for the purpose of metadata analysis and visualization. Our novel package rawrr now provides complete, OS-independent access to all spectral data logged in Thermo Fisher Scientific raw files. In this technical note, we present implementation details and describe the main functionalities provided by the rawrr package. In addition, we report two use cases inspired by real-world research tasks that demonstrate the application of the package. The raw data used for demonstration purposes was deposited as MassIVE data set MSV000086542. Availability: https://github.com/fgcz/rawrr.",
                "authors": [
                    {
                        "name": "Kockmann T."
                    },
                    {
                        "name": "Panse C."
                    }
                ],
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "The rawrr R Package: Direct Access to Orbitrap Data and beyond"
            },
            "pmid": "33686856"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}