{
    "additionDate": "2023-02-19T11:58:55.306792Z",
    "biotoolsCURIE": "biotools:dna-mp",
    "biotoolsID": "dna-mp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Muhammad_Nabeel.Asim@dfki.de",
            "name": "Muhammad Nabeel Asim",
            "typeEntity": "Person"
        }
    ],
    "description": "A generalized DNA modifications predictor for multiple species based on powerful sequence encoding method.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://sds_genetic_analysis.opendfki.de/DNA_Modifications/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:59:44.813899Z",
    "license": "Other",
    "name": "DNA-MP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbac546",
            "metadata": {
                "abstract": "Accurate prediction of deoxyribonucleic acid (DNA) modifications is essential to explore and discern the process of cell differentiation, gene expression and epigenetic regulation. Several computational approaches have been proposed for particular type-specific DNA modification prediction. Two recent generalized computational predictors are capable of detecting three different types of DNA modifications; however, type-specific and generalized modifications predictors produce limited performance across multiple species mainly due to the use of ineffective sequence encoding methods. The paper in hand presents a generalized computational approach \"DNA-MP\"that is competent to more precisely predict three different DNA modifications across multiple species. Proposed DNA-MP approach makes use of a powerful encoding method \"position specific nucleotides occurrence based 117 on modification and non-modification class densities normalized difference\"(POCD-ND) to generate the statistical representations of DNA sequences and a deep forest classifier for modifications prediction. POCD-ND encoder generates statistical representations by extracting position specific distributional information of nucleotides in the DNA sequences. We perform a comprehensive intrinsic and extrinsic evaluation of the proposed encoder and compare its performance with 32 most widely used encoding methods on benchmark DNA modifications prediction datasets of different species using different machine learning classifiers. Overall, with all classifiers, the proposed POCD-ND encoder outperforms existing different encoders. Furthermore, combinedly over 5-fold cross validation benchmark datasets and independent test sets, proposed DNA-MP predictor outperforms state-of-the-art type-specific and generalized modifications predictors by an average accuracy of 7% across 4mc datasets, 1.35% across 5hmc datasets and 10% for 6ma datasets. To facilitate the scientific community, the DNA-MP web application is available at https://sds_genetic_analysis.opendfki.de/DNA_Modifications/.",
                "authors": [
                    {
                        "name": "Ahmed S."
                    },
                    {
                        "name": "Ali Ibrahim M."
                    },
                    {
                        "name": "Dengel A."
                    },
                    {
                        "name": "Fazeel A."
                    },
                    {
                        "name": "Nabeel Asim M."
                    }
                ],
                "citationCount": 8,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "DNA-MP: A generalized DNA modifications predictor for multiple species based on powerful sequence encoding method"
            },
            "pmid": "36528802"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
