{
    "additionDate": "2017-08-03T19:03:47Z",
    "biotoolsCURIE": "biotools:usr-vs",
    "biotoolsID": "usr-vs",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://usr.marseille.inserm.fr/"
        }
    ],
    "description": "Webserver for large-scale prospective virtual screening using USR and USRCAT, two ultrafast ligand-based 3D molecular similarity methods that have been retrospectively validated.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://usr.marseille.inserm.fr/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://usr.marseille.inserm.fr/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/usr-vs-ligand-based-virtual-screening-powered-by-ultrafast-shape-recognition-techniques.html"
        }
    ],
    "name": "USR-VS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Ligand-based Virtual Screening (VS) methods aim at identifying molecules with a similar activity profile across phenotypic and macromolecular targets to that of a query molecule used as search template. VS using 3D similarity methods have the advantage of biasing this search toward active molecules with innovative chemical scaffolds, which are highly sought after in drug design to provide novel leads with improved properties over the query molecule (e.g. patentable, of lower toxicity or increased potency). Ultrafast Shape Recognition (USR) has demonstrated excellent performance in the discovery of molecules with previously-unknown phenotypic or target activity, with retrospective studies suggesting that its pharmacophoric extension (USRCAT) should obtain even better hit rates once it is used prospectively. Here we present USR-VS (http://usr.marseille.inserm.fr/), the first web server using these two validated ligand-based 3D methods for large-scale prospective VS. In about 2 s, 93.9 million 3D conformers, expanded from 23.1 million purchasable molecules, are screened and the 100 most similar molecules among them in terms of 3D shape and pharmacophoric properties are shown. USR-VS functionality also provides interactive visualization of the similarity of the query molecule against the hit molecules as well as vendor information to purchase selected hits in order to be experimentally tested.",
                "authors": [
                    {
                        "name": "Ballester P.J."
                    },
                    {
                        "name": "Leung K.-S."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Wong M.-H."
                    }
                ],
                "citationCount": 23,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "USR-VS: a web server for large-scale prospective virtual screening using ultrafast shape recognition techniques"
            },
            "pmid": "27106057"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
