{
    "additionDate": "2021-01-18T07:42:38Z",
    "biotoolsCURIE": "biotools:ssizer",
    "biotoolsID": "ssizer",
    "confidence_flag": "tool",
    "description": "Determining the Sample Sufficiency for Comparative Biological Study.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://idrblab.org/ssizer/",
    "lastUpdate": "2021-02-21T15:49:06Z",
    "name": "SSizer",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2020.01.027",
            "metadata": {
                "abstract": "© 2020 The Author(s)Comparative biological studies typically require plenty of samples to ensure full representation of the given problem. A frequently-encountered question is how many samples are sufficient for a particular study. This question is traditionally assessed using the statistical power, but it alone may not guarantee the full and reproducible discovery of features truly discriminating biological groups. Two new types of statistical criteria have thus been introduced to assess sample sufficiency from different perspectives by considering diagnostic accuracy and robustness. Due to the complementary nature of these criteria, a comprehensive evaluation based on all criteria is necessary for achieving a more accurate assessment. However, no such tool is available yet. Herein, an online tool SSizer (https://idrblab.org/ssizer/) was developed and validated to enable the assessment of the sample sufficiency for a user-input biological dataset, and three statistical criteria were adopted to achieve comprehensive and collective assessment. A sample simulation based on a user-input dataset was performed to expand the data and then determine the sample size required by the particular study. In sum, SSizer is unique for its ability to comprehensively evaluate whether the sample size is sufficient and determine the required number of samples for the user-input dataset, which, therefore, facilitates the comparative and OMIC-based biological studies.",
                "authors": [
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Tang J."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Luo Y."
                    },
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Xue W."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "He Q."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Zhu F."
                    }
                ],
                "citationCount": 14,
                "date": "2020-05-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "SSizer: Determining the Sample Sufficiency for Comparative Biological Study"
            },
            "pmid": "32044343"
        }
    ],
    "topic": [
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}