
{
    "credit": [
        {
            "name": "Inge Seim",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/sciseim"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Zoology",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Authors. Published by Wiley-VCH Verlag GmbH & Co. KGaA. High-throughput sequencing has revolutionised biology and medicine. Numerous genomes and transcriptome assemblies are now available, and these genomic data sets lend themselves to comparisons between species, strains, and other strata. Researchers often need to rapidly identify changes, in particular amino acid substitutions that could confer biological function in their system of interest. However, we are not aware of an easy-to-use tool that can be used to detect such changes, and researchers currently rely on idiosyncratic computer code. We present RadAA, a command-line tool which screens multiple sequence alignments for radical amino acid changes in a stratum/strata by classifying residues into groups by charge (with cysteine in its own group). RadAA is easy to use, even for researchers with little experience in computational biology. It can be run on most operating systems – including MacOS, Windows, and Linux – and integrated into high-performance computing environments. The RadAA source code and executable binaries are freely available at https://github.com/sciseim/RadAA.",
            "authors": [
                "Seim I.",
                "Baker A.M.",
                "Chopin L.K."
            ],
            "cit_count": 0,
            "doi": "10.1002/minf.201800057",
            "journal": "Molecular Informatics",
            "pmid": "30019526",
            "title": "RadAA: A Command-line Tool for Identification of Radical Amino Acid Changes in Multiple Sequence Alignments",
            "type": "Primary",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:RadAA",
        "biotoolsID": "RadAA",
        "description": "Identification of radical amino acid changes in multiple sequence alignments.",
        "homepage": "https://github.com/sciseim/RadAA",
        "name": "RadAA"
    }
}