{
    "name": "CCPROMISE", 
    "description": "Perform Canonical correlation between two forms of high demensional genetic data, and associate the first compoent of each form of data with a specific biologically interesting pattern of associations with multiple endpoints. A probe level analysis is also implemented.", 
    "homepage": "http://bioconductor.org/packages/release/bioc/html/CCPROMISE.html", 
    "biotoolsID": "ccpromise", 
    "biotoolsCURIE": "biotools:ccpromise", 
    "version": [
        "1.0.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Gene expression analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "GPL-2.0", 
    "collectionID": [
        "BioConductor"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://bioconductor/packages/release/bioc/src/contrib/CCPROMISE_1.0.0.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/CCPROMISE.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-016-1217-0", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "CC-PROMISE effectively integrates two forms of molecular data with multiple biologically related endpoints", 
                "abstract": "© 2016 The Author(s). Background: As new technologies allow investigators to collect multiple forms of molecular data (genomic, epigenomic, transcriptomic, etc) and multiple endpoints on a clinical trial cohort, it will become necessary to effectively integrate all these data in a way that reliably identifies biologically important genes. Methods: We introduce CC-PROMISE as an integrated data analysis method that combines components of canonical correlation (CC) and projection onto the most interesting evidence (PROMISE). For each gene, CC-PROMISE first uses CC to compute scores that represent the association of two forms of molecular data with each other. Next, these scores are substituted into PROMISE to evaluate the statistical evidence that the molecular data show a biologically meaningful relationship with the endpoints. Results: CC-PROMISE shows outstanding performance in simulation studies and an example application involving pediatric leukemia. In simulation studies, CC-PROMISE controls the type I error (misleading significance) rate very near the nominal level across 100 distinct null settings in which no molecular-endpoint association exists. Also, CC-PROMISE has better statistical power than three other methods that control type I error in 396 of 400 (99 %) alternative settings for which a molecular-endpoint association is present; the power advantage of CC-PROMISE exceeds 30 % in 127 of the 400 (32 %) alternative settings. These advantages of CC-PROMISE are also observed in an example application. Conclusion: CC-PROMISE very effectively identifies genes for which some form of molecular data shows a biologically meaningful association with multiple related endpoints. Availability: The R package CCPROMISE is currently available from www.stjuderesearch.org/site/depts/biostats/software.", 
                "date": "2016-10-06T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Cao X."
                    }, 
                    {
                        "name": "Crews K.R."
                    }, 
                    {
                        "name": "Downing J."
                    }, 
                    {
                        "name": "Lamba J."
                    }, 
                    {
                        "name": "Pounds S.B."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Xueyuan Cao", 
            "email": "xueyuan.cao@stjude.org", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bioconductor_import", 
    "additionDate": "2017-01-17T15:03:11Z", 
    "lastUpdate": "2018-12-10T12:58:50Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}