{
    "additionDate": "2021-01-18T10:31:48Z",
    "biotoolsCURIE": "biotools:yrbss",
    "biotoolsID": "yrbss",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jmunderwood@cdc.gov",
            "name": "J. Michael Underwood",
            "typeEntity": "Person"
        }
    ],
    "description": "Overview and Methods for the Youth Risk Behavior Surveillance System.\n\nThe Youth Risk Behavior Surveillance System (YRBSS) monitors six types of health-risk behaviors that contribute to the leading causes of death and disability among youth and adults, including behaviors that contribute to unintentional injuries and violence; sexual behaviors that contribute to unintended pregnancy and sexually transmitted disease, including HIV infection; alcohol and other drug use; tobacco; unhealthy dietary behaviors; inadequate physical activity. YRBSS also measures the prevalence of obesity and asthma among youth and young adults.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://www.cdc.gov/healthyyouth/data/yrbs/index.htm",
    "lastUpdate": "2021-03-18T14:11:40Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.cdc.gov/healthyyouth/data/yrbs/data.htm"
        },
        {
            "type": [
                "Helpdesk"
            ],
            "url": "https://www.cdc.gov/healthyyouth/data/yrbs/contact.htm"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://www.cdc.gov/healthyyouth/data/yrbs/participation.htm"
        }
    ],
    "name": "YRBSS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.15585/MMWR.SU6901A1",
            "metadata": {
                "abstract": "Health risk behaviors practiced during adolescence often persist into adulthood and contribute to the leading causes of morbidity and mortality in the United States. Youth health behavior data at the national, state, territorial, tribal, and local levels help monitor the effectiveness of public health interventions designed to promote adolescent health. The Youth Risk Behavior Surveillance System (YRBSS) is the largest public health surveillance system in the United States, monitoring a broad range of health-related behaviors among high school students. YRBSS includes a nationally representative Youth Risk Behavior Survey (YRBS) and separate state, local school district, territorial, and tribal school-based YRBSs. This overview report describes the surveillance system and the 2019 survey methodology, including sampling, data collection procedures, response rates, data processing, weighting, and analyses presented in this MMWR Supplement. A 2019 YRBS participation map, survey response rates, and student demographic characteristics are included. In 2019, a total of 78 YRBSs were administered to high school student populations across the United States (national and 44 states, 28 local school districts, three territories, and two tribal governments), the greatest number of participating sites with representative data since the surveillance system was established in 1991. The nine reports in this MMWR Supplement are based on national YRBS data collected during August 2018-June 2019. A full description of 2019 YRBS results and downloadable data are available (https://www.cdc.gov/healthyyouth/data/yrbs/index.htm).Efforts to improve YRBSS and related data are ongoing and include updating reliability testing for the national questionnaire, transitioning to electronic survey administration (e.g., pilot testing for a tablet platform), and exploring innovative analytic methods to stratify data by school-level socioeconomic status and geographic location. Stakeholders and public health practitioners can use YRBS data (comparable across national, state, tribal, territorial, and local jurisdictions) to estimate the prevalence of health-related behaviors among different student groups, identify student risk behaviors, monitor health behavior trends, guide public health interventions, and track progress toward national health objectives.",
                "authors": [
                    {
                        "name": "Underwood J.M."
                    },
                    {
                        "name": "Brener N."
                    },
                    {
                        "name": "Thornton J."
                    },
                    {
                        "name": "Harris W.A."
                    },
                    {
                        "name": "Bryan L.N."
                    },
                    {
                        "name": "Shanklin S.L."
                    },
                    {
                        "name": "Deputy N."
                    },
                    {
                        "name": "Roberts A.M."
                    },
                    {
                        "name": "Queen B."
                    },
                    {
                        "name": "Chyen D."
                    },
                    {
                        "name": "Whittle L."
                    },
                    {
                        "name": "Lim C."
                    },
                    {
                        "name": "Yamakawa Y."
                    },
                    {
                        "name": "Leon-Nguyen M."
                    },
                    {
                        "name": "Kilmer G."
                    },
                    {
                        "name": "Smith-Grant J."
                    },
                    {
                        "name": "Demissie Z."
                    },
                    {
                        "name": "Jones S.E."
                    },
                    {
                        "name": "Clayton H."
                    },
                    {
                        "name": "Dittus P."
                    }
                ],
                "citationCount": 20,
                "date": "2020-08-21T00:00:00Z",
                "journal": "MMWR supplements",
                "title": "Overview and Methods for the Youth Risk Behavior Surveillance System - United States, 2019"
            },
            "pmcid": "PMC7440204",
            "pmid": "32817611"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        }
    ]
}