{
    "additionDate": "2017-01-13T13:14:50Z",
    "biotoolsCURIE": "biotools:genomejack",
    "biotoolsID": "genomejack",
    "credit": [
        {
            "email": "MSSbio-sales@cbo.mss.co.jp",
            "name": "GenomeJack Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Genome browser specialized in next-generation sequencing data. Advantages are intuitive interface and smooth drag'n drop response.",
    "documentation": [
        {
            "type": "General",
            "url": "http://genomejack.net/english/gj_analysis.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://genomejack.net/english/gj_browser.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "maturity": "Mature",
    "name": "GenomeJack",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.4137/GRSB.S13204",
            "metadata": {
                "abstract": "Nuclear respiratory factor 1 (NRF1) serves as a transcription factor that activates the expression of a wide range of nuclear genes essential for mitochondrial biogenesis and function, including mitochondrial respiratory complex subunits, heme biosynthetic enzymes, and regulatory factors involved in the replication and transcription of mitochondrial DNA. Increasing evidence indicates that mitochondrial function is severely compromised in the brains of aging-related neurodegenerative diseases. To identify the comprehensive set of human NRF1 target genes potentially relevant to the pathogenesis of neurodegenerative diseases, we analyzed the NRF1 chromatin immunoprecipitation followed by deep sequencing (ChIP-Seq) dataset retrieved from the Encyclopedia of DNA Elements (ENCODE) project. Overall, we identifed 2,470 highly stringent ChIP-Seq peaks on protein-coding genes in SK-N-SH human neuroblastoma cells. They were accumulated in the proximal promoter regions with an existence of the NRF1-binding consensus sequence. The set of ChIP-Seq-based NRF1 target genes included known NRF1 targets such as EIF2S1, EIF2S2, CYCS, FMR1, FXR2, E2F6, CD47, and TOMM34. By pathway analysis, the molecules located in the core pathways related to mitochondrial respiratory function were determined to be highly enriched in NRF1 target genes. Furthermore, we found that NRF1 target genes play a pivotal role in regulation of extra-mitochondrial biological processes, including RNA metabolism, splicing, cell cycle, DNA damage repair, protein translation initiation, and ubiquitin-mediated protein degradation. We identifed a panel of neurodegenerative disease-related genes, such as PARK2 (Parkin), PARK6 (Pink1), PARK7 (DJ-1), and PAELR (GPR37) for Parkinson's disease, as well as PSENEN (Pen2) and MAPT (tau) for Alzheimer's disease, as previously unrecognized NRF1 targets. These results suggest a logical hypothesis that aberrant regulation of NRF1 and its targets might contribute to the pathogenesis of human neurodegenerative diseases via perturbation of diverse mitochondrial and extra-mitochondrial functions. © The author(s), publisher and licensee Libertas Academica Ltd.",
                "authors": [
                    {
                        "name": "Satoh J.-I."
                    },
                    {
                        "name": "Kawana N."
                    },
                    {
                        "name": "Yamamoto Y."
                    }
                ],
                "citationCount": 36,
                "date": "2013-11-04T00:00:00Z",
                "journal": "Gene Regulation and Systems Biology",
                "title": "Pathway Analysis of ChIP-Seq-Based NRF1 Target Genes Suggests a Logical Hypothesis of their Involvement in the pathogenesis of Neurodegenerative Diseases"
            },
            "type": "Other"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}