{
    "additionDate": "2018-08-06T04:57:46Z",
    "biotoolsCURIE": "biotools:stag-cns",
    "biotoolsID": "stag-cns",
    "credit": [
        {
            "email": "schnable@unl.edu",
            "name": "James C. Schnable",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "STAG-CNS can identify noncoding regulatory regions of a genome by simultaneously integrate the data from the promoters of conserved orthologous genes in three or more species.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/srbehera11/stag-cns/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome feature comparison",
                    "uri": "http://edamontology.org/operation_3194"
                }
            ]
        }
    ],
    "homepage": "https://github.com/srbehera11/stag-cns",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/srbehera11/stag-cns/issues"
        }
    ],
    "name": "STAG-CNS",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.molp.2017.05.010",
            "metadata": {
                "abstract": "© 2017 The Author One method for identifying noncoding regulatory regions of a genome is to quantify rates of divergence between related species, as functional sequence will generally diverge more slowly. Most approaches to identifying these conserved noncoding sequences (CNSs) based on alignment have had relatively large minimum sequence lengths (≥15 bp) compared with the average length of known transcription factor binding sites. To circumvent this constraint, STAG-CNS that can simultaneously integrate the data from the promoters of conserved orthologous genes in three or more species was developed. Using the data from up to six grass species made it possible to identify conserved sequences as short as 9 bp with false discovery rate ≤0.05. These CNSs exhibit greater overlap with open chromatin regions identified using DNase I hypersensitivity assays, and are enriched in the promoters of genes involved in transcriptional regulation. STAG-CNS was further employed to characterize loss of conserved noncoding sequences associated with retained duplicate genes from the ancient maize polyploidy. Genes with fewer retained CNSs show lower overall expression, although this bias is more apparent in samples of complex organ systems containing many cell types, suggesting that CNS loss may correspond to a reduced number of expression contexts rather than lower expression levels across the entire ancestral expression domain.",
                "authors": [
                    {
                        "name": "Lai X."
                    },
                    {
                        "name": "Behera S."
                    },
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Deogun J.S."
                    },
                    {
                        "name": "Schnable J.C."
                    }
                ],
                "citationCount": 3,
                "date": "2017-07-05T00:00:00Z",
                "journal": "Molecular Plant",
                "title": "STAG-CNS: An Order-Aware Conserved Noncoding Sequences Discovery Tool for Arbitrary Numbers of Species"
            },
            "pmid": "28602693",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}