{
    "additionDate": "2021-03-19T08:57:09Z",
    "biotoolsCURIE": "biotools:deepcys",
    "biotoolsID": "deepcys",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "banerjee.debi@hyderabad.bits-pilani.ac.in",
            "name": "Debashree Bandyopadhyay",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepCys is structure-based multiple cysteine function prediction method trained on deep neural network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metal-binding site prediction",
                    "uri": "http://edamontology.org/operation_3898"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://deepcys.herokuapp.com/",
    "lastUpdate": "2021-03-27T16:58:29Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/vam-sin/deepcys"
        }
    ],
    "name": "DeepCys",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/PROT.26056",
            "metadata": {
                "abstract": "© 2021 Wiley Periodicals LLCCysteine (Cys) is the most reactive amino acid participating in a wide range of biological functions. In-silico predictions complement the experiments to meet the need of functional characterization. Multiple Cys function prediction algorithm is scarce, in contrast to specific function prediction algorithms. Here we present a deep neural network-based multiple Cys function prediction, available on web-server (DeepCys) (https://deepcys.herokuapp.com/). DeepCys model was trained and tested on two independent datasets curated from protein crystal structures. This prediction method requires three inputs, namely, PDB identifier (ID), chain ID and residue ID for a given Cys and outputs the probabilities of four cysteine functions, namely, disulphide, metal-binding, thioether and sulphenylation and predicts the most probable Cys function. The algorithm exploits the local and global protein properties, like, sequence and secondary structure motifs, buried fractions, microenvironments and protein/enzyme class. DeepCys outperformed most of the multiple and specific Cys function algorithms. This method can predict maximum number of cysteine functions. Moreover, for the first time, explicitly predicts thioether function. This tool was used to elucidate the cysteine functions on domains of unknown functions belonging to cytochrome C oxidase subunit-II like transmembrane domains. Apart from the web-server, a standalone program is also available on GitHub (https://github.com/vam-sin/deepcys).",
                "authors": [
                    {
                        "name": "Bandyopadhyay D."
                    },
                    {
                        "name": "Bogam S."
                    },
                    {
                        "name": "Devarakonda H."
                    },
                    {
                        "name": "Nallapareddy V."
                    },
                    {
                        "name": "Paliwal S."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "DeepCys: Structure-based multiple cysteine function prediction method trained on deep neural network: Case study on domains of unknown functions belonging to COX2 domains"
            },
            "pmid": "33580578"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
