{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T19:58:10Z",
    "biotoolsCURIE": "biotools:interface-LncCASE",
    "biotoolsID": "interface-LncCASE",
    "confidence_flag": "tool",
    "description": "Identification and comprehensive characterization of lncRNAs with copy number variations and their driving transcriptional perturbed subpathways reveal functional significance for cancer.\n\nIn recent years, increasing evidence has suggested that aberrant long non-coding RNA (lncRNA) copy number variation may contribute to the onset of human cancers. LncRNAs function in variety of biological pathways and processes. Investigating the functions of lncRNAs are important in uncovering the mechanisms of tumorigenesis and progression of cancers. Here we identified lncRNAs related subpathways (sub-regions of pathways) throughout 14 cancer types for characterizing functions of 4115 lncRNAs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://bio-bigdata.hrbmu.edu.cn/LncCASE/",
    "lastUpdate": "2020-12-14T12:45:34Z",
    "name": "interface-LncCASE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ113",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Numerous studies have shown that copy number variation (CNV) in lncRNA regions play critical roles in the initiation and progression of cancer. However, our knowledge about their functionalities is still limited. Here, we firstly provided a computational method to identify lncRNAs with copy number variation (lncRNAs-CNV) and their driving transcriptional perturbed subpathways by integrating multidimensional omics data of cancer. The high reliability and accuracy of our method have been demonstrated. Then, the method was applied to 14 cancer types, and a comprehensive characterization and analysis was performed. LncRNAs-CNV had high specificity in cancers, and those with high CNV level may perturb broad biological functions. Some core subpathways and cancer hallmarks widely perturbed by lncRNAs-CNV were revealed. Moreover, subpathways highlighted the functional diversity of lncRNAs-CNV in various cancers. Survival analysis indicated that functional lncRNAs-CNV could be candidate prognostic biomarkers for clinical applications, such as ST7-AS1, CDKN2B-AS1 and EGFR-AS1. In addition, cascade responses and a functional crosstalk model among lncRNAs-CNV, impacted genes, driving subpathways and cancer hallmarks were proposed for understanding the driving mechanism of lncRNAs-CNV. Finally, we developed a user-friendly web interface-LncCASE (http://bio-bigdata.hrbmu.edu.cn/LncCASE/) for exploring lncRNAs-CNV and their driving subpathways in various cancer types. Our study identified and systematically characterized lncRNAs-CNV and their driving subpathways and presented valuable resources for investigating the functionalities of non-coding variations and the mechanisms of tumorigenesis.",
                "authors": [
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Dou Y."
                    },
                    {
                        "name": "Hu C."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Shang D."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wu T."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zheng X."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Identification and comprehensive characterization of lncRNAs with copy number variations and their driving transcriptional perturbed subpathways reveal functional significance for cancer"
            },
            "pmid": "31792500"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
