{
    "additionDate": "2021-01-18T11:44:28Z",
    "biotoolsCURIE": "biotools:acrhub",
    "biotoolsID": "acrhub",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jiawei.wang@monash.edu",
            "name": "Jiawei Wang",
            "typeEntity": "Person"
        },
        {
            "email": "trevor.lithgow@monash.edu",
            "name": "Trevor Lithgow",
            "typeEntity": "Person"
        }
    ],
    "description": "AcrHub is an integrative database to provide an all-in-one user-friendly solution for anti-CRISPR proteins (Acr) investigation, prediction, mapping and relationship analysis.\n\nBacteria and archaea have developed a wide variety of CRISPR-Cas systems to protect themselves from harmful mobile genetic elements (MGEs), such as phages and plasmids.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://pacrispr.erc.monash.edu/AcrHub/help.jsp"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "http://pacrispr.erc.monash.edu/AcrHub/download.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://pacrispr.erc.monash.edu/AcrHub/",
    "lastUpdate": "2021-01-21T12:43:13Z",
    "name": "AcrHub",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA951",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Anti-CRISPR (Acr) proteins naturally inhibit CRISPR-Cas adaptive immune systems across bacterial and archaeal domains of life. This emerging field has caused a paradigm shift in the way we think about the CRISPR-Cas system, and promises a number of useful applications from gene editing to phage therapy. As the number of verified and predicted Acrs rapidly expands, few online resources have been developed to deal with this wealth of information. To overcome this shortcoming, we developed AcrHub, an integrative database to provide an all-in-one solution for investigating, predicting and mapping Acr proteins. AcrHub catalogs 339 non-redundant experimentally validated Acrs and over 70 000 predicted Acrs extracted from genome sequence data from a diverse range of prokaryotic organisms and their viruses. It integrates state-of-the-art predictors to predict potential Acrs, and incorporates three analytical modules: similarity analysis, phylogenetic analysis and homology network analysis, to analyze their relationships with known Acrs. By interconnecting all modules as a platform, AcrHub presents enriched and in-depth analysis of known and potential Acrs and therefore provides new and exciting insights into the future of Acr discovery and validation. AcrHub is freely available at http://pacrispr.erc.monash.edu/AcrHub/.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Dai W."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Xie R."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Stubenrauch C."
                    },
                    {
                        "name": "Lithgow T."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AcrHub: An integrative hub for investigating, predicting and mapping anti-CRISPR proteins"
            },
            "pmid": "33137193"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}