{
    "additionDate": "2020-01-09T17:32:10Z",
    "biotoolsCURIE": "biotools:PmiREN",
    "biotoolsID": "PmiREN",
    "confidence_flag": "tool",
    "description": "a comprehensive encyclopedia of plant miRNAs.\n\nPmiREN (Plant miRNA ENcyclopedia) is a comprehensive functional plant miRNA database. In current version, PmiREN contains 20388 miRNA loci (MIRs) belonging to 5757 families, 1365 clusters, 1668 syntenic blocks and 141327 predicted miRNA-target pairs in 88 species phylogenetically ranging from chlorophytes to angiosperms. In addition, 1537 deeply sequenced small RNA libraries were used in quantification of miRNA expression patterns, and 116 PARE-Seq libraries were employed to validate predicted miRNA-target pairs. PmiREN has many unique features such as annotating miRNAs with an uniform method, solid and extensive information on miRNA synteny, conservation, expression, references, and providing many convenient data accesses, powerful search and download engines. We believe PmiREN is a truly functional knowledgebase and will provide novel insights into plant miRNA research and benefit the whole research community",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://www.pmiren.com/",
    "lastUpdate": "2020-12-05T12:45:28.539530Z",
    "name": "PmiREN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ894",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.MicroRNAs (miRNAs) are small non-coding RNA molecules that function as diverse endogenous gene regulators at the post-transcriptional level. In the past two decades, as research effort on miRNA identification, function and evolution has soared, so has the demand for miRNA databases. However, the current plant miRNA databases suffer from several typical drawbacks, including a lack of entries for many important species, uneven annotation standards across different species, abundant questionable entries, and limited annotation. To address these issues, we developed a knowledge-based database called Plant miRNA Encyclopedia (PmiREN, http://www.pmiren.com/), which was based on uniform processing of sequenced small RNA libraries using miRDeep-P2, followed by manual curation using newly updated plant miRNA identification criteria, and comprehensive annotation. PmiREN currently contains 16,422 high confidence novel miRNA loci in 88 plant species and 3,966 retrieved from miRBase. For every miRNA entry, information on precursor sequence, precursor secondary structure, expression pattern, clusters and synteny in the genome, potential targets supported by Parallel Analysis of RNA Ends (PARE) sequencing, and references is attached whenever possible. PmiREN is hierarchically accessible and has eight built-in search engines. We believe PmiREN is useful for plant miRNA cataloguing and data mining, therefore a resource for data-driven miRNA research in plants.",
                "authors": [
                    {
                        "name": "Guo Z."
                    },
                    {
                        "name": "Kuang Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhao Y."
                    },
                    {
                        "name": "Tao Y."
                    },
                    {
                        "name": "Cheng C."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Hao C."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Wei J."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Yang X."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PmiREN: A comprehensive encyclopedia of plant miRNAs"
            },
            "pmid": "31602478"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}