{
    "additionDate": "2020-01-14T20:00:35Z",
    "biotoolsCURIE": "biotools:BacHBerryEXP",
    "biotoolsID": "BacHBerryEXP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vera.thole@jic.ac.uk",
            "name": "Vera Thole",
            "orcidid": "https://orcid.org/0000-0002-9531-973X",
            "typeEntity": "Person"
        }
    ],
    "description": "A gene Expression Browser for RNA-seq, de novo transcriptome assembly and flavonoid gene analysis in 13 wild and cultivated berry fruit species with high content of phenolics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "http://www.bachberryexp.com",
    "lastUpdate": "2021-01-14T16:23:11Z",
    "name": "BacHBerryEXP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6183-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Flavonoids are produced in all flowering plants in a wide range of tissues including in berry fruits. These compounds are of considerable interest for their biological activities, health benefits and potential pharmacological applications. However, transcriptomic and genomic resources for wild and cultivated berry fruit species are often limited, despite their value in underpinning the in-depth study of metabolic pathways, fruit ripening as well as in the identification of genotypes rich in bioactive compounds. Results: To access the genetic diversity of wild and cultivated berry fruit species that accumulate high levels of phenolic compounds in their fleshy berry(-like) fruits, we selected 13 species from Europe, South America and Asia representing eight genera, seven families and seven orders within three clades of the kingdom Plantae. RNA from either ripe fruits (ten species) or three ripening stages (two species) as well as leaf RNA (one species) were used to construct, assemble and analyse de novo transcriptomes. The transcriptome sequences are deposited in the BacHBerryGEN database (http://jicbio.nbi.ac.uk/berries) and were used, as a proof of concept, via its BLAST portal (http://jicbio.nbi.ac.uk/berries/blast.html) to identify candidate genes involved in the biosynthesis of phenylpropanoid compounds. Genes encoding regulatory proteins of the anthocyanin biosynthetic pathway (MYB and basic helix-loop-helix (bHLH) transcription factors and WD40 repeat proteins) were isolated using the transcriptomic resources of wild blackberry (Rubus genevieri) and cultivated red raspberry (Rubus idaeus cv. Prestige) and were shown to activate anthocyanin synthesis in Nicotiana benthamiana. Expression patterns of candidate flavonoid gene transcripts were also studied across three fruit developmental stages via the BacHBerryEXP gene expression browser (http://www.bachberryexp.com) in R. genevieri and R. idaeus cv. Prestige. Conclusions: We report a transcriptome resource that includes data for a wide range of berry(-like) fruit species that has been developed for gene identification and functional analysis to assist in berry fruit improvement. These resources will enable investigations of metabolic processes in berries beyond the phenylpropanoid biosynthetic pathway analysed in this study. The RNA-seq data will be useful for studies of berry fruit development and to select wild plant species useful for plant breeding purposes.",
                "authors": [
                    {
                        "name": "Banados P."
                    },
                    {
                        "name": "Bassard J.-E."
                    },
                    {
                        "name": "Breitel D."
                    },
                    {
                        "name": "Foito A."
                    },
                    {
                        "name": "Freitag S."
                    },
                    {
                        "name": "Ghasemi Afshar B."
                    },
                    {
                        "name": "Hill L."
                    },
                    {
                        "name": "Martin C."
                    },
                    {
                        "name": "Menezes R."
                    },
                    {
                        "name": "Naesby M."
                    },
                    {
                        "name": "Nunes Dos Santos C."
                    },
                    {
                        "name": "Ramirez-Gonzalez R."
                    },
                    {
                        "name": "Shelenga T."
                    },
                    {
                        "name": "Shepherd L."
                    },
                    {
                        "name": "Sorokin A."
                    },
                    {
                        "name": "Stewart D."
                    },
                    {
                        "name": "Thole V."
                    },
                    {
                        "name": "Tikhonova O."
                    },
                    {
                        "name": "Trick M."
                    },
                    {
                        "name": "Vain P."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 8,
                "date": "2019-12-19T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "RNA-seq, de novo transcriptome assembly and flavonoid gene analysis in 13 wild and cultivated berry fruit species with high content of phenolics"
            },
            "pmcid": "PMC6924045",
            "pmid": "31856735"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
