{"credit":[],"function":[{"operation":[{"term":"Sequence trimming","uri":"http://edamontology.org/operation_3192"},{"term":"Parsing","uri":"http://edamontology.org/operation_1812"},{"term":"Virulence prediction","uri":"http://edamontology.org/operation_3461"}]}],"labels":{"language":["R","Shell"],"topic":[{"term":"Mobile genetic elements","uri":"http://edamontology.org/topic_0798"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Laboratory animal science","uri":"http://edamontology.org/topic_3386"}]},"publication":[{"abstract":"© Springer Science+Business Media, LLC, part of Springer Nature 2020.Transposon sequencing (Tn-seq) is a powerful genetic tool that enables the detection of essential genes within a given environment. The application of Tn-seq to Staphylococcus aureus has generated transposon libraries in numerous strains with inactivation of virtually every nonessential gene in the genome. This exciting technology coupled with increasingly available computational tools has been deployed in animal models of infection to identify essential S. aureus genes within specific host environments. In this chapter, we describe the application of Tn-seq to a murine model of osteomyelitis as a paradigm for using this powerful technology to elucidate mechanisms of bacterial pathogenesis.","authors":["Peek C.T.","Ibberson C.B.","Cassat J.E."],"cit_count":0,"doi":"10.1007/978-1-4939-9849-4_12","journal":"Methods in Molecular Biology","pmid":"31523773","title":"Identification of virulence determinants during host-pathogen interaction using tn-seq technology","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:Tn-seq","biotoolsID":"Tn-seq","description":"> LOW CONFIDENCE! | Identification of Virulence Determinants During Host-Pathogen Interaction Using Tn-Seq Technology | Scripts for analyzing transposon sequencing data used by the Whiteley lab | Custom scripts for analyzing (parsing, mapping, and tallying) Tn-seq reads and determining differentially abundant transposon insertion mutants | The scripts contained herein can be used to automatically analyze high-throughput (Illumina) sequencing reads derived from transposon-genome junctions","homepage":"https://github.com/WhiteleyLab/Tn-seq","name":"Tn-seq"}}