{
    "additionDate": "2017-02-10T14:15:10Z",
    "biotoolsCURIE": "biotools:rosettadesign",
    "biotoolsID": "rosettadesign",
    "credit": [
        {
            "email": "bkuhlman@email.unc.edu",
            "name": "Brian Kuhlman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RosettaDesign identifies low energy sequences for specified protein three dimensional (3D) structures and can been used to predict stable side chain conformations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rosettadesign.med.unc.edu/documentation.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling (side chains)",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://rosettadesign.med.unc.edu",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "RosettaDesign",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A fundamental test of our current understanding of protein folding is to rationally redesign protein folding pathways. We use a computer-based design strategy to switch the folding pathway of protein G, which normally involves formation of the second, but not the first, β-turn at the rate limiting step in folding. Backbone conformations and amino acid sequences that maximize the interaction density in the first β-hairpin were identified, and two variants containing 11 amino acid replacements were found to be ∼4 kcal mol-1 more stable than wild type protein G. Kinetic studies show that the redesigned proteins fold ∼100x faster than wild type protein and that the first β-turn is formed and the second disrupted at the rate limiting step in folding.",
                "authors": [
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Kuhlman B."
                    },
                    {
                        "name": "Nauli S."
                    }
                ],
                "citationCount": 192,
                "date": "2001-07-16T00:00:00Z",
                "journal": "Nature Structural Biology",
                "title": "Computer-based redesign of a protein folding pathway"
            },
            "pmid": "11427890"
        },
        {
            "metadata": {
                "abstract": "A major challenge of computational protein design is the creation of novel proteins with arbitrarily chosen three-dimensional structures. Here, we used a general computational strategy that iterates between sequence design and structure prediction to design a 93-residue α/β protein called Top7 with a novel sequence and topology. Top7 was found experimentally to be folded and extremely stable, and the x-ray crystal structure of Top7 is similar (root mean square deviation equals 1.2 angstroms) to the design model. The ability to design a new protein fold makes possible the exploration of the large regions of the protein universe not yet observed in nature.",
                "authors": [
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Dantas G."
                    },
                    {
                        "name": "Ireton G.C."
                    },
                    {
                        "name": "Kuhlman B."
                    },
                    {
                        "name": "Stoddard B.L."
                    },
                    {
                        "name": "Varani G."
                    }
                ],
                "citationCount": 1152,
                "date": "2003-11-21T00:00:00Z",
                "journal": "Science",
                "title": "Design of a Novel Globular Protein Fold with Atomic-Level Accuracy"
            },
            "pmid": "14631033"
        },
        {
            "metadata": {
                "abstract": "A previously developed computer program for protein design, RosettaDesign, was used to predict low free energy sequences for nine naturally occurring protein backbones. RosettaDesign had no knowledge of the naturally occurring sequences and on average 65% of the residues in the designed sequences differ from wild-type. Synthetic genes for ten completely redesigned proteins were generated, and the proteins were expressed, purified, and then characterized using circular dichroism, chemical and temperature denaturation and NMR experiments. Although high-resolution structures have not yet been determined, eight of these proteins appear to be folded and their circular dichroism spectra are similar to those of their wild-type counterparts. Six of the proteins have stabilities equal to or up to 7kcal/mol greater than their wild-type counterparts, and four of the proteins have NMR spectra consistent with a well-packed, rigid structure. These encouraging results indicate that the computational protein design methods can, with significant reliability, identify amino acid sequences compatible with a target protein backbone. © 2003 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Callender D."
                    },
                    {
                        "name": "Dantas G."
                    },
                    {
                        "name": "Kuhlman B."
                    },
                    {
                        "name": "Wong M."
                    }
                ],
                "citationCount": 241,
                "date": "2003-09-12T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "A large scale test of computational protein design: Folding and stability of nine completely redesigned globular proteins"
            },
            "pmid": "12948494"
        },
        {
            "metadata": {
                "abstract": "How large is the volume of sequence space that is compatible with a given protein structure? Starting from random sequences, low free energy sequences were generated for 108 protein backbone structures by using a Monte Carlo optimization procedure and a free energy function based primarily on Lennard-Jones packing interactions and the Lazaridis-Karplus implicit solvation model. Remarkably, in the designed sequences 51% of the core residues and 27% of all residues were identical to the amino acids in the corresponding positions in the native sequences. The lowest free energy sequences obtained for ensembles of native-like backbone structures were also similar to the native sequence. Furthermore, both the individual residue frequencies and the covariances between pairs of positions observed in the very large SH3 domain family were recapitulated in core sequences designed for SH3 domain structures. Taken together, these results suggest that the volume of sequence space optimal for a protein structure is surprisingly restricted to a region around the native sequence.",
                "authors": [
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Kuhlman B."
                    }
                ],
                "citationCount": 633,
                "date": "2000-09-12T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Native protein sequences are close to optimal for their structures"
            },
            "pmid": "10984534"
        },
        {
            "metadata": {
                "abstract": "Protein L consists of a single α-helix packed on a four-stranded β-sheet formed by two symmetrically opposed β-hairpins. We use a computer-based protein design procedure to stabilize a domain-swapped dimer of protein L in which the second β-turn straightens and the C-terminal strand inserts into the β-sheet of the partner. The designed obligate dimer contains three mutations (A52V, N53P, and G55A) and has a dissociation constant of ≈700 pM, which is comparable to the dissociation constant of many naturally occurring protein dimers. The structure of the dimer has been determined by x-ray crystallography and is close to the in silico model.",
                "authors": [
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Kim D.E."
                    },
                    {
                        "name": "Kuhlman B."
                    },
                    {
                        "name": "O'Neill J.W."
                    },
                    {
                        "name": "Zhang K.Y.J."
                    }
                ],
                "citationCount": 63,
                "date": "2001-09-11T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Conversion of monomeric protein L to an obligate dimer by computational protein design"
            },
            "pmid": "11526208"
        },
        {
            "metadata": {
                "abstract": "The Rosetta Design server identifies low energy amino acid sequences for target protein structures (http://rosettadesign.med.unc.edu). The client provides the backbone coordinates of the target structure and specifies which residues to design. The server returns to the client the sequences, coordinates and energies of the designed proteins. The simulations are performed using the design module of the Rosetta program (RosettaDesign). RosettaDesign uses Monte Carlo optimization with simulated annealing to search for amino acids that pack well on the target structure and satisfy hydrogen bonding potential. RosettaDesign has been experimentally validated and has been used previously to stabilize naturally occurring proteins and design a novel protein structure. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Kuhlman B."
                    },
                    {
                        "name": "Liu Y."
                    }
                ],
                "citationCount": 148,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RosettaDesign server for protein design"
            },
            "pmid": "16845000"
        },
        {
            "metadata": {
                "abstract": "The rational design of loops and turns is a key step towards creating proteins with new functions. We used a computational design procedure to create new backbone conformations in the second turn of protein L. The Protein Data Bank was searched for alternative turn conformations, and sequences optimal for these turns in the context of protein L were identified using a Monte Carlo search procedure and an energy function that favors close packing. Two variants containing 12 and 14 mutations were found to be as stable as wild-type protein L. The crystal structure of one of the variants has been solved at a resolution of 1.9 Å, and the backbone conformation in the second turn is remarkably close to that of the in silico model (1.1 Å RMSD) while it differs significantly from that of wild-type protein L (the turn residues are displaced by an average of 7.2 Å). The folding rates of the redesigned proteins are greater than that of the wild-type protein and in contrast to wild-type protein L the second β-turn appears to be formed at the rate limiting step in folding. © 2002 Academic Press.",
                "authors": [
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Kim D.E."
                    },
                    {
                        "name": "Kuhlman B."
                    },
                    {
                        "name": "O'Neill J.W."
                    },
                    {
                        "name": "Zhang K.Y.J."
                    }
                ],
                "citationCount": 66,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Accurate computer-based design of a new backbone conformation in the second turn of protein L"
            },
            "pmid": "11786026"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
