{
    "accessibility": "Open access",
    "additionDate": "2022-09-28T12:03:29.999149Z",
    "biotoolsCURIE": "biotools:synthstrip",
    "biotoolsID": "synthstrip",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Adrian V. Dalca"
        },
        {
            "name": "Andrew Hoopes"
        },
        {
            "name": "Bruce Fischl"
        },
        {
            "name": "Jocelyn S. Mora"
        },
        {
            "name": "Malte Hoffmann",
            "orcidid": "https://orcid.org/0000-0002-5511-0739"
        }
    ],
    "description": "The removal of non-brain signal from magnetic resonance imaging (MRI) data, known as skull-stripping, is an integral component of many neuroimage analysis streams. Despite their abundance, popular classical skull-stripping methods are usually tailored to images with specific acquisition properties, namely near-isotropic resolution and T1-weighted (T1w) MRI contrast, which are prevalent in research settings. As a result, existing tools tend to adapt poorly to other image types, such as stacks of thick slices acquired with fast spin-echo (FSE) MRI that are common in the clinic. While learning-based approaches for brain extraction have gained traction in recent years, these methods face a similar burden, as they are only effective for image types seen during the training procedure. To achieve robust skull-stripping across a landscape of imaging protocols, we introduce SynthStrip, a rapid, learning-based brain-extraction tool",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://w3id.org/synthstrip",
    "lastUpdate": "2024-11-24T15:34:29.995266Z",
    "name": "SynthStrip",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2022.119474",
            "metadata": {
                "abstract": "The removal of non-brain signal from magnetic resonance imaging (MRI) data, known as skull-stripping, is an integral component of many neuroimage analysis streams. Despite their abundance, popular classical skull-stripping methods are usually tailored to images with specific acquisition properties, namely near-isotropic resolution and T1-weighted (T1w) MRI contrast, which are prevalent in research settings. As a result, existing tools tend to adapt poorly to other image types, such as stacks of thick slices acquired with fast spin-echo (FSE) MRI that are common in the clinic. While learning-based approaches for brain extraction have gained traction in recent years, these methods face a similar burden, as they are only effective for image types seen during the training procedure. To achieve robust skull-stripping across a landscape of imaging protocols, we introduce SynthStrip, a rapid, learning-based brain-extraction tool. By leveraging anatomical segmentations to generate an entirely synthetic training dataset with anatomies, intensity distributions, and artifacts that far exceed the realistic range of medical images, SynthStrip learns to successfully generalize to a variety of real acquired brain images, removing the need for training data with target contrasts. We demonstrate the efficacy of SynthStrip for a diverse set of image acquisitions and resolutions across subject populations, ranging from newborn to adult. We show substantial improvements in accuracy over popular skull-stripping baselines – all with a single trained model. Our method and labeled evaluation data are available at https://w3id.org/synthstrip.",
                "authors": [
                    {
                        "name": "Dalca A.V."
                    },
                    {
                        "name": "Fischl B."
                    },
                    {
                        "name": "Hoffmann M."
                    },
                    {
                        "name": "Hoopes A."
                    },
                    {
                        "name": "Mora J.S."
                    }
                ],
                "citationCount": 92,
                "date": "2022-10-15T00:00:00Z",
                "journal": "NeuroImage",
                "title": "SynthStrip: skull-stripping for any brain image"
            },
            "pmcid": "PMC9465771",
            "pmid": "35842095"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
