{
    "name": "VOMBAT", 
    "description": "Predict transcription factor binding sites (TFBS) and other motifs in sequence data based on Variable Order Markov models and variable order Bayesian Trees.", 
    "homepage": "https://www2.informatik.uni-halle.de:8443/VOMBAT/faces/pages/choose.jsp", 
    "biotoolsID": "vombat", 
    "biotoolsCURIE": "biotools:vombat", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0445", 
                    "term": "Transcription factor binding site prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2575", 
                    "term": "Protein binding site prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0438", 
                    "term": "Regulatory element prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0438", 
                    "term": "Transcriptional regulatory element prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0749", 
            "term": "Transcription factors and regulatory sites"
        }, 
        {
            "uri": "http://edamontology.org/topic_3511", 
            "term": "Nucleic acid sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_0160", 
            "term": "Sequence sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_3125", 
            "term": "DNA binding sites"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15797905", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Identification of transcription factor binding sites with variable-order Bayesian networks", 
                "abstract": "Motivation: We propose a new class of variable-order Bayesian network (VOBN) models for the identification of transcription factor binding sites (TFBSs). The proposed models generalize the widely used position weight matrix (PWM) models, Markov models and Bayesian network models. In contrast to these models, where for each position a fixed subset of the remaining positions is used to model dependencies, in VOBN models, these subsets may vary based on the specific nucleotides observed, which are called the context. This flexibility turns out to be of advantage for the classification and analysis of TFBSs, as statistical dependencies between nucleotides in different TFBS positions (not necessarily adjacent) may be taken into account efficiently - in a position-specific and context-specific manner. Results: We apply the VOBN model to a set of 238 experimentally verified sigma-70 binding sites in Escherichia coli. We find that the VOBN model can distinguish these 238 sites from a set of 472 intergenic 'non-promoter' sequences with a higher accuracy than fixed-order Markov models or Bayesian trees. We use a replicated stratified-holdout experiment having a fixed true-negative rate of 99.9%. We find that for a foreground inhomogeneous VOBN model of order 1 and a background homogeneous variable-order Markov (VOM) model of order 5, the obtained mean true-positive (TP) rate is 47.56%. In comparison, the best TP rate for the conventional models is 44.39%, obtained from a foreground PWM model and a background 2nd-order Markov model. As the standard deviation of the estimated TP rate is ≃0.01%, this improvement is highly significant. © The Author 2005. Published by Oxford University Press. All rights reserved.", 
                "date": "2005-06-01T00:00:00Z", 
                "citationCount": 109, 
                "authors": [
                    {
                        "name": "Ben-Gal I."
                    }, 
                    {
                        "name": "Shani A."
                    }, 
                    {
                        "name": "Gohr A."
                    }, 
                    {
                        "name": "Grau J."
                    }, 
                    {
                        "name": "Arviv S."
                    }, 
                    {
                        "name": "Shmilovici A."
                    }, 
                    {
                        "name": "Posch S."
                    }, 
                    {
                        "name": "Grosse I."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16845064", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "VOMBAT: Prediction of transcription factor binding sites using variable order Bayesian trees", 
                "abstract": "Variable order Markov models and variable order Bayesian trees have been proposed for the recognition of transcription factor binding sites, and it could be demonstrated that they outperform traditional models, such as position weight matrices, Markov models and Bayesian trees. We develop a web server for the recognition of DNA binding sites based on variable order Markov models and variable order Bayesian trees offering the following functionality: (i) given datasets with annotated binding sites and genomic background sequences, variable order Markov models and variable order Bayesian trees can be trained; (ii) given a set of trained models, putative DNA binding sites can be predicted in a given set of genomic sequences and (iii) given a dataset with annotated binding sites and a dataset with genomic background sequences, cross-validation experiments for different model combinations with different parameter settings can be performed. Several of the offered services are computationally demanding, such as genome-wide predictions of DNA binding sites in mammalian genomes or sets of 104-fold cross-validation experiments for different model combinations based on problem-specific data sets. In order to execute these jobs, and in order to serve multiple users at the same time, the web server is attached to a Linux cluster with 150 processors. VOMBAT is available at http://pdw-24.ipk-gatersleben.de:8080/VOMBAT/. © 2006 The Author(s).", 
                "date": "2006-07-01T00:00:00Z", 
                "citationCount": 7, 
                "authors": [
                    {
                        "name": "Grau J."
                    }, 
                    {
                        "name": "Ben-Gal I."
                    }, 
                    {
                        "name": "Posch S."
                    }, 
                    {
                        "name": "Grosse I."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:14:24Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}