
{
    "credit": [
        {
            "email": "leideng@csu.edu.cn",
            "name": "Lei Deng",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Residue interaction calculation",
                    "uri": "http://edamontology.org/operation_0248"
                }
            ]
        }
    ],
    "labels": {
        "license": "Other",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: RNA binding proteins play important roles in post-transcriptional RNA processing and transcriptional regulation. Distinguishing the RNA-binding residues in proteins is crucial for understanding how protein and RNA recognize each other and function together as a complex. Results: We propose PredRBR, an effectively computational approach to predict RNA-binding residues. PredRBR is built with gradient tree boosting and an optimal feature set selected from a large number of sequence and structure characteristics and two categories of structural neighborhood properties. In cross-validation experiments on the RBP170 data set show that PredRBR achieves an overall accuracy of 0.84, a sensitivity of 0.85, MCC of 0.55 and AUC of 0.92, which are significantly better than that of other widely used machine learning algorithms such as Support Vector Machine, Random Forest, and Adaboost. We further calculate the feature importance of different feature categories and find that structural neighborhood characteristics are critical in the recognization of RNA binding residues. Also, PredRBR yields significantly better prediction accuracy on an independent test set (RBP101) in comparison with other state-of-the-art methods. Conclusions: The superior performance over existing RNA-binding residue prediction methods indicates the importance of the gradient tree boosting algorithm combined with the optimal selected features.",
            "authors": [
                "Tang Y.",
                "Liu D.",
                "Wang Z.",
                "Wen T.",
                "Deng L."
            ],
            "cit_count": 6,
            "doi": "10.1186/s12859-017-1879-2",
            "journal": "BMC Bioinformatics",
            "title": "A boosting approach for prediction of protein-RNA binding residues",
            "type": "Primary",
            "year": "2017-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:predrbr",
        "biotoolsID": "predrbr",
        "description": "Computational method for Protein-RNA binding site prediction.",
        "homepage": "http://denglab.org/PredRBR/",
        "name": "PredRBR"
    }
}