{
    "additionDate": "2018-07-13T18:06:51Z",
    "biotoolsCURIE": "biotools:bcbtoolkit",
    "biotoolsID": "bcbtoolkit",
    "credit": [
        {
            "email": "michel.thiebaut@gmail.com",
            "name": "Michel Thiebaut de Schotten",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Aims to provide the scientific community with the several tools to indirectly assess brain disconnections.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://toolkit.bcblab.com/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://toolkit.bcblab.com/",
    "language": [
        "Java",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:36:14.041890Z",
    "license": "BSD-3-Clause",
    "name": "BCBtoolkit",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015519"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gigascience/giy004",
            "metadata": {
                "abstract": "Background: Patients with brain lesions provide a unique opportunity to understand the functioning of the human mind. However, even when focal, brain lesions have local and remote effects that impact functionally and structurally connected circuits. Similarly, function emerges from the interaction between brain areas rather than their sole activity. For instance, category fluency requires the associations between executive, semantic, and language production functions. Findings: Here, we provide, for the first time, a set of complementary solutions for measuring the impact of a given lesion on the neuronal circuits. Our methods, which were applied to 37 patients with a focal frontal brain lesions, revealed a large set of directly and indirectly disconnected brain regions that had significantly impacted category fluency performance. The directly disconnected regions corresponded to areas that are classically considered as functionally engaged in verbal fluency and categorization tasks. These regions were also organized into larger directly and indirectly disconnected functional networks, including the left ventral fronto-parietal network, whose cortical thickness correlated with performance on category fluency. Conclusions: The combination of structural and functional connectivity together with cortical thickness estimates reveal the remote effects of brain lesions, provide for the identification of the affected networks, and strengthen our understanding of their relationship with cognitive and behavioral measures. The methods presented are available and freely accessible in the BCBtoolkit as supplementary software [1].",
                "authors": [
                    {
                        "name": "Cerliani L."
                    },
                    {
                        "name": "Foulon C."
                    },
                    {
                        "name": "Kinkingnehun S."
                    },
                    {
                        "name": "Levy R."
                    },
                    {
                        "name": "Rosso C."
                    },
                    {
                        "name": "Urbanski M."
                    },
                    {
                        "name": "Volle E."
                    },
                    {
                        "name": "de Schotten M.T."
                    }
                ],
                "citationCount": 223,
                "date": "2018-03-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Advanced lesion symptom mapping analyses and implementation as BCBtoolkit"
            },
            "pmcid": "PMC5863218",
            "pmid": "29432527"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1
}
