{
    "additionDate": "2022-08-01T11:30:48.709178Z",
    "biotoolsCURIE": "biotools:drugcvar",
    "biotoolsID": "drugcvar",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Xiaolong Zhang"
        },
        {
            "name": "Ze-Xian Liu"
        }
    ],
    "description": "A platform for evidence-based drug annotation for genetic variants in cancer",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://drugcvar.omicsbio.info",
    "lastUpdate": "2024-11-24T15:51:13.981232Z",
    "license": "Not licensed",
    "name": "DrugCVar",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac273",
            "metadata": {
                "abstract": "Motivation: Targeted therapy for cancer-related genetic variants is critical for precision medicine. Although several databases including The Clinical Interpretation of Variants in Cancer (CIViC), The Oncology Knowledge Base (OncoKB), The Cancer Genome Interpreter (CGI) and My Cancer Genome (MCG) provide clinical interpretations of variants in cancer, the clinical evidence was limited and miscellaneous. In this study, we developed the DrugCVar database, which integrated our manually curated cancer variant–drug targeting evidence from literature and the interpretations from the public resources. Results: In total, 7830 clinical evidences for cancer variant–drug targeting were integrated and classified into 10 evidence tiers. Searching and browsing functions were provided for quick queries of cancer variant–drug targeting evidence. Also, batch annotation module was developed for user-provided massive genetic variants in various formats. Details, such as the mutation function, location of the variants in gene and protein structures and mutation statistics of queried genes in various tumor types, were also provided for further investigations. Thus, DrugCVar could serve as a comprehensive annotation tool to interpret potential drugs for cancer variants especially the massive ones from clinical cancer genomics studies. Availability and implementation: The database is available at http://drugcvar.omicsbio.info.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Liu Z.-X."
                    },
                    {
                        "name": "Qian Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yu K."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "citationCount": 1,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DrugCVar: a platform for evidence-based drug annotation for genetic variants in cancer"
            },
            "pmid": "35426945"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
