{
    "additionDate": "2017-01-17T15:07:50Z",
    "biotoolsCURIE": "biotools:fasttree",
    "biotoolsID": "fasttree",
    "collectionID": [
        "EBI Training Tools"
    ],
    "credit": [
        {
            "email": "fasttree@microbesonline.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Infers approximately-maximum-likelihood phylogenetic trees from alignments of nucleotide or protein sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.microbesonline.org/fasttree/#How"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ",
            "ardeleanadriandvm"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ]
        }
    ],
    "homepage": "https://www.microbesonline.org/fasttree/",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-24T14:34:57.624784Z",
    "name": "FastTree",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "ebi_training_import",
    "publication": [
        {
            "doi": "10.1093/molbev/msp077",
            "metadata": {
                "abstract": "Gene families are growing rapidly, but standard methods for inferring phylogenies do not scale to alignments with over 10,000 sequences. We present FastTree, a method for constructing large phylogenies and for estimating their reliability. Instead of storing a distance matrix, FastTree stores sequence profiles of internal nodes in the tree. FastTree uses these profiles to implement Neighbor-Joining and uses heuristics to quickly identify candidate joins. FastTree then uses nearest neighbor interchanges to reduce the length of the tree. For an alignment with N sequences, L sites, and a different characters, a distance matrix requires O(N 2) space and O(N 2L) time, but FastTree requires just O(NLa + N) memory and O(Nlog (N)La) time. To estimate the tree's reliability, FastTree uses local bootstrapping, which gives another 100-fold speedup over a distance matrix. For example, FastTree computed a tree and support values for 158,022 distinct 16S ribosomal RNAs in 17 h and 2.4 GB of memory. Just computing pairwise Jukes-Cantor distances and storing them, without inferring a tree or bootstrapping, would require 17 h and 50 GB of memory. In simulations, FastTree was slightly more accurate than Neighbor-Joining, BIONJ, or FastME; on genuine alignments, FastTree's topologies had higher likelihoods. FastTree is available at http://microbesonline.org/fasttree. 2009 The Authors2009This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/2.0/uk/) which permits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited. © 2009 The Authors.",
                "authors": [
                    {
                        "name": "Arkin A.P."
                    },
                    {
                        "name": "Dehal P.S."
                    },
                    {
                        "name": "Price M.N."
                    }
                ],
                "citationCount": 3611,
                "date": "2009-07-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Fasttree: Computing large minimum evolution trees with profiles instead of a distance matrix"
            },
            "pmcid": "PMC2693737",
            "pmid": "19377059"
        },
        {
            "doi": "10.1371/journal.pone.0009490",
            "metadata": {
                "abstract": "Background: We recently described FastTree, a tool for inferring phylogenies for alignments with up to hundreds of thousands of sequences. Here, we describe improvements to FastTree that improve its accuracy without sacrificing scalability. Methodology/Principal Findings: Where FastTree 1 used nearest-neighbor interchanges (NNIs) and the minimum-evolution criterion to improve the tree, FastTree 2 adds minimum-evolution subtree-pruning-regrafting (SPRs) and maximum-likelihood NNIs. FastTree 2 uses heuristics to restrict the search for better trees and estimates a rate of evolution for each site (the \"CAT\" approximation). Nevertheless, for both simulated and genuine alignments, FastTree 2 is slightly more accurate than a standard implementation of maximum-likelihood NNIs (PhyML 3 with default settings). Although FastTree 2 is not quite as accurate as methods that use maximum-likelihood SPRs, most of the splits that disagree are poorly supported, and for large alignments, FastTree 2 is 100-1,000 times faster. FastTree 2 inferred a topology and likelihood-based local support values for 237,882 distinct 16S ribosomal RNAs on a desktop computer in 22 hours and 5.8 gigabytes of memory. Conclusions/Significance: FastTree 2 allows the inference of maximum-likelihood phylogenies for huge alignments. FastTree 2 is freely available at http://www.microbesonline.org/fasttree. © 2010 Price et al.",
                "authors": [
                    {
                        "name": "Arkin A.P."
                    },
                    {
                        "name": "Dehal P.S."
                    },
                    {
                        "name": "Price M.N."
                    }
                ],
                "citationCount": 9314,
                "date": "2010-03-10T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FastTree 2 - Approximately maximum-likelihood trees for large alignments"
            },
            "pmcid": "PMC2835736",
            "pmid": "20224823"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
