{
    "additionDate": "2017-01-13T13:16:57Z",
    "biotoolsCURIE": "biotools:variationhunter",
    "biotoolsID": "variationhunter",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/p/scalce/tickets/"
        }
    ],
    "description": "Detection of structural rearrangements.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://variationhunter.sourceforge.net/Manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://variationhunter.sourceforge.net/Home",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "maturity": "Mature",
    "name": "VariationHunter",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Recent studies show that along with single nucleotide polymorphisms and small indels, larger structural variants among human individuals are common. The Human Genome Structural Variation Project aims to identify and classify deletions, insertions, and inversions (>5 Kbp) in a small number of normal individuals with a fosmid-based paired-end sequencing approach using traditional sequencing technologies. The realization of new ultra-high-throughput sequencing platforms now makes it feasible to detect the full spectrum of genomic variation among many individual genomes, including cancer patients and others suffering from diseases of genomic origin. Unfortunately, existing algorithms for identifying structural variation (SV) among individuals have not been designed to handle the short read lengths and the errors implied by the \"next-gen\" sequencing (NGS) technologies. In this paper, we give combinatorial formulations for the SV detection between a reference genome sequence and a next-gen-based, paired-end, whole genome shotgun-sequenced individual. We describe efficient algorithms for each of the formulations we give, which all turn out to be fast and quite reliable; they are also applicable to all next-gen sequencing methods (Illumina, 454 Life Sciences [Roche], ABI SOLiD, etc.) and traditional capillary sequencing technology. We apply our algorithms to identify SV among individual genomes very recently sequenced by Illumina technology. © 2009 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Alkan C."
                    },
                    {
                        "name": "Eichler E.E."
                    },
                    {
                        "name": "Sahinalp S.C."
                    }
                ],
                "citationCount": 231,
                "date": "2009-07-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Combinatorial algorithms for structural variation detection in high-throughput sequenced genomes"
            },
            "pmid": "19447966"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}