{
    "additionDate": "2021-01-18T08:43:34Z",
    "biotoolsCURIE": "biotools:biont",
    "biotoolsID": "biont",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dfsousa@lasige.di.fc.ul.pt",
            "name": "Diana Sousa",
            "orcidid": "https://orcid.org/0000-0003-0597-9273",
            "typeEntity": "Person"
        }
    ],
    "description": "BiOnt performs relation extraction using a deep learning system. It employs four types of biomedical ontologies, namely, the Gene Ontology, the Human Phenotype Ontology, the Human Disease Ontology, and the Chemical Entities of Biological Interest, regarding gene-products, phenotypes, diseases, and chemical compounds, respectively.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/dpavot/biont"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lasigeBioTM/BiONT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-04T14:36:18Z",
    "license": "Apache-2.0",
    "name": "BiOnt",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-3-030-45442-5_46",
            "metadata": {
                "abstract": "© Springer Nature Switzerland AG 2020.Successful biomedical relation extraction can provide evidence to researchers and clinicians about possible unknown associations between biomedical entities, advancing the current knowledge we have about those entities and their inherent mechanisms. Most biomedical relation extraction systems do not resort to external sources of knowledge, such as domain-specific ontologies. However, using deep learning methods, along with biomedical ontologies, has been recently shown to effectively advance the biomedical relation extraction field. To perform relation extraction, our deep learning system, BiOnt, employs four types of biomedical ontologies, namely, the Gene Ontology, the Human Phenotype Ontology, the Human Disease Ontology, and the Chemical Entities of Biological Interest, regarding gene-products, phenotypes, diseases, and chemical compounds, respectively. We tested our system with three data sets that represent three different types of relations of biomedical entities. BiOnt achieved, in F-score, an improvement of 4.93% points for drug-drug interactions (DDI corpus), 4.99% points for phenotype-gene relations (PGR corpus), and 2.21% points for chemical-induced disease relations (BC5CDR corpus), relatively to the state-of-the-art. The code supporting this system is available at https://github.com/lasigeBioTM/BiONT.",
                "authors": [
                    {
                        "name": "Sousa D."
                    },
                    {
                        "name": "Couto F.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "BiOnt: Deep learning using multiple biomedical ontologies for relation extraction"
            },
            "pmcid": "PMC7148040"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}