{
    "additionDate": "2018-05-05T08:59:12Z",
    "biotoolsCURIE": "biotools:dmdtoolkit",
    "biotoolsID": "dmdtoolkit",
    "credit": [
        {
            "email": "wu_shiwen@yahoo.com",
            "name": "Shiwen Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for visualizing the mutated dystrophin protein and predicting the clinical severity in DMD.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/zhoujp111/DMDtoolkit/blob/master/Manual.docx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhoujp111/DMDtoolkit",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "DMDtoolkit",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-017-1504-4",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Dystrophinopathy is one of the most common human monogenic diseases which results in Duchenne muscular dystrophy (DMD) and Becker muscular dystrophy (BMD). Mutations in the dystrophin gene are responsible for both DMD and BMD. However, the clinical phenotypes and treatments are quite different in these two muscular dystrophies. Since early diagnosis and treatment results in better clinical outcome in DMD it is essential to establish accurate early diagnosis of DMD to allow efficient management. Previously, the reading-frame rule was used to predict DMD versus BMD. However, there are limitations using this traditional tool. Here, we report a novel molecular method to improve the accuracy of predicting clinical phenotypes in dystrophinopathy. We utilized several additional molecular genetic rules or patterns such as \"ambush hypothesis\", \"hidden stop codons\" and \"exonic splicing enhancer (ESE)\" to predict the expressed clinical phenotypes as DMD versus BMD. Results: A computer software \"DMDtoolkit\" was developed to visualize the structure and to predict the functional changes of mutated dystrophin protein. It also assists statistical prediction for clinical phenotypes. Using the DMDtoolkit we showed that the accuracy of predicting DMD versus BMD raised about 3% in all types of dystrophin mutations when compared with previous methods. We performed statistical analyses using correlation coefficients, regression coefficients, pedigree graphs, histograms, scatter plots with trend lines, and stem and leaf plots. Conclusions: We present a novel DMDtoolkit, to improve the accuracy of clinical diagnosis for DMD/BMD. This computer program allows automatic and comprehensive identification of clinical risk and allowing them the benefit of early medication treatments. DMDtoolkit is implemented in Perl and R under the GNU license. This resource is freely available at http://github.com/zhoujp111/DMDtoolkit , and http://www.dmd-registry.com.",
                "authors": [
                    {
                        "name": "Zhou J."
                    },
                    {
                        "name": "Xin J."
                    },
                    {
                        "name": "Niu Y."
                    },
                    {
                        "name": "Wu S."
                    }
                ],
                "citationCount": 3,
                "date": "2017-02-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DMDtoolkit: A tool for visualizing the mutated dystrophin protein and predicting the clinical severity in DMD"
            },
            "pmcid": "PMC5290630",
            "pmid": "28152980"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        }
    ],
    "validated": 1
}