{
    "additionDate": "2015-07-27T13:58:08Z",
    "biotoolsCURIE": "biotools:gmd-r",
    "biotoolsID": "gmd-r",
    "credit": [
        {
            "name": "binf.ku.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "albin@binf.ku.dk",
            "name": "Albin Sandelin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://albinsandelin.wix.com/sandelinlab"
        }
    ],
    "description": "Package for non-parametric distance measurement between two discrete frequency distributions.",
    "documentation": [
        {
            "type": "Citation instructions",
            "url": "https://cran.r-project.org/web/packages/GMD/citation.html"
        },
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/GMD/GMD.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://CRAN.R-project.org/package=GMD",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-09-04T08:37:30Z",
    "name": "GMD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0023409",
            "metadata": {
                "abstract": "Genome-wide, high-throughput methods for transcription start site (TSS) detection have shown that most promoters have an array of neighboring TSSs where some are used more than others, forming a distribution of initiation propensities. TSS distributions (TSSDs) vary widely between promoters and earlier studies have shown that the TSSDs have biological implications in both regulation and function. However, no systematic study has been made to explore how many types of TSSDs and by extension core promoters exist and to understand which biological features distinguish them. In this study, we developed a new non-parametric dissimilarity measure and clustering approach to explore the similarities and stabilities of clusters of TSSDs. Previous studies have used arbitrary thresholds to arrive at two general classes: broad and sharp. We demonstrated that in addition to the previous broad/sharp dichotomy an additional category of promoters exists. Unlike typical TATA-driven sharp TSSDs where the TSS position can vary a few nucleotides, in this category virtually all TSSs originate from the same genomic position. These promoters lack epigenetic signatures of typical mRNA promoters and a substantial subset of them are mapping upstream of ribosomal protein pseudogenes. We present evidence that these are likely mapping errors, which have confounded earlier analyses, due to the high similarity of ribosomal gene promoters in combination with known G addition bias in the CAGE libraries. Thus, previous two-class separations of promoter based on TSS distributions are motivated, but the ultra-sharp TSS distributions will confound downstream analyses if not removed. © 2011 Zhao et al.",
                "authors": [
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Valen E."
                    },
                    {
                        "name": "Parker B.J."
                    },
                    {
                        "name": "Sandelin A."
                    }
                ],
                "citationCount": 31,
                "date": "2011-08-24T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Systematic clustering of transcription start site landscapes"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "0.3.3"
    ]
}