{
    "additionDate": "2021-12-13T08:25:19.898124Z",
    "biotoolsCURIE": "biotools:tax4fun2",
    "biotoolsID": "tax4fun2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bwemheu@gwdg.de",
            "name": "Bernd Wemheuer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tax4Fun2 is a prediction of habitat-specific functional profiles and functional redundancy based on 16S rRNA gene sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bwemheu/Tax4Fun2",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-13T08:25:19.901184Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bwemheu/Tax4Fun2/issues"
        }
    ],
    "name": "Tax4Fun2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S40793-020-00358-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Sequencing of 16S rRNA genes has become a powerful technique to study microbial communities and their responses towards changing environmental conditions in various ecosystems. Several tools have been developed for the prediction of functional profiles from 16S rRNA gene sequencing data, because numerous questions in ecosystem ecology require knowledge of community functions in addition to taxonomic composition. However, the accuracy of these tools relies on functional information derived from genomes available in public databases, which are often not representative of the microorganisms present in the studied ecosystem. In addition, there is also a lack of tools to predict functional gene redundancy in microbial communities. Results: To address these challenges, we developed Tax4Fun2, an R package for the prediction of functional profiles and functional gene redundancies of prokaryotic communities from 16S rRNA gene sequences. We demonstrate that functional profiles predicted by Tax4Fun2 are highly correlated to functional profiles derived from metagenomes of the same samples. We further show that Tax4Fun2 has higher accuracies than PICRUSt and Tax4Fun. By incorporating user-defined, habitat-specific genomic information, the accuracy and robustness of predicted functional profiles is substantially enhanced. In addition, functional gene redundancies predicted with Tax4Fun2 are highly correlated to functional gene redundancies determined for simulated microbial communities. Conclusions: Tax4Fun2 provides researchers with a unique tool to predict and investigate functional profiles of prokaryotic communities based on 16S rRNA gene sequencing data. It is easy-to-use, platform-independent and highly memory-efficient, thus enabling researchers without extensive bioinformatics knowledge or access to high-performance clusters to predict functional profiles. Another unique feature of Tax4Fun2 is that it allows researchers to calculate the redundancy of specific functions, which is a potentially important measure of how resilient a community will be to environmental perturbation. Tax4Fun2 is implemented in R and freely available at https://github.com/bwemheu/Tax4Fun2.",
                "authors": [
                    {
                        "name": "Daniel R."
                    },
                    {
                        "name": "Johnston E."
                    },
                    {
                        "name": "Meinicke P."
                    },
                    {
                        "name": "Taylor J.A."
                    },
                    {
                        "name": "Thomas T."
                    },
                    {
                        "name": "Wemheuer B."
                    },
                    {
                        "name": "Wemheuer F."
                    }
                ],
                "citationCount": 59,
                "date": "2020-05-18T00:00:00Z",
                "journal": "Environmental Microbiomes",
                "title": "Tax4Fun2: Prediction of habitat-specific functional profiles and functional redundancy based on 16S rRNA gene sequences"
            },
            "pmcid": "PMC8067651",
            "pmid": "33902725",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
