{"credit":[{"email":"liisa.holm@helsinki.fi","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ekhidna.biocenter.helsinki.fi/"}],"documentation":[{"type":"GENERAL","url":"http://ekhidna2.biocenter.helsinki.fi/sans/Tutorial.html"}],"function":[{"operation":[{"term":"Sequence similarity search","uri":"http://edamontology.org/operation_0346"}]}],"labels":{"collectionID":["Proteomics"],"language":["Perl","Fortran","C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/sansparallel-interactive-homology-search-against-uniprot.html"}],"publication":[{"abstract":"© 2015 The Author(s).Proteins evolve by mutations and natural selection. The network of sequence similarities is a rich source for mining homologous relationships that inform on protein structure and function. There are many servers available to browse the network of homology relationships but one has to wait up to a minute for results. The SANSparallel webserver provides protein sequence database searches with immediate response and professional alignment visualization by third-party software. The output is a list, pairwise alignment or stacked alignment of sequence-similar proteins from Uniprot, UniRef90/50, Swissprot or Protein Data Bank. The stacked alignments are viewed in Jalview or as sequence logos. The database search uses the suffix array neighborhood search (SANS) method, which has been re-implemented as a client-server, improved and parallelized. The method is extremely fast and as sensitive as BLAST above 50% sequence identity. Benchmarks show that the method is highly competitive compared to previously published fast database search programs: UBLAST, DIAMOND, LAST, LAMBDA, RAPSEARCH2 and BLAT. The web server can be accessed interactively or programmatically at http://ekhidna2.biocenter.helsinki. fi/cgi-bin/sans/sans.cgi. It can be used to make protein functional annotation pipelines more efficient, and it is useful in interactive exploration of the detailed evidence supporting the annotation of particular proteins of interest.","authors":["Somervuo P.","Holm L."],"cit_count":9,"journal":"Nucleic Acids Research","pmid":"25855811","title":"SANSparallel: Interactive homology search against Uniprot","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:sansparallel","biotoolsID":"sansparallel","description":"This tool takes a protein sequence as input and returns a set of similar sequences from Uniprot databases.","homepage":"http://ekhidna2.biocenter.helsinki.fi/cgi-bin/sans/sans.cgi","name":"SANSparallel"}}