{
    "additionDate": "2024-02-08T21:51:12.947604Z",
    "biotoolsCURIE": "biotools:mouse_gpcrs_and_human_and_rat_orthologs",
    "biotoolsID": "mouse_gpcrs_and_human_and_rat_orthologs",
    "description": "data about  GPCR expression in different organ systems",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://esbl.nhlbi.nih.gov/Databases/GPCRs/",
    "lastUpdate": "2024-02-08T21:51:12.951623Z",
    "name": "Mouse GPCRs and Human and Rat orthologs",
    "owner": "Friederike",
    "publication": [
        {
            "doi": "10.1152/ajprenal.00077.2021",
            "metadata": {
                "abstract": "Kidney transport and other renal functions are regulated by multiple G protein-coupled receptors (GPCRs) expressed along the renal tubule. The rapid, recent appearance of comprehensive unbiased gene expression data in the various renal tubule segments, chiefly RNA sequencing and protein mass spectrometry data, has provided a means of identifying patterns of GPCR expression along the renal tubule. To allow for comprehensive mapping, we first curated a comprehensive list of GPCRs in the genomes of mice, rats, and humans (https://hpcwebapps.cit.nih.gov/ESBL/Database/GPCRs/) using multiple online data sources. We used this list to mine segment-specific and cell type-specific expression data from RNA-sequencing studies in microdissected mouse tubule segments to identify GPCRs that are selectively expressed in discrete tubule segments. Comparisons of these mapped mouse GPCRs with other omics datasets as well as functional data from isolated perfused tubule and micropuncture studies confirmed patterns of expression for well-known receptors and identified poorly studied GPCRs that are likely to play roles in the regulation of renal tubule function. Thus, we provide data resources for GPCR expression across the renal tubule, highlighting both well-known GPCRs and understudied receptors to provide guidance for future studies.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Chou C.-L."
                    },
                    {
                        "name": "Knepper M.A."
                    },
                    {
                        "name": "Poll B.G."
                    },
                    {
                        "name": "Raghuram V."
                    }
                ],
                "citationCount": 7,
                "date": "2021-01-01T00:00:00Z",
                "journal": "American Journal of Physiology - Renal Physiology",
                "title": "Landscape of GPCR expression along the mouse nephron"
            }
        }
    ]
}
