{
    "accessibility": "Open access",
    "additionDate": "2018-07-07T21:35:58Z",
    "biotoolsCURIE": "biotools:doestrare",
    "biotoolsID": "doestrare",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "elodie.persyn@univ-nantes.fr",
            "name": "Elodie Persyn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Rare variant association test based on position density estimation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/DoEstRare/DoEstRare.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/DoEstRare/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "DoEstRare",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0179364",
            "metadata": {
                "abstract": "© 2017 Persyn et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Next-generation sequencing technologies made it possible to assay the effect of rare variants on complex diseases. As an extension of the “common disease-common variant” paradigm, rare variant studies are necessary to get a more complete insight into the genetic architecture of human traits. Association studies of these rare variations show new challenges in terms of statistical analysis. Due to their low frequency, rare variants must be tested by groups. This approach is then hindered by the fact that an unknown proportion of the variants could be neutral. The risk level of a rare variation may be determined by its impact but also by its position in the protein sequence. More generally, the molecular mechanisms underlying the disease architecture may involve specific protein domains or intergenic regulatory regions. While a large variety of methods are optimizing functionality weights for each single marker, few evaluate variant position differences between cases and controls. Here, we propose a test called DoEstRare, which aims to simultaneously detect clusters of disease risk variants and global allele frequency differences in genomic regions. This test estimates, for cases and controls, variant position densities in the genetic region by a kernel method, weighted by a function of allele frequencies. We compared DoEstRare with previously published strategies through simulation studies as well as reanalysis of real datasets. Based on simulation under various scenarios, DoEstRare was the sole to consistently show highest performance, in terms of type I error and power both when variants were clustered or not. DoEstRare was also applied to Brugada syndrome and early-onset Alzheimer’s disease data and provided complementary results to other existing tests. DoEstRare, by integrating variant position information, gives new opportunities to explain disease susceptibility. DoEstRare is implemented in a user-friendly R package.",
                "authors": [
                    {
                        "name": "Persyn E."
                    },
                    {
                        "name": "Karakachoff M."
                    },
                    {
                        "name": "Le Scouarnec S."
                    },
                    {
                        "name": "Le Clezio C."
                    },
                    {
                        "name": "Campion D."
                    },
                    {
                        "name": "Schott J.-J."
                    },
                    {
                        "name": "Redon R."
                    },
                    {
                        "name": "Bellanger L."
                    },
                    {
                        "name": "Dina C."
                    },
                    {
                        "name": "Genin E."
                    },
                    {
                        "name": "Campion D."
                    },
                    {
                        "name": "Dartigues J.-F."
                    },
                    {
                        "name": "Deleuze J.-F."
                    },
                    {
                        "name": "Lambert J.-C."
                    },
                    {
                        "name": "Ludwig T."
                    },
                    {
                        "name": "Grenier-Boley B."
                    },
                    {
                        "name": "Letort S."
                    },
                    {
                        "name": "Lindenbaum P."
                    },
                    {
                        "name": "Meyer V."
                    },
                    {
                        "name": "Quenez O."
                    },
                    {
                        "name": "Dina C."
                    },
                    {
                        "name": "Bellenguez C."
                    },
                    {
                        "name": "Charbonnier-Le Clezio C."
                    },
                    {
                        "name": "Giemza J."
                    },
                    {
                        "name": "Chatel S."
                    },
                    {
                        "name": "Ferec C."
                    },
                    {
                        "name": "Le Marec H."
                    },
                    {
                        "name": "Letenneur L."
                    },
                    {
                        "name": "Nicolas G."
                    },
                    {
                        "name": "Rouault K."
                    },
                    {
                        "name": "Bacq D."
                    },
                    {
                        "name": "Boland A."
                    },
                    {
                        "name": "Lechner D."
                    }
                ],
                "citationCount": 4,
                "date": "2017-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "DoEstRare: A statistical test to identify local enrichments in rare genomic variants associated with disease"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}