
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 WILEY-VCH Verlag GmbH & Co. KGaA, WeinheimFourteen low molecular mass UV absorbing ampholytes containing 1 or 2 weakly acidic and 1 or 2 weakly basic functional groups that best satisfy Rilbe's requirement for being good carrier ampholytes (ΔpKa = pKamonoanion ‒ pKamonocation < 2) were selected from a large group of commercially readily available ampholytes in a computational study using two software packages (ChemSketch and SPARC). Their electrophoretic mobilities were measured in 10 mM ionic strength BGEs covering the 2 < pH < 12 range. Using our Debye-Hückel and Onsager-Fuoss laws-based new software, AnglerFish (freeware, https://echmet.natur.cuni.cz/software/download), the effective mobilities were recalculated to zero ionic strength from which the thermodynamic pKa values and limiting ionic mobilities of the ampholytes were directly calculated by Henderson-Hasselbalch equation-type nonlinear regression. The tabulated thermodynamic pKa values and limiting ionic mobilities of these ampholytes (pI markers) facilitate both the overall and the narrow-segment characterization of the pH gradients obtained in IEF in order to mitigate the errors of analyte ampholyte pI assignments caused by the usual (but rarely proven) assumption of pH gradient linearity. These thermodynamic pKa and limiting mobility values also enable the reality-based numeric simulation of the IEF process using, for example, Simul (freeware, https://echmet.natur.cuni.cz/software/download).",
            "authors": [
                "Ansorge M.",
                "Gas B.",
                "Boublik M.",
                "Maly M.",
                "Steflova J.",
                "Hruska V.",
                "Vigh G."
            ],
            "cit_count": 0,
            "doi": "10.1002/ELPS.201900381",
            "journal": "Electrophoresis",
            "pmid": "31721266",
            "title": "CE determination of the thermodynamic pKa values and limiting ionic mobilities of 14 low molecular mass UV absorbing ampholytes for accurate characterization of the pH gradient in carrier ampholytes-based IEF and its numeric simulation",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:echmet",
        "biotoolsID": "echmet",
        "description": "CE determination of the thermodynamic pKa values and limiting ionic mobilities of 14 low molecular mass UV absorbing ampholytes for accurate characterization of the pH gradient in carrier ampholytes-based IEF and its numeric simulation.\n\nThe program is packed in a zip file together with necessary libraries (.dll files). Portable - simply unzip and run CEval.exe.\n\nCEval should now be available in your applications menu. If not, check that the installation was successful by executing flatpak list --app You should see cz.cuni.natur.echmet.CEval among the listed applications. To run CEval, enter flatpak run cz.cuni.natur.echmet.CEval",
        "homepage": "https://echmet.natur.cuni.cz/software/download",
        "name": "echmet"
    }
}