{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T09:00:19Z",
    "biotoolsCURIE": "biotools:FunMappOne",
    "biotoolsID": "FunMappOne",
    "cost": "Free of charge",
    "description": "User-friendly graphical interface that allows to visualize and summarize the functional annotations of one or multiple molecular biology experiments at once.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://usermanual.wiki/Document/UserManual.999755866.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Greco-Lab/FunMappOne",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Greco-Lab/FunMappOne/issues"
        }
    ],
    "maturity": "Mature",
    "name": "FunMappOne",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2639-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Functional annotation of genes is an essential step in omics data analysis. Multiple databases and methods are currently available to summarize the functions of sets of genes into higher level representations, such as ontologies and molecular pathways. Annotating results from omics experiments into functional categories is essential not only to understand the underlying regulatory dynamics but also to compare multiple experimental conditions at a higher level of abstraction. Several tools are already available to the community to represent and compare functional profiles of omics experiments. However, when the number of experiments and/or enriched functional terms is high, it becomes difficult to interpret the results even when graphically represented. Therefore, there is currently a need for interactive and user-friendly tools to graphically navigate and further summarize annotations in order to facilitate results interpretation also when the dimensionality is high. Results: We developed an approach that exploits the intrinsic hierarchical structure of several functional annotations to summarize the results obtained through enrichment analyses to higher levels of interpretation and to map gene related information at each summarized level. We built a user-friendly graphical interface that allows to visualize the functional annotations of one or multiple experiments at once. The tool is implemented as a R-Shiny application called FunMappOne and is available at https://github.com/grecolab/FunMappOne. Conclusion: FunMappOne is a R-shiny graphical tool that takes in input multiple lists of human or mouse genes, optionally along with their related modification magnitudes, computes the enriched annotations from Gene Ontology, Kyoto Encyclopedia of Genes and Genomes, or Reactome databases, and reports interactive maps of functional terms and pathways organized in rational groups. FunMappOne allows a fast and convenient comparison of multiple experiments and an easy way to interpret results.",
                "authors": [
                    {
                        "name": "Greco D."
                    },
                    {
                        "name": "Marwah V.S."
                    },
                    {
                        "name": "Saarimaki L.A."
                    },
                    {
                        "name": "Scala G."
                    },
                    {
                        "name": "Serra A."
                    }
                ],
                "citationCount": 17,
                "date": "2019-02-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FunMappOne: A tool to hierarchically organize and visually navigate functional gene annotations in multiple experiments"
            },
            "pmcid": "PMC6376640",
            "pmid": "30767762",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
