{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T06:56:33.795245Z",
    "biotoolsCURIE": "biotools:deepkme",
    "biotoolsID": "deepkme",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guoyang_zou@163.com",
            "name": "Guoyang Zou",
            "orcidid": "https://orcid.org/0000-0003-0736-8759",
            "typeEntity": "Person"
        },
        {
            "email": "leili@qdu.edu.cn",
            "name": "Lei Li",
            "orcidid": "https://orcid.org/0000-0003-0266-8939",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepKme is the predictor for lysine methylation sites in human proteome.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/guoyangzou/DeepKme",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-07T06:56:33.797764Z",
    "name": "DeepKme",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009682",
            "metadata": {
                "abstract": "© 2021 Zou et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Many computational classifiers have been developed to predict different types of post-translational modification sites. Their performances are measured using cross-validation or independent test, in which experimental data from different sources are mixed and randomly split into training and test sets. However, the self-reported performances of most classifiers based on this measure are generally higher than their performances in the application of new experimental data. It suggests that the cross-validation method overestimates the generalization ability of a classifier. Here, we proposed a generalization estimate method, dubbed experiment-split test, where the experimental sources for the training set are different from those for the test set that simulate the data derived from a new experiment. We took the prediction of lysine methylome (Kme) as an example and developed a deep learning-based Kme site predictor (called DeepKme) with outstanding performance. We assessed the experiment-split test by comparing it with the cross-validation method. We found that the performance measured using the experiment-split test is lower than that measured in terms of cross-validation. As the test data of the experiment-split method were derived from an independent experimental source, this method could reflect the generalization of the predictor. Therefore, we believe that the experiment-split method can be applied to benchmark the practical performance of a given PTM model. DeepKme is free accessible via https://github.com/guoyangzou/DeepKme.",
                "authors": [
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Ma C."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Zou G."
                    },
                    {
                        "name": "Zou Y."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Development of an experiment-split method for benchmarking the generalization of a PTM site predictor: Lysine methylome as an example"
            },
            "pmcid": "PMC8687584",
            "pmid": "34879076"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
