{
    "accessibility": "Open access",
    "additionDate": "2022-08-30T07:43:12.326976Z",
    "biotoolsCURIE": "biotools:dispredict2",
    "biotoolsID": "dispredict2",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "thoque@uno.edu",
            "name": "Md Tamijdul Hoque"
        }
    ],
    "description": "DisPredict is a predictor of disorder residues in protein. It takes protein sequence (standard FASTA format) as input and outputs per residue binary annotation (disorder or order) along with two real values corresponding to probability of that residue being disorder and order.",
    "download": [
        {
            "type": "Source code",
            "url": "http://cs.uno.edu/~tamjid/Software/PSEE/PSEE.zip"
        }
    ],
    "editPermission": {
        "authors": [
            "damiano.piovesan",
            "tlazar"
        ],
        "type": "group"
    },
    "homepage": "https://cs.uno.edu/~tamjid/Software.html",
    "lastUpdate": "2022-08-30T07:43:12.342211Z",
    "name": "DisPredict2",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniela.mereuta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0161452",
            "metadata": {
                "abstract": "© 2016 Iqbal, Hoque. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.A set of features computed from the primary amino acid sequence of proteins, is crucial in the process of inducing a machine learning model that is capable of accurately predicting three-dimensional protein structures. Solutions for existing protein structure prediction problems are in need of features that can capture the complexity of molecular level interactions. With a view to this, we propose a novel approach to estimate position specific estimated energy (PSEE) of a residue using contact energy and predicted relative solvent accessibility (RSA). Furthermore, we demonstrate PSEE can be reasonably estimated based on sequence information alone. PSEE is useful in identifying the structured as well as unstructured or, intrinsically disordered region of a protein by computing favorable and unfavorable energy respectively, characterized by appropriate threshold. The most intriguing finding, verified empirically, is the indication that the PSEE feature can effectively classify disorder versus ordered residues and can segregate different secondary structure type residues by computing the constituent energies. PSEE values for each amino acid strongly correlate with the hydrophobicity value of the corresponding amino acid. Further, PSEE can be used to detect the existence of critical binding regions that essentially undergo disorder-to-order transitions to perform crucial biological functions. Towards an application of disorder prediction using the PSEE feature, we have rigorously tested and found that a support vector machine model informed by a set of features including PSEE consistently outperforms a model with an identical set of features with PSEE removed. In addition, the new disorder predictor, DisPredict2, shows competitive performance in predicting protein disorder when compared with six existing disordered protein predictors.",
                "authors": [
                    {
                        "name": "Hoque M.T."
                    },
                    {
                        "name": "Iqbal S."
                    }
                ],
                "citationCount": 9,
                "date": "2016-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Estimation of position specific energy as a feature of protein residues from sequence alone for structural classification"
            },
            "pmcid": "PMC5010294",
            "pmid": "27588752",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "version": [
        "2.0"
    ]
}
