{
    "accessibility": "Restricted access",
    "additionDate": "2019-11-14T18:33:42Z",
    "biotoolsCURIE": "biotools:Bolt",
    "biotoolsID": "Bolt",
    "confidence_flag": "tool",
    "cost": "Commercial",
    "credit": [
        {
            "name": "Amol Prakash",
            "orcidid": "https://orcid.org/0000-0002-3997-6487"
        }
    ],
    "description": "A cloud-based peptide search engine for MS/MS sequencing.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "homepage": "http://www.optystech.com/",
    "lastUpdate": "2021-01-07T19:37:36.562366Z",
    "license": "Proprietary",
    "name": "Bolt",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S13361-019-02306-3",
            "metadata": {
                "abstract": "© 2019, American Society for Mass Spectrometry.Recent increases in mass spectrometry speed, sensitivity, and resolution now permit comprehensive proteomics coverage. However, the results are often hindered by sub-optimal data processing pipelines. In almost all MS/MS peptide search engines, users must limit their search space to a canonical database due to time constraints and q value considerations, but this typically does not reflect the individual genetic variations of the organism being studied. In addition, engines will nearly always assume the presence of only fully tryptic peptides and limit PTMs to a handful. Even on high-performance servers, these search engines are computationally expensive, and most users decide to dial back their search parameters. We present Bolt, a new cloud-based search engine that can search more than 900,000 protein sequences (canonical, isoform, mutations, and contaminants) with 41 post-translation modifications and N-terminal and C-terminal partial tryptic search in minutes on a standard configuration laptop. Along with increases in speed, Bolt provides an additional benefit of improvement in high-confidence identifications. Sixty-one percent of peptides uniquely identified by Bolt may be validated by strong fragmentation patterns, compared with 13% of peptides uniquely identified by SEQUEST and 6% of peptides uniquely identified by Mascot. Furthermore, 30% of unique Bolt identifications were verified by all three software on the longer gradient analysis, compared with only 20% and 27% for SEQUEST and Mascot identifications respectively. Bolt represents, to the best of our knowledge, the first fully scalable, cloud-based quantitative proteomic solution that can be operated within a user-friendly GUI interface. Data are available via ProteomeXchange with identifier PXD012700. [Figure not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Prakash A."
                    },
                    {
                        "name": "Ahmad S."
                    },
                    {
                        "name": "Majumder S."
                    },
                    {
                        "name": "Jenkins C."
                    },
                    {
                        "name": "Orsburn B."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "Bolt: a New Age Peptide Search Engine for Comprehensive MS/MS Sequencing Through Vast Protein Databases in Minutes"
            },
            "pmid": "31452088"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}