{
    "additionDate": "2017-08-03T19:05:02Z",
    "biotoolsCURIE": "biotools:atsnp",
    "biotoolsID": "atsnp",
    "credit": [
        {
            "name": "Chandler Zu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pages.stat.wisc.edu/~zuo/"
        }
    ],
    "description": "Affinity Test for regulatory SNP detection package is a bioinformatics tool for computing and testing large-scale motif-SNP interactions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/chandlerzuo/atsnp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chandlerzuo/atsnp",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/atsnp-large-scale-testing-for-snp-motif-interactions.html"
        },
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://github.com/chandlerzuo/atsnp"
        }
    ],
    "name": "atSNP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author.Motivation: Genome-wide association studies revealed that most disease-associated single nucleotide polymorphisms (SNPs) are located in regulatory regions within introns or in regions between genes. Regulatory SNPs (rSNPs) are such SNPs that affect gene regulation by changing transcription factor (TF) binding affinities to genomic sequences. Identifying potential rSNPs is crucial for understanding disease mechanisms. In silico methods that evaluate the impact of SNPs on TF binding affinities are not scalable for large-scale analysis. Results: We describe affinity testing for regulatory SNPs (atSNP), a computationally efficient R package for identifying rSNPs in silico. atSNP implements an importance sampling algorithm coupled with a first-order Markov model for the background nucleotide sequences to test the significance of affinity scores and SNP-driven changes in these scores. Application of atSNP with >20 K SNPs indicates that atSNP is the only available tool for such a large-scale task. atSNP provides user-friendly output in the form of both tables and composite logo plots for visualizing SNP-motif interactions. Evaluations of atSNP with known rSNP-TF interactions indicate that SNP is able to prioritize motifs for a given set of SNPs with high accuracy.",
                "authors": [
                    {
                        "name": "Zuo C."
                    },
                    {
                        "name": "Shin S."
                    },
                    {
                        "name": "Keles S."
                    }
                ],
                "citationCount": 34,
                "date": "2015-03-25T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AtSNP: Transcription factor binding affinity testing for regulatory SNP detection"
            },
            "pmid": "26092860"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}