{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T13:17:12.975354Z",
    "biotoolsCURIE": "biotools:efdm",
    "biotoolsID": "efdm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "minna.raty@luke.fi",
            "name": "Minna Räty",
            "orcidid": "https://orcid.org/0000-0001-9898-8712",
            "typeEntity": "Person"
        }
    ],
    "description": "R package offering a scenario tool beyond forestry.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ec-jrc/efdm",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-09T13:17:12.977782Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/efdm/index.html"
        }
    ],
    "name": "EFDM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0264380",
            "metadata": {
                "abstract": "© 2022 Raty, Kuronen. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Scenario tools are widely used to support policymaking and strategic planning. Loss of biodiversity, climate change, and increase in biomass demand ways to project future forest resources considering e.g. various protection schemes, alterations to forest management, and potential threats like pests, wind, and drought. The European Forestry Dynamics Model (EFDM) is an area-based matrix model that can combine all these aspects in a scenario, simulating large-scale impacts. The inputs to the EFDM are the initial forest state and models for management activities such as thinning, felling or other silvicultural treatments. The results can be converted into user-defined outputs like wood volumes, the extent of old forests, dead wood, carbon, or harvest income. We present here a new implementation of the EFDM as an open-source R package. This new implementation enables the development of more complex scenarios than before, including transitions from even-aged forestry to continuous cover forestry, and changes in land use or tree species. Combined with a faster execution speed, the EFDM can now be used as a building block in optimization systems. The new user interface makes the EFDM more approachable and usable, and it can be combined with other models to study the impact of climate change, for example.",
                "authors": [
                    {
                        "name": "Kuronen M."
                    },
                    {
                        "name": "Raty M."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "efdm-An R package offering a scenario tool beyond forestry"
            },
            "pmcid": "PMC9377579",
            "pmid": "35969582"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        }
    ]
}
