{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://smithlabresearch.org/"}],"documentation":[{"url":"http://smithlabresearch.org/wp-content/uploads/rseg_manual-v0.4.9.pdf"}],"function":[{"operation":[{"term":"Microarray data analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"ChiP","uri":"http://edamontology.org/topic_3179"},{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"},{"term":"Histone modification","uri":"http://edamontology.org/topic_3295"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/rseg-0-4-4-identify-epigenomic-domains-chip-seq-data.html"}],"publication":[{"abstract":"Motivation: Post-translational modifications to histones have several well known associations with regulation of gene expression. While some modifications appear concentrated narrowly, covering promoters or enhancers, others are dispersed as epigenomic domains. These domains mark contiguous regions sharing an epigenomic property, such as actively transcribed or poised genes, or heterochromatically silenced regions. While high-throughput methods like ChIP-Seq have led to a flood of high-quality data about these epigenomic domains, there remain important analysis problems that are not adequately solved by current analysis tools. Results: We present the RSEG method for identifying epigenomic domains from ChIP-Seq data for histone modifications. In contrast with other methods emphasizing the locations of 'peaks' in read density profiles, our method identifies the boundaries of domains. RSEG is also able to incorporate a control sample and find genomic regions with differential histone modifications between two samples. © The Author(s) 2011. Published by Oxford University Press.","authors":["Song Q.","Smith A.D."],"cit_count":93,"doi":"10.1093/bioinformatics/btr030","journal":"Bioinformatics","title":"Identifying dispersed epigenomic domains from ChIP-Seq data","type":"Primary","year":"2011-03-01"}],"summary":{"biotoolsCURIE":"biotools:rseg_chipseq","biotoolsID":"rseg_chipseq","description":"Analyzes ChIP-Seq data, especially for identifying genomic regions and their boundaries marked by diffusive histone modification markers, such as H3K36me3 and H3K27me3. It can be used to find regions with differential histone modifications patterns, either comparsion between two cell types or between two kinds of histone modifications.","homepage":"http://smithlabresearch.org/software/rseg/","name":"RSEG"}}