{
    "accessibility": "Open access",
    "additionDate": "2022-12-27T02:15:24.350159Z",
    "biotoolsCURIE": "biotools:mimedb",
    "biotoolsID": "mimedb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "david.wishart@ualberta.ca",
            "name": "David S Wishart",
            "orcidid": "https://orcid.org/0000-0002-3207-2434",
            "typeEntity": "Person"
        },
        {
            "name": "Eponine Oler"
        },
        {
            "name": "Naama Karu"
        },
        {
            "name": "Rima Kaddurah-Daouk",
            "orcidid": "https://orcid.org/0000-0003-1858-5732"
        }
    ],
    "description": "The Microbial Metabolites Database (MiMeDB) is a freely available electronic database containing detailed information about small molecule metabolites found in the human microbiome. It is intended to be used for applications in metabolomics, clinical chemistry, biomarker discovery and general education. The database is designed to contain and link metabolite data, microbe data, host data, health and bioactivity data, and exposure data. Many data fields in the database are hyperlinked to other databases (FooDB, HMDB, KEGG, PubChem, MetaCyc, ChEBI, UniProt, and GenBank). The Microbial Metabolites Database supports extensive text, sequence, spectral, chemical structure and relational query searches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://mimedb.org",
    "lastUpdate": "2024-11-24T15:15:51.336788Z",
    "name": "MiMeDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/nar/gkac868",
            "metadata": {
                "abstract": "The Human Microbial Metabolome Database (MiMeDB) (https://mimedb.org) is a comprehensive, multi-omic, microbiome resource that connects: (i) microbes to microbial genomes; (ii) microbial genomes to microbial metabolites; (iii) microbial metabolites to the human exposome and (iv) all of these 'omes' to human health. MiMeDB was established to consolidate the growing body of data connecting the human microbiome and the chemicals it produces to both health and disease. MiMeDB contains detailed taxonomic, microbiological and body-site location data on most known human microbes (bacteria and fungi). This microbial data is linked to extensive genomic and proteomic sequence data that is closely coupled to colourful interactive chromosomal maps. The database also houses detailed information about all the known metabolites generated by these microbes, their structural, chemical and spectral properties, the reactions and enzymes responsible for these metabolites and the primary exposome sources (food, drug, cosmetic, pollutant, etc.) that ultimately lead to the observed microbial metabolites in humans. Additional, extensively referenced data about the known or presumptive health effects, measured biosample concentrations and human protein targets for these compounds is provided. All of this information is housed in richly annotated, highly interactive, visually pleasing database that has been designed to be easy to search, easy to browse and easy to navigate. Currently MiMeDB contains data on 626 health effects or bioactivities, 1904 microbes, 3112 references, 22 054 reactions, 24 254 metabolites or exposure chemicals, 648 861 MS and NMR spectra, 6.4 million genes and 7.6 billion DNA bases. We believe that MiMeDB represents the kind of integrated, multi-omic or systems biology database that is needed to enable comprehensive multi-omic integration.",
                "authors": [
                    {
                        "name": "Gautam V."
                    },
                    {
                        "name": "Girod S."
                    },
                    {
                        "name": "Guo A."
                    },
                    {
                        "name": "Han S."
                    },
                    {
                        "name": "Kaddurah-Daouk R."
                    },
                    {
                        "name": "Karu N."
                    },
                    {
                        "name": "Levatte M."
                    },
                    {
                        "name": "Lui V.W."
                    },
                    {
                        "name": "Oler E."
                    },
                    {
                        "name": "Peters H."
                    },
                    {
                        "name": "Saha S."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 33,
                "date": "2023-01-06T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MiMeDB: the Human Microbial Metabolome Database"
            },
            "pmcid": "PMC9825614",
            "pmid": "36215042"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
