
{
    "credit": [
        {
            "email": "ligang@udel.edu",
            "name": "Gang Li",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.udel.edu/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://research.bioinformatics.udel.edu/miRTex/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mirtex-text-mining-system-for-mirna-gene-relation-extraction.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Li et al. MicroRNAs (miRNAs) regulate a wide range of cellular and developmental processes through gene expression suppression or mRNA degradation. Experimentally validated miRNA gene targets are often reported in the literature. In this paper, we describe miRTex, a text mining system that extracts miRNA-target relations, as well as miRNA-gene and gene-miRNA regulation relations. The system achieves good precision and recall when evaluated on a literature corpus of 150 abstracts with F-scores close to 0.90 on the three different types of relations. We conducted full-scale text mining using miRTex to process all the Medline abstracts and all the full-length articles in the PubMed Central Open Access Subset. The results for all the Medline abstracts are stored in a database for interactive query and file download via the website at http://proteininformationresource.org/mirtex. Using miRTex, we identified genes potentially regulated by miRNAs in Triple Negative Breast Cancer, as well as miRNA-gene relations that, in conjunction with kinase-substrate relations, regulate the response to abiotic stress in Arabidopsis thaliana. These two use cases demonstrate the usefulness of miRTex text mining in the analysis of miRNA-regulated biological processes.",
            "authors": [
                "Li G.",
                "Ross K.E.",
                "Arighi C.N.",
                "Peng Y.",
                "Wu C.H.",
                "Vijay-Shanker K."
            ],
            "cit_count": 20,
            "journal": "PLoS Computational Biology",
            "pmid": "26407127",
            "title": "miRTex: A Text Mining System for miRNA-Gene Relation Extraction",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mirtex",
        "biotoolsID": "mirtex",
        "description": "Text-mining system that extracts miRNA-gene regulation relations and miRNA-target relations from literature.",
        "homepage": "http://research.bioinformatics.udel.edu/miRTex/",
        "name": "miRTex"
    }
}