{
    "additionDate": "2021-03-19T09:20:04Z",
    "biotoolsCURIE": "biotools:hicrep-py",
    "biotoolsID": "hicrep-py",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "william-noble@uw.edu",
            "name": "William Stafford Noble",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast comparison of Hi-C contact matrices in Python.\n\nA fast implementation of the HiCRep algorithm for computing similarities between pairs of Hi-C matrices.\n\nThis repository is temporarily located at https://github.com/dejunlin/hicrep.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/Noble-Lab/hicrep",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:38:07.397639Z",
    "license": "GPL-2.0",
    "name": "HiCRep-py",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab097",
            "metadata": {
                "abstract": "Motivation: Hi-C is the most widely used assay for investigating genome-wide 3D organization of chromatin. When working with Hi-C data, it is often useful to calculate the similarity between contact matrices in order to assess experimental reproducibility or to quantify relationships among Hi-C data from related samples. The HiCRep algorithm has been widely adopted for this task, but the existing R implementation suffers from run time limitations on high-resolution Hi-C data or on large single-cell Hi-C datasets. Results: We introduce a Python implementation of HiCRep and demonstrate that it is much faster and consumes much less memory than the existing R implementation. Furthermore, we give examples of HiCRep’s ability to accurately distinguish replicates from non-replicates and to reveal cell type structure among collections of Hi-C data. Availability and implementation: HiCRep.py and its documentation are available with a GPL license at https://github.com/Noble-Lab/hicrep. The software may be installed automatically using the pip package installer.",
                "authors": [
                    {
                        "name": "Lin D."
                    },
                    {
                        "name": "Noble W.S."
                    },
                    {
                        "name": "Sanders J."
                    }
                ],
                "citationCount": 18,
                "date": "2021-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HiCRep.py: fast comparison of Hi-C contact matrices in Python"
            },
            "pmcid": "PMC8479650",
            "pmid": "33576390"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}
