{
    "additionDate": "2024-07-24T09:47:05.053963Z",
    "biotoolsCURIE": "biotools:cellppd-mod",
    "biotoolsID": "cellppd-mod",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr. Gajendra P. S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/"
        }
    ],
    "description": "PhageTB is a multilevel prediction method for predicting interactions between bacteriophages and pathogenic bacterial hosts. This study develops a novel host prediction method for predicting hosts of query phages by their genome sequences utilizing alignment-based and alignment-free features.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://webs.iiitd.edu.in/raghava/phagetb/",
    "lastUpdate": "2024-11-24T13:50:17.800923Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/phagetb/"
        }
    ],
    "name": "PhageTB",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.3389/fmicb.2023.1148579",
            "metadata": {
                "abstract": "Phage therapy is a viable alternative to antibiotics for treating microbial infections, particularly managing drug-resistant strains of bacteria. One of the major challenges in designing phage-based therapy is to identify the most appropriate potential phage candidate to treat bacterial infections. In this study, an attempt has been made to predict phage-host interactions with high accuracy to identify the potential bacteriophage that can be used for treating a bacterial infection. The developed models have been created using a training dataset containing 826 phage- host interactions, and have been evaluated on a validation dataset comprising 1,201 phage-host interactions. Firstly, alignment-based models have been developed using similarity between phage-phage (BLASTPhage), host–host (BLASTHost) and phage-CRISPR (CRISPRPred), where we achieved accuracy between 42.4–66.2% for BLASTPhage, 55–78.4% for BLASTHost, and 43.7–80.2% for CRISPRPred across five taxonomic levels. Secondly, alignment free models have been developed using machine learning techniques. Thirdly, hybrid models have been developed by integrating the alignment-free models and the similarity-scores where we achieved maximum performance of (60.6–93.5%). Finally, an ensemble model has been developed that combines the hybrid and alignment-based models. Our ensemble model achieved highest accuracy of 67.9, 80.6, 85.5, 90, and 93.5% at Genus, Family, Order, Class, and Phylum levels on validation dataset. In order to serve the scientific community, we have also developed a webserver named PhageTB and provided a standalone software package (https://webs.iiitd.edu.in/raghava/phagetb/) for the same.",
                "authors": [
                    {
                        "name": "Aggarwal S."
                    },
                    {
                        "name": "Arora A."
                    },
                    {
                        "name": "Choudhury S."
                    },
                    {
                        "name": "Dhall A."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 10,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "An ensemble method for prediction of phage-based therapy against bacterial infections"
            },
            "pmcid": "PMC10076811",
            "pmid": "37032893"
        }
    ]
}
