
{
    "credit": [
        {
            "email": "iw@cs.ucr.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://alumni.cs.ucr.edu/~liw/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://alumni.cs.ucr.edu/~liw/isolasso.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/isolasso-2-6-1-a-lasso-regression-approach-to-rna-seq-based-transcriptome-assembly.html"
        }
    ],
    "publication": [
        {
            "abstract": "The new second generation sequencing technology revolutionizes many biology-related research fields and poses various computational biology challenges. One of them is transcriptome assembly based on RNA-Seq data, which aims at reconstructing all full-length mRNA transcripts simultaneously from millions of short reads. In this article, we consider three objectives in transcriptome assembly: the maximization of prediction accuracy, minimization of interpretation, and maximization of completeness. The first objective, the maximization of prediction accuracy, requires that the estimated expression levels based on assembled transcripts should be as close as possible to the observed ones for every expressed region of the genome. The minimization of interpretation follows the parsimony principle to seek as few transcripts in the prediction as possible. The third objective, the maximization of completeness, requires that the maximum number of mapped reads (or \"expressed segments\" in gene models) be explained by (i.e., contained in) the predicted transcripts in the solution. Based on the above three objectives, we present IsoLasso, a new RNA-Seq based transcriptome assembly tool. IsoLasso is based on the well-known LASSO algorithm, a multivariate regression method designated to seek a balance between the maximization of prediction accuracy and the minimization of interpretation. By including some additional constraints in the quadratic program involved in LASSO, IsoLasso is able to make the set of assembled transcripts as complete as possible. Experiments on simulated and real RNA-Seq datasets show that IsoLasso achieves, simultaneously, higher sensitivity and precision than the state-of-art transcript assembly tools. © Copyright 2011, Mary Ann Liebert, Inc.",
            "authors": [
                "Li W.",
                "Feng J.",
                "Jiang T."
            ],
            "cit_count": 72,
            "journal": "Journal of Computational Biology",
            "pmid": "21951053",
            "title": "IsoLasso: A LASSO regression approach to RNA-Seq based transcriptome assembly",
            "year": "2011-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:isolasso",
        "biotoolsID": "isolasso",
        "description": "Algorithm to assemble transcripts and estimate their expression levels from RNA-Seq reads.",
        "homepage": "http://alumni.cs.ucr.edu/~liw/isolasso.html",
        "name": "IsoLasso"
    }
}