{"credit":[{"email":"imanh@cs.sfu.ca","name":"IMAN HAJIRASOULIHA","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://novelseq.sourceforge.net/Manual"}],"function":[{"operation":[{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"},{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"},{"term":"Read mapping","uri":"http://edamontology.org/operation_3198"}]}],"labels":{"language":["C"],"license":"BSD-3-Clause","maturity":"Mature","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"DNA structural variation","uri":"http://edamontology.org/topic_3175"}]},"publication":[{"abstract":"Motivation: In the past few years, human genome structural variation discovery has enjoyed increased attention from the genomics research community. Many studies were published to characterize short insertions, deletions, duplications and inversions, and associate copy number variants (CNVs) with disease. Detection of new sequence insertions requires sequence data, however, the 'detectable' sequence length with read-pair analysis is limited by the insert size. Thus, longer sequence insertions that contribute to our genetic makeup are not extensively researched. Results: We present NovelSeq: a computational framework to discover the content and location of long novel sequence insertions using paired-end sequencing data generated by the next-generation sequencing platforms. Our framework can be built as part of a general sequence analysis pipeline to discover multiple types of genetic variation (SNPs, structural variation, etc.), thus it requires significantly less-computational resources than de novo sequence assembly. We apply our methods to detect novel sequence insertions in the genome of an anonymous donor and validate our results by comparing with the insertions discovered in the same genome using various sources of sequence data. Availability: The implementation of the NovelSeq pipeline is available at http://compbio.cs.sfu.ca/strvar.htm. Contact: eee@gs.washington.edu; cenk@cs.sfu.ca. © The Author 2010. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oxfordjournals.org.","authors":["Hajirasouliha I.","Hormozdiari F.","Alkan C.","Kidd J.M.","Birol I.","Eichler E.E.","Sahinalp S.C."],"cit_count":65,"journal":"Bioinformatics","pmid":"20385726","title":"Detection and characterization of novel sequence insertions using paired-end next-generation sequencing","year":"2010-04-12"}],"summary":{"biotoolsCURIE":"biotools:novelseq","biotoolsID":"novelseq","description":"A computational framework to discover the content and location of long novel sequence insertions using paired-end sequencing data","homepage":"http://novelseq.sourceforge.net/Home","name":"NovelSeq"}}