{
    "additionDate": "2017-09-19T08:48:04Z",
    "biotoolsCURIE": "biotools:diana-mirextra",
    "biotoolsID": "diana-mirextra",
    "credit": [
        {
            "email": "artemis.hatzigeorgiou@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.microrna.gr"
        }
    ],
    "description": "Performs a combined Differential expression analysis(DEA) of mRNAs and microRNAs (miRNAs) to uncover miRNAs and transcription factors (TFs) playing important regulatory roles between two investigated states. The web server uses as input miRNA/RNA-Seq read count data sets that can be uploaded for analysis. Users can combine their data with 350 small-RNA-Seq and 65 RNA-Seq in-house analyzed libraries which are provided by DIANA-mirExTra v2.0.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://carolina.imis.athena-innovation.gr/mirextra/index.php?r=site/help&topic=mirExTra"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://www.microrna.gr/mirextrav2",
    "language": [
        "JavaScript",
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2019-03-12T13:29:59Z",
    "name": "DIANA-mirExTra",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "dianalab",
    "publication": [
        {
            "doi": "10.1093/nar/gkw455",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Differential expression analysis (DEA) is one of the main instruments utilized for revealing molecular mechanisms in pathological and physiological conditions. DIANA-mirExTra v2.0 (http://www.microrna.gr/mirextrav2) performs a combined DEA of mRNAs and microRNAs (miRNAs) to uncover miRNAs and transcription factors (TFs) playing important regulatory roles between two investigated states. The web server uses as input miRNA/RNA-Seq read count data sets that can be uploaded for analysis. Users can combine their data with 350 small-RNA-Seq and 65 RNA-Seq in-house analyzed libraries which are provided by DIANA-mirExTra v2.0.The web server utilizes miRNA:mRNA, TF:mRNA and TF:miRNA interactions derived from extensive experimental data sets. More than 450 000 miRNA interactions and 2 000 000 TF binding sites from specific or high-throughput techniques have been incorporated, while accurate miRNA TSS annotation is obtained from microTSS experimental/in silico framework. These comprehensive data sets enable users to perform analyses based solely on experimentally supported information and to uncover central regulators within sequencing data: miRNAs controlling mRNAs and TFs regulating mRNA or miRNA expression. The server also supports predicted miRNA:gene interactions from DIANA-microT-CDS for 4 species (human, mouse, nematode and fruit fly). DIANA-mirExTra v2.0 has an intuitive user interface and is freely available to all users without any login requirement.",
                "authors": [
                    {
                        "name": "Vlachos I.S."
                    },
                    {
                        "name": "Vergoulis T."
                    },
                    {
                        "name": "Paraskevopoulou M.D."
                    },
                    {
                        "name": "Lykokanellos F."
                    },
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Georgiou P."
                    },
                    {
                        "name": "Chatzopoulos S."
                    },
                    {
                        "name": "Karagkouni D."
                    },
                    {
                        "name": "Christodoulou F."
                    },
                    {
                        "name": "Dalamagas T."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 21,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "DIANA-mirExTra v2.0: Uncovering microRNAs and transcription factors with crucial roles in NGS expression data"
            },
            "pmcid": "PMC4987956",
            "pmid": "27207881",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1371/journal.pone.0009171",
            "metadata": {
                "abstract": "Background: High-throughput gene expression experiments are widely used to identify the role of genes involved in biological conditions of interest. MicroRNAs (miRNA) are regulatory molecules that have been functionally associated with several developmental programs and their deregulation with diverse diseases including cancer. Methodology/Principal Findings: Although miRNA expression levels may not be routinely measured in high-throughput experiments, a possible involvement of miRNAs in the deregulation of gene expression can be computationally predicted and quantified through analysis of overrepresented motifs in the deregulated genes 3′ untranslated region (3′UTR) sequences. Here, we introduce a user-friendly web-server, DIANA-mirExTra (www.microrna.gr/mirextra) that allows the comparison of frequencies of miRNA associated motifs between sets of genes that can lead to the identification of miRNAs responsible for the deregulation of large numbers of genes. To this end, we have investigated different approaches and measures, and have practically implemented them on experimental data. Conclusions/ Significance: On several datasets of miRNA overexpression and repression experiments, our proposed approaches have successfully identified the deregulated miRNA. Beyond the prediction of miRNAs responsible for the deregulation of transcripts, the web-server provides extensive links to DIANA-mirPath, a functional analysis tool incorporating miRNA targets in biological pathways. Additionally, in case information about miRNA expression changes is provided, the results can be filtered to display the analysis for miRNAs of interest only. © 2010 Alexiou et al.",
                "authors": [
                    {
                        "name": "Alexiou P."
                    },
                    {
                        "name": "Maragkakis M."
                    },
                    {
                        "name": "Papadopoulos G.L."
                    },
                    {
                        "name": "Simmosis V.A."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 68,
                "date": "2010-02-11T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "The DIANA-mirExTra web server: From gene expression data to microRNA function"
            },
            "pmcid": "PMC2820085",
            "pmid": "20161787",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}