{
    "additionDate": "2018-10-01T15:56:39Z",
    "biotoolsCURIE": "biotools:genome_artist",
    "biotoolsID": "genome_artist",
    "credit": [
        {
            "email": "alexandru.al.ecovoiu@gmail.com",
            "name": "Alexandru Al. Ecovoiu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Genome ARTIST is a pairwise gapped aligner tool which works out issues in mapping the hits of artificial transposons at nucleotide lever accuracy in insertion mutagenesis experiments.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.genomeartist.ro/download/Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.genomeartist.ro/index.html",
    "language": [
        "Java",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/genomeartist/genomeartist"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/genomeartist/genomeartist/issues"
        }
    ],
    "name": "Genome ARTIST",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s13100-016-0061-0",
            "metadata": {
                "abstract": "© 2016 Ecovoiu et al.Background: A critical topic of insertional mutagenesis experiments performed on model organisms is mapping the hits of artificial transposons (ATs) at nucleotide level accuracy. Mapping errors may occur when sequencing artifacts or mutations as single nucleotide polymorphisms (SNPs) and small indels are present very close to the junction between a genomic sequence and a transposon inverted repeat (TIR). Another particular item of insertional mutagenesis is mapping of the transposon self-insertions and, to our best knowledge, there is no publicly available mapping tool designed to analyze such molecular events. Results: We developed Genome ARTIST, a pairwise gapped aligner tool which works out both issues by means of an original, robust mapping strategy. Genome ARTIST is not designed to use next-generation sequencing (NGS) data but to analyze ATs insertions obtained in small to medium-scale mutagenesis experiments. Genome ARTIST employs a heuristic approach to find DNA sequence similarities and harnesses a multi-step implementation of a Smith-Waterman adapted algorithm to compute the mapping alignments. The experience is enhanced by easily customizable parameters and a user-friendly interface that describes the genomic landscape surrounding the insertion. Genome ARTIST is functional with many genomes of bacteria and eukaryotes available in Ensembl and GenBank repositories. Our tool specifically harnesses the sequence annotation data provided by FlyBase for Drosophila melanogaster (the fruit fly), which enables mapping of insertions relative to various genomic features such as natural transposons. Genome ARTIST was tested against other alignment tools using relevant query sequences derived from the D. melanogaster and Mus musculus (mouse) genomes. Real and simulated query sequences were also comparatively inquired, revealing that Genome ARTIST is a very robust solution for mapping transposon insertions. Conclusions: Genome ARTIST is a stand-alone user-friendly application, designed for high-accuracy mapping of transposon insertions and self-insertions. The tool is also useful for routine aligning assessments like detection of SNPs or checking the specificity of primers and probes. Genome ARTIST is an open source software and is available for download at www.genomeartist.ro and at GitHub (https://github.com/genomeartist/genomeartist).",
                "authors": [
                    {
                        "name": "Ecovoiu A.A."
                    },
                    {
                        "name": "Ghionoiu I.C."
                    },
                    {
                        "name": "Ciuca A.M."
                    },
                    {
                        "name": "Ratiu A.C."
                    }
                ],
                "citationCount": 4,
                "date": "2016-02-05T00:00:00Z",
                "journal": "Mobile DNA",
                "title": "Genome ARTIST: A robust, high-accuracy aligner tool for mapping transposon insertions and self-insertions"
            },
            "pmcid": "PMC4744444",
            "pmid": "26855675",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1,
    "version": [
        "1.19"
    ]
}