{
    "additionDate": "2018-07-07T09:17:30Z",
    "biotoolsCURIE": "biotools:micropattern",
    "biotoolsID": "micropattern",
    "credit": [
        {
            "email": "cuiqinghua@hsc.pku.edu.cn",
            "name": "Qinghua Cui",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Microbe set enrichment analysis and disease similarity calculation based on a list of microbes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cuilab.cn/micropattern"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://www.cuilab.cn/micropattern",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "CC-BY-4.0",
    "name": "MicroPattern",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/srep40200",
            "metadata": {
                "abstract": "© The Author(s) 2017.The microbiota colonized on human body is renowned as \"a forgotten organ\" due to its big impacts on human health and disease. Recently, microbiome studies have identified a large number of microbes differentially regulated in a variety of conditions, such as disease and diet. However, methods for discovering biological patterns in the differentially regulated microbes are still limited. For this purpose, here, we developed a web-based tool named MicroPattern to discover biological patterns for a list of microbes. In addition, MicroPattern implemented and integrated an algorithm we previously presented for the calculation of disease similarity based on disease-microbe association data. MicroPattern first grouped microbes into different sets based on the associated diseases and the colonized positions. Then, for a given list of microbes, MicroPattern performed enrichment analysis of the given microbes on all of the microbe sets. Moreover, using MicroPattern, we can also calculate disease similarity based on the shared microbe associations. Finally, we confirmed the accuracy and usefulness of MicroPattern by applying it to the changed microbes under the animal-based diet condition. MicroPattern is freely available at http://www.cuilab.cn/micropattern.",
                "authors": [
                    {
                        "name": "Ma W."
                    },
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Cui Q."
                    }
                ],
                "citationCount": 8,
                "date": "2017-01-10T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "MicroPattern: A web-based tool for microbe set enrichment analysis and disease similarity calculation based on a list of microbes"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}