{
    "accessibility": "Open access",
    "additionDate": "2019-05-22T07:36:12Z",
    "biotoolsCURIE": "biotools:GenESysV",
    "biotoolsID": "GenESysV",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Center for Computational Research",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://buffalo.edu/ccr"
        }
    ],
    "description": "Genome exploration open source tool for variants generated from high-throughput sequencing projects.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ubccr/genesysv",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "GenESysV",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2636-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: High throughput sequencing technologies have been increasingly used in basic genetic research as well as in clinical applications. More and more variants underlying Mendelian and complex diseases are being discovered and documented using these technologies. However, identifying and obtaining a short list of candidate disease-causing variants remains challenging for most of the users after variant calling, especially for people without computational skills. Results: We developed GenESysV (Genome Exploration System for Variants) as a scalable, intuitive and user-friendly open source tool. It can be used in any high throughput sequencing or genotyping project for storing, managing, prioritizing and efficient retrieval of variants of interest. GenESysV is designed for use by researchers from a wide range of disciplines and computational skills, including wet-lab scientists, clinicians, and bioinformaticians. Conclusions: GenESysV is the first tool to be able to handle genomic variant dataset ranging in size from a few to thousands of samples and still maintain fast data importation and good query performance. It has a very intuitive graphical user interface and can also be used in studies where secured data access is an important concern. We believe this tool will benefit the human disease research community to speed up discoveries for genetic variants underlying human genetic disorders.",
                "authors": [
                    {
                        "name": "Zia M."
                    },
                    {
                        "name": "Spurgeon P."
                    },
                    {
                        "name": "Levesque A."
                    },
                    {
                        "name": "Furlani T."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "date": "2019-01-31T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GenESysV: A fast, intuitive and scalable genome exploration open source tool for variants generated from high-throughput sequencing projects"
            },
            "pmcid": "PMC6357466",
            "pmid": "30704396",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}