{
    "additionDate": "2021-04-20T13:08:10.322684",
    "biotoolsCURIE": "biotools:VariantValidator",
    "biotoolsID": "VariantValidator",
    "description": "VariantValidator is a user-friendly software tool designed to validate the syntax and parameters of DNA variant descriptions according to the HGVS Sequence Variant Nomenclature.\n\nVariantValidator ensures that users are guided through the intricacies of the HGVS nomenclature, e.g. if the user makes a mistake, VariantValidator automatically corrects the mistake if it can, or provides helpful guidance if it cannot. In addition, VariantValidator accurately inter-converts between transcript variant descriptions and genomic variant descriptions in HGVS and Variant Call Format (VCF)\n\nVariantValidator interfaces with the hgvs package to parse, format, and manipulate biological sequence variants. See https://github.com/biocommons/hgvs/ for details of the hgvs package\n\nVariantValidator is a highly functional platform enabling high-throughput and embeddable utilisation of functionality of https://variantvalidator.org/",
    "download": [
        {
            "note": "Links to git repositories for the VariantValidator resources",
            "type": "Other",
            "url": "https://github.com/openvar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://variantvalidator.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-20T13:08:10.323923Z",
    "license": "AGPL-3.0",
    "name": "VariantValidator",
    "owner": "CAUSEYFREEMAN",
    "publication": [
        {
            "doi": "10.1002/humu.23348",
            "metadata": {
                "abstract": "© 2017 The Authors. Human Mutation published by Wiley Periodicals, Inc.The Human Genome Variation Society (HGVS) variant nomenclature is widely used to describe sequence variants in scientific publications, clinical reports, and databases. However, the HGVS recommendations are complex and this often results in inaccurate variant descriptions being reported. The open-source hgvs Python package (https://github.com/biocommons/hgvs) provides a programmatic interface for parsing, manipulating, formatting, and validating of variants according to the HGVS recommendations, but does not provide a user-friendly Web interface. We have developed a Web-based variant validation tool, VariantValidator (https://variantvalidator.org/), which utilizes the hgvs Python package and provides additional functionality to assist users who wish to accurately describe and report sequence-level variations that are compliant with the HGVS recommendations. VariantValidator was designed to ensure that users are guided through the intricacies of the HGVS nomenclature, for example, if the user makes a mistake, VariantValidator automatically corrects the mistake if it can, or provides helpful guidance if it cannot. In addition, VariantValidator has the facility to interconvert genomic variant descriptions in HGVS and Variant Call Format with a degree of accuracy that surpasses most competing solutions.",
                "authors": [
                    {
                        "name": "Freeman P.J."
                    },
                    {
                        "name": "Hart R.K."
                    },
                    {
                        "name": "Gretton L.J."
                    },
                    {
                        "name": "Brookes A.J."
                    },
                    {
                        "name": "Dalgleish R."
                    }
                ],
                "citationCount": 33,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "VariantValidator: Accurate validation, mapping, and formatting of sequence variation descriptions"
            },
            "pmcid": "PMC5765404",
            "pmid": "28967166"
        }
    ]
}