{
    "accessibility": [
        "Restricted access"
    ],
    "additionDate": "2019-05-29T15:57:41Z",
    "biotoolsCURIE": "biotools:MicroHibro",
    "biotoolsID": "MicroHibro",
    "collectionID": [],
    "confidence_flag": null,
    "cost": "Free of charge (with restrictions)",
    "credit": [],
    "description": "Software tool for predictive microbiology and microbial risk assessment in foods.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.microhibro.com/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2019-07-29T10:45:19Z",
    "license": "Unlicense",
    "link": [],
    "maturity": "Mature",
    "name": "MicroHibro",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1016/j.ijfoodmicro.2018.10.007",
            "metadata": {
                "abstract": "© 2018 Elsevier B.V. A tool able to quantitatively assess the fate of potential pathogenic microorganisms in foods along the food chain and their impact on public health is highly valuable for food safety decision-makers. The aim of this work was to present an overview of the Predictive Microbiology software MicroHibro, which is able to assess the evolution of potential pathogens and spoilage microorganisms along the food chain, providing estimates for the exposure level and risk associated with a food product. The application is built on an extensive Predictive Microbiology Model Data Base (PMDB) including kinetic processes like growth, inactivation, transfer as well as dose-response models. PMDB can be populated with new models by using an on-line tool in combination with a standardized method for describing Predictive Microbiology models. This enables MicroHibro to be easily updated, increasing its applicability and use. Estimation of microbial risk associated with a food product can be achieved, in MicroHibro, by describing steps in any food chain using four different microbial processes (growth, inactivation, transfer and partitioning). As a result, an estimate of the concentration and prevalence of microorganisms in the food of interest as well as attendant risk are provided. Also, MicroHibro allows comparing different predictive models and validate them by introducing user's data. In this paper, examples are provided to illustrate how predictive models can be incorporated in MicroHibro, and then, used to develop a Quantitative Microbial Risk Assessment model. The use of expert computational systems is a powerful tool for supporting food safety and quality activities by Health Authorities and the food industry. They represent a breakthrough in the assessment and management of food safety based on scientific evidence.",
                "authors": [
                    {
                        "name": "Gonzalez S.C."
                    },
                    {
                        "name": "Possas A."
                    },
                    {
                        "name": "Carrasco E."
                    },
                    {
                        "name": "Valero A."
                    },
                    {
                        "name": "Bolivar A."
                    },
                    {
                        "name": "Posada-Izquierdo G.D."
                    },
                    {
                        "name": "Garcia-Gimeno R.M."
                    },
                    {
                        "name": "Zurera G."
                    },
                    {
                        "name": "Perez-Rodriguez F."
                    }
                ],
                "citationCount": 0,
                "date": "2019-02-02T00:00:00Z",
                "journal": "International Journal of Food Microbiology",
                "title": "‘MicroHibro’: A software tool for predictive microbiology and microbial risk assessment in foods"
            },
            "note": null,
            "pmcid": null,
            "pmid": "30368088",
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 0,
    "version": []
}