{
    "additionDate": "2017-12-18T14:16:36Z",
    "biotoolsCURIE": "biotools:mitobreak",
    "biotoolsID": "mitobreak",
    "credit": [
        {
            "email": "fpereirapt@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mitobreak.portugene.com/MitoBreak_contact.html"
        }
    ],
    "description": "Comprehensive on-line resource with curated datasets of mitochondrial DNA (mtDNA) rearrangements. MitoBreak provides a complete, quality checked and regularly updated list of breakpoints from three classes of somatic mtDNA rearrangements: circular deleted (deletions), circular partially-duplicated (duplications) and linear mtDNAs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mitobreak.portugene.com/MitoBreak_documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://mitobreak.portugene.com/",
    "lastUpdate": "2019-01-15T02:39:07Z",
    "name": "MITOBREAK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Portugene",
    "publication": [
        {
            "doi": "10.1093/nar/gkt982",
            "metadata": {
                "abstract": "Mitochondrial DNA (mtDNA) rearrangements are key events in the development of many diseases. Investigations of mtDNA regions affected by rearrangements (i.e. breakpoints) can lead to important discoveries about rearrangement mechanisms and can offer important clues about the causes of mitochondrial diseases. Here, we present the mitochondrial DNA breakpoints database (MitoBreak; http://mitobreak.portugene.com), a free, web-accessible comprehensive list of breakpoints from three classes of somatic mtDNA rearrangements: circular deleted (deletions), circular partially duplicated (duplications) and linear mtDNAs. Currently, MitoBreak contains >1400 mtDNA rearrangements from seven species (Homo sapiens, Mus musculus, Rattus norvegicus, Macaca mulatta, Drosophila melanogaster, Caenorhabditis elegans and Podospora anserina) and their associated phenotypic information collected from nearly 400 publications. The database allows researchers to perform multiple types of data analyses through user-friendly interfaces with full or partial datasets. It also permits the download of curated data and the submission of new mtDNA rearrangements. For each reported case, MitoBreak also documents the precise breakpoint positions, junction sequences, disease or associated symptoms and links to the related publications, providing a useful resource to study the causes and consequences of mtDNA structural alterations. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Damas J."
                    },
                    {
                        "name": "Carneiro J."
                    },
                    {
                        "name": "Amorim A."
                    },
                    {
                        "name": "Pereira F."
                    }
                ],
                "citationCount": 22,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MitoBreak: The mitochondrial DNA breakpoints database"
            },
            "pmcid": "PMC3965124",
            "pmid": "24170808",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}