{
    "additionDate": "2021-01-18T10:45:02Z",
    "biotoolsCURIE": "biotools:proin-fuse",
    "biotoolsID": "proin-fuse",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Md. Mehedi Hasan",
            "typeEntity": "Person"
        },
        {
            "name": "Hiroyuki Kurata",
            "typeEntity": "Person"
        }
    ],
    "description": "improved and robust prediction of proinflammatory peptides by fusing of multiple feature representations.\n\nPrediction of Pro-inflammatory Peptides.\n\nSINGLE PREDICTIONMore detailed prediction on one peptide.\n\nInput your peptide sequence here. The sequence should be in FASTA format. Example.\n\nPlease be patient after submitting and do not close this page.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://kurata14.bio.kyutech.ac.jp/ProIn-Fuse",
    "lastUpdate": "2021-01-27T17:48:52Z",
    "name": "ProIn-Fuse",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/S10822-020-00343-9",
            "metadata": {
                "abstract": "© 2020, Springer Nature Switzerland AG.A proinflammatory peptide (PIP) is a type of signaling molecules that are secreted from immune cells, which contributes to the first line of defense against invading pathogens. Numerous experiments have shown that PIPs play an important role in human physiology such as vaccines and immunotherapeutic drugs. Considering high-throughput laboratory methods that are time consuming and costly, effective computational methods are great demand to timely and accurately identify PIPs. Thus, in this study, we proposed a computational model in conjunction with a multiple feature representation, called ProIn-Fuse, to improve the performance of PIPs identification. Specifically, a feature representation learning model was utilized to generate the probabilistic scores by using the random forest models employing eight sequence encoding schemes. Finally, the ProIn-Fuse was constructed by linearly combining the resultant eight probabilistic scores. Evaluated through independent test, the ProIn-Fuse yielded an accuracy of 0.746, which was 10% higher than those obtained by the state-of-the-art PIP predictors. The proposed ProIn-Fuse can facilitate faster and broader applications of PIPs in drug design and development. The web server, datasets and online instruction are freely accessible at http://kurata14.bio.kyutech.ac.jp/ProIn-Fuse.",
                "authors": [
                    {
                        "name": "Khatun M.S."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Shoombuatong W."
                    },
                    {
                        "name": "Kurata H."
                    }
                ],
                "citationCount": 5,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "ProIn-Fuse: improved and robust prediction of proinflammatory peptides by fusing of multiple feature representations"
            },
            "pmid": "32964284"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}