{
    "additionDate": "2021-01-18T12:28:57Z",
    "biotoolsCURIE": "biotools:tasselnetv2plus",
    "biotoolsID": "tasselnetv2plus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zgcao@hust.edu.cn",
            "name": "Zhiguo Cao",
            "typeEntity": "Person"
        }
    ],
    "description": "A Fast Implementation for High-Throughput Plant Counting From High-Resolution RGB Imagery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://tinyurl.com/TasselNetV2plus",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-26T16:20:08Z",
    "license": "GPL-3.0",
    "name": "TasselNetV2plus",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FPLS.2020.541960",
            "metadata": {
                "abstract": "© Copyright © 2020 Lu and Cao.Plant counting runs through almost every stage of agricultural production from seed breeding, germination, cultivation, fertilization, pollination to yield estimation, and harvesting. With the prevalence of digital cameras, graphics processing units and deep learning-based computer vision technology, plant counting has gradually shifted from traditional manual observation to vision-based automated solutions. One of popular solutions is a state-of-the-art object detection technique called Faster R-CNN where plant counts can be estimated from the number of bounding boxes detected. It has become a standard configuration for many plant counting systems in plant phenotyping. Faster R-CNN, however, is expensive in computation, particularly when dealing with high-resolution images. Unfortunately high-resolution imagery is frequently used in modern plant phenotyping platforms such as unmanned aerial vehicles, engendering inefficient image analysis. Such inefficiency largely limits the throughput of a phenotyping system. The goal of this work hence is to provide an effective and efficient tool for high-throughput plant counting from high-resolution RGB imagery. In contrast to conventional object detection, we encourage another promising paradigm termed object counting where plant counts are directly regressed from images, without detecting bounding boxes. In this work, by profiling the computational bottleneck, we implement a fast version of a state-of-the-art plant counting model TasselNetV2 with several minor yet effective modifications. We also provide insights why these modifications make sense. This fast version, TasselNetV2+, runs an order of magnitude faster than TasselNetV2, achieving around 30 fps on image resolution of 1980 × 1080, while it still retains the same level of counting accuracy. We validate its effectiveness on three plant counting tasks, including wheat ears counting, maize tassels counting, and sorghum heads counting. To encourage the use of this tool, our implementation has been made available online at https://tinyurl.com/TasselNetV2plus.",
                "authors": [
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Cao Z."
                    }
                ],
                "citationCount": 5,
                "date": "2020-12-07T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "TasselNetV2+: A Fast Implementation for High-Throughput Plant Counting From High-Resolution RGB Imagery"
            },
            "pmcid": "PMC7750361",
            "pmid": "33365037"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}