{
    "additionDate": "2018-07-19T08:22:32Z",
    "biotoolsCURIE": "biotools:celltrans",
    "biotoolsID": "celltrans",
    "credit": [
        {
            "email": "thomas.buder@tu-dresden.de",
            "name": "Thomas Buder",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated tool to quantify stochastic cell state transitions between distinct cell states from FACS and flow cytometry experiments, to estimate equilibrium cell state proportions and the needed time equilibrium.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/tbuder/CellTrans/blob/master/vignettes/CellTrans_Vignette.Rmd"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tbuder/CellTrans",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "CellTrans",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1177/1177932217712241",
            "metadata": {
                "abstract": "© 2017, © The Author(s) 2017.Many normal and cancerous cell lines exhibit a stable composition of cells in distinct states which can, e.g., be defined on the basis of cell surface markers. There is evidence that such an equilibrium is associated with stochastic transitions between distinct states. Quantifying these transitions has the potential to better understand cell lineage compositions. We introduce CellTrans, an R package to quantify stochastic cell state transitions from cell state proportion data from fluorescence-activated cell sorting and flow cytometry experiments. The R package is based on a mathematical model in which cell state alterations occur due to stochastic transitions between distinct cell states whose rates only depend on the current state of a cell. CellTrans is an automated tool for estimating the underlying transition probabilities from appropriately prepared data. We point out potential analytical challenges in the quantification of these cell transitions and explain how CellTrans handles them. The applicability of CellTrans is demonstrated on publicly available data on the evolution of cell state compositions in cancer cell lines. We show that CellTrans can be used to (1) infer the transition probabilities between different cell states, (2) predict cell line compositions at a certain time, (3) predict equilibrium cell state compositions, and (4) estimate the time needed to reach this equilibrium. We provide an implementation of CellTrans in R, freely available via GitHub (https://github.com/tbuder/CellTrans).",
                "authors": [
                    {
                        "name": "Buder T."
                    },
                    {
                        "name": "Deutsch A."
                    },
                    {
                        "name": "Seifert M."
                    },
                    {
                        "name": "Voss-Bohme A."
                    }
                ],
                "citationCount": 4,
                "date": "2017-06-15T00:00:00Z",
                "journal": "Bioinformatics and Biology Insights",
                "title": "CellTrans: An R Package to Quantify Stochastic Cell State Transitions"
            },
            "pmcid": "PMC5478290",
            "pmid": "28659714"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1
}
