{
    "additionDate": "2017-08-03T19:08:01Z",
    "biotoolsCURIE": "biotools:pubmed2ensembl",
    "biotoolsID": "pubmed2ensembl",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://gnteam.cs.manchester.ac.uk/contact/"
        }
    ],
    "description": "Extension to the BioMart system that links over 2,000,000 articles in PubMed to nearly 150,000 genes in Ensembl from 50 species.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pubmed2ensembl56.smith.man.ac.uk/about.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://www.pubmed2ensembl.org/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pubmed2ensembl-link-publications-pubmed-genes-ensembl.html"
        }
    ],
    "name": "pubmed2ensembl",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The last two decades have witnessed a dramatic acceleration in the production of genomic sequence information and publication of biomedical articles. Despite the fact that genome sequence data and publications are two of the most heavily relied-upon sources of information for many biologists, very little effort has been made to systematically integrate data from genomic sequences directly with the biological literature. For a limited number of model organisms dedicated teams manually curate publications about genes; however for species with no such dedicated staff many thousands of articles are never mapped to genes or genomic regions. Methodology/Principal Findings: To overcome the lack of integration between genomic data and biological literature, we have developed pubmed2ensembl (http://www.pubmed2ensembl.org), an extension to the BioMart system that links over 2,000,000 articles in PubMed to nearly 150,000 genes in Ensembl from 50 species. We use several sources of curated (e.g., Entrez Gene) and automatically generated (e.g., gene names extracted through text-mining on MEDLINE records) sources of gene-publication links, allowing users to filter and combine different data sources to suit their individual needs for information extraction and biological discovery. In addition to extending the Ensembl BioMart database to include published information on genes, we also implemented a scripting language for automated BioMart construction and a novel BioMart interface that allows text-based queries to be performed against PubMed and PubMed Central documents in conjunction with constraints on genomic features. Finally, we illustrate the potential of pubmed2ensembl through typical use cases that involve integrated queries across the biomedical literature and genomic data. Conclusion/Significance: By allowing biologists to find the relevant literature on specific genomic regions or sets of functionally related genes more easily, pubmed2ensembl offers a much-needed genome informatics inspired solution to accessing the ever-increasing biomedical literature. © 2011 Baran et al.",
                "authors": [
                    {
                        "name": "Baran J."
                    },
                    {
                        "name": "Bergman C.M."
                    },
                    {
                        "name": "Gerner M."
                    },
                    {
                        "name": "Haeussler M."
                    },
                    {
                        "name": "Nenadic G."
                    }
                ],
                "citationCount": 22,
                "date": "2011-09-29T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "pubmed2ensembl: A resource for mining the biological literature on genes"
            },
            "pmid": "21980353"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1
}
