{
    "additionDate": "2021-01-18T07:37:32Z",
    "biotoolsCURIE": "biotools:mapdp",
    "biotoolsID": "mapdp",
    "confidence_flag": "tool",
    "description": "A Cloud-Based Computational Platform for Immunopeptidomics Analyses.\n\nMHC-associated peptide discovery platform.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/iric-proteo/mapdp",
    "lastUpdate": "2021-02-19T09:33:48Z",
    "name": "MAPDP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.9B00859",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.The immunopeptidome corresponds to the repertoire of peptides presented at the cell surface by the major histocompatibility complex (MHC) molecules. Cytotoxic T cells scan this repertoire to identify nonself antigens that can arise from tumors or infected cells. The identification of actionable antigenic targets is key to the development of therapeutic cancer vaccines, T-cell therapy, and other T-cell receptor-based biologics. The growing clinical interest for immunopeptidomics has accelerated the development of high throughput proteogenomic platforms that provide a system-level analysis of MHC-associated peptides. Improvement in sensitivity and throughput of mass spectrometers now allows the detection of a few thousands of peptides from less than 100 million cells. To manage the amount of data generated by these instruments, we have developed the MHC-associated peptide discovery platform (MAPDP), a novel open-source cloud-based computational platform for immunopeptidomic analyses. It provides convenient access from a web portal to immunopeptidomes stored in the database, filtering tools, various visualizations, annotations (e.g., IEDB, dbSNP, gnomAD), peptide-binding affinity prediction (mhcflurry, NetMHC), HLA genotyping, and the generation of personalized proteome databases. MAPDP functionalities are demonstrated here by the discovery of MHC peptides featuring new genetic variants identified in two previously published ovarian carcinoma data sets.",
                "authors": [
                    {
                        "name": "Courcelles M."
                    },
                    {
                        "name": "Durette C."
                    },
                    {
                        "name": "Daouda T."
                    },
                    {
                        "name": "Laverdure J.-P."
                    },
                    {
                        "name": "Vincent K."
                    },
                    {
                        "name": "Lemieux S."
                    },
                    {
                        "name": "Perreault C."
                    },
                    {
                        "name": "Thibault P."
                    }
                ],
                "citationCount": 4,
                "date": "2020-04-03T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "MAPDP: A Cloud-Based Computational Platform for Immunopeptidomics Analyses"
            },
            "pmid": "32108478"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Proteogenomics",
            "uri": "http://edamontology.org/topic_3922"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}