{
    "additionDate": "2021-01-18T11:13:06Z",
    "biotoolsCURIE": "biotools:iumami-scm",
    "biotoolsID": "iumami-scm",
    "confidence_flag": "tool",
    "description": "A Novel Sequence-Based Predictor for Prediction and Analysis of Umami Peptides Using a Scoring Card Method with Propensity Scores of Dipeptides.\n\nThe UMP-TR dataset consisted of 112 umami and 241 non-umami peptides while the UMP-IND dataset consisted of 28 umami and 61 non-umami peptides.\n\nThis is the website for predicting Umami Peptides from the publication called .",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/Shoombuatong2527/Benchmark-datasets/tree/master/iUmami"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "http://camt.pythonanywhere.com/iUmami-SCM",
    "lastUpdate": "2021-02-11T10:47:22Z",
    "name": "iUmami-SCM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00707",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Umami or the taste of monosodium glutamate represents one of the major attractive taste modalities in humans. Therefore, knowledge about biophysical and biochemical properties of the umami taste is important for both scientific research and the food industry. Experimental approaches for predicting umami peptides are labor intensive, time consuming, and expensive. To date, computational models for the prediction and analysis of umami peptides as a function of sequence information have not been developed yet. In this study, we have proposed the first sequence-based predictor named iUmami-SCM using primary sequence information for the identification and characterization of umami peptides. iUmami-SCM utilized a newly developed scoring card method (SCM) in conjunction with the propensity scores of amino acids and dipeptide. Our predictor demonstrated excellent prediction performance ability for predicting umami peptides as well as outperforming other commonly used machine learning classifiers. Particularly, iUmami-SCM afforded the highest accuracy and Matthews correlation coefficient of 0.865 and 0.679, respectively, on an independent data set. Furthermore, the analysis of SCM-derived propensity scores was performed so as to provide a more in-depth understanding and knowledge of biophysical and biochemical properties of umami intensities of peptides. To develop a convenient bioinformatics tool, the best model is deployed as a web server that is made publicly available at http://camt.pythonanywhere.com/iUmami-SCM. The iUmami-SCM, as presented herein, serves as a powerful computational technique for large-scale umami peptide identification as well as facilitating the interpretation of umami peptides.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Yana J."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 9,
                "date": "2020-12-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "IUmami-SCM: A Novel Sequence-Based Predictor for Prediction and Analysis of Umami Peptides Using a Scoring Card Method with Propensity Scores of Dipeptides"
            },
            "pmid": "33094610"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        }
    ]
}