{
    "additionDate": "2018-06-30T18:42:30Z",
    "biotoolsCURIE": "biotools:phenofun",
    "biotoolsID": "phenofun",
    "credit": [
        {
            "email": "amenzel@wzw.tum.de",
            "name": "Annette Menzel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated processing of webcam images for phenological classification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://r-forge.r-project.org/projects/phenofun/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:44:56.485677Z",
    "name": "phenofun",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0171918",
            "metadata": {
                "abstract": "Along with the global climate change, there is an increasing interest for its effect on phenological patterns such as start and end of the growing season. Scientific digital webcams are used for this purpose taking every day one or more images from the same natural motive showing for example trees or grassland sites. To derive phenological patterns from the webcam images, regions of interest are manually defined on these images by an expert and subsequently a time series of percentage greenness is derived and analyzed with respect to structural changes. While this standard approach leads to satisfying results and allows to determine dates of phenological change points, it is associated with a considerable amount of manual work and is therefore constrained to a limited number of webcams only. In particular, this forbids to apply the phenological analysis to a large network of publicly accessible webcams in order to capture spatial phenological variation. In order to be able to scale up the analysis to several hundreds or thousands of webcams, we propose and evaluate two automated alternatives for the definition of regions of interest, allowing for efficient analyses of webcam images. A semi-supervised approach selects pixels based on the correlation of the pixels' time series of percentage greenness with a few prototype pixels. An unsupervised approach clusters pixels based on scores of a singular value decomposition. We show for a scientific webcam that the resulting regions of interest are at least as informative as those chosen by an expert with the advantage that no manual action is required. Additionally, we show that the methods can even be applied to publicly available webcams accessed via the internet yielding interesting partitions of the analyzed images. Finally, we show that the methods are suitable for the intended big data applications by analyzing 13988 webcams from the AMOS database. All developed methods are implemented in the statistical software package R and publicly available in the R package phenofun. Executable example code is provided as supplementary material.",
                "authors": [
                    {
                        "name": "Bothmann L."
                    },
                    {
                        "name": "Kauermann G."
                    },
                    {
                        "name": "Menze B.H."
                    },
                    {
                        "name": "Menzel A."
                    },
                    {
                        "name": "Schunk C."
                    }
                ],
                "citationCount": 11,
                "date": "2017-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Automated processing of webcam images for phenological classification"
            },
            "pmcid": "PMC5325214",
            "pmid": "28235092",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
