{
    "additionDate": "2019-11-14T19:36:29Z",
    "biotoolsCURIE": "biotools:gapFinisher",
    "biotoolsID": "gapFinisher",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "juhana.kammonen@helsinki.fi",
            "name": "Juhana I. Kammonen",
            "orcidid": "https://orcid.org/0000-0002-6914-0111",
            "typeEntity": "Person"
        }
    ],
    "description": "A reliable gap filling pipeline for SSPACE-LongRead scaffolder output | A reliable gap filling pipeline for draft genomes | .",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/kammoji/gapFinisher",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2021-01-17T09:45:11Z",
    "name": "gapFinisher",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0216885",
            "metadata": {
                "abstract": "© 2019 Kammonen et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Unknown sequences, or gaps, are present in many published genomes across public databases. Gap filling is an important finishing step in de novo genome assembly, especially in large genomes. The gap filling problem is nontrivial and while there are many computational tools partially solving the problem, several have shortcomings as to the reliability and correctness of the output, i.e. the gap filled draft genome. SSPACE-LongRead is a scaffolding tool that utilizes long reads from multiple third-generation sequencing platforms in finding links between contigs and combining them. The long reads potentially contain sequence information to fill the gaps created in the scaffolding, but SSPACE-LongRead currently lacks this functionality. We present an automated pipeline called gapFinisher to process SSPACE-LongRead output to fill gaps after the scaffolding. gapFinisher is based on the controlled use of a previously published gap filling tool FGAP and works on all standard Linux/UNIX command lines. We compare the performance of gapFinisher against two other published gap filling tools PBJelly and GMcloser. We conclude that gapFinisher can fill gaps in draft genomes quickly and reliably. In addition, the serial design of gapFinisher makes it scale well from prokaryote genomes to larger genomes with no increase in the computational footprint.",
                "authors": [
                    {
                        "name": "Auvinen P."
                    },
                    {
                        "name": "Jernvall J."
                    },
                    {
                        "name": "Kammonen J.I."
                    },
                    {
                        "name": "Koskinen P."
                    },
                    {
                        "name": "Laine P."
                    },
                    {
                        "name": "Paulin L."
                    },
                    {
                        "name": "Pereira P.A.B."
                    },
                    {
                        "name": "Smolander O.-P."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GapFinisher: A reliable gap filling pipeline for SSPACE-LongRead scaffolder output"
            },
            "pmcid": "PMC6733440",
            "pmid": "31498807"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
