{
    "additionDate": "2021-10-04T09:05:43.298107Z",
    "biotoolsCURIE": "biotools:juxtapose",
    "biotoolsID": "juxtapose",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "katie.ovens@usask.ca",
            "name": "Katie Ovens",
            "orcidid": "https://orcid.org/0000-0001-5956-7739",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Juxtapose is a Python tool that can be used to compare gene co-expression networks (GCNs). Juxtapose, together with different similarity measures, can be utilized for comparative transcriptomics between a set of organisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://github.com/klovens/juxtapose",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-04T09:05:43.300671Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/klovens/juxtapose/issues"
        }
    ],
    "name": "Juxtapose",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04055-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Gene co-expression networks (GCNs) are not easily comparable due to their complex structure. In this paper, we propose a tool, Juxtapose, together with similarity measures that can be utilized for comparative transcriptomics between a set of organisms. While we focus on its application to comparing co-expression networks across species in evolutionary studies, Juxtapose is also generalizable to co-expression network comparisons across tissues or conditions within the same species. Methods: A word embedding strategy commonly used in natural language processing was utilized in order to generate gene embeddings based on walks made throughout the GCNs. Juxtapose was evaluated based on its ability to embed the nodes of synthetic structures in the networks consistently while also generating biologically informative results. Evaluation of the techniques proposed in this research utilized RNA-seq datasets from GTEx, a multi-species experiment of prefrontal cortex samples from the Gene Expression Omnibus, as well as synthesized datasets. Biological evaluation was performed using gene set enrichment analysis and known gene relationships in literature. Results: We show that Juxtapose is capable of globally aligning synthesized networks as well as identifying areas that are conserved in real gene co-expression networks without reliance on external biological information. Furthermore, output from a matching algorithm that uses cosine distance between GCN embeddings is shown to be an informative measure of similarity that reflects the amount of topological similarity between networks. Conclusions: Juxtapose can be used to align GCNs without relying on known biological similarities and enables post-hoc analyses using biological parameters, such as orthology of genes, or conserved or variable pathways. Availability: A development version of the software used in this paper is available at https://github.com/klovens/juxtapose",
                "authors": [
                    {
                        "name": "Ovens K."
                    },
                    {
                        "name": "Maleki F."
                    },
                    {
                        "name": "Eames B.F."
                    },
                    {
                        "name": "McQuillan I."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Juxtapose: a gene-embedding approach for comparing co-expression networks"
            },
            "pmcid": "PMC7968242",
            "pmid": "33726666",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}