{
    "additionDate": "2020-01-14T09:31:19Z",
    "biotoolsCURIE": "biotools:GenoGeographer",
    "biotoolsID": "GenoGeographer",
    "confidence_flag": "tool",
    "description": "Ancestry prediction efficiency of the software GenoGeographer using a z-score method and the ancestry informative markers in the Precision ID Ancestry Panel.\n\nA tool for genogeographic inference",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://genogeographer.org/",
    "lastUpdate": "2020-12-03T08:13:12.804436Z",
    "name": "GenoGeographer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.FSIGEN.2019.102154",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.We compared the efficiency of the freely available software GenoGeographer that includes a z-score based analysis with that of a naïve method based on the maximal likelihoods of 164 of the 165 ancestral informative markers (AIM) that are included in the commercially available kit Precision ID Ancestry Panel from Thermo Fisher Scientific. The AIM profiles were obtained by investigations with the Precision ID Ancestry Panel in our laboratory and from SNP data in the literature and publically available databases. We established eight well-defined AIM reference population data sets from 3603 AIM profiles. Six reference populations with profiles from multiple populations (Sub-Saharan Africa, North Africa, Middle East, Europe, South/Central Asia, East Asia), and two populations with individuals with admixed ancestry (Somalia and Greenland). By means of GenoGeographer and naïve calculations of the maximal likelihoods, 566 AIM profiles from individuals that were not included in the reference populations and expected to belong to one of the eight reference populations were tested. An initial standard z-score based test with GenoGeographer demonstrated that 22.4% of the individuals could not be assigned to any of the reference populations. Among the remaining 77.6% of the individuals, 83.6% were assigned to the reference population that was concordant with the specified populations of origin of the individuals, 8.2% had ambiguous assignments because they could belong to both the specified population of origin and one or more of the other populations, and 8.2% were assigned to a reference population that was discordant from the specified population of origin. A naïve assignment based on the maximal likelihood resulted in 78.1% concordant and 21.9% discordant assignments. The results demonstrate that the z-score analysis with GenoGeographer can reduce the error rate with a factor of almost three compared with that of the naïve estimation based on the maximal likelihoods of the AIM profiles. The Precision ID Ancestry Panel is a useful kit for the assignment of ancestry of the eight investigated populations that included two admixed populations. More AIMs with better discrimination and more data on the distribution of AIMs in relevant populations are needed to improve the efficiency of genogeographic prediction with AIMs on a worldwide basis.",
                "authors": [
                    {
                        "name": "Mogensen H.S."
                    },
                    {
                        "name": "Tvedebrink T."
                    },
                    {
                        "name": "Borsting C."
                    },
                    {
                        "name": "Pereira V."
                    },
                    {
                        "name": "Morling N."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Forensic Science International: Genetics",
                "title": "Ancestry prediction efficiency of the software GenoGeographer using a z-score method and the ancestry informative markers in the Precision ID Ancestry Panel"
            },
            "pmid": "31670023"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}