{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T22:52:20.496858Z",
    "biotoolsCURIE": "biotools:pf-phospho",
    "biotoolsID": "pf-phospho",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "deb@nii.ac.in",
            "name": "Debasisa Mohanty",
            "typeEntity": "Person"
        },
        {
            "name": "Priya Gupta"
        },
        {
            "name": "Sureshkumar Venkadesan"
        }
    ],
    "description": "A machine learning-based phosphorylation sites prediction tool for Plasmodium proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://www.nii.ac.in/pfphospho.html",
    "lastUpdate": "2024-11-24T15:42:44.118524Z",
    "name": "Pf-Phospho",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac249",
            "metadata": {
                "abstract": "Even though several in silico tools are available for prediction of the phosphorylation sites for mammalian, yeast or plant proteins, currently no software is available for predicting phosphosites for Plasmodium proteins. However, the availability of significant amount of phospho-proteomics data during the last decade and advances in machine learning (ML) algorithms have opened up the opportunities for deciphering phosphorylation patterns of plasmodial system and developing ML-based phosphosite prediction tools for Plasmodium. We have developed Pf-Phospho, an ML-based method for prediction of phosphosites by training Random Forest classifiers using a large data set of 12 096 phosphosites of Plasmodium falciparum and Plasmodium bergei. Of the 12 096 known phosphosites, 75% of sites have been used for training/validation of the classifier, while remaining 25% have been used as completely unseen test data for blind testing. It is encouraging to note that Pf-Phospho can predict the kinase-independent phosphosites with 84% sensitivity, 75% specificity and 78% precision. In addition, it can also predict kinase-specific phosphosites for five plasmodial kinases-PfPKG, Plasmodium falciparum, PfPKA, PfPK7 and PbCDPK4 with high accuracy. Pf-Phospho (http://www.nii.ac.in/pfphospho.html) outperforms other widely used phosphosite prediction tools, which have been trained using mammalian phosphoproteome data. It also has been integrated with other widely used resources such as PlasmoDB, MPMP, Pfam and recently available ML-based predicted structures by AlphaFold2. Currently, Pf-phospho is the only bioinformatics resource available for ML-based prediction of phospho-signaling networks of Plasmodium and is a user-friendly platform for integrative analysis of phospho-signaling along with metabolic and protein-protein interaction networks.",
                "authors": [
                    {
                        "name": "Gupta P."
                    },
                    {
                        "name": "Mohanty D."
                    },
                    {
                        "name": "Venkadesan S."
                    }
                ],
                "citationCount": 4,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Pf-Phospho: A machine learning-based phosphorylation sites prediction tool for Plasmodium proteins"
            },
            "pmid": "35753700"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
