{
    "additionDate": "2017-03-24T11:45:07Z",
    "biotoolsCURIE": "biotools:prosa-web",
    "biotoolsID": "prosa-web",
    "credit": [
        {
            "email": "prosa@came.sbg.ac.at",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ProSA-web (Protein Structure Analysis) is an extension of the classic ProSA program used for the refinement and validation of experimental protein structures and in structure prediction and modeling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://prosa.services.came.sbg.ac.at/prosa.php",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "ProSA-web",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A major problem in the determination of the three‐dimensional structure of proteins concerns the quality of the structural models obtained from the interpretation of experimental data. New developments in X‐ray crystallography and nuclear magnetic resonance spectroscopy have acceleratedd the process of structure determination and the biological community is confronted with a steadily increasing number of experimentally determined protein folds. However, in the recent past several experimentally determined protein structures have been proven to contain major errors, indicating that in some cases the interpretation of experimental data is difficult and may yield incorrect models. Such problems can be avoided when computational methods are employed which complement experimental structure determinations. A prerequisite of such computational tools is that they are independent of the parameters obtained from a particular experiment. In addition such techniques are able to support and accelerate experimental structure determinations. Here we present techniques based on knowledge based mean fields which can be used to judge the quality of protein folds. The methods can be used to identify misfolded structures as well as faulty parts of structural models. The techniques are even applicable in cases where only the Cα trace of a protein conformation is available. The capabilities of the technique are demonstrated using correct and incorrect protein folds. © 1993 Wiley‐Liss, Inc. Copyright © 1993 Wiley‐Liss, Inc.",
                "authors": [
                    {
                        "name": "Sippl M.J."
                    }
                ],
                "citationCount": 1621,
                "date": "1993-01-01T00:00:00Z",
                "journal": "Proteins: Structure, Function, and Bioinformatics",
                "title": "Recognition of errors in three‐dimensional structures of proteins"
            },
            "pmid": "8108378"
        },
        {
            "metadata": {
                "abstract": "A major problem in structural biology is the recognition of errors in experimental and theoretical models of protein structures. The ProSA program (Protein Structure Analysis) is an established tool which has a large user base and is frequently employed in the refinement and validation of experimental protein structures and in structure prediction and modeling. The analysis of protein structures is generally a difficult and cumbersome exercise. The new service presented here is a straightforward and easy to use extension of the classic ProSA program which exploits the advantages of interactive web-based applications for the display of scores and energy plots that highlight potential problems spotted in protein structures. In particular, the quality scores of a protein are displayed in the context of all known protein structures and problematic parts of a structure are shown and highlighted in a 3D molecule viewer. The service specifically addresses the needs encountered in the validation of protein structures obtained from X-ray analysis, NMR spectroscopy and theoretical calculations. ProSA-web is accessible at https://prosa.services. came.sbg.ac.at. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Wiederstein M."
                    },
                    {
                        "name": "Sippl M.J."
                    }
                ],
                "citationCount": 2475,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProSA-web: Interactive web service for the recognition of errors in three-dimensional structures of proteins"
            },
            "pmid": "17517781"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}