{
    "additionDate": "2021-01-18T10:05:23Z",
    "biotoolsCURIE": "biotools:spheremorph",
    "biotoolsID": "spheremorph",
    "confidence_flag": "tool",
    "description": "Cortical surface registration using unsupervised learning.\n\nNon-rigid cortical registration is an important and challenging task due to the geometric complexity of the human cortex and the high degree of inter-subject variability. A conventional solution is to use a spherical representation of surface properties and perform registration by aligning cortical folding patterns in that space. This strategy produces accurate spatial alignment, but often requires high computational cost. Recently, convolutional neural networks (CNNs) have demonstrated the potential to dramatically speed up volumetric registration. However, due to distortions introduced by projecting a sphere to a 2D plane, a direct application of recent learning-based methods to surfaces yields poor results. In this study, we present SphereMorph, a diffeomorphic registration framework for cortical surfaces using deep networks that addresses these issues",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/voxelmorph/spheremorph",
    "lastUpdate": "2024-11-24T20:42:20.727858Z",
    "name": "SphereMorph",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2020.117161",
            "metadata": {
                "abstract": "Non-rigid cortical registration is an important and challenging task due to the geometric complexity of the human cortex and the high degree of inter-subject variability. A conventional solution is to use a spherical representation of surface properties and perform registration by aligning cortical folding patterns in that space. This strategy produces accurate spatial alignment, but often requires high computational cost. Recently, convolutional neural networks (CNNs) have demonstrated the potential to dramatically speed up volumetric registration. However, due to distortions introduced by projecting a sphere to a 2D plane, a direct application of recent learning-based methods to surfaces yields poor results. In this study, we present SphereMorph, a diffeomorphic registration framework for cortical surfaces using deep networks that addresses these issues. SphereMorph uses a UNet-style network associated with a spherical kernel to learn the displacement field and warps the sphere using a modified spatial transformer layer. We propose a resampling weight in computing the data fitting loss to account for distortions introduced by polar projection, and demonstrate the performance of our proposed method on two tasks, including cortical parcellation and group-wise functional area alignment. The experiments show that the proposed SphereMorph is capable of modeling the geometric registration problem in a CNN framework and demonstrate superior registration accuracy and computational efficiency. The source code of SphereMorph will be released to the public upon acceptance of this manuscript at https://github.com/voxelmorph/spheremorph.",
                "authors": [
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Dalca A.V."
                    },
                    {
                        "name": "Fischl B."
                    },
                    {
                        "name": "Zollei L."
                    }
                ],
                "citationCount": 27,
                "date": "2020-11-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Cortical surface registration using unsupervised learning"
            },
            "pmcid": "PMC7784120",
            "pmid": "32702486"
        }
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
