{
    "additionDate": "2017-12-18T00:07:21Z",
    "biotoolsCURIE": "biotools:guide",
    "biotoolsID": "guide",
    "credit": [
        {
            "email": "jchoi@wehi.edu.au",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Guide (Genome Informatics Data Explorer) is a desktop application designed for the bench biologists to analyse RNA-Seq and microarray expression data. It performs gene-centric analyses such as differential expression and pathways using well-established R modules. It also integrates useful data from multiple sources, such as gene annotation and orthologue data, and enables editing of R commands to customise the analyses for advanced users.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://guide.wehi.edu.au/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://guide.wehi.edu.au/",
    "homepage_status": 1,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/guide-0-3-1-application-for-gene-expression-analysis.html"
        }
    ],
    "name": "Guide",
    "operatingSystem": [
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-14-688",
            "metadata": {
                "abstract": "Background: Multiplecompeting bioinformatics tools exist for next-generation sequencing data analysis. Many of these tools are available as R/Bioconductor modules, and it can be challenging for the bench biologist without any programming background to quickly analyse genomics data. Here, we present an application that is designed to be simple to use, while leveraging the power of R as the analysis engine behind the scenes. Results: Genome Informatics Data Explorer (Guide) is a desktop application designed for the bench biologist to analyse RNA-seq and microarray gene expression data. It requires a text file of summarised read counts or expression values as input data, and performs differential expression analyses at both the gene and pathway level. It uses well-established R/Bioconductor packages such as limma for its analyses, without requiring the user to have specific knowledge of the underlying R functions. Results are presented in figures or interactive tables which integrate useful data from multiple sources such as gene annotation and orthologue data. Advanced options include the ability to edit R commands to customise the analysis pipeline. Conclusions: Guide is a desktop application designed to query gene expression data in a user-friendly way while automatically communicating with R. Its customisation options make it possible to use different bioinformatics tools available through R/Bioconductor for its analyses, while keeping the core usage simple. Guide is written in the cross-platform framework of Qt, and is freely available for use from http://guide.wehi.edu.au. © 2013 Choi; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Choi J."
                    }
                ],
                "citationCount": 3,
                "date": "2013-10-07T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Guide: A desktop application for analysing gene expression data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Pathways",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}