{
    "additionDate": "2017-08-03T18:43:41Z",
    "biotoolsCURIE": "biotools:foundertracker",
    "biotoolsID": "foundertracker",
    "credit": [
        {
            "email": "FounderTracker@ligue-cancer.net",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Computational method for detecting significantly recurrent identity by descent (IBD) in a set of haplotypes. This tool was designed for the discovery of founder mutations in dense SNP array data from a population sample of tumors.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cit.ligue-cancer.net/FounderTracker/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://cit.ligue-cancer.net/FounderTracker/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/foundertracker-genome-wide-detection-founder-mutations-cancer-dense-tumor-snp-profiles.html"
        }
    ],
    "name": "FounderTracker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Dense genotype data can be used to detect chromosome fragments inherited from a common ancestor in apparently unrelated individuals. A disease-causing mutation inherited from a common founder may thus be detected by searching for a common haplotype signature in a sample population of patients. We present here FounderTracker, a computational method for the genome-wide detection of founder mutations in cancer using dense tumor SNP profiles. Our method is based on two assumptions. First, the wild-type allele frequently undergoes loss of heterozygosity (LOH) in the tumors of germline mutation carriers. Second, the overlap between the ancestral chromosome fragments inherited from a common founder will define a minimal haplotype conserved in each patient carrying the founder mutation. Our approach thus relies on the detection of haplotypes with significant identity by descent (IBD) sharing within recurrent regions of LOH to highlight genomic loci likely to harbor a founder mutation. We validated this approach by analyzing two real cancer data sets in which we successfully identified founder mutations of well-characterized tumor suppressor genes. We then used simulated data to evaluate the ability of our method to detect IBD tracts as a function of their size and frequency. We show that FounderTracker can detect haplotypes of low prevalence with high power and specificity, significantly outperforming existing methods. FounderTracker is thus a powerful tool for discovering unknown founder mutations that may explain part of the \"missing\" heritability in cancer. This method is freely available and can be used online at the FounderTracker website. © 2012 Letouzé et al.",
                "authors": [
                    {
                        "name": "Letouze E."
                    },
                    {
                        "name": "Sow A."
                    },
                    {
                        "name": "Petel F."
                    },
                    {
                        "name": "Rosati R."
                    },
                    {
                        "name": "Figueiredo B.C."
                    },
                    {
                        "name": "Burnichon N."
                    },
                    {
                        "name": "Gimenez-Roqueplo A.-P."
                    },
                    {
                        "name": "Lalli E."
                    },
                    {
                        "name": "de Reynies A."
                    }
                ],
                "citationCount": 7,
                "date": "2012-05-02T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Identity by descent mapping of founder mutations in cancer using high-resolution tumor SNP data"
            },
            "pmid": "22567117"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}