{
    "additionDate": "2021-01-18T10:33:43Z",
    "biotoolsCURIE": "biotools:assemblx",
    "biotoolsID": "assemblx",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hochrein@uni-potsdam.de",
            "name": "Lena Hochrein",
            "typeEntity": "Person"
        }
    ],
    "description": "The AssemblX Toolkit for Reliable and User-Friendly Multigene Assemblies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.AssemblX.org",
    "lastUpdate": "2021-01-28T20:51:36Z",
    "name": "AssemblX",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-0908-8_3",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.The implementation of complex cloning projects covering the assembly of entire biological pathways or large genetic circuits poses a major challenge in the field of biotechnology and synthetic biology, as such projects can be costly and time-consuming. To overcome these difficulties, we developed the software-assisted AssemblX toolkit, which allows even unexperienced users to design, build, and subsequently test large DNA constructs. Currently, AssemblX allows the assembly of up to 25 functional units (e.g., genes), from 75 or more subunits (e.g., promoters, coding sequences, terminators). At the first assembly level, AssemblX uses overlap-based, scar-free, and sequence-independent cloning methods. This allows the unrestricted design at the gene level without the need for laborious parts domestication. The standardized, polymerase chain reaction–free, and virtually sequence-independent assembly into multigene modules relies on rare cutting homing endonucleases and computationally optimized overlap sequences. Selection and marker switching strategies ensure an effective process, and the assembly product can be transferred to any desired expression host.",
                "authors": [
                    {
                        "name": "Hochrein L."
                    },
                    {
                        "name": "Machens F."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "The assemblx toolkit for reliable and user-friendly multigene assemblies"
            },
            "pmid": "32809192"
        },
        {
            "doi": "10.1093/nar/gkx034",
            "metadata": {
                "abstract": "© The Author(s) 2017.The assembly of large DNA constructs coding for entire pathways poses a major challenge in the field of synthetic biology. Here, we present AssemblX, a novel, user-friendly and highly efficient multi-gene assembly strategy. The software-assisted AssemblX process allows even unexperienced users to rapidly design, build and test DNA constructs with currently up to 25 functional units, from 75 or more subunits. At the gene level, AssemblX uses scar-free, overlapbased and sequence-independent methods, allowing the unrestricted design of transcriptional units without laborious parts domestication. The assembly into multi-gene modules is enabled via a standardized, highly efficient, polymerase chain reaction-free and virtually sequence-independent scheme, which relies on rare cutting restriction enzymes and optimized adapter sequences. Selection and marker switching strategies render the whole process reliable, rapid and very effective. The assembly product can be easily transferred to any desired expression host, making AssemblX useful for researchers from various fields.",
                "authors": [
                    {
                        "name": "Gremmels J."
                    },
                    {
                        "name": "Hochrein L."
                    },
                    {
                        "name": "Machens F."
                    },
                    {
                        "name": "Messerschmidt K."
                    },
                    {
                        "name": "Mueller-Roeber B."
                    },
                    {
                        "name": "Schulz K."
                    }
                ],
                "citationCount": 11,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AssemblX: A user-friendly toolkit for rapid and reliable multi-gene assemblies"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite",
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
