{
    "additionDate": "2017-08-03T18:36:00Z",
    "biotoolsCURIE": "biotools:astral",
    "biotoolsID": "astral",
    "credit": [
        {
            "email": "smirarab@ucsd.edu",
            "name": "Siavash Mirarab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.utexas.edu/~smirarab/"
        }
    ],
    "description": "Java program for estimating a species tree given a set of unrooted gene trees.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/smirarab/ASTRAL"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://github.com/smirarab/ASTRAL",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T20:07:37.653830Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/astral-4-4-4-accurate-species-tree-algorithm.html"
        },
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://github.com/smirarab/ASTRAL"
        }
    ],
    "name": "ASTRAL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu462",
            "metadata": {
                "abstract": "Motivation: Species trees provide insight into basic biology, including the mechanisms of evolution and how it modifies biomolecular function and structure, biodiversity and co-evolution between genes and species. Yet, gene trees often differ from species trees, creating challenges to species tree estimation. One of the most frequent causes for conflicting topologies between gene trees and species trees is incomplete lineage sorting (ILS), which is modelled by the multi-species coalescent. While many methods have been developed to estimate species trees from multiple genes, some which have statistical guarantees under the multi-species coalescent model, existing methods are too computationally intensive for use with genome-scale analyses or have been shown to have poor accuracy under some realistic conditions. Results: We present ASTRAL, a fast method for estimating species trees from multiple genes. ASTRAL is statistically consistent, can run on datasets with thousands of genes and has outstanding accuracy- improving on MP-EST and the population tree from BUCKy, two statistically consistent leading coalescent-based methods. ASTRAL is often more accurate than concatenation using maximum likelihood, except when ILS levels are low or there are too few gene trees. © The Author 2014. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bayzid M.S."
                    },
                    {
                        "name": "Mirarab S."
                    },
                    {
                        "name": "Reaz R."
                    },
                    {
                        "name": "S. Swenson M."
                    },
                    {
                        "name": "Warnow T."
                    },
                    {
                        "name": "Zimmermann T."
                    }
                ],
                "citationCount": 880,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ASTRAL: Genome-scale coalescent-based species tree estimation"
            },
            "pmcid": "PMC4147915",
            "pmid": "25161245"
        },
        {
            "doi": "10.1093/bioinformatics/btv234",
            "metadata": {
                "abstract": "Motivation: The estimation of species phylogenies requires multiple loci, since different loci can have different trees due to incomplete lineage sorting, modeled by the multi-species coalescent model. We recently developed a coalescent-based method, ASTRAL, which is statistically consistent under the multi-species coalescent model and which is more accurate than other coalescent-based methods on the datasets we examined. ASTRAL runs in polynomial time, by constraining the search space using a set of allowed 'bipartitions'. Despite the limitation to allowed bipartitions, ASTRAL is statistically consistent. Results: We present a new version of ASTRAL, which we call ASTRAL-II. We show that ASTRAL-II has substantial advantages over ASTRAL: it is faster, can analyze much larger datasets (up to 1000 species and 1000 genes) and has substantially better accuracy under some conditions. ASTRAL's running time is O(n2k|X|2), and ASTRAL-II's running time is O(nk|X|2), where n is the number of species, k is the number of loci and X is the set of allowed bipartitions for the search space.",
                "authors": [
                    {
                        "name": "Mirarab S."
                    },
                    {
                        "name": "Warnow T."
                    }
                ],
                "citationCount": 705,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ASTRAL-II: Coalescent-based species tree estimation with many hundreds of taxa and thousands of genes"
            },
            "pmcid": "PMC4765870",
            "pmid": "26072508"
        },
        {
            "doi": "10.1186/s12859-018-2129-y",
            "metadata": {
                "abstract": "Background: Evolutionary histories can be discordant across the genome, and such discordances need to be considered in reconstructing the species phylogeny. ASTRAL is one of the leading methods for inferring species trees from gene trees while accounting for gene tree discordance. ASTRAL uses dynamic programming to search for the tree that shares the maximum number of quartet topologies with input gene trees, restricting itself to a predefined set of bipartitions. Results: We introduce ASTRAL-III, which substantially improves the running time of ASTRAL-II and guarantees polynomial running time as a function of both the number of species (n) and the number of genes (k). ASTRAL-III limits the bipartition constraint set (X) to grow at most linearly with n and k. Moreover, it handles polytomies more efficiently than ASTRAL-II, exploits similarities between gene trees better, and uses several techniques to avoid searching parts of the search space that are mathematically guaranteed not to include the optimal tree. The asymptotic running time of ASTRAL-III in the presence of polytomies is O ( nk ) 1.726 D ((nk) (1.726) D where D=O(nk) is the sum of degrees of all unique nodes in input trees. The running time improvements enable us to test whether contracting low support branches in gene trees improves the accuracy by reducing noise. In extensive simulations, we show that removing branches with very low support (e.g., below 10%) improves accuracy while overly aggressive filtering is harmful. We observe on a biological avian phylogenomic dataset of 14K genes that contracting low support branches greatly improve results. Conclusions: ASTRAL-III is a faster version of the ASTRAL method for phylogenetic reconstruction and can scale up to 10,000 species. With ASTRAL-III, low support branches can be removed, resulting in improved accuracy.",
                "authors": [
                    {
                        "name": "Mirarab S."
                    },
                    {
                        "name": "Rabiee M."
                    },
                    {
                        "name": "Sayyari E."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "citationCount": 1352,
                "date": "2018-05-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ASTRAL-III: Polynomial time species tree reconstruction from partially resolved gene trees"
            },
            "pmcid": "PMC5998893",
            "pmid": "29745866"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
