{
    "additionDate": "2023-01-25T11:01:19.528168Z",
    "biotoolsCURIE": "biotools:white_rabbit",
    "biotoolsID": "white_rabbit",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "credit": [
        {
            "name": "Observational Health Data Sciences and Informatics OHDSI",
            "typeEntity": "Consortium"
        }
    ],
    "description": "WhiteRabbit is a software tool to help prepare for ETLs (Extraction, Transformation, Loading) of longitudinal healthcare databases into the OMOP Common Data Model (CDM). The source data can be in comma-separated text files, or in a database (MySQL, SQL Server, ORACLE, PostgreSQL); the CDM will be in a database (MySQL, SQL Server, PostgreSQL).\n\nThe main function of WhiteRabbit is to perform a scan of the source data, providing detailed information on the tables, fields, and values that appear in a field. This scan will generate a report that can be used as a reference when designing the ETL, for instance when using the Rabbit-In-a-Hat tool. Rabbit-In-a-Hat uses the scan document and displays source data information through a graphical user interface to allow a user to connect source data structure to the CDM data structure. The function of Rabbit-In-a-Hat is to generate documentation for the ETL process, not generate code to create an ETL.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/OHDSI/WhiteRabbit"
        }
    ],
    "editPermission": {
        "authors": [
            "iacs-biocomputacion"
        ],
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://ohdsi.github.io/WhiteRabbit/",
    "lastUpdate": "2023-02-01T12:05:20.887615Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://www.ohdsi.org/analytic-tools/whiterabbit-for-etl-design/"
        }
    ],
    "name": "White Rabbit",
    "owner": "iacs-biocomputacion",
    "version": [
        "v0.10.7"
    ]
}
