{
    "additionDate": "2021-03-19T09:10:34Z",
    "biotoolsCURIE": "biotools:icebear",
    "biotoolsID": "icebear",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rik.wierenga@oulu.fi",
            "name": "Rik K. Wierenga",
            "orcidid": "https://orcid.org/0000-0001-6554-471X",
            "typeEntity": "Person"
        }
    ],
    "description": "An intuitive and versatile web application for research-data tracking from crystallization experiment to PDB deposition.\n\nIceBear is a research data management tool for structural biology. It currently covers crystallization trials, crystal fishing and shipping, as well as linking crystals, datasets, and PDB depositions for full chain of custody. It gives you a highly task-focused interface and a flexible access rights system. And it's FREE to download and install in your lab.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Protein architecture recognition",
                    "uri": "http://edamontology.org/operation_2475"
                }
            ]
        }
    ],
    "homepage": "https://icebear.fi/",
    "lastUpdate": "2021-03-31T18:11:20Z",
    "name": "IceBear",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1107/S2059798320015223",
            "metadata": {
                "abstract": "© 2021 International Union of Crystallography. All rights reserved.The web-based IceBear software is a versatile tool to monitor the results of crystallization experiments and is designed to facilitate supervisor and student communications. It also records and tracks all relevant information from crystallization setup to PDB deposition in protein crystallography projects. Fully automated data collection is now possible at several synchrotrons, which means that the number of samples tested at the synchrotron is currently increasing rapidly. Therefore, the protein crystallography research communities at the University of Oulu, Weizmann Institute of Science and Diamond Light Source have joined forces to automate the uploading of sample metadata to the synchrotron. In IceBear, each crystal selected for data collection is given a unique sample name and a crystal page is generated. Subsequently, the metadata required for data collection are uploaded directly to the ISPyB synchrotron database by a shipment module, and for each sample a link to the relevant ISPyB page is stored. IceBear allows notes to be made for each sample during cryocooling treatment and during data collection, as well as in later steps of the structure determination. Protocols are also available to aid the recycling of pins, pucks and dewars when the dewar returns from the synchrotron. The IceBear database is organized around projects, and project members can easily access the crystallization and diffraction metadata for each sample, as well as any additional information that has been provided via the notes. The crystal page for each sample connects the crystallization, diffraction and structural information by providing links to the IceBear drop-viewer page and to the ISPyB data-collection page, as well as to the structure deposited in the Protein Data Bank.",
                "authors": [
                    {
                        "name": "Ashton AlunW."
                    },
                    {
                        "name": "Biterova E."
                    },
                    {
                        "name": "Cordara G."
                    },
                    {
                        "name": "Dalwani S."
                    },
                    {
                        "name": "Daniel E."
                    },
                    {
                        "name": "Dym O."
                    },
                    {
                        "name": "Kiema T.-R."
                    },
                    {
                        "name": "Kristian Koski M."
                    },
                    {
                        "name": "Lehtio L."
                    },
                    {
                        "name": "Maksimainen M.M."
                    },
                    {
                        "name": "Murthy S.N."
                    },
                    {
                        "name": "Prilusky J."
                    },
                    {
                        "name": "Ratas V."
                    },
                    {
                        "name": "Smith N."
                    },
                    {
                        "name": "Sridhar S."
                    },
                    {
                        "name": "Sussman JoelL."
                    },
                    {
                        "name": "Tanvir Rahman M."
                    },
                    {
                        "name": "Venkatesan R."
                    },
                    {
                        "name": "Wierenga RikK."
                    }
                ],
                "citationCount": 2,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "IceBear: An intuitive and versatile web application for research-data tracking from crystallization experiment to PDB deposition"
            },
            "pmcid": "PMC7869904",
            "pmid": "33559605"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
