{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:13:10Z",
    "biotoolsCURIE": "biotools:SUSPECT-BDQ",
    "biotoolsID": "SUSPECT-BDQ",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "david.ascher@unimelb.edu.au",
            "name": "David B. Ascher",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mcsm.ppi2@gmail.com",
            "typeEntity": "Project"
        }
    ],
    "description": "StrUctural Susceptibility PrEdiCTion on BDQ.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://biosig.unimelb.edu.au/suspect_bdq/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://biosig.unimelb.edu.au/suspect_bdq/",
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "SUSPECT-BDQ",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0217169",
            "metadata": {
                "abstract": "© 2019 Karmakar et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Clinical resistance against Bedaquiline, the first new anti-tuberculosis compound with a novel mechanism of action in over 40 years, has already been detected in Mycobacterium tuberculosis. As a new drug, however, there is currently insufficient clinical data to facilitate reliable and timely identification of genomic determinants of resistance. Here we investigate the structural basis for M. tuberculosis associated bedaquiline resistance in the drug target, AtpE. Together with the 9 previously identified resistance-associated variants in AtpE, 54 non-resistance-associated mutations were identified through comparisons of bedaquiline susceptibility across 23 different mycobacterial species. Computational analysis of the structural and functional consequences of these variants revealed that resistance associated variants were mainly localized at the drug binding site, disrupting key interactions with bedaquiline leading to reduced binding affinity. This was used to train a supervised predictive algorithm, which accurately identified likely resistance mutations (93.3% accuracy). Application of this model to circulating variants present in the Asia-Pacific region suggests that current circulating variants are likely to be susceptible to bedaquiline. We have made this model freely available through a user-friendly web interface called SUSPECT-BDQ, StrUctural Susceptibility PrEdiCTion for bedaquiline (http://biosig.unimelb.edu.au/suspect_ bdq/). This tool could be useful for the rapid characterization of novel clinical variants, to help guide the effective use of bedaquiline, and to minimize the spread of clinical resistance.",
                "authors": [
                    {
                        "name": "Ascher D.B."
                    },
                    {
                        "name": "Denholm J."
                    },
                    {
                        "name": "Dunstan S.J."
                    },
                    {
                        "name": "Holt K.E."
                    },
                    {
                        "name": "Karmakar M."
                    },
                    {
                        "name": "Rodrigues C.H.M."
                    }
                ],
                "citationCount": 18,
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Empirical ways to identify novel Bedaquiline resistance mutations in AtpE"
            },
            "pmcid": "PMC6541270",
            "pmid": "31141524",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
