{
    "additionDate": "2018-04-22T15:49:04Z",
    "biotoolsCURIE": "biotools:kassiopeia",
    "biotoolsID": "kassiopeia",
    "credit": [
        {
            "email": "mako@nmr.mpibpc.mpg.de",
            "name": "Dr. Martin Kollmar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web application for the generation, storage, and presentation of genome-wide analyses of mutually exclusive exonomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://kassiopeia.motorprotein.de/kassiopeia_help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://kassiopeia.motorprotein.de/kassiopeia",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "Kassiopeia",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-115",
            "metadata": {
                "abstract": "Background: Alternative splicing is an important process in higher eukaryotes that allows obtaining several transcripts from one gene. A specific case of alternative splicing is mutually exclusive splicing, in which exactly one exon out of a cluster of neighbouring exons is spliced into the mature transcript. Recently, a new algorithm for the prediction of these exons has been developed based on the preconditions that the exons of the cluster have similar lengths, sequence homology, and conserved splice sites, and that they are translated in the same reading frame. Description: In this contribution we introduce Kassiopeia, a database and web application for the generation, storage, and presentation of genome-wide analyses of mutually exclusive exomes. Currently, Kassiopeia provides access to the mutually exclusive exomes of twelve Drosophila species, the thale cress Arabidopsis thaliana, the flatworm Caenorhabditis elegans, and human. Mutually exclusive spliced exons (MXEs) were predicted based on gene reconstructions from Scipio. Based on the standard prediction values, with which 83.5% of the annotated MXEs of Drosophila melanogaster were reconstructed, the exomes contain surprisingly more MXEs than previously supposed and identified. The user can search Kassiopeia using BLAST or browse the genes of each species optionally adjusting the parameters used for the prediction to reveal more divergent or only very similar exon candidates. Conclusions: We developed a pipeline to predict MXEs in the genomes of several model organisms and a web interface, Kassiopeia, for their visualization. For each gene Kassiopeia provides a comprehensive gene structure scheme, the sequences and predicted secondary structures of the MXEs, and, if available, further evidence for MXE candidates from cDNA/EST data, predictions of MXEs in homologous genes of closely related species, and RNA secondary structure predictions. Kassiopeia can be accessed at http://www.motorprotein.de/kassiopeia. © 2014 Hatje and Kollmar; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hatje K."
                    },
                    {
                        "name": "Kollmar M."
                    }
                ],
                "citationCount": 10,
                "date": "2014-02-10T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Kassiopeia: A database and web application for the analysis of mutually exclusive exomes of eukaryotes"
            },
            "pmcid": "PMC3923563",
            "pmid": "24507667"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
