{
    "additionDate": "2019-11-14T18:03:00Z",
    "biotoolsCURIE": "biotools:AtbPpred",
    "biotoolsID": "AtbPpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "weileyi@tju.edu.cn",
            "name": "Leyi Wei",
            "typeEntity": "Person"
        },
        {
            "email": "glee@ajou.ac.kr",
            "name": "Gwang Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "A Robust Sequence-Based Prediction of Anti-Tubercular Peptides Using Extremely Randomized Trees | Welcome to the Home Page of AtbPpred | AtbPpred is a web based two-layer prediction server for anti-tubercular peptides. In the first layer, we applied a two-step feature selection procedure and identified the optimal feature set individually for nine different feature encodings, whose corresponding models were developed using extremely randomized tree (ERT). In the second-layer, the predicted probability of AtbPs from the above nine models were considered as input features to ERT and developed the final predictor. For a given peptide, AtbPpred predicts its class and probability values",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://thegleelab.org/AtbPpred",
    "lastUpdate": "2020-12-09T13:27:00Z",
    "name": "AtbPpred",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2019.06.024",
            "metadata": {
                "abstract": "© 2019 The AuthorsMycobacterium tuberculosis is one of the most dangerous pathogens in humans. It acts as an etiological agent of tuberculosis (TB), infecting almost one-third of the world's population. Owing to the high incidence of multidrug-resistant TB and extensively drug-resistant TB, there is an urgent need for novel and effective alternative therapies. Peptide-based therapy has several advantages, such as diverse mechanisms of action, low immunogenicity, and selective affinity to bacterial cell envelopes. However, the identification of anti-tubercular peptides (AtbPs) via experimentation is laborious and expensive; hence, the development of an efficient computational method is necessary for the prediction of AtbPs prior to both in vitro and in vivo experiments. To this end, we developed a two-layer machine learning (ML)-based predictor called AtbPpred for the identification of AtbPs. In the first layer, we applied a two-step feature selection procedure and identified the optimal feature set individually for nine different feature encodings, whose corresponding models were developed using extremely randomized tree (ERT). In the second-layer, the predicted probability of AtbPs from the above nine models were considered as input features to ERT and developed the final predictor. AtbPpred respectively achieved average accuracies of 88.3% and 87.3% during cross-validation and an independent evaluation, which were ~8.7% and 10.0% higher than the state-of-the-art method. Furthermore, we established a user-friendly webserver which is currently available at http://thegleelab.org/AtbPpred. We anticipate that this predictor could be useful in the high-throughput prediction of AtbPs and also provide mechanistic insights into its functions.",
                "authors": [
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Basith S."
                    },
                    {
                        "name": "Shin T.H."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Lee G."
                    }
                ],
                "citationCount": 43,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "AtbPpred: A Robust Sequence-Based Prediction of Anti-Tubercular Peptides Using Extremely Randomized Trees"
            },
            "pmcid": "PMC6658830",
            "pmid": "31372196"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}