{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-20T10:54:25Z",
    "biotoolsCURIE": "biotools:spainudp",
    "biotoolsID": "spainudp",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elopez@isciii.es",
            "name": "Estrella López-Martín",
            "orcidid": "https://orcid.org/0000-0003-3212-1424",
            "typeEntity": "Person"
        }
    ],
    "description": "The Spanish Undiagnosed Rare Diseases Program.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://spainudp.isciii.es",
    "lastUpdate": "2021-05-20T06:23:41Z",
    "name": "SpainUDP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.20944/PREPRINTS201806.0216.V1"
        },
        {
            "doi": "10.3390/IJERPH15081746",
            "metadata": {
                "abstract": "© 2018 by the authors. Licensee MDPI, Basel, Switzerland.One of the IRDiRC goals for 2017–2027 is to achieve definitive diagnosis for rare undiagnosed diseases within one year, as delay in diagnosis remains one of the pending issues in the rare diseases field. The Spanish Undiagnosed Rare Diseases Program (SpainUDP) was created in response to this challenging scenario to cover patients’ needs and after seeing the success of the Undiagnosed Diseases Program (UDP) in the USA. SpainUDP offers a multidisciplinary approach to those patients who have long sought a diagnosis without any success. During the first phase of the protocol, undiagnosed cases are sent to SpainUDP by individual patients or families, patient organizations or hospitals. After careful analysis of phenotype, data from sequencing experiments (WES) is processed with a standard pipeline and detailed standardized phenotypic information (mapped to the Human Phenotype Ontology, HPO) is connected to genetic data. In addition, the participation of SpainUDP in international initiatives such as the European projects RD-Connect and Solve RD, the Undiagnosed Diseases Network International (UDNI), and the MatchMaker Exchange (MME) platform, allows the establishment of a global data sharing strategy across multiple projects submitting data to these international initiatives. From the official beginning of the program (at the end of 2015) until early 2018, 147 cases were accepted in SpainUDP. During this time, 37 cases (25%) dropped out the program due to several reasons. The remaining 110 cases are distributed as follows: phenotypic and genotypic (WES) characterization was finished in 30 cases, of which 20 (67%) were diagnosed; 21 cases are pending on variants’ validation by Sanger sequencing; in 25 cases, WES is ongoing and 34 cases are being studied for deep phenotypic characterization. In conclusion, SpainUDP aims to achieve a diagnosis following two recommendations of the IRDiRC: the patients’ diagnosis in as short a time as possible and the promotion of data sharing (especially genomic) at the international level.",
                "authors": [
                    {
                        "name": "Alonso J."
                    },
                    {
                        "name": "Bermejo-Sanchez E."
                    },
                    {
                        "name": "Lopez-Martin E."
                    },
                    {
                        "name": "Martinez-Delgado B."
                    }
                ],
                "citationCount": 7,
                "date": "2018-08-14T00:00:00Z",
                "journal": "International Journal of Environmental Research and Public Health",
                "title": "SpainUDP: The Spanish undiagnosed rare diseases program"
            },
            "pmcid": "PMC6121381",
            "pmid": "30110963"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
