{
    "additionDate": "2021-10-11T08:34:24.837556Z",
    "biotoolsCURIE": "biotools:ms-hbm",
    "biotoolsID": "ms-hbm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thomas.yeo@nus.edu.sg",
            "name": "B T Thomas Yeo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MS-HBM is script for individual-specific areal-level parcellations improve functional connectivity prediction of behavior. A multi-session hierarchical Bayesian model (MS-HBM) for estimating high-quality individual-specific network-level parcellations. Here, we extend the model to estimate individual-specific areal-level parcellations. While network-level parcellations comprise spatially distributed networks spanning the cortex, the consensus is that areal-level parcels should be spatially localized, i.e., should not span multiple lobes. There is disagreement about whether areal-level parcels should be strictly contiguous or comprise multiple non-contiguous components, therefore we considered three areal-level MS-HBM variants spanning these range of possibilities: distributed MS-HBM (dMSHBM), contiguous MS-HBM (cMSHBM) and gradient-infused MS-HBM (gMSHBM).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ThomasYeoLab/CBIG/tree/master/stable_projects/brain_parcellation/Kong2022_ArealMSHBM",
    "lastUpdate": "2021-10-11T08:36:45.830668Z",
    "name": "MS-HBM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/CERCOR/BHAB101",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Resting-state functional magnetic resonance imaging (rs-fMRI) allows estimation of individual-specific cortical parcellations. We have previously developed a multi-session hierarchical Bayesian model (MS-HBM) for estimating high-quality individual-specific network-level parcellations. Here, we extend the model to estimate individual-specific areal-level parcellations. While network-level parcellations comprise spatially distributed networks spanning the cortex, the consensus is that areal-level parcels should be spatially localized, that is, should not span multiple lobes. There is disagreement about whether areal-level parcels should be strictly contiguous or comprise multiple noncontiguous components; therefore, we considered three areal-level MS-HBM variants spanning these range of possibilities. Individual-specific MS-HBM parcellations estimated using 10 min of data generalized better than other approaches using 150 min of data to out-of-sample rs-fMRI and task-fMRI from the same individuals. Resting-state functional connectivity derived from MS-HBM parcellations also achieved the best behavioral prediction performance. Among the three MS-HBM variants, the strictly contiguous MS-HBM exhibited the best resting-state homogeneity and most uniform within-parcel task activation. In terms of behavioral prediction, the gradient-infused MS-HBM was numerically the best, but differences among MS-HBM variants were not statistically significant. Overall, these results suggest that areal-level MS-HBMs can capture behaviorally meaningful individual-specific parcellation features beyond group-level parcellations. Multi-resolution trained models and parcellations are publicly available (https://github.com/ThomasYeoLab/CBIG/tree/master/stable_projects/brain_parcellation/Kong2022_ArealMSHBM).",
                "authors": [
                    {
                        "name": "Kong R."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Gordon E."
                    },
                    {
                        "name": "Xue A."
                    },
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Orban C."
                    },
                    {
                        "name": "Zuo X.-N."
                    },
                    {
                        "name": "Spreng N."
                    },
                    {
                        "name": "Ge T."
                    },
                    {
                        "name": "Holmes A."
                    },
                    {
                        "name": "Eickhoff S."
                    },
                    {
                        "name": "Yeo B.T.T."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "Cerebral Cortex",
                "title": "Individual-Specific Areal-Level Parcellations Improve Functional Connectivity Prediction of Behavior"
            },
            "pmid": "33942058",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}