{
    "accessibility": "Open access",
    "additionDate": "2021-11-27T19:01:05.855807Z",
    "biotoolsCURIE": "biotools:eip",
    "biotoolsID": "eip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shaozhenfeng@whu.edu.cn",
            "name": "Zhenfeng Shao"
        }
    ],
    "description": "Enhanced image prior for unsupervised remoting sensing super-resolution.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jiaming-wang/EIP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-27T19:01:55.990165Z",
    "name": "EIP",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.NEUNET.2021.06.005",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdNumerous approaches based on training low-high resolution image pairs have been proposed to address the super-resolution (SR) task. Despite their success, low-high resolution image pairs are usually difficult to obtain in certain scenarios, and these methods are limited in the actual scene (unknown or non-ideal image acquisition process). In this paper, we proposed a novel unsupervised learning framework, termed Enhanced Image Prior (EIP), which achieves SR tasks without low/high resolution image pairs. We first feed random noise maps into a designed generative adversarial network (GAN) for satellite image SR reconstruction. Then, we convert the reference image to latent space as the enhanced image prior. Finally, we update the input noise in the latent space with a recurrent updating strategy, and further transfer the texture and structured information from the reference image. Results on extensive experiments on the Draper dataset show that EIP achieves significant improvements over state-of-the-art unsupervised SR methods both quantitatively and qualitatively. Our experiments on satellite (SuperView-1) images reveal the potential of the proposed approach in improving the resolution of remote sensing imagery compared with the supervised algorithms. Source code is available at https://github.com/jiaming-wang/EIP.",
                "authors": [
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Lu T."
                    },
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Shao Z."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "Neural Networks",
                "title": "Enhanced image prior for unsupervised remoting sensing super-resolution"
            },
            "pmid": "34237613"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
