{
    "additionDate": "2020-01-14T09:03:23Z",
    "biotoolsCURIE": "biotools:MEGARes_2.0",
    "biotoolsID": "MEGARes_2.0",
    "confidence_flag": "tool",
    "description": "a database for classification of antimicrobial drug, biocide and metal resistance determinants in metagenomic sequence data.\n\nMEGAResFrom MEG, the Microbial Ecology Group.\n\nWelcome to MEGARes: an Antimicrobial Database for High-Throughput Sequencing.\n\nThe MEGARes database contains sequence data for approximately 8,000 hand-curated antimicrobial resistance genes accompanied by an annotation structure that is optimized for use with high throughput sequencing. The acyclical annotation graph of MEGARes allows for accurate, count-based, hierarchical statistical analysis of resistance at the population level, much like microbiome analysis, and is also designed to be used as a training database for the creation of statistical classifiers (Figure 1).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://megares.meglab.org",
    "lastUpdate": "2024-11-24T20:49:35.204285Z",
    "name": "MEGARes 2.0",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz1010",
            "metadata": {
                "abstract": "Antimicrobial resistance (AMR) is a threat to global public health and the identification of genetic determinants of AMR is a critical component to epidemiological investigations. High-throughput sequencing (HTS) provides opportunities for investigation of AMR across all microbial genomes in a sample (i.e. the metagenome). Previously, we presented MEGARes, a hand-curated AMR database and annotation structure developed to facilitate the analysis of AMR within metagenomic samples (i.e. the resistome). Along with MEGARes, we released AmrPlusPlus, a bioinformatics pipeline that interfaces with MEGARes to identify and quantify AMR gene accessions contained within a metagenomic sequence dataset. Here, we present MEGARes 2.0 (https://megares.meglab.org), which incorporates previously published resistance sequences for antimicrobial drugs, while also expanding to include published sequences for metal and biocide resistance determinants. In MEGARes 2.0, the nodes of the acyclic hierarchical ontology include four antimicrobial compound types, 57 classes, 220 mechanisms of resistance, and 1,345 gene groups that classify the 7,868 accessions. In addition, we present an updated version of AmrPlusPlus (AMR ++ version 2.0), which improves accuracy of classifications, as well as expanding scalability and usability.",
                "authors": [
                    {
                        "name": "Belk K.E."
                    },
                    {
                        "name": "Boucher C."
                    },
                    {
                        "name": "Dean C.J."
                    },
                    {
                        "name": "Doster E."
                    },
                    {
                        "name": "Lakin S.M."
                    },
                    {
                        "name": "Morley P.S."
                    },
                    {
                        "name": "Noyes N.R."
                    },
                    {
                        "name": "Wolfe C."
                    },
                    {
                        "name": "Young J.G."
                    }
                ],
                "citationCount": 225,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MEGARes 2.0: A database for classification of antimicrobial drug, biocide and metal resistance determinants in metagenomic sequence data"
            },
            "pmcid": "PMC7145535",
            "pmid": "31722416"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
