{
    "accessibility": "Open access",
    "additionDate": "2023-11-10T13:16:07.027971Z",
    "biotoolsCURIE": "biotools:espadon",
    "biotoolsID": "espadon",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "azemar@lpccaen.in2p3.fr",
            "name": "Nathan Azemar"
        },
        {
            "email": "cfontbonne@lpccaen.in2p3.fr",
            "name": "Cathy Fontbonne"
        }
    ],
    "description": "R package for automation, exploitation and processing of DICOM files in medical physics and clinical research.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://espadon.cnrs.fr/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:32:01.119290Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/espadon/"
        }
    ],
    "name": "espadon",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.ejmp.2023.102580",
            "metadata": {
                "abstract": "Introduction: One of the main issues in the field of clinical research is to enhance clinical databases with information from imaging (CT, MR, PET-scan), contouring (RTstruct), or produced by TPS such as dose distribution (RTdose) or treatment plans (RTplan). To perform these analyses automatically, we propose the new open-source package “espadon”, developed in R environment. This package also opens up numerous perspectives for TPS-independant calculation, automation and processing of DICOM data. Results: The espadon package converts DICOM objects into espadon objects. Several tools have been developed to manipulate these objects and extract the desired information. In addition to decode DICOM files and pseudonomize them, the great advantage of espadon is that it presents the links between patient data (images, structures, treatment plans) in a didactic way, respecting the dates of the examinations. It can visualize volumes or structures in 2D or 3D, resample volumes, segment them, and change geometric frames of reference. It integrates dose-volume histogram functions on a selection, with Monte Carlo calculations of random shifts of contours. It offers the automatic calculation of several usual radiotherapy indices, as well as the calculation of Gamma and Chi indices. Conclusions: Espadon is a toolkit designed to be easily used by radiotherapists, medical physicists or students. Espadon's functions are implemented in an R script, and allow the automatic extraction or calculation of data from DICOM files, which can be used for statistical modelling or machine-learning in the R environment. This package is available on the Comprehensive R Archive Network (CRAN) repository.",
                "authors": [
                    {
                        "name": "Azemar N."
                    },
                    {
                        "name": "Fontbonne C."
                    },
                    {
                        "name": "Fontbonne J.-M."
                    }
                ],
                "citationCount": 1,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Physica Medica",
                "title": "Espadon, an R package for automation, exploitation and processing of DICOM files in medical physics and clinical research"
            },
            "pmid": "37100009",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
