{
    "additionDate": "2021-01-18T11:45:02Z",
    "biotoolsCURIE": "biotools:gp4",
    "biotoolsID": "gp4",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "j.m.van.dijl01@umcg.nl",
            "name": "Jan Maarten van Dijl",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated Gram-Positive Protein Prediction Pipeline for subcellular localization mimicking bacterial sorting.\n\nGram-Positive Protein Prediction Pipeline.\n\nGP4 - Gram Positive Protein Prediction Pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://gp4.hpc.rug.nl/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-25T08:59:45Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/grassoste/GP4_standalone"
        }
    ],
    "name": "GP4",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA302",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Subcellular localization is a critical aspect of protein function and the potential application of proteins either as drugs or drug targets, or in industrial and domestic applications. However, the experimental determination of protein localization is time consuming and expensive. Therefore, various localization predictors have been developed for particular groups of species. Intriguingly, despite their major representation amongst biotechnological cell factories and pathogens, a meta-predictor based on sorting signals and specific for Gram-positive bacteria was still lacking. Here we present GP4, a protein subcellular localization meta-predictor mainly for Firmicutes, but also Actinobacteria, based on the combination of multiple tools, each specific for different sorting signals and compartments. Novelty elements include improved cell-wall protein prediction, including differentiation of the type of interaction, prediction of non-canonical secretion pathway target proteins, separate prediction of lipoproteins and better user experience in terms of parsability and interpretability of the results. GP4 aims at mimicking protein sorting as it would happen in a bacterial cell. As GP4 is not homology based, it has a broad applicability and does not depend on annotated databases with homologous proteins. Non-canonical usage may include little studied or novel species, synthetic and engineered organisms, and even re-use of the prediction data to develop custom prediction algorithms. Our benchmark analysis highlights the improved performance of GP4 compared to other widely used subcellular protein localization predictors. A webserver running GP4 is available at http://gp4.hpc.rug.nl/.",
                "authors": [
                    {
                        "name": "Grasso S."
                    },
                    {
                        "name": "van Dijl J.M."
                    },
                    {
                        "name": "van Rij T."
                    }
                ],
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "GP4: an integrated Gram-Positive Protein Prediction Pipeline for subcellular localization mimicking bacterial sorting"
            },
            "pmid": "33227814"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
