{
    "additionDate": "2021-01-18T07:42:04Z",
    "biotoolsCURIE": "biotools:phagereceptor",
    "biotoolsID": "phagereceptor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pys2013@hnu.edu.cn",
            "name": "Yousong Peng",
            "typeEntity": "Person"
        }
    ],
    "description": "Phage protein receptors have multiple interaction partners and high expressions.\n\nA knowledge resource to understand virus diversity.\n\nphageReceptor is a database of phage-host receptor interactions, which included 427 pairs of phage-host receptor interactions, 341 unique viral species/sub-species, and 69 bacterial species. Based on phageReceptor, we systematically analyzed the associations between phage-host receptor interactions, and characterized the phage protein receptors by structure, function, protein-protein interaction and expression. If you use this database, please cite the following manuscript: Phage protein receptors have multiple interaction partners and high expressions (see more details).\n\nPMID: doi: 10.11843/j.issn.0366-6964.2018.11.018 D01083026.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.computationalbiology.cn/phageReceptor/index.html",
    "lastUpdate": "2021-02-04T07:39:25Z",
    "name": "phageReceptor",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA123",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Receptors on host cells play a critical role in viral infection. How phages select receptors is still unknown. Results: Here, we manually curated a high-quality database named phageReceptor, including 427 pairs of phage-host receptor interactions, 341 unique viral species or sub-species and 69 bacterial species. Sugars and proteins were most widely used by phages as receptors. The receptor usage of phages in Gram-positive bacteria was different from that in Gram-negative bacteria. Most protein receptors were located on the outer membrane. The phage protein receptors (PPRs) were highly diverse in their structures, and had little sequence identity and no common protein domain with mammalian virus receptors. Further functional characterization of PPRs in Escherichia coli showed that they had larger node degrees and betweennesses in the protein-protein interaction network, and higher expression levels, than other outer membrane proteins, plasma membrane proteins or other intracellular proteins. These findings were consistent with what observed for mammalian virus receptors reported in previous studies, suggesting that viral protein receptors tend to have multiple interaction partners and high expressions. The study deepens our understanding of virus-host interactions.",
                "authors": [
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Yu F."
                    },
                    {
                        "name": "Zou Y."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "Wu A."
                    },
                    {
                        "name": "Jiang T."
                    },
                    {
                        "name": "Peng Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Phage protein receptors have multiple interaction partners and high expressions"
            },
            "pmid": "32096819"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}