
{
    "credit": [
        {
            "name": "Jordi Espadaler",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Oriol Fornes",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "upf.edu",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "baldo.oliva@upf.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://sbi.imim.es/modlink/modlinkhelp.html"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence (raw)",
                        "uri": "http://edamontology.org/data_2974"
                    },
                    "format": [
                        {
                            "term": "unambiguous pure protein",
                            "uri": "http://edamontology.org/format_1218"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API"
        ],
        "topic": [
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            }
        ]
    },
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp238",
            "pmcid": "PMC2687990",
            "pmid": "19357100",
            "type": "Primary"
        },
        {
            "abstract": "The function of an uncharacterized protein is usually inferred either from its homology to, or its interactions with, characterized proteins. Here, we use both sequence similarity and protein interactions to identify relationships between remotely related protein sequences. We rely on the fact that homologous sequences share similar interactions, and, therefore, the set of interacting partners of the partners of a given protein is enriched by its homologs. The approach was benchmarked by assigning the fold and functional family to test sequences of known structure. Specifically, we relied on 1,434 proteins with known folds, as defined in the Structural Classification of Proteins (SCOP) database, and with known interacting partners, as defined in the Database of Interacting Proteins (DIP). For this subset, the specificity of fold assignment was increased from 54% for position-specific iterative BLAST to 75% for our approach, with a concomitant increase in sensitivity for a few percentage points. Similarly, the specificity of family assignment at the e-value threshold of 10-8 was increased from 70% to 87%. The proposed method would be a useful tool for large-scale automated discovery of remote relationships between protein sequences, given its unique reliance on sequence similarity and protein-protein interactions. © 2005 by The National Academy of Sciences of the USA.",
            "authors": [
                "Espadaler J.",
                "Aragues R.",
                "Eswar N.",
                "Marti-Renom M.A.",
                "Querol E.",
                "Aviles F.X.",
                "Sali A.",
                "Oliva B."
            ],
            "cit_count": 23,
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "pmid": "15883372",
            "title": "Detecting remotely related proteins by their interactions and sequence similarity",
            "type": "Other",
            "year": "2005-05-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:modlink",
        "biotoolsID": "modlink",
        "description": "A tool predicts protein fold domain and family by means of sequence similarity and a relevant number of similar interactions (the same partners or is potential homologs).",
        "homepage": "http://sbi.imim.es/modlink/",
        "name": "ModLink+",
        "version": [
            "1"
        ]
    }
}