{
    "additionDate": "2016-04-22T12:06:06Z",
    "biotoolsCURIE": "biotools:modlink",
    "biotoolsID": "modlink",
    "credit": [
        {
            "email": "baldo.oliva@upf.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Jordi Espadaler",
            "orcidid": "http://orcid.org/0000-0002-0128-8363",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Oriol Fornes",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "upf.edu",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A tool predicts protein fold domain and family by means of sequence similarity and a relevant number of similar interactions (the same partners or is potential homologs).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sbi.imim.es/modlink/modlinkhelp.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence (raw)",
                        "uri": "http://edamontology.org/data_2974"
                    },
                    "format": [
                        {
                            "term": "unambiguous pure protein",
                            "uri": "http://edamontology.org/format_1218"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://sbi.imim.es/modlink/",
    "lastUpdate": "2018-12-29T13:56:39Z",
    "name": "ModLink+",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "baldo.oliva@upf.edu",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp238",
            "metadata": {
                "abstract": "Motivation: Several strategies have been developed to predict the fold of a target protein sequence, most of which are based on aligning the target sequence to other sequences of known structure. Previously, we demonstrated that the consideration of protein-protein interactions significantly increases the accuracy of fold assignment compared with PSI-BLAST sequence comparisons. A drawback of our method was the low number of proteins to which a fold could be assigned. Here, we present an improved version of the method that addresses this limitation. We also compare our method to other state-of-the-art fold assignment methodologies. Results: Our approach (ModLink+) has been tested on 3716 proteins with domain folds classified in the Structural Classification Of Proteins (SCOP) as well as known interacting partners in the Database of Interacting Proteins (DIP). For this test set, the ratio of success [positive predictive value (PPV)] on fold assignment increases from 75% for PSI-BLAST, 83% for HHSearch and 81% for PRC to >90% for ModLink+at the e-value cutoff of 10-3. Under this e-value, ModLink+can assign a fold to 30-45% of the proteins in the test set, while our previous method could cover <25%. When applied to 6384 proteins with unknown fold in the yeast proteome, ModLink+combined with PSI-BLAST assigns a fold for domains in 3738 proteins, while PSI-BLAST alone covers only 2122 proteins, HHSearch 2969 and PRC 2826 proteins, using a threshold e-value that would represent a PPV >82% for each method in the test set. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Aragues R."
                    },
                    {
                        "name": "Espadaler J."
                    },
                    {
                        "name": "Fornes O."
                    },
                    {
                        "name": "Marti-Renom M.A."
                    },
                    {
                        "name": "Oliva B."
                    },
                    {
                        "name": "Sali A."
                    }
                ],
                "citationCount": 12,
                "date": "2009-06-09T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ModLink+: Improving fold recognition by using protein-protein interactions"
            },
            "pmcid": "PMC2687990",
            "pmid": "19357100",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "The function of an uncharacterized protein is usually inferred either from its homology to, or its interactions with, characterized proteins. Here, we use both sequence similarity and protein interactions to identify relationships between remotely related protein sequences. We rely on the fact that homologous sequences share similar interactions, and, therefore, the set of interacting partners of the partners of a given protein is enriched by its homologs. The approach was benchmarked by assigning the fold and functional family to test sequences of known structure. Specifically, we relied on 1,434 proteins with known folds, as defined in the Structural Classification of Proteins (SCOP) database, and with known interacting partners, as defined in the Database of Interacting Proteins (DIP). For this subset, the specificity of fold assignment was increased from 54% for position-specific iterative BLAST to 75% for our approach, with a concomitant increase in sensitivity for a few percentage points. Similarly, the specificity of family assignment at the e-value threshold of 10-8 was increased from 70% to 87%. The proposed method would be a useful tool for large-scale automated discovery of remote relationships between protein sequences, given its unique reliance on sequence similarity and protein-protein interactions. © 2005 by The National Academy of Sciences of the USA.",
                "authors": [
                    {
                        "name": "Aragues R."
                    },
                    {
                        "name": "Aviles F.X."
                    },
                    {
                        "name": "Espadaler J."
                    },
                    {
                        "name": "Eswar N."
                    },
                    {
                        "name": "Marti-Renom M.A."
                    },
                    {
                        "name": "Oliva B."
                    },
                    {
                        "name": "Querol E."
                    },
                    {
                        "name": "Sali A."
                    }
                ],
                "citationCount": 24,
                "date": "2005-05-17T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Detecting remotely related proteins by their interactions and sequence similarity"
            },
            "pmid": "15883372",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
