
{
    "credit": [
        {
            "email": "merops@ebi.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.ebi.ac.uk/merops/about/index.shtml"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Indexing",
                    "uri": "http://edamontology.org/operation_0227"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Peptidases, their substrates and inhibitors are of great relevance to biology, medicine and biotechnology. The MEROPS database (http://merops.sanger.ac.uk) aims to fulfil the need for an integrated source of information about these. The database has a hierarchical classification in which homologous sets of peptidases and protein inhibitors are grouped into protein species, which are grouped into families, which are in turn grouped into clans. The classification framework is used for attaching information at each level. An important focus of the database has become distinguishing one peptidase from another through identifying the specificity of the peptidase in terms of where it will cleave substrates and with which inhibitors it will interact. We have collected over 39 000 known cleavage sites in proteins, peptides and synthetic substrates. These allow us to display peptidase specificity and alignments of protein substrates to give an indication of how well a cleavage site is conserved, and thus its probable physiological relevance. While the number of new peptidase families and clans has only grown slowly the number of complete genomes has greatly increased. This has allowed us to add an analysis tool to the relevant species pages to show significant gains and losses of peptidase genes relative to related species. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Rawlings N.D.",
                "Barrett A.J.",
                "Bateman A."
            ],
            "cit_count": 585,
            "journal": "Nucleic Acids Research",
            "pmid": "19892822",
            "title": "MEROPS: The peptidase database",
            "year": "2009-11-05"
        },
        {
            "abstract": "Peptidases, their substrates and inhibitors are of great relevance to biology, medicine and biotechnology. The MEROPS database (http://merops.sanger. ac.uk) aims to fulfil the need for an integrated source of information about these. The database has hierarchical classifications in which homologous sets of peptidases and protein inhibitors are grouped into protein species, which are grouped into families, which are in turn grouped into clans. The database has been expanded to include proteolytic enzymes other than peptidases. Special identifiers for peptidases from a variety of model organisms have been established so that orthologues can be detected in other species. A table of predicted active-site residue and metal ligand positions and the residue ranges of the peptidase domains in orthologues has been added to each peptidase summary. New displays of tertiary structures, which can be rotated or have the surfaces displayed, have been added to the structure pages. New indexes for gene names and peptidase substrates have been made available. Among the enhancements to existing features are the inclusion of small-molecule inhibitors in the tables of peptidase-inhibitor interactions, a table of known cleavage sites for each protein substrate, and tables showing the substrate-binding preferences of peptidases derived from combinatorial peptide substrate libraries. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Rawlings N.D.",
                "Barrett A.J.",
                "Bateman A."
            ],
            "cit_count": 607,
            "journal": "Nucleic Acids Research",
            "pmid": "22086950",
            "title": "MEROPS: The database of proteolytic enzymes, their substrates and inhibitors",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:merops",
        "biotoolsID": "merops",
        "description": "Collection of peptidases. The database has a hierarchical classification in which homologous sets of peptidases and protein inhibitors are grouped into protein species, which are grouped into families, which are in turn grouped into clans. The database can distinguish one peptidase from another through identifying the specificity of the peptidase in terms of where it will cleave substrates and with which inhibitors it will interact.",
        "homepage": "http://merops.sanger.ac.uk/",
        "name": "MEROPS"
    }
}