{
    "additionDate": "2021-01-18T08:45:43Z",
    "biotoolsCURIE": "biotools:imsim",
    "biotoolsID": "imsim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "franke@embl-hamburg.de",
            "name": "Daniel Franke",
            "typeEntity": "Person"
        }
    ],
    "description": "Simulation of small-angle X-ray scattering data of biological macromolecules in solution.\n\nBiological small angle scattering.\n\nSimulation of 2-D SAXS patterns and 1-D profiles from biological macromolecules in solution.\n\nPost all your questions about IMSIM to the ATSAS Forum.\n\nATSAS online : Forum : User information : EMBL Hamburg.\n\nSimulation of two-dimensional small angle X-ray scattering patterns and, further, one dimensional profiles from biological macromolecules in solution.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.embl-hamburg.de/biosaxs/manuals/imsim.html",
    "lastUpdate": "2021-02-04T07:56:53Z",
    "name": "IMSIM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1107/S1600576720000527",
            "metadata": {
                "abstract": "© 2020.This article presents IMSIM, an application to simulate two-dimensional small-angle X-ray scattering patterns and, further, one-dimensional profiles from biological macromolecules in solution. IMSIM implements a statistical approach yielding two-dimensional images in TIFF, CBF or EDF format, which may be readily processed by existing data-analysis pipelines. Intensities and error estimates of one-dimensional patterns obtained from the radial average of the two-dimensional images exhibit the same statistical properties as observed with actual experimental data. With initial input on an absolute scale, [cm-1]/c[mgml-1], the simulated data frames may also be scaled to absolute scale such that the forward scattering after subtraction of the background is proportional to the molecular weight of the solute. The effects of changes of concentration, exposure time, flux, wavelength, sample-detector distance, detector dimensions, pixel size, and the mask as well as incident beam position can be considered for the simulation. The simulated data may be used in method development, for educational purposes, and also to determine the most suitable beamline setup for a project prior to the application and use of the actual beamtime. IMSIM is available as part of the ATSAS software package (3.0.0) and is freely available for academic use (http://www.embl-hamburg.de/biosaxs/download.html).",
                "authors": [
                    {
                        "name": "Franke D."
                    },
                    {
                        "name": "Hajizadeh N.R."
                    },
                    {
                        "name": "Svergun D.I."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "Simulation of small-angle X-ray scattering data of biological macromolecules in solution"
            },
            "pmcid": "PMC7133063",
            "pmid": "32280325"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
