{
    "accessibility": "Open access",
    "additionDate": "2021-11-11T19:11:18.525470Z",
    "biotoolsCURIE": "biotools:immu-mela",
    "biotoolsID": "immu-mela",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "qi.liu@vanderbilt.edu",
            "name": "Qi Liu",
            "typeEntity": "Person"
        },
        {
            "email": "yu.shyr@vanderbilt.edu",
            "name": "Yu Shyr",
            "typeEntity": "Person"
        }
    ],
    "description": "An open resource for exploring immunotherapy-related multidimensional genomic profiles in melanoma.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://bioinfo.vanderbilt.edu/database/Immu-Mela/",
    "lastUpdate": "2021-11-11T19:11:18.528154Z",
    "name": "Immu-Mela",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.JGG.2021.03.016",
            "metadata": {
                "abstract": "© 2021 The AuthorsThere are increasing studies aimed to reveal genomic hallmarks predictive of immune checkpoint blockade (ICB) treatment response, which generated a large number of data and provided an unprecedented opportunity to identify response-related features and evaluate their robustness across cohorts. However, those valuable data sets are not easily accessible to the research community. To take full advantage of existing large-scale immuno-genomic profiles, we developed Immu-Mela (http://bioinfo.vanderbilt.edu/database/Immu-Mela/), a multidimensional immuno-genomic portal that provides interactive exploration of associations between ICB responsiveness and multi-omics features in melanoma, including genetic, transcriptomics, immune cells, and single-cell populations. Immu-Mela also enables integrative analysis of any two genomic features. We demonstrated the value of Immu-Mela by identifying known and novel genomic features associated with ICB response. In addition, Immu-Mela allows users to upload their data sets (unrestricted to any cancer types) and co-analyze with existing data to identify and validate signatures of interest. Immu-Mela reduces barriers between researchers and complex genomic data, facilitating discoveries in cancer immunotherapy.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Sheng Q."
                    },
                    {
                        "name": "Shyr Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhao S."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "Journal of Genetics and Genomics",
                "title": "Immu-Mela: An open resource for exploring immunotherapy-related multidimensional genomic profiles in melanoma"
            },
            "pmcid": "PMC8349898",
            "pmid": "34127402"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
