{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://research.nhgri.nih.gov/software/GeIST/contact.shtml"}],"documentation":[{"type":"GENERAL","url":"https://github.com/mlafave/GeIST"}],"function":[{"operation":[{"term":"Nucleic acid feature detection","uri":"http://edamontology.org/operation_0415"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Virology","uri":"http://edamontology.org/topic_0781"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/geist-genomic-integration-site-tracker.html"}],"publication":[{"abstract":"© The Author 2015. Summary: There are several experimental contexts in which it is important to identify DNA integration sites, such as insertional mutagenesis screens, gene and enhancer trap applications, and gene therapy. We previously developed an assay to identify millions of integrations in multiplexed barcoded samples at base-pair resolution. The sheer amount of data produced by this approach makes the mapping of individual sites non-trivial without bioinformatics support. This article presents the Genomic Integration Site Tracker (GeIST), a command-line pipeline designed to map the integration sites produced by this assay and identify the samples from which they came. GeIST version 2.1.0, a more adaptable version of our original pipeline, can identify integrations of murine leukemia virus, adeno-associated virus, Tol2 transposons or Ac/Ds transposons, and can be adapted for other inserted elements. It has been tested on experimental data for each of these delivery vectors and fine-tuned to account for sequencing and cloning artifacts.","authors":["La Fave M.C.","Varshney G.K.","Burgess S.M."],"cit_count":4,"journal":"Bioinformatics","pmid":"26049161","title":"GeIST: A pipeline for mapping integrated DNA elements","year":"2015-10-01"}],"summary":{"biotoolsCURIE":"biotools:geist","biotoolsID":"geist","description":"Identify integrations of DNA elements on a genome-wide scale.","homepage":"http://research.nhgri.nih.gov/software/GeIST/","name":"GeIST"}}