{
    "additionDate": "2022-09-30T14:10:15.993229Z",
    "biotoolsCURIE": "biotools:cnn-cox",
    "biotoolsID": "cnn-cox",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Qingyan Yin"
        }
    ],
    "description": "CNN-based survial prediction model combining with prognosis-related cascaded Wx feature selection.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangwangCCChen/CNN-Cox",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-30T14:10:15.995713Z",
    "license": "Not licensed",
    "name": "CNN-Cox",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/S41374-022-00801-Y",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive licence to United States and Canadian Academy of Pathology.Great advances in deep learning have provided effective solutions for prediction tasks in the biomedical field. However, accurate prognosis prediction using cancer genomics data remains challenging due to the severe overfitting problem caused by curse of dimensionality inherent to high-throughput sequencing data. Moreover, there are unique challenges to perform survival analysis, arising from the difficulty in utilizing censored samples whose events of interest are not observed. Convolutional neural network (CNN) models provide us the opportunity to extract meaningful hierarchical features to characterize cancer subtype and prognosis outcomes. On the other hand, feature selection can mitigate overfitting and reduce subsequent model training computation burden by screening out significant genes from redundant genes. To accomplish model simplification, we developed a concise and efficient survival analysis model, named CNN-Cox model, which combines a special CNN framework with prognosis-related feature selection cascaded Wx, with the advantage of less computation demand utilizing light training parameters. Experiment results show that CNN-Cox model achieved consistent higher C-index values and better survival prediction performance across seven cancer type datasets in The Cancer Genome Atlas cohort, including bladder carcinoma, head and neck squamous cell carcinoma, kidney renal cell carcinoma, brain low-grade glioma, lung adenocarcinoma (LUAD), lung squamous cell carcinoma, and skin cutaneous melanoma, compared with the existing state-of-the-art survival analysis methods. As an illustration of model interpretation, we examined potential prognostic gene signatures of LUAD dataset using the proposed CNN-Cox model. We conducted protein–protein interaction network analysis to identify potential prognostic genes and further analyzed the biological function of 13 hub genes, including ANLN, RACGAP1, KIF4A, KIF20A, KIF14, ASPM, CDK1, SPC25, NCAPG, MKI67, HJURP, EXO1, HMMR, whose high expression is significantly associated with poor survival of LUAD patients. These findings confirmed that CNN-Cox model is effective in extracting not only prognosis factors but also biologically meaningful gene features. The codes are available at the GitHub website: https://github.com/wangwangCCChen/CNN-Cox.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Yin Q."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Laboratory Investigation",
                "title": "A convolutional neural network model for survival prediction based on prognosis-related cascaded Wx feature selection"
            },
            "pmid": "35810236"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
