{
    "accessibility": "Open access",
    "additionDate": "2022-11-12T18:33:26.342310Z",
    "biotoolsCURIE": "biotools:mmkp",
    "biotoolsID": "mmkp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xinchen@zju.edu.cn",
            "name": "Xin Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "A mind mapping knowledgebase prototyping tool for precision medicine.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ZjuLiangsl/mmkp",
    "language": [
        "Java",
        "JavaScript"
    ],
    "lastUpdate": "2022-11-12T18:33:26.347108Z",
    "license": "Apache-2.0",
    "name": "MMKP",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2022.923528",
            "metadata": {
                "abstract": "Copyright © 2022 Liang, Li, Dong and Chen.Background: With significant advancements in the area of precision medicine, the breadth and complexity of the relevant knowledge in the field has increased significantly. However, the difficulty associated with dynamic modelling and the disorganization of such knowledge hinders its rapid development potential. Results: To overcome the difficulty in using the relational database model for dynamic modelling, and to aid in the organization of precision medicine knowledge, we developed the Mind Mapping Knowledgebase Prototyping (MMKP) tool. The MMKP implements a novel design that we call a “polymorphic foreign key”, which allows the establishment of a logical linkage between a single table field and a record from any table. This design has advantages in supporting dynamic changes to the structural relationships in precision medicine knowledge. Knowledge stored in MMKP is presented as a mind map to facilitate human interaction. When using this tool, medical experts may curate the structure and content of the precision knowledge in a flow that is similar to the human thinking process. Conclusions: The design of polymorphic foreign keys natively supports knowledge modelling in the form of mind mapping, which avoids the hard-coding of medical logic into a rigid database schema and significantly reduces the workload that is required for adapting a relational data model to future changes to the medical logic. The MMKP tool provides a graphical user interface for both data management and knowledgebase prototyping. It supports the flexible customization of the data field constraints and annotations. MMKP is available as open-source code on GitHub: https://github.com/ZjuLiangsl/mmkp.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liang S."
                    }
                ],
                "date": "2022-08-25T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "MMKP: A mind mapping knowledgebase prototyping tool for precision medicine"
            },
            "pmcid": "PMC9452637",
            "pmid": "36091046"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Complementary medicine",
            "uri": "http://edamontology.org/topic_3423"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Translational medicine",
            "uri": "http://edamontology.org/topic_3342"
        }
    ]
}
