{
    "additionDate": "2017-08-03T18:48:08Z",
    "biotoolsCURIE": "biotools:lock",
    "biotoolsID": "lock",
    "credit": [
        {
            "email": "brutlag@stanford.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://motif.stanford.edu/"
        }
    ],
    "description": "Vector based protein structure superposition algorithm capable of recognizing distant structural similarities. Statistical significance values for alignments are provided.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://motif.stanford.edu/distributions/lock/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://motif.stanford.edu/distributions/lock/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lock-2-0-vector-based-protein-structure-alignment.html"
        }
    ],
    "name": "LOCK",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The structural comparison of proteins has become increasingly important as a means to identify protein motifs and fold families. In this paper we present a new algorithm for the comparison of proteins based on a hierarchy of structural representations, from the secondary structure level to the atomic level. Our technique represents alpha-helices and beta-strands as vectors and uses a set of seven scoring functions to compare pairs of vectors from different proteins. The scores obtained are used in a dynamic programming algorithm that finds the best local alignment of the two sets of vectors. The second step in our algorithm is based on the atomic coordinates of the protein structures and improves the initial vector alignment by iteratively minimizing the RMSD between pairs of nearest atoms from the two proteins. We refine the final alignment by determining a core of well aligned atoms and minimizing the RMSD of this core. In a comparison of our method to Holm and Sander's DALI algorithm, our program was able to detect structural similarity at the same level as DALI. We also performed searches of a representative set of the Protein Data Bank (PDB) using our program and detected structurally similarity between several distantly related proteins.",
                "authors": [
                    {
                        "name": "Singh A.P."
                    },
                    {
                        "name": "Brutlag D.L."
                    }
                ],
                "citationCount": 125,
                "date": "1997-01-01T00:00:00Z",
                "journal": "Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology",
                "title": "Hierarchical protein structure superposition using both secondary structure and atomic representations."
            },
            "pmid": "9322051"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1
}