{
    "additionDate": "2023-03-18T09:01:16.867286Z",
    "biotoolsCURIE": "biotools:dnasmart",
    "biotoolsID": "dnasmart",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chisom.ezekannagha@uni-marburg.de",
            "name": "Chisom Ezekannagha",
            "typeEntity": "Person"
        }
    ],
    "description": "Multiple attribute ranking tool for DNA data storage systems.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://dnasmart.mathematik.uni-marburg.de/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2024-11-24T14:54:08.596982Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sombiri/DNAsmart"
        }
    ],
    "name": "DNAsmart",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.02.016",
            "metadata": {
                "abstract": "In an ever-growing need for data storage capacity, the Deoxyribonucleic Acid (DNA) molecule gains traction as a new storage medium with a larger capacity, higher density, and a longer lifespan over conventional storage media. To effectively use DNA for data storage, it is important to understand the different methods of encoding information in DNA and compare their effectiveness. This requires evaluating which decoded DNA sequences carry the most encoded information based on various attributes. However, navigating the field of coding theory requires years of experience and domain expertise. For instance, domain experts rely on various mathematical functions and attributes to score and evaluate their encodings. To enable such analytical tasks, we provide an interactive and visual analytical framework for multi-attribute ranking in DNA storage systems. Our framework follows a three-step view with user-settable parameters. It enables users to find the optimal en-/de-coding approaches by setting different weights and combining multiple attributes. We assess the validity of our work through a task-specific user study on domain experts by relying on three tasks. Results indicate that all participants completed their tasks successfully under two minutes, then rated the framework for design choices, perceived usefulness, and intuitiveness. In addition, two real-world use cases are shared and analyzed as direct applications of the proposed tool. DNAsmart enables the ranking of decoded sequences based on multiple attributes. In sum, this work unveils the evaluation of en-/de-coding approaches accessible and tractable through visualization and interactivity to solve comparison and ranking tasks.",
                "authors": [
                    {
                        "name": "Ezekannagha C."
                    },
                    {
                        "name": "Hattab G."
                    },
                    {
                        "name": "Heider D."
                    },
                    {
                        "name": "Welzel M."
                    }
                ],
                "citationCount": 6,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "DNAsmart: Multiple attribute ranking tool for DNA data storage systems"
            },
            "pmcid": "PMC9957737",
            "pmid": "36851917"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
