
{
    "credit": [
        {
            "email": "aaron.darling@uts.edu.au",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://phylosift.wordpress.com/tutorials/running-phylosift/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "Perl"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool",
            "Suite"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/gjospin/PhyloSift"
        },
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/gjospin/PhyloSift/issues"
        }
    ],
    "publication": [
        {
            "abstract": "Like all organisms on the planet, environmental microbes are subject to the forces of molecular evolution. Metagenomic sequencing provides a means to access the DNA sequence of uncultured microbes. By combining DNA sequencing of microbial communities with evolutionary modeling and phylogenetic analysis we might obtain new insights into microbiology and also provide a basis for practical tools such as forensic pathogen detection. In this work we present an approach to leverage phylogenetic analysis of metagenomic sequence data to conduct several types of analysis. First, we present a method to conduct phylogeny-driven Bayesian hypothesis tests for the presence of an organism in a sample. Second, we present a means to compare community structure across a collection of many samples and develop direct associations between the abundance of certain organisms and sample metadata. Third, we apply new tools to analyze the phylogenetic diversity of microbial communities and again demonstrate how this can be associated to sample metadata. These analyses are implemented in an open source software pipeline called PhyloSift. As a pipeline, PhyloSift incorporates several other programs including LAST, HMMER, and pplacer to automate phylogenetic analysis of protein coding and RNA sequences in metagenomic datasets generated by modern sequencing platforms (e.g., Illumina, 454). © 2014 Darling et al.",
            "authors": [
                "Darling A.E.",
                "Jospin G.",
                "Lowe E.",
                "Matsen F.A.",
                "Bik H.M.",
                "Eisen J.A."
            ],
            "cit_count": 224,
            "doi": "10.7717/peerj.243",
            "journal": "PeerJ",
            "title": "PhyloSift: Phylogenetic analysis of genomes and metagenomes",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phylosift",
        "biotoolsID": "phylosift",
        "description": "Suite of software tools to conduct phylogenetic analysis of genomes and metagenomes. Using a reference database of protein sequences, PhyloSift can scan new sequences against that data for homologs and identify phylogentic relationships of the new sequence compared to the database sequences.",
        "homepage": "https://phylosift.wordpress.com/about-2/",
        "name": "Phylosift"
    }
}