{
    "additionDate": "2021-10-25T09:58:21.263806Z",
    "biotoolsCURIE": "biotools:omicsviz",
    "biotoolsID": "omicsviz",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yangxl@pumc.edu.cn",
            "name": "XiaoLin Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "OmicsViz is an integrative web-based analysis of omics data for study of drugs against SARS-CoV-2.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://medcode.link/omicsviz",
    "lastUpdate": "2021-10-25T09:58:21.266459Z",
    "name": "OmicsViz",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-021-89578-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Research on drugs against SARS-CoV-2 (cause of COVID-19) has been one of the major world concerns at present. There have been abundant research data and findings in this field. The interference of drugs on gene expression in cell lines, drug-target, protein-virus receptor networks, and immune cell infiltration of the host may provide useful information for anti-SARS-CoV-2 drug research. To simplify the complex bioinformatics analysis and facilitate the evaluation of the latest research data, we developed OmiczViz (http://medcode.link/omicsviz), a web tool that has integrated drug-cell line interference data, virus-host protein–protein interactions, and drug-target interactions. To demonstrate the usages of OmiczViz, we analyzed the gene expression data from cell lines treated with chloroquine and ruxolitinib, the drug-target protein networks of 48 anti-coronavirus drugs and drugs bound with ACE2, and the profiles of immune cell infiltration between different COVID-19 patient groups. Our research shows that chloroquine had a regulatory role of the immune response in renal cell line but not in lung cell line. The anti-coronavirus drug-target network analysis suggested that antihistamine of promethaziney and dietary supplement of Zinc might be beneficial when used jointly with antiviral drugs. The immune infiltration analysis indicated that both the COVID-19 patients admitted to the ICU and the elderly with infection showed immune exhaustion status, yet with different molecular mechanisms. The interactive graphic interface of OmiczViz also makes it easier to analyze newly discovered and user-uploaded data, leading to an in-depth understanding of existing findings and an expansion of existing knowledge of SARS-CoV-2. Collectively, OmicsViz is web program that promotes the research on medical agents against SARS-CoV-2 and supports the evaluation of the latest research findings.",
                "authors": [
                    {
                        "name": "Wang Z.G."
                    },
                    {
                        "name": "He Y.Q."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Yang X.L."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Integrative web-based analysis of omics data for study of drugs against SARS-CoV-2"
            },
            "pmcid": "PMC8144609",
            "pmid": "34031435",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}