{
    "Available_on_UseGalaxy.eu": 1,
    "Available_on_UseGalaxy.org.au": 1,
    "Conda_id": "cutesv",
    "Conda_version": "2.1.1",
    "Description": "Long-read sequencing enables the comprehensive discovery of structural variations (SVs). However, it is still non-trivial to achieve high sensitivity and performance simultaneously due to the complex SV characteristics implied by noisy long reads. Therefore, we propose cuteSV, a sensitive, fast and scalable long-read-based SV detection approach. cuteSV uses tailored methods to collect the signatures of various types of SVs and employs a clustering-and-refinement method to analyze the signatures to implement sensitive SV detection. Benchmarks on real Pacific Biosciences (PacBio) and Oxford Nanopore Technology (ONT) datasets demonstrate that cuteSV has better yields and scalability than state-of-the-art tools.",
    "EDAM_operation": "Split read mapping, Genotyping, Structural variation detection",
    "EDAM_operation_(no_superclasses)": "Split read mapping, Genotyping, Structural variation detection",
    "EDAM_topic": "DNA structural variation, Sequencing, Computer science",
    "EDAM_topic_(no_superclasses)": "Sequencing, Computer science",
    "Galaxy_tool_ids": "cutesv",
    "Galaxy_wrapper_id": "cutesv",
    "Galaxy_wrapper_owner": "iuc",
    "Galaxy_wrapper_parsed_folder": "https://github.com/galaxyproject/tools-iuc/tree/main/tools/cutesv",
    "Galaxy_wrapper_source": "https://github.com/galaxyproject/tools-iuc/tree/master/tools/cutesv",
    "Galaxy_wrapper_version": "1.0.8",
    "No._of_tool_users_(2022-2023)_(usegalaxy.eu)": 17,
    "Source": "https://github.com/tjiangHIT/cuteSV",
    "Status": "To update",
    "ToolShed_categories": "Variant Analysis",
    "ToolShed_id": "cutesv",
    "Tools_available_on_UseGalaxy.be": 1,
    "Tools_available_on_UseGalaxy.cz": 1,
    "Tools_available_on_UseGalaxy.eu": 1,
    "Tools_available_on_UseGalaxy.org.au": 1,
    "Total_tool_usage_(usegalaxy.eu)": 235,
    "bio.tool_description": "Long Read based Human Genomic Structural Variation Detection with cuteSV | Long-read sequencing technologies enable to comprehensively discover structural variations (SVs). However, it is still non-trivial for state-of-the-art approaches to detect SVs with high sensitivity or high performance or both. Herein, we propose cuteSV, a sensitive, fast and lightweight SV detection approach. cuteSV uses tailored methods to comprehensively collect various types of SV signatures, and a clustering-and-refinement method to implement a stepwise SV detection, which enables to achieve high sensitivity without loss of accuracy. Benchmark results demonstrate that cuteSV has better yields on real datasets. Further, its speed and scalability are outstanding and promising to large-scale data analysis",
    "bio.tool_id": "cuteSV",
    "bio.tool_ids": "cuteSV",
    "bio.tool_name": "cuteSV"
}
