
{
    "credit": [
        {
            "email": "erik.arner@gmail.com",
            "name": "Erik Arner",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://ngsview.sourceforge.net/manual.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly visualisation",
                    "uri": "http://edamontology.org/operation_3184"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "High-throughput sequencing technologies introduce novel demands on tools available for data analysis. We have developed NGSView (Next Generation Sequence View), a generally applicable, flexible and extensible next-generation sequence alignment editor. The software allows for visualization and manipulation of millions of sequences simultaneously on a desktop computer, through a graphical interface. NGSView is available under an open source license and can be extended through a well documented API. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Arner E.",
                "Hayashizaki Y.",
                "Daub C.O."
            ],
            "cit_count": 8,
            "journal": "Bioinformatics",
            "pmid": "19855106",
            "title": "NGSView: An extensible open source editor for next-generation sequencing data",
            "year": "2009-10-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ngsview",
        "biotoolsID": "ngsview",
        "description": "High-throughput sequencing technologies introduce novel demands on tools available for data analysis. We have developed NGSView, a generally applicable, flexible and extensible next-generation sequence alignment editor. The software allows for visualization and manipulation of millions of sequences simultaneously on a desktop computer, through a graphical interface. NGSView is available under an open source license and can be extended through a well documented API.",
        "homepage": "http://ngsview.sourceforge.net/",
        "name": "NGSView"
    }
}