{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T09:27:58.814415Z",
    "biotoolsCURIE": "biotools:gani",
    "biotoolsID": "gani",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "njvarghese@lbl.gov",
            "name": "Neha J. Varghese",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Whole-genome based Average Nucleotide Identity (gANI) is an effort to delineate species-level diversity among prokaryotic organisms in the genomic era. Microorganisms are evolving continuously and the signature of evolution is observed across its entire genome. As such, a single gene or a select group of marker genes should not be used to infer new species as it may not be a correct representation in the evolutionary landscape. Especially with the wealth of genomic information currently available, one needs to graduate from the gene-centric 16S based classification to a holistic, genome-based method.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://ani.jgi.doe.gov/html/home.php",
    "lastUpdate": "2022-03-21T11:28:02.397629Z",
    "license": "Other",
    "name": "gANI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nar/gkv657",
            "metadata": {
                "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research.Increased sequencing of microbial genomes has revealed that prevailing prokaryotic species assignments can be inconsistent with whole genome information for a significant number of species. The long-standing need for a systematic and scalable species assignment technique can be met by the genome-wide Average Nucleotide Identity (gANI) metric, which is widely acknowledged as a robust measure of genomic relatedness. In this work, we demonstrate that the combination of gANI and the alignment fraction (AF) between two genomes accurately reflects their genomic relatedness. We introduce an efficient implementation of AF, gANI and discuss its successful application to 86.5M genome pairs between 13, 151 prokaryotic genomes assigned to 3032 species. Subsequently, by comparing the genome clusters obtained from complete linkage clustering of these pairs to existing taxonomy, we observed that nearly 18% of all prokaryotic species suffer from anomalies in species definition. Our results can be used to explore central questions such as whether microorganisms form a continuum of genetic diversity or distinct species represented by distinct genetic signatures.We propose that this precise and objective AF, gANI-based species definition: the MiSI (Microbial Species Identifier) method, be used to address previous inconsistencies in species classification and as the primary guide for new taxonomic species assignment, supplemented by the traditional polyphasic approach, as required.",
                "authors": [
                    {
                        "name": "Ivanova N."
                    },
                    {
                        "name": "Konstantinidis K.T."
                    },
                    {
                        "name": "Kyrpides N.C."
                    },
                    {
                        "name": "Mavrommatis K."
                    },
                    {
                        "name": "Mukherjee S."
                    },
                    {
                        "name": "Pati A."
                    },
                    {
                        "name": "Varghese N.J."
                    }
                ],
                "citationCount": 395,
                "date": "2015-08-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Microbial species delineation using whole genome sequences"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ]
}
