{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatics.tudelft.nl/"}],"documentation":[{"type":"GENERAL","url":"http://helix.ewi.tudelft.nl/hipsec/about.py"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/hipsec-1-0-predict-high-level-protein-production-aspergillus-niger.html"}],"publication":[{"abstract":"Protein sequence features are explored in relation to the production of over-expressed extracellular proteins by fungi. Knowledge on features influencing protein production and secretion could be employed to improve enzyme production levels in industrial bioprocesses via protein engineering. A large set, over 600 homologous and nearly 2,000 heterologous fungal genes, were overexpressed in Aspergillus niger using a standardized expression cassette and scored for high versus no production. Subsequently, sequence-based machine learning techniques were applied for identifying relevant DNA and protein sequence features. The amino-acid composition of the protein sequence was found to be most predictive and interpretation revealed that, for both homologous and heterologous gene expression, the same features are important: tyrosine and asparagine composition was found to have a positive correlation with high-level production, whereas for unsuccessful production, contributions were found for methionine and lysine composition. The predictor is available online at http://bioinformatics.tudelft.nl/hipsec. Subsequent work aims at validating these findings by protein engineering as a method for increasing expression levels per gene copy. © 2012 van den Berg et al.","authors":["van den Berg B.A.","Reinders M.J.T.","Hulsman M.","Wu L.","Pel H.J.","Roubos J.A.","de Ridder D."],"cit_count":14,"doi":"10.1371/journal.pone.0045869","journal":"PLoS ONE","title":"Exploring Sequence Characteristics Related to High-Level Production of Secreted Proteins in Aspergillus niger","type":"Primary","year":"2012-10-01"}],"summary":{"biotoolsCURIE":"biotools:hipsec","biotoolsID":"hipsec","description":"Hipsec is a tool for predicting high-level protein production in Aspergillus niger. The software predicts if gene overexpression of an extracellular protein will lead to successful high-level production in Aspergillus niger. The prediction is based on a protein’s amino acid sequence. One or more protein sequences can be pasted into the the text area (fasta format) or uploaded as a fasta file.","homepage":"http://helix.ewi.tudelft.nl/hipsec/home.py","name":"Hipsec","version":["2.0"]}}