{
    "additionDate": "2021-01-18T08:07:11Z",
    "biotoolsCURIE": "biotools:geodesicslicer",
    "biotoolsID": "geodesicslicer",
    "credit": [
        {
            "name": "F. Briend",
            "typeEntity": "Person"
        }
    ],
    "description": "A Slicer Toolbox for Targeting Brain Stimulation.\n\n3D Slicer is an open source software platform for medical image informatics, image processing, and three-dimensional visualization. Built over two decades through support from the National Institutes of Health and a worldwide developer community, Slicer brings free, powerful cross-platform processing tools to physicians, researchers, and the general public.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.slicer.org",
    "lastUpdate": "2021-01-26T07:00:21Z",
    "name": "GeodesicSlicer",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S12021-020-09457-9",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.NonInvasive Brain Stimulation (NIBS) is a potential therapeutic tool with growing interest, but neuronavigation-guided software and tools available for the target determination are mostly either expensive or closed proprietary applications. To address these limitations, we propose GeodesicSlicer, a customizable, free, and open-source NIBS therapy research toolkit. GeodesicSlicer is implemented as an extension for the widely used 3D Slicer medical image visualization and analysis application platform. GeodesicSlicer uses cortical stimulation target from either functional or anatomical images to provide functionality specifically designed for NIBS therapy research. The provided algorithms are tested and they are accessible through a convenient graphical user interface. Modules have been created for NIBS target determination according to the position of the electrodes in the 10–20 system electroencephalogram and calculating correction factors to adjust the repetitive Transcranial Magnetic Stimulation (rTMS) dose for the treatment. Two illustrative examples are processing with the module. This new open-source software has been developed for NIBS therapy: GeodesicSlicer is an alternative for laboratories that do not have access to neuronavigation system. The triangulation-based MRI-guided method presented here provides a reproducible and inexpensive way to position the TMS coil that may be used without the use of a neuronavigation system.",
                "authors": [
                    {
                        "name": "Briend F."
                    },
                    {
                        "name": "Delcroix N."
                    },
                    {
                        "name": "Dollfus S."
                    },
                    {
                        "name": "Etard O."
                    },
                    {
                        "name": "Leroux E."
                    },
                    {
                        "name": "Nathou C."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "GeodesicSlicer: a Slicer Toolbox for Targeting Brain Stimulation"
            },
            "pmid": "32125609"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}
