{
    "accessibility": "Open access",
    "additionDate": "2016-03-24T16:39:49Z",
    "biotoolsCURIE": "biotools:bowtie2",
    "biotoolsID": "bowtie2",
    "collectionID": [
        "galaxyPasteur"
    ],
    "credit": [
        {
            "name": "Institut Français de Bioinformatique",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Ben Langmead",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bowtie-bio.sourceforge.net/bowtie2/index.shtml"
        },
        {
            "name": "Ben Langmead",
            "typeRole": [
                "Developer"
            ],
            "url": "http://bowtie-bio.sourceforge.net/bowtie2/index.shtml"
        }
    ],
    "description": "Bowtie 2 is an ultrafast and memory-efficient tool for aligning sequencing reads to long reference sequences. It is particularly good at aligning reads of about 50 up to 100s or 1,000s of characters, and particularly good at aligning to relatively long (e.g. mammalian) genomes. Bowtie 2 indexes the genome with an FM Index to keep its memory footprint small: for the human genome, its memory footprint is typically around 3.2 GB. Bowtie 2 supports gapped, local, and paired-end alignment modes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BenLangmead/bowtie2"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://bowtie-bio.sourceforge.net/bowtie2/manual.shtml"
        }
    ],
    "download": [
        {
            "note": "Link to the Bioconda package information. This form of the link is recommended by the Bioconda team, and in the future all this information, including versions (limit 100 chars), will be pushed to GitHub automatically (matuskalas)",
            "type": "Software package",
            "url": "https://bioconda.github.io/recipes/bowtie2/README.html",
            "version": "2.3.5-0, 2.3.4.3-1 - 2.3.0-0, 2.2.8-2 - 2.2.1-0"
        },
        {
            "note": "Link to the Debian package information. This form of the link is recommended by the Debian devs & Med team, and in the future all this information, including versions, will be pushed to GitHub automatically (matuskalas)",
            "type": "Software package",
            "url": "https://tracker.debian.org/pkg/bowtie2",
            "version": "2.2.4-1, 2.3.0-2, 2.3.4.3-1, 2.3.5.1-1, 2.3.5.1-1"
        },
        {
            "type": "Container file",
            "url": "https://anaconda.org/bioconda/bowtie2"
        },
        {
            "type": "Container file",
            "url": "https://docker-ui.genouest.org/app/#/container/bioconda/bowtie2"
        },
        {
            "type": "Tool wrapper (CWL)",
            "url": "https://gitlab.com/sibyllewohlgemuth/cwl_files/raw/master/bowtie2.cwl"
        },
        {
            "type": "Tool wrapper (CWL)",
            "url": "https://gitlab.com/sibyllewohlgemuth/cwl_files/raw/master/bowtie2_build.cwl"
        }
    ],
    "editPermission": {
        "authors": [
            "rioualen",
            "swohlgemuth"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment (nucleic acid)",
                        "uri": "http://edamontology.org/data_1383"
                    },
                    "format": [
                        {
                            "term": "BAM",
                            "uri": "http://edamontology.org/format_2572"
                        },
                        {
                            "term": "SAM",
                            "uri": "http://edamontology.org/format_2573"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bowtie-bio.sourceforge.net/bowtie2/index.shtml",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:15:03.897028Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Galaxy service"
            ],
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/fmareuil/bowtie2/bowtie2/2.2.6.2"
        }
    ],
    "maturity": "Mature",
    "name": "Bowtie 2",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_016368"
        }
    ],
    "owner": "swohlgemuth",
    "publication": [
        {
            "doi": "10.1038/nmeth.1923",
            "metadata": {
                "abstract": "As the rate of sequencing increases, greater throughput is demanded from read aligners. The full-text minute index is often used to make alignment very fast and memory-efficient, but the approach is ill-suited to finding longer, gapped alignments. Bowtie 2 combines the strengths of the full-text minute index with the flexibility and speed of hardware-accelerated dynamic programming algorithms to achieve a combination of high speed, sensitivity and accuracy. © 2012 Nature America, Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Langmead B."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 34836,
                "date": "2012-04-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Fast gapped-read alignment with Bowtie 2"
            },
            "pmcid": "PMC3322381",
            "pmid": "22388286",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-14-184",
            "metadata": {
                "abstract": "Background: The development of next-generation sequencing instruments has led to the generation of millions of short sequences in a single run. The process of aligning these reads to a reference genome is time consuming and demands the development of fast and accurate alignment tools. However, the current proposed tools make different compromises between the accuracy and the speed of mapping. Moreover, many important aspects are overlooked while comparing the performance of a newly developed tool to the state of the art. Therefore, there is a need for an objective evaluation method that covers all the aspects. In this work, we introduce a benchmarking suite to extensively analyze sequencing tools with respect to various aspects and provide an objective comparison.Results: We applied our benchmarking tests on 9 well known mapping tools, namely, Bowtie, Bowtie2, BWA, SOAP2, MAQ, RMAP, GSNAP, Novoalign, and mrsFAST (mrFAST) using synthetic data and real RNA-Seq data. MAQ and RMAP are based on building hash tables for the reads, whereas the remaining tools are based on indexing the reference genome. The benchmarking tests reveal the strengths and weaknesses of each tool. The results show that no single tool outperforms all others in all metrics. However, Bowtie maintained the best throughput for most of the tests while BWA performed better for longer read lengths. The benchmarking tests are not restricted to the mentioned tools and can be further applied to others.Conclusion: The mapping process is still a hard problem that is affected by many factors. In this work, we provided a benchmarking suite that reveals and evaluates the different factors affecting the mapping process. Still, there is no tool that outperforms all of the others in all the tests. Therefore, the end user should clearly specify his needs in order to choose the tool that provides the best results. © 2013 Hatem et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bozdag D."
                    },
                    {
                        "name": "Catalyurek U.V."
                    },
                    {
                        "name": "Hatem A."
                    },
                    {
                        "name": "Toland A.E."
                    }
                ],
                "citationCount": 146,
                "date": "2013-06-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Benchmarking short sequence mapping tools"
            },
            "pmcid": "PMC3694458",
            "pmid": "23758764",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1186/1471-2164-15-264",
            "metadata": {
                "abstract": "Background: The rapid evolution in high-throughput sequencing (HTS) technologies has opened up new perspectives in several research fields and led to the production of large volumes of sequence data. A fundamental step in HTS data analysis is the mapping of reads onto reference sequences. Choosing a suitable mapper for a given technology and a given application is a subtle task because of the difficulty of evaluating mapping algorithms.Results: In this paper, we present a benchmark procedure to compare mapping algorithms used in HTS using both real and simulated datasets and considering four evaluation criteria: computational resource and time requirements, robustness of mapping, ability to report positions for reads in repetitive regions, and ability to retrieve true genetic variation positions. To measure robustness, we introduced a new definition for a correctly mapped read taking into account not only the expected start position of the read but also the end position and the number of indels and substitutions. We developed CuReSim, a new read simulator, that is able to generate customized benchmark data for any kind of HTS technology by adjusting parameters to the error types. CuReSim and CuReSimEval, a tool to evaluate the mapping quality of the CuReSim simulated reads, are freely available. We applied our benchmark procedure to evaluate 14 mappers in the context of whole genome sequencing of small genomes with Ion Torrent data for which such a comparison has not yet been established.Conclusions: A benchmark procedure to compare HTS data mappers is introduced with a new definition for the mapping correctness as well as tools to generate simulated reads and evaluate mapping quality. The application of this procedure to Ion Torrent data from the whole genome sequencing of small genomes has allowed us to validate our benchmark procedure and demonstrate that it is helpful for selecting a mapper based on the intended application, questions to be addressed, and the technology used. This benchmark procedure can be used to evaluate existing or in-development mappers as well as to optimize parameters of a chosen mapper for any application and any sequencing platform. © 2014 Caboche et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Audebert C."
                    },
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Hot D."
                    },
                    {
                        "name": "Lemoine Y."
                    }
                ],
                "citationCount": 66,
                "date": "2014-04-05T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Comparison of mapping algorithms used in high-throughput sequencing: Application to Ion Torrent data"
            },
            "pmcid": "PMC4051166",
            "pmid": "24708189",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1016/j.ygeno.2017.03.001",
            "metadata": {
                "abstract": "Massive data produced due to the advent of next-generation sequencing (NGS) technology is widely used for biological researches and medical diagnosis. The crucial step in NGS analysis is read alignment or mapping which is computationally intensive and complex. The mapping bias tends to affect the downstream analysis, including detection of polymorphisms. In order to provide guidelines to the biologist for suitable selection of aligners; we have evaluated and benchmarked 5 different aligners (BWA, Bowtie2, NovoAlign, Smalt and Stampy) and their mapping bias based on characteristics of 5 microbial genomes. Two million simulated read pairs of various sizes (36 bp, 50 bp, 72 bp, 100 bp, 125 bp, 150 bp, 200 bp, 250 bp and 300 bp) were aligned. Specific alignment features such as sensitivity of mapping, percentage of properly paired reads, alignment time and effect of tandem repeats on incorrectly mapped reads were evaluated. BWA showed faster alignment followed by Bowtie2 and Smalt. NovoAlign and Stampy were comparatively slower. Most of the aligners showed high sensitivity towards long reads (> 100 bp) mapping. On the other hand NovoAlign showed higher sensitivity towards both short reads (36 bp, 50 bp, 72 bp) and long reads (> 100 bp) mappings; It also showed higher sensitivity towards mapping a complex genome like Plasmodium falciparum. The percentage of properly paired reads aligned by NovoAlign, BWA and Stampy were markedly higher. None of the aligners outperforms the others in the benchmark, however the aligners perform differently with genome characteristics. We expect that the results from this study will be useful for the end user to choose aligner, thus enhance the accuracy of read mapping.",
                "authors": [
                    {
                        "name": "Nookaew I."
                    },
                    {
                        "name": "Sen P."
                    },
                    {
                        "name": "Thankaswamy-Kosalai S."
                    }
                ],
                "citationCount": 54,
                "date": "2017-07-01T00:00:00Z",
                "journal": "Genomics",
                "title": "Evaluation and assessment of read-mapping by multiple next-generation sequencing aligners based on genome-wide characteristics"
            },
            "pmid": "28286147",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btu146",
            "metadata": {
                "abstract": "Motivation: Next-generation sequencing has become an important tool in molecular biology. Various protocols to investigate genomic, transcriptomic and epigenomic features across virtually all species and tissues have been devised. For most of these experiments, one of the first crucial steps of bioinformatic analysis is the mapping of reads to reference genomes. Results: Here, we present thorough benchmarks of our read aligner segemehl in comparison with other state-of-the-art methods. Furthermore, we introduce the tool lack to rescue unmapped RNA-seq reads which works in conjunction with segemehl and many other frequently used split-read aligners. © The Author 2014.",
                "authors": [
                    {
                        "name": "Hoffmann S."
                    },
                    {
                        "name": "Otto C."
                    },
                    {
                        "name": "Stadler P.F."
                    }
                ],
                "citationCount": 71,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lacking alignments? The next-generation sequencing mapper segemehl revisited"
            },
            "pmid": "24626854",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.7490/f1000research.1114334.1",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
