{
    "additionDate": "2021-01-18T09:13:38Z",
    "biotoolsCURIE": "biotools:tissuumaps",
    "biotoolsID": "tissuumaps",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "carolina.wahlby@it.uu.se",
            "name": "Carolina Wählby",
            "typeEntity": "Person"
        },
        {
            "email": "leslie.solorzano@it.uu.se",
            "name": "Leslie Solorzano",
            "typeEntity": "Person"
        }
    ],
    "description": "TissUUmaps  is an interactive visualization of large-scale spatial gene expression and tissue morphology data.\n\nTissUUmaps is a lightweight viewer that uses basic web tools to visualize gene expression data or any kind of point data on top of whole slide images.\n\nTissUUmaps tries to keep it minimal so the setup doesn't become complicated. You can use more advanced libraries if you want but we try to make it simple, just HTML, JavaScript and CSS.\n\nTissUUmaps allows the display of tissue slide images and uses an overlay to display any sort of marker data on top. Be it spatially resolved gene expression, per cell data, or regions of interest.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://tissuumaps.research.it.uu.se/howto.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://github.com/wahlby-lab/TissUUmaps",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-02-27T10:02:49Z",
    "license": "GPL-3.0",
    "name": "TissUUmaps",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA541",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Motivation: Visual assessment of scanned tissue samples and associated molecular markers, such as gene expression, requires easy interactive inspection at multiple resolutions. This requires smart handling of image pyramids and efficient distribution of different types of data across several levels of detail. Results: We present TissUUmaps, enabling fast visualization and exploration of millions of data points overlaying a tissue sample. TissUUmaps can be used both as a web service or locally in any computer, and regions of interest as well as local statistics can be extracted and shared among users. Availability and implementation: TissUUmaps is available on github at github.com/wahlby-lab/TissUUmaps. Several demos and video tutorials are available at http://tissuumaps.research.it.uu.se/howto.html.",
                "authors": [
                    {
                        "name": "Partel G."
                    },
                    {
                        "name": "Solorzano L."
                    },
                    {
                        "name": "Wahlby C."
                    }
                ],
                "citationCount": 4,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TissUUmaps: Interactive visualization of large-scale spatial gene expression and tissue morphology data"
            },
            "pmcid": "PMC7520034",
            "pmid": "32449759"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
