{
    "additionDate": "2021-12-13T12:31:18.045366Z",
    "biotoolsCURIE": "biotools:umpire2",
    "biotoolsID": "umpire2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "coombes.3@osu.edu",
            "name": "Kevin R. Coombes",
            "orcidid": "https://orcid.org/0000-0002-7630-2123",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Ultimate Microrray Prediction, Reality and Inference Engine (UMPIRE) is an R package to facilitate the simulation of realistic microarray data sets with links to associated outcomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Simulated gene expression data generation",
                    "uri": "http://edamontology.org/operation_3566"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=Umpire",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-13T12:31:18.048187Z",
    "license": "Apache-2.0",
    "name": "Umpire 2.0",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.25877.2",
            "metadata": {
                "abstract": "© 2021. Coombes CE et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.The Umpire 2.0 R-package offers a streamlined, user-friendly workflow to simulate complex, heterogeneous, mixed-type data with known subgroup identities, dichotomous outcomes, and time-toevent data, while providing ample opportunities for fine-tuning and flexibility. Here, we describe how we have expanded the core Umpire1.0 R-package, developed to simulate gene expression data, to generate clinically realistic, mixed-type data for use in evaluating unsupervised and supervised machine learning (ML) methods. As the availability of large-scale clinical data for ML has increased, clinical data has posed unique challenges, including widely variable size, individual biological heterogeneity, data collection and measurement noise, and mixed data types. Developing and validating ML methods for clinical data requires data sets with known ground truth, generated from simulation. Umpire 2.0 addresses challenges to simulating realistic clinical data by providing the user a series of modules to generate survival parameters and subgroups, apply meaningful additive noise, and discretize to single or mixed data types. Umpire 2.0 provides broad functionality across sample sizes, feature spaces, and data types, allowing the user to simulate correlated, heterogeneous, binary, continuous, categorical, or mixed type data from the scale of a small clinical trial to data on thousands of patients drawn from electronic health records. The user may generate elaborate simulations by varying parameters in order to compare algorithms or interrogate operating characteristics of an algorithm in both supervised and unsupervised ML.",
                "authors": [
                    {
                        "name": "Coombes C.E."
                    },
                    {
                        "name": "Abrams Z.B."
                    },
                    {
                        "name": "Nakayiza S."
                    },
                    {
                        "name": "Brock G."
                    },
                    {
                        "name": "Coombes K.R."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Umpire 2.0: Simulating realistic, mixed-type, clinical data for machine learning [version 2; peer review: 1 approved, 1 approved with reservations]"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}