{
    "additionDate": "2021-01-18T09:38:12Z",
    "biotoolsCURIE": "biotools:pytrack",
    "biotoolsID": "pytrack",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "titoghose@gmail.com",
            "name": "Upamanyu Ghose",
            "typeEntity": "Person"
        }
    ],
    "description": "An end-to-end analysis toolkit for eye tracking.\n\nThis is a toolkit to analyse and visualize eye tracking data. It provides the following functionality:.\n\n\nAfter extraction of features, PyTrack can perform tests such as the student T-Test, Welch T-Test, ANOVA, RMANOVA, n-way ANOVA and Mixed ANOVA. The between and within group factors can be specified.\n\nThis involves extraction of parameters or meta-data related to blinks, fixations, saccades, microsaccades and pupil diameter. The features extracted are as follows:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://pytrack-ntu.rtfd.io",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-31T11:03:14Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/titoghose/PyTrack"
        }
    ],
    "name": "PyTrack",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3758/S13428-020-01392-6",
            "metadata": {
                "abstract": "© 2020, The Author(s).Eye tracking is a widely used tool for behavioral research in the field of psychology. With technological advancement, we now have specialized eye-tracking devices that offer high sampling rates, up to 2000 Hz, and allow for measuring eye movements with high accuracy. They also offer high spatial resolution, which enables the recording of very small movements, like drifts and microsaccades. Features and parameters of interest that characterize eye movements need to be algorithmically extracted from raw data as most eye trackers identify only basic parameters, such as blinks, fixations, and saccades. Eye-tracking experiments may investigate eye movement behavior in different groups of participants and in varying stimuli conditions. Hence, the analysis stage of such experiments typically involves two phases, (i) extraction of parameters of interest and (ii) statistical analysis between different participants or stimuli conditions using these parameters. Furthermore, the datasets collected in these experiments are usually very large in size, owing to the high temporal resolution of the eye trackers, and hence would benefit from an automated analysis toolkit. In this work, we present PyTrack, an end-to-end open-source solution for the analysis and visualization of eye-tracking data. It can be used to extract parameters of interest, generate and visualize a variety of gaze plots from raw eye-tracking data, and conduct statistical analysis between stimuli conditions and subject groups.",
                "authors": [
                    {
                        "name": "Boyce W.P."
                    },
                    {
                        "name": "Chng E.S."
                    },
                    {
                        "name": "Ghose U."
                    },
                    {
                        "name": "Srinivasan A.A."
                    },
                    {
                        "name": "Xu H."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "PyTrack: An end-to-end analysis toolkit for eye tracking"
            },
            "pmcid": "PMC7725757",
            "pmid": "32500364"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
