{
    "additionDate": "2023-03-09T14:27:34.717775Z",
    "biotoolsCURIE": "biotools:cntseg",
    "biotoolsID": "cntseg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Yuanjing Feng"
        }
    ],
    "description": "A multimodal deep-learning-based network for cranial nerves tract segmentation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IPIS-XieLei/CNTSeg",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:55:32.007178Z",
    "name": "CNTSeg",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.media.2023.102766",
            "metadata": {
                "abstract": "The segmentation of cranial nerves (CNs) tracts based on diffusion magnetic resonance imaging (dMRI) provides a valuable quantitative tool for the analysis of the morphology and course of individual CNs. Tractography-based approaches can describe and analyze the anatomical area of CNs by selecting the reference streamlines in combination with ROIs-based (regions-of-interests) or clustering-based. However, due to the slender structure of CNs and the complex anatomical environment, single-modality data based on dMRI cannot provide a complete and accurate description, resulting in low accuracy or even failure of current algorithms in performing individualized CNs segmentation. In this work, we propose a novel multimodal deep-learning-based multi-class network for automated cranial nerves tract segmentation without using tractography, ROI placement or clustering, called CNTSeg. Specifically, we introduced T1w images, fractional anisotropy (FA) images, and fiber orientation distribution function (fODF) peaks into the training data set, and design the back-end fusion module which uses the complementary information of the interphase feature fusion to improve the segmentation performance. CNTSeg has achieved the segmentation of 5 pairs of CNs (i.e. optic nerve CN II, oculomotor nerve CN III, trigeminal nerve CN V, and facial–vestibulocochlear nerve CN VII/VIII). Extensive comparisons and ablation experiments show promising results and are anatomically convincing even for difficult tracts. The code will be openly available at https://github.com/IPIS-XieLei/CNTSeg.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Feng Y."
                    },
                    {
                        "name": "Hu Q."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Xie G."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Zeng Q."
                    }
                ],
                "citationCount": 10,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "CNTSeg: A multimodal deep-learning-based network for cranial nerves tract segmentation"
            },
            "pmid": "36812693"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
