{
    "name": "MathDAMP", 
    "description": "Facilitates the visualization of differences between metabolite profiles acquired by hyphenated mass spectrometry techniques. Differences are highlighted by applying arithmetic operations to all corresponding signal intensities from whole raw (automatically preprocessed and normalized) datasets on a datapoint-by-datapoint basis. The results are visualized using density plots", 
    "homepage": "http://mathdamp.iab.keio.ac.jp/", 
    "biotoolsID": "mathdamp", 
    "biotoolsCURIE": "biotools:mathdamp", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3214", 
                    "term": "Spectral analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0154", 
            "term": "Small molecules"
        }, 
        {
            "uri": "http://edamontology.org/topic_3172", 
            "term": "Metabolomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }, 
        {
            "uri": "http://edamontology.org/topic_0092", 
            "term": "Data visualisation"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Mathematica"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mathdamp-1-0-0-mathematica-package-differential-analysis-metabolite-profiles.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://mathdamp.iab.keio.ac.jp/overview/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17166258", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MathDAMP: A package for differential analysis of metabolite profiles", 
                "abstract": "Background: With the advent of metabolomics as a powerful tool for both functional and biomarker discovery, the identification of specific differences between complex metabolite profiles is becoming a major challenge in the data analysis pipeline. The task remains difficult, given the datasets' size, complexity, and common shifts in migration (elution/retention) times between samples analyzed by hyphenated mass spectrometry methods. Results: We present a Mathematica (Wolfram Research, Inc.) package MathDAMP (Mathematica package for Differential Analysis of Metabolite Profiles), which highlights differences between raw datasets acquired by hyphenated mass spectrometry methods by applying arithmetic operations to all corresponding signal intensities on a datapoint-by-datapoint basis. Peak identification and integration is thus bypassed and the results are displayed graphically. To facilitate direct comparisons, the raw datasets are automatically preprocessed and normalized in terms of both migration times and signal intensities. A combination of dynamic programming and global optimization is used for the alignment of the datasets along the migration time dimension. The processed datasets and the results of direct comparisons between them are visualized using density plots (axes represent migration time and m/z values while peaks appear as color-coded spots) providing an intuitive overall view. Various forms of comparisons and statistical tests can be applied to highlight subtle differences. Overlaid electropherograms (chromatograms) corresponding to the vicinities of the candidate differences from any result may be generated in a descending order of significance for visual confirmation. Additionally, a standard library table (a list of m/z values and migration times for known compounds) may be aligned and overlaid on the plots to allow easier identification of metabolites. Conclusion: Our tool facilitates the visualization and identification of differences between complex metabolite profiles according to various criteria in an automated fashion and is useful for data-driven discovery of biomarkers and functional genomics. © 2006 Baran et al; licensee BioMed Central Ltd.", 
                "date": "2006-12-13T00:00:00Z", 
                "citationCount": 119, 
                "authors": [
                    {
                        "name": "Baran R."
                    }, 
                    {
                        "name": "Kochi H."
                    }, 
                    {
                        "name": "Saito N."
                    }, 
                    {
                        "name": "Suematsu M."
                    }, 
                    {
                        "name": "Soga T."
                    }, 
                    {
                        "name": "Nishioka T."
                    }, 
                    {
                        "name": "Robert M."
                    }, 
                    {
                        "name": "Tomita M."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Martin Robert", 
            "email": "mrobert@ttck.keio.ac.jp", 
            "url": "http://mathdamp.iab.keio.ac.jp/contact/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:50:42Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}