{
    "accessibility": "Open access",
    "additionDate": "2017-03-01T15:45:30Z",
    "biotoolsCURIE": "biotools:treedyn",
    "biotoolsID": "treedyn",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chevenet@ird.fr",
            "name": "François Chevenet",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Dynamic graphics and annotations for tree investigations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.treedyn.org/manual/tutorial01.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "Nexus format",
                            "uri": "http://edamontology.org/format_1912"
                        },
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree image",
                        "uri": "http://edamontology.org/data_1707"
                    },
                    "format": [
                        {
                            "term": "PNG",
                            "uri": "http://edamontology.org/format_3603"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.treedyn.org/",
    "lastUpdate": "2021-04-29T12:23:04.757425Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "TreeDyn",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015946"
        }
    ],
    "owner": "hmenager",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-439",
            "metadata": {
                "abstract": "Background: Analyses of biomolecules for biodiversity, phylogeny or structure/function studies often use graphical tree representations. Many powerful tree editors are now available, but existing tree visualization tools make little use of meta-information related to the entities under study such as taxonomic descriptions or gene functions that can hardly be encoded within the tree itself (if using popular tree formats). Consequently, a tedious manual analysis and post-processing of the tree graphics are required if one needs to use external information for displaying or investigating trees. Results: We have developed TreeDyn, a tool using annotations and dynamic graphical methods for editing and analyzing multiple trees. The main features of TreeDyn are 1) the management of multiple windows and multiple trees per window, 2) the export of graphics to several standard file formats with or without HTML encapsulation and a new format called TGF, which enables saving and restoring graphical analysis, 3) the projection of texts or symbols facing leaf labels or linked to nodes, through manual pasting or by using annotation files, 4) the highlight of graphical elements after querying leaf labels (or annotations) or by selection of graphical elements and information extraction, 5) the highlight of targeted trees according to a source tree browsed by the user, 6) powerful scripts for automating repetitive graphical tasks, 7) a command line interpreter enabling the use of TreeDyn through CGI scripts for online building of trees, 8) the inclusion of a library of packages dedicated to specific research fields involving trees. Conclusion: TreeDyn is a tree visualization and annotation tool which includes tools for tree manipulation and annotation and uses meta-information through dynamic graphical operators or scripting to help analyses and annotations of single trees or tree collections. © 2006 Chevenet et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chevenet F."
                    },
                    {
                        "name": "Brun C."
                    },
                    {
                        "name": "Banuls A.-L."
                    },
                    {
                        "name": "Jacq B."
                    },
                    {
                        "name": "Christen R."
                    }
                ],
                "citationCount": 731,
                "date": "2006-10-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TreeDyn: Towards dynamic graphics and annotations for analyses of trees"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1,
    "version": [
        "198.3"
    ]
}