{
    "additionDate": "2017-08-03T19:06:17Z",
    "biotoolsCURIE": "biotools:istable",
    "biotoolsID": "istable",
    "credit": [
        {
            "email": "ywchu@nchu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://predictor.nchu.edu.tw/ncblab/"
        }
    ],
    "description": "An integrated predictor constructed by using sequence information and prediction results from different element predictors.",
    "documentation": [
        {
            "type": "General",
            "url": "http://predictor.nchu.edu.tw/istable/about.php"
        },
        {
            "type": "User manual",
            "url": "http://predictor.nchu.edu.tw/istable/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://predictor.nchu.edu.tw/istable/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-11T19:17:40Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/istable-integrated-predictor-for-protein-stability-change-upon-single-mutation.html"
        }
    ],
    "name": "iStable",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2013 Chen et al. Background: Mutation of a single amino acid residue can cause changes in a protein, which could then lead to a loss of protein function. Predicting the protein stability changes can provide several possible candidates for the novel protein designing. Although many prediction tools are available, the conflicting prediction results from different tools could cause confusion to users. Results: We proposed an integrated predictor, iStable, with grid computing architecture constructed by using sequence information and prediction results from different element predictors. In the learning model, several machine learning methods were evaluated and adopted the support vector machine as an integrator, while not just choosing the majority answer given by element predictors. Furthermore, the role of the sequence information played was analyzed in our model, and an 11-window size was determined. On the other hand, iStable is available with two different input types: structural and sequential. After training and cross-validation, iStable has better performance than all of the element predictors on several datasets. Under different classifications and conditions for validation, this study has also shown better overall performance in different types of secondary structures, relative solvent accessibility circumstances, protein memberships in different superfamilies, and experimental conditions. Conclusions: The trained and validated version of iStable provides an accurate approach for prediction of protein stability changes. iStable is freely available online at: http://predictor.nchu.edu.tw/iStable.",
                "authors": [
                    {
                        "name": "Chen C.-W."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Chu Y.-W."
                    }
                ],
                "citationCount": 49,
                "date": "2013-01-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "iStable: Off-the-shelf predictor integration for predicting protein stability changes"
            },
            "pmid": "23369171"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}