{
    "additionDate": "2019-11-14T19:43:02Z",
    "biotoolsCURIE": "biotools:phylodyn_sample",
    "biotoolsID": "phylodyn_sample",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "juliapr@stanford.edu",
            "name": "Julia A. Palacios",
            "typeEntity": "Person"
        }
    ],
    "description": "Bayesian Estimation of Population Size Changes by Sampling Tajima's Trees | This is a branch forked from mdkarcher/phylodyn. The purpose of this branch of phylodyn is to incorporate the sampling of genealogies and facilitate phylodynamic inference and analysis from data directly. This branch includes some Python code and installation may be problematic. We are working to resolve this",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JuliaPalacios/phylodyn",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-05T10:51:33Z",
    "name": "phylodyn",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1534/GENETICS.119.302373",
            "metadata": {
                "abstract": "© 2019 by the Genetics Society of America.The large state space of gene genealogies is a major hurdle for inference methods based on Kingman's coalescent. Here, we present a new Bayesian approach for inferring past population sizes, which relies on a lower-resolution coalescent process that we refer to as \"Tajima's coalescent.\" Tajima's coalescent has a drastically smaller state space, and hence it is a computationally more efficient model, than the standard Kingman coalescent. We provide a new algorithm for efficient and exact likelihood calculations for data without recombination, which exploits a directed acyclic graph and a correspondingly tailored Markov Chain Monte Carlo method. We compare the performance of our Bayesian Estimation of population size changes by Sampling Tajima's Trees (BESTT) with a popular implementation of coalescent-based inference in BEAST using simulated and human data. We empirically demonstrate that BESTT can accurately infer effective population sizes, and it further provides an efficient alternative to the Kingman's coalescent. The algorithms described here are implemented in the R package phylodyn, which is available for download at https://github.com/ JuliaPalacios/phylodyn.",
                "authors": [
                    {
                        "name": "Cappello L."
                    },
                    {
                        "name": "Palacios J.A."
                    },
                    {
                        "name": "Ramachandran S."
                    },
                    {
                        "name": "Veber A."
                    },
                    {
                        "name": "Wakeley J."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Bayesian estimation of population size changes by sampling tajima's trees"
            },
            "pmcid": "PMC6827370",
            "pmid": "31511299"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
