
{
    "credit": [
        {
            "email": "yang_li89@outlook.com",
            "name": "Yang Li",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/keylabivdc/VIP/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "Python"
        ],
        "license": "LGPL-2.1",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Workflow"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Next-generation amplicon sequencing enables high-throughput genetic diagnostics, sequencing multiple genes in several patients together in one sequencing run. Currently, no open-source out-of-the-box software solution exists that reliably reports detected genetic variations and that can be used to improve future sequencing effectiveness by analyzing the PCR reactions.Results: We developed an integrated database oriented software pipeline for analysis of 454/Roche GS-FLX amplicon resequencing experiments using Perl and a relational database. The pipeline enables variation detection, variation detection validation, and advanced data analysis, which provides information that can be used to optimize PCR efficiency using traditional means. The modular approach enables customization of the pipeline where needed and allows researchers to adopt their analysis pipeline to their experiments. Clear documentation and training data is available to test and validate the pipeline prior to using it on real sequencing data.Conclusions: We designed an open-source database oriented pipeline that enables advanced analysis of 454/Roche GS-FLX amplicon resequencing experiments using SQL-statements. This modular database approach allows easy coupling with other pipeline modules such as variant interpretation or a LIMS system. There is also a set of standard reporting scripts available. © 2010 De Schrijver et al; licensee BioMed Central Ltd.",
            "authors": [
                "De Schrijver J.M.",
                "De Leeneer K.",
                "Lefever S.",
                "Sabbe N.",
                "Pattyn F.",
                "Van Nieuwerburgh F.",
                "Coucke P.",
                "Deforce D.",
                "Vandesompele J.",
                "Bekaert S.",
                "Hellemans J.",
                "Van Criekinge W."
            ],
            "cit_count": 14,
            "journal": "BMC Bioinformatics",
            "pmid": "20487544",
            "title": "Analysing 454 amplicon resequencing experiments using the modular and database oriented Variant Identification Pipeline",
            "year": "2010-05-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vip",
        "biotoolsID": "vip",
        "description": "A complete package designed for next-generation diagnostics using 454 sequencing.",
        "homepage": "https://github.com/keylabivdc/VIP",
        "name": "VIP"
    }
}