{
    "additionDate": "2019-11-14T19:36:52Z",
    "biotoolsCURIE": "biotools:TreeMerge",
    "biotoolsID": "TreeMerge",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "warnow@illinois.edu",
            "name": "Tandy Warnow",
            "orcidid": "https://orcid.org/0000-0001-7717-3514",
            "typeEntity": "Person"
        }
    ],
    "description": "a new method for improving the scalability of species tree estimation methods | TreeMerge is a tool for scaling phylogengy estimation methods to large datasets. TreeMerge can be used in a divide-and-conquer framework as follows: 1) divide the species set into disjoint subsets, 2) construct trees on each subset, and 3) combine the subset trees using an associated distance matrix (on the full species set). TreeMerge has been sucessfully tested in the context of species tree estimation (Molloy and Warnow, 2019)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (consensus)",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "http://github.com/ekmolloy/treemerge",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-30T15:57:17.641617Z",
    "name": "TreeMerge",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ344",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Motivation: At RECOMB-CG 2018, we presented NJMerge and showed that it could be used within a divide-and-conquer framework to scale computationally intensive methods for species tree estimation to larger datasets. However, NJMerge has two significant limitations: it can fail to return a tree and, when used within the proposed divide-and-conquer framework, has O(n5) running time for datasets with n species. Results: Here we present a new method called 'TreeMerge' that improves on NJMerge in two ways: it is guaranteed to return a tree and it has dramatically faster running time within the same divide-and-conquer framework'only O(n2) time. We use a simulation study to evaluate TreeMerge in the context of multi-locus species tree estimation with two leading methods, ASTRAL-III and RAxML. We find that the divide-and-conquer framework using TreeMerge has a minor impact on species tree accuracy, dramatically reduces running time, and enables both ASTRAL-III and RAxML to complete on datasets (that they would otherwise fail on), when given 64 GB of memory and 48 h maximum running time. Thus, TreeMerge is a step toward a larger vision of enabling researchers with limited computational resources to perform large-scale species tree estimation, which we call Phylogenomics for All.",
                "authors": [
                    {
                        "name": "Molloy E.K."
                    },
                    {
                        "name": "Warnow T."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TreeMerge: A new method for improving the scalability of species tree estimation methods"
            },
            "pmcid": "PMC6612878",
            "pmid": "31510668"
        }
    ],
    "topic": [
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}