{
    "accessibility": [],
    "additionDate": "2017-03-24T11:31:17Z",
    "biotoolsCURIE": "biotools:spring",
    "biotoolsID": "spring",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "yclin@cse.nsysu.edu.tw",
            "gridid": null,
            "name": "Ying Chih Lin",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://algorithm.cs.nthu.edu.tw/~linian/"
        },
        {
            "email": "cllu@cs.nthu.edu.tw",
            "gridid": null,
            "name": "Chin Lung Lu",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cc.nctu.edu.tw/~cllu/"
        },
        {
            "email": "cytang@cs.nthu.edu.tw",
            "gridid": null,
            "name": "Chuan Yi Tang",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.nthu.edu.tw/~cytang/"
        }
    ],
    "description": "A tool for the analysis of genome rearrangements. SPRING takes two or more chromosomes as its input and then computes a minimum series of reversals and/or block-interchanges for transforming one chromosome into another. Phylogenetic trees based on the rearrangement analysis are also shown as part of the results.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://algorithm.cs.nthu.edu.tw/tools/SPRING/help.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Phylogenetic tree generation (minimum distance methods)",
                    "uri": "http://edamontology.org/operation_0546"
                },
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                },
                {
                    "term": "Sequence distance matrix generation",
                    "uri": "http://edamontology.org/operation_0289"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://algorithm.cs.nthu.edu.tw/tools/SPRING",
    "homepage_status": 0,
    "language": [
        "PHP",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "SPRING",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Summary: ROBIN is a web server for analyzing genome rearrangement of block-interchanges between two chromosomal genomes. It takes two or more linear/circular chromosomes as its input, and computes the number of minimum block-interchange rearrangements between any two input chromosomes for transforming one chromosome into another and also determines an optimal scenario taking this number of rearrangements. The input can be either bacterial-size sequence data or landmark-order data. If the input is sequence data, ROBIN will automatically search for the identical landmarks that are the homologous/conserved regions shared by all the input sequences. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lu C.L."
                    },
                    {
                        "name": "Wang T.C."
                    },
                    {
                        "name": "Lin Y.C."
                    },
                    {
                        "name": "Yang C.Y."
                    }
                ],
                "citationCount": 10,
                "date": "2005-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ROBIN: A tool for genome rearrangement of block-interchanges"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15814563",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "In the study of genome rearrangement, the block-interchanges have been proposed recently as a new kind of global rearrangement events affecting a genome by swapping two nonintersecting segments of any length. The so-called block-interchange distance problem, which is equivalent to the sorting by block-interchange problem, is to find a minimum series of block-interchanges for transforming one chromosome into another. In this paper, we study this problem by considering the circular chromosomes and propose a script O sign(δn) time algorithm for solving it by making use of permutation groups in algebra, where n is the length of the circular chromosome and S is the minimum number of block-interchanges required for the transformation, which can be calculated in script O sign(n) time in advance. Moreover, we obtain analogous results by extending our algorithm to linear chromosomes. Finally, we have implemented our algorithm and applied it to the circular genomic sequences of three human vibrio pathogens for predicting their evolutionary relationships. Consequently, our experimental results coincide with the previous ones obtained by others using a different comparative genomics approach, which implies that the block-interchange events seem to play a significant role in the evolution of vibrio species.",
                "authors": [
                    {
                        "name": "Lin Y.C."
                    },
                    {
                        "name": "Lu C.L."
                    },
                    {
                        "name": "Chang H.-Y."
                    },
                    {
                        "name": "Tang C.Y."
                    }
                ],
                "citationCount": 45,
                "date": "2005-02-17T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "An efficient algorithm for sorting by block-interchanges and its application to the evolution of vibrio species"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15725736",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "SPRING(http://algorithm.cs.nthu.edu.tw/tools/SPRING/) is a tool for the analysis of genome rearrangement between two chromosomal genomes using reversals and/or block-interchanges. SPRING takes two ormore chromosomes as its input and then computes a minimum series of reversals and/or block-interchanges between any two input chromosomes for transforming one chromosome into another. The input of SPRING can be either bacterial-size sequences or gene/landmark orders. If the input is a set of chromosomal sequences then the SPRING will automatically search for identical landmarks, which are homologous/conserved regions shared by all input sequences. In particular, SPRING also computes the breakpoint distance between any pair of two chromosomes, which can be used to compare with the rearrangement distance to confirm whether they are correlated or not. In addition, SPRING shows phylogenetic trees that are reconstructed based on the rearrangement and breakpoint distance matrixes. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lin Y.C."
                    },
                    {
                        "name": "Lu C.L."
                    },
                    {
                        "name": "Liu Y.-C."
                    },
                    {
                        "name": "Tang C.Y."
                    }
                ],
                "citationCount": 22,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SPRING: A tool for the analysis of genome rearrangement using reversals and block-interchanges"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16845100",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": []
}