
{
    "credit": [
        {
            "email": "mock.science@gmail.com",
            "name": "Andreas Mock",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/CVE.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/CVE_1.0.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: An increasing number of precision oncology programmes are being launched world-wide. To support this development, we present the Cancer Variant Explorer (CVE), an R package with an interactive Shiny web browser interface. Results: Leveraging Oncotator and the Drug Gene Interaction Database, CVE offers exploration of variants within single or multiple tumour exomes to identify drivers, resistance mechanisms and to assess druggability. We present example applications including the analysis of an individual patient and a cohort-wide study, and provide a first extension of CVE by adding a tumour-specific co-expression network. Conclusions: The CVE package allows interactive variant prioritisation to expedite the analysis of cancer sequencing studies. Our framework also includes the prioritisation of druggable targets, allows exploratory analysis of tissue specific networks and is extendable for specific applications by virtue of its modular design. We encourage the use of CVE within translational research studies and molecular tumour boards. The CVE package is available via Bioconductor (http://bioconductor.org/packages/CVE/).",
            "authors": [
                "Mock A.",
                "Murphy S.",
                "Morris J.",
                "Marass F.",
                "Rosenfeld N.",
                "Massie C."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12920-017-0261-6",
            "journal": "BMC Medical Genomics",
            "title": "CVE: An R package for interactive variant prioritisation in precision oncology",
            "type": "Primary",
            "year": "2017-05-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cve",
        "biotoolsID": "cve",
        "description": "Shiny app for interactive variant prioritisation in precision cancer medicine. Its input file is the output of the Oncotator Variant Annotation tool that summarises variant-centric information from 14 different publicly available resources relevant for cancer researches. Interactive prioritisation in this tool is based on known germline and cancer variants, DNA repair genes and functional prediction scores.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/CVE.html",
        "name": "CVE",
        "version": [
            "1.0.0"
        ]
    }
}