
{
    "credit": [
        {
            "email": "deeptools@googlegroups.com",
            "name": "deepToops Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://deeptools.readthedocs.io/en/latest/content/api.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We present a Galaxy based web server for processing and visualizing deeply sequenced data. The web server's core functionality consists of a suite of newly developed tools, called deepTools, that enable users with little bioinformatic background to explore the results of their sequencing experiments in a standardized setting. Users can upload pre-processed files with continuous data in standard formats and generate heatmaps and summary plots in a straight-forward, yet highly customizable manner. In addition, we offer several tools for the analysis of files containing aligned reads and enable efficient and reproducible generation of normalized coverage files. As a modular and open-source platform, deepTools can easily be expanded and customized to future demands and developments. The deepTools webserver is freely available at http://deeptools.ie-freiburg.mpg.de and is accompanied by extensive documentation and tutorials aimed at conveying the principles of deep-sequencing data analysis. The web server can be used without registration. deepTools can be installed locally either stand-alone or as part of Galaxy. © 2014 The Author(s).",
            "authors": [
                "Ramirez F.",
                "Dundar F.",
                "Diehl S.",
                "Gruning B.A.",
                "Manke T."
            ],
            "cit_count": 313,
            "journal": "Nucleic Acids Research",
            "pmid": "24799436",
            "title": "DeepTools: A flexible platform for exploring deep-sequencing data",
            "year": "2014-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:deeptools",
        "biotoolsID": "deeptools",
        "description": "User-friendly tools for the normalization and visualization of deep-sequencing data.",
        "homepage": "https://deeptools.readthedocs.io/en/latest/",
        "name": "DeepTools"
    }
}