{
    "additionDate": "2021-01-18T12:16:34Z",
    "biotoolsCURIE": "biotools:megapath",
    "biotoolsID": "megapath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cmleung2@cs.hku.hk",
            "name": "Chi-Ming Leung",
            "typeEntity": "Person"
        }
    ],
    "description": "Sensitive and rapid pathogen detection using metagenomic NGS data.\n\nNext-generation sequencing (NGS) enables unbiased detection of pathogens by mapping the sequencing reads of a patient sample to the known reference sequence of bacteria and viruses. However, for a new pathogen without a reference sequence of a close relative, or with a high load of mutations compared to its predecessors, read mapping fails due to a low similarity between the pathogen and reference sequence, which in turn leads to insensitive and inaccurate pathogen",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/megapath",
    "lastUpdate": "2021-02-20T17:58:03Z",
    "name": "MegaPath",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-06875-6",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Next-generation sequencing (NGS) enables unbiased detection of pathogens by mapping the sequencing reads of a patient sample to the known reference sequence of bacteria and viruses. However, for a new pathogen without a reference sequence of a close relative, or with a high load of mutations compared to its predecessors, read mapping fails due to a low similarity between the pathogen and reference sequence, which in turn leads to insensitive and inaccurate pathogen detection outcomes. Results: We developed MegaPath, which runs fast and provides high sensitivity in detecting new pathogens. In MegaPath, we have implemented and tested a combination of polishing techniques to remove non-informative human reads and spurious alignments. MegaPath applies a global optimization to the read alignments and reassigns the reads incorrectly aligned to multiple species to a unique species. The reassignment not only significantly increased the number of reads aligned to distant pathogens, but also significantly reduced incorrect alignments. MegaPath implements an enhanced maximum-exact-match prefix seeding strategy and a SIMD-accelerated Smith-Waterman algorithm to run fast. Conclusions: In our benchmarks, MegaPath demonstrated superior sensitivity by detecting eight times more reads from a low-similarity pathogen than other tools. Meanwhile, MegaPath ran much faster than the other state-of-the-art alignment-based pathogen detection tools (and compariable with the less sensitivity profile-based pathogen detection tools). The running time of MegaPath is about 20 min on a typical 1 Gb dataset.",
                "authors": [
                    {
                        "name": "Lam T.-W."
                    },
                    {
                        "name": "Law W.-C."
                    },
                    {
                        "name": "Leung C.-M."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Luo R."
                    },
                    {
                        "name": "Ting H.-F."
                    },
                    {
                        "name": "Xin Y."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "MegaPath: sensitive and rapid pathogen detection using metagenomic NGS data"
            },
            "pmcid": "PMC7751095",
            "pmid": "33349238"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
