{
    "additionDate": "2023-01-25T14:47:00.642604Z",
    "biotoolsCURIE": "biotools:bglm",
    "biotoolsID": "bglm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "david.chesla@spectrumhealth.org",
            "name": "Dave Chesla",
            "typeEntity": "Person"
        }
    ],
    "description": "Big data-guided LOINC code mapper (BGLM), which leverages the large amount of patient data stored in EHR systems to perform LOINC coding mapping",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Bin-Chen-Lab/BGLM",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-01-25T14:47:00.645233Z",
    "license": "Not licensed",
    "name": "BGLM",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/JAMIAOPEN/OOAC099",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of the American Medical Informatics Association.Motivation: Mapping internal, locally used lab test codes to standardized logical observation identifiers names and codes (LOINC) terminology has become an essential step in harmonizing electronic health record (EHR) data across different institutions. However, most existing LOINC code mappers are based on text-mining technology and do not provide robust multi-language support. Materials and methods: We introduce a simple, yet effective tool called big data-guided LOINC code mapper (BGLM), which leverages the large amount of patient data stored in EHR systems to perform LOINC coding mapping. Distinguishing from existing methods, BGLM conducts mapping based on distributional similarity. Results: We validated the performance of BGLM with real-world datasets and showed that high mapping precision could be achieved under proper false discovery rate control. In addition, we showed that the mapping results of BGLM could be used to boost the performance of Regenstrief LOINC Mapping Assistant (RELMA), one of the most widely used LOINC code mappers. Conclusions: BGLM paves a new way for LOINC code mapping and therefore could be applied to EHR systems without the restriction of languages. BGLM is freely available at https://github.com/Bin-Chen-Lab/BGLM.",
                "authors": [
                    {
                        "name": "Chekalin E."
                    },
                    {
                        "name": "Chen B."
                    },
                    {
                        "name": "Chesla D."
                    },
                    {
                        "name": "Glicksberg B.S."
                    },
                    {
                        "name": "Kulkarni O."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Paithankar S."
                    },
                    {
                        "name": "Shankar R."
                    },
                    {
                        "name": "Witteveen-Lane M."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "BGLM: big data-guided LOINC mapping with multi-language support"
            },
            "pmcid": "PMC9696745",
            "pmid": "36448022"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
