{
    "accessibility": "Open access",
    "additionDate": "2022-12-12T21:24:52.937941Z",
    "biotoolsCURIE": "biotools:scgwas",
    "biotoolsID": "scgwas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhongming.zhao@uth.tmc.edu",
            "name": "Zhongming Zhao",
            "orcidid": "https://orcid.org/0000-0002-3477-0914",
            "typeEntity": "Person"
        },
        {
            "name": "Fangfang Yan"
        },
        {
            "name": "Peilin Jia"
        },
        {
            "name": "Ruifeng Hu"
        },
        {
            "name": "Yulin Dai"
        }
    ],
    "description": "Landscape of trait-cell type associations by integrating single-cell transcriptomics-wide and genome-wide association studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bsml320/scGWAS",
    "language": [
        "Java",
        "R"
    ],
    "lastUpdate": "2022-12-12T21:24:52.940383Z",
    "license": "GPL-3.0",
    "name": "scGWAS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13059-022-02785-W",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: The rapid accumulation of single-cell RNA sequencing (scRNA-seq) data presents unique opportunities to decode the genetically mediated cell-type specificity in complex diseases. Here, we develop a new method, scGWAS, which effectively leverages scRNA-seq data to achieve two goals: (1) to infer the cell types in which the disease-associated genes manifest and (2) to construct cellular modules which imply disease-specific activation of different processes. Results: scGWAS only utilizes the average gene expression for each cell type followed by virtual search processes to construct the null distributions of module scores, making it scalable to large scRNA-seq datasets. We demonstrated scGWAS in 40 genome-wide association studies (GWAS) datasets (average sample size N ≈ 154,000) using 18 scRNA-seq datasets from nine major human/mouse tissues (totaling 1.08 million cells) and identified 2533 trait and cell-type associations, each with significant modules for further investigation. The module genes were validated using disease or clinically annotated references from ClinVar, OMIM, and pLI variants. Conclusions: We showed that the trait-cell type associations identified by scGWAS, while generally constrained to trait-tissue associations, could recapitulate many well-studied relationships and also reveal novel relationships, providing insights into the unsolved trait-tissue associations. Moreover, in each specific cell type, the associations with different traits were often mediated by different sets of risk genes, implying disease-specific activation of driving processes. In summary, scGWAS is a powerful tool for exploring the genetic basis of complex diseases at the cell type level using single-cell expression data.",
                "authors": [
                    {
                        "name": "Dai Y."
                    },
                    {
                        "name": "Hu R."
                    },
                    {
                        "name": "Jia P."
                    },
                    {
                        "name": "Yan F."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Genome Biology",
                "title": "scGWAS: landscape of trait-cell type associations by integrating single-cell transcriptomics-wide and genome-wide association studies"
            },
            "pmcid": "PMC9575201",
            "pmid": "36253801"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
