{
    "additionDate": "2020-01-14T09:04:03Z",
    "biotoolsCURIE": "biotools:SyntDB",
    "biotoolsID": "SyntDB",
    "confidence_flag": "tool",
    "description": "SyntDB: defining orthologues of human long noncoding RNAs across primates.\n\nSyntDB - the database of human long non-coding RNAs conserved across primates. Comprehensive collection of long noncoding RNAs (lncRNAs) and their evolutionary relationships in twelve primate species, including human",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://syntdb.amu.edu.pl/",
    "lastUpdate": "2024-11-24T20:52:39.855674Z",
    "name": "SyntDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz941",
            "metadata": {
                "abstract": "SyntDB (http://syntdb.amu.edu.pl/) is a collection of data on long noncoding RNAs (lncRNAs) and their evolutionary relationships in twelve primate species, including humans. This is the first database dedicated to primate lncRNAs, thousands of which are uniquely stored in SyntDB. The lncRNAs were predicted with our computational pipeline using publicly available RNA-Seq data spanning diverse tissues and organs. Most of the species included in SyntDB still lack lncRNA annotations in public resources. In addition to providing users with unique sets of lncRNAs and their characteristics, SyntDB provides data on orthology relationships between the lncRNAs of humans and other primates, which are not available on this scale elsewhere. Keeping in mind that only a small fraction of currently known human lncRNAs have been functionally characterized and that lncRNA conservation is frequently used to identify the most relevant lncRNAs for functional studies, we believe that SyntDB will contribute to ongoing research aimed at deciphering the biological roles of lncRNAs.",
                "authors": [
                    {
                        "name": "Bryzghalov O."
                    },
                    {
                        "name": "Makalowska I."
                    },
                    {
                        "name": "Szczesniak M.W."
                    }
                ],
                "citationCount": 19,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SyntDB: Defining orthologues of human long noncoding RNAs across primates"
            },
            "pmcid": "PMC7145678",
            "pmid": "31728519"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
