{
    "additionDate": "2017-08-03T18:55:44Z",
    "biotoolsCURIE": "biotools:phosphopick",
    "biotoolsID": "phosphopick",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinf.scmb.uq.edu.au/phosphopick/contact"
        }
    ],
    "description": "Method for predicting kinase substrates using cellular context information, and is currently able to make predictions for 59 human kinases.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinf.scmb.uq.edu.au/phosphopick/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.scmb.uq.edu.au/phosphopick/phosphopick",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/phosphopick-phosphorylation-in-a-protein-interaction-context-for-kinases.html"
        }
    ],
    "name": "PhosphoPICK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: The determinants of kinase-substrate phosphorylation can be found both in the substrate sequence and the surrounding cellular context. Cell cycle progression, interactions with mediating proteins and even prior phosphorylation events are necessary for kinases to maintain substrate specificity. While much work has focussed on the use of sequence-based methods to predict phosphorylation sites, there has been very little work invested into the application of systems biology to understand phosphorylation. Lack of specificity in many kinase substrate binding motifs means that sequence methods for predicting kinase binding sites are susceptible to high false-positive rates. Results: We present here a model that takes into account protein-protein interaction information, and protein abundance data across the cell cycle to predict kinase substrates for 59 human kinases that are representative of important biological pathways. The model shows high accuracy for substrate prediction (with an average AUC of 0.86) across the 59 kinases tested. When using the model to complement sequence-based kinase-specific phosphorylation site prediction, we found that the additional information increased prediction performance for most comparisons made, particularly on kinases from the CMGC family. We then used our model to identify functional overlaps between predicted CDK2 substrates and targets from the E2F family of transcription factors. Our results demonstrate that a model harnessing context data can account for the short-falls in sequence information and provide a robust description of the cellular events that regulate protein phosphorylation.",
                "authors": [
                    {
                        "name": "Patrick R."
                    },
                    {
                        "name": "Le Cao K.-A."
                    },
                    {
                        "name": "Kobe B."
                    },
                    {
                        "name": "Boden M."
                    }
                ],
                "citationCount": 12,
                "date": "2015-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PhosphoPICK: Modelling cellular context to map kinase-substrate phosphorylation events"
            },
            "pmid": "25304781"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1
}