{
    "additionDate": "2018-06-18T09:57:36Z",
    "biotoolsCURIE": "biotools:grinn",
    "biotoolsID": "grinn",
    "credit": [
        {
            "email": "onursercin@gmail.com",
            "name": "Onur Serçinoğlu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "pemra.ozbek@marmara.edu.tr",
            "name": "Pemra Ozbek",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "get Residue Interaction eNergies and Networks. Calculation of residue interaction energies and protein energy network analysis of molecular dynamics simulations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://media.readthedocs.org/pdf/grinn/latest/grinn.pdf"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://grinn.readthedocs.io/en/latest/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Residue interaction calculation",
                    "uri": "http://edamontology.org/operation_0248"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://grinn.readthedocs.io/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "gRINN",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky381",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Atomistic molecular dynamics (MD) simulations generate a wealth of information related to the dynamics of proteins. If properly analyzed, this information can lead to new insights regarding protein function and assist wet-lab experiments. Aiming to identify interactions between individual amino acid residues and the role played by each in the context of MD simulations, we present a stand-alone software called gRINN (get Residue Interaction eNergies and Networks). gRINN features graphical user interfaces (GUIs) and a command-line interface for generating and analyzing pairwise residue interaction energies and energy correlations from protein MD simulation trajectories. gRINN utilizes the features of NAMD or GROMACS MD simulation packages and automatizes the steps necessary to extract residue-residue interaction energies from user-supplied simulation trajectories, greatly simplifying the analysis for the end-user. A GUI, including an embedded molecular viewer, is provided for visualization of interaction energy time-series, distributions, an interaction energy matrix, interaction energy correlations and a residue correlation matrix. gRINN additionally offers construction and analysis of Protein Energy Networks, providing residue-based metrics such as degrees, betweenness-centralities, closeness centralities as well as shortest path analysis. gRINN is free and open to all users without login requirement at http://grinn.readthedocs.io.",
                "authors": [
                    {
                        "name": "Ozbek P."
                    },
                    {
                        "name": "Sercinoglu O."
                    }
                ],
                "citationCount": 31,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GRINN: A tool for calculation of residue interaction energies and protein energy network analysis of molecular dynamics simulations"
            },
            "pmid": "29800260"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.0"
    ]
}
