{
    "name": "NPBSS", 
    "description": "A new PacBio sequencing simulator is developed for producing CLR reads. It simulator firstly samples the read sequences according to the read length logarithmic normal distribution, and choses different base quality values with different proportions. Then, it computes the overall error probability of each base in the read sequence with an empirical model, and calculates the deletion, substitution and insertion probabilities with the overall error probability to generate the PacBio CLR reads.", 
    "homepage": "https://github.com/NWPU-903PR/NPBSS_Octave", 
    "biotoolsID": "npbss", 
    "biotoolsCURIE": "biotools:npbss", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2426", 
                    "term": "Modelling and simulation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2238", 
                    "term": "Statistical calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }, 
        {
            "uri": "http://edamontology.org/topic_0199", 
            "term": "Genetic variation"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/NWPU-903PR/NPBSS_MATLAB", 
            "type": "Mirror", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/NWPU-903PR/NPBSS_Octave/blob/master/readme.txt", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-018-2208-0", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "NPBSS: A new PacBio sequencing simulator for generating the continuous long reads with an empirical model", 
                "abstract": "© 2018 The Author(s). Background: PacBio sequencing platform offers longer read lengths than the second-generation sequencing technologies. It has revolutionized de novo genome assembly and enabled the automated reconstruction of reference-quality genomes. Due to its extremely wide range of application areas, fast sequencing simulation systems with high fidelity are in great demand to facilitate the development and comparison of subsequent analysis tools. Although there are several available simulators (e.g., PBSIM, SimLoRD and FASTQSim) that target the specific generation of PacBio libraries, the error rate of simulated sequences is not well matched to the quality value of raw PacBio datasets, especially for PacBio's continuous long reads (CLR). Results: By analyzing the characteristic features of CLR data from PacBio SMRT (single molecule real time) sequencing, we developed a new PacBio sequencing simulator (called NPBSS) for producing CLR reads. NPBSS simulator firstly samples the read sequences according to the read length logarithmic normal distribution, and choses different base quality values with different proportions. Then, NPBSS computes the overall error probability of each base in the read sequence with an empirical model, and calculates the deletion, substitution and insertion probabilities with the overall error probability to generate the PacBio CLR reads. Alignment results demonstrate that NPBSS fits the error rate of the PacBio CLR reads better than PBSIM and FASTQSim. In addition, the assembly results also show that simulated sequences of NPBSS are more like real PacBio CLR data. Conclusion: NPBSS simulator is convenient to use with efficient computation and flexible parameters setting. Its generating PacBio CLR reads are more like real PacBio datasets.", 
                "date": "2018-05-22T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Wei Z.-G."
                    }, 
                    {
                        "name": "Zhang S.-W."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Shao-Wu Zhang", 
            "email": "zhangsw@nwpu.edu.cn", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "shadi.m", 
    "additionDate": "2018-07-31T18:18:56Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}