{
    "name": "acdc", 
    "description": "A tool to test next-generation-sequencing (NGS) data from single-cell sequencing for contamination. By using sophisticated dimensionality reduction and clustering methods, it uses tetramer profiles to differentiate between different species in a given sample.", 
    "homepage": "https://bibiserv.cebitec.uni-bielefeld.de/acdc/", 
    "biotoolsID": "acdc_estimation", 
    "biotoolsCURIE": "biotools:acdc_estimation", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0291", 
                    "term": "Sequence clustering"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0925", 
                        "term": "Sequence assembly"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1929", 
                            "term": "FASTA"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2048", 
                        "term": "Report"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2331", 
                            "term": "HTML"
                        }
                    ]
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "https://github.com/mlux86/acdc", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/acdc?id=acdc_manual", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-016-1397-7", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "acdc - Automated Contamination Detection and Confidence estimation for single-cell genome data", 
                "abstract": "© 2016 The Author(s).Background: A major obstacle in single-cell sequencing is sample contamination with foreign DNA. To guarantee clean genome assemblies and to prevent the introduction of contamination into public databases, considerable quality control efforts are put into post-sequencing analysis. Contamination screening generally relies on reference-based methods such as database alignment or marker gene search, which limits the set of detectable contaminants to organisms with closely related reference species. As genomic coverage in the tree of life is highly fragmented, there is an urgent need for a reference-free methodology for contaminant identification in sequence data. Results: We present acdc, a tool specifically developed to aid the quality control process of genomic sequence data. By combining supervised and unsupervised methods, it reliably detects both known and de novo contaminants. First, 16S rRNA gene prediction and the inclusion of ultrafast exact alignment techniques allow sequence classification using existing knowledge from databases. Second, reference-free inspection is enabled by the use of state-of-the-art machine learning techniques that include fast, non-linear dimensionality reduction of oligonucleotide signatures and subsequent clustering algorithms that automatically estimate the number of clusters. The latter also enables the removal of any contaminant, yielding a clean sample. Furthermore, given the data complexity and the ill-posedness of clustering, acdc employs bootstrapping techniques to provide statistically profound confidence values. Tested on a large number of samples from diverse sequencing projects, our software is able to quickly and accurately identify contamination. Results are displayed in an interactive user interface. Acdc can be run from the web as well as a dedicated command line application, which allows easy integration into large sequencing project analysis workflows. Conclusions: Acdc can reliably detect contamination in single-cell genome data. In addition to database-driven detection, it complements existing tools by its unsupervised techniques, which allow for the detection of de novo contaminants. Our contribution has the potential to drastically reduce the amount of resources put into these processes, particularly in the context of limited availability of reference species. As single-cell genome data continues to grow rapidly, acdc adds to the toolkit of crucial quality assurance tools.", 
                "date": "2016-12-20T00:00:00Z", 
                "citationCount": 6, 
                "authors": [
                    {
                        "name": "Lux M."
                    }, 
                    {
                        "name": "Kruger J."
                    }, 
                    {
                        "name": "Rinke C."
                    }, 
                    {
                        "name": "Maus I."
                    }, 
                    {
                        "name": "Schluter A."
                    }, 
                    {
                        "name": "Woyke T."
                    }, 
                    {
                        "name": "Sczyrba A."
                    }, 
                    {
                        "name": "Hammer B."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Markus Lux", 
            "email": null, 
            "url": "https://ekvv.uni-bielefeld.de/pers_publ/publ/PersonDetail.jsp?personId=51526921", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Markus Lux", 
            "email": null, 
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/acdc/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "BiBiServ", 
    "additionDate": "2017-02-23T11:04:27Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}