{
    "accessibility": "Open access",
    "additionDate": "2021-12-15T18:34:12.961850Z",
    "biotoolsCURIE": "biotools:chipin",
    "biotoolsID": "chipin",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "valentina.boeva@inf.ethz.ch",
            "name": "Valentina Boeva",
            "orcidid": "https://orcid.org/0000-0002-4382-7185",
            "typeEntity": "Person"
        }
    ],
    "description": "CHIPIN is an R package that provides a normalization procedure to compare signals between ChIP-seq samples in different conditions; experiments should be performed using the same antibody.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BoevaLab/CHIPIN",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-15T18:34:12.964570Z",
    "license": "GPL-3.0",
    "name": "CHIPIN",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04320-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Multiple studies rely on ChIP-seq experiments to assess the effect of gene modulation and drug treatments on protein binding and chromatin structure. However, most methods commonly used for the normalization of ChIP-seq binding intensity signals across conditions, e.g., the normalization to the same number of reads, either assume a constant signal-to-noise ratio across conditions or base the estimates of correction factors on genomic regions with intrinsically different signals between conditions. Inaccurate normalization of ChIP-seq signal may, in turn, lead to erroneous biological conclusions. Results: We developed a new R package, CHIPIN, that allows normalizing ChIP-seq signals across different conditions/samples when spike-in information is not available, but gene expression data are at hand. Our normalization technique is based on the assumption that, on average, no differences in ChIP-seq signals should be observed in the regulatory regions of genes whose expression levels are constant across samples/conditions. In addition to normalizing ChIP-seq signals, CHIPIN provides as output a number of graphs and calculates statistics allowing the user to assess the efficiency of the normalization and qualify the specificity of the antibody used. In addition to ChIP-seq, CHIPIN can be used without restriction on open chromatin ATAC-seq or DNase hypersensitivity data. We validated the CHIPIN method on several ChIP-seq data sets and documented its superior performance in comparison to several commonly used normalization techniques. Conclusions: The CHIPIN method provides a new way for ChIP-seq signal normalization across conditions when spike-in experiments are not available. The method is implemented in a user-friendly R package available on GitHub: https://github.com/BoevaLab/CHIPIN.",
                "authors": [
                    {
                        "name": "Polit L."
                    },
                    {
                        "name": "Kerdivel G."
                    },
                    {
                        "name": "Gregoricchio S."
                    },
                    {
                        "name": "Esposito M."
                    },
                    {
                        "name": "Guillouf C."
                    },
                    {
                        "name": "Boeva V."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CHIPIN: ChIP-seq inter-sample normalization based on signal invariance across transcriptionally constant genes"
            },
            "pmcid": "PMC8371782",
            "pmid": "34404353"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}