{
    "accessibility": "Open access",
    "additionDate": "2022-07-25T21:28:49.598679Z",
    "biotoolsCURIE": "biotools:pfmuldl",
    "biotoolsID": "pfmuldl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Fengcheng Li"
        },
        {
            "name": "Lingyan Zheng"
        },
        {
            "name": "Weiqi Xia"
        },
        {
            "name": "Jiebin Fang",
            "orcidid": "https://orcid.org/0000-0002-0748-770X"
        }
    ],
    "description": "A novel strategy enabling multi-class and multi-label protein function annotation by integrating diverse deep learning methods.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/idrblab/PFmulDL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:52:57.804338Z",
    "license": "MIT",
    "name": "PFmulDL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.105465",
            "metadata": {
                "abstract": "Bioinformatic annotation of protein function is essential but extremely sophisticated, which asks for extensive efforts to develop effective prediction method. However, the existing methods tend to amplify the representativeness of the families with large number of proteins by misclassifying the proteins in the families with small number of proteins. That is to say, the ability of the existing methods to annotate proteins in the ‘rare classes’ remains limited. Herein, a new protein function annotation strategy, PFmulDL, integrating multiple deep learning methods, was thus constructed. First, the recurrent neural network was integrated, for the first time, with the convolutional neural network to facilitate the function annotation. Second, a transfer learning method was introduced to the model construction for further improving the prediction performances. Third, based on the latest data of Gene Ontology, the newly constructed model could annotate the largest number of protein families comparing with the existing methods. Finally, this newly constructed model was found capable of significantly elevating the prediction performance for the ‘rare classes’ without sacrificing that for the ‘major classes’. All in all, due to the emerging requirements on improving the prediction performance for the proteins in ‘rare classes’, this new strategy would become an essential complement to the existing methods for protein function prediction. All the models and source codes are freely available and open to all users at: https://github.com/idrblab/PFmulDL.",
                "authors": [
                    {
                        "name": "Fang J."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Xia W."
                    },
                    {
                        "name": "Zeng Z."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Zheng L."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhu F."
                    }
                ],
                "citationCount": 50,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "PFmulDL: a novel strategy enabling multi-class and multi-label protein function annotation by integrating diverse deep learning methods"
            },
            "pmid": "35366467"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
