{"credit":[],"labels":{"topic":[{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Medical imaging","uri":"http://edamontology.org/topic_3384"},{"term":"Medicine","uri":"http://edamontology.org/topic_3303"}]},"publication":[{"abstract":"IEEEWith the development of deep learning methods such as convolutional neural network (CNN), the accuracy of automated pulmonary nodule detection has been greatly improved. However, the high computational and storage costs of the large-scale network have been a potential concern for the future widespread clinical application. In this paper, an alternative Multi-ringed (MR)-Forest framework, against the resource-consuming neural networks (NN)-based architectures, has been proposed for false positive reduction in pulmonary nodule detection, which consists of three steps. First, a novel multi-ringed scanning method is used to extract the order ring facets (ORFs) from the surface voxels of the volumetric nodule models; Second, Mesh-LBP and mapping deformation are employed to estimate the texture and shape features. By sliding and resampling the multi-ringed ORFs, feature volumes with different lengths are generated. Finally, the outputs of multilevel are cascaded to predict the candidate class. On 1034 scans merging the dataset from the Affiliated Hospital of Liaoning University of Traditional Chinese Medicine (AH-LUTCM) and the LUNA16 Challenge dataset, our framework performs enough competitiveness than state-of-the-art in false positive reduction task (CPM score of 0.865). Experimental results demonstrate that MR-Forest is a successful substitution to satisfied both resource-consuming and effectiveness for automated pulmonary nodule detection systems. The proposed MR-forest is a general architecture for 3D target detection, it can be easily extended in many other medical imaging analysis tasks, where the growth trend of the targeting object is approximated as a spheroidal expansion.","authors":["Zhu H.","Zhao H.","Song C.","Bian Z.","Bi Y.","Liu T.","He X.","Yang D.","Cai W."],"cit_count":0,"doi":"10.1109/JBHI.2019.2947506","journal":"IEEE Journal of Biomedical and Health Informatics","pmid":"31634145","title":"MR-Forest: A Deep Decision Framework for False Positive Reduction in Pulmonary Nodule Detection","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:MR-Forest","biotoolsID":"MR-Forest","description":"A Deep Decision Framework for False Positive Reduction in Pulmonary Nodule Detection.\n\nWith the development of deep learning methods such as convolutional neural network (CNN), the accuracy of automated pulmonary nodule detection has been greatly improved. However, the high computational and storage costs of the large-scale network have been a potential concern for the future widespread clinical application. In this paper, an alternative Multi-ringed (MR)-Forest framework, against the resource-consuming neural networks (NN)-based architectures, has been proposed for false positive reduction in pulmonary nodule detection, which consists of three steps. First, a novel multi-ringed scanning method is used to extract the order ring facets (ORFs) from the surface voxels of the volumetric nodule models; Second, Mesh-LBP and mapping deformation are employed to estimate the texture and shape features.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'LUNA16'","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31634145","name":"MR)-Forest"}}