{
    "additionDate": "2019-11-14T19:59:15Z",
    "biotoolsCURIE": "biotools:3D-ADA",
    "biotoolsID": "3D-ADA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mxu1@cs.cmu.edu",
            "name": "Min Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "A method for adversarial domain adaptation for cross data source macromolecule in situ structural classification in cellular electron cryo-tomograms.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/xulabs/aitom/tree/master/aitom/classify/deep/supervised/cnn/domain_adaptation_adversarial",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-09T15:53:38Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/xulabs/aitom/issues"
        }
    ],
    "name": "3D-ADA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ364",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Since 2017, an increasing amount of attention has been paid to the supervised deep learning-based macromolecule in situ structural classification (i.e. subtomogram classification) in cellular electron cryo-tomography (CECT) due to the substantially higher scalability of deep learning. However, the success of such supervised approach relies heavily on the availability of large amounts of labeled training data. For CECT, creating valid training data from the same data source as prediction data is usually laborious and computationally intensive. It would be beneficial to have training data from a separate data source where the annotation is readily available or can be performed in a high-throughput fashion. However, the cross data source prediction is often biased due to the different image intensity distributions (a.k.a. domain shift). Results: We adapt a deep learning-based adversarial domain adaptation (3D-ADA) method to timely address the domain shift problem in CECT data analysis. 3D-ADA first uses a source domain feature extractor to extract discriminative features from the training data as the input to a classifier. Then it adversarially trains a target domain feature extractor to reduce the distribution differences of the extracted features between training and prediction data. As a result, the same classifier can be directly applied to the prediction data. We tested 3D-ADA on both experimental and realistically simulated subtomogram datasets under different imaging conditions. 3D-ADA stably improved the cross data source prediction, as well as outperformed two popular domain adaptation methods. Furthermore, we demonstrate that 3D-ADA can improve cross data source recovery of novel macromolecular structures.",
                "authors": [
                    {
                        "name": "Kitani K."
                    },
                    {
                        "name": "Lin R."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Zeng X."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Adversarial domain adaptation for cross data source macromolecule in situ structural classification in cellular electron cryo-tomograms"
            },
            "pmcid": "PMC6612867",
            "pmid": "31510673"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
