{
    "accessibility": "Open access",
    "additionDate": "2022-05-27T15:28:17.518911Z",
    "biotoolsCURIE": "biotools:gincco",
    "biotoolsID": "gincco",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "paul.scherer@cl.cam.ac.uk",
            "name": "Paul Scherer",
            "orcidid": "https://orcid.org/0000-0002-2240-7501",
            "typeEntity": "Person"
        },
        {
            "name": "Pietro Liò"
        },
        {
            "name": "Ramon Viñas",
            "orcidid": "https://orcid.org/0000-0003-2411-4478"
        }
    ],
    "description": "Unsupervised construction of computational graphs for gene expression data with explicit structural inductive biases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/paulmorio/gincco",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-27T15:28:17.521392Z",
    "license": "MIT",
    "name": "GINCCo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB830",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Motivation: Gene expression data are commonly used at the intersection of cancer research and machine learning for better understanding of the molecular status of tumour tissue. Deep learning predictive models have been employed for gene expression data due to their ability to scale and remove the need for manual feature engineering. However, gene expression data are often very high dimensional, noisy and presented with a low number of samples. This poses significant problems for learning algorithms: models often overfit, learn noise and struggle to capture biologically relevant information. In this article, we utilize external biological knowledge embedded within structures of gene interaction graphs such as protein-protein interaction (PPI) networks to guide the construction of predictive models. Results: We present Gene Interaction Network Constrained Construction (GINCCo), an unsupervised method for automated construction of computational graph models for gene expression data that are structurally constrained by prior knowledge of gene interaction networks. We employ this methodology in a case study on incorporating a PPI network in cancer phenotype prediction tasks. Our computational graphs are structurally constructed using topological clustering algorithms on the PPI networks which incorporate inductive biases stemming from network biology research on protein complex discovery. Each of the entities in the GINCCo computational graph represents biological entities such as genes, candidate protein complexes and phenotypes instead of arbitrary hidden nodes of a neural network. This provides a biologically relevant mechanism for model regularization yielding strong predictive performance while drastically reducing the number of model parameters and enabling guided post-hoc enrichment analyses of influential gene sets with respect to target phenotypes. Our experiments analysing a variety of cancer phenotypes show that GINCCo often outperforms support vector machine, Fully Connected Multi-layer Perceptrons (MLP) and Randomly Connected MLPs despite greatly reduced model complexity.",
                "authors": [
                    {
                        "name": "Jamnik M."
                    },
                    {
                        "name": "Lio P."
                    },
                    {
                        "name": "Scherer P."
                    },
                    {
                        "name": "Shams Z."
                    },
                    {
                        "name": "Simidjievski N."
                    },
                    {
                        "name": "Terre H.A."
                    },
                    {
                        "name": "Trebacz M."
                    },
                    {
                        "name": "Vinas R."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Unsupervised construction of computational graphs for gene expression data with explicit structural inductive biases"
            },
            "pmcid": "PMC8826027",
            "pmid": "34888618"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
