
{
    "credit": [
        {
            "email": "l.coin@imb.uq.edu.au",
            "name": "Lachlan J M Coin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/Devika1/capsim"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "DNA substitution modelling",
                    "uri": "http://edamontology.org/operation_0550"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell"
        ],
        "license": "BSD-2-Clause",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Preclinical and clinical studies",
                "uri": "http://edamontology.org/topic_3379"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation Targeted sequencing using capture probes has become increasingly popular in clinical applications due to its scalability and cost-effectiveness. The approach also allows for higher sequencing coverage of the targeted regions resulting in better analysis statistical power. However, because of the dynamics of the hybridization process, it is difficult to evaluate the efficiency of the probe design prior to the experiments which are time consuming and costly. Results We developed CapSim, a software package for simulation of targeted sequencing. Given a genome sequence and a set of probes, CapSim simulates the fragmentation, the dynamics of probe hybridization and the sequencing of the captured fragments on Illumina and PacBio sequencing platforms. The simulated data can be used for evaluating the performance of the analysis pipeline, as well as the efficiency of the probe design. Parameters of the various stages in the sequencing process can also be evaluated in order to optimize the experiments.",
            "authors": [
                "Cao M.D.",
                "Ganesamoorthy D.",
                "Zhou C.",
                "Coin L.J.M."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx691",
            "journal": "Bioinformatics",
            "title": "Simulating the dynamics of targeted capture sequencing with CapSim",
            "year": "2018-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:capsim",
        "biotoolsID": "capsim",
        "description": "Simulation of targeted sequencing. Given a genome sequence and a set of probes, it simulates the fragmentation, the dynamics of probe hybridization and the sequencing of the captured fragments on Illumina and PacBio sequencing platforms. The simulated data can be used for evaluating the performance of the analysis pipeline, as well as the efficiency of the probe design.",
        "homepage": "https://github.com/Devika1/capsim",
        "name": "CapSim"
    }
}