{
    "additionDate": "2022-11-12T18:27:11.574767Z",
    "biotoolsCURIE": "biotools:mlacp_2.0",
    "biotoolsID": "mlacp_2.0",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bala2022@skku.edu",
            "name": "Balachandran Manavalan",
            "typeEntity": "Person"
        },
        {
            "email": "jeon2020@skku.edu",
            "name": "Young-Jun Jeon",
            "typeEntity": "Person"
        },
        {
            "name": "Le Thi Phan"
        }
    ],
    "description": "A machine learning tool for anticancer peptide prediction based on peptide sequence information",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://balalab-skku.org/mlacp2",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:21:24.786657Z",
    "license": "Not licensed",
    "name": "MLACP 2.0",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2022.07.043",
            "metadata": {
                "abstract": "Anticancer peptides are emerging anticancer drug that offers fewer side effects and is more effective than chemotherapy and targeted therapy. Predicting anticancer peptides from sequence information is one of the most challenging tasks in immunoinformatics. In the past ten years, machine learning-based approaches have been proposed for identifying ACP activity from peptide sequences. These methods include our previous method MLACP (developed in 2017) which made a significant impact on anticancer research. MLACP tool has been widely used by the research community, however, its robustness must be improved significantly for its continued practical application. In this study, the first large non-redundant training and independent datasets were constructed for ACP research. Using the training dataset, the study explored a wide range of feature encodings and developed their respective models using seven different conventional classifiers. Subsequently, a subset of encoding-based models was selected for each classifier based on their performance, whose predicted scores were concatenated and trained through a convolutional neural network (CNN), whose corresponding predictor is named MLACP 2.0. The evaluation of MLACP 2.0 with a very diverse independent dataset showed excellent performance and significantly outperformed the recent ACP prediction tools. Additionally, MLACP 2.0 exhibits superior performance during cross-validation and independent assessment when compared to CNN-based embedding models and conventional single models. Consequently, we anticipate that our proposed MLACP 2.0 will facilitate the design of hypothesis-driven experiments by making it easier to discover novel ACPs. The MLACP 2.0 is freely available at https://balalab-skku.org/mlacp2.",
                "authors": [
                    {
                        "name": "Jeon Y.-J."
                    },
                    {
                        "name": "Madhavan T."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Pitti T."
                    },
                    {
                        "name": "Thi Phan L."
                    },
                    {
                        "name": "Woo Park H."
                    }
                ],
                "citationCount": 40,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "MLACP 2.0: An updated machine learning tool for anticancer peptide prediction"
            },
            "pmcid": "PMC9421197",
            "pmid": "36051870"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
