{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T10:31:42.736158Z",
    "biotoolsCURIE": "biotools:abawaca",
    "biotoolsID": "abawaca",
    "cost": "Free of charge",
    "description": "abawaca (A Binning Algorithm Without A Cool Acronym) is a binning program that can take advantage of different types of information such as differential coverage and DNA signature.",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://bioconda.github.io/recipes/abawaca/README.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CK7/abawaca",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:11:04.883807Z",
    "license": "Not licensed",
    "name": "abawaca",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1038/nature14486",
            "metadata": {
                "abstract": "A prominent feature of the bacterial domain is a radiation of major lineages that are defined as candidate phyla because they lack isolated representatives. Bacteria from these phyla occur in diverse environments and are thought to mediate carbon and hydrogen cycles. Genomic analyses of a few representatives suggested that metabolic limitations have prevented their cultivation. Here we reconstructed 8 complete and 789 draft genomes from bacteria representing >35 phyla and documented features that consistently distinguish these organisms from other bacteria. We infer that this group, which may comprise >15% of the bacterial domain, has shared evolutionary history, and describe it as the candidate phyla radiation (CPR). All CPR genomes are small and most lack numerous biosynthetic pathways. Owing to divergent 16S ribosomal RNA (rRNA) gene sequences, 50-100% of organisms sampled from specific phyla would evade detection in typical cultivation-independent surveys. CPR organisms often have self-splicing introns and proteins encoded within their rRNA genes, a feature rarely reported in bacteria. Furthermore, they have unusual ribosome compositions. All are missing a ribosomal protein often absent in symbionts, and specific lineages are missing ribosomal proteins and biogenesis factors considered universal in bacteria. This implies different ribosome structures and biogenesis mechanisms, and underlines unusual biology across a large part of the bacterial domain.",
                "authors": [
                    {
                        "name": "Banfield J.F."
                    },
                    {
                        "name": "Brown C.T."
                    },
                    {
                        "name": "Castelle C.J."
                    },
                    {
                        "name": "Hug L.A."
                    },
                    {
                        "name": "Sharon I."
                    },
                    {
                        "name": "Singh A."
                    },
                    {
                        "name": "Thomas B.C."
                    },
                    {
                        "name": "Wilkins M.J."
                    },
                    {
                        "name": "Williams K.H."
                    },
                    {
                        "name": "Wrighton K.C."
                    }
                ],
                "citationCount": 774,
                "date": "2015-07-09T00:00:00Z",
                "journal": "Nature",
                "title": "Unusual biology across a group comprising more than 15% of domain Bacteria"
            },
            "pmid": "26083755",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}
