{
    "additionDate": "2018-05-29T10:11:24Z",
    "biotoolsCURIE": "biotools:synteny_portal",
    "biotoolsID": "synteny_portal",
    "credit": [
        {
            "email": "bioinfolabkr@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Portal for synteny block analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.konkuk.ac.kr/synteny_portal/htdocs/documentation.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.konkuk.ac.kr/synteny_portal/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "Synteny Portal",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKW310",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Recent advances in next-generation sequencing technologies and genome assembly algorithms have enabled the accumulation of a huge volume of genome sequences from various species. This has provided new opportunities for large-scale comparative genomics studies. Identifying and utilizing synteny blocks, which are genomic regions conserved among multiple species, is key to understanding genomic architecture and the evolutionary history of genomes. However, the construction and visualization of such synteny blocks from multiple species are very challenging, especially for biologists with a lack of computational skills. Here, we present Synteny Portal, a versatile web-based application portal for constructing, visualizing and browsing synteny blocks. With Synteny Portal, users can easily (i) construct synteny blocks among multiple species by using prebuilt alignments in the UCSC genome browser database, (ii) visualize and download syntenic relationships as high-quality images, (iii) browse synteny blocks with genetic information and (iv) download the details of synteny blocks to be used as input for downstream synteny-based analyses, all in an intuitive and easy-to-use web-based interface. We believe that Synteny Portal will serve as a highly valuable tool that will enable biologists to easily perform comparative genomics studies by compensating limitations of existing tools. Synteny Portal is freely available at http://bioinfo.konkuk.ac.kr/synteny_portal.",
                "authors": [
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Hong W.-Y."
                    },
                    {
                        "name": "Cho M."
                    },
                    {
                        "name": "Sim M."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Ko Y."
                    },
                    {
                        "name": "Kim J."
                    }
                ],
                "citationCount": 19,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Synteny Portal: a web-based application portal for synteny block analysis"
            },
            "pmcid": "PMC4987893",
            "pmid": "27154270"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}