{
    "additionDate": "2021-01-18T08:10:50Z",
    "biotoolsCURIE": "biotools:canrisk",
    "biotoolsID": "canrisk",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "saa71@medschl.cam.ac.uk",
            "name": "Stephanie Archer",
            "orcidid": "https://orcid.org/0000-0003-1349-7178",
            "typeEntity": "Person"
        }
    ],
    "description": "The CanRisk tool is a web interface to BOADICEA, the Breast and Ovarian Analysis of Disease Incidence and Carrier Estimation Algorithm, risk prediction model used to calculate future breast and ovarian cancer risks in women. This is the first comprehensive model that allows for reliable breast cancer risk prediction in unaffected women on the basis of mutation screening information for rare (high risk and moderate risk) breast cancer genetic susceptibility variants, common cancer genetic susceptibility variants (using polygenic risk scores), explicit family history, personal lifestyle, hormonal and reproductive risk factors, and mammographic density.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "http://CanRisk.org",
    "lastUpdate": "2021-02-07T13:03:16Z",
    "name": "CanRisk",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0229999",
            "metadata": {
                "abstract": "© 2020 Archer et al.Background: There is a growing focus on the development of multi-factorial cancer risk prediction algorithms alongside tools that operationalise them for clinical use. BOADICEA is a breast and ovarian cancer risk prediction model incorporating genetic and other risk factors. A new user-friendly Web-based tool (CanRisk.org) has been developed to apply BOADICEA. This study aimed to explore the acceptability of the prototype CanRisk tool among two healthcare professional groups to inform further development, evaluation and implementation. Method: A multi-methods approach was used. Clinicians from primary care and specialist genetics clinics in England, France and Germany were invited to use the CanRisk prototype with two test cases (either face-to-face with a simulated patient or via a written vignette). Their views about the tool were examined via a semi-structured interview or equivalent open-ended questionnaire. Qualitative data were subjected to thematic analysis and organised around Sekhon's Theoretical Framework of Acceptability. Results: Seventy-five clinicians participated, 21 from primary care and 54 from specialist genetics clinics. Participants were from England (n = 37), France (n = 23) and Germany (n = 15). The prototype CanRisk tool was generally acceptable to most participants due to its intuitive design. Primary care clinicians were concerned about the amount of time needed to complete, interpret and communicate risk information. Clinicians from both settings were apprehensive about the impact of the CanRisk tool on their consultations and lack of opportunities to interpret risk scores before sharing them with their patients. Conclusions: The findings highlight the challenges associated with developing a complex tool for use in different clinical settings; they also helped refine the tool. This prototype may not have been versatile enough for clinical use in both primary care and specialist genetics clinics where the needs of clinicians are different, emphasising the importance of understanding the clinical context when developing cancer risk assessment tools.",
                "authors": [
                    {
                        "name": "Archer S."
                    },
                    {
                        "name": "De Villiers C.B."
                    },
                    {
                        "name": "Scheibl F."
                    },
                    {
                        "name": "Carver T."
                    },
                    {
                        "name": "Hartley S."
                    },
                    {
                        "name": "Lee A."
                    },
                    {
                        "name": "Cunningham A.P."
                    },
                    {
                        "name": "Easton D.F."
                    },
                    {
                        "name": "McIntosh J.G."
                    },
                    {
                        "name": "Emery J."
                    },
                    {
                        "name": "Tischkowitz M."
                    },
                    {
                        "name": "Antoniou A.C."
                    },
                    {
                        "name": "Walter F.M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Evaluating clinician acceptability of the prototype CanRisk tool for predicting risk of breast and ovarian cancer: A multi-methods study"
            },
            "pmcid": "PMC7059924",
            "pmid": "32142536"
        },
        {
            "doi": "10.1158/1055-9965.EPI-20-1319",
            "metadata": {
                "abstract": "©2020 American Association for Cancer Research.Background: The CanRisk Tool (https://canrisk.org) is the next-generation web interface for the latest version of the BOADICEA (Breast and Ovarian Analysis of Disease Incidence and Carrier Estimation Algorithm) state-of-the-art risk model and a forthcoming ovarian cancer risk model. Methods: The tool captures information on family history, rare pathogenic variants in cancer susceptibility genes, polygenic risk scores, lifestyle/hormonal/clinical features, and imaging risk factors to predict breast and ovarian cancer risks and estimate the probabilities of carrying pathogenic variants in certain genes. It was implemented using modern web frameworks, technologies, and web services to make it extensible and increase accessibility to researchers and third-party applications. The design of the graphical user interface was informed by feedback from health care professionals and a formal evaluation. Results: This freely accessible tool was designed to be user friendly for clinicians and to boost acceptability in clinical settings. The tool incorporates a novel graphical pedigree builder to facilitate collection of the family history data required by risk calculations. Conclusions: The CanRisk Tool provides health care professionals and researchers with a user-friendly interface to carry out multifactorial breast and ovarian cancer risk predictions. It is the first freely accessible cancer risk prediction program to carry the CE marking. Impact: There have been over 3,100 account registrations, and 98,000 breast and ovarian cancer risk calculations have been run within the first 9 months of the CanRisk Tool launch.",
                "authors": [
                    {
                        "name": "Carver T."
                    },
                    {
                        "name": "Hartley S."
                    },
                    {
                        "name": "Lee A."
                    },
                    {
                        "name": "Cunningham A.P."
                    },
                    {
                        "name": "Archer S."
                    },
                    {
                        "name": "de Villiers C.B."
                    },
                    {
                        "name": "Roberts J."
                    },
                    {
                        "name": "Ruston R."
                    },
                    {
                        "name": "Walter F.M."
                    },
                    {
                        "name": "Tischkowitz M."
                    },
                    {
                        "name": "Easton D.F."
                    },
                    {
                        "name": "Antoniou A.C."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Cancer Epidemiology Biomarkers and Prevention",
                "title": "Canrisk tool—A web interface for the prediction of breast and ovarian cancer risk and the likelihood of carrying genetic pathogenic variants"
            },
            "pmid": "33335023"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}