{
    "additionDate": "2020-01-14T09:01:36Z",
    "biotoolsCURIE": "biotools:DeePathology",
    "biotoolsID": "DeePathology",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asharifi@sharif.edu",
            "name": "Ali Sharifi-Zarchi",
            "orcidid": "https://orcid.org/0000-0002-0087-7596",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep Multi-Task Learning for Inferring Molecular Pathology from Cancer Transcriptome.\n\nTissue and Cancer Type Identification using Deep Neural Networks.\n\nAuthors: Behrooz Azarkhalili, Ali Saberi, Hamidreza Chitsaz, Ali Sharifi-Zarchi",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SharifBioinf/DeePathology",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-17T15:16:35Z",
    "name": "DeePathology",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-52937-5",
            "metadata": {
                "abstract": "© 2019, The Author(s).Despite great advances, molecular cancer pathology is often limited to the use of a small number of biomarkers rather than the whole transcriptome, partly due to computational challenges. Here, we introduce a novel architecture of Deep Neural Networks (DNNs) that is capable of simultaneous inference of various properties of biological samples, through multi-task and transfer learning. It encodes the whole transcription profile into a strikingly low-dimensional latent vector of size 8, and then recovers mRNA and miRNA expression profiles, tissue and disease type from this vector. This latent space is significantly better than the original gene expression profiles for discriminating samples based on their tissue and disease. We employed this architecture on mRNA transcription profiles of 10750 clinical samples from 34 classes (one healthy and 33 different types of cancer) from 27 tissues. Our method significantly outperforms prior works and classical machine learning approaches in predicting tissue-of-origin, normal or disease state and cancer type of each sample. For tissues with more than one type of cancer, it reaches 99.4% accuracy in identifying the correct cancer subtype. We also show this system is very robust against noise and missing values. Collectively, our results highlight applications of artificial intelligence in molecular cancer pathology and oncological research. DeePathology is freely available at https://github.com/SharifBioinf/DeePathology.",
                "authors": [
                    {
                        "name": "Azarkhalili B."
                    },
                    {
                        "name": "Chitsaz H."
                    },
                    {
                        "name": "Saberi A."
                    },
                    {
                        "name": "Sharifi-Zarchi A."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "DeePathology: Deep Multi-Task Learning for Inferring Molecular Pathology from Cancer Transcriptome"
            },
            "pmcid": "PMC6848155",
            "pmid": "31712594"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
