{
    "additionDate": "2021-01-18T08:04:37Z",
    "biotoolsCURIE": "biotools:d-seams",
    "biotoolsID": "d-seams",
    "confidence_flag": "tool",
    "description": "d-SEAMS is a collection of analysis tools for molecular simulations. It has been implemented as a High Performance Cluster enabled engine in C++, with extensions via the Lua scripting interface. The code sheds light on the structures from simulation trajectories, in terms of their topology and it has been tailored for the analysis of nucleating systems. The framework is meant to be interfaced to a large variety of external tools and software, including R and other libraries. It is also the first and at-present only scientific analysis tool to use reproducible builds via nix.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://dseams.info",
    "lastUpdate": "2021-02-22T14:22:39Z",
    "name": "d-SEAMS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00031",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Structural analyses are an integral part of computational research on nucleation and supercooled water, whose accuracy and efficiency can impact the validity and feasibility of such studies. The underlying molecular mechanisms of these often elusive and computationally expensive processes can be inferred from the evolution of ice-like structures, determined using appropriate structural analysis techniques. We present d-SEAMS, a free and open-source postprocessing engine for the analysis of molecular dynamics trajectories, which is specifically able to qualitatively classify ice structures in both strong-confinement and bulk systems. For the first time, recent algorithms for confined ice structure determination have been implemented, along with topological network criteria for bulk ice structure determination. We also propose and validate a new order parameter for identifying the building blocks of quasi-one-dimensional ice. Recognizing the need for customization in structural analysis, d-SEAMS has a unique code architecture built with nix and employing a YAML-Lua scripting pipeline. The software has been designed to be user-friendly and extensible. The engine outputs are compatible with popular graphics software suites, allowing for immediate visual insights into the systems studied. We demonstrate the features of d-SEAMS by using it to analyze nucleation in the bulk regime and for quasi-one- and quasi-two-dimensional systems. Structural time evolution and quantitative metrics are determined for heterogeneous ice nucleation on a silver-exposed β-AgI surface, homogeneous ice nucleation, flat monolayer square ice formation, and freezing of an ice nanotube.",
                "authors": [
                    {
                        "name": "Goswami A."
                    },
                    {
                        "name": "Goswami R."
                    },
                    {
                        "name": "Singh J.K."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "d-SEAMS: Deferred Structural Elucidation Analysis for Molecular Simulations"
            },
            "pmid": "32196327"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ]
}
