{
    "additionDate": "2022-11-02T07:46:27.338037Z",
    "biotoolsCURIE": "biotools:dhdip",
    "biotoolsID": "dhdip",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Bin Liao"
        },
        {
            "name": "Ruina Sun"
        }
    ],
    "description": "An interpretable model for hypertension and hyperlipidemia prediction based on EMR data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Xiaoyao-Jia/DHDIP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-11-02T07:46:27.340563Z",
    "license": "Not licensed",
    "name": "DHDIP",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2022.107088",
            "metadata": {
                "abstract": "© 2022 Elsevier B.V.Background and objective: Traditional hypertension and hyperlipidemia prediction models suffer from uneven modeling data sources, small sample sizes, and a lack of uniform standards for the index system, resulting in the model failing to fulfill clinical applications. To address this issue, this work will offer DHDIP, an interpretable hypertension and hyperlipidemia prediction model based on EMR data. Methods: First, we will select massive high-dimensional, unstructured EMR data as a unified modeling data source, and propose a pre-processing algorithm for EMR data to solve the problem that EMR data cannot be directly processed by machine learning algorithms. Second, a variety of mainstream models such as XGBoost, CatBoost, and RandomForest are selected for modeling, and the best adaptation algorithms are identified by performance comparison. Finally, the SHAP framework was introduced into the DHDIP model, thus identifying the main factors contributing to hypertension and hyperlipidemia, effectively enhancing the interpretability of the model. Results: The DHDIP model's MSE value is 0.0285, and its LOSS value is 0.0054, both of which are better than previous studies. Conclusion: The model balances performance and interpretability. Multi-objective learning allows for a more thorough analysis and prediction of the condition, which not only lowers the cost of disease prediction but also aids physicians in clinical diagnosis. In addition, the datasets and source code are available from this link: https://github.com/Xiaoyao-Jia/DHDIP",
                "authors": [
                    {
                        "name": "Jia X."
                    },
                    {
                        "name": "Liao B."
                    },
                    {
                        "name": "Sun R."
                    },
                    {
                        "name": "Zhang T."
                    }
                ],
                "date": "2022-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "DHDIP: An interpretable model for hypertension and hyperlipidemia prediction based on EMR data"
            },
            "pmid": "36096022"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
