{
    "additionDate": "2020-01-09T18:04:43Z",
    "biotoolsCURIE": "biotools:ErrorTracer",
    "biotoolsID": "ErrorTracer",
    "confidence_flag": "tool",
    "description": "ModelExplorer is a metabolic model visualization package that can assist the user in finding blocked parts of the metabolic network as well as finding out why they are blocked.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TheAngryFox/ModelExplorer",
    "lastUpdate": "2021-01-14T19:19:17Z",
    "name": "ErrorTracer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ761",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: The number and complexity of genome-scale metabolic models is steadily increasing, empowered by automated model-generation algorithms. The quality control of the models, however, has always remained a significant challenge, the most fundamental being reactions incapable of carrying flux. Numerous automated gap-filling algorithms try to address this problem, but can rarely resolve all of a model's inconsistencies. The need for fast inconsistency checking algorithms has also been emphasized with the recent community push for automated model-validation before model publication. Previously, we wrote a graphical software to allow the modeller to solve the remaining errors manually. Nevertheless, model size and complexity remained a hindrance to efficiently tracking origins of inconsistency. Results: We developed the ErrorTracer algorithm in order to address the shortcomings of existing approaches: ErrorTracer searches for inconsistencies, classifies them and identifies their origins. The algorithm is ∼2 orders of magnitude faster than current community standard methods, using only seconds even for large-scale models. This allows for interactive exploration in direct combination with model visualization, markedly simplifying the whole error-identification and correction work flow.",
                "authors": [
                    {
                        "name": "Almaas E."
                    },
                    {
                        "name": "Martyushenko N."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ErrorTracer: An algorithm for identifying the origins of inconsistencies in genome-scale metabolic models"
            },
            "pmid": "31598631"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
