{
    "additionDate": "2021-01-18T10:09:41Z",
    "biotoolsCURIE": "biotools:prgefne",
    "biotoolsID": "prgefne",
    "confidence_flag": "tool",
    "description": "Predicting disease-related genes by fast network embedding.\n\nDescription: Identifying disease-related genes is of importance for understanding of molecule mechanisms of diseases, as well as diagnosis and treatment of diseases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.csu.edu.cn/prgefne/",
    "lastUpdate": "2021-01-27T16:54:52Z",
    "name": "PrGeFNE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2020.06.015",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.Identifying disease-related genes is of importance for understanding of molecule mechanisms of diseases, as well as diagnosis and treatment of diseases. Many computational methods have been proposed to predict disease-related genes, but how to make full use of multi-source biological data to enhance the ability of disease-gene prediction is still challenging. In this paper, we proposed a novel method for predicting disease-related genes by using fast network embedding (PrGeFNE), which can integrate multiple types of associations related to diseases and genes. Specifically, we first constructed a heterogeneous network by using phenotype-disease, disease-gene, protein-protein and gene-GO associations; and low-dimensional representation of nodes is extracted from the network by using a fast network embedding algorithm. Then, a dual-layer heterogeneous network was reconstructed by using the low-dimensional representation, and a network propagation was applied to the dual-layer heterogeneous network to predict disease-related genes. Through cross-validation and newly added-association validation, we displayed the important roles of different types of association data in enhancing the ability of disease-gene prediction, and confirmed the excellent performance of PrGeFNE by comparing to state-of-the-art algorithms. Furthermore, we developed a web tool that can facilitate researchers to search for candidate genes of different diseases predicted by PrGeFNE, along with the enrichment analysis of GO and pathway on candidate gene set. This may be useful for investigation of diseases’ molecular mechanisms as well as their experimental validations. The web tool is available at http://bioinformatics.csu.edu.cn/prgefne/.",
                "authors": [
                    {
                        "name": "Xiang J."
                    },
                    {
                        "name": "Zhang N.-R."
                    },
                    {
                        "name": "Zhang J.-S."
                    },
                    {
                        "name": "Lv X.-Y."
                    },
                    {
                        "name": "Li M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods",
                "title": "PrGeFNE: Predicting disease-related genes by fast network embedding"
            },
            "pmid": "32610158"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}