{
    "additionDate": "2017-08-03T18:58:21Z",
    "biotoolsCURIE": "biotools:rxa",
    "biotoolsID": "rxa",
    "credit": [
        {
            "email": "daniel.naiman@jhu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ams.jhu.edu/~dan/"
        }
    ],
    "description": "An R Package for Relative expression analysis of gene expession profiles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.ams.jhu.edu/~dan/rxa/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://jshare.johnshopkins.edu/dnaiman1/public_html/rxa/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rxa-20100914-relative-expression-analysis-gene-expession-profiles.html"
        }
    ],
    "name": "RXA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: A major challenge in computational biology is to extract knowledge about the genetic nature of disease from high-throughput data. However, an important obstacle to both biological understanding and clinical applications is the \"black box\" nature of the decision rules provided by most machine learning approaches, which usually involve many genes combined in a highly complex fashion. Achieving biologically relevant results argues for a different strategy. A promising alternative is to base prediction entirely upon the relative expression ordering of a small number of genes. Results: We present a three-gene version of \"relative expression analysis\" (RXA), a rigorous and systematic comparison with earlier approaches in a variety of cancer studies, a clinically relevant application to predicting germline BRCA1 mutations in breast cancer and a cross-study validation for predicting ER status. In the BRCA1 study, RXA yields high accuracy with a simple decision rule: in tumors carrying mutations, the expression of a \"reference gene\" falls between the expression of two differentially expressed genes, PPP1CB and RNF14. An analysis of the protein-protein interactions among the triplet of genes and BRCA1 suggests that the classifier has a biological foundation. Conclusion: RXA has the potential to identify genomic \"marker interactions\" with plausible biological interpretation and direct clinical applicability. It provides a general framework for understanding the roles of the genes involved in decision rules, as illustrated for the difficult and clinically relevant problem of identifying BRCA1 mutation carriers. © 2009 Lin et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Afsari B."
                    },
                    {
                        "name": "Marchionni L."
                    },
                    {
                        "name": "Cope L."
                    },
                    {
                        "name": "Parmigiani G."
                    },
                    {
                        "name": "Naiman D."
                    },
                    {
                        "name": "Geman D."
                    }
                ],
                "citationCount": 27,
                "date": "2009-08-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The ordering of expression among a few genes can provide simple cancer biomarkers and signal BRCA1 mutations"
            },
            "pmid": "19695104"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}