{
    "additionDate": "2018-10-14T21:32:57Z",
    "biotoolsCURIE": "biotools:guidock",
    "biotoolsID": "guidock",
    "credit": [
        {
            "email": "kayee@uw.edu",
            "name": "Ka Yee Yeung",
            "orcidid": "http://orcid.org/0000-0002-1754-7577",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GUIdock allows for the facile distribution of a systems biology application along with its graphics environment.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/WebDataScience/GUIdock/blob/master/GUIdockManual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WebDataScience/GUIdock",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2019-01-13T01:02:39Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/WebDataScience/GUIdock/issues"
        }
    ],
    "name": "GUIdock",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0152686",
            "metadata": {
                "abstract": "© 2016 Hung et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Reproducibility is vital in science. For complex computational methods, it is often necessary, not just to recreate the code, but also the software and hardware environment to reproduce results. Virtual machines, and container software such as Docker, make it possible to reproduce the exact environment regardless of the underlying hardware and operating system. However, workflows that use Graphical User Interfaces (GUIs) remain difficult to replicate on different host systems as there is no high level graphical software layer common to all platforms. GUIdock allows for the facile distribution of a systems biology application along with its graphics environment. Complex graphics based workflows, ubiquitous in systems biology, can now be easily exported and reproduced on many different platforms. GUIdock uses Docker, an open source project that provides a container with only the absolutely necessary software dependencies and configures a common X Windows (X11) graphic interface on Linux, Macintosh and Windows platforms. As proof of concept, we present a Docker package that contains a Bioconductor application written in R and C++ called networkBMA for gene network inference. Our package also includes Cytoscape, a Java-based platform with a graphical user interface for visualizing and analyzing gene networks, and the CyNetworkBMA app, a Cytoscape app that allows the use of networkBMA via the user-friendly Cytoscape interface.",
                "authors": [
                    {
                        "name": "Hung L.-H."
                    },
                    {
                        "name": "Kristiyanto D."
                    },
                    {
                        "name": "Lee S.B."
                    },
                    {
                        "name": "Yeung K.Y."
                    }
                ],
                "citationCount": 23,
                "date": "2016-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GUIdock: Using Docker containers with a common graphics user interface to address the reproducibility of research"
            },
            "pmcid": "PMC4821530",
            "pmid": "27045593",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
