{
    "additionDate": "2021-01-18T08:49:42Z",
    "biotoolsCURIE": "biotools:cpssm",
    "biotoolsID": "cpssm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "foroughmand@sharif.ir",
            "name": "Mohammad-Hadi Foroughmand-Araabi",
            "typeEntity": "Person"
        }
    ],
    "description": "Consecutive Positions Scoring Matrix (CPSSM) is a pattern matching algorithm for genomic patterns related to protein motifs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://app.foroughmand.ir/cpssm/",
    "lastUpdate": "2021-03-11T15:06:28Z",
    "name": "CPSSM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1142/S0219720020500110",
            "metadata": {
                "abstract": "© 2020 World Scientific Publishing Europe Ltd.Patterns on proteins and genomic sequences are vastly analyzed, extracted and collected in databases. Although protein patterns originate from genomic coding regions, very few works have directly or indirectly dealt with coding region patterns induced from protein patterns. Results: In this paper, we have defined a new genomic pattern structure suitable for representing induced patterns from proteins. The provided pattern structure, which is called \"Consecutive Positions Scoring Matrix (CPSSM)\", is a replacement for protein patterns and profiles in the genomic context. CPSSMs can be identified, discovered, and searched in genomes. Then, we have presented a novel pattern matching algorithm between the defined genomic pattern and genomic sequences based on dynamic programming. In addition, we have modified the provided algorithm to support intronic gaps and huge sequences. We have implemented and tested the provided algorithm on real data. The results on Saccharomyces cerevisiae's genome show 132% more true positives and no false negatives and the results on human genome show no false negatives and 10 times as many true positives as those in previous works. Conclusion: CPSSM and provided methods could be used for open reading frame detection and gene finding. The application is available with source codes to run and download at http://app.foroughmand.ir/cpssm/.",
                "authors": [
                    {
                        "name": "Foroughmand-Araabi M.-H."
                    },
                    {
                        "name": "Goliaei B."
                    },
                    {
                        "name": "Goliaei S."
                    }
                ],
                "date": "2020-02-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "A novel pattern matching algorithm for genomic patterns related to protein motifs"
            },
            "pmid": "32336249"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
