{
    "additionDate": "2021-01-18T10:10:00Z",
    "biotoolsCURIE": "biotools:opengraphgym",
    "biotoolsID": "opengraphgym",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wangd@ornl.gov",
            "name": "Dali Wang",
            "orcidid": "https://orcid.org/0000-0001-6806-5108",
            "typeEntity": "Person"
        }
    ],
    "description": "A Parallel Reinforcement Learning Framework for Graph Optimization Problems.\n\nThis is the code published for the paper \"OpenGraphGym: A Parallel Reinforcement Learning Framework for Graph OptimizationProblems\" in ICCS 2020.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/zwj3652011/OpenGraphGym.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-15T09:21:12Z",
    "license": "MIT",
    "name": "OpenGraphGym",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/978-3-030-50426-7_33",
            "metadata": {
                "abstract": "© 2020, This is a U.S. government work and not under copyright protection in the U.S.; foreign copyright protection may apply.This paper presents an open-source, parallel AI environment (named OpenGraphGym) to facilitate the application of reinforcement learning (RL) algorithms to address combinatorial graph optimization problems. This environment incorporates a basic deep reinforcement learning method, and several graph embeddings to capture graph features, it also allows users to rapidly plug in and test new RL algorithms and graph embeddings for graph optimization problems. This new open-source RL framework is targeted at achieving both high performance and high quality of the computed graph solutions. This RL framework forms the foundation of several ongoing research directions, including 1) benchmark works on different RL algorithms and embedding methods for classic graph problems; 2) advanced parallel strategies for extreme-scale graph computations, as well as 3) performance evaluation on real-world graph solutions.",
                "authors": [
                    {
                        "name": "Song F."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Zheng W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "OpenGraphGym: A parallel reinforcement learning framework for graph optimization problems"
            },
            "pmcid": "PMC7302566"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
