{
    "additionDate": "2020-01-14T20:13:28Z",
    "biotoolsCURIE": "biotools:optimia",
    "biotoolsID": "optimia",
    "confidence_flag": "tool",
    "description": "An R package for innovative Bayesian adaptive commensurate designs that borrows adaptively from historical information and also uses a payoff function to optimize the timing of the study’s interim analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wxwx1993/Bayesian_IA_Timing",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-01-14T16:30:39Z",
    "name": "optimIA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/SIM.8414",
            "metadata": {
                "abstract": "© 2019 John Wiley & Sons, Ltd.In developing products for rare diseases, statistical challenges arise due to the limited number of patients available for participation in drug trials and other clinical research. Bayesian adaptive clinical trial designs offer the possibility of increased statistical efficiency, reduced development cost and ethical hazard prevention via their incorporation of evidence from external sources (historical data, expert opinions, and real-world evidence), and flexibility in the specification of interim looks. In this paper, we propose a novel Bayesian adaptive commensurate design that borrows adaptively from historical information and also uses a particular payoff function to optimize the timing of the study's interim analysis. The trial payoff is a function of how many samples can be saved via early stopping and the probability of making correct early decisions for either futility or efficacy. We calibrate our Bayesian algorithm to have acceptable long-run frequentist properties (Type I error and power) via simulation at the design stage. We illustrate our approach using a pediatric trial design setting testing the effect of a new drug for a rare genetic disease. The optimIA R package available at https://github.com/wxwx1993/Bayesian_IA_Timing provides an easy-to-use implementation of our approach.",
                "authors": [
                    {
                        "name": "Carlin B.P."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "date": "2020-02-20T00:00:00Z",
                "journal": "Statistics in Medicine",
                "title": "Optimizing interim analysis timing for Bayesian adaptive commensurate designs"
            },
            "pmid": "31799737"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
