{
    "accessibility": "Open access",
    "additionDate": "2022-05-24T19:56:49.820756Z",
    "biotoolsCURIE": "biotools:itrex",
    "biotoolsID": "itrex",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Matthias Schlesner"
        },
        {
            "name": "Olaf Witt"
        },
        {
            "name": "Sina Oppermann"
        }
    ],
    "description": "Interactive exploration of mono- and combination therapy dose response profiling data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://itrex.kitz-heidelberg.de",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-05-24T19:56:49.824116Z",
    "license": "Not licensed",
    "name": "iTReX",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.PHRS.2021.105996",
            "metadata": {
                "abstract": "© 2021 The AuthorsHigh throughput screening methods, measuring the sensitivity and resistance of tumor cells to drug treatments have been rapidly evolving. Not only do these screens allow correlating response profiles to tumor genomic features for developing novel predictors of treatment response, but they can also add evidence for therapy decision making in precision oncology. Recent analysis methods developed for either assessing single agents or combination drug efficacies enable quantification of dose-response curves with restricted symmetric fit settings. Here, we introduce iTReX, a user-friendly and interactive Shiny/R application, for both the analysis of mono- and combination therapy responses. The application features an extended version of the drug sensitivity score (DSS) based on the integral of an advanced five-parameter dose-response curve model and a differential DSS for combination therapy profiling. Additionally, iTReX includes modules that visualize drug target interaction networks and support the detection of matches between top therapy hits and the sample omics features to enable the identification of druggable targets and biomarkers. iTReX enables the analysis of various quantitative drug or therapy response readouts (e.g. luminescence, fluorescence microscopy) and multiple treatment strategies (drug treatments, radiation). Using iTReX we validate a cost-effective drug combination screening approach and reveal the application's ability to identify potential sample-specific biomarkers based on drug target interaction networks. The iTReX web application is accessible at https://itrex.kitz-heidelberg.de",
                "authors": [
                    {
                        "name": "Berker Y."
                    },
                    {
                        "name": "ElHarouni D."
                    },
                    {
                        "name": "Gopisetty A."
                    },
                    {
                        "name": "Jager N."
                    },
                    {
                        "name": "Kreth S."
                    },
                    {
                        "name": "Oehme I."
                    },
                    {
                        "name": "Oppermann S."
                    },
                    {
                        "name": "Peterziel H."
                    },
                    {
                        "name": "Pietiainen V."
                    },
                    {
                        "name": "Schlesner M."
                    },
                    {
                        "name": "Stainczyk S.A."
                    },
                    {
                        "name": "Turunen L."
                    },
                    {
                        "name": "Witt O."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Pharmacological Research",
                "title": "iTReX: Interactive exploration of mono- and combination therapy dose response profiling data"
            },
            "pmid": "34848323"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
