{
    "accessibility": "Restricted access",
    "additionDate": "2021-01-18T08:46:29Z",
    "biotoolsCURIE": "biotools:pub2tools2020__genodraw",
    "biotoolsID": "pub2tools2020__genodraw",
    "confidence_flag": "tool",
    "description": "A Web Tool for Developing Pedigree Diagrams Using the Standardized Human Pedigree Nomenclature Integrated with Biomedical Vocabularies.\n\nThe integration of genetic information in current clinical routine has raised a need for tools to exploit family genetic knowledge. On the clinical side, an application for managing and visualizing pedigree diagrams could provide genetics specialists with an integrated environment with potential positive impact on their current practice.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://genodraw.com/authentication/login",
    "lastUpdate": "2021-01-22T19:29:10Z",
    "name": "genoDraw",
    "owner": "Niclaskn",
    "publication": [
        {
            "metadata": {
                "abstract": "©2019 AMIA - All rights reserved.The integration of genetic information in current clinical routine has raised a need for tools to exploit family genetic knowledge. On the clinical side, an application for managing and visualizing pedigree diagrams could provide genetics specialists with an integrated environment with potential positive impact on their current practice. This article presents a web tool (genoDraw) that provides clinical practitioners with the ability to create, maintain and visualize patients' and their families' information in the form of pedigree diagrams. genoDraw implements a graph-based three-step process for generating diagrams according to a de facto standard in the area and clinical terminologies. It also complies with five characteristics identified as indispensable for the next-generation of pedigree drawing software: comprehensiveness, data-drivenness, automation, interactivity and compatibility with biomedical vocabularies. The platform was implemented and tested, confirming its potential interest to clinical routine.",
                "authors": [
                    {
                        "name": "Alonso-Calvo R."
                    },
                    {
                        "name": "Fernandez-Martinez F.J."
                    },
                    {
                        "name": "Garcia-Giordano L."
                    },
                    {
                        "name": "Maojo V."
                    },
                    {
                        "name": "Paraiso-Medina S."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "AMIA ... Annual Symposium proceedings. AMIA Symposium",
                "title": "genoDraw: A Web Tool for Developing Pedigree Diagrams Using the Standardized Human Pedigree Nomenclature Integrated with Biomedical Vocabularies"
            },
            "pmcid": "PMC7153108",
            "pmid": "32308839"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
