{
    "accessibility": "Open access",
    "additionDate": "2021-12-04T23:27:03.419122Z",
    "biotoolsCURIE": "biotools:mecor",
    "biotoolsID": "mecor",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "l.nab@lumc.nl",
            "name": "Linda Nab",
            "orcidid": "https://orcid.org/0000-0002-1821-7246"
        },
        {
            "name": "Maarten van Smeden"
        },
        {
            "name": "Ruth H. Keogh"
        },
        {
            "name": "Rolf H.H. Groenwold"
        }
    ],
    "description": "An R package for measurement error correction in linear regression models with a continuous outcome.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/LindaNab/mecor/releases/tag/v0.9.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LindaNab/mecor",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-04T23:27:03.422477Z",
    "license": "Not licensed",
    "name": "mecor",
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2021.106238",
            "metadata": {
                "abstract": "© 2021 The AuthorsMeasurement error in a covariate or the outcome of regression models is common, but is often ignored, even though measurement error can lead to substantial bias in the estimated covariate-outcome association. While several texts on measurement error correction methods are available, these methods remain seldomly applied. To improve the use of measurement error correction methodology, we developed mecor, an R package that implements measurement error correction methods for regression models with a continuous outcome. Measurement error correction requires information about the measurement error model and its parameters. This information can be obtained from four types of studies, used to estimate the parameters of the measurement error model: an internal validation study, a replicates study, a calibration study and an external validation study. In the package mecor, regression calibration methods and a maximum likelihood method are implemented to correct for measurement error in a continuous covariate in regression analyses. Additionally, methods of moments methods are implemented to correct for measurement error in the continuous outcome in regression analyses. Variance estimation of the corrected estimators is provided in closed form and using the bootstrap.",
                "authors": [
                    {
                        "name": "Nab L."
                    },
                    {
                        "name": "van Smeden M."
                    },
                    {
                        "name": "Keogh R.H."
                    },
                    {
                        "name": "Groenwold R.H.H."
                    }
                ],
                "citationCount": 2,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "Mecor: An R package for measurement error correction in linear regression models with a continuous outcome"
            },
            "pmid": "34311414"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ]
}