{
    "accessibility": "Open access",
    "additionDate": "2022-07-17T11:20:21.565195Z",
    "biotoolsCURIE": "biotools:bmc_caller",
    "biotoolsID": "bmc_caller",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ckerfeld@lbl.gov",
            "name": "Cheryl A. Kerfeld",
            "orcidid": "https://orcid.org/0000-0002-9977-8482",
            "typeEntity": "Person"
        }
    ],
    "description": "A webtool to identify and analyze bacterial microcompartment types in sequence data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://bmc-caller.prl.msu.edu",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-17T11:20:21.568228Z",
    "license": "Not licensed",
    "name": "BMC Caller",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S13062-022-00323-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Bacterial microcompartments (BMCs) are protein-based organelles found across the bacterial tree of life. They consist of a shell, made of proteins that oligomerize into hexagonally and pentagonally shaped building blocks, that surrounds enzymes constituting a segment of a metabolic pathway. The proteins of the shell are unique to BMCs. They also provide selective permeability; this selectivity is dictated by the requirements of their cargo enzymes. We have recently surveyed the wealth of different BMC types and their occurrence in all available genome sequence data by analyzing and categorizing their components found in chromosomal loci using HMM (Hidden Markov Model) protein profiles. To make this a “do-it yourself” analysis for the public we have devised a webserver, BMC Caller (https://bmc-caller.prl.msu.edu), that compares user input sequences to our HMM profiles, creates a BMC locus visualization, and defines the functional type of BMC, if known. Shell proteins in the input sequence data are also classified according to our function-agnostic naming system and there are links to similar proteins in our database as well as an external link to a structure prediction website to easily generate structural models of the shell proteins, which facilitates understanding permeability properties of the shell. Additionally, the BMC Caller website contains a wealth of information on previously analyzed BMC loci with links to detailed data for each BMC protein and phylogenetic information on the BMC shell proteins. Our tools greatly facilitate BMC type identification to provide the user information about the associated organism’s metabolism and enable discovery of new BMC types by providing a reference database of all currently known examples.",
                "authors": [
                    {
                        "name": "Kerfeld C.A."
                    },
                    {
                        "name": "Sutter M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Biology Direct",
                "title": "BMC Caller: a webtool to identify and analyze bacterial microcompartment types in sequence data"
            },
            "pmcid": "PMC9052549",
            "pmid": "35484563"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cladistics",
            "uri": "http://edamontology.org/topic_3944"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
