{"collectionID": [], "accessibility": [], "topic": [{"term": "Microarray experiment", "uri": "http://edamontology.org/topic_3518"}, {"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}], "owner": "migle_sur", "cost": null, "relation": [], "download": [], "validated": 0, "publication": [{"doi": "10.1371/journal.pcbi.1006042", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "The Pathway Coexpression Network: Revealing pathway relationships", "abstract": "© 2018 Pita-Juárez et al.A goal of genomics is to understand the relationships between biological processes. Pathways contribute to functional interplay within biological processes through complex but poorly understood interactions. However, limited functional references for global pathway relationships exist. Pathways from databases such as KEGG and Reactome provide discrete annotations of biological processes. Their relationships are currently either inferred from gene set enrichment within specific experiments, or by simple overlap, linking pathway annotations that have genes in common. Here, we provide a unifying interpretation of functional interaction between pathways by systematically quantifying coexpression between 1,330 canonical pathways from the Molecular Signatures Database (MSigDB) to establish the Pathway Coexpression Network (PCxN). We estimated the correlation between canonical pathways valid in a broad context using a curated collection of 3,207 microarrays from 72 normal human tissues. PCxN accounts for shared genes between annotations to estimate significant correlations between pathways with related functions rather than with similar annotations. We demonstrate that PCxN provides novel insight into mechanisms of complex diseases using an Alzheimer’s Disease (AD) case study. PCxN retrieved pathways significantly correlated with an expert curated AD gene list. These pathways have known associations with AD and were significantly enriched for genes independently associated with AD. As a further step, we show how PCxN complements the results of gene set enrichment methods by revealing relationships between enriched pathways, and by identifying additional highly correlated pathways. PCxN revealed that correlated pathways from an AD expression profiling study include functional clusters involved in cell adhesion and oxidative stress. PCxN provides expanded connections to pathways from the extracellular matrix. PCxN provides a powerful new framework for interrogation of global pathway relationships. Comprehensive exploration of PCxN can be performed at http://pcxn.org/.", "citationCount": 4, "authors": [{"name": "Pita-Juarez Y."}, {"name": "Altschuler G."}, {"name": "Kariotis S."}, {"name": "Wei W."}, {"name": "Koler K."}, {"name": "Green C."}, {"name": "Tanzi R.E."}, {"name": "Hide W."}], "date": "2018-03-01T00:00:00Z", "journal": "PLoS Computational Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Winston Hide", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "winhide@sheffield.ac.uk"}], "biotoolsCURIE": "biotools:pcxn", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://pcxn.org:8080/", "function": [{"note": null, "input": [], "operation": [{"term": "Pathway or network analysis", "uri": "http://edamontology.org/operation_2497"}, {"term": "Gene expression analysis", "uri": "http://edamontology.org/operation_2495"}], "cmd": null, "output": []}], "lastUpdate": "2019-02-25T20:17:06Z", "otherID": [], "description": "Powerful new framework for interrogation of global pathway relationships.", "toolType": ["Web application", "Database portal"], "editPermission": {"type": "private", "authors": []}, "language": ["JavaScript"], "link": [], "biotoolsID": "pcxn", "additionDate": "2018-07-07T17:23:01Z", "name": "PCxN", "license": null, "documentation": [{"url": "http://pcxn.org:8080/video.html", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}