{
    "accessibility": "Open access",
    "additionDate": "2022-06-25T13:40:39.159629Z",
    "biotoolsCURIE": "biotools:emdna",
    "biotoolsID": "emdna",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wilma.olson@rutgers.edu",
            "name": "Wilma K. Olson"
        },
        {
            "name": "Nicolas Clauvelin"
        },
        {
            "name": "Robert T. Young"
        }
    ],
    "description": "emDNA is a C++ software for minimizing the energy of DNA or DNA+proteins complexes. It can handle various geometrical constraints (e.g. fixed end-to-end distance and/or rotation) and can be used to simulate opened or closed DNA fragments.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://nicocvn.github.io/emDNA/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T16:01:12.399077Z",
    "license": "Not licensed",
    "name": "emDNA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2022.167558",
            "metadata": {
                "abstract": "Computational modeling of nucleic acids plays an important role in molecular biology, enhancing our general understanding of the relationship between structure and function. Biophysical studies have provided a wealth of information on how double-helical DNA responds to proteins and other molecules in its local environment but far less understanding of the larger scale structural responses found in protein-decorated loops and minicircles. Current computational models of DNA range from detailed all-atom molecular dynamics studies, which produce rich time and spatially dependent depictions of small DNA fragments, to coarse-grained simulations, which sacrifice detailed physical and chemical information to treat larger-scale systems. The treatment of DNA used here, at the base-pair step level with rigid-body parameters, allows one to develop models hundreds of base pairs long from local, sequence-specific features found from experiment. The emDNA software takes advantage of this framework, producing optimized structures of DNA at thermal equilibrium with built-in or user-generated elastic models. The program, in combination with the case studies included in this article, allows users of any skill level to develop and investigate mesoscale models of their own design. The functionality of emDNA includes a tool to incorporate experiment-specific configurations, e.g., protein-bound and/or melted DNA from known high-resolution structures, within higher-order 3D models by fixing the orientation and position of user-specified base pairs. The software provides a new avenue into multiscale genetic modeling, giving a wide range of users a deeper understanding of DNA mesoscale organization and the opportunity to pose new questions in genetic research. The publicly available emDNA software, including build instructions and usage information, is available on GitHub (https://nicocvn.github.io/emDNA/).",
                "authors": [
                    {
                        "name": "Clauvelin N."
                    },
                    {
                        "name": "Olson W.K."
                    },
                    {
                        "name": "Young R.T."
                    }
                ],
                "citationCount": 2,
                "date": "2022-06-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "emDNA – A Tool for Modeling Protein-decorated DNA Loops and Minicircles at the Base-pair Step Level"
            },
            "pmcid": "PMC9177622",
            "pmid": "35341743"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
