{"credit":[{"name":"ELIXIR-ITA-PADOVA","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"comin@dei.unipd.it","name":"Matteo Comin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.dei.unipd.it/~ciompin/"}],"documentation":[{"type":"GENERAL","url":"http://www.dei.unipd.it/~ciompin/main/filtering.html"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"}]}],"labels":{"license":"Other","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"In biology, the notion of degenerate pattern plays a central role for describing various phenomena. For example, protein active site patterns, like those contained in the PROSITE database, e.g., [FY ]DPC[LIM][ASG]C[ASG],are, in general, represented by degenerate patterns with character classes.Researchers have developed several approaches over the years to discover degenerate patterns. Although these methods have been exhaustively and successfully tested on genomes and proteins, their outcomes often far exceed the size of the original input, making the output hard to be managed and to be interpreted by refined analysis requiring manual inspection. In this paper,we discuss a characterization of degenerate patterns with character classes, without gaps, and we introduce the concept of pattern priority for comparing and ranking different patterns. We define the class of underlying patterns for filtering any set of degenerate patterns into a new set that is linear in the size of the input sequence. We present some preliminary results on the detection of subtle signals in protein families. Results show that our approach drastically reduces the number of patterns in output for a toolfor protein analysis, while retaining the representative patterns. © 2013 by the authors; licensee MDPI, Basel, Switzerland.","authors":["Comin M.","Verzotto D."],"cit_count":3,"doi":"10.3390/a6020352","journal":"Algorithms","title":"Filtering degenerate patterns with application to protein sequence analysis","type":"Primary","year":"2013-06-01"}],"summary":{"biotoolsCURIE":"biotools:underlyingfilter","biotoolsID":"underlyingfilter","description":"Filtering Degenerate Motifs with Application to Protein Sequence Analysis","homepage":"http://www.dei.unipd.it/~ciompin/main/filtering.html","name":"UnderlyingFilter","version":["1"]}}