{
    "additionDate": "2020-01-09T18:09:59Z",
    "biotoolsCURIE": "biotools:ComSAprogram",
    "biotoolsID": "ComSAprogram",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "awsu@u.nus.edu",
            "name": "Su Aw",
            "orcidid": "https://orcid.org/0000-0003-1807-8714",
            "typeEntity": "Person"
        }
    ],
    "description": "Exploring the implementation of the Community for Successful Ageing (ComSA)program in Singapore.\n\nBACKGROUND:The Community for Successful Ageing (ComSA) program has implemented overlapping BioPsychoSocial (BPS) components as part of a Community Development (CD) grassroots and volunteer-led initiative. Implementation of such multi-component programming is influenced by known program characteristics including novelty, complexity and observability as well as related organizational factors. As such, we explored ComSA CD's implementation from the organizational perspective, seeking to inform program improvements. METHODS:We conducted four focus groups with program staff, partners and trainers (total N = 21 participants).\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Exploring implementation Community Successful Ageing Singapore', 'ComSA', 'BioPsychoSocial', 'organizational'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31664899",
    "lastUpdate": "2020-01-09T18:09:59Z",
    "name": "ComSA)program",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12877-019-1271-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The Community for Successful Ageing (ComSA) program has implemented overlapping BioPsychoSocial (BPS) components as part of a Community Development (CD) grassroots and volunteer-led initiative. Implementation of such multi-component programming is influenced by known program characteristics including novelty, complexity and observability as well as related organizational factors. As such, we explored ComSA CD's implementation from the organizational perspective, seeking to inform program improvements. Methods: We conducted four focus groups with program staff, partners and trainers (total N = 21 participants). Findings were analysed using an interpretative approach and synthesized into a line of argument informing lessons learnt. Results: An implementation framework was identified. It is guided by considering the influence of known program characteristics across major themes, representing three core implementation stages. These and supporting sub-themes are elaborated in turn: 1) Creating commitment toward the program was challenged by novelty and at times a lack of shared understanding of ComSA CD, particularly relating to the S component. Overall, cohesion within organizational contexts and having a strong rapport with the community (ability to engage) were needed to persuade volunteers and participants to commit to the program. 2) Coordination and resource allocation were influenced by the complexity of interconnecting BPS components - requiring aligning communication between partners and adapting the BPS sequence, given the separated management structure of program trainers. Efficiency of resource utilization was constrained by the ability to pool and match resources given the limited manpower and community partners who worked-in-silo due to a KPI-centric culture. 3) Collaborative program monitoring and appraisal increased observability of the program's benefits, but depended on partners' prior commitment. Despite appreciating its holistic BPS programming, dropout rate was used as a way to gauge program success, which has limited interpretability. Occasional uncertainty about the program value contributed to concerns about duplicating existing ageing programs, particularly those related to the B component. Conclusion: Lessons learnt for improving BPS programming include (1) eliciting better participants' buy-in and shared program vision, (2) increasing adaptability of BPS sequence and building a culture of shared values for working together (3) and developing comprehensive monitoring systems for program appraisal.",
                "authors": [
                    {
                        "name": "Aw S."
                    },
                    {
                        "name": "Koh G.C.H."
                    },
                    {
                        "name": "Tan C.S."
                    },
                    {
                        "name": "Wong M.L."
                    },
                    {
                        "name": "Vrijhoef H.J.M."
                    },
                    {
                        "name": "Harding S.C."
                    },
                    {
                        "name": "Geronimo M.A.B."
                    },
                    {
                        "name": "Hildon Z.J.L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-30T00:00:00Z",
                "journal": "BMC Geriatrics",
                "title": "Exploring the implementation of the Community for Successful Ageing (ComSA)program in Singapore: Lessons learnt on program delivery for improving BioPsychoSocial health"
            },
            "pmcid": "PMC6820954",
            "pmid": "31664899"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}