{
    "additionDate": "2021-01-18T09:13:48Z",
    "biotoolsCURIE": "biotools:revenant",
    "biotoolsID": "revenant",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gusparisi@gmail.com",
            "name": "Gustavo Parisi",
            "typeEntity": "Person"
        }
    ],
    "description": "Revenant is a database of resurrected proteins coming from extinct organisms. Currently, it contains a manually curated collection of 84 resurrected proteins derived from bibliographic data. Each protein is extensively annotated, including structural, biochemical and biophysical information. Revenant contains a browse capability designed as a timeline from where the different proteins can be accessed. The oldest Revenant entries are between 4200 and 3500 million years ago, while the younger entries are between 8.8 and 6.3 million years ago. These proteins have been resurrected using computational tools called ancestral sequence reconstruction techniques combined with wet-laboratory synthesis and expression",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://revenant.inf.pucp.edu.pe/",
    "lastUpdate": "2021-02-06T14:18:51Z",
    "name": "Revenant",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA031",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Revenant is a database of resurrected proteins coming from extinct organisms. Currently, it contains a manually curated collection of 84 resurrected proteins derived from bibliographic data. Each protein is extensively annotated, including structural, biochemical and biophysical information. Revenant contains a browse capability designed as a timeline from where the different proteins can be accessed. The oldest Revenant entries are between 4200 and 3500 million years ago, while the younger entries are between 8.8 and 6.3 million years ago. These proteins have been resurrected using computational tools called ancestral sequence reconstruction techniques combined with wet-laboratory synthesis and expression. Resurrected proteins are commonly used, with a noticeable increase during the past years, to explore and test different evolutionary hypotheses such as protein stability, to explore the origin of new functions, to get biochemical insights into past metabolisms and to explore specificity and promiscuous behaviour of ancient proteins.",
                "authors": [
                    {
                        "name": "Benitez G."
                    },
                    {
                        "name": "Carletti M.S."
                    },
                    {
                        "name": "Fornasari M.S."
                    },
                    {
                        "name": "Garcia-Rios E."
                    },
                    {
                        "name": "Hirsh L."
                    },
                    {
                        "name": "Monzon A.M."
                    },
                    {
                        "name": "Parisi G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Revenant: A database of resurrected proteins"
            },
            "pmcid": "PMC7218706",
            "pmid": "32400867"
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}
