{
    "additionDate": "2020-09-03T19:09:16Z",
    "biotoolsCURIE": "biotools:tf2network",
    "biotoolsID": "tf2network",
    "collectionID": [
        "BIG N2N",
        "VIB",
        "UGent"
    ],
    "credit": [
        {
            "email": "klaas.vandepoele@psb.vib-ugent.be",
            "name": "Klaas Vandepoele",
            "typeEntity": "Person"
        }
    ],
    "description": "predicting transcription factor regulators and gene regulatory networks in Arabidopsis using publicly available binding site information.\n\nThis tool predicts potential regulators for a set of co-expressed or functionally related genes in Arabidopsis thaliana. It uses TF binding site information (1793 PWMs corresponding to TFBS for 916 TFs) and integrates co-expression data and experimental Protein-DNA and Protein-Protein Interactions in an interactive visualization.\n\nPaste input genes below or upload a gene set file to get started. Clicking the demo button will start TF2Network with a demo gene set containing genes annotated with circadian rhythm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.psb.ugent.be/webtools/TF2Network/",
    "lastUpdate": "2020-09-03T19:09:16Z",
    "name": "TF2Network",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1093/NAR/GKX1279",
            "metadata": {
                "abstract": "A gene regulatory network (GRN) is a collection of regulatory interactions between transcription factors (TFs) and their target genes. GRNs control different biological processes and have been instrumental to understand the organization and complexity of gene regulation. Although various experimental methods have been used to map GRNs in Arabidopsis thaliana, their limited throughput combined with the large number of TFs makes that for many genes our knowledge about regulating TFs is incomplete. We introduce TF2Network, a tool that exploits the vast amount of TF binding site information and enables the delineation of GRNs by detecting potential regulators for a set of co-expressed or functionally related genes. Validation using two experimental benchmarks reveals that TF2Network predicts the correct regulator in 75-92% of the test sets. Furthermore, our tool is robust to noise in the input gene sets, has a low false discovery rate, and shows a better performance to recover correct regulators compared to other plant tools. TF2Network is accessible through a web interface where GRNs are interactively visualized and annotated with various types of experimental functional information. TF2Network was used to perform systematic functional and regulatory gene annotations, identifying new TFs involved in circadian rhythm and stress response.",
                "authors": [
                    {
                        "name": "Kulkarni S.R."
                    },
                    {
                        "name": "Vaneechoutte D."
                    },
                    {
                        "name": "Van de Velde J."
                    },
                    {
                        "name": "Vandepoele K."
                    }
                ],
                "citationCount": 24,
                "date": "2018-04-06T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "TF2Network: predicting transcription factor regulators and gene regulatory networks in Arabidopsis using publicly available binding site information"
            },
            "pmcid": "PMC5888541",
            "pmid": "29272447"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}