
{
    "credit": [
        {
            "email": "kaushalyac@gmail.com",
            "name": "Kaushalya Amarasinghe",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://adtex.sourceforge.net/tutorial.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Python"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Exome sequencing",
                "uri": "http://edamontology.org/topic_3676"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2014 Amarasinghe et al.Background: Using whole exome sequencing to predict aberrations in tumours is a cost effective alternative to whole genome sequencing, however is predominantly used for variant detection and infrequently utilised for detection of somatic copy number variation. Results: We propose a new method to infer copy number and genotypes using whole exome data from paired tumour/normal samples. Our algorithm uses two Hidden Markov Models to predict copy number and genotypes and computationally resolves polyploidy/aneuploidy, normal cell contamination and signal baseline shift. Our method makes explicit detection on chromosome arm level events, which are commonly found in tumour samples. The methods are combined into a package named ADTEx (Aberration Detection in Tumour Exome). We applied our algorithm to a cohort of 17 in-house generated and 18 TCGA paired ovarian cancer/normal exomes and evaluated the performance by comparing against the copy number variations and genotypes predicted using Affymetrix SNP 6.0 data of the same samples. Further, we carried out a comparison study to show that ADTEx outperformed its competitors in terms of precision and F-measure. Conclusions: Our proposed method, ADTEx, uses both depth of coverage ratios and B allele frequencies calculated from whole exome sequencing data, to predict copy number variations along with their genotypes. ADTEx is implemented as a user friendly software package using Python and R statistical language. Source code and sample data are freely available under GNU license (GPLv3) at http://adtex.sourceforge.net/.",
            "authors": [
                "Amarasinghe K.C.",
                "Li J.",
                "Hunter S.M.",
                "Ryland G.L.",
                "Cowin P.A.",
                "Campbell I.G.",
                "Halgamuge S.K."
            ],
            "cit_count": 45,
            "journal": "BMC Genomics",
            "pmid": "25167919",
            "title": "Inferring copy number and genotype in tumour exome data",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:adtex",
        "biotoolsID": "adtex",
        "description": "Aberration Detection in Tumour Exome (ADTEx) is a tool for copy number variation (CNV) detection for whole-exome data from paired tumour/matched normal samples.",
        "homepage": "http://adtex.sourceforge.net/",
        "name": "ADTEx"
    }
}