{
    "additionDate": "2021-01-18T11:25:42Z",
    "biotoolsCURIE": "biotools:circvar-db",
    "biotoolsID": "circvar-db",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "quh@mail.cbi.pku.edu.cn",
            "name": "Hong Qu",
            "orcidid": "https://orcid.org/0000-0001-7735-5748",
            "typeEntity": "Person"
        }
    ],
    "description": "circVAR database is genome-wide archive of genetic variants for human circular RNAs\nCircular RNAs (circRNAs), the 3' and 5' ends of which are covalently linked, are a kind of widely distributed and abundant RNAs found in eukaryotic organisms in recent years. They could play as sponges for regulating microRNAs and RNA binding proteins. Our circVAR database aims to provide resources for circRNA-related genetic variants in healthy and diseased populations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://soft.bioinfo-minzhao.org/circvar",
    "lastUpdate": "2021-02-11T19:26:47Z",
    "name": "circVAR database",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.21203/RS.3.RS-48904/V2"
        },
        {
            "doi": "10.1186/S12864-020-07172-Y",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Circular RNAs (circRNAs) play important roles in regulating gene expression through binding miRNAs and RNA binding proteins. Genetic variation of circRNAs may affect complex traits/diseases by changing their binding efficiency to target miRNAs and proteins. There is a growing demand for investigations of the functions of genetic changes using large-scale experimental evidence. However, there is no online genetic resource for circRNA genes. Results: We performed extensive genetic annotation of 295,526 circRNAs integrated from circBase, circNet and circRNAdb. All pre-computed genetic variants were presented at our online resource, circVAR, with data browsing and search functionality. We explored the chromosome-based distribution of circRNAs and their associated variants. We found that, based on mapping to the 1000 Genomes and ClinVAR databases, chromosome 17 has a relatively large number of circRNAs and associated common and health-related genetic variants. Following the annotation of genome wide association studies (GWAS)-based circRNA variants, we found many non-coding variants within circRNAs, suggesting novel mechanisms for common diseases reported from GWAS studies. For cancer-based somatic variants, we found that chromosome 7 has many highly complex mutations that have been overlooked in previous research. Conclusion: We used the circVAR database to collect SNPs and small insertions and deletions (INDELs) in putative circRNA regions and to identify their potential phenotypic information. To provide a reusable resource for the circRNA research community, we have published all the pre-computed genetic data concerning circRNAs and associated genes together with data query and browsing functions at http://soft.bioinfo-minzhao.org/circvar.",
                "authors": [
                    {
                        "name": "Qu H."
                    },
                    {
                        "name": "Zhao M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "circVAR database: genome-wide archive of genetic variants for human circular RNAs"
            },
            "pmcid": "PMC7599103",
            "pmid": "33121433"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}
