{
    "accessibility": "Open access",
    "additionDate": "2022-08-01T16:49:49.590614Z",
    "biotoolsCURIE": "biotools:kpnn",
    "biotoolsID": "kpnn",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "Knowledge-primed neural networks developed in the Bock lab at CeMM. KPNNs are neural networks that are trained using a knowledge-based network structure, which enables interpretability after training. Networks used in KPNNs should consist of nodes with labels (for example proteins in biological networks) that are connected based on prior knolwedge. After training, KPNNs enable extraction of node weights (importance scores) that represent the importance of individual nodes for the prediction.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/epigen/KPNN"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/epigen/KPNN",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-12-01T21:23:27.435890Z",
    "license": "GPL-3.0",
    "name": "KPNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1186/s13059-020-02100-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Deep learning has emerged as a versatile approach for predicting complex biological phenomena. However, its utility for biological discovery has so far been limited, given that generic deep neural networks provide little insight into the biological mechanisms that underlie a successful prediction. Here we demonstrate deep learning on biological networks, where every node has a molecular equivalent, such as a protein or gene, and every edge has a mechanistic interpretation, such as a regulatory interaction along a signaling pathway. Results: With knowledge-primed neural networks (KPNNs), we exploit the ability of deep learning algorithms to assign meaningful weights in multi-layered networks, resulting in a widely applicable approach for interpretable deep learning. We present a learning method that enhances the interpretability of trained KPNNs by stabilizing node weights in the presence of redundancy, enhancing the quantitative interpretability of node weights, and controlling for uneven connectivity in biological networks. We validate KPNNs on simulated data with known ground truth and demonstrate their practical use and utility in five biological applications with single-cell RNA-seq data for cancer and immune cells. Conclusions: We introduce KPNNs as a method that combines the predictive power of deep learning with the interpretability of biological networks. While demonstrated here on single-cell sequencing data, this method is broadly relevant to other research areas where prior domain knowledge can be represented as networks.",
                "authors": [
                    {
                        "name": "Bock C."
                    },
                    {
                        "name": "Fortelny N."
                    }
                ],
                "citationCount": 26,
                "date": "2020-08-03T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Knowledge-primed neural networks enable biologically interpretable deep learning on single-cell sequencing data"
            },
            "pmid": "32746932"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
