{
    "additionDate": "2020-01-14T09:14:21Z",
    "biotoolsCURIE": "biotools:XCI",
    "biotoolsID": "XCI",
    "confidence_flag": "tool",
    "description": "Inferring the three-dimensional structures of the X-chromosome during X-inactivation.\n\n3D cubic lattice, 3D structure of the X-chromosome, Xist lncRNA, X-chromosome inactivation.\n\n3D-XCI is a lattice-based 3D modeling tool for generating accurate and stable high-resolution 3D chromosome structures based on population Hi-C data",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://dna.cs.miami.edu/3D-XCI/",
    "lastUpdate": "2021-01-06T15:39:02.092227Z",
    "name": "XCI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3934/MBE.2019369",
            "metadata": {
                "abstract": "©2019 the Author(s), licensee AIMS Press. This is an open access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0)The Hi-C experiment can capture the genome-wide spatial proximities of the DNA, based on which it is possible to computationally reconstruct the three-dimensional (3D) structures of chromosomes. The transcripts of the long non-coding RNA (lncRNA) Xist spread throughout the entire X-chromosome and alter the 3D structure of the X-chromosome, which also inactivates one copy of the two X-chromosomes in a cell. The Hi-C experiments are expensive and time-consuming to conduct, but the Hi-C data of the active and inactive X-chromosomes are available. However, the Hi-C data of the X-chromosome during the process of X-chromosome inactivation (XCI) are not available. Therefore, the 3D structure of the X-chromosome during the process of X-chromosome inactivation (XCI) remains to be unknown. We have developed a new approach to reconstruct the 3D structure of the X-chromosome during XCI, in which the chain of DNA beads representing a chromosome is stored and simulated inside a 3D cubic lattice. A 2D Gaussian function is used to model the zero values in the 2D Hi-C contact matrices. By applying simulated annealing and Metropolis-Hastings simulations, we first generated the 3D structures of the X-chromosome before and after XCI. Then, we used Xist localization intensities on the X-chromosome (RAP data) to model the traveling speeds or acceleration between all bead pairs during the process of XCI. The 3D structures of the X-chromosome at 3 hours, 6 hours, and 24 hours after the start of the Xist expression, which initiates the XCI process, have been reconstructed. The source code and the reconstructed 3D structures of the X-chromosome can be downloaded from http://dna.cs.miami.edu/3D-XCI/.",
                "authors": [
                    {
                        "name": "Zhu H."
                    },
                    {
                        "name": "Wang N."
                    },
                    {
                        "name": "Sun J.Z."
                    },
                    {
                        "name": "Pandey R.B."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Mathematical Biosciences and Engineering",
                "title": "Inferring the three-dimensional structures of the X-chromosome during X-inactivation"
            },
            "pmid": "31698618"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}