{
    "additionDate": "2021-01-18T12:34:50Z",
    "biotoolsCURIE": "biotools:nbigv-db",
    "biotoolsID": "nbigv-db",
    "confidence_flag": "tool",
    "description": "A dedicated database of non-B cell derived immunoglobulin variable region.\n\nNon-B cell derived ImmunoGlobulin Variable region Database.\n\nWelcome to NBIGV, a database dedicated to organizing and characterizing non-B cell derived immunoglobulins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://nbigv.org",
    "lastUpdate": "2021-03-08T09:37:21Z",
    "name": "NBIGV-DB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.GENE.2020.145378",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Immunoglobulins (Ig) are important immune molecules that possess highly diverse variable region sequences enabling antigen recognition. According to classical immune theory, B lymphocytes have been considered the only source of Ig production (B-Igs). However, accumulating evidence have suggested that Igs are also produced by many non-B cells (non-B Igs), including epithelial cells, neurons, germ cells, as well as myeloid cells of hemopoietic system. Besides acting as bona fide antibodies, Non-B Igs have alternative cellular functions, such as promotion of cell survival, adhesion and migration. More importantly, Unlike the unlimited sequence diversity of B-Igs, the non-B Igs exhibit conserved V(D)J patterns across the same lineages. To support the analysis and comparison of variable region sequences from Igs, produced by B and non-B cells, we established a database (NBIGV) constituted by a non-B Ig variable region repertoire, which includes 727,989 VHDJH and VκJκ recombination sequences of non-B Igs sequenced from mouse samples. Upon database search, users can view, browse and investigate the variable region sequences of non-B Igs according to respective mice strains and tissues as well as Ig classes. Moreover, users can easily download selected sequences and/or compare sequences of interest with known non-B Ig sequences present in the database using NCBI-BLAST algorithms. Additionally, our database integrates a submission page and supplementary sample information. The NBIGV database may serve as a valuable resource for sequence analyses of Non-B Igs. NBIGV database is freely available at http://nbigv.org.",
                "authors": [
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Xiao L."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Jiang D."
                    },
                    {
                        "name": "Shao W."
                    },
                    {
                        "name": "Zheng J."
                    },
                    {
                        "name": "Hu F."
                    },
                    {
                        "name": "Chu M."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Gong X."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Qiu X."
                    }
                ],
                "date": "2021-03-10T00:00:00Z",
                "journal": "Gene",
                "title": "NBIGV-DB: A dedicated database of non-B cell derived immunoglobulin variable region"
            },
            "pmid": "33359127"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}