{
    "additionDate": "2020-01-14T09:00:09Z",
    "biotoolsCURIE": "biotools:FlavoDb",
    "biotoolsID": "FlavoDb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rohan_meshram@rediffmail.com",
            "name": "Rohan J. Meshram",
            "orcidid": "https://orcid.org/0000-0001-6508-4450",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based chemical repository of flavonoid compounds.\n\nFlavonoids are richly diverse polyphenolic plant secondary metabolites that are known to be crucial component of human diet. These compounds are attributed with variety of nutritional as well as therapeutic value. Flavonoids are often known for their effective antioxidant nature; however, their various other bioactivities are well established. These bioactivities mainly includes antibacterial, anti-cancer, cardio protective, promotion of immune system, anti-inflammatory and skin protection from ultra violet radiation; these properties are effectively reviewed by Tungmunnithum et al 2018.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.net.in/flavodb/home.html",
    "lastUpdate": "2020-12-29T09:22:48Z",
    "name": "FlavoDb",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S13205-019-1962-7",
            "metadata": {
                "abstract": "© 2019, King Abdulaziz City for Science and Technology.There are many online resources that focus on chemical diversity of natural compounds, but only handful of resources exist that focus solely on flavonoid compounds and integrate structural and functional properties; however, extensive collated flavonoid literature is still unavailable to scientific community. Here we present an open access database ‘FlavoDb’ that is focused on providing physicochemical properties as well as topological descriptors that can be effectively implemented in deducing large scale quantitative structure property models of flavonoid compounds. In the current version of database, we present data on 1, 19,400 flavonoid compounds, thereby covering most of the known structural space of flavonoid class of compounds. Moreover, effective structure searching tool presented here is expected to provide an interactive and easy-to-use tool for obtaining flavonoid-based literature and allied information. Data from FlavoDb can be freely accessed via its intuitive graphical user interface made available at following web address: http://bioinfo.net.in/flavodb/home.html.",
                "authors": [
                    {
                        "name": "Bagul K.T."
                    },
                    {
                        "name": "Gacche R.N."
                    },
                    {
                        "name": "Goundge M.B."
                    },
                    {
                        "name": "Kolte B.S."
                    },
                    {
                        "name": "Londhe S.R."
                    },
                    {
                        "name": "Meshram R.J."
                    },
                    {
                        "name": "Pawnikar S.P."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "3 Biotech",
                "title": "FlavoDb: a web-based chemical repository of flavonoid compounds"
            },
            "pmcid": "PMC6823394",
            "pmid": "31696036"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
