{
    "accessibility": "Open access",
    "additionDate": "2024-01-10T19:40:48.149501Z",
    "biotoolsCURIE": "biotools:hnsppi",
    "biotoolsID": "hnsppi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Zhiwei.Ji@njau.edu.cn",
            "name": "Zhiwei Ji",
            "typeEntity": "Person"
        },
        {
            "name": "Shijie Xie",
            "typeEntity": "Person"
        },
        {
            "name": "Xiaojun Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "Hybrid computational model combing network and sequence information for predicting protein-protein interaction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "homepage": "https://github.com/50637/HNSPPI_V1.1",
    "lastUpdate": "2024-11-24T14:22:02.757240Z",
    "name": "HNSPPI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbad261",
            "metadata": {
                "abstract": "Most life activities in organisms are regulated through protein complexes, which are mainly controlled via Protein-Protein Interactions (PPIs). Discovering new interactions between proteins and revealing their biological functions are of great significance for understanding the molecular mechanisms of biological processes and identifying the potential targets in drug discovery. Current experimental methods only capture stable protein interactions, which lead to limited coverage. In addition, expensive cost and time consuming are also the obvious shortcomings. In recent years, various computational methods have been successfully developed for predicting PPIs based only on protein homology, primary sequences of protein or gene ontology information. Computational efficiency and data complexity are still the main bottlenecks for the algorithm generalization. In this study, we proposed a novel computational framework, HNSPPI, to predict PPIs. As a hybrid supervised learning model, HNSPPI comprehensively characterizes the intrinsic relationship between two proteins by integrating amino acid sequence information and connection properties of PPI network. The experimental results show that HNSPPI works very well on six benchmark datasets. Moreover, the comparison analysis proved that our model significantly outperforms other five existing algorithms. Finally, we used the HNSPPI model to explore the SARS-CoV-2-Human interaction system and found several potential regulations. In summary, HNSPPI is a promising model for predicting new protein interactions from known PPI data.",
                "authors": [
                    {
                        "name": "Ji Z."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Ping J."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xie S."
                    },
                    {
                        "name": "Xie X."
                    },
                    {
                        "name": "Zhao X."
                    }
                ],
                "citationCount": 8,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "HNSPPI: a hybrid computational model combing network and sequence information for predicting protein-protein interaction"
            },
            "pmid": "37480553"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
