
{
    "credit": [
        {
            "email": "stefano.calza@unibs.it",
            "name": "Stefano Calza",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/LVSmiRNA.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/LVSmiRNA_1.24.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "publication": [
        {
            "abstract": "MicroRNAs (miRNAs) are short noncoding RNAs that are involved in post-transcriptional regulation of mRNAs. Microarrays have been employed to measure global miRNA expressions; however, because the number of miRNAs is much smaller than the number of mRNAs, it is not clear whether traditional normalization methods developed for mRNA arrays are suitable for miRNA. This is an important question, since normalization affects downstream analyses of the data. In this paper we develop a least-variant set (LVS) normalization method, which was previously shown to outperform other methods in mRNA analysis when standard assumptions are violated. The selection of the LVS miRNAs is based on a robust linear model fit of the probe-level data that takes into account the considerable differences in variances between probes. In a spike-in study, we show that the LVS has similar operating characteristics, in terms of sensitivity and specificity, compared with the ideal normalization, and it is better than no normalization, 75th percentile-shift, quantile, global median, VSN, and lowess normalization methods. We evaluate four expression-summary measures using a tissue data set; summarization from the robust model performs as well as the others. Finally, comparisons using expression data from two dissimilar tissues and two similar ones show that LVS normalization has better operating characteristics than other normalizations. Published by Cold Spring Harbor Laboratory Press. Copyright © 2010 RNA Society.",
            "authors": [
                "Suo C.",
                "Salim A.",
                "Chia K.-S.",
                "Pawitan Y.",
                "Calza S."
            ],
            "cit_count": 14,
            "doi": "10.1261/rna.2345710",
            "journal": "RNA",
            "title": "Modified least-variant set normalization for miRNA microarray",
            "type": "Primary",
            "year": "2010-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lvsmirna",
        "biotoolsID": "lvsmirna",
        "description": "Normalization of Agilent miRNA arrays.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/LVSmiRNA.html",
        "name": "LVSmiRNA",
        "version": [
            "1.24.0"
        ]
    }
}