{
    "additionDate": "2024-01-26T12:19:29.631602Z",
    "biotoolsCURIE": "biotools:tidyproteomics",
    "biotoolsID": "tidyproteomics",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jeffj@caltech.edu",
            "name": "Jeff Jones",
            "typeEntity": "Person"
        }
    ],
    "description": "Open-source R package and data object for quantitative proteomics post analysis and visualization.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jeffsocal/tidyproteomics",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-01-26T12:19:29.640150Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ejmackrell/tidyproteomics-interactive"
        }
    ],
    "name": "tidyproteomics",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05360-7",
            "metadata": {
                "abstract": "Background: The analysis of mass spectrometry-based quantitative proteomics data can be challenging given the variety of established analysis platforms, the differences in reporting formats, and a general lack of approachable standardized post-processing analyses such as sample group statistics, quantitative variation and even data filtering. We developed tidyproteomics to facilitate basic analysis, improve data interoperability and potentially ease the integration of new processing algorithms, mainly through the use of a simplified data-object. Results: The R package tidyproteomics was developed as both a framework for standardizing quantitative proteomics data and a platform for analysis workflows, containing discrete functions that can be connected end-to-end, thus making it easier to define complex analyses by breaking them into small stepwise units. Additionally, as with any analysis workflow, choices made during analysis can have large impacts on the results and as such, tidyproteomics allows researchers to string each function together in any order, select from a variety of options and in some cases develop and incorporate custom algorithms. Conclusions: Tidyproteomics aims to simplify data exploration from multiple platforms, provide control over individual functions and analysis order, and serve as a tool to assemble complex repeatable processing workflows in a logical flow. Datasets in tidyproteomics are easy to work with, have a structure that allows for biological annotations to be added, and come with a framework for developing additional analysis tools. The consistent data structure and accessible analysis and plotting tools also offers a way for researchers to save time on mundane data manipulation tasks.",
                "authors": [
                    {
                        "name": "Chou T.-F."
                    },
                    {
                        "name": "Jones J."
                    },
                    {
                        "name": "Lomenick B."
                    },
                    {
                        "name": "MacKrell E.J."
                    },
                    {
                        "name": "Roukes M.L."
                    },
                    {
                        "name": "Wang T.-Y."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Tidyproteomics: an open-source R package and data object for quantitative proteomics post analysis and visualization"
            },
            "pmcid": "PMC10246047",
            "pmid": "37280522"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
