{
    "additionDate": "2021-01-18T10:20:06Z",
    "biotoolsCURIE": "biotools:whondrs",
    "biotoolsID": "whondrs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "James.Stegen@pnnl.gov",
            "name": "James C. Stegen",
            "typeEntity": "Person"
        }
    ],
    "description": "a web application for global survey of surface water metabolites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://xmlin.shinyapps.io/whondrs/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-14T12:09:17Z",
    "name": "WHONDRS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.7717/PEERJ.9277",
            "metadata": {
                "abstract": "Copyright © 2020 Battelle Memorial InstituteBackground. The Worldwide Hydrobiogeochemistry Observation Network for Dynamic River Systems (WHONDRS) is a consortium that aims to understand complex hydrologic, biogeochemical, and microbial connections within river corridors experiencing perturbations such as dam operations, floods, and droughts. For one ongoing WHONDRS sampling campaign, surface water metabolite and microbiome samples are collected through a global survey to generate knowledge across diverse river corridors. Metabolomics analysis and a suite of geochemical analyses have been performed for collected samples through the Environmental Molecular Sciences Laboratory (EMSL). The obtained knowledge and data package inform mechanistic and data-driven models to enhance predictions of outcomes of hydrologic perturbations and watershed function, one of the most critical components in model-data integration. To support efforts of the multi-domain integration and make the ever-growing data package more accessible for researchers across the world, a Shiny/R Graphical User Interface (GUI) called WHONDRS-GUI was created. Results. The web application can be run on any modern web browser without any programming or operational system requirements, thus providing an open, well-structured, discoverable dataset for WHONDRS. Together with a context-aware dynamic user interface, the WHONDRS-GUI has functionality for searching, compiling, integrating, visualizing and exporting different data types that can easily be used by the community. The web application and data package are available at https://data.ess-dive.lbl.gov/view/doi:10.15485/1484811, which enables users to simultaneously obtain access to the data and code and to subsequently run the web app locally. The WHONDRS-GUI is also available for online use at Shiny Server (https://xmlin.shinyapps.io/whondrs/).",
                "authors": [
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Ren H."
                    },
                    {
                        "name": "Goldman A.E."
                    },
                    {
                        "name": "Stegen J.C."
                    },
                    {
                        "name": "Scheibe T.D."
                    }
                ],
                "date": "2020-07-22T00:00:00Z",
                "journal": "PeerJ",
                "title": "WHONDRS-GUI: A web application for global survey of surface water metabolites"
            },
            "pmcid": "PMC7382364",
            "pmid": "32765964"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}