
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Biotherapeutics",
                "uri": "http://edamontology.org/topic_3374"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, © 2019 Informa UK Limited, trading as Taylor & Francis Group.Ischemic stroke (IS) is a complex disease affected by various environmental factors, genetic factors and their interactions. Because genetic factors occupy an irreplaceable place in the pathogenesis of IS, the identification of genetic factors has become one of the hot spots in the current research. In the present study, we aimed to identify possible gene targets and relevant drug molecules in the pathogenesis of IS. Microarray dataset of GSE16561 was downloaded from Gene Expression Omnibus database. The differentially expressed genes (DEGs) between IS group and control group were obtained using limma package in R. Ground-Operation Simulation package in R language was used to cluster DEGs according to their biological process, cellular components and molecular functions with respect to the GO annotation. The DEGs were analyzed by Search Tool for the Retrieval of Interacting Genes online database and Cytoscape software to predict their interaction relationship. Finally, the DEGs were submitted to DGIdb dataset and related drug molecules were retrieved. 20 DEGs were identified from IS group including 1 downregulated and 19 upregulated genes. The function enrichment analysis revealed that the DEGs were enriched in three GO terms, mainly including inflammatory response, positive regulation of protein kinase activity and innate immune response. Finally, 10 drug molecules were identified from the DEGs. Our study identified some potential biological targets and drug molecules for the treatment of IS.",
            "authors": [
                "Zhou L.",
                "Wang Y.",
                "Wang K.",
                "Wang J.",
                "Ma A.",
                "Pan X."
            ],
            "cit_count": 0,
            "doi": "10.1080/00207454.2019.1634072",
            "journal": "International Journal of Neuroscience",
            "pmid": "31387440",
            "title": "Potential therapeutic drugs for ischemic stroke based on bioinformatics analysis",
            "year": "2019-11-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:DGIdb",
        "biotoolsID": "DGIdb",
        "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Cytoscape' (bio.tools/cytoscape), 'DEGs', 'Ground-Operation', 'limma' (bio.tools/limma) | Potential therapeutic drugs for ischemic stroke based on bioinformatics analysis | DGIdb, The Drug Gene Interaction Database, is a research resource that can be used to search candidate genes or drugs against the known and potentially druggable genome",
        "homepage": "http://dgidb.genome.wustl.edu/",
        "name": "DGIdb"
    }
}