{
    "accessibility": "Open access",
    "additionDate": "2022-06-28T18:28:36.611862Z",
    "biotoolsCURIE": "biotools:mirror",
    "biotoolsID": "mirror",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "heebal@snu.ac.kr",
            "name": "Heebal Kim",
            "orcidid": "https://orcid.org/0000-0003-3064-1303",
            "typeEntity": "Person"
        },
        {
            "name": "Donghyeok Seol",
            "orcidid": "https://orcid.org/0000-0001-9695-5861"
        }
    ],
    "description": "Database and Tool for Metataxonomics with Long-Read Sequence.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Operon drawing",
                    "uri": "http://edamontology.org/operation_0579"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "http://mirror.egnome.co.kr/",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-06-28T18:28:36.614365Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/seoldh/MIrROR"
        }
    ],
    "name": "MIrROR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1128/SPECTRUM.02017-21",
            "metadata": {
                "abstract": "Copyright © 2022 Seol et al.Recent development of long-read sequencing platforms has enabled researchers to explore bacterial community structure through analysis of full-length 16S rRNA gene (;1,500 bp) or 16S-ITS-23S rRNA operon region (;4,300 bp), resulting in higher taxonomic resolution than short-read sequencing platforms. Despite the potential of long-read sequencing in metagenomics, resources and protocols for this technology are scarce. Here, we describe MIrROR, the database and analysis tool for metataxonomics using the bacterial 16S-ITS-23S rRNA operon region. We collected 16S-ITS-23S rRNA operon sequences extracted from bacterial genomes from NCBI GenBank and performed curation. A total of 97,781 16S-ITS-23S rRNA operon sequences covering 9,485 species from 43,653 genomes were obtained. For user convenience, we provide an analysis tool based on a mapping strategy that can be used for taxonomic profiling with MIrROR database. To benchmark MIrROR, we compared performance against publicly available databases and tool with mock communities and simulated data sets. Our platform showed promising results in terms of the number of species covered and the accuracy of classification. To encourage active 16S-ITS-23S rRNA operon analysis in the field, BLAST function and taxonomic profiling results with 16S-ITS-23S rRNA operon studies, which have been reported as BioProject on NCBI are provided. MIrROR (http://mirror.egnome.co.kr/) will be a useful platform for researchers who want to perform high-resolution metagenome analysis with a cost-effective sequencer such as MinION from Oxford Nanopore Technologies. IMPORTANCE Metabarcoding is a powerful tool to investigate community diversity in an economic and efficient way by amplifying a specific gene marker region. With the advancement of long-read sequencing technologies, the field of metabarcoding has entered a new phase. The technologies have brought a need for development in several areas, including new markers that long-read can cover, database for the markers, tools that reflect long-read characteristics, and compatibility with downstream analysis tools. By constructing MIrROR, we met the need for a database and tools for the 16S-ITS-23S rRNA operon region, which has recently been shown to have sufficient resolution at the species level. Bacterial community analysis using the 16S-ITS-23S rRNA operon region with MIrROR will provide new insights from various research fields.",
                "authors": [
                    {
                        "name": "Cho S."
                    },
                    {
                        "name": "Jeong M."
                    },
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Kwak W."
                    },
                    {
                        "name": "Lee Y.H."
                    },
                    {
                        "name": "Lim J.S."
                    },
                    {
                        "name": "Seol D."
                    },
                    {
                        "name": "Sung S."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "Microbiology Spectrum",
                "title": "Microbial Identification Using rRNA Operon Region: Database and Tool for Metataxonomics with Long-Read Sequence"
            },
            "pmcid": "PMC9045266",
            "pmid": "35352997"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}
