{
    "additionDate": "2017-08-03T18:50:27Z",
    "biotoolsCURIE": "biotools:m_ia",
    "biotoolsID": "m_ia",
    "credit": [
        {
            "email": "maia@genouest.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://maia.genouest.org/home.php?section=about"
        }
    ],
    "description": "This environment offers an interactive multi-user interface which includes all steps of a microarray study: from MIAME-compliant storage of experiments and raw data processing to analysis of differentially regulated genes. In addition, it offers functional insight into gene expression data by using an original approach combining biological knowledge annotation with gene expression data through interactive graph.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://maia.genouest.org/home.php?section=demo"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://maia.genouest.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mia-1-2-microarray-integrated-applications.html"
        }
    ],
    "name": "M IA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Microarray technology is a widely used approach to gene expression analysis. Many tools for microarray management and data analysis have been developed, and recently new methods have been proposed for deciphering biological pathways by integrating microarray data with other data sources. However, to improve microarray analysis and provide meaningful gene interaction networks, integrated software solutions are still needed. Therefore, we developed M@IA, an environment for DNA microarray data analysis allowing gene network reconstruction. M@IA is a microarray integrated application which includes all of the steps of a microarray study, from MIAME-compliant raw data storage and processing gene expression analysis. Furthermore, M@IA allows automatic gene annotation based on ontology, metabolic/signalling pathways, protein interaction, miRNA and transcriptional factor associations, as well as integrative analysis of gene interaction networks. Statistical and graphical methods facilitate analysis, yielding new hypotheses on gene expression data. To illustrate our approach, we applied M@IA modules to microarray data taken from an experiment on liver tissue. We integrated differentially expressed genes with additional biological information, thus identifying new molecular interaction networks that are associated with fibrogenesis. M@IA is a new application for microarray management and data analysis, offering functional insights into microarray data by the combination of gene expression data and biological knowledge annotation based on interactive graphs. M@IA is an interactive multi-user interface based on a flexible modular architecture and it is freely available for academic users at http://maia.genouest.org. © 2008 IOS Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Bihouee A."
                    },
                    {
                        "name": "Le Bechec A."
                    },
                    {
                        "name": "Le Meur N."
                    },
                    {
                        "name": "Leger J."
                    },
                    {
                        "name": "Petritis D."
                    },
                    {
                        "name": "Sierocinski T."
                    },
                    {
                        "name": "Theret N."
                    },
                    {
                        "name": "Zindy P."
                    }
                ],
                "citationCount": 7,
                "date": "2008-01-01T00:00:00Z",
                "journal": "In Silico Biology",
                "title": "M@IA: A modular open-source application for microarray workflow and integrative datamining"
            },
            "pmid": "18430991"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}
