{
    "accessibility": "Open access",
    "additionDate": "2021-01-05T08:31:33Z",
    "biotoolsCURIE": "biotools:investigation_of_non_canonical_splice_sites",
    "biotoolsID": "investigation_of_non_canonical_splice_sites",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Boas Pucker",
            "orcidid": "https://orcid.org/0000-0002-3321-7471",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor",
                "Developer",
                "Primary contact"
            ]
        },
        {
            "name": "Katharina Sielemann",
            "orcidid": "https://orcid.org/0000-0002-4022-8531",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "These scripts provide functions to analyse splice sites based on a genome sequence (FASTA) and a corresponding annotation (GFF3) provided by the NCBI. Next, RNA-Seq reads can be mapped via STAR and the resulting BAM files can be converted into customized coverage files (COV) which are required for the validation of splice sites. The usage of individual splice sites can be quantified based on the number of mapped and propperly splitted RNA-Seq reads. These scripts generate report files and figures for the documentation of the analysis process.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/bpucker/ncss2018"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/bpucker/ncss2018"
        }
    ],
    "editPermission": {
        "authors": [
            "bpucker",
            "ksielemann"
        ],
        "type": "group"
    },
    "homepage": "https://github.com/bpucker/ncss2018",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-05T08:31:50Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bpucker/ncss2018"
        }
    ],
    "name": "investigation of (non canonical) splice sites",
    "owner": "ksielemann",
    "publication": [
        {
            "doi": "10.1186/s12864-018-5360-z",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Most eukaryotic genes comprise exons and introns thus requiring the precise removal of introns from pre-mRNAs to enable protein biosynthesis. U2 and U12 spliceosomes catalyze this step by recognizing motifs on the transcript in order to remove the introns. A process which is dependent on precise definition of exon-intron borders by splice sites, which are consequently highly conserved across species. Only very few combinations of terminal dinucleotides are frequently observed at intron ends, dominated by the canonical GT-AG splice sites on the DNA level. Results: Here we investigate the occurrence of diverse combinations of dinucleotides at predicted splice sites. Analyzing 121 plant genome sequences based on their annotation revealed strong splice site conservation across species, annotation errors, and true biological divergence from canonical splice sites. The frequency of non-canonical splice sites clearly correlates with their divergence from canonical ones indicating either an accumulation of probably neutral mutations, or evolution towards canonical splice sites. Strong conservation across multiple species and non-random accumulation of substitutions in splice sites indicate a functional relevance of non-canonical splice sites. The average composition of splice sites across all investigated species is 98.7% for GT-AG, 1.2% for GC-AG, 0.06% for AT-AC, and 0.09% for minor non-canonical splice sites. RNA-Seq data sets of 35 species were incorporated to validate non-canonical splice site predictions through gaps in sequencing reads alignments and to demonstrate the expression of affected genes. Conclusion: We conclude that bona fide non-canonical splice sites are present and appear to be functionally relevant in most plant genomes, although at low abundance.",
                "authors": [
                    {
                        "name": "Brockington S.F."
                    },
                    {
                        "name": "Pucker B."
                    }
                ],
                "citationCount": 12,
                "date": "2018-12-29T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Genome-wide analyses supported by RNA-Seq reveal non-canonical splice sites in plant genomes"
            },
            "note": "Genome-wide analyses supported by RNA-Seq reveal non-canonical splice sites in plant genomes",
            "pmcid": "PMC6310983",
            "pmid": "30594132",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.3390/cells9020458",
            "metadata": {
                "abstract": "Most protein-encoding genes in eukaryotes contain introns, which are interwoven with exons. Introns need to be removed from initial transcripts in order to generate the final messenger RNA (mRNA), which can be translated into an amino acid sequence. Precise excision of introns by the spliceosome requires conserved dinucleotides, which mark the splice sites. However, there are variations of the highly conserved combination of GT at the 5' end and AG at the 3' end of an intron in the genome. GC-AG and AT-AC are two major non-canonical splice site combinations, which have been known for years. Recently, various minor non-canonical splice site combinations were detected with numerous dinucleotide permutations. Here, we expand systematic investigations of non-canonical splice site combinations in plants across eukaryotes by analyzing fungal and animal genome sequences. Comparisons of splice site combinations between these three kingdoms revealed several differences, such as an apparently increased CT-AC frequency in fungal genome sequences. Canonical GT-AG splice site combinations in antisense transcripts are a likely explanation for this observation, thus indicating annotation errors. In addition, high numbers of GA-AG splice site combinations were observed in Eurytemoraaffinis and Oikopleuradioica. A variant in one U1 small nuclear RNA (snRNA) isoform might allow the recognition of GA as a 5' splice site. In depth investigation of splice site usage based on RNA-Seq read mappings indicates a generally higher flexibility of the 3' splice site compared to the 5' splice site across animals, fungi, and plants.",
                "authors": [
                    {
                        "name": "Frey K."
                    },
                    {
                        "name": "Pucker B."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-18T00:00:00Z",
                "journal": "Cells",
                "title": "Animal, Fungi, and Plant Genome Sequences Harbor Different Non-Canonical Splice Sites"
            },
            "note": "Animal, Fungi, and Plant Genome Sequences Harbor Different Non-Canonical Splice Sites",
            "pmcid": "PMC7072748",
            "pmid": "32085510",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
