{"credit":[],"function":[{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"},{"term":"RNA structure prediction","uri":"http://edamontology.org/operation_2441"},{"term":"RNA secondary structure alignment","uri":"http://edamontology.org/operation_0502"}]}],"labels":{"language":["Python"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"}]},"publication":[{"abstract":"© 2019 Elsevier LtdThe identification of RNA secondary structure has been an important tool for the characterization of nucleic acids. Computational structure prediction has been an effective approach toward this end, but improvement of established methods is often slow and reliant on redundant methodology. Here we present a novel consensus scoring approach, created to incorporate inputs from an array of established methods with the goal of producing outputs that contain mutual structures from these programs. This method is implemented in RNAdemocracy, a python program capable of competing with existing methods. This ensemble approach was limited by commonalities in established methods like parameter sourcing, which may lead to agreement error, an unavoidable outcome due to the limit of available RNA structure datasets. The modular construction of RNAdemocracy allows for its easy upgrading and customization to suit user's needs. RNAdemocracy, while capable of accurate predictions, is best suited to guide users to regions of the sequence space that exhibit agreement instead of a totally reliant predictor of structure. It is also capable of grading predictions for potential accuracy by providing a percentage of consensus between contributing methods in the final structure.","authors":["Skidmore B.L.","Briggs J.M."],"cit_count":0,"doi":"10.1016/J.COMPBIOLCHEM.2019.107151","journal":"Computational Biology and Chemistry","pmid":"31751879","title":"RNAdemocracy: an ensemble method for RNA secondary structure prediction using consensus scoring","year":"2019-12-01"}],"summary":{"biotoolsCURIE":"biotools:RNAdemocracy","biotoolsID":"RNAdemocracy","description":"an ensemble method for RNA secondary structure prediction using consensus scoring.\n\nThe identification of RNA secondary structure has been an important tool for the characterization of nucleic acids. Computational structure prediction has been an effective approach toward this end, but improvement of established methods is often slow and reliant on redundant methodology. Here we present a novel consensus scoring approach, created to incorporate inputs from an array of established methods with the goal of producing outputs that contain mutual structures from these programs. This method is implemented in RNAdemocracy, a python program capable of competing with existing methods. This ensemble approach was limited by commonalities in established methods like parameter sourcing, which may lead to agreement error, an unavoidable outcome due to the limit of available RNA structure datasets.\n\n||| HOMEPAGE MISSING!","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31751879","name":"RNAdemocracy"}}