{
    "additionDate": "2023-01-26T12:00:23.194508Z",
    "biotoolsCURIE": "biotools:denodo",
    "biotoolsID": "denodo",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "credit": [
        {
            "email": "support@denodo.com",
            "name": "Angel Viña",
            "note": "In 1999, Angel Viña, who was then a professor at the University of A Coruña, recognized that data repositories were likely to grow unsustainably large if businesses continued to integrate data in the traditional manner. He envisioned a data integration strategy based on data virtualization, a modern strategy in which users could integrate data without replicating it, and thus, Denodo was born.",
            "typeEntity": "Person",
            "url": "https://support.denodo.com/?utm_source=Denodo-web&utm_medium=Try-Denodo"
        }
    ],
    "description": "For every organization data and its related infrastructure is constantly evolving. As a result, enterprise data will always remain distributed. The Denodo Platform gives IT organizations the flexibility to evolve their data strategies, migrating to the cloud, or logically unifying data warehouses and data lakes, without affecting business. The Denodo Platform also accelerates data provisioning through reduced data replication, it enables consistent security and governance across multiple systems, and it gives your business users the flexibility to choose their preferred applications. The only way you can accomplish this is through a logical data fabric powered by data virtualization. The Denodo Platform is the only solution that can meet this need. Read about the benefits of the Denodo Platform in this Forrester TEI Repo",
    "documentation": [
        {
            "note": "Resources Denodo offers an extensive library of data virtualization resources aimed at helping you unleash the true value of your data.",
            "type": [
                "Other"
            ],
            "url": "https://www.denodo.com/en/resources?utm_source=Denodo-web&utm_medium=Try-Denodo"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.denodo.com/en/denodo-platform/denodo-express?utm_source=Denodo-web&utm_medium=Try-Denodo"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://www.denodo.com/en",
    "lastUpdate": "2023-02-01T13:14:47.714709Z",
    "license": "Proprietary",
    "link": [
        {
            "type": [
                "Technical monitoring"
            ],
            "url": "https://www.denodo.com/en/denodo-platform/services/overview"
        }
    ],
    "name": "Denodo",
    "owner": "iacs-biocomputacion"
}
