
{
    "credit": [
        {
            "email": "ramy.aziz@gmail.com",
            "name": "R.K. Aziz",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://rast.nmpdr.org/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: The number of prokaryotic genome sequences becoming available is growing steadily and is growing faster than our ability to accurately annotate them. Description: We describe a fully automated service for annotating bacterial and archaeal genomes. The service identifies protein-encoding, rRNA and tRNA genes, assigns functions to the genes, predicts which subsystems are represented in the genome, uses this information to reconstruct the metabolic network and makes the output easily downloadable for the user. In addition, the annotated genome can be browsed in an environment that supports comparative analysis with the annotated genomes maintained in the SEED environment. The service normally makes the annotated genome available within 12-24 hours of submission, but ultimately the quality of such a service will be judged in terms of accuracy, consistency, and completeness of the produced annotations. We summarize our attempts to address these issues and discuss plans for incrementally enhancing the service. Conclusion: By providing accurate, rapid annotation freely to the community we have created an important community resource. The service has now been utilized by over 120 external users annotating over 350 distinct genomes. © 2008 Aziz et al; licensee BioMed Central Ltd.",
            "authors": [
                "Aziz R.K.",
                "Bartels D.",
                "Best A.",
                "DeJongh M.",
                "Disz T.",
                "Edwards R.A.",
                "Formsma K.",
                "Gerdes S.",
                "Glass E.M.",
                "Kubal M.",
                "Meyer F.",
                "Olsen G.J.",
                "Olson R.",
                "Osterman A.L.",
                "Overbeek R.A.",
                "McNeil L.K.",
                "Paarmann D.",
                "Paczian T.",
                "Parrello B.",
                "Pusch G.D.",
                "Reich C.",
                "Stevens R.",
                "Vassieva O.",
                "Vonstein V.",
                "Wilke A.",
                "Zagnitko O."
            ],
            "cit_count": 4808,
            "doi": "10.1186/1471-2164-9-75",
            "journal": "BMC Genomics",
            "title": "The RAST Server: Rapid annotations using subsystems technology",
            "type": "Primary",
            "year": "2008-02-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rast",
        "biotoolsID": "rast",
        "description": "\"RAST (Rapid Annotation using Subsystem Technology) is a fully-automated service for annotating complete or nearly complete bacterial and archaeal genomes. It provides high quality genome annotations for these genomes across the whole phylogenetic tree.\"",
        "homepage": "http://rast.nmpdr.org/",
        "name": "RAST"
    }
}