{
    "additionDate": "2017-08-03T18:55:43Z",
    "biotoolsCURIE": "biotools:phosnetconstruct",
    "biotoolsID": "phosnetconstruct",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://202.54.249.142/~nikhil/network_reconstruction/contacts.html"
        }
    ],
    "description": "Tool to predict novel phosphorylation networks based on the preference of certain kinase families to phosphorylate specific functional protein families (domains). It identifies the potentially phosphorylated proteins from a given set of proteins and predicts target kinases which in turn would phosphorylate these identified phosphoproteins based on their domain compositions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://202.54.249.142/~nikhil/network_reconstruction/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.nii.ac.in/phosnetconstruct.html",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phosnetconstruct-phosphorylation-network-reconstruction.html"
        }
    ],
    "name": "PhosNetConstruct",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: In silico prediction of site-specific kinase-substrate relationships (ssKSRs) is crucial for deciphering phosphorylation networks by linking kinomes to phosphoproteomes. However, currently available predictors for ssKSRs give rise to a large number of false-positive results because they use only a short sequence stretch around phosphosite as determinants of kinase specificity and do not consider the biological context of kinase-substrate recognition. Results: Based on the analysis of domain-specific kinase-substrate relationships, we have constructed a domain-level phosphorylation network that implicitly incorporates various contextual factors. It reveals preferential phosphorylation of specific domains by certain kinases. These novel correlations have been implemented in PhosNetConstruct, an automated program for predicting target kinases for a substrate protein. PhosNetConstruct distinguishes cognate kinase-substrate pairs from a large number of non-cognate combinations. Benchmarking on independent datasets using various statistical measures demonstrates the superior performance of PhosNetConstruct over ssKSR-based predictors. © 2014 The Author. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Damle N.P."
                    },
                    {
                        "name": "Mohanty D."
                    }
                ],
                "citationCount": 13,
                "date": "2014-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Deciphering kinase-substrate relationships by analysis of domain-specific phosphorylation network"
            },
            "pmid": "24574117"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
