{
    "additionDate": "2021-12-06T08:54:19.299254Z",
    "biotoolsCURIE": "biotools:smile",
    "biotoolsID": "smile",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ting.hu@queensu.ca",
            "name": "Ting Hu",
            "typeEntity": "Person"
        }
    ],
    "description": "Systems Metabolomics using Interpretable Learning and Evolution (SMILE) is a framework for for supervised metabolomics data analysis. SMILE package implements Linear Genetic Programming (LGP) algorithm in python, with a scikit-learn style API. It is mainly used in data mining and finding feature interactions. Note it currently only support binary classification data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://smile-mib.rtfd.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MIB-Lab/SMILE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-06T08:54:19.301962Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://smile-mib.cs.queensu.ca"
        }
    ],
    "name": "SMILE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04209-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Direct link between metabolism and cell and organism phenotype in health and disease makes metabolomics, a high throughput study of small molecular metabolites, an essential methodology for understanding and diagnosing disease development and progression. Machine learning methods have seen increasing adoptions in metabolomics thanks to their powerful prediction abilities. However, the “black-box” nature of many machine learning models remains a major challenge for wide acceptance and utility as it makes the interpretation of decision process difficult. This challenge is particularly predominant in biomedical research where understanding of the underlying decision making mechanism is essential for insuring safety and gaining new knowledge. Results: In this article, we proposed a novel computational framework, Systems Metabolomics using Interpretable Learning and Evolution (SMILE), for supervised metabolomics data analysis. Our methodology uses an evolutionary algorithm to learn interpretable predictive models and to identify the most influential metabolites and their interactions in association with disease. Moreover, we have developed a web application with a graphical user interface that can be used for easy analysis, interpretation and visualization of the results. Performance of the method and utilization of the web interface is shown using metabolomics data for Alzheimer’s disease. Conclusions: SMILE was able to identify several influential metabolites on AD and to provide interpretable predictive models that can be further used for a better understanding of the metabolic background of AD. SMILE addresses the emerging issue of interpretability and explainability in machine learning, and contributes to more transparent and powerful applications of machine learning in bioinformatics.",
                "authors": [
                    {
                        "name": "Sha C."
                    },
                    {
                        "name": "Cuperlovic-Culf M."
                    },
                    {
                        "name": "Hu T."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SMILE: systems metabolomics using interpretable learning and evolution"
            },
            "pmcid": "PMC8161935",
            "pmid": "34049495"
        }
    ],
    "toolType": [
        "Library",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}