
{
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRoles": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://globplot.embl.de/html/help.html"
        }
    ],
    "documentation": [
        {
            "type": "API documentation",
            "url": "http://globplot.embl.de/webservice/globplot.wsdl"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "SQL"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "https://www.biocatalogue.org/services/2027"
        }
    ],
    "publication": [
        {
            "abstract": "A major challenge in the proteomics and structural genomics era is to predict protein structure and function, including identification of those proteins that are partially or wholly unstructured. Non-globular sequence segments often contain short linear peptide motifs (e.g. SH3-binding sites) which are important for protein function. We present here a new tool for discovery of such unstructured, or disordered regions within proteins. GlobPlot (http://globplot.embl.de) is a web service that allows the user to plot the tendency within the query protein for order/globularity and disorder. We show examples with known proteins where it successfully identifies inter-domain segments containing linear motifs, and also apparently ordered regions that do not contain any recognised domain. GlobPlot may be useful in domain hunting efforts. The plots indicate that instances of known domains may often contain additional N- or C-terminal segments that appear ordered. Thus GlobPlot may be of use in the design of constructs corresponding to globular proteins, as needed for many biochemical studies, particularly structural biology. GlobPlot has a pipeline interface - GlobPipe - for the advanced user to do whole proteome analysis. GlobPlot can also be used as a generic infrastructure package for graphical displaying of any possible propensity.",
            "authors": [
                "Linding R.",
                "Russell R.B.",
                "Neduva V.",
                "Gibson T.J."
            ],
            "cit_count": 694,
            "doi": "10.1093/nar/gkg519",
            "journal": "Nucleic Acids Research",
            "title": "GlobPlot: Exploring protein sequences for globularity and disorder",
            "type": "Primary",
            "year": "2003-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:globplotter",
        "biotoolsID": "globplotter",
        "description": "Performs intrinsic protein disorder, domain and globularity prediction.",
        "homepage": "http://globplot.embl.de",
        "name": "GlobPlotter",
        "version": [
            "1"
        ]
    }
}