{
    "additionDate": "2018-04-27T10:42:37Z",
    "biotoolsCURIE": "biotools:msp-htprimer",
    "biotoolsID": "msp-htprimer",
    "credit": [
        {
            "email": "ramvinay.pandey@gmail.com",
            "name": "Ram Vinay Pandey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A high-throughput primer design tool to improve assay design for DNA methylation analysis in epigenetics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/msp-htprimer/wiki/MSP-HTPrimer_Manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/msp-htprimer/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "MSP-HTPrimer",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S13148-016-0269-3",
            "metadata": {
                "abstract": "© 2016, The Author(s).Background: Bisulfite (BS) conversion-based and methylation-sensitive restriction enzyme (MSRE)-based PCR methods have been the most commonly used techniques for locus-specific DNA methylation analysis. However, both methods have advantages and limitations. Thus, an integrated approach would be extremely useful to quantify the DNA methylation status successfully with great sensitivity and specificity. Designing specific and optimized primers for target regions is the most critical and challenging step in obtaining the adequate DNA methylation results using PCR-based methods. Currently, no integrated, optimized, and high-throughput methylation-specific primer design software methods are available for both BS- and MSRE-based methods. Therefore an integrated, powerful, and easy-to-use methylation-specific primer design pipeline with great accuracy and success rate will be very useful. Results: We have developed a new web-based pipeline, called MSP-HTPrimer, to design primers pairs for MSP, BSP, pyrosequencing, COBRA, and MSRE assays on both genomic strands. First, our pipeline converts all target sequences into bisulfite-treated templates for both forward and reverse strand and designs all possible primer pairs, followed by filtering for single nucleotide polymorphisms (SNPs) and known repeat regions. Next, each primer pairs are annotated with the upstream and downstream RefSeq genes, CpG island, and cut sites (for COBRA and MSRE). Finally, MSP-HTPrimer selects specific primers from both strands based on custom and user-defined hierarchical selection criteria. MSP-HTPrimer produces a primer pair summary output table in TXT and HTML format for display and UCSC custom tracks for resulting primer pairs in GTF format. Conclusions: MSP-HTPrimer is an integrated, web-based, and high-throughput pipeline and has no limitation on the number and size of target sequences and designs MSP, BSP, pyrosequencing, COBRA, and MSRE assays. It is the only pipeline, which automatically designs primers on both genomic strands to increase the success rate. It is a standalone web-based pipeline, which is fully configured within a virtual machine and thus can be readily used without any configuration. We have experimentally validated primer pairs designed by our pipeline and shown a very high success rate of primer pairs: out of 66 BSP primer pairs, 63 were successfully validated without any further optimization step and using the same qPCR conditions. The MSP-HTPrimer pipeline is freely available from http://sourceforge.net/p/msp-htprimer.",
                "authors": [
                    {
                        "name": "Pandey R.V."
                    },
                    {
                        "name": "Pulverer W."
                    },
                    {
                        "name": "Kallmeyer R."
                    },
                    {
                        "name": "Beikircher G."
                    },
                    {
                        "name": "Pabinger S."
                    },
                    {
                        "name": "Kriegner A."
                    },
                    {
                        "name": "Weinhausel A."
                    }
                ],
                "citationCount": 8,
                "date": "2016-09-21T00:00:00Z",
                "journal": "Clinical Epigenetics",
                "title": "MSP-HTPrimer: a high-throughput primer design tool to improve assay design for DNA methylation analysis in epigenetics"
            },
            "pmcid": "PMC5031341",
            "pmid": "27688817"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}