{
    "additionDate": "2022-09-08T01:47:18.187324Z",
    "biotoolsCURIE": "biotools:hapog",
    "biotoolsID": "hapog",
    "description": "Hapo-G is a tool that aims to improve the quality of genome assemblies by polishing the consensus with accurate reads. It capable of incorporating phasing information from high-quality reads (short or long-reads) to polish genome assemblies and in particular assemblies of diploid and heterozygous genomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "https://github.com/institut-de-genomique/HAPO-G",
    "language": [
        "C",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:31:14.143703Z",
    "license": "CECILL-2.1",
    "name": "Hapo-G",
    "owner": "alexcorm",
    "publication": [
        {
            "doi": "10.1093/nargab/lqab034",
            "metadata": {
                "abstract": "Single-molecule sequencing technologies have recently been commercialized by Pacific Biosciences and Oxford Nanopore with the promise of sequencing long DNA fragments (kilobases to megabases order) and then, using efficient algorithms, provide high quality assemblies in terms of contiguity and completeness of repetitive regions. However, the error rate of long-read technologies is higher than that of short-read technologies. This has a direct consequence on the base quality of genome assemblies, particularly in coding regions where sequencing errors can disrupt the coding frame of genes. In the case of diploid genomes, the consensus of a given gene can be a mixture between the two haplotypes and can lead to premature stop codons. Several methods have been developed to polish genome assemblies using short reads and generally, they inspect the nucleotide one by one, and provide a correction for each nucleotide of the input assembly. As a result, these algorithms are not able to properly process diploid genomes and they typically switch from one haplotype to another. Herein we proposed Hapo-G (Haplotype-Aware Polishing Of Genomes), a new algorithm capable of incorporating phasing information from high-quality reads (short or long-reads) to polish genome assemblies and in particular assemblies of diploid and heterozygous genomes.",
                "authors": [
                    {
                        "name": "Aury J.-M."
                    },
                    {
                        "name": "Istace B."
                    }
                ],
                "citationCount": 38,
                "date": "2021-06-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "Hapo-G, haplotype-Aware polishing of genome assemblies with accurate reads"
            },
            "pmcid": "PMC8092372",
            "pmid": "33987534"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "version": [
        "1.3.7"
    ]
}
