{
    "additionDate": "2017-08-03T18:55:47Z",
    "biotoolsCURIE": "biotools:phylogeosim",
    "biotoolsID": "phylogeosim",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ebe.ulb.ac.be/ebe/People.html"
        }
    ],
    "description": "Simulate the evolution of DNA sequences under a model of coalescence on a 2-dimensional grid in which each cell is treated as one population. Going backward in time, populations can exchange gene copies and/or host coalescence events between two or more gene copies, at each generation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://ebe.ulb.ac.be/ebe/PhyloGeoSim_files/PhyloGeoSim_1.0.beta_manual_060715.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://ebe.ulb.ac.be/ebe/PhyloGeoSim.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phylogeosim-1-0-beta-phylogeographic-simulator.html"
        }
    ],
    "name": "PhyloGeoSim 1.0 beta",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The leaf beetle Chrysomela aeneicollis occurs across Western North America, either at high elevation or in small, isolated populations along the coast, and thus has a highly fragmented distribution. DNA sequence data (three loci) were collected from five regions across the species range. Population connectivity was examined using traditional ecological niche modeling, which suggested that gene flow could occur among regions now and in the past. We developed geographically explicit coalescence models of sequence evolution that incorporated a two-dimensional representation of the hypothesized ranges suggested by the niche-modeling estimates. We simulated sequence data according to these models and compared them to observed sequences to identify most probable scenarios regarding the migration history of C. aeneicollis. Our results disagreed with initial niche-modeling estimates by clearly rejecting recent connectivity among regions, and were instead most consistent with a long period of range fragmentation, extending well beyond the last glacial maximum. This application of geographically explicit models of coalescence has highlighted some limitations of the use of climatic variables for predicting the present and past range of a species and has explained aspects of the Pleistocene evolutionary history of a cold-adapted organism in Western North America. © 2014 The Author(s). Evolution © 2014 The Society for the Study of Evolution..",
                "authors": [
                    {
                        "name": "Dahlhoff E.P."
                    },
                    {
                        "name": "Dellicour S."
                    },
                    {
                        "name": "Fearnley S."
                    },
                    {
                        "name": "Heidl S."
                    },
                    {
                        "name": "Lombal A."
                    },
                    {
                        "name": "Mardulyn P."
                    },
                    {
                        "name": "Rank N.E."
                    }
                ],
                "citationCount": 17,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Evolution",
                "title": "Inferring the past and present connectivity across the range of a north american leaf beetle: Combining ecological niche modeling and a geographically explicit model of coalescence"
            },
            "pmid": "24749775"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
