{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.danmaclean.info/"}],"documentation":[{"url":"https://github.com/richardmleggett/bubbleparse"}],"function":[{"operation":[{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"}]},{"operation":[{"term":"Generation","uri":"http://edamontology.org/operation_3429"}]}],"labels":{"language":["C"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/bubbleparse-detecting-variants-next-generation-reads.html"}],"publication":[{"abstract":"Single Nucleotide Polymorphisms are invaluable markers for tracing the genetic basis of inheritable traits and the ability to create marker libraries quickly is vital for timely identification of target genes. Next-generation sequencing makes it possible to sample a genome rapidly, but polymorphism detection relies on having a reference genome to which reads can be aligned and variants detected. We present Bubbleparse, a method for detecting variants directly from next-generation reads without a reference sequence. Bubbleparse uses the de Bruijn graph implementation in the Cortex framework as a basis and allows the user to identify bubbles in these graphs that represent polymorphisms, quickly, easily and sensitively. We show that the Bubbleparse algorithm is sensitive and can detect many polymorphisms quickly and that it performs well when compared with polymorphism detection methods based on alignment to a reference in Arabidopsis thaliana. We show that the heuristic can be used to maximise the number of true polymorphisms returned, and with a proof-of-principle experiment show that Bubbleparse is very effective on data from unsequenced wild relatives of potato and enabled us to identify disease resistance linked genes quickly and easily. © 2013 Leggett et al.","authors":["Leggett R.M.","Ramirez-Gonzalez R.H.","Verweij W.","Kawashima C.G.","Iqbal Z.","Jones J.D.G.","Caccamo M.","MacLean D."],"cit_count":10,"doi":"10.1371/journal.pone.0060058","journal":"PLoS ONE","title":"Identifying and Classifying Trait Linked Polymorphisms in Non-Reference Species by Walking Coloured de Bruijn Graphs","type":"Primary","year":"2013-03-25"}],"summary":{"biotoolsCURIE":"biotools:bubbleparse","biotoolsID":"bubbleparse","description":"A method for detecting variants directly from next-generation reads without a reference sequence. It uses the de Bruijn graph implementation in the Cortex framework as a basis and allows the user to identify bubbles in these graphs that represent polymorphisms, quickly, easily and sensitively.","homepage":"http://www.tgac.ac.uk/bubbleparse/","name":"Bubbleparse"}}