{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T09:46:15Z",
    "biotoolsCURIE": "biotools:drug-herb-interaction",
    "biotoolsID": "drug-herb-interaction",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cswu@nfu.edu.tw",
            "name": "Chang-Shiann Wu",
            "typeEntity": "Person"
        },
        {
            "email": "thwu@tmu.edu.tw",
            "name": "Tzu-Hua Wu",
            "orcidid": "https://orcid.org/0000-0002-3631-6248",
            "typeEntity": "Person"
        }
    ],
    "description": "A constructing a bilingual website with validated database for Herb and Western medicine interactions using Ginseng, Ginkgo and Dong Quai as examples.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://drug-herb-interaction.netlify.com",
    "lastUpdate": "2021-01-06T20:11:42.812674Z",
    "name": "Drug-herb-interaction",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12906-019-2731-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Concerns have been raised regarding the efficacy and safety resulting from the potential interactions of herbs with Western medications due to the use of both herbs and Western medicine by the general public. Information obtained from the web must be critically evaluated prior to its use in making decisions. Description: This study aimed to construct an herb-drug interaction (HDI) website (https://drug-herb-interaction.netlify.com) with a critically reviewed database. Node.js was used to store the database by running JavaScript. Vue.js is a front-end framework used for web interface development. A total of 135 sets of information related to the interactions of ginseng, ginkgo and dong quai with Western medicine from the literature identified in Medline were collected, followed by critical reviews to prepare nineteen items of information for each HDI monograph. A total of 80 sets of validated HDIs met all criteria and were further assessed at the individual reliability level (likely, possible, and unevaluable) and labeled with the \"interaction\" item. This query system of the website can be operated in both the Chinese and English languages to obtain all monographs on HDIs in the database, including bilingual interaction data. The database of HDI monographs can be updated by simply uploading a new version of the information Excel file. The designed \"smart search\" module, in addition to the \"single search\", is convenient for requesting multiple searches. Among the \"likely\" interactions (n = 26), 50% show negative HDIs. Ten of these can increase the effect of the Western drug, and the others (n = 3) imply that the HDI can be beneficial. Conclusions: The current study provides a website platform and 80 sets of validated bilingual HDIs involving ginseng, ginkgo and dong quai in an online database. A search of HDI monographs related to these three herbs can be performed with this bilingual, easy-to-use query website, which is feasible for professionals and the general public. The identified reliability level for each HDI may assist readers' decisions regarding whether taking Western medications concomitant with one of three herbal medicinal foods is safe or whether caution is required due to potentially serious outcomes.",
                "authors": [
                    {
                        "name": "Wu C.-S."
                    },
                    {
                        "name": "Chen Y.-H."
                    },
                    {
                        "name": "Chen C.-L."
                    },
                    {
                        "name": "Chien S.-K."
                    },
                    {
                        "name": "Syifa N."
                    },
                    {
                        "name": "Hung Y.-C."
                    },
                    {
                        "name": "Cheng K.-J."
                    },
                    {
                        "name": "Hu S.-C."
                    },
                    {
                        "name": "Lo P.-T."
                    },
                    {
                        "name": "Lin S.-Y."
                    },
                    {
                        "name": "Wu T.-H."
                    }
                ],
                "date": "2019-11-27T00:00:00Z",
                "journal": "BMC Complementary and Alternative Medicine",
                "title": "Constructing a bilingual website with validated database for Herb and Western medicine interactions using Ginseng, Ginkgo and Dong Quai as examples"
            },
            "pmcid": "PMC6881993",
            "pmid": "31775730"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}