{
    "additionDate": "2017-03-27T07:56:30Z",
    "biotoolsCURIE": "biotools:ddbj",
    "biotoolsID": "ddbj",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ddbj.nig.ac.jp/addresses-e.html"
        }
    ],
    "description": "Nucleotide sequence archive database and accompanying database tools for sequence submission, entry retrieval and annotation analysis. A new archive for quantitative genomics data, the DDBJ Omics aRchive (DOR). The DOR stores quantitative data both from the microarray and high-throughput new sequencing platforms. Other improvements include improved content of the patent sequence, released a new submission tool of the Sequence Read Archive (DRA) and the Read Annotation Pipeline.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.ddbj.nig.ac.jp/ddbjingtop-e.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.ddbj.nig.ac.jp/intro-e.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.ddbj.nig.ac.jp",
    "lastUpdate": "2021-04-17T18:32:39Z",
    "name": "DDBJ",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_002359"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The DNA Data Bank of Japan (DDBJ, http://www .ddbj.nig.ac.jp) provides a nucleotide sequence archive database and accompanying database tools for sequence submission, entry retrieval and annotation analysis. The DDBJ collected and released 3 637 446 entries/2 272 231 889 bases between July 2009 and June 2010. A highlight of the released data was archive datasets from next-generation sequencing reads of Japanese rice cultivar, Koshihikari submitted by the National Institute of Agrobiological Sciences. In this period, we started a new archive for quantitative genomics data, the DDBJ Omics aRchive (DOR). The DOR stores quantitative data both from the microarray and high-throughput new sequencing platforms. Moreover, we improved the content of the DDBJ patent sequence, released a new submission tool of the DDBJ Sequence Read Archive (DRA) which archives massive raw sequencing reads, and enhanced a cloud computing-based analytical system from sequencing reads, the DDBJ Read Annotation Pipeline. In this article, we describe these new functions of the DDBJ databases and support tools. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Kaminuma E."
                    },
                    {
                        "name": "Kosuge T."
                    },
                    {
                        "name": "Kodama Y."
                    },
                    {
                        "name": "Aono H."
                    },
                    {
                        "name": "Mashima J."
                    },
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Sugawara H."
                    },
                    {
                        "name": "Ogasawara O."
                    },
                    {
                        "name": "Takagi T."
                    },
                    {
                        "name": "Okubo K."
                    },
                    {
                        "name": "Nakamura Y."
                    }
                ],
                "citationCount": 37,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DDBJ progress report"
            },
            "pmid": "21062814"
        },
        {
            "metadata": {
                "abstract": "The DNA Data Bank of Japan (DDBJ) (http://www.ddbj.nig.ac.jp) has collected and released 1 701 110 entries/1 116 138 614 bases between July 2008 and June 2009. A few highlighted data releases from DDBJ were the complete genome sequence of an endosymbiont within protist cells in the termite gut and Cap Analysis Gene Expression tags for human and mouse deposited from the Functional Annotation of the Mammalian cDNA consortium. In this period, we started a novel user announcement service using Really Simple Syndication (RSS) to deliver a list of data released from DDBJ on a daily basis. Comprehensive visualization of a DDBJ release data was attempted by using a word cloud program. Moreover, a new archive for sequencing data from next-generation sequencers, the 'DDBJ Read Archive'(DRA), was launched. Concurrently, for read data registered in DRA, a semi-automatic annotation tool called the 'DDBJ Read Annotation Pipeline' was released as a preliminary step. The pipeline consists of two parts: basic analysis for reference genome mapping and de novo assembly and high-level analysis of structural and functional annotations. These new services will aid users' research and provide easier access to DDBJ databases. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Kaminuma E."
                    },
                    {
                        "name": "Mashima J."
                    },
                    {
                        "name": "Kodama Y."
                    },
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Ogasawara O."
                    },
                    {
                        "name": "Okubo K."
                    },
                    {
                        "name": "Takagi T."
                    },
                    {
                        "name": "Nakamura Y."
                    }
                ],
                "citationCount": 59,
                "date": "2009-10-22T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DDBJ launches a new archive database with analytical tools for next-generation sequence data"
            },
            "pmid": "19850725"
        },
        {
            "metadata": {
                "abstract": "The DNA Data Bank of Japan (DDBJ; http://www .ddbj.nig.ac.jp) maintains and provides archival, retrieval and analytical resources for biological information. The central DDBJ resource consists of public, open-access nucleotide sequence databases including raw sequence reads, assembly information and functional annotation. Database content is exchanged with EBI and NCBI within the framework of the International Nucleotide Sequence Database Collaboration (INSDC). In 2011, DDBJ launched two new resources: the 'DDBJ Omics Archive' (DOR; http://trace.ddbj.nig.ac.jp/dor) and BioProject (http://trace.ddbj.nig.ac.jp/bioproject). DOR is an archival database of functional genomics data generated by microarray and highly parallel new generation sequencers. Data are exchanged between the ArrayExpress at EBI and DOR in the common MAGE-TAB format. BioProject provides an organizational framework to access metadata about research projects and the data from the projects that are deposited into different databases. In this article, we describe major changes and improvements introduced to the DDBJ services, and the launch of two new resources: DOR and BioProject. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Kodama Y."
                    },
                    {
                        "name": "Mashima J."
                    },
                    {
                        "name": "Kaminuma E."
                    },
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Ogasawara O."
                    },
                    {
                        "name": "Takagi T."
                    },
                    {
                        "name": "Okubo K."
                    },
                    {
                        "name": "Nakamura Y."
                    }
                ],
                "citationCount": 33,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The DNA Data Bank of Japan launches a new resource, the DDBJ Omics Archive of functional genomics experiments"
            },
            "pmid": "22110025"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}