{
    "accessibility": "Open access",
    "additionDate": "2022-05-12T12:24:16.828628Z",
    "biotoolsCURIE": "biotools:entropyhub",
    "biotoolsID": "entropyhub",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "matthew.flood@lih.lu",
            "name": "Matthew W. Flood",
            "orcidid": "https://orcid.org/0000-0002-5674-424X",
            "typeEntity": "Person"
        },
        {
            "name": "Bernd Grimm"
        }
    ],
    "description": "An open-source toolkit for entropic time-series analysis.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/MattWillFlood/EntropyHub/tree/main/EntropyHub%20-%20MatLab"
        },
        {
            "type": "Source code",
            "url": "https://github.com/MattWillFlood/EntropyHub/tree/main/EntropyHub%20-%20Python"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "http://www.EntropyHub.xyz",
    "language": [
        "Julia",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2022-05-12T12:24:16.831515Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://MattWillFlood.github.io/EntropyHub"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.github.com/MattWillFlood/EntropyHub"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MattWillFlood/EntropyHub.jl"
        }
    ],
    "name": "EntropyHub",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0259448",
            "metadata": {
                "abstract": "Copyright: © 2021 Flood, Grimm. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.An increasing number of studies across many research fields from biomedical engineering to finance are employing measures of entropy to quantify the regularity, variability or randomness of time series and image data. Entropy, as it relates to information theory and dynamical systems theory, can be estimated in many ways, with newly developed methods being continuously introduced in the scientific literature. Despite the growing interest in entropic time series and image analysis, there is a shortage of validated, open-source software tools that enable researchers to apply these methods. To date, packages for performing entropy analysis are often run using graphical user interfaces, lack the necessary supporting documentation, or do not include functions for more advanced entropy methods, such as cross-entropy, multiscale cross-entropy or bidimensional entropy. In light of this, this paper introduces EntropyHub, an open-source toolkit for performing entropic time series analysis in MATLAB, Python and Julia. EntropyHub (version 0.1) provides an extensive range of more than forty functions for estimating cross-, multiscale, multiscale cross-, and bidimensional entropy, each including a number of keyword arguments that allows the user to specify multiple parameters in the entropy calculation. Instructions for installation, descriptions of function syntax, and examples of use are fully detailed in the supporting documentation, available on the EntropyHub website– www.EntropyHub.xyz. Compatible with Windows, Mac and Linux operating systems, EntropyHub is hosted on GitHub, as well as the native package repository for MATLAB, Python and Julia, respectively. The goal of EntropyHub is to integrate the many established entropy methods into one complete resource, providing tools that make advanced entropic time series analysis straightforward and reproducible.",
                "authors": [
                    {
                        "name": "Flood M.W."
                    },
                    {
                        "name": "Grimm B."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "EntropyHub: An open-source toolkit for entropic time series analysis"
            },
            "pmcid": "PMC8568273",
            "pmid": "34735497"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
