
{
    "credit": [
        {
            "email": "marco.antoniotti@disco.unimib.it",
            "name": "marco antoniotti",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bimib.disco.unimib.it/"
        }
    ],
    "documentation": [
        {
            "url": "http://bimib.disco.unimib.it/images/7/77/CABERNET_user_manual_v3.pdf"
        },
        {
            "type": "TRAINING_MATERIAL",
            "url": "http://bimib.disco.unimib.it/index.php/CABERNET_TUTORIAL"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/cabernet-a-cytoscape-app-for-augmented-boolean-models-of-gene-regulatory-networks.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 Paroni et al. Background: Dynamical models of gene regulatory networks (GRNs) are highly effective in describing complex biological phenomena and processes, such as cell differentiation and cancer development. Yet, the topological and functional characterization of real GRNs is often still partial and an exhaustive picture of their functioning is missing. Results: We here introduce CABeRNET, a Cytoscape app for the generation, simulation and analysis of Boolean models of GRNs, specifically focused on their augmentation when a only partial topological and functional characterization of the network is available. By generating large ensembles of networks in which user-defined entities and relations are added to the original core, CABeRNET allows to formulate hypotheses on the missing portions of real networks, as well to investigate their generic properties, in the spirit of complexity science. Conclusions:CABeRNET offers a series of innovative simulation and modeling functions and tools, including (but not being limited to) the dynamical characterization of the gene activation patterns ruling cell types and differentiation fates, and sophisticated robustness assessments, as in the case of gene knockouts. The integration within the widely used Cytoscape framework for the visualization and analysis of biological networks, makes CABeRNET a new essential instrument for both the bioinformatician and the computational biologist, as well as a computational support for the experimentalist. An example application concerning the analysis of an augmented T-helper cell GRN is provided.",
            "authors": [
                "Paroni A.",
                "Graudenzi A.",
                "Caravagna G.",
                "Damiani C.",
                "Mauri G.",
                "Antoniotti M."
            ],
            "cit_count": 9,
            "journal": "BMC Bioinformatics",
            "pmid": "26846964",
            "title": "CABeRNET: A Cytoscape app for augmented Boolean models of gene regulatory NETworks",
            "year": "2016-02-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cabernet",
        "biotoolsID": "cabernet",
        "description": "A Cytoscape 3.2.0 app for the generation, the simulation, the analysis and the visualization of Boolean models of gene regulatory networks, particularly focused on the investigation of their robustness.",
        "homepage": "http://bimib.disco.unimib.it/index.php/CABERNET",
        "name": "CABERNET"
    }
}