{
    "accessibility": "Open access",
    "additionDate": "2024-02-26T10:34:45.282577Z",
    "biotoolsCURIE": "biotools:hmdb_faa",
    "biotoolsID": "hmdb_faa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tingma@nankai.edu.cn",
            "name": "Ting Ma",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Shaojing Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A curated database of genes involved in hydrocarbon monooxygenation reaction with homologous genes as background.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.orgene.net/HMDB/",
    "lastUpdate": "2024-02-26T10:34:45.285263Z",
    "name": "HMDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JHAZMAT.2023.132397",
            "metadata": {
                "abstract": "The investigation of hydrocarbon degradation potential of environmental microorganisms is an important research topic, whether for the global carbon cycle or oil pollution remediation. Under aerobic conditions, the microorganisms employ a range of monooxygenases to use hydrocarbons substrates as a source of carbon and energy. With the explosion of sequencing data, mining genes in genomes or metagenomes has become computationally expensive and time-consuming. We proposed the HMDB, which is a professional gene database of hydrocarbon monooxygenases. HMDB contains 38 genes, which encode 11 monooxygenases responsible for the hydroxylation of 8 hydrocarbons. To reduce false positives, the strategy of using homologous genes as background noise was applied for HMDB. We added 10,095 gene sequences of homologous enzymes which took non-hydrocarbons as substrates to HMDB. The classic BLAST method and best-hit strategy were recommended for HMDB usage, but not limited. The performance of HMDB was validated using 264,402 prokaryote genomes from RefSeq and 51 metagenomes from SRA. The results showed that HMDB database had high sensitivity and low false positive rate. We release the HMDB database here, hoping to speed up the process for investigation of hydrocarbon monooxygenases in massive metagenomic data. HMDB is freely available at http://www.orgene.net/HMDB/.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Liao Z."
                    },
                    {
                        "name": "Ma T."
                    },
                    {
                        "name": "Su Z."
                    },
                    {
                        "name": "Tian X."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Yun Y."
                    }
                ],
                "date": "2023-10-15T00:00:00Z",
                "journal": "Journal of Hazardous Materials",
                "title": "HMDB: A curated database of genes involved in hydrocarbon monooxygenation reaction with homologous genes as background"
            },
            "pmid": "37639797"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}
