{
    "accessibility": "Open access",
    "additionDate": "2023-02-25T13:22:23.617281Z",
    "biotoolsCURIE": "biotools:ggmob",
    "biotoolsID": "ggmob",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nnoyes@umn.edu",
            "name": "Noelle R. Noyes",
            "typeEntity": "Person"
        }
    ],
    "description": "Elucidation of genomic conjugative features and associated cargo genes across bacterial genera using genus-genus mobilization networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        }
    ],
    "homepage": "https://ruiz-hci-lab.github.io/ggMOB/",
    "lastUpdate": "2023-02-25T13:22:23.619969Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Ruiz-HCI-Lab/ggMOB"
        }
    ],
    "name": "ggMOB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.1024577",
            "metadata": {
                "abstract": "Copyright © 2022 Nayar, Terrizzano, Seabolt, Agarwal, Boucher, Ruiz, Slizovskiy, Kaufman and Noyes.Horizontal gene transfer mediated by conjugation is considered an important evolutionary mechanism of bacteria. It allows organisms to quickly evolve new phenotypic properties including antimicrobial resistance (AMR) and virulence. The frequency of conjugation-mediated cargo gene exchange has not yet been comprehensively studied within and between bacterial taxa. We developed a frequency-based network of genus-genus conjugation features and candidate cargo genes from whole-genome sequence data of over 180,000 bacterial genomes, representing 1,345 genera. Using our method, which we refer to as ggMOB, we revealed that over half of the bacterial genomes contained one or more known conjugation features that matched exactly to at least one other genome. Moreover, the proportion of genomes containing these conjugation features varied substantially by genus and conjugation feature. These results and the genus-level network structure can be viewed interactively in the ggMOB interface, which allows for user-defined filtering of conjugation features and candidate cargo genes. Using the network data, we observed that the ratio of AMR gene representation in conjugative versus non-conjugative genomes exceeded 5:1, confirming that conjugation is a critical force for AMR spread across genera. Finally, we demonstrated that clustering genomes by conjugation profile sometimes correlated well with classical phylogenetic structuring; but that in some cases the clustering was highly discordant, suggesting that the importance of the accessory genome in driving bacterial evolution may be highly variable across both time and taxonomy. These results can advance scientific understanding of bacterial evolution, and can be used as a starting point for probing genus-genus gene exchange within complex microbial communities that include unculturable bacteria. ggMOB is publicly available under the GNU licence at https://ruiz-hci-lab.github.io/ggMOB/.",
                "authors": [
                    {
                        "name": "Agarwal A."
                    },
                    {
                        "name": "Boucher C."
                    },
                    {
                        "name": "Kaufman J.H."
                    },
                    {
                        "name": "Nayar G."
                    },
                    {
                        "name": "Noyes N.R."
                    },
                    {
                        "name": "Ruiz J."
                    },
                    {
                        "name": "Seabolt E."
                    },
                    {
                        "name": "Slizovskiy I.B."
                    },
                    {
                        "name": "Terrizzano I."
                    }
                ],
                "date": "2022-12-08T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "ggMOB: Elucidation of genomic conjugative features and associated cargo genes across bacterial genera using genus-genus mobilization networks"
            },
            "pmcid": "PMC9779932",
            "pmid": "36568361"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
