{
    "accessibility": "Open access",
    "additionDate": "2019-05-28T10:16:20Z",
    "biotoolsCURIE": "biotools:CHARMM-GUI",
    "biotoolsID": "CHARMM-GUI",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.charmm-gui.org/?doc=contact"
        }
    ],
    "description": "Membrane Builder for Complex Biological Membrane Simulations with Glycolipids and Lipoglycans.",
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://www.charmm-gui.org",
    "lastUpdate": "2022-07-12T14:20:48.848121Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "CHARMM-GUI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1002/jcc.23702",
            "metadata": {
                "abstract": "© 2014 Wiley Periodicals, Inc.CHARMM-GUI Membrane Builder, http://www.charmm-gui.org/input/membrane, is a web-based user interface designed to interactively build all-atom protein/membrane or membrane-only systems for molecular dynamics simulations through an automated optimized process. In this work, we describe the new features and major improvements in Membrane Builder that allow users to robustly build realistic biological membrane systems, including (1) addition of new lipid types, such as phosphoinositides, cardiolipin (CL), sphingolipids, bacterial lipids, and ergosterol, yielding more than 180 lipid types, (2) enhanced building procedure for lipid packing around protein, (3) reliable algorithm to detect lipid tail penetration to ring structures and protein surface, (4) distance-based algorithm for faster initial ion displacement, (5) CHARMM inputs for P21 image transformation, and (6) NAMD equilibration and production inputs. The robustness of these new features is illustrated by building and simulating a membrane model of the polar and septal regions of E. coli membrane, which contains five lipid types: CL lipids with two types of acyl chains and phosphatidylethanolamine lipids with three types of acyl chains. It is our hope that CHARMM-GUI Membrane Builder becomes a useful tool for simulation studies to better understand the structure and dynamics of proteins and lipids in realistic biological membrane environments.",
                "authors": [
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Davila-Contreras E.M."
                    },
                    {
                        "name": "Im W."
                    },
                    {
                        "name": "Jo S."
                    },
                    {
                        "name": "Klauda J.B."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Monje-Galvan V."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "Rui H."
                    },
                    {
                        "name": "Song K.C."
                    },
                    {
                        "name": "Venable R.M."
                    },
                    {
                        "name": "Wu E.L."
                    }
                ],
                "citationCount": 1008,
                "date": "2014-10-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "CHARMM-GUI membrane builder toward realistic biological membrane simulations"
            },
            "pmid": "25130509"
        },
        {
            "doi": "10.1021/acs.jctc.5b00935",
            "metadata": {
                "abstract": "© 2015 American Chemical Society.Proper treatment of nonbonded interactions is essential for the accuracy of molecular dynamics (MD) simulations, especially in studies of lipid bilayers. The use of the CHARMM36 force field (C36 FF) in different MD simulation programs can result in disagreements with published simulations performed with CHARMM due to differences in the protocols used to treat the long-range and 1-4 nonbonded interactions. In this study, we systematically test the use of the C36 lipid FF in NAMD, GROMACS, AMBER, OpenMM, and CHARMM/OpenMM. A wide range of Lennard-Jones (LJ) cutoff schemes and integrator algorithms were tested to find the optimal simulation protocol to best match bilayer properties of six lipids with varying acyl chain saturation and head groups. MD simulations of a 1,2-dipalmitoyl-sn-phosphatidylcholine (DPPC) bilayer were used to obtain the optimal protocol for each program. MD simulations with all programs were found to reasonably match the DPPC bilayer properties (surface area per lipid, chain order parameters, and area compressibility modulus) obtained using the standard protocol used in CHARMM as well as from experiments. The optimal simulation protocol was then applied to the other five lipid simulations and resulted in excellent agreement between results from most simulation programs as well as with experimental data. AMBER compared least favorably with the expected membrane properties, which appears to be due to its use of the hard-truncation in the LJ potential versus a force-based switching function used to smooth the LJ potential as it approaches the cutoff distance. The optimal simulation protocol for each program has been implemented in CHARMM-GUI. This protocol is expected to be applicable to the remainder of the additive C36 FF including the proteins, nucleic acids, carbohydrates, and small molecules.",
                "authors": [
                    {
                        "name": "Brooks C.L."
                    },
                    {
                        "name": "Buckner J."
                    },
                    {
                        "name": "Case D.A."
                    },
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Eastman P.K."
                    },
                    {
                        "name": "Im W."
                    },
                    {
                        "name": "Jeong J.C."
                    },
                    {
                        "name": "Jo S."
                    },
                    {
                        "name": "Klauda J.B."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Lemkul J.A."
                    },
                    {
                        "name": "MacKerell A.D."
                    },
                    {
                        "name": "Pande V.S."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "Swails J.M."
                    },
                    {
                        "name": "Wei S."
                    },
                    {
                        "name": "Yeom M.S."
                    }
                ],
                "citationCount": 1197,
                "date": "2016-01-12T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "CHARMM-GUI Input Generator for NAMD, GROMACS, AMBER, OpenMM, and CHARMM/OpenMM Simulations Using the CHARMM36 Additive Force Field"
            },
            "pmid": "26631602"
        },
        {
            "doi": "10.1021/acs.jctc.8b01066",
            "metadata": {
                "abstract": "© 2018 American Chemical Society.Glycolipids (such as glycoglycerolipids, glycosphingolipids, and glycosylphosphatidylinositol) and lipoglycans (such as lipopolysaccharides (LPS), lipooligosaccharides (LOS), mycobacterial lipoarabinomannan, and mycoplasma lipoglycans) are typically found on the surface of cell membranes and play crucial roles in various cellular functions. Characterizing their structure and dynamics at the molecular level is essential to understand their biological roles, but systematic generation of glycolipid and lipoglycan structures is challenging because of great variations in lipid structures and glycan sequences (i.e., carbohydrate types and their linkages). To facilitate the generation of all-atom glycolipid/LPS/LOS structures, we have developed Glycolipid Modeler and LPS Modeler in CHARMM-GUI (http://www.charmm-gui.org), a web-based interface that simplifies building of complex biological simulation systems. In addition, we have incorporated these modules into Membrane Builder so that users can readily build a complex symmetric or asymmetric biological membrane system with various glycolipids and LPS/LOS. These tools are expected to be useful in innovative and novel glycolipid/LPS/LOS modeling and simulation research by easing tedious and intricate steps in modeling complex biological systems and shall provide insight into structures, dynamics, and underlying mechanisms of complex glycolipid-/LPS-/LOS-containing biological membrane systems.",
                "authors": [
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Holst O."
                    },
                    {
                        "name": "Im W."
                    },
                    {
                        "name": "Jo S."
                    },
                    {
                        "name": "Kern N.R."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Klauda J.B."
                    },
                    {
                        "name": "Knirel Y.A."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Park S.-J."
                    },
                    {
                        "name": "Patel D.S."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "Stahle J."
                    },
                    {
                        "name": "Valvano M.A."
                    },
                    {
                        "name": "Widmalm G."
                    }
                ],
                "citationCount": 155,
                "date": "2019-01-08T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "CHARMM-GUI Membrane Builder for Complex Biological Membrane Simulations with Glycolipids and Lipoglycans"
            },
            "pmid": "30525595"
        },
        {
            "doi": "10.1002/jcc.20945",
            "metadata": {
                "abstract": "CHARMM is an academic research program used widely for macromolecular mechanics and dynamics with versatile analysis and manipulation tools of atomic coordinates and dynamics trajectories. CHARMM-GUI, http://www.charmm-gui.org, has been developed to provide a web-based graphical user interface to generate various input files and molecular systems to facilitate and standardize the usage of common and advanced simulation techniques in CHARMM. The web environment provides an ideal platform to build and validate a molecular model system in an interactive fashion such that, if a problem is found through visual inspection, one can go back to the previous setup and regenerate the whole system again. In this article, we describe the currently available functional modules of CHARMM-GUI Input Generator that form a basis for the advanced simulation techniques. Future directions of the CHARMM-GUI development project are also discussed briefly together with other features in the CHARMM-GUI website, such as Archive and Movie Gallery. © 2008 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Im W."
                    },
                    {
                        "name": "Iyer V.G."
                    },
                    {
                        "name": "Jo S."
                    },
                    {
                        "name": "Kim T."
                    }
                ],
                "citationCount": 2788,
                "date": "2008-08-01T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "CHARMM-GUI: A web-based graphical user interface for CHARMM"
            },
            "pmid": "18351591",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
