{"credit":[{"typeEntity":"Project","typeRoles":["Primary contact"],"url":"http://www.charmm-gui.org/?doc=contact"}],"function":[{"operation":[{"term":"Post-translation modification site prediction","uri":"http://edamontology.org/operation_0417"},{"term":"Molecular dynamics","uri":"http://edamontology.org/operation_2476"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","license":"Unlicense","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Lipids","uri":"http://edamontology.org/topic_0153"},{"term":"Carbohydrates","uri":"http://edamontology.org/topic_0152"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"}]},"publication":[{"abstract":"© 2018 American Chemical Society. Glycolipids (such as glycoglycerolipids, glycosphingolipids, and glycosylphosphatidylinositol) and lipoglycans (such as lipopolysaccharides (LPS), lipooligosaccharides (LOS), mycobacterial lipoarabinomannan, and mycoplasma lipoglycans) are typically found on the surface of cell membranes and play crucial roles in various cellular functions. Characterizing their structure and dynamics at the molecular level is essential to understand their biological roles, but systematic generation of glycolipid and lipoglycan structures is challenging because of great variations in lipid structures and glycan sequences (i.e., carbohydrate types and their linkages). To facilitate the generation of all-atom glycolipid/LPS/LOS structures, we have developed Glycolipid Modeler and LPS Modeler in CHARMM-GUI (http://www.charmm-gui.org), a web-based interface that simplifies building of complex biological simulation systems. In addition, we have incorporated these modules into Membrane Builder so that users can readily build a complex symmetric or asymmetric biological membrane system with various glycolipids and LPS/LOS. These tools are expected to be useful in innovative and novel glycolipid/LPS/LOS modeling and simulation research by easing tedious and intricate steps in modeling complex biological systems and shall provide insight into structures, dynamics, and underlying mechanisms of complex glycolipid-/LPS-/LOS-containing biological membrane systems.","authors":["Lee J.","Patel D.S.","Stahle J.","Park S.-J.","Kern N.R.","Kim S.","Lee J.","Cheng X.","Valvano M.A.","Holst O.","Knirel Y.A.","Qi Y.","Jo S.","Klauda J.B.","Widmalm G.","Im W."],"cit_count":3,"doi":"10.1021/acs.jctc.8b01066","journal":"Journal of Chemical Theory and Computation","pmid":"30525595","title":"CHARMM-GUI Membrane Builder for Complex Biological Membrane Simulations with Glycolipids and Lipoglycans","type":"Primary","year":"2019-01-08"}],"summary":{"biotoolsCURIE":"biotools:CHARMM-GUI","biotoolsID":"CHARMM-GUI","description":"Membrane Builder for Complex Biological Membrane Simulations with Glycolipids and Lipoglycans.","homepage":"http://www.charmm-gui.org","name":"CHARMM-GUI"}}