{
    "accessibility": "Open access",
    "additionDate": "2023-01-25T22:53:28.429731Z",
    "biotoolsCURIE": "biotools:smallareamapp",
    "biotoolsID": "smallareamapp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jonathan.simkin@bccancer.bc.ca",
            "name": "Jonathan Simkin",
            "typeEntity": "Person"
        },
        {
            "name": "Gina Ogilvie"
        },
        {
            "name": "Ryan R Woods"
        },
        {
            "name": "Trevor J B Dummer"
        }
    ],
    "description": "Small area disease mapping of cancer incidence in British Columbia using Bayesian spatial models and the smallareamapp R Package.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jdsimkin04/smallareamapp",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:09:24.894368Z",
    "license": "MIT",
    "name": "smallareamapp",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fonc.2022.833265",
            "metadata": {
                "abstract": "Introduction: There is an increasing interest in small area analyses in cancer surveillance; however, technical capacity is limited and accessible analytical approaches remain to be determined. This study demonstrates an accessible approach for small area cancer risk estimation using Bayesian hierarchical models and data visualization through the smallareamapp R package. Materials and methods: Incident lung (N = 26,448), female breast (N = 28,466), cervical (N = 1,478), and colorectal (N = 25,457) cancers diagnosed among British Columbia (BC) residents between 2011 and 2018 were obtained from the BC Cancer Registry. Indirect age-standardization was used to derive age-adjusted expected counts and standardized incidence ratios (SIRs) relative to provincial rates. Moran’s I was used to assess the strength and direction of spatial autocorrelation. A modified Besag, York and Mollie model (BYM2) was used for model incidence counts to calculate posterior median relative risks (RR) by Community Health Service Areas (CHSA; N = 218), adjusting for spatial dependencies. Integrated Nested Laplace Approximation (INLA) was used for Bayesian model implementation. Areas with exceedance probabilities (above a threshold RR = 1.1) greater or equal to 80% were considered to have an elevated risk. The posterior median and 95% credible intervals (CrI) for the spatially structured effect were reported. Predictive posterior checks were conducted through predictive integral transformation values and observed versus fitted values. Results: The proportion of variance in the RR explained by a spatial effect ranged from 4.4% (male colorectal) to 19.2% (female breast). Lung cancer showed the greatest number of CHSAs with elevated risk (Nwomen = 50/218, Nmen = 44/218), representing 2357 total excess cases. The largest lung cancer RRs were 1.67 (95% CrI = 1.06–2.50; exceedance probability = 96%; cases = 13) among women and 2.49 (95% CrI = 2.14–2.88; exceedance probability = 100%; cases = 174) among men. Areas with small population sizes and extreme SIRs were generally smoothed towards the null (RR = 1.0). Discussion: We present a ready-to-use approach for small area cancer risk estimation and disease mapping using BYM2 and exceedance probabilities. We developed the smallareamapp R package, which provides a user-friendly interface through an R-Shiny application, for epidemiologists and surveillance experts to examine geographic variation in risk. These methods and tools can be used to estimate risk, generate hypotheses, and examine ecologic associations while adjusting for spatial dependency.",
                "authors": [
                    {
                        "name": "Dummer T.J.B."
                    },
                    {
                        "name": "Erickson A.C."
                    },
                    {
                        "name": "Ogilvie G."
                    },
                    {
                        "name": "Otterstatter M.C."
                    },
                    {
                        "name": "Simkin J."
                    },
                    {
                        "name": "Woods R.R."
                    }
                ],
                "citationCount": 2,
                "date": "2022-10-19T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "Small area disease mapping of cancer incidence in British Columbia using Bayesian spatial models and the smallareamapp R Package"
            },
            "pmcid": "PMC9627310",
            "pmid": "36338766"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
