{
    "additionDate": "2020-01-14T19:35:20Z",
    "biotoolsCURIE": "biotools:RNAactDrug",
    "biotoolsID": "RNAactDrug",
    "confidence_flag": "tool",
    "description": "a comprehensive database of RNAs associated with drug sensitivity from multi-omics data.\n\nRNAactDrug a comprehensive database of RNAs associated with Drug sensitivity from multi-omics data.\n\nRNAactDrug is a comprehensive resource for querying associations between drug sensitivity and RNA molecules including mRNAs, lncRNAs and miRNAs at four molecular levels (expression, copy number variation, mutation and methylation) from integrated analysis of three large-scale pharmacogenomic databases (GDSC, CellMiner and CCLE). Currently, RNAactDrug contains more than 4924200 RNA molecules-drug sensitivity associations at multidimensional molecular levels covering more than 19770 mRNAs, 11119 lncRNAs, 438 miRNAs and 4155 drugs. RNAactDrug aims to help make use of the full breadth and depth of existing large-scale pharmacogenomic data by making this knowledge accessible to both basic researchers",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://bio-bigdata.hrbmu.edu.cn/RNAactDrug",
    "lastUpdate": "2020-12-14T08:07:04Z",
    "name": "RNAactDrug",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ142",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Drug sensitivity has always been at the core of individualized cancer chemotherapy. However, we have been overwhelmed by large-scale pharmacogenomic data in the era of next-generation sequencing technology, which makes it increasingly challenging for researchers, especially those without bioinformatic experience, to perform data integration, exploration and analysis. To bridge this gap, we developed RNAactDrug, a comprehensive database of RNAs associated with drug sensitivity from multi-omics data, which allows users to explore drug sensitivity and RNA molecule associations directly. It provides association data between drug sensitivity and RNA molecules including mRNAs, long non-coding RNAs (lncRNAs) and microRNAs (miRNAs) at four molecular levels (expression, copy number variation, mutation and methylation) from integrated analysis of three large-scale pharmacogenomic databases (GDSC, CellMiner and CCLE). RNAactDrug currently stores more than 4 924 200 associations of RNA molecules and drug sensitivity at four molecular levels covering more than 19 770 mRNAs, 11 119 lncRNAs, 438 miRNAs and 4155 drugs. A user-friendly interface enriched with various browsing sections augmented with advance search facility for querying the database is offered for users retrieving. RNAactDrug provides a comprehensive resource for RNA molecules acting in drug sensitivity, and it could be used to prioritize drug sensitivity-related RNA molecules, further promoting the identification of clinically actionable biomarkers in drug sensitivity and drug development more cost-efficiently by making this knowledge accessible to both basic researchers and clinical practitioners. Database URL: http://bio-bigdata.hrbmu.edu.cn/RNAactDrug.",
                "authors": [
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Mi K."
                    },
                    {
                        "name": "Shang D."
                    },
                    {
                        "name": "Tian Z."
                    },
                    {
                        "name": "Xiao J."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "RNAactDrug: A comprehensive database of RNAs associated with drug sensitivity from multi-omics data"
            },
            "pmid": "31799597"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
