{
    "accessibility": "Open access",
    "additionDate": "2022-05-27T15:23:00.635509Z",
    "biotoolsCURIE": "biotools:gippe-rpt",
    "biotoolsID": "gippe-rpt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sanja.miskovic@ubc.ca",
            "name": "Sanja Mišković",
            "orcidid": "https://orcid.org/0000-0001-5152-9746"
        },
        {
            "name": "Guilherme Anrain Lindner",
            "orcidid": "https://orcid.org/0000-0003-1134-2156"
        }
    ],
    "description": "Geant4 interface for particle physics experiments applied to Radioactive Particle Tracking.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://pimelab.github.io/GIPPE-RPT/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-27T15:23:05.018260Z",
    "license": "Not licensed",
    "name": "GIPPE-RPT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.APRADISO.2021.110041",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdRadioactive Particle Tracking (RPT) is a non-invasive experimental technique that tracks the motion of a gamma-emitting radionuclide. Despite the RPT's high versatility, the lack of dedicated software represents a significant barrier to its wider adoption. This article introduces a new software, GIPPE-RPT, designed to bring the technique closer to a wider group of users. GIPPE-RPT is a user-friendly software that enables the creation, execution, and post-processing of high-energy physics simulations in Geant4 employing a graphical user interface. Under the platform, the user can specify all critical RPT parameters, such as reactor geometry, materials, detector number and type, and tracer type and activity. Multiple configurations can be designed and compared for optimization. GIPPE-RPT also integrates the OpenFOAM solver, which enables the setup and execution of Computational Fluid Dynamics simulations. The simulation results can be imported in Geant4 allowing an accurate description of density profiles inside the reactor. The main software modules, functions, and workflow are demonstrated using a virtual NETL SSCP-I fluidized bed reactor as a test case. The main steps in setting up an RPT experiment in GIPPE-RPT, including domain design, tracer selection, detector placement, and calibration strategy are presented in detail. The performance of six position reconstruction methods implemented in GIPPE-RPT is compared for several RPT scenarios highlighting the strengths and weaknesses of each method. Finally, the benefits of capturing heterogeneous density profiles using simulations are demonstrated by comparing reconstruction errors for test cases with heterogeneous and homogeneous media.",
                "authors": [
                    {
                        "name": "Lindner G.A."
                    },
                    {
                        "name": "Miskovic S."
                    }
                ],
                "citationCount": 1,
                "date": "2022-02-01T00:00:00Z",
                "journal": "Applied Radiation and Isotopes",
                "title": "GIPPE-RPT: Geant4 interface for particle physics experiments applied to Radioactive Particle Tracking"
            },
            "pmid": "34915347"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
