{
    "additionDate": "2021-06-14T12:47:23Z",
    "biotoolsCURIE": "biotools:bayesase",
    "biotoolsID": "bayesase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fabio.marroni@uniud.it",
            "name": "Fabio Marroni",
            "orcidid": "https://orcid.org/0000-0002-1556-5907",
            "typeEntity": "Person"
        },
        {
            "email": "mcintyre@ufl.edu",
            "name": "Lauren M McIntyre",
            "orcidid": "https://orcid.org/0000-0002-0077-3359",
            "typeEntity": "Person"
        }
    ],
    "description": "Bayesian analysis of allele-specific expression (BayesASE) is a complete bioinformatics pipeline that incorporates state-of-the-art error reduction techniques and a flexible Bayesian approach to estimating Allelic imbalance (AI) and formally comparing levels of AI between conditions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/McIntyre-Lab/BayesASE",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-08-13T09:35:27Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/BayesASE/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://anaconda.org/bioconda/bayesase"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/McIntyre-Lab/BayesASE/issues"
        }
    ],
    "name": "BayesASE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/G3JOURNAL/JKAB096",
            "metadata": {
                "abstract": "© 2021 Genetics Society of America. All rights reserved.Allelic imbalance (AI) occurs when alleles in a diploid individual are differentially expressed and indicates cis acting regulatory variation. What is the distribution of allelic effects in a natural population? Are all alleles the same? Are all alleles distinct? The approach described applies to any technology generating allele-specific sequence counts, for example for chromatin accessibility and can be applied generally including to comparisons between tissues or environments for the same genotype. Tests of allelic effect are generally performed by crossing individuals and comparing expression between alleles directly in the F1. However, a crossing scheme that compares alleles pairwise is a prohibitive cost for more than a handful of alleles as the number of crosses is at least (n2-n)/2 where n is the number of alleles. We show here that a testcross design followed by a hypothesis test of AI between testcrosses can be used to infer differences between nontester alleles, allowing n alleles to be compared with n crosses. Using a mouse data set where both testcrosses and direct comparisons have been performed, we show that the predicted differences between nontester alleles are validated at levels of over 90% when a parent-of-origin effect is present and of 60%-80% overall. Power considerations for a testcross, are similar to those in a reciprocal cross. In all applications, the testing for AI involves several complex bioinformatics steps. BayesASE is a complete bioinformatics pipeline that incorporates state-of-The-Art error reduction techniques and a flexible Bayesian approach to estimating AI and formally comparing levels of AI between conditions. The modular structure of BayesASE has been packaged in Galaxy, made available in Nextflow and as a collection of scripts for the SLURM workload manager on github (https://github.com/McIntyre-Lab/BayesASE).",
                "authors": [
                    {
                        "name": "Miller B.R."
                    },
                    {
                        "name": "Morse A.M."
                    },
                    {
                        "name": "Borgert J.E."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Sinclair K."
                    },
                    {
                        "name": "Gamble G."
                    },
                    {
                        "name": "Zou F."
                    },
                    {
                        "name": "Newman J.R.B."
                    },
                    {
                        "name": "Leon-Novelo L.G."
                    },
                    {
                        "name": "Marroni F."
                    },
                    {
                        "name": "McIntyre L.M."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "Testcrosses are an efficient strategy for identifying cisregulatory variation: Bayesian analysis of allele-specific expression (BayesASE)"
            },
            "pmcid": "PMC8104932",
            "pmid": "33772539",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}