
{
    "credit": [
        {
            "email": "zhangxr@oilcrops.cn",
            "name": "Zhang X",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://ocri-genomics.org/Sinbase/manual.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2014 The Author.Sesame (Sesamum indicum L.) is an ancient and important oilseed crop grown widely in tropical and subtropical areas. It belongs to the gigantic order Lamiales, which includes many well-known or economically important species, such as olive (Olea europaea), leonurus (Leonurus japonicus) and lavender (Lavandula spica), many of which have important pharmacological properties. Despite their importance, genetic and genomic analyses on these species have been insufficient due to a lack of reference genome information. The now available S. indicum genome will provide an unprecedented opportunity for studying both S. indicum genetic traits and comparative genomics. To deliver S. indicum genomic information to the worldwide research community, we designed Sinbase, a web-based database with comprehensive sesame genomic, genetic and comparative genomic information. Sinbase includes sequences of assembled sesame pseudomolecular chromosomes, protein-coding genes (27,148), transposable elements (372,167) and non-coding RNAs (1,748). In particular, Sinbase provides unique and valuable information on colinear regions with various plant genomes, including Arabidopsis thaliana, Glycine max, Vitis vinifera and Solanum lycopersicum. Sinbase also provides a useful search function and data mining tools, including a keyword search and local BLAST service. Sinbase will be updated regularly with new features, improvements to genome annotation and new genomic sequences, and is freely accessible at http://ocri-genomics.org/Sinbase/.",
            "authors": [
                "Wang L.",
                "Yu J.",
                "Li D.",
                "Zhang X."
            ],
            "cit_count": 21,
            "doi": "10.1093/PCP/PCU175",
            "journal": "Plant and Cell Physiology",
            "pmid": "25480115",
            "title": "Sinbase: An integrated database to study genomics, genetics and comparative genomics in sesamum indicum",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sinbase",
        "biotoolsID": "sinbase",
        "description": "Integrated database to study genomics, genetics and comparative genomics in Sesamum indicum.",
        "homepage": "http://ocri-genomics.org/Sinbase/",
        "name": "Sinbase"
    }
}