{
    "additionDate": "2020-01-14T19:40:13Z",
    "biotoolsCURIE": "biotools:DTA-SiST",
    "biotoolsID": "DTA-SiST",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "fenghaodi@sdu.edu.cn",
            "name": "Haodi Feng",
            "typeEntity": "Person"
        }
    ],
    "description": "de novo transcriptome assembly by using simplified suffix trees.\n\nDTA-SiST: a novel radical framework for de novo transcriptome assembly based on suffix trees.\n\nThe RNA-seq has revolutionized our ability to transcripts reconstruction",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jane110111107/DTA-SiST",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-01-14T19:40:13Z",
    "name": "DTA-SiST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3272-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Alternative splicing allows the pre-mRNAs of a gene to be spliced into various mRNAs, which greatly increases the diversity of proteins. High-throughput sequencing of mRNAs has revolutionized our ability for transcripts reconstruction. However, the massive size of short reads makes de novo transcripts assembly an algorithmic challenge. Results: We develop a novel radical framework, called DTA-SiST, for de novo transcriptome assembly based on suffix trees. DTA-SiST first extends contigs by reads that have the longest overlaps with the contigs' terminuses. These reads can be found in linear time of the lengths of the reads through a well-designed suffix tree structure. Then, DTA-SiST constructs splicing graphs based on contigs for each gene locus. Finally, DTA-SiST proposes two strategies to extract transcript-representing paths: a depth-first enumeration strategy and a hybrid strategy based on length and coverage. We implemented the above two strategies and compared them with the state-of-the-art de novo assemblers on both simulated and real datasets. Experimental results showed that the depth-first enumeration strategy performs always better with recall and also better with precision for smaller datasets while the hybrid strategy leads with precision for big datasets. Conclusions: DTA-SiST performs more competitive than the other compared de novo assemblers especially with precision measure, due to the read-based contig extension strategy and the elegant transcripts extraction rules.",
                "authors": [
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Feng H."
                    },
                    {
                        "name": "Zhu D."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DTA-SiST: De novo transcriptome assembly by using simplified suffix trees"
            },
            "pmcid": "PMC6929406",
            "pmid": "31874618"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ]
}