{
    "additionDate": "2023-02-19T11:13:13.890672Z",
    "biotoolsCURIE": "biotools:deepcausality",
    "biotoolsID": "deepcausality",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Zhichao.Liu@fda.hhs.gov",
            "name": "Zhichao Liu",
            "typeEntity": "Person"
        },
        {
            "email": "xwxu@ualr.edu",
            "name": "Xiaowei Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "A general causal inference framework named DeepCausality to empirically estimate the causal factors for suspected endpoints embedded in the free text.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XingqiaoWang/https-github.com-XingqiaoWang-DeepCausality-LiverTox",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:59:59.692690Z",
    "license": "Not licensed",
    "name": "DeepCausality",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/frai.2022.999289",
            "metadata": {
                "abstract": "Causality plays an essential role in multiple scientific disciplines, including the social, behavioral, and biological sciences and portions of statistics and artificial intelligence. Manual-based causality assessment from a large number of free text-based documents is very time-consuming, labor-intensive, and sometimes even impractical. Herein, we proposed a general causal inference framework named DeepCausality to empirically estimate the causal factors for suspected endpoints embedded in the free text. The proposed DeepCausality seamlessly incorporates AI-powered language models, named entity recognition and Judea Pearl's Do-calculus, into a general framework for causal inference to fulfill different domain-specific applications. We exemplified the utility of the proposed DeepCausality framework by employing the LiverTox database to estimate idiosyncratic drug-induced liver injury (DILI)-related causal terms and generate a knowledge-based causal tree for idiosyncratic DILI patient stratification. Consequently, the DeepCausality yielded a prediction performance with an accuracy of 0.92 and an F-score of 0.84 for the DILI prediction. Notably, 90% of causal terms enriched by the DeepCausality were consistent with the clinical causal terms defined by the American College of Gastroenterology (ACG) clinical guideline for evaluating suspected idiosyncratic DILI (iDILI). Furthermore, we observed a high concordance of 0.91 between the iDILI severity scores generated by DeepCausality and domain experts. Altogether, the proposed DeepCausality framework could be a promising solution for causality assessment from free text and is publicly available through https://github.com/XingqiaoWang/https-github.com-XingqiaoWang-DeepCausality-LiverTox.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Tong W."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Xu X."
                    }
                ],
                "citationCount": 3,
                "date": "2022-12-06T00:00:00Z",
                "journal": "Frontiers in Artificial Intelligence",
                "title": "DeepCausality: A general AI-powered causal inference framework for free text: A case study of LiverTox"
            },
            "pmcid": "PMC9763446",
            "pmid": "36561659"
        }
    ],
    "toolType": [
        "Script",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Gastroenterology",
            "uri": "http://edamontology.org/topic_3409"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
