{
    "additionDate": "2019-11-14T18:29:04Z",
    "biotoolsCURIE": "biotools:EEGSourceSim",
    "biotoolsID": "EEGSourceSim",
    "confidence_flag": "tool",
    "description": "A framework for realistic simulation of EEG scalp data using MRI-based forward models and biologically plausible signals and noise | BACKGROUND:Electroencephalography (EEG) is widely used to investigate human brain function. Simulation studies are essential for assessing the validity of EEG analysis methods and the interpretability of results. NEW METHOD:Here we present a simulation environment for generating EEG data by embedding biologically plausible signal and noise into MRI-based forward models that incorporate individual-subject variability in structure and function. RESULTS:The package includes pipelines for the evaluation and validation of EEG analysis tools for source estimation, functional connectivity, and spatial filtering. EEG dynamics can be simulated using realistic noise and signal models with user specifiable signal-to-noise ratio (SNR).\nLicense either MIT or GLP-2.0",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/svndl/EEGSourceSim",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-25T12:08:25Z",
    "name": "EEGSourceSim",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JNEUMETH.2019.108377",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Background: Electroencephalography (EEG) is widely used to investigate human brain function. Simulation studies are essential for assessing the validity of EEG analysis methods and the interpretability of results. New method: Here we present a simulation environment for generating EEG data by embedding biologically plausible signal and noise into MRI-based forward models that incorporate individual-subject variability in structure and function. Results: The package includes pipelines for the evaluation and validation of EEG analysis tools for source estimation, functional connectivity, and spatial filtering. EEG dynamics can be simulated using realistic noise and signal models with user specifiable signal-to-noise ratio (SNR). We also provide a set of quantitative metrics tailored to source estimation, connectivity and spatial filtering applications. Comparison with existing method(s): We provide a larger set of forward solutions for individual MRI-based head models than has been available previously. These head models are surface-based and include two sets of regions-of-interest (ROIs) that have been brought into registration with the brain of each individual using surface-based alignment – one from a whole brain and the other from a visual cortex atlas. We derive a realistic model of noise by fitting different model components to measured resting state EEG. We also provide a set of quantitative metrics for evaluating source-localization, functional connectivity and spatial filtering methods. Conclusions: The inclusion of a larger number of individual head-models, combined with surface-atlas based labeling of ROIs and plausible models of signal and noise, allows for simulation of EEG data with greater realism than previous packages.",
                "authors": [
                    {
                        "name": "Barzegaran E."
                    },
                    {
                        "name": "Bosse S."
                    },
                    {
                        "name": "Kohler P.J."
                    },
                    {
                        "name": "Norcia A.M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "EEGSourceSim: A framework for realistic simulation of EEG scalp data using MRI-based forward models and biologically plausible signals and noise"
            },
            "pmcid": "PMC6815881",
            "pmid": "31381946"
        }
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1
}