{
    "additionDate": "2024-04-19T10:15:50.618836Z",
    "biotoolsCURIE": "biotools:imagenomer",
    "biotoolsID": "imagenomer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "aorlichenko@tulane.edu",
            "name": "Anton Orlichenko",
            "typeEntity": "Person"
        }
    ],
    "description": "Description of a functional connectivity and omics analysis tool and case study identifying a race confound.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://aorliche.github.io/ImageNomer/live/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:03:01.485269Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/TulaneMBB/ImageNomer"
        }
    ],
    "name": "ImageNomer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.ynirp.2023.100191",
            "metadata": {
                "abstract": "Most packages for the analysis of fMRI-based functional connectivity (FC) and genomic data are used with a programming language interface, lacking an easy-to-navigate GUI frontend. This exacerbates two problems found in these types of data: demographic confounds and quality control in the face of high dimensionality of features. The reason is that it is too slow and cumbersome to use a programming interface to create all the necessary visualizations required to identify all correlations, confounding effects, or quality control problems in a dataset. FC in particular usually contains tens of thousands of features per subject, and can only be summarized and efficiently explored using visualizations. To remedy this situation, we have developed ImageNomer, a data visualization and analysis tool that allows inspection of both subject-level and cohort-level demographic, genomic, and imaging features. The software is Python-based, runs in a self-contained Docker image, and contains a browser-based GUI frontend. We demonstrate the usefulness of ImageNomer by identifying an unexpected race confound when predicting achievement scores in the Philadelphia Neurodevelopmental Cohort (PNC) dataset, which contains multitask fMRI and single nucleotide polymorphism (SNP) data of healthy adolescents. In the past, many studies have attempted to use FC to identify achievement-related features in fMRI. Using ImageNomer to visualize trends in achievement scores between races, we find a clear potential for confounding effects if race can be predicted using FC. Using correlation analysis in the ImageNomer software, we show that FCs correlated with Wide Range Achievement Test (WRAT) score are in fact more highly correlated with race. Investigating further, we find that whereas both FC and SNP (genomic) features can account for 10–15% of WRAT score variation, this predictive ability disappears when controlling for race. We also use ImageNomer to investigate race-FC correlation in the Bipolar and Schizophrenia Network for Intermediate Phenotypes (BSNIP) dataset. In this work, we demonstrate the advantage of our ImageNomer GUI tool in data exploration and confound detection. Additionally, this work identifies race as a strong confound in FC data and casts doubt on the possibility of finding unbiased achievement-related features in fMRI and SNP data of healthy adolescents.",
                "authors": [
                    {
                        "name": "Daly G."
                    },
                    {
                        "name": "Deng H.-W."
                    },
                    {
                        "name": "Liu A."
                    },
                    {
                        "name": "Orlichenko A."
                    },
                    {
                        "name": "Shen H."
                    },
                    {
                        "name": "Wang Y.-P."
                    },
                    {
                        "name": "Zhou Z."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Neuroimage: Reports",
                "title": "ImageNomer: Description of a functional connectivity and omics analysis tool and case study identifying a race confound"
            },
            "pmcid": "PMC10732473",
            "pmid": "38125823"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
