{
    "additionDate": "2021-03-19T08:41:48Z",
    "biotoolsCURIE": "biotools:missense3d-db",
    "biotoolsID": "missense3d-db",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alessia.david09@imperial.ac.uk",
            "name": "Alessia David",
            "typeEntity": "Person"
        }
    ],
    "description": "An atom-based analysis and repository of 4M human protein-coding genetic variants.\n\nWelcome to the Missense3D suite of resources, developed by Professor Michael Sternberg's Group. The Missense3D portal hosts resources developed to characterise and prioritise missense variants (amino acid substitutions) using protein three-dimensional structural information from models or experimental coordinates.\n\nMissense3D predicts the structural changes introduced by an amino acid substitution. It is applicable for the analyse both experimental coordinates and predicted structures.\n\nMissense3D-DB is a database of precomputed structural predictions for ~4M human missense variants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://missense3d.bc.ic.ac.uk/",
    "lastUpdate": "2024-01-23T10:36:47.411292Z",
    "name": "Missense3D-DB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S00439-020-02246-Z",
            "metadata": {
                "abstract": "The interpretation of human genetic variation is one of the greatest challenges of modern genetics. New approaches are urgently needed to prioritize variants, especially those that are rare or lack a definitive clinical interpretation. We examined 10,136,597 human missense genetic variants from GnomAD, ClinVar and UniProt. We were able to perform large-scale atom-based mapping and phenotype interpretation of 3,960,015 of these variants onto 18,874 experimental and 84,818 in house predicted three-dimensional coordinates of the human proteome. We demonstrate that 14% of amino acid substitutions from the GnomAD database that could be structurally analysed are predicted to affect protein structure (n = 568,548, of which 566,439 rare or extremely rare) and may, therefore, have a yet unknown disease-causing effect. The same is true for 19.0% (n = 6266) of variants of unknown clinical significance or conflicting interpretation reported in the ClinVar database. The results of the structural analysis are available in the dedicated web catalogue Missense3D-DB (http://missense3d.bc.ic.ac.uk/). For each of the 4 M variants, the results of the structural analysis are presented in a friendly concise format that can be included in clinical genetic reports. A detailed report of the structural analysis is also available for the non-experts in structural biology. Population frequency and predictions from SIFT and PolyPhen are included for a more comprehensive variant interpretation. This is the first large-scale atom-based structural interpretation of human genetic variation and offers geneticists and the biomedical community a new approach to genetic variant interpretation.",
                "authors": [
                    {
                        "name": "David A."
                    },
                    {
                        "name": "Hanna G."
                    },
                    {
                        "name": "Khanna T."
                    },
                    {
                        "name": "Sternberg M.J.E."
                    }
                ],
                "citationCount": 27,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Human Genetics",
                "title": "Missense3D-DB web catalogue: an atom-based analysis and repository of 4M human protein-coding genetic variants"
            },
            "pmid": "33502607"
        },
        {
            "doi": "10.1016/j.jmb.2023.168060",
            "metadata": {
                "abstract": "In 2019, we released Missense3D which identifies stereochemical features that are disrupted by a missense variant, such as introducing a buried charge. Missense3D analyses the effect of a missense variant on a single structure and thus may fail to identify as damaging surface variants disrupting a protein interface i.e., a protein–protein interaction (PPI) site. Here we present Missense3D-PPI designed to predict missense variants at PPI interfaces. Our development dataset comprised of 1,279 missense variants (pathogenic n = 733, benign n = 546) in 434 proteins and 545 experimental structures of PPI complexes. Benchmarking of Missense3D-PPI was performed after dividing the dataset in training (320 benign and 320 pathogenic variants) and testing (226 benign and 413 pathogenic). Structural features affecting PPI, such as disruption of interchain bonds and introduction of unbalanced charged interface residues, were analysed to assess the impact of the variant at PPI. The performance of Missense3D-PPI was superior to that of Missense3D: sensitivity 44 % versus 8% and accuracy 58% versus 40%, p = 4.23 × 10−16. However, the specificity of Missense3D-PPI was lower compared to Missense3D (84% versus 98%). On our dataset, Missense3D-PPI's accuracy was superior to BeAtMuSiC (p = 3.4 × 10−5), mCSM-PPI2 (p = 1.5 × 10−12) and MutaBind2 (p = 0.0025). Missense3D-PPI represents a valuable tool for predicting the structural effect of missense variants on biological protein networks and is available at the Missense3D web portal (http://missense3d.bc.ic.ac.uk).",
                "authors": [
                    {
                        "name": "David A."
                    },
                    {
                        "name": "Hanna G."
                    },
                    {
                        "name": "Islam S.A."
                    },
                    {
                        "name": "Pennica C."
                    },
                    {
                        "name": "Sternberg M.J.E."
                    }
                ],
                "citationCount": 4,
                "date": "2023-07-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Missense3D-PPI: A Web Resource to Predict the Impact of Missense Variants at Protein Interfaces Using 3D Structural Data"
            },
            "pmid": "37356905"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
