{
    "additionDate": "2017-03-24T09:34:15Z",
    "biotoolsCURIE": "biotools:endscript_2.0",
    "biotoolsID": "endscript_2.0",
    "credit": [
        {
            "email": "espript@ibcp.fr",
            "name": "ENDscript Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ENDscript is a tool for creating, visualizing, and interpreting multiple sequence alignments overlayed with known structural information.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://espript.ibcp.fr/ESPript/ENDscript/end_userguide.php"
        }
    ],
    "editPermission": {
        "authors": [
            "Afia_Imrad",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://espript.ibcp.fr/ESPript/ENDscript/index.php",
    "lastUpdate": "2024-06-26T18:41:38.117932Z",
    "name": "ENDscript 2.0",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkg556",
            "metadata": {
                "abstract": "The fortran program ESPript was created in 1993, to display on a PostScript figure multiple sequence alignments adorned with secondary structure elements. A web server was made available in 1999 and ESPript has been linked to three major web tools: ProDom which identifies protein domains, PredictProtein which predicts secondary structure elements and NPSwhich runs sequence alignment programs. A web server named ENDscript was created in 2002 to facilitate the generation of ESPript figures containing a large amount of information. ENDscript uses programs such as BLAST, Clustal and PHYLODENDRON to work on protein sequences and such as DSSP, CNS and MOLSCRIPT to work on protein coordinates. It enables the creation, from a single Protein Data Bank identifier, of a multiple sequence alignment figure adorned with secondary structure elements of each sequence of known 3D structure. Similar 3D structures are super-imposed in turn with the program PROFIT and a final figure is drawn with BOBSCRIPT, which shows sequence and structure conservation along the Cα trace of the query. ESPript and ENDscript are available at http://genopole.toulouse.inra.fr/ESPript.",
                "authors": [
                    {
                        "name": "Courcelle E."
                    },
                    {
                        "name": "Gouet P."
                    },
                    {
                        "name": "Robert X."
                    }
                ],
                "citationCount": 1067,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ESPript/ENDscript: Extracting and rendering sequence and 3D information from atomic structures of proteins"
            },
            "pmcid": "PMC168963",
            "pmid": "12824317"
        },
        {
            "doi": "10.1093/nar/gku316",
            "metadata": {
                "abstract": "ENDscript 2 is a friendly Web server for extracting and rendering a comprehensive analysis of primary to quaternary protein structure information in an automated way. This major upgrade has been fully re-engineered to enhance speed, accuracy and usability with interactive 3D visualization. It takes advantage of the new version 3 of ESPript, our well-known sequence alignment renderer, improved to handle a large number of data with reduced computation time. From a single PDB entry or file, ENDscript produces high quality figures displaying multiple sequence alignment of proteins homologous to the query, colored according to residue conservation. Furthermore, the experimental secondary structure elements and a detailed set of relevant biophysical and structural data are depicted. All this information and more are now mapped on interactive 3D PyMOL representations. Thanks to its adaptive and rigorous algorithm, beginner to expert users can modify settings to fine-tune ENDscript to their needs. ENDscript has also been upgraded as an open platform for the visualization of multiple biochemical and structural data coming from external biotool Web servers, with both 2D and 3D representations. ENDscript 2 and ESPript 3 are freely available at http://endscript.ibcp.fr and http://espript.ibcp.fr, respectively. © 2014 The Author(s).",
                "authors": [
                    {
                        "name": "Gouet P."
                    },
                    {
                        "name": "Robert X."
                    }
                ],
                "citationCount": 3239,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Deciphering key features in protein structures with the new ENDscript server"
            },
            "pmcid": "PMC4086106",
            "pmid": "24753421"
        },
        {
            "doi": "10.1093/bioinformatics/18.5.767",
            "metadata": {
                "abstract": "Summary: ENDscript is a web server grouping popular programs such as BLAST, Multalin and DSSP. It uses as query the co-ordinates file of a protein in Protein Data Bank format and generates PostScript and png figures showing: residues conserved after a multiple alignment against homologous sequences, secondary structure elements, accessibility, hydropathy and intermolecular contacts. Thus, the user can relate quickly 1D, 2D and 3D information of a protein of known structure.",
                "authors": [
                    {
                        "name": "Courcelle E."
                    },
                    {
                        "name": "Gouet P."
                    }
                ],
                "citationCount": 41,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ENDscript: A workflow to display sequence and structure information"
            },
            "pmid": "12050076"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
