{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://igm.cumc.columbia.edu/WGAViewer/cmt.php"}],"documentation":[{"type":"GENERAL","url":"http://igm.cumc.columbia.edu/WGAViewer/"}],"function":[{"operation":[{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"},{"term":"Genome annotation","uri":"http://edamontology.org/operation_0362"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Suite"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/wgaviewer-1-25w-genomic-annotation-genome-association-studies.html"}],"publication":[{"abstract":"To meet the immediate need for a framework of post-whole genome association (WGA) annotation, we have developed WGAViewer, a suite of JAVA software tools that provides a user-friendly interface to automatically annotate, visualize, and interpret the set of P-values emerging from a WGA study. Most valuably, it can be used to highlight possible functional mechanisms in an automatic manner, for example, by directly or indirectly implicating a polymorphism with an apparent link to gene expression, and help to generate hypotheses concerning the possible biological bases of observed associations. The easily interpretable diagrams can then be used to identify the associations that seem most likely to be biologically relevant, and to select genomic regions that may need to be resequenced in a search for candidate causal variants. In this report, we used our recently completed study on host control of HIV-1 viral load during the asymptomatic set point period as an illustration for the heuristic annotation of this software and its contributive role in a successful WGA project. ©2008 by Cold Spring Harbor Laboratory Press.","authors":["Ge D.","Zhang K.","Need A.C.","Martin O.","Fellay J.","Urban T.J.","Telenti A.","Goldstein D.B."],"cit_count":139,"journal":"Genome Research","pmid":"18256235","title":"WGA Viewer: Software for genomic annotation of whole genome association studies","year":"2008-04-01"}],"summary":{"biotoolsCURIE":"biotools:wgaviewer","biotoolsID":"wgaviewer","description":"Suite of JAVA software tools that provides a user-friendly interface to annotate, visualize, and help interpret the full set of P values emerging from a whole genome association (WGA) study.","homepage":"http://igm.cumc.columbia.edu/WGAViewer/","name":"WGAViewer"}}