{
    "additionDate": "2017-08-03T19:01:07Z",
    "biotoolsCURIE": "biotools:screenbeam",
    "biotoolsID": "screenbeam",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/jyyu"
        }
    ],
    "description": "An R package to do gene-level meta-anlaysis of high-throughput functional genomics RNAi or CRISPR screening data. Both microarray and NGS data are supported",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/jyyu/ScreenBEAM"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jyyu/ScreenBEAM",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/screenbeam-functional-genomics-screens-via-bayesian-hierarchical-modeling.html"
        }
    ],
    "name": "ScreenBEAM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Functional genomics (FG) screens, using RNAi or CRISPR technology, have become a standard tool for systematic, genome-wide loss-of-function studies for therapeutic target discovery. As in many large-scale assays, however, off-target effects, variable reagents' potency and experimental noise must be accounted for appropriately control for false positives. Indeed, rigorous statistical analysis of high-throughput FG screening data remains challenging, particularly when integrative analyses are used to combine multiple sh/sgRNAs targeting the same gene in the library. Method: We use large RNAi and CRISPR repositories that are publicly available to evaluate a novel meta-analysis approach for FG screens via Bayesian hierarchical modeling, Screening Bayesian Evaluation and Analysis Method (ScreenBEAM). Results: Results from our analysis show that the proposed strategy, which seamlessly combines all available data, robustly outperforms classical algorithms developed for microarray data sets as well as recent approaches designed for next generation sequencing technologies. Remarkably, the ScreenBEAM algorithm works well even when the quality of FG screens is relatively low, which accounts for about 80-95% of the public datasets. Availability and implementation: R package and source code are available at: https://github.com/jyyu/ScreenBEAM. Contact:, jose.silva@mssm.edu, yujiyang@gmail.com Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Silva J."
                    },
                    {
                        "name": "Califano A."
                    }
                ],
                "citationCount": 7,
                "date": "2015-07-22T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScreenBEAM: A novel meta-analysis algorithm for functional genomics screens via Bayesian hierarchical modeling"
            },
            "pmid": "26415723"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNAi experiment",
            "uri": "http://edamontology.org/topic_3523"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}