{
    "additionDate": "2017-01-13T13:15:59Z",
    "biotoolsCURIE": "biotools:qsra",
    "biotoolsID": "qsra",
    "credit": [
        {
            "email": "info@mocklerlab.org",
            "name": "Mockler Lab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Quality-value guided Short Read Assembler, created to take advantage of quality-value scores as a further method of dealing with error. Compared to previous published algorithms, our assembler shows significant improvements not only in speed but also in output quality.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mocklerlab.org/about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://mocklerlab.org/tools/2",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "maturity": "Legacy",
    "name": "QSRA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: New rapid high-throughput sequencing technologies have sparked the creation of a new class of assembler. Since all high-throughput sequencing platforms incorporate errors in their output, short-read assemblers must be designed to account for this error while utilizing all available data. Results: We have designed and implemented an assembler, Quality-value guided Short Read Assembler, created to take advantage of quality-value scores as a further method of dealing with error. Compared to previous published algorithms, our assembler shows significant improvements not only in speed but also in output quality. Conclusion: QSRA generally produced the highest genomic coverage, while being faster than VCAKE. QSRA is extremely competitive in its longest contig and N50/N80 contig lengths, producing results of similar quality to those of EDENA and VELVET. QSRA provides a step closer to the goal of de novo assembly of complex genomes, improving upon the original VCAKE algorithm by not only drastically reducing runtimes but also increasing the viability of the assembly algorithm through further error handling capabilities. © 2009 Bryant et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bryant Jr. D.W."
                    },
                    {
                        "name": "Wong W.-K."
                    },
                    {
                        "name": "Mockler T.C."
                    }
                ],
                "citationCount": 40,
                "date": "2009-02-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "QSRA - A quality-value guided de novo short read assembler"
            },
            "pmid": "19239711"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}