{
    "additionDate": "2021-10-10T14:27:26.922854Z",
    "biotoolsCURIE": "biotools:mini-covidnet",
    "biotoolsID": "mini-covidnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Phaneendra K. Yalavarthy",
            "orcidid": "https://orcid.org/0000-0003-4810-352X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mini-COVIDNet is a efficient lightweight deep neural network for ultrasound-based point-of-care detection of COVID-19.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/navchetan-awasthi/Mini-COVIDNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-10T14:27:26.925260Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/navchetan-awasthi/Mini-COVIDNet/issues"
        }
    ],
    "name": "Mini-COVIDNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TUFFC.2021.3068190",
            "metadata": {
                "abstract": "© 1986-2012 IEEE.Lung ultrasound (US) imaging has the potential to be an effective point-of-care test for detection of COVID-19, due to its ease of operation with minimal personal protection equipment along with easy disinfection. The current state-of-the-art deep learning models for detection of COVID-19 are heavy models that may not be easy to deploy in commonly utilized mobile platforms in point-of-care testing. In this work, we develop a lightweight mobile friendly efficient deep learning model for detection of COVID-19 using lung US images. Three different classes including COVID-19, pneumonia, and healthy were included in this task. The developed network, named as Mini-COVIDNet, was bench-marked with other lightweight neural network models along with state-of-the-art heavy model. It was shown that the proposed network can achieve the highest accuracy of 83.2% and requires a training time of only 24 min. The proposed Mini-COVIDNet has 4.39 times less number of parameters in the network compared to its next best performing network and requires a memory of only 51.29 MB, making the point-of-care detection of COVID-19 using lung US imaging plausible on a mobile platform. Deployment of these lightweight networks on embedded platforms shows that the proposed Mini-COVIDNet is highly versatile and provides optimal performance in terms of being accurate as well as having latency in the same order as other lightweight networks. The developed lightweight models are available at https://github.com/navchetan-awasthi/Mini-COVIDNet.",
                "authors": [
                    {
                        "name": "Awasthi N."
                    },
                    {
                        "name": "Dayal A."
                    },
                    {
                        "name": "Cenkeramaddi L.R."
                    },
                    {
                        "name": "Yalavarthy P.K."
                    }
                ],
                "citationCount": 3,
                "date": "2021-06-01T00:00:00Z",
                "journal": "IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control",
                "title": "Mini-COVIDNet: Efficient Lightweight Deep Neural Network for Ultrasound Based Point-of-Care Detection of COVID-19"
            },
            "pmid": "33755565",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}