{
    "additionDate": "2017-08-20T15:57:52Z",
    "biotoolsCURIE": "biotools:mach",
    "biotoolsID": "mach",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "goncalo@umich.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yun_li@med.unc.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Markov Chain based haplotyper that can resolve long haplotypes or infer missing genotypes in samples of unrelated individuals.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://csg.sph.umich.edu/abecasis/mach/tour/"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://csg.sph.umich.edu/abecasis/mach/tour/imputation.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://csg.sph.umich.edu/abecasis/mach/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "MACH",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1002/gepi.20533",
            "metadata": {
                "abstract": "Genome-wide association studies (GWAS) can identify common alleles that contribute to complex disease susceptibility. Despite the large number of SNPs assessed in each study, the effects of most common SNPs must be evaluated indirectly using either genotyped markers or haplotypes thereof as proxies. We have previously implemented a computationally efficient Markov Chain framework for genotype imputation and haplotyping in the freely available MaCH software package. The approach describes sampled chromosomes as mosaics of each other and uses available genotype and shotgun sequence data to estimate unobserved genotypes and haplotypes, together with useful measures of the quality of these estimates. Our approach is already widely used to facilitate comparison of results across studies as well as meta-analyses of GWAS. Here, we use simulations and experimental genotypes to evaluate its accuracy and utility, considering choices of genotyping panels, reference panel configurations, and designs where genotyping is replaced with shotgun sequencing. Importantly, we show that genotype imputation not only facilitates cross study analyses but also increases power of genetic association studies. We show that genotype imputation of common variants using HapMap haplotypes as a reference is very accurate using either genome-wide SNP data or smaller amounts of data typical in fine-mapping studies. Furthermore, we show the approach is applicable in a variety of populations. Finally, we illustrate how association analyses of unobserved variants will benefit from ongoing advances such as larger HapMap reference panels and whole genome shotgun sequencing technologies. © 2010 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Willer C.J."
                    },
                    {
                        "name": "Ding J."
                    },
                    {
                        "name": "Scheet P."
                    },
                    {
                        "name": "Abecasis G.R."
                    }
                ],
                "citationCount": 1388,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "MaCH: Using sequence and genotype data to estimate haplotypes and unobserved genotypes"
            },
            "pmcid": "PMC3175618",
            "pmid": "21058334",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genotyping experiment",
            "uri": "http://edamontology.org/topic_3516"
        },
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ],
    "validated": 1
}