{
    "additionDate": "2021-01-18T08:09:34Z",
    "biotoolsCURIE": "biotools:fastfield",
    "biotoolsID": "fastfield",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mehri.baniasadi@uni.lu",
            "name": "Mehri Baniasadi",
            "typeEntity": "Person"
        }
    ],
    "description": "FastField is an open-source toolbox for efficient approximation of deep brain stimulation electric fields.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/luxneuroimage/FastField",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:39:36.669906Z",
    "license": "AGPL-3.0",
    "name": "FastField",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2020.117330",
            "metadata": {
                "abstract": "Deep brain stimulation (DBS) is a surgical therapy to alleviate symptoms of certain brain disorders by electrically modulating neural tissues. Computational models predicting electric fields and volumes of tissue activated are key for efficient parameter tuning and network analysis. Currently, we lack efficient and flexible software implementations supporting complex electrode geometries and stimulation settings. Available tools are either too slow (e.g. finite element method–FEM), or too simple, with limited applicability to basic use-cases. This paper introduces FastField, an efficient open-source toolbox for DBS electric field and VTA approximations. It computes scalable electric field approximations based on the principle of superposition, and VTA activation models from pulse width and axon diameter. In benchmarks and case studies, FastField is solved in about 0.2 s, ~ 1000 times faster than using FEM. Moreover, it is almost as accurate as using FEM: average Dice overlap of 92%, which is around typical noise levels found in clinical data. Hence, FastField has the potential to foster efficient optimization studies and to support clinical applications.",
                "authors": [
                    {
                        "name": "Baniasadi M."
                    },
                    {
                        "name": "Goncalves J."
                    },
                    {
                        "name": "Hertel F."
                    },
                    {
                        "name": "Husch A."
                    },
                    {
                        "name": "Proverbio D."
                    }
                ],
                "citationCount": 31,
                "date": "2020-12-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "FastField: An open-source toolbox for efficient approximation of deep brain stimulation electric fields"
            },
            "pmid": "32890746",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/2020.03.03.974642",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
