{
    "additionDate": "2021-03-19T09:05:48Z",
    "biotoolsCURIE": "biotools:tellaprialbi",
    "biotoolsID": "tellaprialbi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "starlinger.patrick@mayo.edu",
            "name": "Patrick Starlinger",
            "orcidid": "https://orcid.org/0000-0002-4666-5337",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TELLAPRIALBI is a calculator for Aspartate aminotransferase/platelet ratio index (APRI) and albumin–bilirubin grade (ALBI), which can be used as validated prognostic predictors of postoperative liver dysfunction after hepatic resection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://tellaprialbi.37binary.com",
    "lastUpdate": "2021-04-11T09:40:58.914049Z",
    "name": "TELLAPRIALBI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BJSOPEN/ZRAA043",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press on behalf of BJS Society Ltd.BACKGROUND: Aspartate aminotransferase/platelet ratio index (APRI) and albumin-bilirubin grade (ALBI) are validated prognostic indices implicated as predictors of postoperative liver dysfunction after hepatic resection. The aim of this study was to evaluate the relevance of the combined APRI/ALBI score for postoperative clinically meaningful outcomes. METHODS: Patients undergoing hepatectomy were included from the American College of Surgeons National Surgical Quality Improvement Program database. The association between APRI/ALBI score and postoperative grade C liver dysfunction, liver dysfunction-associated and overall 30-day mortality was assessed. RESULTS: A total of 12 055 patients undergoing hepatic resection from 2014 to 2017 with preoperative blood values and detailed 30-day postoperative outcomes were included (exploration cohort: January 2014 to December 2016; validation cohort: 2017). In the exploration cohort (8538 patients), the combination of both scores (APRI/ALBI) was significantly associated with postoperative grade C liver dysfunction, 30-day mortality, and liver dysfunction-associated 30-day mortality, and was superior to either score alone. The association with postoperative 30-day mortality was confirmed in multivariable analysis. A predictive model was generated using the exploration cohort. The predicted incidence of events closely followed the observed incidence in the validation cohort (3517 patients). Subgroup analyses of tumour types were used to generate disease-specific risk models to assess risk in different clinical scenarios. These findings informed development of a smartphone application (https://tellaprialbi.37binary.com). CONCLUSION: The predictive potential of the combined APRI/ALBI score for clinically relevant outcomes such as mortality was demonstrated. An evidence-based smartphone application will allow clinical translation and facilitation of risk assessment before hepatic resection using routine laboratory parameters.",
                "authors": [
                    {
                        "name": "Starlinger P."
                    },
                    {
                        "name": "Ubl D.S."
                    },
                    {
                        "name": "Hackl H."
                    },
                    {
                        "name": "Starlinger J."
                    },
                    {
                        "name": "Nagorney D.M."
                    },
                    {
                        "name": "Smoot R.L."
                    },
                    {
                        "name": "Habermann E.B."
                    },
                    {
                        "name": "Cleary S.P."
                    }
                ],
                "date": "2021-01-08T00:00:00Z",
                "journal": "BJS open",
                "title": "Combined APRI/ALBI score to predict mortality after hepatic resection"
            },
            "pmcid": "PMC7893465",
            "pmid": "33609383"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Hepatic and biliary medicine",
            "uri": "http://edamontology.org/topic_3412"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}