{
    "additionDate": "2018-05-04T18:02:07Z",
    "biotoolsCURIE": "biotools:protdcal",
    "biotoolsID": "protdcal",
    "credit": [
        {
            "email": "yasserblanco@sce.carleton.ca",
            "name": "Yasser B. Ruiz Blanco",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A program to compute general-purpose-numerical descriptors for sequences and 3D-structures of proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinf.sce.carleton.ca/ProtDCal/guide.html"
        }
    ],
    "editPermission": {
        "authors": [
            "xrik"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.sce.carleton.ca/ProtDCal/",
    "homepage_status": 1,
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-05T12:25:38Z",
    "name": "ProtDCal",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0586-0",
            "metadata": {
                "abstract": "© Ruiz-Blanco et al.; licensee BioMed Central.Background: The exponential growth of protein structural and sequence databases is enabling multifaceted approaches to understanding the long sought sequence-structure-function relationship. Advances in computation now make it possible to apply well-established data mining and pattern recognition techniques to these data to learn models that effectively relate structure and function. However, extracting meaningful numerical descriptors of protein sequence and structure is a key issue that requires an efficient and widely available solution. Results: We here introduce ProtDCal, a new computational software suite capable of generating tens of thousands of features considering both sequence-based and 3D-structural descriptors. We demonstrate, by means of principle component analysis and Shannon entropy tests, how ProtDCal's sequence-based descriptors provide new and more relevant information not encoded by currently available servers for sequence-based protein feature generation. The wide diversity of the 3D-structure-based features generated by ProtDCal is shown to provide additional complementary information and effectively completes its general protein encoding capability. As demonstration of the utility of ProtDCal's features, prediction models of N-linked glycosylation sites are trained and evaluated. Classification performance compares favourably with that of contemporary predictors of N-linked glycosylation sites, in spite of not using domain-specific features as input information. Conclusions: ProtDCal provides a friendly and cross-platform graphical user interface, developed in the Java programming language and is freely available at: http://bioinf.sce.carleton.ca/ProtDCal/. ProtDCal introduces local and group-based encoding which enhances the diversity of the information captured by the computed features. Furthermore, we have shown that adding structure-based descriptors contributes non-redundant additional information to the features-based characterization of polypeptide systems. This software is intended to provide a useful tool for general-purpose encoding of protein sequences and structures for applications is protein classification, similarity analyses and function prediction.",
                "authors": [
                    {
                        "name": "Green J."
                    },
                    {
                        "name": "Marrero-Ponce Y."
                    },
                    {
                        "name": "Paz W."
                    },
                    {
                        "name": "Ruiz-Blanco Y.B."
                    }
                ],
                "citationCount": 40,
                "date": "2015-05-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ProtDCal: A program to compute general-purpose-numerical descriptors for sequences and 3D-structures of proteins"
            },
            "pmcid": "PMC4432771",
            "pmid": "25982853"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
