{
    "additionDate": "2022-10-31T07:58:09.092252Z",
    "biotoolsCURIE": "biotools:cvr-mricloud",
    "biotoolsID": "cvr-mricloud",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "peiyingliu@som.umaryland.edu",
            "name": "Peiying Liu",
            "orcidid": "https://orcid.org/0000-0003-0830-5960",
            "typeEntity": "Person"
        }
    ],
    "description": "An online processing tool for CO2-inhalation and resting-state cerebrovascular reactivity (CVR) MRI data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://braingps.mricloud.org/cvr.v5",
    "lastUpdate": "2024-11-24T15:24:35.317141Z",
    "license": "Other",
    "name": "CVR-MRICloud",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0274220",
            "metadata": {
                "abstract": "Cerebrovascular Reactivity (CVR) provides an assessment of the brain’s vascular reserve and has been postulated to be a sensitive marker in cerebrovascular diseases. MRI-based CVR measurement typically employs alterations in arterial carbon dioxide (CO2) level while continuously acquiring Blood-Oxygenation-Level-Dependent (BOLD) images. CO2-inhalation and resting-state methods are two commonly used approaches for CVR MRI. However, processing of CVR MRI data often requires special expertise and may become an obstacle in broad utilization of this promising technique. The aim of this work was to develop CVR-MRICloud, a cloud-based CVR processing pipeline, to enable automated processing of CVR MRI data. The CVR-MRICloud consists of several major steps including extraction of end-tidal CO2 (EtCO2) curve from raw CO2 recording, alignment of EtCO2 curve with BOLD time course, computation of CVR value on a whole-brain, regional, and voxel-wise basis. The pipeline also includes standard BOLD image processing steps such as motion correction, registration between functional and anatomic images, and transformation of the CVR images to canonical space. This paper describes these algorithms and demonstrates the performance of the CVR-MRICloud in lifespan healthy subjects and patients with clinical conditions such as stroke, brain tumor, and Moyamoya disease. CVR-MRICloud has potential to be used as a data processing tool for a variety of basic science and clinical applications.",
                "authors": [
                    {
                        "name": "Baker Z."
                    },
                    {
                        "name": "Hillis A.E."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liu P."
                    },
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Mori S."
                    },
                    {
                        "name": "Park D.C."
                    },
                    {
                        "name": "Pillai J.J."
                    },
                    {
                        "name": "Pinho M."
                    },
                    {
                        "name": "Welch B.G."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 7,
                "date": "2022-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CVR-MRICloud: An online processing tool for CO2-inhalation and resting-state cerebrovascular reactivity (CVR) MRI data"
            },
            "pmcid": "PMC9518872",
            "pmid": "36170233"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
