
{
    "credit": [
        {
            "name": "Yury G. Matushkin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://evol-constructor.bionet.nsc.ru/?page_id=112&lang=en"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://evol-constructor.bionet.nsc.ru/?cat=1&lang=en"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            },
            {
                "term": "Microbial ecology",
                "uri": "http://edamontology.org/topic_3697"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ec-0-1-simulation-bacterial-communities.html"
        }
    ],
    "publication": [
        {
            "abstract": "An original modeling tool called Evolutionary Constructor has been proposed and described. Evolutionary Constructor combines the advantages of both generalized and portrait modeling and, additionally, provides an option to modify a current model's structure. The evolution of communities comprising a trophic ring-like network with the horizontal transfer of metabolism genes occurring among the communities has been modeled and presented. It has been demonstrated that a prolonged increase in the fitness of any single population that forms part of that trophic ring-like network of antagonistic communities will eventually lead that system to becoming absolutely dependent on environmental fluctuations. This result challenges the intuitive attitudes that the higher population fitness, the more stability is given to that population. Modeling of a system comprised by symbiotic communities has revealed that horizontal transfer confers a selective advantage not only on the acceptor population (which is up to expectations) but also on the donor population. It has therefore been demonstrated that horizontal transfer can be preserved by selection along evolution even without \"selfish genes\". Evolutionary Constructor can handle any phenotypic trait that is controlled genetically, epigenetically, etc., which extends the applicability of this tool to various processes of information transduction among populations, provided that these processes resemble horizontal gene transfer. © 2007 IOS Press. All rights reserved.",
            "authors": [
                "Lashin S.A.",
                "Suslov V.V.",
                "Kolchanov N.A.",
                "Matushkin Y.G."
            ],
            "cit_count": 7,
            "journal": "In Silico Biology",
            "pmid": "18415976",
            "title": "Simulation of coevolution in community by using the \"Evolutionary Constructor\" program",
            "year": "2007-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hec",
        "biotoolsID": "hec",
        "description": "Tool for simulation of bacterial (more exactly prokaryotic) communities. It is based on the original modeling approach investigated in the Laboratory of molecular-genetic systems at the Institute of Cytology and Genetics (Novosibirsk, Russia).",
        "homepage": "http://evol-constructor.bionet.nsc.ru/?cat=5&lang=en",
        "name": "HEC"
    }
}