{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T08:29:45Z",
    "biotoolsCURIE": "biotools:long-bone-diaphyseal-CSG-Toolkit",
    "biotoolsID": "long-bone-diaphyseal-CSG-Toolkit",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "andreas.bertsatos@gmail.com",
            "name": "Andreas Bertsatos",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GNU Octave toolkit for analyzing diaphyseal long bone cross sectional geometry.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pr0m1th3as/long-bone-diaphyseal-CSG-Toolkit",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "long-bone-diaphyseal-CSG-Toolkit",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1016/j.forsciint.2019.01.041",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.The diaphyseal cross-sectional geometric properties of the humerus, femur and tibia have been extensively used for studying their adaptation to mechanical loading. To date common practices for such studies involve either computed tomography or the latex cast method in conjunction with image analysis for calculating such properties. With the advent of modern laser scanning and photogrammetry technologies in biological anthropology, the computation of the cross-sectional geometric properties directly from 3D models is a viable and sensible alternative. Nevertheless, such method has not been properly implemented as yet. A dedicated toolkit, named long-bone-diaphyseal-CSG-Toolkit, comprising a set of functions for the GNU Octave programming language, is presented here. Offering a robust analytical implementation and an easy to follow application either for a single bone or in batch-processing mode, the toolkit requires minimum user intervention and also provides functionality for graphical representation of the calculated periosteal contours and their respective cross-sectional geometric properties. Finally, the long-bone-diaphyseal-CSG-Toolkit utilizes advanced optimization algorithms, which eliminate intra- and inter-observer error by reliably orienting the cross-sectional contours to a well-defined orientation and close to the bone's true anatomical position, which provides a significant advantage over the latex cast method.",
                "authors": [
                    {
                        "name": "Bertsatos A."
                    },
                    {
                        "name": "Chovalopoulou M.-E."
                    }
                ],
                "citationCount": 8,
                "date": "2019-04-01T00:00:00Z",
                "journal": "Forensic Science International",
                "title": "A novel method for analyzing long bone diaphyseal cross-sectional geometry. A GNU Octave CSG Toolkit"
            },
            "pmid": "30776779",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}