{
    "additionDate": "2021-03-19T08:36:41Z",
    "biotoolsCURIE": "biotools:sgrnacnn",
    "biotoolsID": "sgrnacnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Yuan Lin",
            "typeEntity": "Person"
        },
        {
            "name": "Quan Zou",
            "typeEntity": "Person"
        }
    ],
    "description": "sgRNACNN is a deep learning-based method for sgRNA on-target activity prediction. It is for identifying sgRNA on-target activity in four crops using ensembles of convolutional neural networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nmt315320/sgRNACNN.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-08T12:51:24Z",
    "name": "sgRNACNN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/S11103-020-01102-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature B.V. part of Springer Nature.Key message: We proposed an ensemble convolutional neural network model to identify sgRNA high on-target activity in four crops and we used one-hot encoding and k-mers for sequence encoding. Abstract: As an important component of the CRISPR/Cas9 system, single-guide RNA (sgRNA) plays an important role in gene redirection and editing. sgRNA has played an important role in the improvement of agronomic species, but there is a lack of effective bioinformatics tools to identify the activity of sgRNA in agronomic species. Therefore, it is necessary to develop a method based on machine learning to identify sgRNA high on-target activity. In this work, we proposed a simple convolutional neural network method to identify sgRNA high on-target activity. Our study used one-hot encoding and k-mers for sequence data conversion and a voting algorithm for constructing the convolutional neural network ensemble model sgRNACNN for the prediction of sgRNA activity. The ensemble model sgRNACNN was used for predictions in four crops: Glycine max, Zea mays, Sorghum bicolor and Triticum aestivum. The accuracy rates of the four crops in the sgRNACNN model were 82.43%, 80.33%, 78.25% and 87.49%, respectively. The experimental results showed that sgRNACNN realizes the identification of high on-target activity sgRNA of agronomic data and can meet the demands of sgRNA activity prediction in agronomy to a certain extent. These results have certain significance for guiding crop gene editing and academic research. The source code and relevant dataset can be found in the following link: https://github.com/nmt315320/sgRNACNN.git.",
                "authors": [
                    {
                        "name": "Niu M."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 11,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Plant Molecular Biology",
                "title": "sgRNACNN: identifying sgRNA on-target activity in four crops using ensembles of convolutional neural networks"
            },
            "pmid": "33385273"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ]
}