
{
    "credit": [
        {
            "email": "praveenk@pitt.edu",
            "name": "Praveen K. Raj Kumar",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfolab.muohio.edu/bioinfolab/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://cadbure.sourceforge.net/Manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/cadbure-evaluating-aligner-performance-on-your-rna-seq-dataset.html"
        }
    ],
    "publication": [
        {
            "abstract": "The fundamental task in RNA-Seq-based transcriptome analysis is alignment of millions of short reads to the reference genome or transcriptome. Choosing the right tool for the dataset in hand from many existent RNA-Seq alignment packages remains a critical challenge for downstream analysis. To facilitate this choice, we designed a novel tool for comparing alignment results of user data based on the relative reliability of uniquely aligned reads (CADBURE). CADBURE can easily evaluate different aligners, or different parameter sets using the same aligner, and selects the best alignment result for any RNA-Seq dataset. Strengths of CADBURE include the ability to compare alignment results without the need for synthetic data such as simulated genomes, alignment regeneration and randomly subsampled datasets. The benefit of a CADBURE selected alignment result was supported by differentially expressed gene (DEG) analysis. We demonstrated that the use of CADBURE to select the best alignment from a number of different alignment results could change the number of DEGs by as much as 10%. In particular, the CADBURE selected alignment result favors fewer false positives in the DEG analysis. We also verified differential expression of eighteen genes with RT-qPCR validation experiments. CADBURE is an open source tool (http://cadbure.sourceforge.net/).",
            "authors": [
                "Kumar P.K.R.",
                "Hoang T.V.",
                "Robinson M.L.",
                "Tsonis P.A.",
                "Liang C."
            ],
            "cit_count": 5,
            "journal": "Scientific Reports",
            "pmid": "26304587",
            "title": "CADBURE: A generic tool to evaluate the performance of spliced aligners on RNA-Seq data",
            "year": "2015-08-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cadbure",
        "biotoolsID": "cadbure",
        "description": "The purpose of this software, Comparing Alignment results of user Data Based on the relative reliability and advantage of Uniquely aligned REads, is to evaluate spliced aligner performance on user’s RNA-Seq data by comparing a pair of alignment results obtained either from two different aligners with the similar parameter set or from two different parameter sets with the same aligner.",
        "homepage": "http://cadbure.sourceforge.net/",
        "name": "CADBURE"
    }
}