{
    "accessibility": "Open access",
    "additionDate": "2021-12-02T16:43:24.852000Z",
    "biotoolsCURIE": "biotools:mmrrc",
    "biotoolsID": "mmrrc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kclloyd@ucdavis.edu",
            "name": "K. C. Kent Lloyd",
            "orcidid": "https://orcid.org/0000-0002-5318-4144",
            "typeEntity": "Person"
        },
        {
            "name": "Craig Franklin"
        },
        {
            "name": "James Amos-Landgraf"
        },
        {
            "name": "Virginia Godfrey"
        }
    ],
    "description": "The NIH-supported National Public Repository and Distribution Archive of Mutant Mouse Models in the USA.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.med.unc.edu/mmrrc/about-us/mutant-mouse-research-at-unc/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://med.unc.edu/mmrrc",
    "lastUpdate": "2021-12-02T16:45:31.231507Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.mmrrc.org"
        }
    ],
    "name": "MMRRC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S00335-021-09894-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).The Mutant Mouse Resource and Research Center (MMRRC) Program is the pre-eminent public national mutant mouse repository and distribution archive in the USA, serving as a national resource of mutant mice available to the global scientific community for biomedical research. Established more than two decades ago with grants from the National Institutes of Health (NIH), the MMRRC Program supports a Consortium of regionally distributed and dedicated vivaria, laboratories, and offices (Centers) and an Informatics Coordination and Service Center (ICSC) at three academic teaching and research universities and one non-profit genetic research institution. The MMRRC Program accepts the submission of unique, scientifically rigorous, and experimentally valuable genetically altered and other mouse models donated by academic and commercial scientists and organizations for deposition, maintenance, preservation, and dissemination to scientists upon request. The four Centers maintain an archive of nearly 60,000 mutant alleles as live mice, frozen germplasm, and/or embryonic stem (ES) cells. Since its inception, the Centers have fulfilled 13,184 orders for mutant mouse models from 9591 scientists at 6626 institutions around the globe. Centers also provide numerous services that facilitate using mutant mouse models obtained from the MMRRC, including genetic assays, microbiome analysis, analytical phenotyping and pathology, cryorecovery, mouse husbandry, infectious disease surveillance and diagnosis, and disease modeling. The ICSC coordinates activities between the Centers, manages the website (mmrrc.org) and online catalog, and conducts communication, outreach, and education to the research community. Centers preserve, secure, and protect mutant mouse lines in perpetuity, promote rigor and reproducibility in scientific experiments using mice, provide experiential training and consultation in the responsible use of mice in research, and pursue cutting edge technologies to advance biomedical studies using mice to improve human health. Researchers benefit from an expansive list of well-defined mouse models of disease that meet the highest standards of rigor and reproducibility, while donating investigators benefit by having their mouse lines preserved, protected, and distributed in compliance with NIH policies.",
                "authors": [
                    {
                        "name": "Amos-Landgraf J."
                    },
                    {
                        "name": "Franklin C."
                    },
                    {
                        "name": "Godfrey V."
                    },
                    {
                        "name": "Grieder F."
                    },
                    {
                        "name": "Grimsrud K."
                    },
                    {
                        "name": "Korf I."
                    },
                    {
                        "name": "Lloyd K.C.K."
                    },
                    {
                        "name": "Lutz C."
                    },
                    {
                        "name": "Magnuson T."
                    },
                    {
                        "name": "Mirochnitchenko O."
                    },
                    {
                        "name": "Patel S."
                    },
                    {
                        "name": "Reinholdt L."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Mammalian Genome",
                "title": "The Mutant Mouse Resource and Research Center (MMRRC): the NIH-supported National Public Repository and Distribution Archive of Mutant Mouse Models in the USA"
            },
            "pmcid": "PMC8314026",
            "pmid": "34313795"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
