
{
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "drigden@liv.ac.uk",
            "name": "D. J. Rigden",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ccp4.ac.uk/docs.php"
        }
    ],
    "function": [
        {
            "note": "Crystallographic phasing using ensemble search models from de novo modelling, remote homologues, NMR, etc",
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "C"
        ],
        "toolType": [
            "Command-line tool",
            "Desktop application"
        ],
        "topic": [
            {
                "term": "X-ray diffraction",
                "uri": "http://edamontology.org/topic_2828"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Protein ab initio models predicted from sequence data alone can enable the elucidation of crystal structures by molecular replacement. However, the calculation of such ab initio models is typically computationally expensive. Here, a computational pipeline based on the clustering and truncation of cheaply obtained ab initio models for the preparation of structure ensembles is described. Clustering is used to select models and to quantitatively predict their local accuracy, allowing rational truncation of predicted inaccurate regions. The resulting ensembles, with or without rapidly added side chains, solved 43% of all test cases, with an 80% success rate for all- proteins. A program implementing this approach, AMPLE, is included in the CCP4 suite of programs. It only requires the input of a FASTA sequence file and a diffraction data file. It carries out the modelling using locally installed Rosetta, creates search ensembles and automatically performs molecular replacement and model rebuilding.© 2012 International Union of Crystallography Printed in Singapore - all rights reserved.",
            "authors": [
                "Bibby J.",
                "Keegan R.M.",
                "Mayans O.",
                "Winn M.D.",
                "Rigden D.J."
            ],
            "cit_count": 49,
            "doi": "10.1107/S0907444912039194",
            "journal": "Acta Crystallographica Section D: Biological Crystallography",
            "title": "AMPLE: A cluster-and-truncate approach to solve the crystal structures of small proteins using rapidly computed ab initio models",
            "type": "Primary",
            "year": "2012-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ample",
        "biotoolsID": "ample",
        "description": "A program for Molecular Replacement with search ensembles generated from uncoventional models.",
        "homepage": "http://www.ccp4.ac.uk/ample/",
        "name": "Ample",
        "version": [
            "1"
        ]
    }
}