{
    "additionDate": "2021-01-18T07:03:52Z",
    "biotoolsCURIE": "biotools:deepsimulator",
    "biotoolsID": "deepsimulator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sheng.wang@kaust.edu.sa",
            "name": "Sheng Wang",
            "typeEntity": "Person"
        },
        {
            "email": "xin.gao@kaust.edu.sa",
            "name": "Xin Gao",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepSimulator is a deep learning based simulator to mimic the entire pipeline of Nanopore sequencing. Starting from a given reference genome or assembled contigs, we simulate the electrical current signals by a context-dependent deep learning model, followed by a base-calling procedure to yield simulated reads. This workflow mimics the sequencing procedure more naturally.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lykaust15/DeepSimulator",
    "language": [
        "C",
        "Python"
    ],
    "lastUpdate": "2021-02-27T15:13:31Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/lykaust15/DeepSimulator/issues"
        }
    ],
    "name": "DeepSimulator",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty223",
            "metadata": {
                "abstract": "© The Author(s) 2018.Motivation: Oxford Nanopore sequencing is a rapidly developed sequencing technology in recent years. To keep pace with the explosion of the downstream data analytical tools, a versatile Nanopore sequencing simulator is needed to complement the experimental data as well as to benchmark those newly developed tools. However, all the currently available simulators are based on simple statistics of the produced reads, which have difficulty in capturing the complex nature of the Nanopore sequencing procedure, the main task of which is the generation of raw electrical current signals. Results: Here we propose a deep learning based simulator, DeepSimulator, to mimic the entire pipeline of Nanopore sequencing. Starting from a given reference genome or assembled contigs, we simulate the electrical current signals by a context-dependent deep learning model, followed by a base-calling procedure to yield simulated reads. This workflow mimics the sequencing procedure more naturally. The thorough experiments performed across four species show that the signals generated by our context-dependent model are more similar to the experimentally obtained signals than the ones generated by the official context-independent pore model. In terms of the simulated reads, we provide a parameter interface to users so that they can obtain the reads with different accuracies ranging from 83 to 97%. The reads generated by the default parameter have almost the same properties as the real data. Two case studies demonstrate the application of DeepSimulator to benefit the development of tools in de novo assembly and in low coverage SNP detection.",
                "authors": [
                    {
                        "name": "Bi C."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Han R."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang S."
                    }
                ],
                "citationCount": 28,
                "date": "2018-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepSimulator: A deep simulator for Nanopore sequencing"
            }
        },
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ963",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Nanopore sequencing is one of the leading third-generation sequencing technologies. A number of computational tools have been developed to facilitate the processing and analysis of the Nanopore data. Previously, we have developed DeepSimulator1.0 (DS1.0), which is the first simulator for Nanopore sequencing to produce both the raw electrical signals and the reads. However, although DS1.0 can produce high-quality reads, for some sequences, the divergence between the simulated raw signals and the real signals can be large. Furthermore, the Nanopore sequencing technology has evolved greatly since DS1.0 was released. It is thus necessary to update DS1.0 to accommodate those changes. Results: We propose DeepSimulator1.5 (DS1.5), all three modules of which have been updated substantially from DS1.0. As for the sequence generator, we updated the sample read length distribution to reflect the newest real reads' features. In terms of the signal generator, which is the core of DeepSimulator, we added one more pore model, the context-independent pore model, which is much faster than the previous context-dependent one. Furthermore, to make the generated signals more similar to the real ones, we added a low-pass filter to post-process the pore model signals. Regarding the basecaller, we added the support for the newest official basecaller, Guppy, which can support both GPU and CPU. In addition, multiple optimizations, related to multiprocessing control, memory and storage management, have been implemented to make DS1.5 a much more amenable and lighter simulator than DS1.0.",
                "authors": [
                    {
                        "name": "Bi C."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Qiu Z."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wang S."
                    }
                ],
                "citationCount": 8,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepSimulator1.5: A more powerful, quicker and lighter simulator for Nanopore sequencing"
            },
            "note": "Version 1.5",
            "pmcid": "PMC7178411",
            "pmid": "31913436"
        }
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "version": [
        "1.5"
    ]
}
