{
    "additionDate": "2021-01-18T10:35:30Z",
    "biotoolsCURIE": "biotools:dintd",
    "biotoolsID": "dintd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiguoyuan@mail.xidian.edu.cn",
            "name": "Xiguo Yuan",
            "typeEntity": "Person"
        }
    ],
    "description": "DINTD is a tool for the detection and inference of tandem duplications from short sequencing reads.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SVanalysis/DINTD",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:15:44Z",
    "name": "DINTD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00924",
            "metadata": {
                "abstract": "© Copyright © 2020 Dong, Qi, Wang and Yuan.Tandem duplication (TD) is an important type of structural variation (SV) in the human genome and has biological significance for human cancer evolution and tumor genesis. Accurate and reliable detection of TDs plays an important role in advancing early detection, diagnosis, and treatment of disease. The advent of next-generation sequencing technologies has made it possible for the study of TDs. However, detection is still challenging due to the uneven distribution of reads and the uncertain amplitude of TD regions. In this paper, we present a new method, DINTD (Detection and INference of Tandem Duplications), to detect and infer TDs using short sequencing reads. The major principle of the proposed method is that it first extracts read depth and mapping quality signals, then uses the DBSCAN (Density-Based Spatial Clustering of Applications with Noise) algorithm to find the possible TD regions. The total variation penalized least squares model is fitted with read depth and mapping quality signals to denoise signals. A 2D binary search tree is used to search the neighbor points effectively. To further identify the exact breakpoints of the TD regions, split-read signals are integrated into DINTD. The experimental results of DINTD on simulated data sets showed that DINTD can outperform other methods for sensitivity, precision, F1-score, and boundary bias. DINTD is further validated on real samples, and the experiment results indicate that it is consistent with other methods. This study indicates that DINTD can be used as an effective tool for detecting TDs.",
                "authors": [
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Qi M."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Yuan X."
                    }
                ],
                "date": "2020-08-11T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "DINTD: Detection and Inference of Tandem Duplications From Short Sequencing Reads"
            },
            "pmcid": "PMC7433346",
            "pmid": "32849857"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
