{
    "additionDate": "2021-01-18T12:31:31Z",
    "biotoolsCURIE": "biotools:mhcii3d",
    "biotoolsID": "mhcii3d",
    "confidence_flag": "tool",
    "description": "MHCII3D-Robust Structure Based Prediction of MHC II Binding Peptides.\n\nMHC II Automated Server Benchmarks.\n\nThe knowledge of MHC II binding peptides is highly desired in immunological research, particularly in the context of cancer, autoimmune diseases, or allergies. MHCII3D is a prediction tool based on structural scaffolds of MHC II-peptide complexes and statistical scoring functions (SSFs). Its prediction performance is among machine learning tools.",
    "editPermission": {
        "authors": [
            "lacknerpeter"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://tools.iedb.org/auto_bench/mhcii/weekly/",
    "lastUpdate": "2021-06-17T13:07:01Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://pbwww.che.sbg.ac.at/MHCII3D"
        }
    ],
    "name": "MHCII3D",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/IJMS22010012",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Knowledge of MHC II binding peptides is highly desired in immunological research, particularly in the context of cancer, autoimmune diseases, or allergies. The most successful prediction methods are based on machine learning methods trained on sequences of experimentally characterized binding peptides. Here, we describe a complementary approach called MHCII3D, which is based on structural scaffolds of MHC II-peptide complexes and statistical scoring functions (SSFs). The MHC II alleles reported in the Immuno Polymorphism Database are processed in a dedicated 3D-modeling pipeline providing a set of scaffold complexes for each distinct allotype sequence. Antigen protein sequences are threaded through the scaffolds and evaluated by optimized SSFs. We compared the predictive power of MHCII3D with different sequence-based machine learning methods. The Pearson correlation to experimentally determine IC50 values for MHC II Automated Server Benchmarks data sets from IEDB (Immune Epitope Database) is 0.42, which is in the competitor methods range. We show that MHCII3D is quite robust in leaving one molecule out tests and is therefore not prone to overfitting. Finally, we provide evidence that MHCII3D can complement the current sequence-based methods and help to identify problematic entries in IEDB. Scaffolds and MHCII3D executables can be freely downloaded from our web pages.",
                "authors": [
                    {
                        "name": "Laimer J."
                    },
                    {
                        "name": "Lackner P."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Mhcii3d—robust structure based prediction of mhc ii binding peptides"
            },
            "pmid": "33374958"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}