{"credit":[{"email":"yann.ruffieux@epfl.ch","name":"Yann Ruffieux","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/lapmix.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/lapmix_1.40.0.tar.gz"}],"function":[{"operation":[{"term":"Differential gene expression analysis","uri":"http://edamontology.org/operation_3223"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"MIRROR","url":"http://www.r-project.org"},{"type":"MIRROR","url":"http://www.bioconductor.org"},{"type":"MIRROR","url":"http://stat.epfl.ch"}],"publication":[{"abstract":"Microarrays have become an important tool for studying the molecular basis of complex disease traits and fundamental biological processes. A common purpose of microarray experiments is the detection of genes that are differentially expressed under two conditions, such as treatment versus control or wild type versus knockout. We introduce a Laplace mixture model as a long-tailed alternative to the normal distribution when identifying differentially expressed genes in microarray experiments, and provide an extension to asymmetric over- or underexpression. This model permits greater flexibility than models in current use as it has the potential, at least with sufficient data, to accommodate both whole genome and restricted coverage arrays. We also propose likelihood approaches to hyperparameter estimation which are equally applicable in the Normal mixture case. The Laplace model appears to give some improvement in fit to data, though simulation studies show that our method performs similarly to several other statistical approaches to the problem of identification of differential expression. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Bhowmick D.","Davison A.C.","Goldstein D.R.","Ruffieux Y."],"cit_count":33,"doi":"10.1093/biostatistics/kxj032","journal":"Biostatistics","title":"A Laplace mixture model for identification of differential expression in microarray experiments","type":"Primary","year":"2006-10-01"}],"summary":{"biotoolsCURIE":"biotools:lapmix","biotoolsID":"lapmix","description":"Laplace mixture modelling of microarray experiments. A hierarchical Bayesian approach is used, and the hyperparameters are estimated using empirical Bayes. The main purpose is to identify differentially expressed genes.","homepage":"http://bioconductor.org/packages/release/bioc/html/lapmix.html","name":"lapmix","version":["1.40.0"]}}