{
    "additionDate": "2020-01-14T20:16:13Z",
    "biotoolsCURIE": "biotools:Bcool",
    "biotoolsID": "Bcool",
    "confidence_flag": "tool",
    "description": "self-correction of short reads via mapping on de Bruijn graphs.\n\nde Bruijn graph cOrrectiOn from graph aLignment.\n\nBcool clone and compile Bcalm2 Bgreat2 Btrim and Ntcard",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "http://github.com/Malfoy/BCOOL",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2020-12-05T13:41:09Z",
    "license": "AGPL-3.0",
    "name": "BCOOL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ548",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Several corrections have been made to the above article. • In the article abstract, the word 'read' has been replaced by the word 'sequence.' • The caption for figure 1 has been replaced with the following text: 'Four issues with k-mer-spectrum methods, and how Bcool handles them (blue half-arrows represent the paths of the graph on which given reads map). (1) Genomic k-mers may be appear weak because of their low abundance: by using a very low k-mer abundance threshold coupled with a unitig abundance threshold, Bcool retains low-abundance k-mers and manages to correct the reads that contain them. (2) Erroneous k-mers may appear solid because of their high abundance: Bcool detects the tip pattern produced by such solid erroneous k-mers and is therefore able to discard them (other erroneous k-mers are detected at the unitig filtering step). (3) Sequencing errors may be validated by genomic k-mers originating from other parts of the genome: by considering mappings globally, Bcool chooses the best path for each read, i.e. The one on which it maps with the smallest number of mismatches. (4) Multiple errors may occur on a k-mer, resulting in a large weak region: by using unitigs instead of k-mers to correct reads, Bwise is able to correct properly reads that contain several nearby errors' • On page 3 of the PDF, 'k-mers' has been replaced with 'kvalues.' • On page 5 of the PDF the 'correction ratio' has been corrected from '= (TP + FN)/(FN + TP)' to '= (TP + FN)/(FN + FP)' • The following sentence has been added to the Figure 6 caption: 'BFC and Musket ran out of memory an all full human datasets' • The reference given for 'Limasset, A. et al. (2017)' has been corrected to the following: Limasset, A. et al. (2017) Fast and Scalable Minimal Perfect Hashing for Massive Key Sets. In: Iliopolis, C.S. et al. (eds) Proceedings of the 16th International symposium on Experimental Algorithms (SEA 2017), London, UK, June 21-23, 2017, Leibniz International Proceedings in informatics Volume 75, Schloss Dagstuhl-Leibniz-Zentrum für Informatik GmbH, Dagstuhl Publishing, Saarbrücken/Wadern, Germany, pp. 25: 1-25:16. The publisher apologises for these errors which have now been corrected.",
                "authors": [
                    {
                        "name": "Flot J.-F."
                    },
                    {
                        "name": "Limasset A."
                    },
                    {
                        "name": "Peterlongo P."
                    }
                ],
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Erratum: Toward perfect reads: Self-correction of short reads via mapping on de Bruijn graphs (Bioinformatics (2019) DOI: 10.1093/bioinformatics/btz102)"
            },
            "pmid": "31808510"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
