{
    "additionDate": "2024-06-18T14:39:46.360905Z",
    "biotoolsCURIE": "biotools:oralexplorer",
    "biotoolsID": "oralexplorer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "luopeng@smu.edu.cn",
            "name": "Peng Luo",
            "typeEntity": "Person"
        },
        {
            "email": "xyzmmok@smu.edu.cn",
            "name": "Chufeng Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "A web server for exploring the mechanisms of oral inflammatory diseases.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://smuonco.shinyapps.io/OralExplorer/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:53:52.496239Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://robinl-lab.com/OralExplorer"
        }
    ],
    "name": "OralExplorer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12967-024-05019-8",
            "metadata": {
                "abstract": "Background: Oral inflammatory diseases are localized infectious diseases primarily caused by oral pathogens with the potential for serious systemic complications. However, publicly available datasets for these diseases are underutilized. To address this issue, a web tool called OralExplorer was developed. This tool integrates the available data and provides comprehensive online bioinformatic analysis. Methods: Human oral inflammatory disease-related datasets were obtained from the GEO database and normalized using a standardized process. Transcriptome data were then subjected to differential gene expression analysis, immune infiltration analysis, correlation analysis, pathway enrichment analysis, and visualization. The single-cell sequencing data was visualized as cluster plot, feature plot, and heatmaps. The web platform was primarily built using Shiny. The biomarkers identified in OralExplorer were validated using local clinical samples through qPCR and IHC. Results: A total of 35 human oral inflammatory disease-related datasets, covering 6 main disease types and 901 samples, were included in the study to identify potential molecular signatures of the mechanisms of oral diseases. OralExplorer consists of 5 main analysis modules (differential gene expression analysis, immune infiltration analysis, correlation analysis, pathway enrichment analysis and single-cell analysis), with multiple visualization options. The platform offers a simple and intuitive interface, high-quality images for visualization, and detailed analysis results tables for easy access by users. Six markers (IL1β, SRGN, CXCR1, FGR, ARHGEF2, and PTAFR) were identified by OralExplorer. qPCR- and IHC-based experimental validation showed significantly higher levels of these genes in the periodontitis group. Conclusions: OralExplorer is a comprehensive analytical platform for oral inflammatory diseases. It allows users to interactively explore the molecular mechanisms underlying the action and regression of these diseases. It also aids dental researchers in unlocking the potential value of transcriptomics data related to oral diseases. OralExplorer can be accessed at https://smuonco.shinyapps.io/OralExplorer/ (Alternate URL: http://robinl-lab.com/OralExplorer).",
                "authors": [
                    {
                        "name": "Liao Z."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Lin W."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Luo P."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "OralExplorer: a web server for exploring the mechanisms of oral inflammatory diseases"
            },
            "pmcid": "PMC10943789",
            "pmid": "38491529"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
