{
    "additionDate": "2021-01-18T08:44:00Z",
    "biotoolsCURIE": "biotools:rtfmri-nf",
    "biotoolsID": "rtfmri-nf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "j.s.heunis@tue.nl",
            "name": "Stephan Heunis",
            "orcidid": "https://orcid.org/0000-0003-3503-9872",
            "typeEntity": "Person"
        }
    ],
    "description": "Quality and denoising in real-time functional magnetic resonance imaging neurofeedback.\n\nThe work investigated the state of denoising methods used in the field of fMRI neurofeedback.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jsheunis/quality-and-denoising-in-rtfmri-nf",
    "lastUpdate": "2021-02-08T13:53:20Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bit.ly/rtfmri-nf-zotero-library"
        }
    ],
    "name": "rtfMRI-NF",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/HBM.25010",
            "metadata": {
                "abstract": "© 2020 The Authors. Human Brain Mapping published by Wiley Periodicals, Inc.Neurofeedback training using real-time functional magnetic resonance imaging (rtfMRI-NF) allows subjects voluntary control of localised and distributed brain activity. It has sparked increased interest as a promising non-invasive treatment option in neuropsychiatric and neurocognitive disorders, although its efficacy and clinical significance are yet to be determined. In this work, we present the first extensive review of acquisition, processing and quality control methods available to improve the quality of the neurofeedback signal. Furthermore, we investigate the state of denoising and quality control practices in 128 recently published rtfMRI-NF studies. We found: (a) that less than a third of the studies reported implementing standard real-time fMRI denoising steps, (b) significant room for improvement with regards to methods reporting and (c) the need for methodological studies quantifying and comparing the contribution of denoising steps to the neurofeedback signal quality. Advances in rtfMRI-NF research depend on reproducibility of methods and results. Notably, a systematic effort is needed to build up evidence that disentangles the various mechanisms influencing neurofeedback effects. To this end, we recommend that future rtfMRI-NF studies: (a) report implementation of a set of standard real-time fMRI denoising steps according to a proposed COBIDAS-style checklist (https://osf.io/kjwhf/), (b) ensure the quality of the neurofeedback signal by calculating and reporting community-informed quality metrics and applying offline control checks and (c) strive to adopt transparent principles in the form of methods and data sharing and support of open-source rtfMRI-NF software. Code and data for reproducibility, as well as an interactive environment to explore the study data, can be accessed at https://github.com/jsheunis/quality-and-denoising-in-rtfmri-nf.",
                "authors": [
                    {
                        "name": "Aldenkamp B."
                    },
                    {
                        "name": "Breeuwer M."
                    },
                    {
                        "name": "Caballero-Gaudes C."
                    },
                    {
                        "name": "Heunis S."
                    },
                    {
                        "name": "Jansen J.F.A."
                    },
                    {
                        "name": "Lamerichs R."
                    },
                    {
                        "name": "Zinger S."
                    }
                ],
                "citationCount": 9,
                "date": "2020-08-15T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "Quality and denoising in real-time functional magnetic resonance imaging neurofeedback: A methods review"
            },
            "pmcid": "PMC7375116",
            "pmid": "32333624"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
