{
    "additionDate": "2017-12-18T00:04:56Z",
    "biotoolsCURIE": "biotools:crnpred",
    "biotoolsID": "crnpred",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.protein.osaka-u.ac.jp/rcsfp/pi/members/akinjo/"
        }
    ],
    "description": "CRNPRED is a program that predicts secondary structures (SS), contact numbers (CN), and residue-wise contact orders (RWCO) of a native protein structure from its amino acid sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.bioinformatics.org/crnpred/wiki/PmWiki/DocumentationIndex"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.org/crnpred/wiki/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/crnpred-1-1-predict-secondary-structures-protein.html"
        }
    ],
    "name": "CRNPRED",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.2142/biophysics.1.67",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-7-401",
            "metadata": {
                "abstract": "Background: One-dimensional protein structures such as secondary structures or contact numbers are useful for three-dimensional structure prediction and helpful for intuitive understanding of the sequence-structure relationship. Accurate prediction methods will serve as a basis for these and other purposes. Results: We implemented a program CRNPRED which predicts secondary structures, contact numbers and residue-wise contact orders. This program is based on a novel machine learning scheme called critical random networks. Unlike most conventional one-dimensional structure prediction methods which are based on local windows of an amino acid sequence, CRNPRED takes into account the whole sequence. CRNPRED achieves, on average per chain, Q3 = 81% for secondary structure prediction, and correlation coefficients of 0.75 and 0.61 for contact number and residue-wise contact order predictions, respectively. Conclusion: CRNPRED will be a useful tool for computational as well as experimental biologists who need accurate one-dimensional protein structure predictions. © 2006 Kinjo and Nishikawa; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Kinjo A.R."
                    },
                    {
                        "name": "Nishikawa K."
                    }
                ],
                "citationCount": 25,
                "date": "2006-09-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CRNPRED: Highly accurate prediction of one-dimensional protein structures by large-scale critical random networks"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/bti330",
            "metadata": {
                "abstract": "Summary: One-dimensional (1D) structures of proteins such as secondary structure and contact number provide intuitive pictures to understand how the native three-dimensional (3D) structure of a protein is encoded in the amino acid sequence. However, it is still not clear whether a given set of 1D structures contains sufficient information for recovering the underlying 3D structure. Here we show that the 3D structure of a protein can be recovered from a set of three types of 1D structures, namely, secondary structure, contact number and residue-wise contact order which is introduced here for the first time. Using simulated annealing molecular dynamics simulations, the structures satisfying the given native 1D structural restraints were sought for 16 proteins of various structural classes and of sizes ranging from 56 to 146 residues. By selecting the structures best satisfying the restraints, all the proteins showed a coordinate RMS deviation of <4 Å from the native structure, and, for most of them, the deviation was even <2 Å. The present result opens a new possibility to protein structure prediction and our understanding of the sequence-structure relationship. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Kinjo A.R."
                    },
                    {
                        "name": "Nishikawa K."
                    }
                ],
                "citationCount": 25,
                "date": "2005-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Recoverable one-dimensional encoding of three-dimensional protein structures"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}