{
    "accessibility": "Open access",
    "additionDate": "2022-10-06T09:18:50.519485Z",
    "biotoolsCURIE": "biotools:binner_R",
    "biotoolsID": "binner_R",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jsf9@aber.ac.uk",
            "name": "Jasen P. Finch",
            "orcidid": "https://orcid.org/0000-0002-6070-7476",
            "typeEntity": "Person"
        }
    ],
    "description": "A spectral binning approach for flow infusion electrospray high resolution mass spectrometry (FIE-HRMS) metabolome fingerprinting data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Ion counting",
                    "uri": "http://edamontology.org/operation_3704"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://aberhrml.github.io/binneR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-06T09:18:50.522439Z",
    "license": "GPL-3.0",
    "name": "binneR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S11306-022-01923-6",
            "metadata": {
                "abstract": "© 2022, The Author(s).Introduction: Flow infusion electrospray high resolution mass spectrometry (FIE-HRMS) fingerprinting produces complex, high dimensional data sets which require specialist in-silico software tools to process the data prior to analysis. Objectives: Present spectral binning as a pragmatic approach to post-acquisition procession of FIE-HRMS metabolome fingerprinting data. Methods: A spectral binning approach was developed that included the elimination of single scan m/z events, the binning of spectra and the averaging of spectra across the infusion profile. The modal accurate m/z was then extracted for each bin. This approach was assessed using four different biological matrices and a mix of 31 known chemical standards analysed by FIE-HRMS using an Exactive Orbitrap. Bin purity and centrality metrics were developed to objectively assess the distribution and position of accurate m/z within an individual bin respectively. Results: The optimal spectral binning width was found to be 0.01 amu. 80.8% of the extracted accurate m/z matched to predicted ionisation products of the chemical standards mix were found to have an error of below 3 ppm. The open-source R package binneR was developed as a user friendly implementation of the approach. This was able to process 100 data files using 4 Central Processing Units (CPU) workers in only 55 seconds with a maximum memory usage of 1.36 GB. Conclusion: Spectral binning is a fast and robust method for the post-acquisition processing of FIE-HRMS data. The open-source R package binneR allows users to efficiently process data from FIE-HRMS experiments with the resources available on a standard desktop computer.",
                "authors": [
                    {
                        "name": "Beckmann M."
                    },
                    {
                        "name": "Draper J."
                    },
                    {
                        "name": "Finch J.P."
                    },
                    {
                        "name": "Lyons L."
                    },
                    {
                        "name": "Phillips H."
                    },
                    {
                        "name": "Wilson T."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Metabolomics",
                "title": "Spectral binning as an approach to post-acquisition processing of high resolution FIE-MS metabolome fingerprinting data"
            },
            "pmcid": "PMC9345815",
            "pmid": "35917032"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
