{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T11:09:45.710961Z",
    "biotoolsCURIE": "biotools:badass",
    "biotoolsID": "badass",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "savscosta@gmail.com",
            "name": "Sávio S. Costa",
            "orcidid": "https://orcid.org/0000-0001-7288-4157",
            "typeEntity": "Person"
        },
        {
            "name": "Adonney Allan de Oliveira Veras",
            "typeEntity": "Person"
        },
        {
            "name": "Artur Silva",
            "typeEntity": "Person"
        },
        {
            "name": "Gislenne da Silva Moia",
            "typeEntity": "Person"
        },
        {
            "name": "Rafael A Baraúna",
            "typeEntity": "Person"
        }
    ],
    "description": "BADASS is a software with a user-friendly graphical interface applied to the search and analysis of bacteriocin diversity in whole-metagenome shotgun sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/badass/",
    "lastUpdate": "2023-11-07T11:09:45.713622Z",
    "name": "BADASS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05106-X",
            "metadata": {
                "abstract": "Background: Bacteriocins are defined as thermolabile peptides produced by bacteria with biological activity against taxonomically related species. These antimicrobial peptides have a wide application including disease treatment, food conservation, and probiotics. However, even with a large industrial and biotechnological application potential, these peptides are still poorly studied and explored. BADASS is software with a user-friendly graphical interface applied to the search and analysis of bacteriocin diversity in whole-metagenome shotgun sequencing data. Results: The search for bacteriocin sequences is performed with tools such as BLAST or DIAMOND using the BAGEL4 database as a reference. The putative bacteriocin sequences identified are used to determine the abundance and richness of the three classes of bacteriocins. Abundance is calculated by comparing the reads identified as bacteriocins to the reads identified as 16S rRNA gene using SILVA database as a reference. BADASS has a complete pipeline that starts with the quality assessment of the raw data. At the end of the analysis, BADASS generates several plots of richness and abundance automatically as well as tabular files containing information about the main bacteriocins detected. The user is able to change the main parameters of the analysis in the graphical interface. To demonstrate how the software works, we used four datasets from WMS studies using default parameters. Lantibiotics were the most abundant bacteriocins in the four datasets. This class of bacteriocin is commonly produced by Streptomyces sp. Conclusions: With a user-friendly graphical interface and a complete pipeline, BADASS proved to be a powerful tool for prospecting bacteriocin sequences in Whole-Metagenome Shotgun Sequencing (WMS) data. This tool is publicly available at https://sourceforge.net/projects/badass/.",
                "authors": [
                    {
                        "name": "Barauna R.A."
                    },
                    {
                        "name": "Costa S.S."
                    },
                    {
                        "name": "Silva A."
                    },
                    {
                        "name": "da Silva Moia G."
                    },
                    {
                        "name": "de Oliveira Veras A.A."
                    }
                ],
                "citationCount": 2,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BADASS: BActeriocin-Diversity ASsessment Software"
            },
            "pmcid": "PMC9854158",
            "pmid": "36670373"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
