{
    "additionDate": "2021-01-18T10:10:25Z",
    "biotoolsCURIE": "biotools:sete",
    "biotoolsID": "sete",
    "confidence_flag": "tool",
    "description": "Sequence-based Ensemble learning approach for TCR Epitope binding prediction.\n\nSETE is a novel lightweight TCR's binding Antigen prediction algorithm based on ensemble algorithm. Note that our model is designed for multi-classification problem and we will updated the model to make it has better performance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wonanut/SETE",
    "lastUpdate": "2021-02-16T15:21:55Z",
    "name": "SETE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2020.107281",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdPredicting the binding of T cell receptors (TCRs) to epitopes plays a vital role in the immunotherapy, because it guides the development of therapeutic vaccines and cancer treatments. Many prediction methods attempted to explain the relationship between TCR repertoires from different aspects such as the V(D)J gene locus and the biophysical features of amino acids molecules, but the extraction of these features is time consuming and the performance of these models are limited. Few studies have investigated how k-mers formed by adjacent amino acids in TCR sequences direct the epitope recognition, and the specific mechanism of TCR epitope binding is still unclear. Motivated by these, we presented SETE (Sequence-based Ensemble learning approach for TCR Epitope binding prediction), a novel model to predict the TCR epitope binding accurately. The model deconstructed the CDR3β sequence to short amino acid chains as features and learned the pattern of them between different TCR repertoires with gradient boosting decision tree algorithm. Experiments have demonstrated that SETE can be helpful in predicting the TCRs’ corresponding epitopes and it outperforms other state-of-the-art methods in predicting the epitope specificity of TCR on VDJdb data set. The source codes have been uploaded at https://github.com/wonanut/SETE for academic usage only.",
                "authors": [
                    {
                        "name": "Lai X."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Tong Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zheng T."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "SETE: Sequence-based Ensemble learning approach for TCR Epitope binding prediction"
            },
            "pmid": "32623023"
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
