{
    "additionDate": "2019-11-14T20:07:36Z",
    "biotoolsCURIE": "biotools:gfkb",
    "biotoolsID": "gfkb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mazumder@gwu.edu",
            "name": "Raja Mazumder",
            "orcidid": "https://orcid.org/0000-0001-8823-9945",
            "typeEntity": "Person"
        }
    ],
    "description": "Baseline human gut microbiota profile in healthy people and standard reporting template | High-performance Integrated Virtual Environment | We have developed a proof-of-concept gut microbiome monitoring system using a sequencing and analysis pipeline implemented during our previous I-Corps award (see below) | We have collected from the individuals enrolled in our study the following: three separate fecal samples for metagenomic sequencing, anthropometric measurements, a diet history questionnaire, gastrointestinal symptoms questionnaires, perceived stress questionnaires, physical activity questionnaires, and sleep questionnaires | We would like to thank the following individuals for their significant work in curation and annotation of the GFKB:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://hive.biochemistry.gwu.edu/gfkb",
    "lastUpdate": "2020-12-03T11:15:40.178200Z",
    "name": "gfkb",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0206484",
            "metadata": {
                "abstract": "© 2019 Public Library of Science. All rights reserved.A comprehensive knowledge of the types and ratios of microbes that inhabit the healthy human gut is necessary before any kind of pre-clinical or clinical study can be performed that attempts to alter the microbiome to treat a condition or improve therapy outcome. To address this need we present an innovative scalable comprehensive analysis workflow, a healthy human reference microbiome list and abundance profile (GutFeelingKB), and a novel Fecal Biome Population Report (FecalBiome) with clinical applicability. GutFeelingKB provides a list of 157 organisms (8 phyla, 18 classes, 23 orders, 38 families, 59 genera and 109 species) that forms the baseline biome and therefore can be used as healthy controls for studies related to dysbiosis. This list can be expanded to 863 organisms if closely related proteomes are considered. The incorporation of microbiome science into routine clinical practice necessitates a standard report for comparison of an individual's microbiome to the growing knowledgebase of “normal” microbiome data. The FecalBiome and the underlying technology of GutFeelingKB address this need. The knowledgebase can be useful to regulatory agencies for the assessment of fecal transplant and other microbiome products, as it contains a list of organisms from healthy individuals. In addition to the list of organisms and their abundances, this study also generated a collection of assembled contiguous sequences (contigs) of metagenomics dark matter. In this study, metagenomic dark matter represents sequences that cannot be mapped to any known sequence but can be assembled into contigs of 10,000 nucleotides or higher. These sequences can be used to create primers to study potential novel organisms.",
                "authors": [
                    {
                        "name": "King C.H."
                    },
                    {
                        "name": "Desai H."
                    },
                    {
                        "name": "Sylvetsky A.C."
                    },
                    {
                        "name": "LoTempio J."
                    },
                    {
                        "name": "Ayanyan S."
                    },
                    {
                        "name": "Carrie J."
                    },
                    {
                        "name": "Crandall K.A."
                    },
                    {
                        "name": "Fochtman B.C."
                    },
                    {
                        "name": "Gasparyan L."
                    },
                    {
                        "name": "Gulzar N."
                    },
                    {
                        "name": "Howell P."
                    },
                    {
                        "name": "Issa N."
                    },
                    {
                        "name": "Krampis K."
                    },
                    {
                        "name": "Mishra L."
                    },
                    {
                        "name": "Morizono H."
                    },
                    {
                        "name": "Pisegna J.R."
                    },
                    {
                        "name": "Rao S."
                    },
                    {
                        "name": "Ren Y."
                    },
                    {
                        "name": "Simonyan V."
                    },
                    {
                        "name": "Smith K."
                    },
                    {
                        "name": "VedBrat S."
                    },
                    {
                        "name": "Yao M.D."
                    },
                    {
                        "name": "Mazumder R."
                    }
                ],
                "citationCount": 13,
                "date": "2019-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Baseline human gut microbiota profile in healthy people and standard reporting template"
            },
            "pmcid": "PMC6738582",
            "pmid": "31509535"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}