{
    "additionDate": "2020-01-14T19:34:28Z",
    "biotoolsCURIE": "biotools:Bigram-PGK",
    "biotoolsID": "Bigram-PGK",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "abelavit@gmail.com",
            "name": "Abel Chandra",
            "orcidid": "https://orcid.org/0000-0001-8497-028X",
            "typeEntity": "Person"
        },
        {
            "email": "alok.sharma@griffith.edu.au",
            "name": "Alok Sharma",
            "typeEntity": "Person"
        }
    ],
    "description": "phosphoglycerylation prediction using the technique of bigram probabilities of position specific scoring matrix.\n\nPhosphoglycerylation prediction using evolutionary information of amino acids.\n\nRun the file Bigram_PGK.m to obtain statistical measures of the Bigram_PGK predictor. The algorithm runs on the train and test data to obtain the values.\n\nPreprocessing_BigramPGK.m file was used to carry out preprocessing for Bigram_PGK predictor, which includes feature extraction for segment size of ±32, filtering, and construction of train and test sets for 10-fold cross-validation. Everytime the algorithm is executed, it will have a slightly different combination of samples for train and test sets. Nevertheless, the performance will be similar",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/abelavit/Bigram-PGK",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-05T14:36:42.270150Z",
    "name": "Bigram-PGK",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12860-019-0240-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The biological process known as post-translational modification (PTM) is a condition whereby proteomes are modified that affects normal cell biology, and hence the pathogenesis. A number of PTMs have been discovered in the recent years and lysine phosphoglycerylation is one of the fairly recent developments. Even with a large number of proteins being sequenced in the post-genomic era, the identification of phosphoglycerylation remains a big challenge due to factors such as cost, time consumption and inefficiency involved in the experimental efforts. To overcome this issue, computational techniques have emerged to accurately identify phosphoglycerylated lysine residues. However, the computational techniques proposed so far hold limitations to correctly predict this covalent modification. Results: We propose a new predictor in this paper called Bigram-PGK which uses evolutionary information of amino acids to try and predict phosphoglycerylated sites. The benchmark dataset which contains experimentally labelled sites is employed for this purpose and profile bigram occurrences is calculated from position specific scoring matrices of amino acids in the protein sequences. The statistical measures of this work, such as sensitivity, specificity, precision, accuracy, Mathews correlation coefficient and area under ROC curve have been reported to be 0.9642, 0.8973, 0.8253, 0.9193, 0.8330, 0.9306, respectively. Conclusions: The proposed predictor, based on the feature of evolutionary information and support vector machine classifier, has shown great potential to effectively predict phosphoglycerylated and non-phosphoglycerylated lysine residues when compared against the existing predictors. The data and software of this work can be acquired from https://github.com/abelavit/Bigram-PGK.",
                "authors": [
                    {
                        "name": "Chandra A."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Dehzangi A."
                    },
                    {
                        "name": "Shigemizu D."
                    },
                    {
                        "name": "Tsunoda T."
                    }
                ],
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Molecular and Cell Biology",
                "title": "Bigram-PGK: Phosphoglycerylation prediction using the technique of bigram probabilities of position specific scoring matrix"
            },
            "pmcid": "PMC6923822",
            "pmid": "31856704"
        }
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}