{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-09-27T07:36:17.637903Z",
    "biotoolsCURIE": "biotools:iddrra",
    "biotoolsID": "iddrra",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "gkagad@gmail.com",
            "name": "George C. Kagadis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "IDDRRA is a software that allows the user to design and model a DNA molecule, irradiate it with various types of radiation included in the Geant4 physics models, and then analyze the simulation outcome in terms of Single Strand Breaks (SSB), Double Strand Breaks (DSB), Cluster Damage Sites (CDS) and energy deposition. IDDRRA, combines powerful tools in a single platform, providing the ability to quantify DNA damage and DNA damage repair using MC forecast algorithms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://3dmi.upatras.gr/IDDRRA",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-09-27T07:36:41.665537Z",
    "name": "IDDRRA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/MP.14817",
            "metadata": {
                "abstract": "© 2021 American Association of Physicists in MedicinePurpose: This study proposes a novel computational platform that we refer to as IDDRRA (DNA Damage Response to Ionizing RAdiation), which uses Monte Carlo (MC) simulations to score radiation induced DNA damage. MC simulations provide results of high accuracy on the interaction of radiation with matter while scoring the energy deposition based on state-of-the-art physics and chemistry models and probabilistic methods. Methods: The IDDRRA software is based on the Geant4-DNA toolkit together with new tools that were developed for the purpose of this study, including a new algorithm that was developed in Python for the design of the DNA molecules. New classes were developed in C++ to integrate the GUI and produce the simulation’s output in text format. An algorithm was also developed to analyze the simulation’s output in terms of energy deposition, Single Strand Breaks (SSB), Double Strand Breaks (DSB) and Cluster Damage Sites (CDS). Finally, a new tool was developed to implement probabilistic SSB and DSB repair models using MC techniques. Results: This article provides the first benchmarks that the user of the IDDRRA tool can use to validate the functionality of the software as well as to provide a starting point to produce different types of DNA simulations. These benchmarks incorporate different kind of particles (e-, e+, protons, electron spectrum) and DNA molecules. Conclusion: We have developed the IDDRRA tool and demonstrated its use to study various aspects of the modeling and simulation of a DNA irradiation experiment. The tool is expandable and can be expanded by other users with new benchmarks and applications based on the user’s needs and experience. New functionality will be added over time, including the quantification of the indirect damage.",
                "authors": [
                    {
                        "name": "Chatzipapas K.P."
                    },
                    {
                        "name": "Kagadis G.C."
                    },
                    {
                        "name": "Loudos G."
                    },
                    {
                        "name": "Papadimitroulas P."
                    },
                    {
                        "name": "Papanikolaou N."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "IDDRRA: A novel platform, based on Geant4-DNA to quantify DNA damage by ionizing radiation"
            },
            "pmid": "33657650",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
