{
    "additionDate": "2024-06-19T08:25:44.376008Z",
    "biotoolsCURIE": "biotools:metatron",
    "biotoolsID": "metatron",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ornella.irrera@unipd.it",
            "name": "Ornella Irrera",
            "typeEntity": "Person"
        }
    ],
    "description": "Advancing biomedical annotation empowering relation annotation and collaboration.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://metatron.dei.unipd.it/demo"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://metatron.dei.unipd.it",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-06-19T08:25:44.378194Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/GDAMining/metatron"
        }
    ],
    "name": "MetaTron",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05730-9",
            "metadata": {
                "abstract": "Background: The constant growth of biomedical data is accompanied by the need for new methodologies to effectively and efficiently extract machine-readable knowledge for training and testing purposes. A crucial aspect in this regard is creating large, often manually or semi-manually, annotated corpora vital for developing effective and efficient methods for tasks like relation extraction, topic recognition, and entity linking. However, manual annotation is expensive and time-consuming especially if not assisted by interactive, intuitive, and collaborative computer-aided tools. To support healthcare experts in the annotation process and foster annotated corpora creation, we present MetaTron. MetaTron is an open-source and free-to-use web-based annotation tool to annotate biomedical data interactively and collaboratively; it supports both mention-level and document-level annotations also integrating automatic built-in predictions. Moreover, MetaTron enables relation annotation with the support of ontologies, functionalities often overlooked by off-the-shelf annotation tools. Results: We conducted a qualitative analysis to compare MetaTron with a set of manual annotation tools including TeamTat, INCEpTION, LightTag, MedTAG, and brat, on three sets of criteria: technical, data, and functional. A quantitative evaluation allowed us to assess MetaTron performances in terms of time and number of clicks to annotate a set of documents. The results indicated that MetaTron fulfills almost all the selected criteria and achieves the best performances. Conclusions: MetaTron stands out as one of the few annotation tools targeting the biomedical domain supporting the annotation of relations, and fully customizable with documents in several formats—PDF included, as well as abstracts retrieved from PubMed, Semantic Scholar, and OpenAIRE. To meet any user need, we released MetaTron both as an online instance and as a Docker image locally deployable.",
                "authors": [
                    {
                        "name": "Irrera O."
                    },
                    {
                        "name": "Marchesin S."
                    },
                    {
                        "name": "Silvello G."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaTron: advancing biomedical annotation empowering relation annotation and collaboration"
            },
            "pmcid": "PMC10941452",
            "pmid": "38486137"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
