{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:05:08Z",
    "biotoolsCURIE": "biotools:MorphoCatcher",
    "biotoolsID": "MorphoCatcher",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shrshkv@ya.ru",
            "name": "Fedor V. Shirshikov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multiple-alignment based web tool for target selection and designing taxon-specific primers in the loop-mediated isothermal amplification method.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/shrshkv/MorphoCatcher/blob/master/Manual.pdf"
        },
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://github.com/shrshkv/MorphoCatcher/blob/master/Tutorials.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://morphocatcher.ru",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/shrshkv/MorphoCatcher"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/shrshkv/MorphoCatcher/issues"
        }
    ],
    "maturity": "Mature",
    "name": "MorphoCatcher",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.7717/PEERJ.6801",
            "metadata": {
                "abstract": "© Copyright 2019 Shirshikov et al.Background. Advantages of loop-mediated isothermal amplification in molecular diagnostics allow to consider the method as a promising technology of nucleic acid detection in agriculture and medicine. A bioinformatics tool that provides rapid screening and selection of target nucleotide sequences with subsequent taxon-specific primer design toward polymorphic orthologous genes, not only unique or conserved common regions of genome, would contribute to the development of more specific and sensitive diagnostic assays. However, considering features of the original software for primer selection, also known as the PrimerExplorer (Eiken Chemical Co. LTD, Tokyo, Japan), the taxon-specific primer design using multiple sequence alignments of orthologs or even viral genomes with conservative architecture is still complicated. Findings. Here, MorphoCatcher is introduced as a fast and simple web plugin for PrimerExplorer with a clear interface. It enables an execution of multiple-alignment based search of taxon-specific mutations, visual screening and selection of target sequences, and easy-to-start specific primer design using the PrimerExplorer software. The combination of MorphoCatcher and PrimerExplorer allows to perform processing of the multiple alignments of orthologs for informative sliding-window plot analysis, which is used to identify the sequence regions with a high density of taxon-specific mutations and cover them by the primer ends for better specificity of amplification. Conclusions. We hope that this new bioinformatics tool developed for target selection and taxon-specific primer design, called the MorphoCatcher, will gain more popularity of the loop-mediated isothermal amplification method for molecular diagnostics community. MorphoCatcher is a simple web plugin tool for the PrimerExplorer software which is freely available only for non-commercial and academic users at http://morphocatcher.ru.",
                "authors": [
                    {
                        "name": "Shirshikov F.V."
                    },
                    {
                        "name": "Pekov Y.A."
                    },
                    {
                        "name": "Miroshnikov K.A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "MorphoCatcher: A multiple-alignment based web tool for target selection and designing taxon-specific primers in the loop-mediated isothermal amplification method"
            },
            "pmcid": "PMC6487805",
            "pmid": "31086739",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}