{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T15:28:53.820442Z",
    "biotoolsCURIE": "biotools:sciae",
    "biotoolsID": "sciae",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jtguan@xmu.edu.cn",
            "name": "Jinting Guan",
            "orcidid": "https://orcid.org/0000-0001-9433-5677",
            "typeEntity": "Person"
        },
        {
            "name": "Guoli Ji"
        },
        {
            "name": "Qingyang Yin"
        },
        {
            "name": "Yang Wang"
        }
    ],
    "description": "An integrative autoencoder-based ensemble classification framework for single-cell RNA-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JGuan-lab/scIAE",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-05-17T15:28:53.823133Z",
    "license": "Not licensed",
    "name": "scIAE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB508",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved.Single-cell RNA sequencing (scRNA-seq) allows quantitative analysis of gene expression at the level of single cells, beneficial to study cell heterogeneity. The recognition of cell types facilitates the construction of cell atlas in complex tissues or organisms, which is the basis of almost all downstream scRNA-seq data analyses. Using disease-related scRNA-seq data to perform the prediction of disease status can facilitate the specific diagnosis and personalized treatment of disease. Since single-cell gene expression data are high-dimensional and sparse with dropouts, we propose scIAE, an integrative autoencoder-based ensemble classification framework, to firstly perform multiple random projections and apply integrative and devisable autoencoders (integrating stacked, denoising and sparse autoencoders) to obtain compressed representations. Then base classifiers are built on the lower-dimensional representations and the predictions from all base models are integrated. The comparison of scIAE and common feature extraction methods shows that scIAE is effective and robust, independent of the choice of dimension, which is beneficial to subsequent cell classification. By testing scIAE on different types of data and comparing it with existing general and single-cell–specific classification methods, it is proven that scIAE has a great classification power in cell type annotation intradataset, across batches, across platforms and across species, and also disease status prediction. The architecture of scIAE is flexible and devisable, and it is available at https://github.com/JGuan-lab/scIAE.",
                "authors": [
                    {
                        "name": "Guan J."
                    },
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yin Q."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "scIAE: an integrative autoencoder-based ensemble classification framework for single-cell RNA-seq data"
            },
            "pmid": "34913057"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
