{
    "additionDate": "2021-01-18T12:07:00Z",
    "biotoolsCURIE": "biotools:jpsa",
    "biotoolsID": "jpsa",
    "confidence_flag": "tool",
    "description": "Joint and Progressive Subspace Analysis (JPSA) is a linearized subspace analysis technique with spatial-spectral manifold alignment is developed for a semisupervised hyperspectral dimensionality reduction (HDR).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/danfenghong/ECCV2018_J-Play",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-05T15:26:32Z",
    "name": "JPSA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCYB.2020.3028931",
            "metadata": {
                "abstract": "© 2019 IEEE.Conventional nonlinear subspace learning techniques (e.g., manifold learning) usually introduce some drawbacks in explainability (explicit mapping) and cost effectiveness (linearization), generalization capability (out-of-sample), and representability (spatial-spectral discrimination). To overcome these shortcomings, a novel linearized subspace analysis technique with spatial-spectral manifold alignment is developed for a semisupervised hyperspectral dimensionality reduction (HDR), called joint and progressive subspace analysis (JPSA). The JPSA learns a high-level, semantically meaningful, joint spatial-spectral feature representation from hyperspectral (HS) data by: 1) jointly learning latent subspaces and a linear classifier to find an effective projection direction favorable for classification; 2) progressively searching several intermediate states of subspaces to approach an optimal mapping from the original space to a potential more discriminative subspace; and 3) spatially and spectrally aligning a manifold structure in each learned latent subspace in order to preserve the same or similar topological property between the compressed data and the original data. A simple but effective classifier, that is, nearest neighbor (NN), is explored as a potential application for validating the algorithm performance of different HDR approaches. Extensive experiments are conducted to demonstrate the superiority and effectiveness of the proposed JPSA on two widely used HS datasets: 1) Indian Pines (92.98%) and 2) the University of Houston (86.09%) in comparison with previous state-of-the-art HDR methods. The demo of this basic work (i.e., ECCV2018) is openly available at https://github.com/danfenghong/ECCV2018-J-Play.",
                "authors": [
                    {
                        "name": "Chanussot J."
                    },
                    {
                        "name": "Hong D."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Yokoya N."
                    },
                    {
                        "name": "Zhu X.X."
                    }
                ],
                "citationCount": 5,
                "date": "2021-07-01T00:00:00Z",
                "journal": "IEEE Transactions on Cybernetics",
                "title": "Joint and Progressive Subspace Analysis (JPSA) with Spatial-Spectral Manifold Alignment for Semisupervised Hyperspectral Dimensionality Reduction"
            },
            "pmid": "33175688"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}
