{
    "additionDate": "2019-11-14T18:37:19Z",
    "biotoolsCURIE": "biotools:ABCharge",
    "biotoolsID": "ABCharge",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tring@gvdnet.dk",
            "name": "Troels Ring",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package to calculate equilibirum conditions with and without correction for ionic strength using Davies' equation.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/troelsring/ABCharge",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-11T14:44:38Z",
    "name": "ABCharge",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.9B00270",
            "metadata": {
                "abstract": "© 2019 American Chemical Society. In this study, we show that equilibrium pH can be obtained for any specified fluid with any number of buffers and dissociations. This is done by root finding in the equation for charge balance. We demonstrate that this equation is monotonic in proton concentration for conceivable buffers. We show that the total charge on any buffer is a function of only the total buffer concentration and pH, given the thermodynamic dissociation constants. Using the Davies' equation as a placeholder for single-ion activity coefficients as a function of charge and ionic strength, we develop an iterative algorithm, whereby the apparent dissociation constants are updated from the thermodynamic dissociation constants, and from this, the equilibrium is also identified in the nonideal state. We show how this algebra leads to guaranteed conservation of both thermodynamic dissociation constants and total buffer concentrations because the distribution of buffer species is fixed by the updated dissociation constants, actual pH, and total buffer concentration. Strong ions are assumed to contribute fixed charges. In order to concentrate on the process of modeling the equilibrium pH alone, this algorithm is examined against a series of theoretical results in which the Davies' equation was given the same status. However, a large sample of clinical pH measurements is also examined. To enhance the practical utility, CO 2 and albumin are present as the default condition. We developed \"ABCharge\", a package in R, an open source language. The main function returns pH, activity coefficients, buffer species distribution, ionic strength, and charge balance for both the ideal and nonideal cases, for any mixture of any buffers with any number of known thermodynamic dissociation constants. Our algorithm can be updated if a more reliable and practical assessment of single-ion activities becomes available. Can Stock Photo/miceking.",
                "authors": [
                    {
                        "name": "Ring T."
                    },
                    {
                        "name": "Kellum J.A."
                    }
                ],
                "date": "2019-04-09T00:00:00Z",
                "journal": "ACS Omega",
                "title": "Modeling Acid-Base by Minimizing Charge-Balance"
            },
            "pmcid": "PMC6648237",
            "pmid": "31459783"
        }
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}