{
    "additionDate": "2020-01-14T19:35:10Z",
    "biotoolsCURIE": "biotools:VEF",
    "biotoolsID": "VEF",
    "confidence_flag": "tool",
    "description": "a Variant Filtering tool based on Ensemble methods.\n\nVariant Ensemble Filter, an ensemble based filter for VCF files.\n\nVEF is designed for filtering variants of single non-cancerous samples.\n\nThis bash script calls example script vef_clf.py and vef_apl.py located in the example/ directory to train and apply the filter, respectively. After running test.sh, there will be 2 filter models in example/data with the .clf extension, along with 2 filtered VCF files with the .vef.vcf extension",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "http://github.com/ChuanyiZ/vef",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-01-02T14:45:48Z",
    "license": "MIT",
    "name": "VEF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ952",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Variants identified by current genomic analysis pipelines contain many incorrectly called variants. These can be potentially eliminated by applying state-of-The-Art filtering tools, such as Variant Quality Score Recalibration (VQSR) or Hard Filtering (HF). However, these methods are very user-dependent and fail to run in some cases. We propose VEF, a variant filtering tool based on decision tree ensemble methods that overcomes the main drawbacks of VQSR and HF. Contrary to these methods, we treat filtering as a supervised learning problem, using variant call data with known 'true' variants, i.e. gold standard, for training. Once trained, VEF can be directly applied to filter the variants contained in a given Variants Call Format (VCF) file (we consider training and testing VCF files generated with the same tools, as we assume they will share feature characteristics). Results: For the analysis, we used whole genome sequencing (WGS) Human datasets for which the gold standards are available. We show on these data that the proposed filtering tool VEF consistently outperforms VQSR and HF. In addition, we show that VEF generalizes well even when some features have missing values, when the training and testing datasets differ in coverage, and when sequencing pipelines other than GATK are used. Finally, since the training needs to be performed only once, there is a significant saving in running time when compared with VQSR (4 versus 50 min approximately for filtering the single nucleotide polymorphisms of a WGS Human sample).",
                "authors": [
                    {
                        "name": "Ochoa I."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VEF: A variant filtering tool based on ensemble methods"
            },
            "pmid": "31873730"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
