{
    "additionDate": "2021-01-18T07:10:26Z",
    "biotoolsCURIE": "biotools:cnadbcc",
    "biotoolsID": "cnadbcc",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Ping Yang",
            "typeEntity": "Person"
        },
        {
            "name": "Haoyang Cai",
            "typeEntity": "Person"
        }
    ],
    "description": "CNAdbCC is a curated database for copy number aberrations analysis and visualization of cervical cancer. Currently, the database contains about 1,000 dataset samples mainly integrated by affymetrix and aligent platform. Affymetrix is based on light-controlled situ synthesis of DNA microarrays, and is the highest density and widely used chip preparation technology. In addition, agilent aCGH (array-based Comparative Genomic Hybridization) platform also provides high performance, high resolution chip data. The raw array data were collected from GEO (Gene Expression Omnibus) and TCGA (The Cancer GenomeAtlas) databases. Genomic DNA copy number variations (CNVs), a type of structure variations, is one of the key hallmarks of carcinogenesis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://cailab.labshare.cn/CNAdbCC/",
    "language": [
        "PHP",
        "Perl",
        "R"
    ],
    "lastUpdate": "2021-02-13T19:26:27Z",
    "name": "CNAdbCC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S00438-019-01636-X",
            "metadata": {
                "abstract": "© 2020, Springer-Verlag GmbH Germany, part of Springer Nature.Cervical cancer is a common gynecological malignancy with high incidence and mortality. Somatic copy number alterations (CNAs) play an important role in identifying tumor suppressor genes and oncogenes and are a useful diagnostic indicator for many cancer types. However, the genomic landscape of CNAs in cervical cancer has not yet been comprehensively characterized. In the present study, we collected 974 cervical cancer samples from different data sources. All samples were analyzed by genomic arrays to obtain high-resolution CNAs. Focal genomic regions with CNA events and potential cancer driver genes were identified by GISTIC2.0. Meanwhile, we constructed a comprehensive cervical cancer database by PHP and self-written Perl and R scripts. In total, 54 recurrent regions of amplification and deletion were detected. Frequently altered tumor suppressor genes were found in these regions, including PIK3CA, ERBB2, EP300 and FBXW7. CNA hotspots and related enriched functional categories were also identified. The incidence of chromothripsis in cervical cancer was estimated to be 6.06%, and the chromosome pulverization hotspot regions were detected. Based on the curated data, we developed CNAdbCC (http://cailab.labshare.cn/CNAdbCC/), a comprehensive database for copy number alterations in cervical cancer. We provide a user-friendly Web interface for data mining and visualization. It is the most comprehensive public database devoted exclusively to genomic alterations in cervical cancer. These results extend our molecular understanding of cervical cancer. The database will enable researchers to explore specific CNA patterns in this lethal cancer and facilitate the discovery of therapeutic candidates.",
                "authors": [
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Yang P."
                    },
                    {
                        "name": "Cai H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomics",
                "title": "Genome-wide somatic copy number alteration analysis and database construction for cervical cancer"
            },
            "pmid": "31901979"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}