{
    "additionDate": "2021-01-18T09:25:24Z",
    "biotoolsCURIE": "biotools:vitivar",
    "biotoolsID": "vitivar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ddash@igib.res.in",
            "name": "Debasis Dash",
            "typeEntity": "Person"
        },
        {
            "email": "tnvivek@igib.in",
            "name": "Vivek T. Natarajan",
            "typeEntity": "Person"
        }
    ],
    "description": "A locus specific database of vitiligo associated genes and variations.\n\nVitiligo is a complex skin depigmentation disorder characterized by the patchy loss of skin pigmentation.\n\nVitiligo in-house expression data from lesional and non-lesional epidermal tissue.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://vitivar.igib.res.in/",
    "lastUpdate": "2021-03-13T15:09:08Z",
    "name": "VitiVar",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.GENE.2019.100018",
            "metadata": {
                "abstract": "© 2019Vitiligo is the most common skin pigmentation disorder which affects around 1% of the population worldwide. The disease has complex pathogenesis and is of multifactorial etiology, that finally culminates in patchy depigmentation of skin. Genetic contribution to the disease is well studied, however the information about multiple associated genes and contributing variations are scattered across the literature. To address this complex disorder affecting the skin, we systematically cataloged the genes and variations by creating a Locus Specific Database for vitiligo called, “VitiVar”. This comprehensive resource houses manually curated 322 genes and 254 variations, from 202 articles indexed in PubMed. We applied an integrative approach to stratify genes and variations to facilitate dissection of vitiligo pathogenesis by layering it with expression status in specific constituent cell types of skin and in-house vitiligo expression data. Finally, we were able to demonstrate the utility of VitiVar by generating a vitiligo interactome using GeneMANIA and overlaying the vitiligo and cell type specific information. This interaction network yielded 20 new genes (apart from 322 VitiVar genes)of which we were able to prioritize IFI27 and IFI6 for further validation. This, thereby makes VitiVar a comprehensive integrative platform in unravelling disease biology by providing meaningful leads for functional interrogation. VitiVar is freely accessible to the research community for prioritizing and validating the candidate genes and variations (http://vitivar.igib.res.in/).",
                "authors": [
                    {
                        "name": "Dash D."
                    },
                    {
                        "name": "Gupta I."
                    },
                    {
                        "name": "Khanna S."
                    },
                    {
                        "name": "Manchanda V."
                    },
                    {
                        "name": "Mukerji M."
                    },
                    {
                        "name": "Narang A."
                    },
                    {
                        "name": "Natarajan V.T."
                    },
                    {
                        "name": "Singh P."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Gene: X",
                "title": "VitiVar: A locus specific database of vitiligo associated genes and variations"
            },
            "pmcid": "PMC7286000",
            "pmid": "32550548"
        }
    ],
    "topic": [
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
