{
    "additionDate": "2020-01-14T09:37:24Z",
    "biotoolsCURIE": "biotools:GSE44076",
    "biotoolsID": "GSE44076",
    "confidence_flag": "medium",
    "description": "Gene expression and methylation profiles identified CXCL3 and CXCL8 as key genes for diagnosis and prognosis of colon adenocarcinoma.\n\nNCBI's Gene Expression Omnibus (GEO) is a public archive and resource for gene expression data.\n\nGEO help: Mouse over screen elements for information.\n\nScope: Self Platform Samples Series Family Format: HTML SOFT MINiML Amount: Brief Quick GEO accession:.\n\n||| NAME (GSE44076) SIMILAR TO (PUB. DIFFERENT) bio.tools/GSE33335 (GSE33335), bio.tools/GSE56348 (GSE56348), bio.tools/GSE117578 (GSE117578), bio.tools/gse (GSE).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'CXCL3 CXCL8', 'COAD', 'CXCL8', 'CXCL3 CXCL8 COAD'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE44076",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2020-01-14T09:37:24Z",
    "name": "GSE44076",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JCP.29368",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Colon adenocarcinoma (COAD) is one of the most common malignant tumors with high morbidity and mortality rates worldwide. Due to the poor clinical outcomes, it is indispensable to investigate novel biomarkers for the diagnosis and prognosis of COAD. The aim of this study is to explore key genes as potential biomarkers for the diagnosis and prognosis of COAD for clinical utility. Gene expression profiles (GSE44076 and GSE44861) and gene methylation profile (GSE29490) were analyzed to identify the aberrantly methylated-differentially expressed genes by R language and Perl software. Function enrichments were performed by Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway. Moreover, hub genes were identified through protein–protein interaction (PPI) network. Besides, key genes were found by the module analysis and The Cancer Genome Atlas (TCGA) survival analysis. Finally, TCGA data and quantitative real-time polymerase chain reaction (RT-qPCR) was used to validate the key genes involved in COAD. Our study found two hypomethylation-high-expression genes (CXCL3 and CXCL8) in COAD tissues compared with the adjacent normal tissues. These results were also confirmed by RT-qPCR with 25 pairs of COAD and adjacent normal tissues. Meanwhile, low expression of the two genes was associated with poor survival in patients with COAD. CXCL3 and CXCL8 may serve as key genes in the diagnosis and prognosis for COAD.",
                "authors": [
                    {
                        "name": "Zhao Q.-Q."
                    },
                    {
                        "name": "Jiang C."
                    },
                    {
                        "name": "Gao Q."
                    },
                    {
                        "name": "Zhang Y.-Y."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Chen X.-P."
                    },
                    {
                        "name": "Wu S.-B."
                    },
                    {
                        "name": "Tang J."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Cellular Physiology",
                "title": "Gene expression and methylation profiles identified CXCL3 and CXCL8 as key genes for diagnosis and prognosis of colon adenocarcinoma"
            },
            "pmid": "31709538"
        }
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}