{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.imtech.res.in/raghava/antibp/team.html"}],"documentation":[{"type":"GENERAL","url":"http://crdd.osdd.net/raghava/antibp/help.html"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"},{"term":"Peptides","uri":"http://edamontology.org/topic_0154"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/antibp-prediction-of-the-antibacterial-peptides.html"}],"publication":[{"abstract":"Background: Antibacterial peptides are important components of the innate immune system, used by the host to protect itself from different types of pathogenic bacteria. Over the last few decades, the search for new drugs and drug targets has prompted an interest in these antibacterial peptides. We analyzed 486 antibacterial peptides, obtained from antimicrobial peptide database APD, in order to understand the preference of amino acid residues at specific positions in these peptides. Results: It was observed that certain types of residues are preferred over others in antibacterial peptides, particularly at the N and C terminus. These observations encouraged us to develop a method for predicting antibacterial peptides in proteins from their amino acid sequence. First, the N-terminal residues were used for predicting antibacterial peptides using Artificial Neural Network (ANN), Quantitative Matrices (QM) and Support Vector Machine (SVM), which resulted in an accuracy of 83.63%, 84.78% and 87.85%, respectively. Then, the C-terminal residues were used for developing prediction methods, which resulted in an accuracy of 77.34%, 82.03% and 85.16% using ANN, QM and SVM, respectively. Finally, ANN, QM and SVM models were developed using N and C terminal residues, which achieved an accuracy of 88.17%, 90.37% and 92.11%, respectively. All the models developed in this study were evaluated using five-fold cross validation technique. These models were also tested on an independent or blind dataset. Conclusion: Among antibacterial peptides, there is preference for certain residues at N and C termini, which helps to demarcate them from non-antibacterial peptides. Both the termini play a crucial role in imparting the antibacterial property to these peptides. Among the methods developed, SVM shows the best performance in predicting antibacterial peptides followed by QM and ANN, in that order. AntiBP (Antibacterial peptides) will help in discovering efficacious antibacterial peptides, which we hope will prove to be a boon to combat the dreadful antibiotic resistant bacteria. A user friendly web server has also been developed to help the biological community, which is accessible at http://www.imtech.res.in/raghava/antibp/. © 2007 Lata et al; licensee BioMed Central Ltd.","authors":["Lata S.","Sharma B.K.","Raghava G.P.S."],"cit_count":124,"doi":"10.1186/1471-2105-8-263","journal":"BMC Bioinformatics","title":"Analysis and prediction of antibacterial peptides","type":"Primary","year":"2007-07-23"}],"summary":{"biotoolsCURIE":"biotools:antibp","biotoolsID":"antibp","description":"Antibp server predicts the antibacterial peptides in a protein sequence.Prediction can be done by using QM,ANN and SVM based methods using binary patterns of peptide sequences and overall accuracy of this server is ~92.11%.This server can help in finding and designing of peptides based antibiotics.","homepage":"http://www.imtech.res.in/raghava/antibp/","name":"AntiBP"}}