{
    "additionDate": "2018-05-09T16:28:42Z",
    "biotoolsCURIE": "biotools:mieaa",
    "biotoolsID": "mieaa",
    "credit": [
        {
            "email": "c.backes@mx.uni-saarland.de",
            "name": "Backes C",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MicroRNA enrichment analysis and annotation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ccb-compute2.cs.uni-saarland.de/mieaa_tool/tutorial/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "https://ccb-compute2.cs.uni-saarland.de/mieaa_tool/",
    "lastUpdate": "2024-11-24T14:21:21.680171Z",
    "name": "miEAA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/nar/gkad392",
            "metadata": {
                "abstract": "MicroRNAs (miRNAs) are small non-coding RNAs that play a critical role in regulating diverse biological processes. Extracting functional insights from a list of miRNAs is challenging, as each miRNA can potentially interact with hundreds of genes. To address this challenge, we developed miEAA, a flexible and comprehensive miRNA enrichment analysis tool based on direct and indirect miRNA annotation. The latest release of miEAA includes a data warehouse of 19 miRNA repositories, covering 10 different organisms and 139 399 functional categories. We have added information on the cellular context of miRNAs, isomiRs, and high-confidence miRNAs to improve the accuracy of the results. We have also improved the representation of aggregated results, including interactive Upset plots to aid users in understanding the interaction among enriched terms or categories. Finally, we demonstrate the functionality of miEAA in the context of ageing and highlight the importance of carefully considering the miRNA input list. MiEAA is free to use and publicly available at https://www.ccb.uni-saarland.de/mieaa/.",
                "authors": [
                    {
                        "name": "Aparicio-Puerta E."
                    },
                    {
                        "name": "Fehlmann T."
                    },
                    {
                        "name": "Hirsch P."
                    },
                    {
                        "name": "Keller A."
                    },
                    {
                        "name": "Kern F."
                    },
                    {
                        "name": "Schmartz G.P."
                    }
                ],
                "citationCount": 27,
                "date": "2023-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MiEAA 2023: Updates, new functional microRNA sets and improved enrichment visualizations"
            },
            "pmcid": "PMC10320052",
            "pmid": "37177999"
        },
        {
            "doi": "10.1093/nar/gkw345",
            "metadata": {
                "abstract": "Similar to the development of gene set enrichment and gene regulatory network analysis tools over a decade ago, microRNA enrichment tools are currently gaining importance. Building on our experience with the gene set analysis toolkit GeneTrail, we implemented the miRNA Enrichment Analysis and Annotation tool (miEAA). MiEAA is a web-based application that offers a variety of commonly applied statistical tests such as over-representation analysis and miRNA set enrichment analysis, which is similar to Gene Set Enrichment Analysis. Besides the different statistical tests, miEAA also provides rich functionality in terms of miRNA categories. Altogether, over 14 000 miRNA sets have been added, including pathways, diseases, organs and target genes. Importantly, our tool can be applied for miRNA precursors as well as mature miRNAs. To make the tool as useful as possible we additionally implemented supporting tools such as converters between different miRBase versions and converters from miRNA names to precursor names. We evaluated the performance of miEAA on two sets of miRNAs that are affected in lung adenocarcinomas and have been detected by array analysis.",
                "authors": [
                    {
                        "name": "Backes C."
                    },
                    {
                        "name": "Keller A."
                    },
                    {
                        "name": "Khaleeq Q.T."
                    },
                    {
                        "name": "Meese E."
                    }
                ],
                "citationCount": 132,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MiEAA: MicroRNA enrichment analysis and annotation"
            },
            "pmcid": "PMC4987907",
            "pmid": "27131362"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
