{"credit":[{"email":"frederic.bois@ineris.fr","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.gnu.org/software/mcsim/mcsim.html"}],"function":[{"operation":[{"term":"Statistical inference","uri":"http://edamontology.org/operation_3658"}]}],"labels":{"language":["C"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Simulation experiment","uri":"http://edamontology.org/topic_3524"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/gnu-mcsim-5-4-0-simulation-statistical-inference-tool.html"}],"publication":[{"abstract":"Summary: Statistical inference about the parameter values of complex models, such as the ones routinely developed in systems biology, is efficiently performed through Bayesian numerical techniques. In that framework, prior information and multiple levels of uncertainty can be seamlessly integrated. GNU MCSim was precisely developed to achieve those aims, in a general non-linear differential context. Starting with version 5.3.0, GNU MCSim reads in and simulates Systems Biology Markup Language models. Markov chain Monte Carlo simulations can be used to generate samples from the joint posterior distribution of the model parameters, given a dataset and prior distributions. Hierarchical statistical models can be used. Optimal design of experiments can also be investigated. © The Author 2009. Published by Oxford University Press. All rights reserved.","authors":["Bois F.Y."],"cit_count":48,"journal":"Bioinformatics","pmid":"19304877","title":"GNU MCSim: Bayesian statistical inference for SBML-coded systems biology models","year":"2009-06-01"}],"summary":{"biotoolsCURIE":"biotools:gnu_mcsim","biotoolsID":"gnu_mcsim","description":"Simulation and statistical inference tool for algebraic or differential equation systems. Other programs have been created to the same end, the Matlab family of graphical interactive programs being some of the more general and easy to use. Still, many available tools are not optimal for performing computer intensive and sophisticated Monte Carlo analyses.","homepage":"http://www.gnu.org/software/mcsim/","name":"GNU MCSim"}}