{
    "additionDate": "2021-12-13T10:10:51.222005Z",
    "biotoolsCURIE": "biotools:tools4msp",
    "biotoolsID": "tools4msp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stefano.menegon@ismar.cnr.it",
            "name": "Stefano Menegon",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tools4MSP is a python-based Free and Open Source Software (FOSS) for geospatial analysis in support of Maritime Spatial Planning (MSP) and marine environmental management. Tools4MSP implements models for Cumulative Effects Assessment (CEA), Maritime Use Conflict (MUC) Analysis and Marine Ecosystem Services Threat (MES-Threat) analysis. The package can be used as stand-alone library or as integrated GeoNode Plugin providing additional functionalities to geospatial CMS and enhancing usability through a graphical user interface (GUI).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "http://data.tools4msp.eu",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-13T10:10:51.224513Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/CNR-ISMAR/tools4msp/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CNR-ISMAR/tools4msp"
        }
    ],
    "name": "Tools4MSP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ-CS.165",
            "metadata": {
                "abstract": "© 2018 Menegon et al.This paper presents the Tools4MSP software package, a Python-based Free and Open Source Software (FOSS) for geospatial analysis in support of Maritime Spatial Planning (MSP) and marine environmental management. The suite was initially developed within the ADRIPLAN data portal, that has been recently upgraded into the Tools4MSP Geoplatform (data.tools4msp.eu), an integrated web platform that supports MSP through the application of different tools, e.g., collaborative geospatial modelling of cumulative effects assessment (CEA) and marine use conflict (MUC) analysis. The package can be used as stand-alone library or as collaborative webtool, providing user- friendly interfaces appropriate to decision-makers, regional authorities, academics and MSP stakeholders. An effective MSP-oriented integrated system of web-based software, users and services is proposed. It includes four components: the Tools4MSP Geoplatform for interoperable and collaborative sharing of geospatial datasets and for MSP-oriented analysis, the Tools4MSP package as stand-alone library for advanced geospatial and statistical analysis, the desktop applications to simplify data curation and the third party data repositories for multidisciplinary and multilevel geospatial datasets integration. The paper presents an application example of the Tools4MSP GeoNode plugin and an example of Tools4MSP stand-alone library for CEA in the Adriatic Sea. The Tools4MSP and the developed software have been released as FOSS under the GPL 3 license and are currently under further development.",
                "authors": [
                    {
                        "name": "Barbanti A."
                    },
                    {
                        "name": "Depellegrin D."
                    },
                    {
                        "name": "Farella G."
                    },
                    {
                        "name": "Menegon S."
                    },
                    {
                        "name": "Sarretta A."
                    },
                    {
                        "name": "Venier C."
                    }
                ],
                "citationCount": 16,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PeerJ Computer Science",
                "title": "Tools4MSP: An open source software package to support Maritime Spatial Planning"
            },
            "pmcid": "PMC7924506",
            "pmid": "33816818",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
