{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2019-11-14T19:49:54Z",
    "biotoolsCURIE": "biotools:LONI-QC",
    "biotoolsID": "LONI-QC",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hosung.kim@loni.usc.edu",
            "name": "Hosung Kim",
            "typeEntity": "Person"
        },
        {
            "email": "Andrei.irimia@loni.usc.edu",
            "name": "Andrei Irimia",
            "typeEntity": "Person"
        }
    ],
    "description": "A Semi-Automated, Web-Based and Freely-Available Environment for the Comprehensive Quality Control of Neuroimaging Data | LONI Quality Control (LONI QC) is an imaging data review and assessment platform for human neuroimaging research studies involving one or more centers. LONI QC allows users to anonymously download imaging data from the LONI IDA and run a standardized quality control check via an automated pre-processing system specifically designed to generate a range of vector statistics and derived images",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                }
            ]
        }
    ],
    "homepage": "http://qc.loni.usc.edu",
    "lastUpdate": "2020-12-22T12:57:33Z",
    "name": "LONI-QC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNINF.2019.00060",
            "metadata": {
                "abstract": "© Copyright © 2019 Kim, Irimia, Hobel, Pogosyan, Tang, Petrosyan, Esquivel Castelo Blanco, Duffy, Zhao, Crawford, Liew, Clark, Law, Mukherjee, Manley, Van Horn and Toga.Quantifying, controlling, and monitoring image quality is an essential prerequisite for ensuring the validity and reproducibility of many types of neuroimaging data analyses. Implementation of quality control (QC) procedures is the key to ensuring that neuroimaging data are of high-quality and their validity in the subsequent analyses. We introduce the QC system of the Laboratory of Neuro Imaging (LONI): a web-based system featuring a workflow for the assessment of various modality and contrast brain imaging data. The design allows users to anonymously upload imaging data to the LONI-QC system. It then computes an exhaustive set of QC metrics which aids users to perform a standardized QC by generating a range of scalar and vector statistics. These procedures are performed in parallel using a large compute cluster. Finally, the system offers an automated QC procedure for structural MRI, which can flag each QC metric as being ‘good’ or ‘bad.’ Validation using various sets of data acquired from a single scanner and from multiple sites demonstrated the reproducibility of our QC metrics, and the sensitivity and specificity of the proposed Auto QC to ‘bad’ quality images in comparison to visual inspection. To the best of our knowledge, LONI-QC is the first online QC system that uniquely supports the variety of functionality where we compute numerous QC metrics and perform visual/automated image QC of multi-contrast and multi-modal brain imaging data. The LONI-QC system has been used to assess the quality of large neuroimaging datasets acquired as part of various multi-site studies such as the Transforming Research and Clinical Knowledge in Traumatic Brain Injury (TRACK-TBI) Study and the Alzheimer’s Disease Neuroimaging Initiative (ADNI). LONI-QC’s functionality is freely available to users worldwide and its adoption by imaging researchers is likely to contribute substantially to upholding high standards of brain image data quality and to implementing these standards across the neuroimaging community.",
                "authors": [
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Irimia A."
                    },
                    {
                        "name": "Hobel S.M."
                    },
                    {
                        "name": "Pogosyan M."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Petrosyan P."
                    },
                    {
                        "name": "Blanco R.E.C."
                    },
                    {
                        "name": "Duffy B.A."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Crawford K.L."
                    },
                    {
                        "name": "Liew S.-L."
                    },
                    {
                        "name": "Clark K."
                    },
                    {
                        "name": "Law M."
                    },
                    {
                        "name": "Mukherjee P."
                    },
                    {
                        "name": "Manley G.T."
                    },
                    {
                        "name": "Van Horn J.D."
                    },
                    {
                        "name": "Toga A.W."
                    }
                ],
                "citationCount": 9,
                "date": "2019-08-28T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "The LONI QC System: A Semi-Automated, Web-Based and Freely-Available Environment for the Comprehensive Quality Control of Neuroimaging Data"
            },
            "pmcid": "PMC6722229",
            "pmid": "31555116"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}