{
    "name": "LigMerge", 
    "description": "Novel drug-design algorithm which combines structures of known binders to generate similar but structurally distinct compounds that can be tested for binding.", 
    "homepage": "http://nbcr.ucsd.edu/data/sw/hosted/ligmerge/", 
    "biotoolsID": "ligmerge", 
    "biotoolsCURIE": "biotools:ligmerge", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2430", 
                    "term": "Design"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_3336", 
            "term": "Drug discovery"
        }, 
        {
            "uri": "http://edamontology.org/topic_0209", 
            "term": "Medicinal chemistry"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/ligmerge-generate-models-of-novel-potential-ligands-from-sets-of-known-binders.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://rocce-vm0.ucsd.edu/data/sw/hosted/ligmerge//#tutorial", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "22594624", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "LigMerge: A Fast Algorithm to Generate Models of Novel Potential Ligands from Sets of Known Binders", 
                "abstract": "One common practice in drug discovery is to optimize known or suspected ligands in order to improve binding affinity. In performing these optimizations, it is useful to look at as many known inhibitors as possible for guidance. Medicinal chemists often seek to improve potency by altering certain chemical moieties of known/endogenous ligands while retaining those critical for binding. To our knowledge, no automated, ligand-based algorithm exists for systematically 'swapping' the chemical moieties of known ligands to generate novel ligands with potentially improved potency. To address this need, we have created a novel algorithm called 'LigMerge'. LigMerge identifies the maximum (largest) common substructure of two three-dimensional ligand models, superimposes these two substructures, and then systematically mixes and matches the distinct fragments attached to the common substructure at each common atom, thereby generating multiple compound models related to the known inhibitors that can be evaluated using computer docking prior to synthesis and experimental testing. To demonstrate the utility of LigMerge, we identify compounds predicted to inhibit peroxisome proliferator-activated receptor gamma, HIV reverse transcriptase, and dihydrofolate reductase with affinities higher than those of known ligands. We hope that LigMerge will be a helpful tool for the drug design community. A novel automated, ligand-based algorithm 'LigMerge' for systematically 'swapping' the chemical moieties of known ligands in order to generate novel ligands with potentially improved potency has been developed. LigMerge identifies the maximum common substructure of two three-dimensional ligand models, and then systematically mixes and matches the distinct fragments attached to the common substructure at each common atom, thereby generating multiple compound models related to the known inhibitors that can be evaluated using computer docking prior to synthesis and experimental testing. © 2012 John Wiley & Sons A/S.", 
                "date": "2012-09-01T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Lindert S."
                    }, 
                    {
                        "name": "Durrant J.D."
                    }, 
                    {
                        "name": "Mccammon J.A."
                    }
                ], 
                "journal": "Chemical Biology and Drug Design"
            }
        }
    ], 
    "credit": [
        {
            "name": "Steffen Lindert", 
            "email": "lindert.1@osu.edu", 
            "url": "https://amarolab.ucsd.edu/~jdurrant/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:48:24Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}