{
    "accessibility": "Open access",
    "additionDate": "2022-02-12T14:29:14.744726Z",
    "biotoolsCURIE": "biotools:oncosplicing",
    "biotoolsID": "oncosplicing",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xuhuawhu@163.com",
            "name": "Hua Xu"
        },
        {
            "name": "Yangjun Zhang",
            "orcidid": "https://orcid.org/0000-0003-1070-6210"
        },
        {
            "name": "Xiangyang Yao"
        },
        {
            "name": "Hui Zhou"
        },
        {
            "name": "Xiaoliang Wu"
        }
    ],
    "description": "OncoSplicing is a database to systematically study clinically relevant alternative splicing in 33 TCGA cancers and 31 GTEx tissues.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.oncosplicing.com",
    "lastUpdate": "2022-02-12T14:29:14.747246Z",
    "name": "OncoSplicing",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB851",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press on behalf of Nucleic Acids Research.Alternative splicing (AS) represents a crucial method in mRNA level to regulate gene expression and contributes to the protein complexity. Abnormal splicing has been reported to play roles in several diseases, including cancers. We developed the OncoSplicing database for visualization of survival-associated and differential alternative splicing in 2019. Here, we provide an updated version of OncoSplicing for an integrative view of clinically relevant alternative splicing based on 122 423 AS events across 33 cancers in the TCGA SpliceSeq project and 238 558 AS events across 32 cancers in the TCGA SplAdder project. The new version of the database contains several useful features, such as annotation of alternative splicing-associated transcripts, survival analysis based on median and optimal cut-offs, differential analysis between TCGA tumour samples and adjacent normal samples or GTEx normal samples, pan-cancer views of alternative splicing, splicing differences and results of Cox'PH regression, identification of clinical indicator-relevant and cancer-specific splicing events, and downloadable splicing data in the SplAdder project. Overall, the substantially updated version of OncoSplicing (www.oncosplicing.com) is a user-friendly and registration-free database for browsing and searching clinically relevant alternative splicing in human cancers.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Yao X."
                    },
                    {
                        "name": "Zhou H."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Tian J."
                    },
                    {
                        "name": "Zeng J."
                    },
                    {
                        "name": "Yan L."
                    },
                    {
                        "name": "Duan C."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Ye Z."
                    },
                    {
                        "name": "Xu H."
                    }
                ],
                "date": "2022-01-07T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "OncoSplicing: an updated database for clinically relevant alternative splicing in 33 human cancers"
            },
            "pmid": "34554251"
        },
        {
            "doi": "10.1038/s41388-019-0910-7",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature Limited.Alternative splicing represents a critical posttranscriptional regulation of gene expression, which contributes to the protein complexity and mRNA processing. Defects of alternative splicing including genetic alteration and/or altered expression of both pre-mRNA and trans-acting factors give rise to many cancers. By integrally analyzing clinical data and splicing data from TCGA and SpliceSeq databases, a number of splicing events were found clinically relevant in tumor samples. Alternative splicing of KLK2 (KLK2_51239) was found as a potential inducement of nonsense-mediated mRNA decay and associated with poor survival in prostate cancer. Consensus K-means clustering analysis indicated that alternative splicing events could be potentially used for molecular subtype classification of cancers. By random forest survival algorithm, prognostic prediction signatures with well performances were constructed for 31 cancers by using survival-associated alternative splicing events. Furthermore, an online tool for visualization of Kaplan–Meier plots of splicing events in 31 cancers was explored. Briefly, alternative splicing was found of significant clinical relevance with cancers.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Yan L."
                    },
                    {
                        "name": "Zeng J."
                    },
                    {
                        "name": "Zhou H."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Yu G."
                    },
                    {
                        "name": "Yao W."
                    },
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Ye Z."
                    },
                    {
                        "name": "Xu H."
                    }
                ],
                "citationCount": 23,
                "date": "2019-10-03T00:00:00Z",
                "journal": "Oncogene",
                "title": "Pan-cancer analysis of clinical relevance of alternative splicing events in 31 human cancers"
            },
            "pmid": "31391553"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}