{
    "additionDate": "2018-10-11T18:22:55Z",
    "biotoolsCURIE": "biotools:mirmod",
    "biotoolsID": "mirmod",
    "credit": [
        {
            "email": "dinesh@icgeb.res.in",
            "name": "Dinesh Gupta",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "miRMOD is a tool for identification and analysis of 5′ and 3′ miRNA modifications (non-templated nucleotide additions and trimming) in sRNA NGS data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinfo.icgeb.res.in/miRMOD/miRMOD_V0.3_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.icgeb.res.in/miRMOD/",
    "language": [
        "C#"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "miRMOD",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.7717/peerj.1332",
            "metadata": {
                "abstract": "© 2015 Kaushik et al.In the past decade, the microRNAs (miRNAs) have emerged to be important regulators of gene expression across various species. Several studies have confirmed different types of post-transcriptional modifications at terminal ends of miRNAs. The reports indicate that miRNA modifications are conserved and functionally significant as it may affect miRNA stability and ability to bind mRNA targets, hence affecting target gene repression. Next Generation Sequencing (NGS) of the small RNA (sRNA) provides an efficient and reliable method to explore miRNA modifications. The need for dedicated software, especially for users with little knowledge of computers, to determine and analyze miRNA modifications in sRNA NGS data, motivated us to develop miRMOD. miRMOD is a user-friendly, Microsoft Windows and Graphical User Interface (GUI) based tool for identification and analysis of 5' and 3' miRNA modifications (non-templated nucleotide additions and trimming) in sRNA NGS data. In addition to identification of miRNA modifications, the tool also predicts and compares the targets of query and modified miRNAs. In order to compare binding affinities for the same target, miRMOD utilizes minimum free energies of the miRNA:target and modified-miRNA:target interactions. Comparisons of the binding energies may guide experimental exploration of miRNA post-transcriptional modifications. The tool is available as a stand-alone package to overcome large data transfer problems commonly faced in web-based high-throughput (HT) sequencing data analysis tools. miRMOD package is freely available at http://bioinfo.icgeb.res.in/miRMOD.",
                "authors": [
                    {
                        "name": "Kaushik A."
                    },
                    {
                        "name": "Saraf S."
                    },
                    {
                        "name": "Mukherjee S.K."
                    },
                    {
                        "name": "Gupta D."
                    }
                ],
                "citationCount": 11,
                "date": "2015-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "miRMOD: A tool for identification and analysis of 5' and 3' miRNA modifications in Next Generation Sequencing small RNA data"
            },
            "pmcid": "PMC4662591",
            "pmid": "26623179",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "0.4"
    ]
}