{
    "accessibility": "Open access",
    "additionDate": "2023-12-18T20:48:22.887606Z",
    "biotoolsCURIE": "biotools:gsphi",
    "biotoolsID": "gsphi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sunyanmei@nwu.edu.cn",
            "name": "Yanmei Sun",
            "typeEntity": "Person"
        },
        {
            "email": "zhuhongyou@gxas.cn",
            "name": "Zhuhong You",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel deep learning model for predicting phage-host interactions via multiple biological information.\nEmerging evidence suggests that due to the misuse of antibiotics, bacteriophage (phage) therapy has been recognized as one of the most promising strategies for treating human diseases infected by antibiotic-resistant bacteria.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://120.77.11.78/GSPHI/",
    "lastUpdate": "2024-11-24T14:27:59.530157Z",
    "license": "CC-BY-NC-ND-4.0",
    "name": "GSPHI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.06.014",
            "metadata": {
                "abstract": "Emerging evidence suggests that due to the misuse of antibiotics, bacteriophage (phage) therapy has been recognized as one of the most promising strategies for treating human diseases infected by antibiotic-resistant bacteria. Identification of phage-host interactions (PHIs) can help to explore the mechanisms of bacterial response to phages and provide new insights into effective therapeutic approaches. Compared to conventional wet-lab experiments, computational models for predicting PHIs can not only save time and cost, but also be more efficient and economical. In this study, we developed a deep learning predictive framework called GSPHI to identify potential phage and target bacterium pairs through DNA and protein sequence information. More specifically, GSPHI first initialized the node representations of phages and target bacterial hosts via a natural language processing algorithm. Then a graph embedding algorithm structural deep network embedding (SDNE) was utilized to extract local and global information from the interaction network, and finally, a deep neural network (DNN) was applied to accurately detect the interactions between phages and their bacterial hosts. In the drug-resistant bacteria dataset ESKAPE, GSPHI achieved a prediction accuracy of 86.65 % and AUC of 0.9208 under the 5-fold cross-validation technique, significantly better than other methods. In addition, case studies in Gram-positive and negative bacterial species demonstrated that GSPHI is competent in detecting potential Phage-host interactions. Taken together, these results indicate that GSPHI can provide reasonable candidate sensitive bacteria to phages for biological experiments. The webserver of the GSPHI predictor is freely available at http://120.77.11.78/GSPHI/.",
                "authors": [
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Pan J."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "You W."
                    },
                    {
                        "name": "You Z."
                    }
                ],
                "citationCount": 6,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "GSPHI: A novel deep learning model for predicting phage-host interactions via multiple biological information"
            },
            "pmcid": "PMC10314231",
            "pmid": "37397626"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ]
}
