{
    "additionDate": "2021-01-18T09:49:25Z",
    "biotoolsCURIE": "biotools:methylstar",
    "biotoolsID": "methylstar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "frank@johanneslab.org",
            "name": "Frank Johannes",
            "typeEntity": "Person"
        }
    ],
    "description": "A fast and robust pre-processing pipeline for bulk or single-cell whole-genome bisulfite sequencing data.\n\nA fast and robust pre-processing pipeline for bulk or single-cell whole-genome bisulfite sequencing (WGBS) data.\n\nTo process a large number of WGBS samples in a consistent, documented and reproducible manner it is advisable to use a pipeline system. MethylStar is a fast, stable and flexible pre-processing pipeline for bulk or single-cell (de-multiplexed) WGBS data.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://github.com/jlab-code/MethylStar#MethylStar_tutorial_on_YouTube"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://jlabdata.org/methylstar.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Methylation calling",
                    "uri": "http://edamontology.org/operation_3919"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jlab-code/MethylStar",
    "language": [
        "Python",
        "Shell",
        "R"
    ],
    "lastUpdate": "2021-02-22T08:33:15Z",
    "license": "GPL-3.0",
    "name": "MethylStar",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-06886-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Whole-Genome Bisulfite Sequencing (WGBS) is a Next Generation Sequencing (NGS) technique for measuring DNA methylation at base resolution. Continuing drops in sequencing costs are beginning to enable high-throughput surveys of DNA methylation in large samples of individuals and/or single cells. These surveys can easily generate hundreds or even thousands of WGBS datasets in a single study. The efficient pre-processing of these large amounts of data poses major computational challenges and creates unnecessary bottlenecks for downstream analysis and biological interpretation. Results: To offer an efficient analysis solution, we present MethylStar, a fast, stable and flexible pre-processing pipeline for WGBS data. MethylStar integrates well-established tools for read trimming, alignment and methylation state calling in a highly parallelized environment, manages computational resources and performs automatic error detection. MethylStar offers easy installation through a dockerized container with all preloaded dependencies and also features a user-friendly interface designed for experts/non-experts. Application of MethylStar to WGBS from Human, Maize and A. thaliana shows favorable performance in terms of speed and memory requirements compared with existing pipelines. Conclusions: MethylStar is a fast, stable and flexible pipeline for high-throughput pre-processing of bulk or single-cell WGBS data. Its easy installation and user-friendly interface should make it a useful resource for the wider epigenomics community. MethylStar is distributed under GPL-3.0 license and source code is publicly available for download from github https://github.com/jlab-code/MethylStar. Installation through a docker image is available from http://jlabdata.org/methylstar.tar.gz",
                "authors": [
                    {
                        "name": "Shahryary Y."
                    },
                    {
                        "name": "Hazarika R.R."
                    },
                    {
                        "name": "Johannes F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-13T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "MethylStar: A fast and robust pre-processing pipeline for bulk or single-cell whole-genome bisulfite sequencing data"
            },
            "pmcid": "PMC7359584",
            "pmid": "32660416"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ]
}