{
    "additionDate": "2020-10-14T13:00:46Z",
    "biotoolsCURIE": "biotools:ipk-cats",
    "biotoolsID": "ipk-cats",
    "collectionID": [
        "denbi-gcbn",
        "de.NBI",
        "de.NBI-GCBN"
    ],
    "cost": "Free of charge",
    "description": "A combination of several software tools for sequence analysis developed at the IPK Gatersleben. The BLAST server utilizes a homology search against the cereal genome resources (barley, rye and bread wheat). Kmasker plants is able to mask sequences originating from ten agronomically important plants based on mathematical defined repeats, furthermore, selection of sequences applicable for guideRNA construction for genome editing (CRISPR) or for fluorescence in situ hybridization is also possible. MISA web searches a sequence for microsatellites and is able generate molecular markers or primer. Using BRIDGE the complete barley collection of the IPK genebank can be visually explored in an interactive manner through diversity, certain phenotyped traits, and based on sequence polymorphisms. The barley genome explorer (BARLEX) is a system to visually inspect the reference genome sequence of barley, enriched with expression data, repeat and gene annotation and molecular marker data.",
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "Plant Sciences"
    ],
    "elixirNode": [
        "Germany"
    ],
    "homepage": "https://cats.ipk-gatersleben.de/",
    "lastUpdate": "2020-10-14T14:31:35Z",
    "maturity": "Mature",
    "name": "Crop Analysis Tool Suite (CATS)",
    "owner": "ipk",
    "publication": [
        {
            "doi": "10.3835/plantgenome2015.06.0038",
            "metadata": {
                "abstract": "© Crop Science Society of America.The genome sequences of many important Triticeae species, including bread wheat (Triticum aestivum L.) and barley (Hordeum vulgare L.), remained uncharacterized for a long time because their high repeat content, large sizes, and polyploidy. As a result of improvements in sequencing technologies and novel analyses strategies, several of these have recently been deciphered. These efforts have generated new insights into Triticeae biology and genome organization and have important implications for downstream usage by breeders, experimental biologists, and comparative genomicists. transPLANT (http://www.transplantdb.eu) is an EU-funded project aimed at constructing hardware, software, and data infrastructure for genome-scale research in the life sciences. Since the Triticeae data are intrinsically complex, heterogenous, and distributed, the transPLANT consortium has undertaken efforts to develop common data formats and tools that enable the exchange and integration of data from distributed resources. Here we present an overview of the individual Triticeae genome resources hosted by transPLANT partners, introduce the objectives of transPLANT, and outline common developments and interfaces supporting integrated data access.",
                "authors": [
                    {
                        "name": "Spannagl M."
                    },
                    {
                        "name": "Alaux M."
                    },
                    {
                        "name": "Lange M."
                    },
                    {
                        "name": "Bolser D.M."
                    },
                    {
                        "name": "Bader K.C."
                    },
                    {
                        "name": "Letellier T."
                    },
                    {
                        "name": "Kimmel E."
                    },
                    {
                        "name": "Flores R."
                    },
                    {
                        "name": "Pommier C."
                    },
                    {
                        "name": "Kerhornou A."
                    },
                    {
                        "name": "Walts B."
                    },
                    {
                        "name": "Nussbaumer T."
                    },
                    {
                        "name": "Grabmuller C."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Colmsee C."
                    },
                    {
                        "name": "Beier S."
                    },
                    {
                        "name": "Mascher M."
                    },
                    {
                        "name": "Schmutzer T."
                    },
                    {
                        "name": "Arend D."
                    },
                    {
                        "name": "Thanki A."
                    },
                    {
                        "name": "Ramirez-Gonzalez R."
                    },
                    {
                        "name": "Ayling M."
                    },
                    {
                        "name": "Ayling S."
                    },
                    {
                        "name": "Caccamo M."
                    },
                    {
                        "name": "Mayer K.F.X."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Steinbach D."
                    },
                    {
                        "name": "Quesneville H."
                    },
                    {
                        "name": "Kersey P.J."
                    }
                ],
                "citationCount": 5,
                "date": "2016-03-01T00:00:00Z",
                "journal": "Plant Genome",
                "title": "TransPLANT resources for triticeae genomic data"
            }
        },
        {
            "doi": "10.1111/tpj.14645",
            "metadata": {
                "abstract": "© 2019 The Authors. The Plant Journal published by Society for Experimental Biology and John Wiley & Sons LtdMany plant genomes display high levels of repetitive sequences. The assembly of these complex genomes using short high-throughput sequence reads is still a challenging task. Underestimation or disregard of repeat complexity in these datasets can easily misguide downstream analysis. Detection of repetitive regions by k-mer counting methods has proved to be reliable. Easy-to-use applications utilizing k-mer counting are in high demand, especially in the domain of plants. We present Kmasker plants, a tool that uses k-mer count information as an assistant throughout the analytical workflow of genome data that is provided as a command-line and web-based solution. Beside its core competence to screen and mask repetitive sequences, we have integrated features that enable comparative studies between different cultivars or closely related species and methods that estimate target specificity of guide RNAs for application of site-directed mutagenesis using Cas9 endonuclease. In addition, we have set up a web service for Kmasker plants that maintains pre-computed indices for 10 of the economically most important cultivated plants. Source code for Kmasker plants has been made publically available at https://github.com/tschmutzer/kmasker. The web service is accessible at https://kmasker.ipk-gatersleben.de.",
                "authors": [
                    {
                        "name": "Beier S."
                    },
                    {
                        "name": "Ulpinnis C."
                    },
                    {
                        "name": "Schwalbe M."
                    },
                    {
                        "name": "Munch T."
                    },
                    {
                        "name": "Hoffie R."
                    },
                    {
                        "name": "Koeppel I."
                    },
                    {
                        "name": "Hertig C."
                    },
                    {
                        "name": "Budhagatapalli N."
                    },
                    {
                        "name": "Hiekel S."
                    },
                    {
                        "name": "Pathi K.M."
                    },
                    {
                        "name": "Hensel G."
                    },
                    {
                        "name": "Grosse M."
                    },
                    {
                        "name": "Chamas S."
                    },
                    {
                        "name": "Gerasimova S."
                    },
                    {
                        "name": "Kumlehn J."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Schmutzer T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "Kmasker plants – a tool for assessing complex sequence space in plant species"
            }
        },
        {
            "doi": "10.1159/000356460",
            "metadata": {
                "abstract": "Specific localization of large genomic fragments by fluorescence in situ hybridization (FISH) is challenging in large- genome plant species due to the high content of repetitive sequences. We report the automated work flow (Kmasker) for in silico extraction of unique genomic sequences of large genomic fragments suitable for FISH in barley. This method can be widely used for the integration of genetic and cytogenetic maps in plants and other species with large and complex genomes if the probe sequence (e.g. BACs, sequence contigs) and a low coverage (8-fold) of unassembled sequences of the species of interest are available. Kmasker has been made publicly available as a web tool at http://webblast.ipk-gatersleben.de/kmasker. © 2013 S. Karger AG, Basel.",
                "authors": [
                    {
                        "name": "Schmutzer T."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Pousarebani N."
                    },
                    {
                        "name": "Bull F."
                    },
                    {
                        "name": "Stein N."
                    },
                    {
                        "name": "Houben A."
                    },
                    {
                        "name": "Scholz U."
                    }
                ],
                "citationCount": 19,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Cytogenetic and Genome Research",
                "title": "Kmasker - A tool for in silico prediction of single-copy FISH probes for the large-genome species Hordeum vulgare"
            }
        },
        {
            "doi": "10.1093/bioinformatics/btx198",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press.Motivation: Microsatellites are a widely-used marker system in plant genetics and forensics. The development of reliable microsatellite markers from resequencing data is challenging.Results: We extended MISA, a computational tool assisting the development of microsatellite markers, and reimplemented it as a web-based application. We improved compound microsatellite detection and added the possibility to display and export MISA results in GFF3 format for downstream analysis.Availability and Implementation: MISA-web can be accessed under http://misaweb.ipk-gatersleben.de/. The website provides tutorials, usage note as well as download links to the source code.Contact: scholz@ipk-gatersleben.de.",
                "authors": [
                    {
                        "name": "Beier S."
                    },
                    {
                        "name": "Thiel T."
                    },
                    {
                        "name": "Munch T."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Mascher M."
                    }
                ],
                "citationCount": 225,
                "date": "2017-08-15T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "MISA-web: a web server for microsatellite prediction"
            }
        },
        {
            "doi": "10.3389/fpls.2020.00701",
            "metadata": {
                "abstract": "© Copyright © 2020 König, Beier, Basterrechea, Schüler, Arend, Mascher, Stein, Scholz and Lange.Genebanks harbor a large treasure trove of untapped plant genetic diversity. A growing world population and a changing climate require an increase in the production and development of stress resistant plant cultivars while decreasing the acreage. These requirements for improved plant cultivars can be supported by the broader exploitation of plant genetic resources (PGR) as inputs for genomics-assisted breeding. To support this process we have developed BRIDGE, a data warehouse and exploratory data analysis tool for genebank genomics of barley (Hordeum vulgare L.). Using efficient technologies for data storage, data transfer and web development, we facilitate access to digital genebank resources of barley by prioritizing the interactive and visual analysis of integrated genotypic and phenotypic data. The underlying data resulted from a barley genebank genomics study cataloging sequence and morphological data of 22,626 barley accessions, mainly from the German Federal ex situ genebank. BRIDGE consists of interactively coupled modules to visualize integrated, curated and quality checked data, such as variation data, results of dimensionality reduction and genome wide association studies (GWAS), phenotyping results, passport data as well as the geographic distribution of germplasm samples. The core component is a manager for custom collections of germplasm. A search module to find and select germplasm by passport and phenotypic attributes is included as well as modules to export genotypic data in gzip-compressed variant call format (VCF) files and phenotypic data in MIAPPE-compliant ISA-Tab files. BRIDGE is accessible at the following URL: https://bridge.ipk-gatersleben.de.",
                "authors": [
                    {
                        "name": "Konig P."
                    },
                    {
                        "name": "Beier S."
                    },
                    {
                        "name": "Basterrechea M."
                    },
                    {
                        "name": "Schuler D."
                    },
                    {
                        "name": "Arend D."
                    },
                    {
                        "name": "Mascher M."
                    },
                    {
                        "name": "Stein N."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Lange M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-06-11T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "BRIDGE – A Visual Analytics Web Tool for Barley Genebank Genomics"
            }
        },
        {
            "doi": "10.1016/j.jbiotec.2017.07.006",
            "metadata": {
                "abstract": "© 2017 The AuthorsPlant genetic resources are a substantial opportunity for plant breeding, preservation and maintenance of biological diversity. As part of the German Network for Bioinformatics Infrastructure (de.NBI) the German Crop BioGreenformatics Network (GCBN) focuses mainly on crop plants and provides both data and software infrastructure which are tailored to the needs of the plant research community. Our mission and key objectives include: (1) provision of transparent access to germplasm seeds, (2) the delivery of improved workflows for plant gene annotation, and (3) implementation of bioinformatics services that link genotypes and phenotypes. This review introduces the GCBN's spectrum of web-services and integrated data resources that address common research problems in the plant genomics community.",
                "authors": [
                    {
                        "name": "Schmutzer T."
                    },
                    {
                        "name": "Bolger M.E."
                    },
                    {
                        "name": "Rudd S."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Gundlach H."
                    },
                    {
                        "name": "Arend D."
                    },
                    {
                        "name": "Oppermann M."
                    },
                    {
                        "name": "Weise S."
                    },
                    {
                        "name": "Lange M."
                    },
                    {
                        "name": "Spannagl M."
                    },
                    {
                        "name": "Usadel B."
                    },
                    {
                        "name": "Mayer K.F.X."
                    },
                    {
                        "name": "Scholz U."
                    }
                ],
                "citationCount": 4,
                "date": "2017-11-10T00:00:00Z",
                "journal": "Journal of Biotechnology",
                "title": "Bioinformatics in the plant genomic and phenomic domain: The German contribution to resources, services and perspectives"
            }
        }
    ]
}