
{
    "credit": [
        {
            "email": "info@openphactsfoundation.org",
            "name": "Open PHACTS foundation",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.openphacts.org/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.openphacts.org/index.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Restricted access"
        ],
        "collectionID": [
            "BioExcel",
            "RD-connect",
            "Rare Disease"
        ],
        "cost": "Free of charge (with restrictions)",
        "license": "Other",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API",
            "Web application"
        ],
        "topic": [
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            },
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Pharmacology",
                "uri": "http://edamontology.org/topic_0202"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Technology advances in the last decade have led to a \"digital revolution\" in biomedical research. Much greater volumes of data can be generated in much less time, transforming the way researchers work [1]. Yet, for those seeking to develop new drugs to treat human disease, the task of assembling a coherent picture of existing knowledge from molecular biology to clinical investigation, can be daunting and frustrating. Individual electronic resources remain mostly disconnected, making it difficult to follow information between them. Those that contain similar types of data can describe them very differently, compounding the confusion. It can also be difficult to understand exactly where specific facts or data points originated or how to judge their quality or reliability. Finally, scientists routinely wish to ask questions that the system does not allow, or ask questions that span multiple different resources. Often the result of this is to simply abandon the enquiry, significantly diminishing the value to be gained from existing knowledge. Within pharmaceutical companies, such concerns have led to majorprogrammes in data integration; downloading, parsing, mapping, transforming and presenting public, commercial and private data. Much of this work is redundant between companies and significant resources could be saved by collaboration [2]. In an industry facing major economic pressures [3], the idea of combining forces to \"get more for less\" is very attractive and is arguably the only feasible route to dealing with the exponentially growing information landscape. © 2012 Springer-Verlag.",
            "authors": [
                "Harland L."
            ],
            "cit_count": 12,
            "doi": "10.1007/978-3-642-33876-2_1",
            "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
            "title": "Open PHACTS: A semantic knowledge infrastructure for public and commercial drug discovery research",
            "type": "Primary",
            "year": "2012-10-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:open_phacts",
        "biotoolsID": "open_phacts",
        "description": "It is a resource for pharmacological data. The platform has been developed to reduce barriers to drug discovery in industry, academia and for small businesses.",
        "homepage": "https://www.openphacts.org/",
        "name": "Open PHACTS"
    }
}