{
    "additionDate": "2018-08-18T10:28:19Z",
    "biotoolsCURIE": "biotools:binom",
    "biotoolsID": "binom",
    "credit": [
        {
            "email": "andrei.zinovyev@curie.fr",
            "name": "Andrei Zinovyev",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Cytoscape plugin, developed to facilitate the manipulation of biological networks represented in standard systems biology formats (SBML, SBGN, BioPAX) and to carry out studies on the network structure. It provides the user with a complete interface for the analysis of biological networks in Cytoscape environment.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://binom.curie.fr/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://binom.curie.fr/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "LGPL-2.0",
    "name": "BiNoM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-18",
            "metadata": {
                "abstract": "Background: Public repositories of biological pathways and networks have greatly expanded in recent years. Such databases contain many pathways that facilitate the analysis of high-throughput experimental work and the formulation of new biological hypotheses to be tested, a fundamental principle of the systems biology approach. However, large-scale molecular maps are not always easy to mine and interpret.Results: We have developed BiNoM (Biological Network Manager), a Cytoscape plugin, which provides functions for the import-export of some standard systems biology file formats (import from CellDesigner, BioPAX Level 3 and CSML; export to SBML, CellDesigner and BioPAX Level 3), and a set of algorithms to analyze and reduce the complexity of biological networks. BiNoM can be used to import and analyze files created with the CellDesigner software. BiNoM provides a set of functions allowing to import BioPAX files, but also to search and edit their content. As such, BiNoM is able to efficiently manage large BioPAX files such as whole pathway databases (e.g. Reactome). BiNoM also implements a collection of powerful graph-based functions and algorithms such as path analysis, decomposition by involvement of an entity or cyclic decomposition, subnetworks clustering and decomposition of a large network in modules.Conclusions: Here, we provide an in-depth overview of the BiNoM functions, and we also detail novel aspects such as the support of the BioPAX Level 3 format and the implementation of a new algorithm for the quantification of pathways for influence networks. At last, we illustrate some of the BiNoM functions on a detailed biological case study of a network representing the G1/S transition of the cell cycle, a crucial cellular process disturbed in most human tumors. © 2013 Bonnet et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Bonnet E."
                    },
                    {
                        "name": "Calzone L."
                    },
                    {
                        "name": "Rovera D."
                    },
                    {
                        "name": "Stoll G."
                    },
                    {
                        "name": "Zinovyev A."
                    }
                ],
                "citationCount": 36,
                "date": "2013-03-01T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "BiNoM 2.0, a Cytoscape plugin for accessing and analyzing pathways using standard systems biology formats"
            }
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
