
{
    "credit": [
        {
            "email": "laurent.jacob@gmail.com",
            "name": "Laurent Jacob",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/DEGraph.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/DEGraph_1.26.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We consider multivariate two-sample tests of means, where the location shift between the two populations is expected to be related to a known graph structure. An important application of such tests is the detection of differentially expressed genes between two patient populations, as shifts in expression levels are expected to be coherent with the structure of graphs reflecting gene properties such as biological process, molecular function, regulation or metabolism. For a fixed graph of interest, we demonstrate that accounting for graph structure can yield more powerful tests under the assumption of smooth distribution shift on the graph. We also investigate the identification of nonhomogeneous subgraphs of a given large graph, which poses both computational and multiple hypothesis testing problems. The relevance and benefits of the proposed approach are illustrated on synthetic data and on breast and bladder cancer gene expression data analyzed in the context of KEGG and NCI pathways. © Institute of Mathematical Statistics, 2012.",
            "authors": [
                "Jacob L.",
                "Neuvial P.",
                "Dudoit S."
            ],
            "cit_count": 33,
            "doi": "10.1214/11-AOAS528",
            "journal": "Annals of Applied Statistics",
            "title": "More power via graph-structured tests for differential expression of gene networks",
            "type": "Primary",
            "year": "2012-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:degraph",
        "biotoolsID": "degraph",
        "description": "Implements recent hypothesis testing methods to assess whether a particular gene network is differentially expressed between two conditions. This is to be contrasted with the more classical two-step approaches. These recent methods consider the topology of the network to yield more powerful detection procedures. It provides methods to easily test all KEGG pathways for differential expression on any gene expression data set and tools to visualize the results.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/DEGraph.html",
        "name": "DEGraph",
        "version": [
            "1.26.0"
        ]
    }
}