{
    "accessibility": "Open access",
    "additionDate": "2019-05-29T13:35:25Z",
    "biotoolsCURIE": "biotools:PepFoot",
    "biotoolsID": "PepFoot",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jedd Bellamy-Carter",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software package for semi-automated processing of protein footprinting data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/jbellamycarter/pepfoot/releases/download/1.1/UserGuide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/jbellamycarter/pepfoot",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "LGPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/jbellamycarter/pepfoot/issues"
        }
    ],
    "maturity": "Mature",
    "name": "PepFoot",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.9b00238",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Covalent footprinting of proteins using reactive intermediates such as radicals and carbenes is emerging as a valuable tool for mapping surface accessibility, and hence binding sites of proteins. The approach generates a significant amount of mass spectrometry (MS) data, which can be time-consuming to process manually. PepFoot, a software package that allows semiautomated processing of MS data from footprinting experiments, is described. By using the open source.mz5 file format, it is able to accept data from all the major instrument manufacturers. Following manual user interrogation of one data file within a user-friendly GUI, the software then automates determination of the degree of fractional modification (fm) with the footprinting agent across a batch of experimental data. This greatly increases efficiency and throughput compared to manual analysis of each file, and provides initial scrutiny and confidence compared to fully automated analysis. Histogram plots of fm for each peptide from the footprinted protein may be displayed within PepFoot and mapped onto an imported protein structure to reveal differential labeling patterns and hence binding sites. The software has been tested on data from carbene and hydroxyl radical labeling experiments to demonstrate its broad utility. PepFoot is released under the LGPL version 3 license, and is available for Windows, MacOS, and Linux systems at github.com/jbellamycarter/pepfoot.",
                "authors": [
                    {
                        "name": "Bellamy-Carter J."
                    },
                    {
                        "name": "Oldham N.J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-05T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "PepFoot: A Software Package for Semiautomated Processing of Protein Footprinting Data"
            },
            "pmid": "31132275",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "pyteomics",
            "type": "uses"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
