{
    "additionDate": "2024-04-08T08:40:10.254850Z",
    "biotoolsCURIE": "biotools:bionetgmmfit",
    "biotoolsID": "bionetgmmfit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wu.4427@osu.edu",
            "name": "John Wu",
            "orcidid": "https://orcid.org/0000-0001-8370-7738",
            "typeEntity": "Person"
        },
        {
            "email": "jayajit.das@nationwidechildrens.org",
            "name": "Jayajit Das",
            "typeEntity": "Person"
        }
    ],
    "description": "Estimating parameters of a Bio Net Gen Model from time-stamped snapshots of single cells.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/repository/docker/jhnwu3/bngmm/general"
        },
        {
            "type": "Source code",
            "url": "https://github.com/jhnwu3/BioNetGMMFit/tree/main/example"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jhnwu3/BioNetGMMFit",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-04-08T08:40:28.267653Z",
    "license": "MIT",
    "name": "BioNetGMMFit",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41540-023-00299-0",
            "metadata": {
                "abstract": "Mechanistic models are commonly employed to describe signaling and gene regulatory kinetics in single cells and cell populations. Recent advances in single-cell technologies have produced multidimensional datasets where snapshots of copy numbers (or abundances) of a large number of proteins and mRNA are measured across time in single cells. The availability of such datasets presents an attractive scenario where mechanistic models are validated against experiments, and estimated model parameters enable quantitative predictions of signaling or gene regulatory kinetics. To empower the systems biology community to easily estimate parameters accurately from multidimensional single-cell data, we have merged a widely used rule-based modeling software package BioNetGen, which provides a user-friendly way to code for mechanistic models describing biochemical reactions, and the recently introduced CyGMM, that uses cell-to-cell differences to improve parameter estimation for such networks, into a single software package: BioNetGMMFit. BioNetGMMFit provides parameter estimates of the model, supplied by the user in the BioNetGen markup language (BNGL), which yield the best fit for the observed single-cell, time-stamped data of cellular components. Furthermore, for more precise estimates, our software generates confidence intervals around each model parameter. BioNetGMMFit is capable of fitting datasets of increasing cell population sizes for any mechanistic model specified in the BioNetGen markup language. By streamlining the process of developing mechanistic models for large single-cell datasets, BioNetGMMFit provides an easily-accessible modeling framework designed for scale and the broader biochemical signaling community.",
                "authors": [
                    {
                        "name": "Das J."
                    },
                    {
                        "name": "Jayaprakash C."
                    },
                    {
                        "name": "Stewart W.C.L."
                    },
                    {
                        "name": "Wu J."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "npj Systems Biology and Applications",
                "title": "BioNetGMMFit: estimating parameters of a BioNetGen model from time-stamped snapshots of single cells"
            },
            "pmcid": "PMC10516955",
            "pmid": "37736766"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}
