{
    "additionDate": "2016-06-07T15:39:02Z",
    "biotoolsCURIE": "biotools:the_flux_capacitor",
    "biotoolsID": "the_flux_capacitor",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "micha@sammeth.net",
            "name": "Micha Sammeth",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Lab Roderic Guigo Group",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Micha Sammeth",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "crg.eu",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Predict abundances for transcript molecules and alternative splicing events from RNAseq experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sammeth.net/confluence/display/FLUX/Home"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "http://sammeth.net/confluence/display/FLUX/2+-+Download"
        },
        {
            "type": "Source code",
            "url": "http://sammeth.net/confluence/display/FLUX/2+-+Download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "BAM",
                            "uri": "http://edamontology.org/format_2572"
                        },
                        {
                            "term": "GTF",
                            "uri": "http://edamontology.org/format_2306"
                        }
                    ]
                }
            ],
            "note": "The input for the FLUX CAPACITOR is the annotation of a reference transcriptome and reads fromRNAseq technologies aligned to the genome. From the reference annotation, splicing graphs are produced and reads are mapped to corresponding edges in these graphs according to the position where they align in the genomic sequence. The resulting graph with edges labelled by the number of reads can be interpreted as a flow network where each transcript representing a transportation path from its start to its end and consequently each edge a possibly shared segment of transportation along which a certain number of reads per nucleotide -- i.e., a flux -- is observed. Given a density function of reads along a transcript, the expected participation of each transcript in an edge under consideration can be estimated.",
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "http://sammeth.net/confluence/display/FLUX/Home",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T20:23:48.276843Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://sammeth.net/bitbucket/projects/BARNA/repos/barna/browse/barna.capacitor"
        }
    ],
    "maturity": "Mature",
    "name": "The Flux Capacitor",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006651"
        }
    ],
    "owner": "francisco.camara@crg.eu",
    "publication": [
        {
            "doi": "10.1093/nar/gks666",
            "metadata": {
                "abstract": "High-throughput sequencing of cDNA libraries constructed from cellular RNA complements (RNA-Seq) naturally provides a digital quantitative measurement for every expressed RNA molecule. Nature, impact and mutual interference of biases in different experimental setups are, however, still poorly understood - mostly due to the lack of data from intermediate protocol steps. We analysed multiple RNA-Seq experiments, involving different sample preparation protocols and sequencing platforms: we broke them down into their common - and currently indispensable - technical components (reverse transcription, fragmentation, adapter ligation, PCR amplification, gel segregation and sequencing), investigating how such different steps influence abundance and distribution of the sequenced reads. For each of those steps, we developed universally applicable models, which can be parameterised by empirical attributes of any experimental protocol. Our models are implemented in a computer simulation pipeline called the Flux Simulator, and we show that read distributions generated by different combinations of these models reproduce well corresponding evidence obtained from the corresponding experimental setups. We further demonstrate that our in silico RNA-Seq provides insights about hidden precursors that determine the final configuration of reads along gene bodies; enhancing or compensatory effects that explain apparently controversial observations can be observed. Moreover, our simulations identify hitherto unreported sources of systematic bias from RNA hydrolysis, a fragmentation technique currently employed by most RNA-Seq protocols. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Griebel T."
                    },
                    {
                        "name": "Guigo R."
                    },
                    {
                        "name": "Lacroix V."
                    },
                    {
                        "name": "Raineri E."
                    },
                    {
                        "name": "Ribeca P."
                    },
                    {
                        "name": "Sammeth M."
                    },
                    {
                        "name": "Zacher B."
                    }
                ],
                "citationCount": 213,
                "date": "2012-11-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Modelling and simulating generic RNA-Seq experiments with the flux simulator"
            },
            "pmcid": "PMC3488205",
            "pmid": "22962361",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.1"
    ]
}
