{
    "accessibility": "Open access",
    "additionDate": "2017-08-02T10:04:58Z",
    "biotoolsCURIE": "biotools:eggnog-mapper",
    "biotoolsID": "eggnog-mapper",
    "collectionID": [
        "de.NBI"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "danielrmende@gmail.com",
            "name": "Daniel Mende",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zeller@embl.de",
            "name": "Georg Zeller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "European Molecular Biology Laboratory (EMBL)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.embl.de/"
        },
        {
            "name": "HD-HuB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.hd-hub.de/"
        }
    ],
    "description": "For fast functional annotation of novel sequences. It uses precomputed orthologous groups and phylogenies from the eggNOG database to transfer functional information from fine-grained orthologs only. Its common uses include the annotation of novel genomes, transcriptomes or even metagenomic gene catalogs.\n\nThe use of orthology predictions for functional annotation permits a higher precision than traditional homology searches, as it avoids transferring annotations from close paralogs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/jhcepas/eggnog-mapper/wiki"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://beta-eggnogdb.embl.de/#/app/emapper",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-05T16:39:17.170064Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "EggNOG-mapper",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hdhub",
    "publication": [
        {
            "doi": "10.1093/molbev/msab293",
            "metadata": {
                "abstract": "© The Author(s) 2021.Even though automated functional annotation of genes represents a fundamental step in most genomic and metagenomic workflows, it remains challenging at large scales. Here, we describe a major upgrade to eggNOG-mapper, a tool for functional annotation based on precomputed orthology assignments, now optimized for vast (meta)genomic data sets. Improvements in version 2 include a full update of both the genomes and functional databases to those from eggNOG v5, as well as several efficiency enhancements and new features. Most notably, eggNOG-mapper v2 now allows for: 1) de novo gene prediction from raw contigs, 2) built-in pairwise orthology prediction, 3) fast protein domain discovery, and 4) automated GFF decoration. eggNOG-mapper v2 is available as a standalone tool or as an online service at http://eggnogmapper.embl.de.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Cantalapiedra C.P."
                    },
                    {
                        "name": "Hern̗andez-Plaza A."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 48,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "eggNOG-mapper v2: Functional Annotation, Orthology Assignments, and Domain Prediction at the Metagenomic Scale"
            },
            "pmcid": "PMC8662613",
            "pmid": "34597405"
        },
        {
            "doi": "10.1093/molbev/msx148",
            "metadata": {
                "abstract": "© The Author 2017.Orthology assignment is ideally suited for functional inference. However, because predicting orthology is computationally intensive at large scale, and most pipelines are relatively inaccessible (e.g., new assignments only available through database updates), less precise homology-based functional transfer is still the default for (meta-)genome annotation.We, therefore, developed eggNOG-mapper, a tool for functional annotation of large sets of sequences based on fast orthology assignments using precomputed clusters and phylogenies from the eggNOG database. To validate our method, we benchmarked Gene Ontology (GO) predictions against two widely used homology-based approaches: BLAST and InterProScan. Orthology filters applied to BLAST results reduced the rate of false positive assignments by 11%, and increased the ratio of experimentally validated terms recovered over all terms assigned per protein by 15%. Compared with InterProScan, eggNOG-mapper achieved similar proteome coverage and precision while predicting, on average, 41 more terms per protein and increasing the rate of experimentally validated terms recovered over total term assignments per protein by 35%. EggNOG-mapper predictions scored within the top-5 methods in the three GO categories using the CAFA2 NK-partial benchmark. Finally, we evaluated eggNOG-mapper for functional annotation of metagenomics data, yielding better performance than interProScan. eggNOG-mapper runs 15 faster than BLAST and at least 2.5 faster than InterProScan. The tool is available standalone and as an online service at http://eggnog-mapper.embl.de.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Coelho L.P."
                    },
                    {
                        "name": "Forslund K."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Von Mering C."
                    }
                ],
                "citationCount": 974,
                "date": "2017-08-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Fast genome-wide functional annotation through orthology assignment by eggNOG-mapper"
            },
            "pmcid": "PMC5850834",
            "pmid": "28460117"
        },
        {
            "doi": "10.1093/nar/gkw989",
            "metadata": {
                "abstract": "© 2016 The Author(s).The availability of microbial genomes has opened many new avenues of research within microbiology. This has been driven primarily by comparative genomics approaches, which rely on accurate and consistent characterization of genomic sequences. It is nevertheless difficult to obtain consistent taxonomic and integrated functional annotations for defined prokaryotic clades. Thus, we developed proGenomes, a resource that provides user-friendly access to currently 25 038 high-quality genomes whose sequences and consistent annotations can be retrieved individually or by taxonomic clade. These genomes are assigned to 5306 consistent and accurate taxonomic species clusters based on previously established methodology. proGenomes also contains functional information for almost 80 million protein-coding genes, including a comprehensive set of general annotations and more focused annotations for carbohydrate-active enzymes and antibiotic resistance genes. Additionally, broad habitat information is provided for many genomes. All genomes and associated information can be downloaded by user-selected clade or multiple habitat-specific sets of representative genomes. We expect that the availability of high-quality genomes with comprehensive functional annotations will promote advances in clinical microbial genomics, functional evolution and other subfields of microbiology. proGenomes is available at http://progenomes.embl.de.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Forslund K."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Li S.S."
                    },
                    {
                        "name": "Mende D.R."
                    },
                    {
                        "name": "Sunagawa S."
                    }
                ],
                "citationCount": 56,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProGenomes: A resource for consistent functional and taxonomic annotations of prokaryotic genomes"
            },
            "pmcid": "PMC5210662",
            "pmid": "28053165"
        }
    ],
    "relation": [
        {
            "biotoolsID": "eggnog-mapper-v2",
            "type": "hasNewVersion"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
