{"credit":[{"name":"EMBL-EBI Databases","typeEntity":"Institute","typeRoles":["Provider"]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.ebi.ac.uk/metabolights/contact"}],"documentation":[{"type":"GENERAL","url":"https://www.ebi.ac.uk/metabolights/help"}],"function":[{"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"elixirNode":["EMBL"],"elixirPlatform":["Data"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"}]},"publication":[{"abstract":"MetaboLights (http://www.ebi.ac.uk/metabolights) is the first general-purpose, open-access repository for metabolomics studies, their raw experimental data and associated metadata, maintained by one of the major open-access data providers in molecular biology. Metabolomic profiling is an important tool for research into biological functioning and into the systemic perturbations caused by diseases, diet and the environment. The effectiveness of such methods depends on the availability of public open data across a broad range of experimental methods and conditions. The MetaboLights repository, powered by the open source ISA framework, is cross-species and cross-technique. It will cover metabolite structures and their reference spectra as well as their biological roles, locations, concentrations and raw data from metabolic experiments. Studies automatically receive a stable unique accession number that can be used as a publication reference (e.g. MTBLS1). At present, the repository includes 15 submitted studies, encompassing 93 protocols for 714 assays, and span over 8 different species including human, Caenor-habditis elegans, Mus musculus and Arabidopsis thaliana. Eight hundred twenty-seven of the metabolites identified in these studies have been mapped to ChEBI. These studies cover a variety of techniques, including NMR spectroscopyand mass spectrometry. © The Author(s) 2012.","authors":["Haug K.","Salek R.M.","Conesa P.","Hastings J.","De Matos P.","Rijnbeek M.","Mahendraker T.","Williams M.","Neumann S.","Rocca-Serra P.","Maguire E.","Gonzalez-Beltran A.","Sansone S.-A.","Griffin J.L.","Steinbeck C."],"cit_count":260,"doi":"10.1093/nar/gks1004","journal":"Nucleic Acids Research","title":"MetaboLights - An open-access general-purpose repository for metabolomics studies and associated meta-data","type":"Primary","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:metabolights","biotoolsID":"metabolights","description":"Database for Metabolomics experiments and derived information.","homepage":"http://www.ebi.ac.uk/metabolights/","name":"MetaboLights"}}