
{
    "credit": [
        {
            "email": "khan@inha.ac.kr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bclab.inha.ac.kr/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bclab.inha.ac.kr/primer/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-nucleic acid binding prediction",
                    "uri": "http://edamontology.org/operation_0420"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/primer-predicting-protein-binding-rna-nucleotides.html"
        }
    ],
    "publication": [
        {
            "abstract": "Several learning approaches have been used to predict RNA-binding amino acids in a protein sequence, but there has been little attempt to predict protein-binding nucleotides in an RNA sequence. One of the reasons is that the differences between nucleotides in their interaction propensity are much smaller than those between amino acids. Another reason is that RNA exhibits less diverse sequence patterns than protein. Therefore, predicting protein-binding RNA nucleotides is much harder than predicting RNA-binding amino acids. We developed a new method that removes data redundancy in a training set of sequences based on their features. The new method constructs a larger and more informative training set than the standard redundancy removal method based on sequence similarity, and the constructed dataset is guaranteed to be redundancy-free. We computed the interaction propensity (IP) of nucleotide triplets by applying a new definition of IP to an extensive dataset of protein-RNA complexes, and developed a support vector machine (SVM) model to predict protein binding sites in RNA sequences. In a 5-fold cross-validation with 812 RNA sequences, the SVM model predicted protein-binding nucleotides with an accuracy of 86.4%, an F-measure of 84.8%, and a Matthews correlation coefficient of 0.66. With an independent dataset of 56 RNA sequences that were not used in training, the resulting accuracy was 68.1% with an F-measure of 71.7% and a Matthews correlation coefficient of 0.35. To the best of our knowledge, this is the first attempt to predict protein-binding RNA nucleotides in a given RNA sequence from the sequence data alone. The SVM model and datasets are freely available for academics at http://bclab.inha.ac.kr/primer. © 2013 Elsevier Ltd.",
            "authors": [
                "Choi S.",
                "Han K."
            ],
            "cit_count": 15,
            "journal": "Computers in Biology and Medicine",
            "pmid": "24209914",
            "title": "Predicting protein-binding RNA nucleotides using the feature-based removal of data redundancy and the interaction propensity of nucleotide triplets",
            "year": "2013-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:primer",
        "biotoolsID": "primer",
        "description": "Predicts potential protein-binding nucleotides in the RNA sequence.",
        "homepage": "http://bclab.inha.ac.kr/primer/",
        "name": "Primer"
    }
}