{
    "additionDate": "2021-01-18T07:45:16Z",
    "biotoolsCURIE": "biotools:luevari",
    "biotoolsID": "luevari",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "baharpan@ufl.edu",
            "name": "Bahar Alipanahi",
            "typeEntity": "Person"
        }
    ],
    "description": "Metagenome SNP Calling via Read Colored de Bruijn Graphs.\n\nLueVari is a reference free metagenome SNP caller, based on the read-colored de Bruijn graph. LuVari is an extension of VARI (https://github.com/cosmo-team/cosmo/tree/VARI), in which the reads are stored as colors to allow the read-coherent traversal of de Bruijn graph.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/baharpan/cosmo/tree/LueVari",
    "lastUpdate": "2021-02-19T08:04:30Z",
    "name": "LueVari",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA081",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Metagenomics refers to the study of complex samples containing of genetic contents of multiple individual organisms and, thus, has been used to elucidate the microbiome and resistome of a complex sample. The microbiome refers to all microbial organisms in a sample, and the resistome refers to all of the antimicrobial resistance (AMR) genes in pathogenic and non-pathogenic bacteria. Single-nucleotide polymorphisms (SNPs) can be effectively used to 'fingerprint' specific organisms and genes within the microbiome and resistome and trace their movement across various samples. However, to effectively use these SNPs for this traceability, a scalable and accurate metagenomics SNP caller is needed. Moreover, such an SNP caller should not be reliant on reference genomes since 95% of microbial species is unculturable, making the determination of a reference genome extremely challenging. In this article, we address this need. Results: We present LueVari, a reference-free SNP caller based on the read-colored de Bruijn graph, an extension of the traditional de Bruijn graph that allows repeated regions longer than the k-mer length and shorter than the read length to be identified unambiguously. LueVari is able to identify SNPs in both AMR genes and chromosomal DNA from shotgun metagenomics data with reliable sensitivity (between 91% and 99%) and precision (between 71% and 99%) as the performance of competing methods varies widely. Furthermore, we show that LueVari constructs sequences containing the variation, which span up to 97.8% of genes in datasets, which can be helpful in detecting distinct AMR genes in large metagenomic datasets.",
                "authors": [
                    {
                        "name": "Alipanahi B."
                    },
                    {
                        "name": "Muggli M.D."
                    },
                    {
                        "name": "Jundi M."
                    },
                    {
                        "name": "Noyes N.R."
                    },
                    {
                        "name": "Boucher C."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Metagenome SNP calling via read-colored de Bruijn graphs"
            },
            "pmid": "32049324"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ]
}