{
    "additionDate": "2021-01-18T11:31:17Z",
    "biotoolsCURIE": "biotools:sbol",
    "biotoolsID": "sbol",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thomas.gorochowski@bristol.ac.uk",
            "name": "Thomas E. Gorochowski",
            "typeEntity": "Person"
        },
        {
            "email": "myers@ece.utah.edu",
            "name": "Chris J. Myers",
            "typeEntity": "Person"
        }
    ],
    "description": "The Synthetic Biology Open Language (SBOL) Version 3.\n\nThe Synthetic Biology Open Language (SBOL) is a community-developed data standard that allows knowledge about biological designs to be captured using a machine-tractable, ontology-backed representation that is built using Semantic Web technologies. While early versions of SBOL focused only on the description of DNA-based components and their sub-components, SBOL can now be used to represent knowledge across multiple scales and throughout the entire synthetic biology workflow, from the specification of a single molecule or DNA fragment through to multicellular systems containing multiple interacting genetic circuits. The third major iteration of the SBOL standard, SBOL3, is an effort to streamline and simplify the underlying data model with a focus on real-world applications, based on experience from the deployment of SBOL in a variety of scientific and industrial settings",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SynBioDex/SBOLTestSuite/tree/master/SBOL3/multicellular",
    "lastUpdate": "2021-02-11T16:49:27Z",
    "name": "SBOL",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.01009",
            "metadata": {
                "abstract": "© Copyright © 2020 McLaughlin, Beal, Mısırlı, Grünberg, Bartley, Scott-Brown, Vaidyanathan, Fontanarrosa, Oberortner, Wipat, Gorochowski and Myers.The Synthetic Biology Open Language (SBOL) is a community-developed data standard that allows knowledge about biological designs to be captured using a machine-tractable, ontology-backed representation that is built using Semantic Web technologies. While early versions of SBOL focused only on the description of DNA-based components and their sub-components, SBOL can now be used to represent knowledge across multiple scales and throughout the entire synthetic biology workflow, from the specification of a single molecule or DNA fragment through to multicellular systems containing multiple interacting genetic circuits. The third major iteration of the SBOL standard, SBOL3, is an effort to streamline and simplify the underlying data model with a focus on real-world applications, based on experience from the deployment of SBOL in a variety of scientific and industrial settings. Here, we introduce the SBOL3 specification both in comparison to previous versions of SBOL and through practical examples of its use.",
                "authors": [
                    {
                        "name": "McLaughlin J.A."
                    },
                    {
                        "name": "Beal J."
                    },
                    {
                        "name": "Misirli G."
                    },
                    {
                        "name": "Grunberg R."
                    },
                    {
                        "name": "Bartley B.A."
                    },
                    {
                        "name": "Scott-Brown J."
                    },
                    {
                        "name": "Vaidyanathan P."
                    },
                    {
                        "name": "Fontanarrosa P."
                    },
                    {
                        "name": "Oberortner E."
                    },
                    {
                        "name": "Wipat A."
                    },
                    {
                        "name": "Gorochowski T.E."
                    },
                    {
                        "name": "Myers C.J."
                    }
                ],
                "date": "2020-09-11T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "The Synthetic Biology Open Language (SBOL) Version 3: Simplified Data Exchange for Bioengineering"
            },
            "pmcid": "PMC7516281",
            "pmid": "33015004"
        }
    ],
    "topic": [
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "version": [
        "3.0"
    ]
}