{
    "additionDate": "2017-08-03T19:01:28Z",
    "biotoolsCURIE": "biotools:sighunt",
    "biotoolsID": "sighunt",
    "credit": [
        {
            "email": "iba@iba.muni.cz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.iba.muni.cz/index-en.php"
        }
    ],
    "description": "A tool that analyses genomic signature of a DNA sequence and outputs the score DIAS.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.iba.muni.cz/index-en.php?pg=research--data-analysis-tools--sighunt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://www.iba.muni.cz/index-en.php?pg=research--data-analysis-tools--sighunt",
    "language": [
        "C",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sighunt-horizontal-gene-transfer-finder-optimized-for-eukaryotic-genomes.html"
        }
    ],
    "name": "SigHunt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Genomic islands (GIs) are DNA fragments incorporated into a genome through horizontal gene transfer (also called lateral gene transfer), often with functions novel for a given organism. While methods for their detection are well researched in prokaryotes, the complexity of eukaryotic genomes makes direct utilization of these methods unreliable, and so labour-intensive phylogenetic searches are used instead.Results: We present a surrogate method that investigates nucleotide base composition of the DNA sequence in a eukaryotic genome and identifies putative GIs. We calculate a genomic signature as a vector of tetranucleotide (4-mer) frequencies using a sliding window approach. Extending the neighbourhood of the sliding window, we establish a local kernel density estimate of the 4-mer frequency. We score the number of 4-mer frequencies in the sliding window that deviate from the credibility interval of their local genomic density using a newly developed discrete interval accumulative score (DIAS). To further improve the effectiveness of DIAS, we select informative 4-mers in a range of organisms using the tetranucleotide quality score developed herein. We show that the SigHunt method is computationally efficient and able to detect GIs in eukaryotic genomes that represent non-ameliorated integration. Thus, it is suited to scanning for change in organisms with different DNA composition. © 2014 The Author.",
                "authors": [
                    {
                        "name": "Jaron K.S."
                    },
                    {
                        "name": "Martinkova N."
                    },
                    {
                        "name": "Moravec J.C."
                    }
                ],
                "citationCount": 13,
                "date": "2014-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SigHunt: Horizontal gene transfer finder optimized for eukaryotic genomes"
            },
            "pmid": "24371153"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}
