{
    "additionDate": "2017-01-13T13:16:37Z",
    "biotoolsCURIE": "biotools:splicemap",
    "biotoolsID": "splicemap",
    "credit": [
        {
            "email": "kinfai@stanford.edu",
            "name": "Kin Fai Au",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Detects splice junctions from RNA-seq data. This method does not depend on any existing annotation of gene structures and is capable of finding novel splice junctions with high sensitivity and specificity. It can handle long reads (50–100 nt) and can exploit paired-read information to improve mapping accuracy.",
    "documentation": [
        {
            "type": "General",
            "url": "https://web.stanford.edu/group/wonglab/SpliceMap/tutorial.html"
        },
        {
            "type": "User manual",
            "url": "https://web.stanford.edu/group/wonglab/SpliceMap/manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://www.stanford.edu/group/wonglab/SpliceMap/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "maturity": "Mature",
    "name": "SpliceMap",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Alternative splicing is a prevalent posttranscriptional process, which is not only important to normal cellular function but is also involved in human diseases. The newly developed second generation sequencing technique provides highthroughput data (RNA-seq data) to study alternative splicing events in different types of cells. Here, we present a computational method, SpliceMap, to detect splice junctions from RNA-seq data. This method does not depend on any existing annotation of gene structures and is capable of finding novel splice junctions with high sensitivity and specificity. It can handle long reads (50-100 nt) and can exploit paired-read information to improve mapping accuracy. Several parameters are included in the output to indicate the reliability of the predicted junction and help filter out false predictions. We applied SpliceMap to analyze 23 million paired 50-nt reads from human brain tissue. The results show at this depth of sequencing, RNA-seq can support reliable detection of splice junctions except for those that are present at very low level. Compared to current methods, SpliceMap can achieve 12% higher sensitivity without sacrificing specificity. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Au K.F."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Xing Y."
                    },
                    {
                        "name": "Wong W.H."
                    }
                ],
                "citationCount": 200,
                "date": "2010-04-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Detection of splice junctions from paired-end RNA-seq data by SpliceMap"
            },
            "pmid": "20371516"
        },
        {
            "doi": "10.1093/nar/gkq211",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}