{
    "additionDate": "2017-02-14T09:36:18Z",
    "biotoolsCURIE": "biotools:orthoselect",
    "biotoolsID": "orthoselect",
    "description": "Web server detects orthologous gene sequences in EST libraries and outputs orthologous gene alignments. Annotations, data matrices for each gene, and the gene alignments may also be visualized.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "http://orthoselect.gobics.de",
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "OrthoSelect",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In the absence of whole genome sequences for many organisms, the use of expressed sequence tags (EST) offers an affordable approach for researchers conducting phylogenetic analyses to gain insight about the evolutionary history of organisms. Reliable alignments for phylogenomic analyses are based on orthologous gene sequences from different taxa. So far, researchers have not sufficiently tackled the problem of the completely automated construction of such datasets. Existing software tools are either semi-automated, covering only part of the necessary data processing, or implemented as a pipeline, requiring the installation and configuration of a cascade of external tools, which may be time-consuming and hard to manage. To simplify data set construction for phylogenomic studies, we set up a web server that uses our recently developed OrthoSelect approach. To the best of our knowledge, our web server is the first web-based EST analysis pipeline that allows the detection of orthologous gene sequences in EST libraries and outputs orthologous gene alignments. Additionally, OrthoSelect provides the user with an extensive results section that lists and visualizes all important results, such as annotations, data matrices for each gene/ taxon and orthologous gene alignments. The web server is available at http://orthoselect.gobics.de.",
                "authors": [
                    {
                        "name": "Schreiber F."
                    },
                    {
                        "name": "Worheide G."
                    },
                    {
                        "name": "Morgenstern B."
                    }
                ],
                "citationCount": 1,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OrthoSelect: A web server for selecting orthologous gene alignments from EST sequences"
            },
            "pmid": "19491309"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}