
{
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ted.bti.cornell.edu/cgi-bin/TFGD/misc/contact.cgi"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Tomato Functional Genomics Database (TFGD) provides a comprehensive resource to store, query, mine, analyze, visualize and integrate large-scale tomato functional genomics data sets. The database is functionally expanded from the previously described Tomato Expression Database by including metabolite profiles as well as large-scale tomato small RNA (sRNA) data sets. Computational pipelines have been developed to process microarray, metabolite and sRNA data sets archived in the database, respectively, and TFGD provides downloads of all the analyzed results. TFGD is also designed to enable users to easily retrieve biologically important information through a set of efficient query interfaces and analysis tools, including improved array probe annotations as well as tools to identify co-expressed genes, significantly affected biological processes and biochemical pathways from gene expression data sets and miRNA targets, and to integrate transcript and metabolite profiles, and sRNA and mRNA sequences. The suite of tools and interfaces in TFGD allow intelligent data mining of recently released and continually expanding large-scale tomato functional genomics data sets. TFGD is available at http://ted.bti.cornell.edu. © The Author(s) 2010.",
            "authors": [
                "Fei Z.",
                "Joung J.-G.",
                "Tang X.",
                "Zheng Y.",
                "Huang M.",
                "Lee J.M.",
                "McQuinn R.",
                "Tieman D.M.",
                "Alba R.",
                "Klee H.J.",
                "Giovannoni J.J."
            ],
            "cit_count": 63,
            "journal": "Nucleic Acids Research",
            "pmid": "20965973",
            "title": "Tomato functional genomics database: A comprehensive resource and analysis package for tomato functional genomics",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tfgd",
        "biotoolsID": "tfgd",
        "description": "Tomato Functional Genomics Database provides a comprehensive resource to store, query, mine, analyze, visualize and integrate large-scale tomato functional genomics data sets. Computational pipelines have been developed to process microarray, metabolite and sRNA data sets archived in the database. It is also designed to enable users to easily retrieve biologically important information through a set of efficient query interfaces and analysis tools.",
        "homepage": "http://ted.bti.cornell.edu",
        "name": "Tomato Functional Genomics Database (TFGD)"
    }
}