{
    "additionDate": "2019-11-14T19:47:28Z",
    "biotoolsCURIE": "biotools:DLO_Hi-C",
    "biotoolsID": "DLO_Hi-C",
    "confidence_flag": "tool",
    "description": "DLO Hi-C Tool for Digestion-Ligation-Only Hi-C Chromosome Conformation Capture Data Analysis | Abstract Background It is becoming increasingly important to understand the mechanism of regulatory elements on target genes in long-range genomic distance. 3C (Chromosome Conformation Capture) and its derived methods are now widely applied to investigate genome organizations and gene regulation. Digestion-Ligation-Only Hi-C (DLO Hi-C) is a new technology with high efficiency and effective cost for whole-genome chromosome conformation capture. Results Here, we introduce DLO Hi-C Tool, a flexible and versatile pipeline for processing DLO Hi-C data from raw sequencing reads to normalized contact maps and providing quality controls for different steps. It includes more efficient iterative mapping and linker filtering",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GuoliangLi-HZAU/DLO-Hi-C-Tool",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2020-12-22T08:57:33Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/GangCaoLab/DLO-HiC-Tools/issues"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/GuoliangLi-HZAU/DLO-Hi-C-Tool/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/GangCaoLab/DLO-HiC-Tools"
        }
    ],
    "name": "DLO Hi-C",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/764332"
        },
        {
            "doi": "10.3390/genes11030289",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.It is becoming increasingly important to understand the mechanism of regulatory elements on target genes in long-range genomic distance. 3C (chromosome conformation capture) and its derived methods are now widely applied to investigate three-dimensional (3D) genome organizations and gene regulation. Digestion-ligation-only Hi-C (DLO Hi-C) is a new technology with high efficiency and cost-effectiveness for whole-genome chromosome conformation capture. Here, we introduce the DLO Hi-C tool, a flexible and versatile pipeline for processing DLO Hi-C data from raw sequencing reads to normalized contact maps and for providing quality controls for different steps. It includes more efficient iterative mapping and linker filtering. We applied the DLO Hi-C tool to different DLO Hi-C datasets and demonstrated its ability in processing large data with multithreading. The DLO Hi-C tool is suitable for processing DLO Hi-C and in situ DLO Hi-C datasets. It is convenient and efficient for DLO Hi-C data processing.",
                "authors": [
                    {
                        "name": "Cao G."
                    },
                    {
                        "name": "Hong P."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Lin D."
                    },
                    {
                        "name": "Xu Q."
                    },
                    {
                        "name": "Xu W."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Genes",
                "title": "The DLO Hi-C tool for digestion-ligation-only Hi-C chromosome conformation capture data analysis"
            },
            "pmcid": "PMC7140825",
            "pmid": "32164155"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
