{
    "additionDate": "2016-06-24T11:36:59Z",
    "biotoolsCURIE": "biotools:oma",
    "biotoolsID": "oma",
    "credit": [
        {
            "email": "Christophe.Dessimoz@unil.ch",
            "name": "Christophe Dessimoz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "contact@omabrowser.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "SIB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Project that aims to identify orthologs among publicly available, complete genomes. With many hundreds of genomes analyzed to date, it is one of the largest projects of its kind.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://omabrowser.org/oma/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Switzerland"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                },
                {
                    "data": {
                        "term": "Protein sequence (raw)",
                        "uri": "http://edamontology.org/data_2974"
                    }
                },
                {
                    "data": {
                        "term": "Text",
                        "uri": "http://edamontology.org/data_3671"
                    }
                },
                {
                    "data": {
                        "term": "UniProt accession",
                        "uri": "http://edamontology.org/data_3021"
                    }
                }
            ],
            "note": "orthology prediction and paralogy OMA group",
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://omabrowser.org/oma/home/",
    "lastUpdate": "2025-06-03T08:27:37.764262Z",
    "name": "OMA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "adrian.altenhoff",
    "publication": [
        {
            "doi": "10.1093/nar/gku1158",
            "metadata": {
                "abstract": "The Orthologous Matrix (OMA) project is a method and associated database inferring evolutionary relationships amongst currently 1706 complete proteomes (i.e. the protein sequence associated for every protein-coding gene in all genomes). In this update article, we present six major new developments in OMA: (i) a new web interface; (ii) Gene Ontology function predictions as part of the OMA pipeline; (iii) better support for plant genomes and in particular homeologs in the wheat genome; (iv) a new synteny viewer providing the genomic context of orthologs; (v) statically computed hierarchical orthologous groups subsets downloadable in OrthoXML format; and (vi) possibility to export parts of the all-against-all computations and to combine them with custom data for 'client-side' orthology prediction. OMA can be accessed through the OMA Browser and various programmatic interfaces at http://omabrowser.org.",
                "authors": [
                    {
                        "name": "Altenhoff A.M."
                    },
                    {
                        "name": "Dessimoz C."
                    },
                    {
                        "name": "Glover N."
                    },
                    {
                        "name": "Gonnet G.H."
                    },
                    {
                        "name": "Gori K."
                    },
                    {
                        "name": "Muller S."
                    },
                    {
                        "name": "Pilizota I."
                    },
                    {
                        "name": "Redestig H."
                    },
                    {
                        "name": "Sueki A."
                    },
                    {
                        "name": "Sunca N."
                    },
                    {
                        "name": "Tomiczek B."
                    },
                    {
                        "name": "Train C.-M."
                    }
                ],
                "citationCount": 160,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The OMA orthology database in 2015: Function predictions, better plant support, synteny view and other improvements"
            },
            "pmcid": "PMC4383958",
            "pmid": "25399418",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkaa1007",
            "metadata": {
                "abstract": "OMA is an established resource to elucidate evolutionary relationships among genes from currently 2326 genomes covering all domains of life. OMA provides pairwise and groupwise orthologs, functional annotations, local and global gene order conservation (synteny) information, among many other functions. This update paper describes the reorganisation of the database into gene-, group- and genome-centric pages. Other new and improved features are detailed, such as reporting of the evolutionarily best conserved isoforms of alternatively spliced genes, the inferred local order of ancestral genes, phylogenetic profiling, better cross-references, fast genome mapping, semantic data sharing via RDF, as well as a special coronavirus OMA with 119 viruses from the Nidovirales order, including SARS-CoV-2, the agent of the COVID-19 pandemic. We conclude with improvements to the documentation of the resource through primers, tutorials and short videos. OMA is accessible at https://omabrowser.org.",
                "authors": [
                    {
                        "name": "Altenhoff A.M."
                    },
                    {
                        "name": "Dessimoz C."
                    },
                    {
                        "name": "Gilbert K.J."
                    },
                    {
                        "name": "Glover N.M."
                    },
                    {
                        "name": "Mediratta I."
                    },
                    {
                        "name": "Moi D."
                    },
                    {
                        "name": "Nevers Y."
                    },
                    {
                        "name": "Radoykova H.-S."
                    },
                    {
                        "name": "Rossier V."
                    },
                    {
                        "name": "Train C.-M."
                    },
                    {
                        "name": "Vesztrocy A.W."
                    },
                    {
                        "name": "de Farias T.M."
                    }
                ],
                "citationCount": 135,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OMA orthology in 2021: Website overhaul, conserved isoforms, ancestral gene order and more"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkad1020",
            "metadata": {
                "abstract": "In this update paper, we present the latest de v elopments in the OMA browser knowledgebase, whichãims to provide high-quality orthology inferencesãnd facilitate the study of gene families, genomesãnd their evolution. First, we discuss theãddition of new species in the database, particularlyãn expanded representation of prokaryotic species. The OMA browser now offers Ancestral Genome pagesãndãn Ancestral Gene Order vie w er,ãllo wing users to e xplore the e v olutionar y histor yãnd gene content ofãncestral genomes. Weãlso introduceã re vãmped L ocal Synten y Vie w er to compare genomic neighborhoodsãcross both e xtantãndãncestral genomes. Hierarchical Orthologous Groups (H O Gs)ãre nowãnnotated with Gene Ontologyãnnotations,ãnd users can easily perform extant orãncestral GO enrichments. Finally, we recap new tools in the OMA Ecosystem, including OMAmer for proteome mapping, OMArk for proteome qualityãssessment, OMAMO for model organism selectionãnd Read2Tree for phylogenetic species tree construction from reads. These new features provide exciting opportunities for orthologyãnalysisãnd comparative genomics. OMA isãccessibleãt https://omabrowser.org .",
                "authors": [
                    {
                        "name": "Altenhoff A.M."
                    },
                    {
                        "name": "Banos S.P."
                    },
                    {
                        "name": "Bernard C."
                    },
                    {
                        "name": "Dessimoz C."
                    },
                    {
                        "name": "Glover N.M."
                    },
                    {
                        "name": "Julca I."
                    },
                    {
                        "name": "Majidian S."
                    },
                    {
                        "name": "Moi D."
                    },
                    {
                        "name": "Nevers Y."
                    },
                    {
                        "name": "Nicheperovich A."
                    },
                    {
                        "name": "Train C.-M."
                    },
                    {
                        "name": "Vesztrocy A.W."
                    }
                ],
                "citationCount": 24,
                "date": "2024-01-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OMA or tholog y in 2024: impro v ed prokary ot e co v erãg e,ãncestralãnd extant GO enrichment,ã revamped synteny viewerãnd more in the OMA Ecosystem"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkx1019",
            "metadata": {
                "abstract": "The Orthologous Matrix (OMA) is a leading resource to relate genes across many species from all of life. In this update paper, we review the recent algorithmic improvements in the OMA pipeline, describe increases in species coverage (particularly in plants and early-branching eukaryotes) and introduce several new features in the OMA web browser. Notable improvements include: (i) a scalable, interactive viewer for hierarchical orthologous groups; (ii) protein domain annotations and domain-based links between orthologous groups; (iii) functionality to retrieve phylogenetic marker genes for a subset of species of interest; (iv) a new synteny dot plot viewer; and (v) an overhaul of the programmatic access (REST API and semantic web), which will facilitate incorporation of OMA analyses in computational pipelines and integration with other bioinformatic resources. OMA can be freely accessed at https://omabrowser.org.",
                "authors": [
                    {
                        "name": "Altenhoff A.M."
                    },
                    {
                        "name": "De Farias T.M."
                    },
                    {
                        "name": "Dessimoz C."
                    },
                    {
                        "name": "Dylus D."
                    },
                    {
                        "name": "Glover N.M."
                    },
                    {
                        "name": "Gonnet G.H."
                    },
                    {
                        "name": "Kaleb K."
                    },
                    {
                        "name": "Long J."
                    },
                    {
                        "name": "Redestig H."
                    },
                    {
                        "name": "Stevenson C."
                    },
                    {
                        "name": "Train C.-M."
                    },
                    {
                        "name": "Warwick Vesztrocy A."
                    },
                    {
                        "name": "Zile K."
                    }
                ],
                "citationCount": 168,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The OMA orthology database in 2018: Retrieving evolutionary relationships among all domains of life through richer web and programmatic interfaces"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}
