{
    "additionDate": "2019-11-14T18:10:44Z",
    "biotoolsCURIE": "biotools:KnowPulse",
    "biotoolsID": "KnowPulse",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "k.bett@usask.ca",
            "name": "Kirstin E. Bett",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web-Resource Focused on Diversity Data for Pulse Crop Improvement | Welcome to the Public Portal for the University of Saskatchewan Pulse Crop Research Group | ◼ View other species of interest | ◼ View other bioinformatics tools",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "https://knowpulse.usask.ca",
    "lastUpdate": "2019-11-14T18:10:44Z",
    "name": "KnowPulse",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2019.00965",
            "metadata": {
                "abstract": "© Copyright © 2019 Sanderson, Caron, Tan, Shen, Liu and Bett.KnowPulse (https://knowpulse.usask.ca) is a breeder-focused web portal for pulse breeders and geneticists. With a focus on diversity data, KnowPulse provides information on genetic markers, sequence variants, phenotypic traits and germplasm for chickpea, common bean, field pea, faba bean, and lentil. Genotypic data is accessible through the genotype matrix tool, displayed as a marker-by-germplasm table of genotype calls specific to germplasm chosen by the researcher. It is also summarized on genetic marker and sequence variant pages. Phenotypic data is visualized in trait distribution plots: violin plots for quantitative data and histograms for qualitative data. These plots are accessible through trait, germplasm, and experiment pages, as well as through a single page search tool. KnowPulse is built using the open-source Tripal toolkit and utilizes open-source tools including, but not limited to, species-specific JBrowse instances, a BLAST interface, and whole-genome CViTjs visualizations. KnowPulse is constantly evolving with data and tools added as they become available. Full integration of genetic maps and quantitative trait loci is imminent, and development of tools exploring structural variation is being explored.",
                "authors": [
                    {
                        "name": "Sanderson L.-A."
                    },
                    {
                        "name": "Caron C.T."
                    },
                    {
                        "name": "Tan R."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Liu R."
                    },
                    {
                        "name": "Bett K.E."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-31T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "KnowPulse: A Web-Resource Focused on Diversity Data for Pulse Crop Improvement"
            },
            "pmcid": "PMC6690010",
            "pmid": "31428111"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}