{
    "additionDate": "2015-08-03T09:37:00Z",
    "biotoolsCURIE": "biotools:phmmer",
    "biotoolsID": "phmmer",
    "collectionID": [
        "HMMER"
    ],
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.ebi.ac.uk/support/hmmer"
        },
        {
            "email": "rdf@ebi.ac.uk",
            "name": "Robert Finn",
            "orcidid": "http://orcid.org/0000-0001-8626-2148",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Search a protein sequence against a protein database using HMMER.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hmmer.org/documentation.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://hmmer.org/download.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Text",
                        "uri": "http://edamontology.org/data_3671"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Alignment score or penalty",
                        "uri": "http://edamontology.org/data_1394"
                    }
                },
                {
                    "data": {
                        "term": "Taxonomy",
                        "uri": "http://edamontology.org/data_3028"
                    }
                },
                {
                    "data": {
                        "term": "Structure report",
                        "uri": "http://edamontology.org/data_2085"
                    }
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://www.ebi.ac.uk/metagenomics/sequence-search/search/phmmer",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-03-13T13:08:22Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://hmmer.org"
        }
    ],
    "name": "PHMMER",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1093/nar/gkv397",
            "metadata": {
                "abstract": "© 2015 The Author(s).The HMMER website, available at http://www.ebi.ac. uk/Tools/hmmer/, provides access to the protein homology search algorithms found in the HMMER software suite. Since the first release of the website in 2011, the search repertoire has been expanded to include the iterative search algorithm, jackhmmer. The continued growth of the target sequence databases means that traditional tabular representations of significant sequence hits can be overwhelming to the user. Consequently, additional ways of presenting homology search results have been developed, allowing them to be summarised according to taxonomic distribution or domain architecture. The taxonomy and domain architecture representations can be used in combination to filter the results according to the needs of a user. Searches can also be restricted prior to submission using a new taxonomic filter, which not only ensures that the results are specific to the requested taxonomic group, but also improves search performance. The repertoire of profile hidden Markov model libraries, which are used for annotation of query sequences with protein families and domains, has been expanded to include the libraries from CATH-Gene3D, PIRSF, Superfamily and TIGRFAMs. Finally, we discuss the relocation of the HMMER webserver to the European Bioinformatics Institute and the potential impact that this will have.",
                "authors": [
                    {
                        "name": "Finn R.D."
                    },
                    {
                        "name": "Clements J."
                    },
                    {
                        "name": "Arndt W."
                    },
                    {
                        "name": "Miller B.L."
                    },
                    {
                        "name": "Wheeler T.J."
                    },
                    {
                        "name": "Schreiber F."
                    },
                    {
                        "name": "Bateman A."
                    },
                    {
                        "name": "Eddy S.R."
                    }
                ],
                "citationCount": 481,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HMMER web server: 2015 Update"
            },
            "pmcid": "PMC4489315",
            "pmid": "25943547",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btw305",
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press.Motivation: Over the last decades, vast numbers of sequences were deposited in public databases. Bioinformatics tools allow homology and consequently functional inference for these sequences. New profile-based homology search tools have been introduced, allowing reliable detection of remote homologs, but have not been systematically benchmarked. To provide such a comparison, which can guide bioinformatics workflows, we extend and apply our previously developed benchmark approach to evaluate the 'next generation' of profile-based approaches, including CS-BLAST, HHSEARCH and PHMMER, in comparison with the non-profile based search tools NCBI-BLAST, USEARCH, UBLAST and FASTA. Method: We generated challenging benchmark datasets based on protein domain architectures within either the PFAM + Clan, SCOP/Superfamily or CATH/Gene3D domain definition schemes. From each dataset, homologous and non-homologous protein pairs were aligned using each tool, and standard performance metrics calculated. We further measured congruence of domain architecture assignments in the three domain databases. Results: CSBLAST and PHMMER had overall highest accuracy. FASTA, UBLAST and USEARCH showed large trade-offs of accuracy for speed optimization. Conclusion: Profile methods are superior at inferring remote homologs but the difference in accuracy between methods is relatively small. PHMMER and CSBLAST stand out with the highest accuracy, yet still at a reasonable computational cost. Additionally, we show that less than 0.1% of Swiss-Prot protein pairs considered homologous by one database are considered non-homologous by another, implying that these classifications represent equivalent underlying biological phenomena, differing mostly in coverage and granularity. Availability and Implementation: Benchmark datasets and all scripts are placed at (http://sonnhammer.org/download/Homology-benchmark).",
                "authors": [
                    {
                        "name": "Saripella G.V."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    },
                    {
                        "name": "Forslund K."
                    }
                ],
                "citationCount": 4,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Benchmarking the next generation of homology inference tools"
            },
            "pmcid": "PMC5013910",
            "pmid": "27256311",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web service"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1,
    "version": [
        "2.23.0"
    ]
}