{
    "additionDate": "2020-01-09T18:15:04Z",
    "biotoolsCURIE": "biotools:TCGA-LGG",
    "biotoolsID": "TCGA-LGG",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yuqi9597@sina.com",
            "name": "Yu-Qi Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Engrailed 1 overexpression as a potential prognostic marker in Lower Grade Glioma.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://portal.gdc.cancer.gov/projects/TCGA-LGG",
    "lastUpdate": "2021-01-16T16:19:37Z",
    "name": "TCGA-LGG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7414",
            "metadata": {
                "abstract": "Copyright © 2019 Zhu and and Zhang.Background. Engrailed 1 (EN1), as a member of homeobox-containing transcription factors, participates in the development of the brain. High expressions of EN1 exist in various tumors. However, the role of EN1 in lower grade glioma (LGG) is still unknown. Methods. Coefficients of Cox regression were examined by data mining among 13 cancer types using OncoLnc to validate EN1 expressions in LGG patients from The Cancer Genome Atlas database (TCGA). Bioinformatic analysis was performed by using R2 and the UCSC Xena browser based on the data from 273 glioma cases in GSE16011 from GEO datasets and 530 cases of LGG patients in TCGA. Cases in GSE16011 were divided into two groups according to IDH1 mutation status. Cases in TCGA- LGG were classified to subtypes according to histopathological results, IDH1 mutation status and 1p19q status. The Kaplan-Meier survival curves were performed to analyze the relationship between EN1 expressions and clinicopathological characteristics and survival time respectively. Results. Cox regression results showed that LGG was ranked statistically first among 13 different cancer types according to the false discovery rate (FDR) correction. Results from GSE16011 showed that: glioma, LGG and LGG with IDH1 mutation patients with high EN1 expressions had significantly shorter 5, 10, and 15-year overall survival time (OS) (p<0:001). Similar results from TCGA-LGG showed that LGG patients with high EN1 expressions had significantly shorter 15-year OS, irrespective of IDH1 mutation and 1p19q co-deletion (p<0:001). The astrocytoma subgroup showed highest levels of EN1 expression and shortest 5, 10 and 15-year OS compared with oligoastrocytoma and oligodendroglioma (p<0:05). Conclusion. EN1 can be used as a prognostic marker in LGG patients, combined with IDH1 mutation and 1p19q co-deletion.",
                "authors": [
                    {
                        "name": "Zhang Y.-Q."
                    },
                    {
                        "name": "Zhu J."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Engrailed 1 overexpression as a potential prognostic marker in Lower Grade Glioma"
            },
            "pmcid": "PMC6752186",
            "pmid": "31576231"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}
