{
    "additionDate": "2017-01-13T13:14:42Z",
    "biotoolsCURIE": "biotools:gasv",
    "biotoolsID": "gasv",
    "credit": [
        {
            "email": "gasv@cs.brown.edu",
            "name": "GASV Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software for classification and comparison of structural variants measured via paired-end sequencing and/or array-CGH.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://code.google.com/archive/p/gasv/source/default/source"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "http://compbio.cs.brown.edu/projects/gasv/",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2021-04-20T09:22:56Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "GASV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "value": "RRID:SCR_000061"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Structural variants, including duplications, insertions, deletions and inversions of large blocks of DNA sequence, are an important contributor to human genome variation. Measuring structural variants in a genome sequence is typically more challenging than measuring single nucleotide changes. Current approaches for structural variant identification, including paired-end DNA sequencing/mapping and array comparative genomic hybridization (aCGH), do not identify the boundaries of variants precisely. Consequently, most reported human structural variants are poorly defined and not readily compared across different studies and measurement techniques. Results: We introduce Geometric Analysis of Structural Variants (GASV), a geometric approach for identification, classification and comparison of structural variants. This approach represents the uncertainty in measurement of a structural variant as a polygon in the plane, and identifies measurements supporting the same variant by computing intersections of polygons. We derive a computational geometry algorithm to efficiently identify all such intersections. We apply GASV to sequencing data from nine individual human genomes and several cancer genomes. We obtain better localization of the boundaries of structural variants, distinguish genetic from putative somatic structural variants in cancer genomes, and integrate aCGH and paired-end sequencing measurements of structural variants. This work presents the first general framework for comparing structural variants across multiple samples and measurement techniques, and will be useful for studies of both genetic structural variants and somatic rearrangements in cancer. © 2009 The Author(s).",
                "authors": [
                    {
                        "name": "Bashir A."
                    },
                    {
                        "name": "Helman E."
                    },
                    {
                        "name": "Raphael B.J."
                    },
                    {
                        "name": "Sindi S."
                    }
                ],
                "citationCount": 121,
                "date": "2009-06-09T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A geometric approach for classification and comparison of structural variants"
            },
            "pmid": "19477992"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
