{
    "additionDate": "2021-03-19T08:31:44Z",
    "biotoolsCURIE": "biotools:bert-gt",
    "biotoolsID": "bert-gt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhiyong.lu@nih.gov",
            "name": "Zhiyong Lu",
            "orcidid": "https://orcid.org/0000-0001-9998-916X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Bidirectional Encoder Representations from Transformers with Graph Transformer (BERT-GT) is a tool for cross-sentence n-ary relation extraction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ncbi/bert_gt",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-11T12:21:16Z",
    "license": "Freeware",
    "name": "BERT-GT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1087",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press.Motivation: A biomedical relation statement is commonly expressed in multiple sentences and consists of many concepts, including gene, disease, chemical and mutation. To automatically extract information from biomedical literature, existing biomedical text-mining approaches typically formulate the problem as a cross-sentence n-ary relation-extraction task that detects relations among n entities across multiple sentences, and use either a graph neural network (GNN) with long short-term memory (LSTM) or an attention mechanism. Recently, Transformer has been shown to outperform LSTM on many natural language processing (NLP) tasks. Results: In this work, we propose a novel architecture that combines Bidirectional Encoder Representations from Transformers with Graph Transformer (BERT-GT), through integrating a neighbor-attention mechanism into the BERT architecture. Unlike the original Transformer architecture, which utilizes the whole sentence(s) to calculate the attention of the current token, the neighbor-attention mechanism in our method calculates its attention utilizing only its neighbor tokens. Thus, each token can pay attention to its neighbor information with little noise. We show that this is critically important when the text is very long, as in cross-sentence or abstract-level relation-extraction tasks. Our benchmarking results show improvements of 5.44% and 3.89% in accuracy and F1-measure over the state-of-the-art on n-ary and chemical-protein relation datasets, suggesting BERT-GT is a robust approach that is applicable to other biomedical relation extraction tasks or datasets.",
                "authors": [
                    {
                        "name": "Lai P.-T."
                    },
                    {
                        "name": "Lu Z."
                    }
                ],
                "date": "2020-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BERT-GT: Cross-sentence n-ary relation extraction with BERT and Graph Transformer"
            },
            "pmid": "33416851"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}