
{
    "credit": [
    ],
    "labels": {
        "topic": [
            {
                "term": "Psychiatry",
                "uri": "http://edamontology.org/topic_3419"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            },
            {
                "term": "Medicines research and development",
                "uri": "http://edamontology.org/topic_3376"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 National Rural Health Alliance Ltd.Rural mental health outcomes have been persistently poorer than those in larger cities suggesting that the prevailing investments to improve matters are not working. Mental health researchers and service providers from New South Wales, Victoria, Western Australia and the Australian Capital Territory met in Orange in October 2018 to explore issues pertaining to rural mental health and well-being. The group recognised and acknowledged that rural residents experience a series of interconnected geographical, demographic, social, economic and environmental challenges which are not addressed adequately by the current mix of services. This declaration has been endorsed by those listed below and we welcome further support. We list ten interrelated problems and ten solutions. As a group, we take this declaration as an opportunity to invite discussion about how we can collectively improve the mental health of rural residents through research, service design and delivery. We invite the reader to consider endorsing this declaration. A short summary of supporting evidence is available online at https://www.crrmh.com.au/.",
            "authors": [
                "Perkins D.",
                "Farmer J.",
                "Salvador-Carulla L.",
                "Dalton H.",
                "Luscombe G."
            ],
            "cit_count": 0,
            "doi": "10.1111/AJR.12560",
            "journal": "Australian Journal of Rural Health",
            "pmid": "31515882",
            "title": "The Orange Declaration on rural and remote mental health",
            "year": "2019-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:crrmh",
        "biotoolsID": "crrmh",
        "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/Ribopeaks (COM.), bio.tools/NeOGen (COM.AU), bio.tools/chromas (COM.AU) | > CORRECT NAME OF TOOL COULD ALSO BE 'rural', 'mental', 'declaration' | The Orange Declaration on rural and remote mental health | Centre for Rural and Remote Mental Health | Providing leadership in rural and remote mental health research, working closely with rural communities and our valued partners",
        "homepage": "https://www.crrmh.com.au/",
        "name": "crrmh"
    }
}