{
    "additionDate": "2022-02-14T10:35:56.899833Z",
    "biotoolsCURIE": "biotools:conifer",
    "biotoolsID": "conifer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "goliaei@ut.ac.ir",
            "name": "Bahram Goliaei",
            "typeEntity": "Person"
        }
    ],
    "description": "Conifer (ClONal tree Inference For hEterogeneity of tumoR) is proposed which combines aggregated variant allele frequency from bulk sequencing data with branching event information from single-cell sequencing data to more accurately identify clones and their evolutionary relationships.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LeilaBagha/Conifer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-14T10:35:56.902557Z",
    "name": "Conifer",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04338-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Genetic heterogeneity of a cancer tumor that develops during clonal evolution is one of the reasons for cancer treatment failure, by increasing the chance of drug resistance. Clones are cell populations with different genotypes, resulting from differences in somatic mutations that occur and accumulate during cancer development. An appropriate approach for identifying clones is determining the variant allele frequency of mutations that occurred in the tumor. Although bulk sequencing data can be used to provide that information, the frequencies are not informative enough for identifying different clones with the same prevalence and their evolutionary relationships. On the other hand, single-cell sequencing data provides valuable information about branching events in the evolution of a cancerous tumor. However, the temporal order of mutations may be determined with ambiguities using only single-cell data, while variant allele frequencies from bulk sequencing data can provide beneficial information for inferring the temporal order of mutations with fewer ambiguities. Result: In this study, a new method called Conifer (ClONal tree Inference For hEterogeneity of tumoR) is proposed which combines aggregated variant allele frequency from bulk sequencing data with branching event information from single-cell sequencing data to more accurately identify clones and their evolutionary relationships. It is proven that the accuracy of clone identification and clonal tree inference is increased by using Conifer compared to other existing methods on various sets of simulated data. In addition, it is discussed that the evolutionary tree provided by Conifer on real cancer data sets is highly consistent with information in both bulk and single-cell data. Conclusions: In this study, we have provided an accurate and robust method to identify clones of tumor heterogeneity and their evolutionary history by combining single-cell and bulk sequencing data.",
                "authors": [
                    {
                        "name": "Baghaarabani L."
                    },
                    {
                        "name": "Foroughmand-Araabi M.-H."
                    },
                    {
                        "name": "Goliaei B."
                    },
                    {
                        "name": "Goliaei S."
                    },
                    {
                        "name": "Shariatpanahi S.P."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Conifer: clonal tree inference for tumor heterogeneity with single-cell and bulk sequencing data"
            },
            "pmcid": "PMC8404257",
            "pmid": "34461827"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}
