{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T11:35:17Z",
    "biotoolsCURIE": "biotools:fastJT",
    "biotoolsID": "fastJT",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jiaxing.lin@duke.edu",
            "name": "Jiaxing Lin",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Maintainer",
                "Primary contact"
            ]
        },
        {
            "name": "Alexander Sibley",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Ivo Shterev",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Kouros Owzar",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "R package for robust and efficient feature selection for machine learning and genome-wide association studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=fastJT",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T21:08:55.532954Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cran/fastJT"
        }
    ],
    "maturity": "Mature",
    "name": "fastJT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2869-3",
            "metadata": {
                "abstract": "Background: Parametric feature selection methods for machine learning and association studies based on genetic data are not robust with respect to outliers or influential observations. While rank-based, distribution-free statistics offer a robust alternative to parametric methods, their practical utility can be limited, as they demand significant computational resources when analyzing high-dimensional data. For genetic studies that seek to identify variants, the hypothesis is constrained, since it is typically assumed that the effect of the genotype on the phenotype is monotone (e.g., an additive genetic effect). Similarly, predictors for machine learning applications may have natural ordering constraints. Cross-validation for feature selection in these high-dimensional contexts necessitates highly efficient computational algorithms for the robust evaluation of many features. Results: We have developed an R extension package, fastJT, for conducting genome-wide association studies and feature selection for machine learning using the Jonckheere-Terpstra statistic for constrained hypotheses. The kernel of the package features an efficient algorithm for calculating the statistics, replacing the pairwise comparison and counting processes with a data sorting and searching procedure, reducing computational complexity from O(n 2) to O(n log(n)). The computational efficiency is demonstrated through extensive benchmarking, and example applications to real data are presented. Conclusions: fastJT is an open-source R extension package, applying the Jonckheere-Terpstra statistic for robust feature selection for machine learning and association studies. The package implements an efficient algorithm which leverages internal information among the samples to avoid unnecessary computations, and incorporates shared-memory parallel programming to further boost performance on multi-core machines.",
                "authors": [
                    {
                        "name": "Chan C."
                    },
                    {
                        "name": "Innocenti F."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Nixon A."
                    },
                    {
                        "name": "Owzar K."
                    },
                    {
                        "name": "Shterev I."
                    },
                    {
                        "name": "Sibley A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-06-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FastJT: An R package for robust and efficient feature selection for machine learning and genome-wide association studies"
            },
            "pmcid": "PMC6567636",
            "pmid": "31195980",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.4"
    ]
}
