
{
    "credit": [
        {
            "email": "xiaoyun@ems.hrbmu.edu.cn",
            "name": "Xiao Yun",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://202.97.205.69/IndividualizedPath/jsp/about.jsp"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://202.97.205.69/IndividualizedPath/jsp/about.jsp"
        },
        {
            "type": "GENERAL",
            "url": "http://202.97.205.69/IndividualizedPath/jsp/help.jsp"
        },
        {
            "type": "OTHER",
            "url": "http://202.97.205.69/IndividualizedPath/jsp/qAa.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Comparison",
                    "uri": "http://edamontology.org/operation_2424"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/individualizedpath-identifying-genetic-alterations-contributing-to-the-dysfunctional-pathways-in-glioblastoma-individuals.html"
        }
    ],
    "publication": [
        {
            "abstract": "Due to the extensive complexity and high genetic heterogeneity of genetic alterations in cancer, comprehensively depicting the molecular mechanisms of cancer remains difficult. Characterizing personalized pathogenesis in cancer individuals can help to reveal new details of the complex mechanisms. In this study, we proposed an integrative method called IndividualizedPath to identify genetic alterations and their downstream risk pathways from the perspective of individuals through combining the DNA copy number, gene expression data and topological structures of biological pathways. By applying the method to TCGA glioblastoma multiforme (GBM) samples, we identified 394 gene-pathway pairs in 252 GBM individuals. We found that genes with copy number alterations showed high heterogeneity across GBM individuals, whereas they affected relatively consistent biological pathways. A global landscape of gene-pathway pairs showed that EGFR linked with multiple cancer-related biological pathways confers the highest risk of GBM. GBM individuals with MET-pathway pairs showed significantly shorter survival times than those with only MET amplification. Importantly, we found that the same risk pathways were affected by different genes in distinct groups of GBM individuals with a significant pattern of mutual exclusivity. Similarly, GBM subtype analysis revealed some subtype-specific gene-pathway pairs. In addition, we found that some rare copy number alterations had a large effect on contribution to numerous cancer-related pathways. In summary, our method offers the possibility to identify personalized cancer mechanisms, which can be applied to other types of cancer through the web server (http://bioinfo.hrbmu.edu.cn/IndividualizedPath/). This journal is © the Partner Organisations 2014.",
            "authors": [
                "Ping Y.",
                "Zhang H.",
                "Deng Y.",
                "Wang L.",
                "Zhao H.",
                "Pang L.",
                "Fan H.",
                "Xu C.",
                "Li F.",
                "Zhang Y.",
                "Gong Y.",
                "Xiao Y.",
                "Li X."
            ],
            "cit_count": 4,
            "journal": "Molecular BioSystems",
            "pmid": "24911613",
            "title": "IndividualizedPath: Identifying genetic alterations contributing to the dysfunctional pathways in glioblastoma individuals",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:individualizedpath",
        "biotoolsID": "individualizedpath",
        "description": "Identifies causal genes and their affecting risk pathways in cancer individuals by integrating data from genetic alteration, gene expression and the topology structure of KEGG pathway.",
        "homepage": "http://bioinfo.hrbmu.edu.cn/IndividualizedPath/",
        "name": "IndividualizedPath"
    }
}