{
    "accessibility": "Open access",
    "additionDate": "2018-07-30T11:49:37Z",
    "biotoolsCURIE": "biotools:hierarchical_feature_engineering",
    "biotoolsID": "hierarchical_feature_engineering",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "andreas.henschel@ku.ac.ae",
            "name": "Andreas Henschel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "We developed an algorithm that deals with Hierarchical Feature Spaces, with focus on relative abundances of microbial communities but with the potential to be expanded to a wide range of Machine Learning tasks were features have an underlying hierarchical structure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/HenschelLab/HierarchicalFeatureEngineering/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HenschelLab/HierarchicalFeatureEngineering",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "GPL-3.0",
    "name": "Hierarchical Feature Engineering",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2205-3",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: What is a healthy microbiome? The pursuit of this and many related questions, especially in light of the recently recognized microbial component in a wide range of diseases has sparked a surge in metagenomic studies. They are often not simply attributable to a single pathogen but rather are the result of complex ecological processes. Relatedly, the increasing DNA sequencing depth and number of samples in metagenomic case-control studies enabled the applicability of powerful statistical methods, e.g. Machine Learning approaches. For the latter, the feature space is typically shaped by the relative abundances of operational taxonomic units, as determined by cost-effective phylogenetic marker gene profiles. While a substantial body of microbiome/microbiota research involves unsupervised and supervised Machine Learning, very little attention has been put on feature selection and engineering. Results: We here propose the first algorithm to exploit phylogenetic hierarchy (i.e. an all-encompassing taxonomy) in feature engineering for microbiota classification. The rationale is to exploit the often mono- or oligophyletic distribution of relevant (but hidden) traits by virtue of taxonomic abstraction. The algorithm is embedded in a comprehensive microbiota classification pipeline, which we applied to a diverse range of datasets, distinguishing healthy from diseased microbiota samples. Conclusion: We demonstrate substantial improvements over the state-of-the-art microbiota classification tools in terms of classification accuracy, regardless of the actual Machine Learning technique while using drastically reduced feature spaces. Moreover, generalized features bear great explanatory value: they provide a concise description of conditions and thus help to provide pathophysiological insights. Indeed, the automatically and reproducibly derived features are consistent with previously published domain expert analyses.",
                "authors": [
                    {
                        "name": "Oudah M."
                    },
                    {
                        "name": "Henschel A."
                    }
                ],
                "date": "2018-06-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Taxonomy-aware feature engineering for microbiome classification"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbiome",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}