{"credit":[{"email":"scLVM-dev@ebi.ac.uk","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.helmholtz-muenchen.de/icb/index.html"}],"documentation":[{"type":"GENERAL","url":"https://github.com/PMBio/scLVM"}],"function":[{"operation":[{"term":"RNA-Seq analysis","uri":"http://edamontology.org/operation_3680"}]}],"labels":{"language":["R","Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"RNA-Seq","uri":"http://edamontology.org/topic_3170"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/sclvm-modelling-framework-for-single-cell-rna-seq-data.html"}],"publication":[{"abstract":"© 2015 Nature America, Inc. All rights reserved.Recent technical developments have enabled the transcriptomes of hundreds of cells to be assayed in an unbiased manner, opening up the possibility that new subpopulations of cells can be found. However, the effects of potential confounding factors, such as the cell cycle, on the heterogeneity of gene expression and therefore on the ability to robustly identify subpopulations remain unclear. We present and validate a computational approach that uses latent variable models to account for such hidden factors. We show that our single-cell latent variable model (scLVM) allows the identification of otherwise undetectable subpopulations of cells that correspond to different stages during the differentiation of naive T cells into T helper 2 cells. Our approach can be used not only to identify cellular subpopulations but also to tease apart different sources of gene expression heterogeneity in single-cell transcriptomes.","authors":["Buettner F.","Natarajan K.N.","Casale F.P.","Proserpio V.","Scialdone A.","Theis F.J.","Teichmann S.A.","Marioni J.C.","Stegle O."],"cit_count":326,"journal":"Nature Biotechnology","pmid":"25599176","title":"Computational analysis of cell-to-cell heterogeneity in single-cell RNA-sequencing data reveals hidden subpopulations of cells","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:sclvm","biotoolsID":"sclvm","description":"Modelling framework for single-cell RNA-seq data that can be used to dissect the observed heterogeneity into different sources, thereby allowing for the correction of confounding sources of variation.","homepage":"https://github.com/PMBio/scLVM","name":"scLVM"}}