{
    "additionDate": "2020-01-14T09:08:39Z",
    "biotoolsCURIE": "biotools:EasyMEG",
    "biotoolsID": "EasyMEG",
    "confidence_flag": "tool",
    "description": "An easy-to-use toolbox for MEG analysis.\n\nan easy-to-use software for MEG analysis based on FieldTrip and Matlab GUI.\n\nYou can use the editor on GitHub to maintain and preview the content for your website in Markdown files",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://tonywu2018.github.io/EasyMEG/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-25T11:28:16Z",
    "license": "GPL-3.0",
    "name": "EasyMEG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2019.105199",
            "metadata": {
                "abstract": "© 2019Background and objective: Magnetoencephalography (MEG) is an advanced magnetic source imaging technology that measures the magnetic fields produced by neural activities. It has been extensively used in scientific research and clinical diagnosis due to its high temporal and spatial resolution. Considering the special nature of MEG data, it needs to perform a series of processes and analysis to obtain valuable information. Therefore, the identification of data processing is a key point of MEG studies. At present, the software for MEG analysis such as FieldTrip has no Graphic User Interface (GUI) and users must write their own script to perform concrete analysis. It brings the difficulties to researchers like the doctors without experience in programming or newcomers to MEG. Thus, an open-sourced software-EasyMEG was developed. It has friendly interface with highly functions-integration. Methods: The functions of EasyMEG are developed based on MATLAB language to ensure the consistency of the user interface under different operating systems. EasyMEG is a highly integrated software that contains a set of functions for preprocessing, time-lock analysis, time–frequency analysis, source analysis, and plotting. EasyMEG provides a friendly GUI and allows users to complete analyses through a simple and clean interface. Results: This toolbox has been released as an open-source software on GitHub under the GNU General Public License: https://tonywu2018.github.io/EasyMEG/. Conclusions: We hope to improve this toolbox by the power of community and wish to make EasyMEG a simple and powerful toolbox for further MEG studies.",
                "authors": [
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Nie Y."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Ren J."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "EasyMEG: An easy-to-use toolbox for MEG analysis"
            },
            "pmid": "31743827"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}