{
    "additionDate": "2019-11-14T19:59:48Z",
    "biotoolsCURIE": "biotools:DIPY",
    "biotoolsID": "DIPY",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "kesshi.jordan@gmail.com",
            "name": "Kesshi Jordan",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'WMPL', 'DW-MRI', 'anisotropic' | An Open-Source Tool for Anisotropic Radiation Therapy Planning in Neuro-oncology Using DW-MRI Tractography | flexible grid to streamline affine generation and pathlength function by kesshijordan | Dipy is a free and open source software project for computational neuroanatomy, focusing mainly on diffusion magnetic resonance imaging (dMRI) analysis. It implements a broad range of algorithms for denoising, registration, reconstruction, tracking, clustering, visualization, and statistical analysis of MRI data | Included are two related additions : NF: The path_length function computes the shortest path, along any streamline, between the roi and each voxel. @MrBago and I are using this for a particular project we're working on, but it could be useful in other applications | You can’t perform that action at this time | You signed in with another tab or window",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                }
            ]
        }
    ],
    "homepage": "http://dipy.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:59:48Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/nipy/dipy/pull/1114"
        }
    ],
    "name": "DIPY",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FONC.2019.00810",
            "metadata": {
                "abstract": "© 2019 Jordan, Morin, Wahl, Amirbekian, Chapman, Owen, Mukherjee, Braunstein and Henry. of the Creative Commo.There is evidence from histopathological studies that glioma tumor cells migrate preferentially along large white matter bundles. If the peritumoral white matter structures can be used to predict the likely trajectory of migrating tumor cells outside of the surgical margin, then this information could be used to inform the delineation of radiation therapy (RT) targets. In theory, an anisotropic expansion that takes large white matter bundle anatomy into account may maximize the chances of treating migrating cancer cells and minimize the amount of brain tissue exposed to high doses of ionizing radiation. Diffusion-weighted MRI (DW-MRI) can be used in combination with fiber tracking algorithms to model the trajectory of large white matter pathways using the direction and magnitude of water movement in tissue. The method presented here is a tool for translating a DW-MRI fiber tracking (tractography) dataset into a white matter path length (WMPL) map that assigns each voxel the shortest distance along a streamline back to a specified region of interest (ROI). We present an open-source WMPL tool, implemented in the package Diffusion Imaging in Python (DIPY), and code to convert the resulting WMPL map to anisotropic contours for RT in a commercial treatment planning system. This proof-of-concept lays the groundwork for future studies to evaluate the clinical value of incorporating tractography modeling into treatment planning.",
                "authors": [
                    {
                        "name": "Jordan K."
                    },
                    {
                        "name": "Morin O."
                    },
                    {
                        "name": "Wahl M."
                    },
                    {
                        "name": "Amirbekian B."
                    },
                    {
                        "name": "Chapman C."
                    },
                    {
                        "name": "Owen J."
                    },
                    {
                        "name": "Mukherjee P."
                    },
                    {
                        "name": "Braunstein S."
                    },
                    {
                        "name": "Henry R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "An open-source tool for anisotropic radiation therapy planning in neuro-oncology using DW-MRI tractography"
            },
            "pmcid": "PMC6730482",
            "pmid": "31544062"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}