{
    "additionDate": "2019-11-14T19:59:48Z",
    "biotoolsCURIE": "biotools:DIPY",
    "biotoolsID": "DIPY",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kesshi.jordan@gmail.com",
            "name": "Kesshi Jordan",
            "typeEntity": "Person"
        }
    ],
    "description": "DIPY is a free and open source software project for the analysis of data from diffusion magnetic resonance imaging (dMRI) experiments",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                }
            ]
        }
    ],
    "homepage": "http://dipy.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-22T07:46:16Z",
    "name": "Diffusion Imaging in Python (DIPY)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fninf.2014.00008",
            "metadata": {
                "abstract": "Diffusion Imaging in Python (Dipy) is a free and open source software project for the analysis of data from diffusion magnetic resonance imaging (dMRI) experiments. dMRI is an application of MRI that can be used to measure structural features of brain white matter. Many methods have been developed to use dMRI data to model the local configuration of white matter nerve fiber bundles and infer the trajectory of bundles connecting different parts of the brain. Dipy gathers implementations of many different methods in dMRI, including: diffusion signal pre-processing; reconstruction of diffusion distributions in individual voxels; fiber tractography and fiber track post-processing, analysis and visualization. Dipy aims to provide transparent implementations for all the different steps of dMRI analysis with a uniform programming interface. We have implemented classical signal reconstruction techniques, such as the diffusion tensor model and deterministic fiber tractography. In addition, cutting edge novel reconstruction techniques are implemented, such as constrained spherical deconvolution and diffusion spectrum imaging (DSI) with deconvolution, as well as methods for probabilistic tracking and original methods for tractography clustering. Many additional utility functions are provided to calculate various statistics, informative visualizations, as well as file-handling routines to assist in the development and use of novel techniques. In contrast to many other scientific software projects, Dipy is not being developed by a single research group. Rather, it is an open project that encourages contributions from any scientist/developer through GitHub and open discussions on the project mailing list. Consequently, Dipy today has an international team of contributors, spanning seven different academic institutions in five countries and three continents, which is still growing. © 2014 Garyfallidis, Brett, Amirbekian, Rokem, van der Walt, Descoteaux, Nimmo-Smith and Dipy Contributors.",
                "authors": [
                    {
                        "name": "Garyfallidis E."
                    },
                    {
                        "name": "Brett M."
                    },
                    {
                        "name": "Amirbekian B."
                    },
                    {
                        "name": "Rokem A."
                    },
                    {
                        "name": "van der Walt S."
                    },
                    {
                        "name": "Descoteaux M."
                    },
                    {
                        "name": "Nimmo-Smith I."
                    }
                ],
                "citationCount": 368,
                "date": "2014-02-21T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Dipy, a library for the analysis of diffusion MRI data"
            },
            "pmcid": "PMC3931231",
            "pmid": "24600385",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite",
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}