{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://zhaocenter.org/"}],"documentation":[{"url":"https://github.com/dongjunchung/GPA/blob/master/inst/doc/GPA-example.pdf?raw=true"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"language":["R","C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/gpa-genetic-analysis-incorporating-pleiotropy-and-annotation.html"}],"publication":[{"abstract":"© 2014. Results from Genome-Wide Association Studies (GWAS) have shown that complex diseases are often affected by many genetic variants with small or moderate effects. Identifications of these risk variants remain a very challenging problem. There is a need to develop more powerful statistical methods to leverage available information to improve upon traditional approaches that focus on a single GWAS dataset without incorporating additional data. In this paper, we propose a novel statistical approach, GPA (Genetic analysis incorporating Pleiotropy and Annotation), to increase statistical power to identify risk variants through joint analysis of multiple GWAS data sets and annotation information because: (1) accumulating evidence suggests that different complex diseases share common risk bases, i.e., pleiotropy; and (2) functionally annotated variants have been consistently demonstrated to be enriched among GWAS hits. GPA can integrate multiple GWAS datasets and functional annotations to seek association signals, and it can also perform hypothesis testing to test the presence of pleiotropy and enrichment of functional annotation. Statistical inference of the model parameters and SNP ranking is achieved through an EM algorithm that can handle genome-wide markers efficiently. When we applied GPA to jointly analyze five psychiatric disorders with annotation information, not only did GPA identify many weak signals missed by the traditional single phenotype analysis, but it also revealed relationships in the genetic architecture of these disorders. Using our hypothesis testing framework, statistically significant pleiotropic effects were detected among these psychiatric disorders, and the markers annotated in the central nervous system genes and eQTLs from the Genotype-Tissue Expression (GTEx) database were significantly enriched. We also applied GPA to a bladder cancer GWAS data set with the ENCODE DNase-seq data from 125 cell lines. GPA was able to detect cell lines that are biologically more relevant to bladder cancer. The R implementation of GPA is currently available at http://dongjunchung.github.io/GPA/.","authors":["Chung D.","Yang C.","Li C.","Gelernter J.","Zhao H."],"cit_count":78,"journal":"PLoS Genetics","pmid":"25393678","title":"GPA: A Statistical Approach to Prioritizing GWAS Results by Integrating Pleiotropy and Annotation","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:gpa","biotoolsID":"gpa","description":"Statistical approach to prioritizing GWAS results by integrating pleiotropy information and annotation data.","homepage":"http://dongjunchung.github.io/GPA/","name":"GPA"}}