{"credit":[{"email":"Dan.Theodorescu@ucdenver.edu","name":"Dan Theodorescu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.linkedin.com/in/yuanbinru"}],"documentation":[{"type":"GENERAL","url":"https://github.com/KechrisLab/multiMiR"}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/multimir-integration-of-microrna-target-interactions-along-with-their-disease-and-drug-associations.html"}],"publication":[{"abstract":"© © The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.microRNAs (miRNAs) regulate expression by promoting degradation or repressing translation of target transcripts. miRNA target sites have been catalogued in databases based on experimental validation and computational prediction using various algorithms. Several online resources provide collections of multiple databases but need to be imported into other software, such as R, for processing, tabulation, graphing and computation. Currently available miRNA target site packages in R are limited in the number of databases, types of databases and flexibility. We present multiMiR, a new miRNA-target interaction R package and database, which includes several novel features not available in existing R packages: (i) compilation of nearly 50 million records in human and mouse from 14 different databases, more than any other collection; (ii) expansion of databases to those based on disease annotation and drug microRNAresponse, in addition to many experimental and computational databases; and (iii) user-defined cutoffs for predicted binding strength to provide the most confident selection. Case studies are reported on various biomedical applications including mouse models of alcohol consumption, studies of chronic obstructive pulmonary disease in human subjects, and human cell line models of bladder cancer metastasis. We also demonstrate how multiMiR was used to generate testable hypotheses that were pursued experimentally.","authors":["Ru Y.","Kechris K.J.","Tabakoff B.","Hoffman P.","Radcliffe R.A.","Bowler R.","Mahaffey S.","Rossi S.","Calin G.A.","Bemis L.","Theodorescu D."],"cit_count":56,"journal":"Nucleic Acids Research","pmid":"25063298","title":"The multiMiR R package and database: Integration of microRNA-target interactions along with their disease and drug associations","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:multimir","biotoolsID":"multimir","description":"This R package is a comprehensive collection of predicted and validated miRNA-target interactions and their associations with diseases and drugs.","homepage":"http://multimir.ucdenver.edu/","name":"multiMiR"}}