{
    "additionDate": "2017-08-03T18:59:16Z",
    "biotoolsCURIE": "biotools:scmmtp",
    "biotoolsID": "scmmtp",
    "credit": [
        {
            "email": "hlhuang@mail.nctu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "syho@nctu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A novel method  based on the scoring card method (SCM) using dipeptide composition to identify and characterize MTPs from an existing dataset.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://iclab.life.nctu.edu.tw/iclab_webtools/SCMMTP/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://iclab.life.nctu.edu.tw/iclab_webtools/SCMMTP/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/scmmtp-identifying-and-characterizing-membrane-transport-proteins-using-propensity-scores-of-dipeptides.html"
        }
    ],
    "name": "SCMMTP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Liou et al. Background: Identifying putative membrane transport proteins (MTPs) and understanding the transport mechanisms involved remain important challenges for the advancement of structural and functional genomics. However, the transporter characters are mainly acquired from MTP crystal structures which are hard to crystalize. Therefore, it is desirable to develop bioinformatics tools for the effective large-scale analysis of available sequences to identify novel transporters and characterize such transporters. Results: This work proposes a novel method (SCMMTP) based on the scoring card method (SCM) using dipeptide composition to identify and characterize MTPs from an existing dataset containing 900 MTPs and 660 non-MTPs which are separated into a training dataset consisting 1,380 proteins and an independent dataset consisting 180 proteins. The SCMMTP produced estimating propensity scores for amino acids and dipeptides as MTPs. The SCMMTP training and test accuracy levels respectively reached 83.81% and 76.11%. The test accuracy of support vector machine (SVM) using a complicated classification method with a low possibility for biological interpretation and position-specific substitution matrix (PSSM) as a protein feature is 80.56%, thus SCMMTP is comparable to SVM-PSSM. To identify MTPs, SCMMTP is applied to three datasets including: 1) human transmembrane proteins, 2) a photosynthetic protein dataset, and 3) a human protein database. MTPs showing α-helix rich structure is agreed with previous studies. The MTPs used residues with low hydration energy. It is hypothesized that, after filtering substrates, the hydrated water molecules need to be released from the pore regions. Conclusions: SCMMTP yields estimating propensity scores for amino acids and dipeptides as MTPs, which can be used to identify novel MTPs and characterize transport mechanisms for use in further experiments. Availability:http://iclab.life.nctu.edu.tw/iclab_webtools/SCMMTP/.",
                "authors": [
                    {
                        "name": "Liou Y.-F."
                    },
                    {
                        "name": "Vasylenko T."
                    },
                    {
                        "name": "Yeh C.-L."
                    },
                    {
                        "name": "Lin W.-C."
                    },
                    {
                        "name": "Chiu S.-H."
                    },
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Shu L.-S."
                    },
                    {
                        "name": "Ho S.-Y."
                    },
                    {
                        "name": "Huang H.-L."
                    }
                ],
                "citationCount": 4,
                "date": "2015-12-09T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "SCMMTP: Identifying and characterizing membrane transport proteins using propensity scores of dipeptides"
            },
            "pmid": "26677931"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Structural genomics",
            "uri": "http://edamontology.org/topic_0122"
        }
    ],
    "validated": 1
}