{
    "additionDate": "2019-11-14T19:58:08Z",
    "biotoolsCURIE": "biotools:Phyllosticta_citricarpa",
    "biotoolsID": "Phyllosticta_citricarpa",
    "confidence_flag": "tool",
    "description": "Phyllosticta citricarpa and sister species of global importance to Citrus | Please confirm that you want to SAVE all your changes for 'Phyllosticta' | Please confirm that you want to DISCARD all your changes for 'Phyllosticta' | Phyllosticta citricarpa CBS 127454 v1.0",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://genome.jgi.doe.gov/Phyllosticta",
    "lastUpdate": "2020-12-04T16:12:02.727814Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://mycocosm.jgi.doe.gov/pages/blast-query.jsf?db=Phyllosticta"
        }
    ],
    "name": "Phyllosticta citricarpa",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/MPP.12861",
            "metadata": {
                "abstract": "© 2019 The Authors. Molecular Plant Pathology published by British Society for Plant Pathology and John Wiley & Sons LtdSeveral Phyllosticta species are known as pathogens of Citrus spp., and are responsible for various disease symptoms including leaf and fruit spots. One of the most important species is P. citricarpa, which causes a foliar and fruit disease called citrus black spot. The Phyllosticta species occurring on citrus can most effectively be distinguished from P. citricarpa by means of multilocus DNA sequence data. Recent studies also demonstrated P. citricarpa to be heterothallic, and reported successful mating in the laboratory. Since the domestication of citrus, different clones of P. citricarpa have escaped Asia to other continents via trade routes, with obvious disease management consequences. This pathogen profile represents a comprehensive literature review of this pathogen and allied taxa associated with citrus, focusing on identification, distribution, genomics, epidemiology and disease management. This review also considers the knowledge emerging from seven genomes of Phyllosticta spp., demonstrating unknown aspects of these species, including their mating behaviour. Taxonomy: Phyllosticta citricarpa (McAlpine) Aa, 1973. Kingdom Fungi, Phylum Ascomycota, Class Dothideomycetes, Order Botryosphaeriales, Family Phyllostictaceae, Genus Phyllosticta, Species citricarpa. Host range: Confirmed on more than 12 Citrus species, Phyllosticta citricarpa has only been found on plant species in the Rutaceae. Disease symptoms: P. citricarpa causes diverse symptoms such as hard spot, virulent spot, false melanose and freckle spot on fruit, and necrotic lesions on leaves and twigs. Useful websites: DOE Joint Genome Institute MycoCosm portals for the Phyllosticta capitalensis (https://genome.jgi.doe.gov/Phycap1), P. citriasiana (https://genome.jgi.doe.gov/Phycit1), P. citribraziliensis (https://genome.jgi.doe.gov/Phcit1), P. citrichinaensis (https://genome.jgi.doe.gov/Phcitr1), P. citricarpa (https://genome.jgi.doe.gov/Phycitr1, https://genome.jgi.doe.gov/Phycpc1), P. paracitricarpa (https://genome.jgi.doe.gov/Phy27169) genomes. All available Phyllosticta genomes on MycoCosm can be viewed at https://genome.jgi.doe.gov/Phyllosticta.",
                "authors": [
                    {
                        "name": "Guarnaccia V."
                    },
                    {
                        "name": "Gehrmann T."
                    },
                    {
                        "name": "Silva-Junior G.J."
                    },
                    {
                        "name": "Fourie P.H."
                    },
                    {
                        "name": "Haridas S."
                    },
                    {
                        "name": "Vu D."
                    },
                    {
                        "name": "Spatafora J."
                    },
                    {
                        "name": "Martin F.M."
                    },
                    {
                        "name": "Robert V."
                    },
                    {
                        "name": "Grigoriev I.V."
                    },
                    {
                        "name": "Groenewald J.Z."
                    },
                    {
                        "name": "Crous P.W."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Molecular Plant Pathology",
                "title": "Phyllosticta citricarpa and sister species of global importance to Citrus"
            },
            "pmid": "31512371"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}