{
    "additionDate": "2021-03-19T09:15:46Z",
    "biotoolsCURIE": "biotools:plant-rlk-rlp",
    "biotoolsID": "plant-rlk-rlp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "drestmont@gmail.com",
            "name": "Daniel Restrepo-Montoya",
            "orcidid": "https://orcid.org/0000-0003-4910-7880",
            "typeEntity": "Person"
        },
        {
            "email": "Juan.Osorno@ndsu.edu",
            "name": "Juan M. Osorno",
            "typeEntity": "Person"
        },
        {
            "email": "Phillip.Mcclean@ndsu.edu",
            "name": "Phillip E. McClean",
            "typeEntity": "Person"
        }
    ],
    "description": "Orthology and synteny analysis of receptor-like kinases \"RLK\" and receptor-like proteins \"RLP\" in legumes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/drestmont/plant_rlk_rlp/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-02T16:30:43Z",
    "license": "MIT",
    "name": "plant-rlk-rlp",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07384-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Legume species are an important plant model because of their protein-rich physiology. The adaptability and productivity of legumes are limited by major biotic and abiotic stresses. Responses to these stresses directly involve plasma membrane receptor proteins known as receptor-like kinases and receptor-like proteins. Evaluating the homology relations among RLK and RLP for seven legume species, and exploring their presence among synteny blocks allow an increased understanding of evolutionary relations, physical position, and chromosomal distribution in related species and their shared roles in stress responses. Results: Typically, a high proportion of RLK and RLP legume proteins belong to orthologous clusters, which is confirmed in this study, where between 66 to 90% of the RLKs and RLPs per legume species were classified in orthologous clusters. One-third of the evaluated syntenic blocks had shared RLK/RLP genes among both legumes and non-legumes. Among the legumes, between 75 and 98% of the RLK/RLP were present in syntenic blocks. The distribution of chromosomal segments between Phaseolus vulgaris and Vigna unguiculata, two species that diverged ~ 8 mya, were highly similar. Among the RLK/RLP synteny clusters, seven experimentally validated resistance RLK/RLP genes were identified in syntenic blocks. The RLK resistant genes FLS2, BIR2, ERECTA, IOS1, and AtSERK1 from Arabidopsis and SLSERK1 from Solanum lycopersicum were present in different pairwise syntenic blocks among the legume species. Meanwhile, only the LYM1- RLP resistant gene from Arabidopsis shared a syntenic blocks with Glycine max. Conclusions: The orthology analysis of the RLK and RLP suggests a dynamic evolution in the legume family, with between 66 to 85% of RLK and 83 to 88% of RLP belonging to orthologous clusters among the species evaluated. In fact, for the 10-species comparison, a lower number of singleton proteins were reported among RLP compared to RLK, suggesting that RLP positions are more physically conserved compared to RLK. The identification of RLK and RLP genes among the synteny blocks in legumes revealed multiple highly conserved syntenic blocks on multiple chromosomes. Additionally, the analysis suggests that P. vulgaris is an appropriate anchor species for comparative genomics among legumes.",
                "authors": [
                    {
                        "name": "McClean P.E."
                    },
                    {
                        "name": "Osorno J.M."
                    },
                    {
                        "name": "Restrepo-Montoya D."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Orthology and synteny analysis of receptor-like kinases “RLK” and receptor-like proteins “RLP” in legumes"
            },
            "pmcid": "PMC7874474",
            "pmid": "33568053"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
