{
    "additionDate": "2023-03-19T08:58:02.524469Z",
    "biotoolsCURIE": "biotools:ecto",
    "biotoolsID": "ecto",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chanl@oregonstate.edu",
            "name": "Lauren E. Chan",
            "typeEntity": "Person"
        }
    ],
    "description": "The Environmental Conditions, Treatments, and Exposures Ontology (ECTO): connecting toxicology and exposure to human health and beyond",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "http://www.obofoundry.org/ontology/ecto.html",
    "language": [
        "Prolog"
    ],
    "lastUpdate": "2023-03-19T08:58:02.529049Z",
    "license": "CC-BY-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/EnvironmentOntology/environmental-exposure-ontology/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/EnvironmentOntology/environmental-exposure-ontology"
        }
    ],
    "name": "ECTO",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S13326-023-00283-X",
            "metadata": {
                "abstract": "Background: Evaluating the impact of environmental exposures on organism health is a key goal of modern biomedicine and is critically important in an age of greater pollution and chemicals in our environment. Environmental health utilizes many different research methods and generates a variety of data types. However, to date, no comprehensive database represents the full spectrum of environmental health data. Due to a lack of interoperability between databases, tools for integrating these resources are needed. In this manuscript we present the Environmental Conditions, Treatments, and Exposures Ontology (ECTO), a species-agnostic ontology focused on exposure events that occur as a result of natural and experimental processes, such as diet, work, or research activities. ECTO is intended for use in harmonizing environmental health data resources to support cross-study integration and inference for mechanism discovery. Methods and findings: ECTO is an ontology designed for describing organismal exposures such as toxicological research, environmental variables, dietary features, and patient-reported data from surveys. ECTO utilizes the base model established within the Exposure Ontology (ExO). ECTO is developed using a combination of manual curation and Dead Simple OWL Design Patterns (DOSDP), and contains over 2700 environmental exposure terms, and incorporates chemical and environmental ontologies. ECTO is an Open Biological and Biomedical Ontology (OBO) Foundry ontology that is designed for interoperability, reuse, and axiomatization with other ontologies. ECTO terms have been utilized in axioms within the Mondo Disease Ontology to represent diseases caused or influenced by environmental factors, as well as for survey encoding for the Personalized Environment and Genes Study (PEGS). Conclusions: We constructed ECTO to meet Open Biological and Biomedical Ontology (OBO) Foundry principles to increase translation opportunities between environmental health and other areas of biology. ECTO has a growing community of contributors consisting of toxicologists, public health epidemiologists, and health care providers to provide the necessary expertise for areas that have been identified previously as gaps.",
                "authors": [
                    {
                        "name": "Chan L.E."
                    },
                    {
                        "name": "Duncan W.D."
                    },
                    {
                        "name": "Grondin C.J."
                    },
                    {
                        "name": "Haendel M.A."
                    },
                    {
                        "name": "Matentzoglu N."
                    },
                    {
                        "name": "McMurry J.A."
                    },
                    {
                        "name": "Mungall C.J."
                    },
                    {
                        "name": "Robinson P.N."
                    },
                    {
                        "name": "Schmitt C."
                    },
                    {
                        "name": "Thessen A.E."
                    },
                    {
                        "name": "Vasilevsky N."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Journal of Biomedical Semantics",
                "title": "The Environmental Conditions, Treatments, and Exposures Ontology (ECTO): connecting toxicology and exposure to human health and beyond"
            },
            "pmcid": "PMC9951428",
            "pmid": "36823605"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
