
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 American Chemical Society.Database searches of MS/MS spectra are the main approach to peptide/protein identification in proteomics. Since most database search engines only utilize a small portion of the original MS/MS signals for peptide detection, how to improve the quality of MS/MS signals is a primary concern for enhancement of the peptide/protein identification rate. A fundamental issue is that some noise MS signals, informative or uninformative, have to be filtered out prior to database searching. Herein, an integrative preprocessing algorithm was designed, termed pClean, which incorporates three modules to preprocess MS/MS spectra, such as the removal of isobaric-labeling related ions, the reduction in isotopic peaks, the deconvolution of ions with higher charges, and the clearance of uninformative MS/MS signals. In contrast to the currently available approaches to MS/MS data preprocessing, pClean enables treatment of MS/MS spectra with high mass accuracy and favors filtering for the labeling or nonlabeling of peptides. Data sets at various scales gained from mass spectrometers with high resolution were used to assess the quality of peptides identified after pClean treatment and to compare the pClean improvement with those of other software programs. On the basis of the analysis of peptides identified and the Mascot ion score, pClean was proven to be effective in the removal of mass spectral noise and the reduction of random matching. Compared with other software programs, pClean appeared to be beneficial in terms of preprocessing performances for the enhancement of confidence scores and the increase in peptides identified. pClean is available at https://github.com/AimeeD90/pClean_release.",
            "authors": [
                "Deng Y.",
                "Ren Z.",
                "Pan Q.",
                "Qi D.",
                "Wen B.",
                "Ren Y.",
                "Yang H.",
                "Wu L.",
                "Chen F.",
                "Liu S."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JPROTEOME.9B00141",
            "journal": "Journal of Proteome Research",
            "pmid": "31364357",
            "title": "PClean: An Algorithm to Preprocess High-Resolution Tandem Mass Spectra for Database Searching",
            "year": "2019-09-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pClean",
        "biotoolsID": "pClean",
        "description": "An Algorithm To Preprocess High-Resolution Tandem Mass Spectra for Database Searching | pClean: a tool for MS/MS spectrum preprocessing | pClean is a powerful tool to preprocess high-resolution tandem mass spectra prior to database searching, and aimed at filtering out extraneous peaks with/without specific-feature, which integrated three modules, removal of label-associated ions, isotope peak reduction and charge deconvolution, and a graph-based network approach. pClean is supportive to a wide array of instruments with all types of MS data, and incorporative into most data analysis pipelines",
        "homepage": "https://github.com/AimeeD90/pClean_release",
        "name": "pClean"
    }
}