{
    "accessibility": "Open access",
    "additionDate": "2022-12-29T18:41:08.330275Z",
    "biotoolsCURIE": "biotools:jlcrb",
    "biotoolsID": "jlcrb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Xiuquan Du"
        },
        {
            "name": "Zhigang Xue"
        }
    ],
    "description": "A unified multi-view-based joint representation learning for CircRNA binding sites prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "http://82.157.188.204/JLCRB/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:15:05.575895Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Xuezg/JLCRB"
        }
    ],
    "name": "JLCRB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.jbi.2022.104231",
            "metadata": {
                "abstract": "CircRNAs usually bind to the corresponding RBPs(RNA Binding proteins) and play a key role in gene regulation. Therefore, it is important to identify the binding sites of RBPs on CircRNAs for the regulation of certain diseases. Due to the information provided by the single view feature is limited, the current mainstream methods are mainly to detect the RBP binding sites by constructing multi-view models. However, with the number of view features increases, the invalid information also increases, and the existing methods only simply concatenate together various features from different views, while ignoring the intrinsic connection between multi-view data. To solve this problem, we propose a new multi-view joint representation learning network by improving the consistency of multi-view feature information. First, the network uses different feature encoding methods to fully extract the feature information of RNA, respectively. Then we construct the intrinsic connection between the views by generating a global joint representation of multiple views, and this is used for feature calibration of each view to highlight important features and suppress unimportant ones. Finally, the depth features obtained from the fusion of multiple views are used to detect the binding sites of RNAs. The average AUC of our method is 93.68% in 37 CircRNA-RBP datasets. The experimental results show that the prediction performance of the method is better than existing methods. The code and datasets are obtained at https://github.com/Xuezg/JLCRB. In addition, we also provide a free web server that is freely available at http://82.157.188.204/JLCRB/.",
                "authors": [
                    {
                        "name": "Du X."
                    },
                    {
                        "name": "Xue Z."
                    }
                ],
                "citationCount": 4,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "JLCRB: A unified multi-view-based joint representation learning for CircRNA binding sites prediction"
            },
            "pmid": "36309196"
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
