{
    "additionDate": "2017-03-27T08:23:41Z",
    "biotoolsCURIE": "biotools:holovir",
    "biotoolsID": "holovir",
    "credit": [
        {
            "email": "contact.cube@univie.ac.at",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cube.univie.ac.at/contact"
        }
    ],
    "description": "A robust and flexible data analysis pipeline that provides an optimised and validated workflow for taxonomic and functional characterisation of viral metagenomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/plaffy/HoloVir/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/plaffy/HoloVir",
    "language": [
        "Shell",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "HoloVir",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "thomas_nussbaumer",
    "publication": [
        {
            "doi": "10.3389/fmicb.2016.00822",
            "metadata": {
                "abstract": "© 2016 Laffy, Wood-Charlson, Turaev, Weynberg, Botté, van Oppen, Webster and Rattei. Abundant bioinformatics resources are available for the study of complex microbial metagenomes, however their utility in viral metagenomics is limited. HoloVir is a robust and flexible data analysis pipeline that provides an optimized and validated workflow for taxonomic and functional characterization of viral metagenomes derived from invertebrate holobionts. Simulated viral metagenomes comprising varying levels of viral diversity and abundance were used to determine the optimal assembly and gene prediction strategy, and multiple sequence assembly methods and gene prediction tools were tested in order to optimize our analysis workflow. HoloVir performs pairwise comparisons of single read and predicted gene datasets against the viral RefSeq database to assign taxonomy and additional comparison to phage-specific and cellular markers is undertaken to support the taxonomic assignments and identify potential cellular contamination. Broad functional classification of the predicted genes is provided by assignment of COG microbial functional category classifications using EggNOG and higher resolution functional analysis is achieved by searching for enrichment of specific Swiss-Prot keywords within the viral metagenome. Application of HoloVir to viral metagenomes from the coral Pocillopora damicornis and the sponge Rhopaloeides odorabile demonstrated that HoloVir provides a valuable tool to characterize holobiont viral communities across species, environments, or experiments.",
                "authors": [
                    {
                        "name": "Laffy P.W."
                    },
                    {
                        "name": "Wood-Charlson E.M."
                    },
                    {
                        "name": "Turaev D."
                    },
                    {
                        "name": "Weynberg K.D."
                    },
                    {
                        "name": "Botte E.S."
                    },
                    {
                        "name": "Van Oppen M.J.H."
                    },
                    {
                        "name": "Webster N.S."
                    },
                    {
                        "name": "Rattei T."
                    }
                ],
                "citationCount": 12,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "HoloVir: A workflow for investigating the diversity and function of viruses in invertebrate holobionts"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}