{
    "accessibility": "Open access",
    "additionDate": "2022-06-20T09:32:52.278195Z",
    "biotoolsCURIE": "biotools:dismed",
    "biotoolsID": "dismed",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "cost": "Free of charge",
    "description": "DiSMed is a de-identification methodology for Spanish medical texts based on Named Entity Recognition (NER). It is based on spaCy and partially based on the networks designed by Gillaume Genthial implemented on Tensorflow 1. DiSMed includes both the Python code and the curated dataset, available under request under a research use agreement.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/BIMCV-CSUSP/DiSMed",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-20T15:24:59.605966Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BIMCV-CSUSP/DiSMed"
        }
    ],
    "name": "DiSMed",
    "owner": "bimcv",
    "publication": [
        {
            "doi": "10.1186/s13326-021-00236-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Medical texts such as radiology reports or electronic health records are a powerful source of data for researchers. Anonymization methods must be developed to de-identify documents containing personal information from both patients and medical staff. Although currently there are several anonymization strategies for the English language, they are also language-dependent. Here, we introduce a named entity recognition strategy for Spanish medical texts, translatable to other languages. Results: We tested 4 neural networks on our radiology reports dataset, achieving a recall of 97.18% of the identifying entities. Alongside, we developed a randomization algorithm to substitute the detected entities with new ones from the same category, making it virtually impossible to differentiate real data from synthetic data. The three best architectures were tested with the MEDDOCAN challenge dataset of electronic health records as an external test, achieving a recall of 69.18%. Conclusions: The strategy proposed, combining named entity recognition tasks with randomization of entities, is suitable for Spanish radiology reports. It does not require a big training corpus, thus it could be easily extended to other languages and medical texts, such as electronic health records.",
                "authors": [
                    {
                        "name": "Lopez-Cerdan A."
                    },
                    {
                        "name": "Perez-Diez I."
                    },
                    {
                        "name": "Perez-Moraga R."
                    },
                    {
                        "name": "Salinas-Serrano J.-M."
                    },
                    {
                        "name": "la Iglesia-Vaya M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Biomedical Semantics",
                "title": "De-identifying Spanish medical texts - named entity recognition applied to radiology reports"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}
