{
    "additionDate": "2021-01-18T07:10:03Z",
    "biotoolsCURIE": "biotools:targettranslator",
    "biotoolsID": "targettranslator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sven.nelander@igp.uu.se",
            "name": "Sven Nelander",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrative discovery of treatments for high-risk neuroblastoma.\n\nYou have reached the TargetTranslator, an interactive tool that enables the creation of gene signatures and exploration of their connections to different compounds.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://targettranslator.org/downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://targettranslator.org",
    "language": [
        "JavaScript",
        "R",
        "PHP"
    ],
    "lastUpdate": "2021-02-26T16:12:20Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Targettranslator/targettranslator"
        }
    ],
    "name": "TargetTranslator",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/BCR2615",
            "metadata": {
                "abstract": "Introduction: Accurate assessment of estrogen receptor (ER), progesterone receptor (PR), and Ki-67 is essential in the histopathologic diagnostics of breast cancer. Commercially available image analysis systems are usually bundled with dedicated analysis hardware and, to our knowledge, no easily installable, free software for immunostained slide scoring has been described. In this study, we describe a free, Internet-based web application for quantitative image analysis of ER, PR, and Ki-67 immunohistochemistry in breast cancer tissue sections.Methods: The application, named ImmunoRatio, calculates the percentage of positively stained nuclear area (labeling index) by using a color deconvolution algorithm for separating the staining components (diaminobenzidine and hematoxylin) and adaptive thresholding for nuclear area segmentation. ImmunoRatio was calibrated using cell counts defined visually as the gold standard (training set, n = 50). Validation was done using a separate set of 50 ER, PR, and Ki-67 stained slides (test set, n = 50). In addition, Ki-67 labeling indexes determined by ImmunoRatio were studied for their prognostic value in a retrospective cohort of 123 breast cancer patients.Results: The labeling indexes by calibrated ImmunoRatio analyses correlated well with those defined visually in the test set (correlation coefficient r = 0.98). Using the median Ki-67 labeling index (20%) as a cutoff, a hazard ratio of 2.2 was obtained in the survival analysis (n = 123, P = 0.01). ImmunoRatio was shown to adapt to various staining protocols, microscope setups, digital camera models, and image acquisition settings. The application can be used directly with web browsers running on modern operating systems (e.g., Microsoft Windows, Linux distributions, and Mac OS). No software downloads or installations are required. ImmunoRatio is open source software, and the web application is publicly accessible on our website.Conclusions: We anticipate that free web applications, such as ImmunoRatio, will make the quantitative image analysis of ER, PR, and Ki-67 easy and straightforward in the diagnostic assessment of breast cancer specimens. © 2010 Tuominen et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Tuominen V.J."
                    },
                    {
                        "name": "Ruotoistenmaki S."
                    },
                    {
                        "name": "Viitanen A."
                    },
                    {
                        "name": "Jumppanen M."
                    },
                    {
                        "name": "Isola J."
                    }
                ],
                "citationCount": 332,
                "date": "2010-07-27T00:00:00Z",
                "journal": "Breast Cancer Research",
                "title": "ImmunoRatio: A publicly available web application for quantitative image analysis of estrogen receptor (ER), progesterone receptor (PR), and Ki-67"
            },
            "pmcid": "PMC6941971",
            "pmid": "31900415"
        }
    ],
    "topic": [
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        }
    ]
}