{
    "name": "fiDPD", 
    "description": "A functional site- and physicochemical interaction-annotated domain profile database, from which a sequence-based method is developed for predicting both PFSs and PLIs. The method is based on the assumption that proteins that share similar structure and sequence tend to have similar functional sites located on the same positions on a protein’s surface.", 
    "homepage": "http://202.119.249.49", 
    "biotoolsID": "fidpd", 
    "biotoolsCURIE": "biotools:fidpd", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2492", 
                    "term": "Protein interaction prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3092", 
                    "term": "Protein feature detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3510", 
            "term": "Protein sequence features"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://202.119.249.49/pubdata/fidpd.pl", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/s12859-018-2206-2", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Sequence-based prediction of physicochemical interactions at protein functional sites using a function-and-interaction-annotated domain profile database", 
                "abstract": "© 2018 The Author(s). Background: Identifying protein functional sites (PFSs) and, particularly, the physicochemical interactions at these sites is critical to understanding protein functions and the biochemical reactions involved. Several knowledge-based methods have been developed for the prediction of PFSs; however, accurate methods for predicting the physicochemical interactions associated with PFSs are still lacking. Results: In this paper, we present a sequence-based method for the prediction of physicochemical interactions at PFSs. The method is based on a functional site and physicochemical interaction-annotated domain profile database, called fiDPD, which was built using protein domains found in the Protein Data Bank. This method was applied to 13 target proteins from the very recent Critical Assessment of Structure Prediction (CASP10/11), and our calculations gave a Matthews correlation coefficient (MCC) value of 0.66 for PFS prediction and an 80% recall in the prediction of the associated physicochemical interactions. Conclusions: Our results show that, in addition to the PFSs, the physical interactions at these sites are also conserved in the evolution of proteins. This work provides a valuable sequence-based tool for rational drug design and side-effect assessment. The method is freely available and can be accessed at http://202.119.249.49.", 
                "date": "2018-06-01T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Han M."
                    }, 
                    {
                        "name": "Song Y."
                    }, 
                    {
                        "name": "Qian J."
                    }, 
                    {
                        "name": "Ming D."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Dengming Ming", 
            "email": "dming@njtech.edu.cn", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "shadi.m", 
    "additionDate": "2018-07-31T12:11:55Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}