{
    "name": "MTMDAT-HADDOCK", 
    "description": "Facilitates fast and detailed evaluation of mass spectrometry data of limited proteolysis experiments to probe the tertiary structure of proteins and even complex formation with other proteins, ligands, and surfaces.", 
    "homepage": "http://www.ifm.liu.se/chemistry/molbiotech/maria_sunnerhagens_group/mtmdat/", 
    "biotoolsID": "mtmdat-haddock", 
    "biotoolsCURIE": "biotools:mtmdat-haddock", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3214", 
                    "term": "Spectral analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3694", 
                    "term": "Mass spectrum visualisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_3520", 
            "term": "Proteomics experiment"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mtmdat-haddock-high-throughput-data-driven-protein-complex-structure-modelling.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.ifm.liu.se/chemistry/molbiotech/maria_sunnerhagens_group/mtmdat/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "23153250", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MTMDAT-HADDOCK: High-Throughput, protein complex structure modeling based on limited proteolysis and mass spectrometry", 
                "abstract": "© 2012 Hennig et al.; licensee BioMed Central Ltd. Background: MTMDAT is a program designed to facilitate analysis of mass spectrometry data of proteins and biomolecular complexes that are probed structurally by limited proteolysis. This approach can provide information about stable fragments of multidomain proteins, yield tertiary and quaternary structure data, and help determine the origin of stability changes at the amino acid residue level. Here, we introduce a pipeline between MTMDAT and HADDOCK, that facilitates protein-protein complex structure probing in a high-Throughput and highly automated fashion. Results: A new feature of MTMDAT allows for the direct identification of residues that are involved in complex formation by comparing the mass spectra of bound and unbound proteins after proteolysis. If 3D structures of the unbound components are available, this data can be used to define restraints for data-driven docking to calculate a model of the complex. We describe here a new implementation of MTMDAT, which includes a pipeline to the data-driven docking program HADDOCK, thus streamlining the entire procedure. This addition, together with usability improvements in MTMDAT, enables high-Throughput modeling of protein complexes from mass spectrometry data. The algorithm has been validated by using the protein-protein interaction between the ubiquitin-binding domain of proteasome component Rpn13 and ubiquitin. The resulting structural model, based on restraints extracted by MTMDAT from limited proteolysis and modeled by HADDOCK, was compared to the published NMR structure, which relied on twelve unambiguous intermolecular NOE interactions. The MTMDAT-HADDOCK structure was of similar quality to structures generated using only chemical shift perturbation data derived by NMR titration experiments. Conclusions: The new MTMDAT-HADDOCK pipeline enables direct high-Throughput modeling of protein complexes from mass spectrometry data. MTMDAT-HADDOCK can be downloaded from http://www.ifm.liu.se/ chemistry/molbiotech/maria sunnerhagens group/mtmdat/ together with the manual and example files. The program is free for academic/non-commercial purposes.", 
                "date": "2012-11-15T00:00:00Z", 
                "citationCount": 7, 
                "authors": [
                    {
                        "name": "Hennig J."
                    }, 
                    {
                        "name": "De Vries S.J."
                    }, 
                    {
                        "name": "Hennig K.D.M."
                    }, 
                    {
                        "name": "Randles L."
                    }, 
                    {
                        "name": "Walters K.J."
                    }, 
                    {
                        "name": "Sunnerhagen M."
                    }, 
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ], 
                "journal": "BMC Structural Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Janosch Hennig", 
            "email": "janhe@ifm.liu.se", 
            "url": "http://www.ifm.liu.se/chemistry/molbiotech/maria_sunnerhagens_group/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:49:28Z", 
    "lastUpdate": "2019-03-26T08:27:14Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}