
{
    "credit": [
        {
            "email": "peypoch@cs.upc.edu",
            "name": "Xavier Messeguer Peypoch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://alggen.lsi.upc.es/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "EST assembly",
                    "uri": "http://edamontology.org/operation_0526"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Mobile genetic elements",
                "uri": "http://edamontology.org/topic_0798"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We have developed a program to determine the number, length and position of exact consecutive repeats of short sequences in DNA fragments or whole genomes. The program also gives the statistical significance of results by comparing them with those expected for a random sequence generated according to a Markovian model.",
            "authors": [
                "Roset R.",
                "Subirana J.A.",
                "Messeguer X."
            ],
            "cit_count": 11,
            "journal": "Bioinformatics",
            "pmid": "14668235",
            "title": "MREPATT: Detection and analysis of exact consecutive repeats in genomic sequences",
            "year": "2003-12-12"
        },
        {
            "abstract": "In this paper we present several web-based tools to identify conserved patterns in sequences. In particular we present details on the functionality of PROMO version 2.0, a program for the prediction of transcription factor binding site in a single sequence or in a group of related sequences and, of MALGEN, a tool to visualize sequence correspondences among long DNA sequences. The web tools and associated documentation can be accessed at http://www.lsi.upc.es/~alggen (RESEARCH link).",
            "authors": [
                "Farre D.",
                "Roset R.",
                "Huerta M.",
                "Adsuara J.E.",
                "Rosello L.",
                "Alba M.M.",
                "Messeguer X."
            ],
            "cit_count": 411,
            "journal": "Nucleic Acids Research",
            "pmid": "12824386",
            "title": "Identification of patterns in biological sequences at the ALGGEN server: PROMO and MALGEN",
            "year": "2003-07-01"
        },
        {
            "abstract": "Summary: We have developed a set of tools to construct positional weight matrices from known transcription factor binding sites in a species or taxon-specific manner, and to search for matches in DNA sequences.",
            "authors": [
                "Messeguer X.",
                "Escudero R.",
                "Farre D.",
                "Nunez O.",
                "Martinez J.",
                "Alba M.M."
            ],
            "cit_count": 527,
            "journal": "Bioinformatics",
            "pmid": "11847087",
            "title": "PROMO: Detection of known transcription regulatory elements using species-tailored searches",
            "year": "2002-01-01"
        },
        {
            "abstract": "Information about the genomic coordinates and the sequence of experimentally identified transcription factor binding sites is found scattered under a variety of diverse formats. The availability of standard collections of such high-quality data is important to design, evaluate and improve novel computational approaches to identify binding motifs on promoter sequences from related genes. ABS (http://genome.imim.es/datasets/abs2005/index.html) is a public database of known binding sites identified in promoters of orthologous vertebrate genes that have been manually curated from bibliography. We have annotated 650 experimental binding sites from 68 transcription factors and 100 orthologous target genes in human, mouse, rat or chicken genome sequences. Computational predictions and promoter alignment information are also provided for each entry. A simple and easy-to-use web interface facilitates data retrieval allowing different views of the information. In addition, the release 1.0 of ABS includes a customizable generator of artificial datasets based on the known sites contained in the collection and an evaluation tool to aid during the training and the assessment of motif-finding programs.",
            "authors": [
                "Blanco E.",
                "Farre D.",
                "Alba M.M.",
                "Messeguer X.",
                "Guigo R."
            ],
            "cit_count": 49,
            "journal": "Nucleic acids research",
            "pmid": "16381947",
            "title": "ABS: a database of Annotated regulatory Binding Sites from orthologous promoters.",
            "year": "2006-01-01"
        },
        {
            "abstract": "A program has been developed to determine the diffraction pattern given by partially ordered fibres formed by macromolecules with helical symmetry. It is particularly useful for visualizing the splitting of layer lines typical of coiled coils. The program produces as output the diffraction diagram calculated for helices that are oriented along their axis but are randomly oriented in other directions. The results can be numerically analyzed and also visualized on-screen. The program has been applied to the diffraction patterns given by DNA and protein coiled coils. © 2005 International Union of Crystallography - all rights reserved.",
            "authors": [
                "Dominguez-Sal D.",
                "Messeguer X.",
                "Subirana J.A."
            ],
            "cit_count": 2,
            "journal": "Acta Crystallographica Section D: Biological Crystallography",
            "pmid": "15681873",
            "title": "FibreHelix, a program for calculating the X-ray diffraction pattern of macromolecules with helical symmetry: Application to DNA coiled coils",
            "year": "2005-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:alggen",
        "biotoolsID": "alggen",
        "description": "Provides various tools for multiple sequence alignments, clustering, and assembly of ESTs.  It also includes search tools for transcription factor binding sites (TFBS), repeated patterns, and transposons.",
        "homepage": "http://alggen.lsi.upc.es/",
        "name": "ALGGEN"
    }
}