{
    "additionDate": "2017-08-20T16:20:44Z",
    "biotoolsCURIE": "biotools:methylhmm",
    "biotoolsID": "methylhmm",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "audreyqyfu@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "These models estimate several properties, such as the level of processivity and preference for hemimethylated CpG dyads over unmethylated ones, of DNA methyltransferases from double-stranded binary methylation data. The inference is done by Markov chain Monte Carlo methods under a Bayesian framework.",
    "documentation": [
        {
            "type": "General",
            "url": "http://stephenslab.uchicago.edu/assets/software/methylhmm/MethylHMM_v6_2.zip"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "http://stephenslab.uchicago.edu/software.html#eqtlbma",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2019-09-04T08:38:17Z",
    "license": "GPL-3.0",
    "name": "MethylHMM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0032225",
            "metadata": {
                "abstract": "DNA methyltransferases establish methylation patterns in cells and transmit these patterns over cell generations, thereby influencing each cell's epigenetic states. Three primary DNA methyltransferases have been identified in mammals: DNMT1, DNMT3A and DNMT3B. Extensive in vitro studies have investigated key properties of these enzymes, namely their substrate specificity and processivity. Here we study these properties in vivo, by applying novel statistical analysis methods to double-stranded DNA methylation patterns collected using hairpin-bisulfite PCR. Our analysis fits a novel Hidden Markov Model (HMM) to the observed data, allowing for potential bisulfite conversion errors, and yields statistical estimates of parameters that quantify enzyme processivity and substrate specificity. We apply this model to methylation patterns established in vivo at three loci in humans: two densely methylated inactive X (Xi)-linked loci (FMR1 and G6PD), and an autosomal locus (LEP), where methylation densities are tissue-specific but moderate. We find strong evidence for a high level of processivity of DNMT1 at FMR1 and G6PD, with the mean association tract length being a few hundred base pairs. Regardless of tissue types, methylation patterns at LEP are dominated by DNMT1 maintenance events, similar to the two Xi-linked loci, but are insufficiently informative regarding processivity to draw any conclusions about processivity at that locus. At all three loci we find that DNMT1 shows a strong preference for adding methyl groups to hemi-methylated CpG sites over unmethylated sites. The data at all three loci also suggest low (possibly 0) association of the de novo methyltransferases, the DNMT3s, and are consequently uninformative about processivity or preference of these enzymes. We also extend our HMM to reanalyze published data on mouse DNMT1 activities in vitro. The results suggest shorter association tracts (and hence weaker processivity), and much longer non-association tracts than human DNMT1 in vivo. © 2012 Fu et al.",
                "authors": [
                    {
                        "name": "Fu A.Q."
                    },
                    {
                        "name": "Genereux D.P."
                    },
                    {
                        "name": "Stoger R."
                    },
                    {
                        "name": "Burden A.F."
                    },
                    {
                        "name": "Laird C.D."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 4,
                "date": "2012-03-19T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Statistical inference of in vivo properties of human DNA methyltransferases from double-stranded methylation patterns"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}