{
    "accessibility": [],
    "additionDate": "2017-08-03T18:53:04Z",
    "biotoolsCURIE": "biotools:optpdt",
    "biotoolsID": "optpdt",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "rchung@nhri.org.tw",
            "gridid": null,
            "name": "Ren-Hua Chung",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://rclab.nhri.org.tw/rclab/"
        }
    ],
    "description": "Optimal P-value Threshold Pedigree Disequilibrium Test is a family-based multi-SNP association test. A variable p-value threshold algorithm is used in the test to select an optimal subset of SNPs that has the strongest association signals.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://sourceforge.net/projects/optpdt/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://sourceforge.net/projects/optpdt/",
    "homepage_status": 0,
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/optpdt-family-based-multi-snp-association-test.html"
        }
    ],
    "maturity": null,
    "name": "OPTPDT",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "© 2015 Wang et al. Background: Genome-wide association studies (GWAS) have become a common approach to identifying single nucleotide polymorphisms (SNPs) associated with complex diseases. As complex diseases are caused by the joint effects of multiple genes, while the effect of individual gene or SNP is modest, a method considering the joint effects of multiple SNPs can be more powerful than testing individual SNPs. The multi-SNP analysis aims to test association based on a SNP set, usually defined based on biological knowledge such as gene or pathway, which may contain only a portion of SNPs with effects on the disease. Therefore, a challenge for the multi-SNP analysis is how to effectively select a subset of SNPs with promising association signals from the SNP set. Results: We developed the Optimal P-value Threshold Pedigree Disequilibrium Test (OPTPDT). The OPTPDT uses general nuclear families. A variable p-value threshold algorithm is used to determine an optimal p-value threshold for selecting a subset of SNPs. A permutation procedure is used to assess the significance of the test. We used simulations to verify that the OPTPDT has correct type I error rates. Our power studies showed that the OPTPDT can be more powerful than the set-based test in PLINK, the multi-SNP FBAT test, and the p-value based test GATES. We applied the OPTPDT to a family-based autism GWAS dataset for gene-based association analysis and identified MACROD2-AS1 with genome-wide significance (p-value= 2.5 × 10- 6). Conclusions: Our simulation results suggested that the OPTPDT is a valid and powerful test. The OPTPDT will be helpful for gene-based or pathway association analysis. The method is ideal for the secondary analysis of existing GWAS datasets, which may identify a set of SNPs with joint effects on the disease.",
                "authors": [
                    {
                        "name": "Wang Y.-T."
                    },
                    {
                        "name": "Sung P.-Y."
                    },
                    {
                        "name": "Lin P.-L."
                    },
                    {
                        "name": "Yu Y.-W."
                    },
                    {
                        "name": "Chung R.-H."
                    }
                ],
                "citationCount": 5,
                "date": "2015-05-15T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A multi-SNP association test for complex diseases incorporating an optimal P-value threshold algorithm in nuclear families"
            },
            "note": null,
            "pmcid": null,
            "pmid": "25975968",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1,
    "version": []
}