{"collectionID": [], "accessibility": [], "topic": [{"term": "Genomics", "uri": "http://edamontology.org/topic_0622"}, {"term": "Transcriptomics", "uri": "http://edamontology.org/topic_3308"}], "owner": "seqwiki_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1007/978-3-642-04241-6_21", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Mpscan: Fast localisation of multiple reads in genomes", "abstract": "With Next Generation Sequencers, sequence based transcriptomic or epigenomic assays yield millions of short sequence reads that need to be mapped back on a reference genome. The upcoming versions of these sequencers promise even higher sequencing capacities; this may turn the read mapping task into a bottleneck for which alternative pattern matching approaches must be experimented. We present an algorithm and its implementation, called mpscan, which uses a sophisticated filtration scheme to match a set of patterns/reads exactly on a sequence. mpscan can search for millions of reads in a single pass through the genome without indexing its sequence. Moreover, we show that mpscan offers an optimal average time complexity, which is sublinear in the text length, meaning that it does not need to examine all sequence positions. Comparisons with BLAT-like tools and with six specialised read mapping programs (like bowtie or zoom) demonstrate that mpscan also is the fastest algorithm in practice for exact matching. Our accuracy and scalability comparisons reveal that some tools are inappropriate for read mapping. Moreover, we provide evidence suggesting that exact matching may be a valuable solution in some read mapping applications. As most read mapping programs somehow rely on exact matching procedures to perform approximate pattern mapping, the filtration scheme we experimented may reveal useful in the design of future algorithms. The absence of genome index gives mpscan its low memory requirement and flexibility that let it run on a desktop computer and avoids a time-consuming genome preprocessing. © 2009 Springer Berlin Heidelberg.", "citationCount": 16, "authors": [{"name": "Rivals E."}, {"name": "Salmela L."}, {"name": "Kiiskinen P."}, {"name": "Kalsi P."}, {"name": "Tarhio J."}], "date": "2009-11-02T00:00:00Z", "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Vincent Lefort", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "Vincent.Lefort@lirmm.fr"}], "biotoolsCURIE": "biotools:mpscan", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.atgc-montpellier.fr/mpscan/", "function": [{"note": null, "input": [], "operation": [{"term": "Read mapping", "uri": "http://edamontology.org/operation_3198"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:54Z", "otherID": [], "description": "MPscan (multi-pattern scan) is a program for mapping short reads (<30bp) exactly on a set of reference sequences (eg, a genome) without indexing the reference. MPscan performs only exact mapping (no substitution, nor indels), is fast (optimal complexity), and easy to use.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["C++"], "link": [], "biotoolsID": "mpscan", "additionDate": "2017-01-13T13:15:31Z", "name": "MPscan", "license": null, "documentation": [{"url": "http://www.atgc-montpellier.fr/download/papers/mpscan_manual_2008.pdf", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Mac"]}