{
    "accessibility": "Open access",
    "additionDate": "2022-12-21T21:56:09.234604Z",
    "biotoolsCURIE": "biotools:redda",
    "biotoolsID": "redda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Rui Jiang"
        },
        {
            "name": "Si Zheng"
        },
        {
            "name": "Jiao Li",
            "orcidid": "https://orcid.org/0000-0001-6391-8343"
        },
        {
            "name": "Qijin Yin",
            "orcidid": "https://orcid.org/0000-0001-5284-2259"
        },
        {
            "name": "Yaowen Gu",
            "orcidid": "https://orcid.org/0000-0003-0924-5939"
        }
    ],
    "description": "Integrating multiple biological relations to heterogeneous graph neural network for drug-disease association prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gu-yaowen/REDDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:17:04.631635Z",
    "license": "Not licensed",
    "name": "REDDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.106127",
            "metadata": {
                "abstract": "Computational drug repositioning is an effective way to find new indications for existing drugs, thus can accelerate drug development and reduce experimental costs. Recently, various deep learning-based repurposing methods have been established to identify the potential drug-disease associations (DDA). However, effective utilization of the relations of biological entities to capture the biological interactions to enhance the drug-disease association prediction is still challenging. To resolve the above problem, we proposed a heterogeneous graph neural network called REDDA (Relations-Enhanced Drug-Disease Association prediction). Assembled with three attention mechanisms, REDDA can sequentially learn drug/disease representations by a general heterogeneous graph convolutional network-based node embedding block, a topological subnet embedding block, a graph attention block, and a layer attention block. Performance comparisons on our proposed benchmark dataset show that REDDA outperforms 8 advanced drug-disease association prediction methods, achieving relative improvements of 0.76% on the area under the receiver operating characteristic curve (AUC) score and 13.92% on the precision-recall curve (AUPR) score compared to the suboptimal method. On the other benchmark dataset, REDDA also obtains relative improvements of 2.48% on the AUC score and 4.93% on the AUPR score. Specifically, case studies also indicate that REDDA can give valid predictions for the discovery of -new indications for drugs and new therapies for diseases. The overall results provide an inspiring potential for REDDA in the in silico drug development. The proposed benchmark dataset and source code are available in https://github.com/gu-yaowen/REDDA.",
                "authors": [
                    {
                        "name": "Gu Y."
                    },
                    {
                        "name": "Jiang R."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Yin Q."
                    },
                    {
                        "name": "Zheng S."
                    }
                ],
                "citationCount": 33,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "REDDA: Integrating multiple biological relations to heterogeneous graph neural network for drug-disease association prediction"
            },
            "pmid": "36182762"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
