{
    "additionDate": "2024-06-19T07:38:46.397854Z",
    "biotoolsCURIE": "biotools:aagingbase",
    "biotoolsID": "aagingbase",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rahulk@bt.iith.ac.in",
            "name": "Rahul Kumar",
            "orcidid": "https://orcid.org/0000-0002-6927-5390",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive database of anti-aging peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://project.iith.ac.in/cgntlab/aagingbase/",
    "lastUpdate": "2024-06-19T07:38:46.399846Z",
    "name": "AagingBase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/baae016",
            "metadata": {
                "abstract": "The process of aging is an intrinsic and inevitable aspect of life that impacts every living organism. As biotechnological advancements continue to shape our understanding of medicine, peptide therapeutics have emerged as a promising strategy for anti-aging interventions. This is primarily due to their favorable attributes, such as low immunogenicity and cost-effective production. Peptide-based treatments have garnered widespread acceptance and interest in aging research, particularly in the context of age-related therapies. To effectively develop anti-aging treatments, a comprehensive understanding of the physicochemical characteristics of anti-aging peptides is essential. Factors such as amino acid composition, instability index, hydrophobic areas and other relevant properties significantly determine their efficacy as potential therapeutic agents. Consequently, the creation of 'AagingBase', a comprehensive database for anti-aging peptides, aims to facilitate research on aging by leveraging the potential of peptide therapies. AagingBase houses experimentally validated 282 anti-aging peptides collected from 54 research articles and 236 patents. Employing state-of-the-art computational techniques, the acquired sequences have undergone rigorous physicochemical calculations. Furthermore, AagingBase presents users with various informative analyses highlighting atomic compositions, secondary structure fractions, tertiary structure, amino acid compositions and frequencies. The database also offers advanced search and filtering options and similarity search, thereby aiding researchers in understanding their biological functions. Hence, the database enables efficient identification and prioritization of potential peptide candidates in geriatric medicine and holds immense potential for advancing geriatric medicine research and innovations. AagingBase can be accessed without any restriction. Database URL: https://project.iith.ac.in/cgntlab/aagingbase/.",
                "authors": [
                    {
                        "name": "Alfatah M."
                    },
                    {
                        "name": "Krishna P.S."
                    },
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Kundal K."
                    },
                    {
                        "name": "Pawar A."
                    },
                    {
                        "name": "R K."
                    },
                    {
                        "name": "Ray S."
                    },
                    {
                        "name": "Sengupta A."
                    },
                    {
                        "name": "Sharma S."
                    },
                    {
                        "name": "Tiwari B."
                    },
                    {
                        "name": "Vinod Kumar K."
                    }
                ],
                "date": "2024-03-12T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "AagingBase: a comprehensive database of anti-aging peptides"
            },
            "pmcid": "PMC10930205",
            "pmid": "38470883"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
