{
    "accessibility": "Open access",
    "additionDate": "2022-08-16T15:25:12.711459Z",
    "biotoolsCURIE": "biotools:textformats",
    "biotoolsID": "textformats",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "giorgio.gonnella@uni-goettingen.de",
            "name": "Giorgio Gonnella",
            "orcidid": "https://orcid.org/0000-0003-3900-5397",
            "typeEntity": "Person"
        }
    ],
    "description": "Simplifying the definition and parsing of text formats in bioinformatics.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/ggonnella/textformats/tree/main/manuals"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ggonnella/textformats",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2022-08-16T15:25:12.714279Z",
    "license": "Not licensed",
    "name": "TextFormats",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0268910",
            "metadata": {
                "abstract": "Copyright: © 2022 Giorgio Gonnella. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Text formats are common in bioinformatics, as they allow for editing and filtering using standard tools, as well as, since text formats are often human readable, manual inspection and evaluation of the data. Bioinformatics is a rapidly evolving field, hence, new techniques, new software tools, new kinds of data often require the definition of new formats. Often new formats are not formally described in a standard or specification document. Although software libraries are available for accessing the most common formats, writing parsers for text formats, for which no library is currently available, is a very common though tedious task, utilized by many researchers in the field. This manuscript presents the open source software library and toolset TextFormats (available at https://github.com/ggonnella/textformats), which aims at simplifying the definition and parsing of text formats. Formats specifications are written in a simple data description format using an interactive wizard. Automatic generation of data examples and automatic testing of specifications allow for checking for correctness. Given the specification for a text format, TextFormats allows parsing and writing data in that format, using several programming languages (Nim, Python, C/C++) or the provided command line and graphical user interface tools. Although designed as a general purpose software, the main target application field, for the above mentioned reasons, is expected to be in bioinformatics: Thus, the specifications of several common existing bioinformatics formats are included.",
                "authors": [
                    {
                        "name": "Gonnella G."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TextFormats: Simplifying the definition and parsing of text formats in bioinformatics"
            },
            "pmcid": "PMC9135226",
            "pmid": "35617194"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}
