
{
    "credit": [
        {
            "email": "cgsmd-help@isi.edu",
            "name": "dbSNP-Q Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "PHP",
            "SQL",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Genome-wide association studies often incorporate information from public biological databases in order to provide a biological reference for interpreting the results. The dbSNP database is an extensive source of information on single nucleotide polymorphisms (SNPs) for many different organisms, including humans. We have developed free software that will download and install a local MySQL implementation of the dbSNP relational database for a specified organism. We have also designed a system for classifying dbSNP tables in terms of common tasks we wish to accomplish using the database. For each task we have designed a small set of custom tables that facilitate task-related queries and provide entity-relationship diagrams for each task composed from the relevant dbSNP tables. In order to expose these concepts and methods to a wider audience we have developed web tools for querying the database and browsing documentation on the tables and columns to clarify the relevant relational structure. All web tools and software are freely available to the public at http://cgsmd.isi.edu/ dbsnpq. Resources such as these for programmatically querying biological databases are essential for viably integrating biological information into genetic association experiments on a genome-wide scale. © The Author(s) 2010.",
            "authors": [
                "Saccone S.F.",
                "Quan J.",
                "Mehta G.",
                "Bolze R.",
                "Thomas P.",
                "Deelman E.",
                "Tischfield J.A.",
                "Rice J.P."
            ],
            "cit_count": 18,
            "journal": "Nucleic Acids Research",
            "pmid": "21037260",
            "title": "New tools and methods for direct programmatic access to the dbSNP relational database",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dbsnp-q",
        "biotoolsID": "dbsnp-q",
        "description": "dbSNP-Q is a web application for working with the dbSNP relational database. dbSNP is a source of information on single nucleotide polymorphisms (SNPs) and other genetic variation for many different organisms, including humans. dbSNP-Q can be used to query human data from dbSNP for a variety tasks such as genomic mapping, SNP/gene functional properties, allele frequency data and information on the underlying experiments. It also includes documentation and download tools.",
        "homepage": "http://cgsmd.isi.edu/dbsnpq",
        "name": "dbSNP-Q"
    }
}