{"credit":[{"email":"sylvia.richardson@imperial.ac.uk","name":"Sylvia Richardson","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www1.imperial.ac.uk/medicine/people/ernest.turro/"}],"documentation":[{"type":"GENERAL","url":"http://bgx.org.uk/software/mmbgx.html"}],"function":[{"operation":[{"term":"Expression data visualisation","uri":"http://edamontology.org/operation_0571"}]}],"labels":{"language":["R","C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mmbgx-0-99-20-multi-mapping-bayesian-gene-expression-affymetrix-whole-transcript-arrays.html"}],"publication":[{"abstract":"Affymetrix has recently developed whole-transcript GeneChips-'Gene' and 'Exon' arrays-which interrogate exons along the length of each gene. Although each probe on these arrays is intended to hybridize perfectly to only one transcriptional target, many probes match multiple transcripts located in different parts of the genome or alternative isoforms of the same gene. Existing statistical methods for estimating expression do not take this into account and are thus prone to producing inflated estimates. We propose a method, Multi-Mapping Bayesian Gene eXpression (MMBGX), which disaggregates the signal at 'multi-match' probes. When applied to Gene arrays, MMBGX removes the upward bias of gene-level expression estimates. When applied to Exon arrays, it can further disaggregate the signal between alternative transcripts of the same gene, providing expression estimates of individual splice variants. We demonstrate the performance of MMBGX on simulated data and a tissue mixture data set. We then show that MMBGX can estimate the expression of alternative isoforms within one experimental condition, confirming our results by RT-PCR. Finally, we show that our method for detecting differential splicing has a lower error rate than standard exonlevel approaches on a previously validated colon cancer data set. © The Author(s) 2009. Published by Oxford University Press.","authors":["Turro E.","Lewin A.","Rose A.","Dallman M.J.","Richardson S."],"cit_count":10,"journal":"Nucleic Acids Research","pmid":"19854940","title":"MMBGX: A method for estimating expression at the isoform level and detecting differential splicing using whole-transcript Affymetrix arrays","year":"2009-10-23"}],"summary":{"biotoolsCURIE":"biotools:mmbgx","biotoolsID":"mmbgx","description":"Method for estimating expression at the isoform level and detecting differential splicing using whole-transcript Affymetrix arrays.","homepage":"http://bgx.org.uk/software/mmbgx.html","name":"MMBGX"}}