{
    "additionDate": "2018-06-14T14:29:49Z",
    "biotoolsCURIE": "biotools:fractalsim",
    "biotoolsID": "fractalsim",
    "credit": [
        {
            "email": "emile.chimusa@uct.ac.za",
            "name": "Emile Chimusa",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multi-scenario genome-wide medical population genetics simulation framework.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://web.cbio.uct.ac.za/~emile/software.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "FractalSIM",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx369",
            "metadata": {
                "abstract": "Motivation Recent technological advances in high-throughput sequencing and genotyping have facilitated an improved understanding of genomic structure and disease-associated genetic factors. In this context, simulation models can play a critical role in revealing various evolutionary and demographic effects on genomic variation, enabling researchers to assess existing and design novel analytical approaches. Although various simulation frameworks have been suggested, they do not account for natural selection in admixture processes. Most are tailored to a single chromosome or a genomic region, very few capture large-scale genomic data, and most are not accessible for genomic communities. Results Here we develop a multi-scenario genome-wide medical population genetics simulation framework called â € FractalSIM'. FractalSIM has the capability to accurately mimic and generate genome-wide data under various genetic models on genetic diversity, genomic variation affecting diseases and DNA sequence patterns of admixed and/or homogeneous populations. Moreover, the framework accounts for natural selection in both homogeneous and admixture processes. The outputs of FractalSIM have been assessed using popular tools, and the results demonstrated its capability to accurately mimic real scenarios. They can be used to evaluate the performance of a range of genomic tools from ancestry inference to genome-wide association studies.",
                "authors": [
                    {
                        "name": "Chimusa E.R."
                    },
                    {
                        "name": "Defo J."
                    },
                    {
                        "name": "Elsheikh S.S.M."
                    },
                    {
                        "name": "Geza E."
                    },
                    {
                        "name": "Mazandu G.K."
                    },
                    {
                        "name": "Mugo J.W."
                    },
                    {
                        "name": "Mulder N.J."
                    }
                ],
                "citationCount": 2,
                "date": "2017-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A multi-scenario genome-wide medical population genetics simulation framework"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}
