{
    "additionDate": "2020-01-14T09:14:14Z",
    "biotoolsCURIE": "biotools:tRFexplorer",
    "biotoolsID": "tRFexplorer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "apulvirenti@dmi.unict.it",
            "name": "Alfredo Pulvirenti",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of tRNA-derived ncRNAs in TCGA and NCI-60 panel cell lines and development of the public database tRFexplorer.\n\ntRFexplorer is a public database through which users may display the expression profile of tRNA-derived ncRNAs in every cell line of NCI-60. The system allows to perform correlation analyses of tRNA-derived ncRNAs expression with all omics data and compound activities available on CellMiner. This provides an important opportunity to investigate their potential biological roles in absence of direct experimental evidences",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://trfexplorer.cloud/",
    "lastUpdate": "2020-12-31T10:54:06Z",
    "name": "tRFexplorer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ115",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Next-generation sequencing is increasing our understanding and knowledge of non-coding RNAs (ncRNAs), elucidating their roles in molecular mechanisms and processes such as cell growth and development. Within such a class, tRNA-derived ncRNAs have been recently associated with gene expression regulation in cancer progression. In this paper, we characterize, for the first time, tRNA-derived ncRNAs in NCI-60. Furthermore, we assess their expression profile in The Cancer Genome Atlas (TCGA). Our comprehensive analysis allowed us to report 322 distinct tRNA-derived ncRNAs in NCI-60, categorized in tRNA-derived fragments (11 tRF-5s, 55 tRF-3s), tRNA-derived small RNAs (107 tsRNAs) and tRNA 5' leader RNAs (149 sequences identified). In TCGA, we were able to identify 232 distinct tRNA-derived ncRNAs categorized in 53 tRF-5s, 58 tRF-3s, 63 tsRNAs and 58 5' leader RNAs. This latter group represents an additional evidence of tRNA-derived ncRNAs originating from the 5' leader region of precursor tRNA. We developed a public database, tRFexplorer, which provides users with the expression profile of each tRNA-derived ncRNAs in every cell line in NCI-60 as well as for each TCGA tumor type. Moreover, the system allows us to perform differential expression analyses of such fragments in TCGA, as well as correlation analyses of tRNA-derived ncRNAs expression in TCGA and NCI-60 with gene and miRNA expression in TCGA samples, in association with all omics and compound activities data available on CellMiner. Hence, the tool provides an important opportunity to investigate their potential biological roles in absence of any direct experimental evidence. Database URL: https://trfexplorer.cloud/.",
                "authors": [
                    {
                        "name": "La Ferlita A."
                    },
                    {
                        "name": "Alaimo S."
                    },
                    {
                        "name": "Veneziano D."
                    },
                    {
                        "name": "Nigita G."
                    },
                    {
                        "name": "Balatti V."
                    },
                    {
                        "name": "Croce C.M."
                    },
                    {
                        "name": "Ferro A."
                    },
                    {
                        "name": "Pulvirenti A."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "Identification of tRNA-derived ncRNAs in TCGA and NCI-60 panel cell lines and development of the public database tRFexplorer"
            },
            "pmcid": "PMC6859256",
            "pmid": "31735953"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}