{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T08:29:43Z",
    "biotoolsCURIE": "biotools:mi-maap",
    "biotoolsID": "mi-maap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tesfaye.mersha@cchmc.org",
            "name": "Tesfaye B. Mersha",
            "orcidid": "https://orcid.org/0000-0002-9189-8447",
            "typeEntity": "Person"
        }
    ],
    "description": "marker informativeness for multi-ancestry admixed populations.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://research.cchmc.org/mershalab/MI-MAAP/manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://research.cchmc.org/mershalab/MI-MAAP/login/",
    "lastUpdate": "2021-02-22T08:58:14Z",
    "name": "MI-MAAP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3462-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Admixed populations arise when two or more previously isolated populations interbreed. A powerful approach to addressing the genetic complexity in admixed populations is to infer ancestry. Ancestry inference including the proportion of an individual's genome coming from each population and its ancestral origin along the chromosome of an admixed population requires the use of ancestry informative markers (AIMs) from reference ancestral populations. AIMs exhibit substantial differences in allele frequency between ancestral populations. Given the huge amount of human genetic variation data available from diverse populations, a computationally feasible and cost-effective approach is becoming increasingly important to extract or filter AIMs with the maximum information content for ancestry inference, admixture mapping, forensic applications, and detecting genomic regions that have been under recent selection. Results: To address this gap, we present MI-MAAP, an easy-to-use web-based bioinformatics tool designed to prioritize informative markers for multi-ancestry admixed populations by utilizing feature selection methods and multiple genomics resources including 1000 Genomes Project and Human Genome Diversity Project. Specifically, this tool implements a novel allele frequency-based feature selection algorithm, Lancaster Estimator of Independence (LEI), as well as other genotype-based methods such as Principal Component Analysis (PCA), Support Vector Machine (SVM), and Random Forest (RF). We demonstrated that MI-MAAP is a useful tool in prioritizing informative markers and accurately classifying ancestral populations. LEI is an efficient feature selection strategy to retrieve ancestry informative variants with different allele frequency/selection pressure among (or between) ancestries without requiring computationally expensive individual-level genotype data. Conclusions: MI-MAAP has a user-friendly interface which provides researchers an easy and fast way to filter and identify AIMs. MI-MAAP can be accessed at https://research.cchmc.org/mershalab/MI-MAAP/login/.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Gautam Y."
                    },
                    {
                        "name": "Ghandikota S."
                    },
                    {
                        "name": "Mersha T.B."
                    }
                ],
                "date": "2020-04-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MI-MAAP: Marker informativeness for multi-ancestry admixed populations"
            },
            "pmcid": "PMC7119171",
            "pmid": "32245404"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}
