{"credit":[],"function":[{"operation":[{"term":"Essential dynamics","uri":"http://edamontology.org/operation_3891"}]}],"labels":{"topic":[{"term":"Medicines research and development","uri":"http://edamontology.org/topic_3376"},{"term":"Physics","uri":"http://edamontology.org/topic_3318"},{"term":"Critical care medicine","uri":"http://edamontology.org/topic_3403"}]},"publication":[{"abstract":"© 2019, Associacao Brasileira de Pos - Graduacao em Saude Coletiva. All rights reserved.The analysis of physical activity (PA) assistance programs is of major importance to ensure progress in the area. The Reach, Efficacy, Adoption, Implementation and Maintenance (RE-AIM) tool has been broadly disseminated in the literature. This study set out to identify PA assistance programs among Brazilian students and analyze them using the RE-AIM tool. The search was conducted in the Lilacs, SportDiscus, SciELO, Scopus, Web of Science, EBSCOhot, PsycINFO and PubMed databases. After thoroughly researching titles, abstracts and studies, 15 articles (seven PA assistance programs) were included. The programs were conducted in the past decade at public schools in the South and Southeast of Brazil. Multicomponent (education and teacher training) strategies were used with positive results in the practice of PA. With respect to the results of the RE-AIM tool, it was found that the most reported dimensions were “reach” (74%), followed by “efficacy” (48%), “adoption” (43%), “implementation” (35%) and “maintenance” (5%). The indicators most frequently mentioned were those related to the internal validity of the program: demographic and behavioral information of the target population, method of identification of the target population, sample size, participation rate and number of organizational units involved.","authors":["da Silva J.A.","Goncalves E.C.A.","Silva D.A.S.","Silva K.S."],"cit_count":0,"doi":"10.1590/1413-81232018249.23502017","journal":"Ciencia e Saude Coletiva","pmid":"31508762","title":"Assistance programs for physical activity in Brazilian schools: A review based on the RE-AIM model Programas de intervenção para atividade física nas escolas brasileiras: Revisão com base no modelo RE-AIM","year":"2019-09-01"},{"abstract":"© Copyright 2019, Mary Ann Liebert, Inc., publishers 2019.Introduction: Varying intensity of advance care planning (ACP) interventions at the population level has not been compared among seriously ill patients in primary care. This project will implement, test, and disseminate real-world scalable ACP interventions among primary care clinics across three University of California Health systems. The three ACP interventions are (1) distribution of an advance directive (AD) with targeted ACP messaging, (2) the AD, messaging, plus prompting patients to engage with the Prepare For Your Care website (PREPARE), and (3) the AD, messaging, PREPARE, plus Care Coordinator engagement with patients and clinicians. Methods: We will identify a population cohort of seriously ill primary care patients and implement the ACP interventions using electronic health record (EHR) patient portals and postal mailings. Forty-five clinics across the three health systems will be cluster randomized to one of the three ACP interventions. The primary outcome for the population cohort is AD or Physician Orders for Life-Sustaining Treatment documentation in the EHR. A subset of the population cohort will be surveyed to assess patient-centered outcomes, including care consistent with goals at baseline, 12 months, and 24 months. Caregivers will be interviewed if patients are unable to be surveyed or die. ACP documentation, goal concordant care, and among decedents, health care utilization will be compared among intervention arms. Study Implementation: Challenges and Contributions: The project is guided by a Study Advisory Group and Community Advisory Groups at each site to ensure rigorous patient-centered methods and consistency of implementation. Intervention fidelity will be evaluated using the Reach, Efficacy, Adoption, Implementation, and Maintenance (RE-AIM) framework. Challenges to implementation of this three-site health system trial and to intervention fidelity stem from site/clinic/system cultures, increasing attention to end-of-life care from payers and regulators, and growing pressures by health systems to implement ACP interventions. Stakeholder engagement is required to ensure consistent interventions across sites.","authors":["Walling A.M.","Sudore R.L.","Bell D.","Tseng C.-H.","Ritchie C.","Hays R.D.","Gibbs L.","Rahimi M.","Sanz J.","Wenger N.S."],"cit_count":0,"doi":"10.1089/JPM.2019.0142","journal":"Journal of Palliative Medicine","pmid":"31486723","title":"Population-based pragmatic trial of advance care planning in primary care in the university of California health system","year":"2019-09-01"}],"summary":{"biotoolsCURIE":"biotools:RE-AIM","biotoolsID":"RE-AIM","description":"> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'ACP interventions', 'PREPARE', 'ACP', 'three-site' | [Assistance programs for physical activity in Brazilian schools | Population-Based Pragmatic Trial of Advance Care Planning in Primary Care in the University of California Health System | The analysis of physical activity (PA) assistance programs is of major importance to ensure progress in the area. The Reach, Efficacy, Adoption, Implementation and Maintenance (RE-AIM) tool has been broadly disseminated in the literature. This study set out to identify PA assistance programs among Brazilian students and analyze them using the RE-AIM tool. The search was conducted in the Lilacs, SportDiscus, SciELO, Scopus, Web of Science, EBSCOhot, PsycINFO and PubMed databases. After thoroughly researching titles, abstracts and studies, 15 articles (seven PA assistance programs) were included","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31508762","name":"RE-AIM"}}