{
    "additionDate": "2018-10-01T15:25:38Z",
    "biotoolsCURIE": "biotools:repeatanalyzer",
    "biotoolsID": "repeatanalyzer",
    "credit": [
        {
            "email": "assefaw@eecs.wsu.edu",
            "name": "Assefaw H. Gebremedhin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RepeatAnalyzer is a software tool capable of tracking, managing, analysing and cataloguing short-sequence repeats and genotypes using Anaplasma marginale as a model species.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://bitbucket.org/repeatgroup/repeatanalyzer/src/df19417c8e4d4429d5da1b13507cd34aabb7ec9f/UserGuide.pdf?at=master&fileviewer=file-view-default"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/repeatgroup/repeatanalyzer/overview",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "RepeatAnalyzer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12864-016-2686-2",
            "metadata": {
                "abstract": "© 2016 Catanese et al.Background: Short-sequence repeats (SSRs) occur in both prokaryotic and eukaryotic DNA, inter- and intragenically, and may be exact or inexact copies. When heterogeneous SSRs are present in a given locus, we can take advantage of the pattern of different repeats to genotype strains based on the SSRs. Cataloguing and tracking these repeats can be difficult as diverse groups of researchers are involved in the identification of the repeats. Additionally, the task is error-prone when done manually. Results: We developed RepeatAnalyzer, a new software tool capable of tracking, managing, analysing and cataloguing SSRs and genotypes using Anaplasma marginale as a model species. RepeatAnalyzer's analysis capability includes novel metrics for measuring regional genetic diversity (corresponding to variety and regularity of SSR occurrence). As a part of its visualization capabilities, RepeatAnalyzer produces high quality maps of the geographic distribution of genotypes or SSRs over a region of interest. RepeatAnalyzer's repeat identification functionality was validated for all SSRs and genotypes reported in 21 publications, using 380 A. marginale isolates gathered from the five publications within that list that provided access to their isolates. The tool produced accurate genotyping results in every case. In addition, it uncovered a number of errors in the published literature: 11 cases where SSRs were misreported, 5 cases where two different SSRs had been given the same name, and 16 cases where two or more names had been given to a single SSR. The analysis and visualization functionalities of the tool are demonstrated using several examples. Conclusions: RepeatAnalyzer is a robust software tool that can be used for storing, managing, and analysing short-sequence repeats for the purpose of strain identification. The tool can be used for any set of SSRs regardless of species. When applied to A. marginale, our test case, we show that genotype lengths for a given region follow a normal distribution, while SSR frequencies follow a power-law-like distribution. Further, we find that over 90 % of repeats are 28 to 29 amino acids long, which is in agreement with conventional wisdom. Lastly, our analysis reveals that the most common edit distance is five or six, which is counter-intuitive since we expected that result to be closer to one, resulting from the simplest change from one repeat to another.",
                "authors": [
                    {
                        "name": "Brayton K.A."
                    },
                    {
                        "name": "Catanese H.N."
                    },
                    {
                        "name": "Gebremedhin A.H."
                    }
                ],
                "citationCount": 17,
                "date": "2016-06-03T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "RepeatAnalyzer: A tool for analysing and managing short-sequence repeat data"
            },
            "pmcid": "PMC4891823",
            "pmid": "27260942",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
