{
    "additionDate": "2021-01-18T11:21:41Z",
    "biotoolsCURIE": "biotools:phydose",
    "biotoolsID": "phydose",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "melkebir@illinois.edu",
            "name": "Mohammed El-Kebir",
            "orcidid": "https://orcid.org/0000-0002-1468-2407",
            "typeEntity": "Person"
        }
    ],
    "description": "Design of follow-up single-cell sequencing experiments of tumors.\n\nPhyDOSE - Phylogenetic Design Of Single-cell sequencing Experiments.\n\nThe input to PhyDOSE is a set of candidate trees, a frequency matrix obtained from bulk data, and a confidence level. PhyDOSE provides a minimum number of single cells needed in a follow-up single-cell sequencing (SCS) experiment to determine the true phylogeny among the set of given phylogenies with at least the desired probability.\n\nphydoser is a package to aid in the design a single-cell sequencing follow-up experiment from a previous bulk sequencing experiment. The main functions of phydoser include:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elkebir-group/phydoser",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-01-23T15:42:07Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/elkebir-group/PhyDOSE"
        }
    ],
    "name": "PhyDOSE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008240",
            "metadata": {
                "abstract": "Copyright: © 2020 Weber et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The combination of bulk and single-cell DNA sequencing data of the same tumor enables the inference of high-fidelity phylogenies that form the input to many important downstream analyses in cancer genomics. While many studies simultaneously perform bulk and single-cell sequencing, some studies have analyzed initial bulk data to identify which mutations to target in a follow-up single-cell sequencing experiment, thereby decreasing cost. Bulk data provide an additional untapped source of valuable information, composed of candidate phylogenies and associated clonal prevalence. Here, we introduce PhyDOSE, a method that uses this information to strategically optimize the design of follow-up single cell experiments. Underpinning our method is the observation that only a small number of clones uniquely distinguish one candidate tree from all other trees. We incorporate distinguishing features into a probabilistic model that infers the number of cells to sequence so as to confidently reconstruct the phylogeny of the tumor. We validate PhyDOSE using simulations and a retrospective analysis of a leukemia patient, concluding that PhyDOSE’s computed number of cells resolves tree ambiguity even in the presence of typical single-cell sequencing errors. We also conduct a retrospective analysis on an acute myeloid leukemia cohort, demonstrating the potential to achieve similar results with a significant reduction in the number of cells sequenced. In a prospective analysis, we demonstrate the advantage of selecting cells to sequence across multiple biopsies and that only a small number of cells suffice to disambiguate the solution space of trees in a recent lung cancer cohort. In summary, PhyDOSE proposes cost-efficient single-cell sequencing experiments that yield high-fidelity phylogenies, which will improve downstream analyses aimed at deepening our understanding of cancer biology.",
                "authors": [
                    {
                        "name": "Aguse N."
                    },
                    {
                        "name": "Chia N."
                    },
                    {
                        "name": "El-Kebir M."
                    },
                    {
                        "name": "Weber L.L."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "PhyDOSE: Design of follow-up single-cell sequencing experiments of tumors"
            },
            "pmcid": "PMC7553321",
            "pmid": "33001973"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
