{
    "accessibility": "Open access",
    "additionDate": "2022-10-05T22:44:10.847733Z",
    "biotoolsCURIE": "biotools:spd-cnn",
    "biotoolsID": "spd-cnn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yangjianxin@scut.edu.cn",
            "name": "Jian Yang",
            "typeEntity": "Person"
        },
        {
            "email": "zlyu@scut.edu.cn",
            "name": "Zhuliang Yu",
            "typeEntity": "Person"
        },
        {
            "name": "Lezhi Chen"
        }
    ],
    "description": "A plain CNN-based model using the symmetric positive definite matrices for cross-subject EEG classification with meta-transfer-learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sabinechen/SPD-CNN-Using-Meta-Transfer-Learing-EEG-Cross-Subject-learning",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-05T22:44:10.850348Z",
    "license": "Not licensed",
    "name": "SPD-CNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNBOT.2022.958052",
            "metadata": {
                "abstract": "Copyright © 2022 Chen, Yu and Yang.The electroencephalography (EEG) signals are easily contaminated by various artifacts and noise, which induces a domain shift in each subject and significant pattern variability among different subjects. Therefore, it hinders the improvement of EEG classification accuracy in the cross-subject learning scenario. Convolutional neural networks (CNNs) have been extensively applied to EEG-based Brain-Computer Interfaces (BCIs) by virtue of the capability of performing automatic feature extraction and classification. However, they have been mainly applied to the within-subject classification which would consume lots of time for training and calibration. Thus, it limits the further applications of CNNs in BCIs. In order to build a robust classification algorithm for a calibration-less BCI system, we propose an end-to-end model that transforms the EEG signals into symmetric positive definite (SPD) matrices and captures the features of SPD matrices by using a CNN. To avoid the time-consuming calibration and ensure the application of the proposed model, we use the meta-transfer-learning (MTL) method to learn the essential features from different subjects. We validate our model by making extensive experiments on three public motor-imagery datasets. The experimental results demonstrate the effectiveness of our proposed method in the cross-subject learning scenario.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "date": "2022-08-03T00:00:00Z",
                "journal": "Frontiers in Neurorobotics",
                "title": "SPD-CNN: A plain CNN-based model using the symmetric positive definite matrices for cross-subject EEG classification with meta-transfer-learning"
            },
            "pmcid": "PMC9383414",
            "pmid": "35990886"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
