
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Opthalmology",
                "uri": "http://edamontology.org/topic_3417"
            },
            {
                "term": "Paediatrics",
                "uri": "http://edamontology.org/topic_3418"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            },
            {
                "term": "Medical informatics",
                "uri": "http://edamontology.org/topic_3063"
            }
        ]
    },
    "link": [
        {
            "type": "OTHER",
            "url": "https://www.nasn.org/"
        }
    ],
    "publication": [
        {
            "abstract": "Strong school-based vision and eye health systems include 12 key components to be implemented before, during, and after the actual vision screening event. The National Center for Children's Vision and Eye Health (NCCVEH) at Prevent Blindness partnered with the National Association of School Nurses (NASN) to provide guidance for school nurses for each of the 12 key components via a Vision and Eye Health webpage on the NASN website ( https://www.nasn.org/nasn-resources/practice-topics/vision-health ). This online resource is designed to support school nurses accountable for vision screening and maintaining the eye health of preschool- and school-age children. This NCCVEH/NASN webpage addresses key activities that provide overall support for a child's vision and eye health-beginning with parent/caregiver education and ending with an annual evaluation of the school's vision and eye health system. NASN School Nurse is publishing information about each of these 12 components. The May 2019 installment provided details about the 12 Components approach as a whole and Components 1 and 2: Family Education and a Comprehensive Communication/Approval Process. The July 2019 edition described Components 3 and 4: Vision Screening Tools and Procedures and Vision Health for Children With Special Health Care Needs. This article describes Component 5: Standardized Approach for Rescreening.",
            "authors": [
                "Nottingham Chaplin P.K.",
                "Baldonado K.",
                "Bergren M.D.",
                "Lyons S.A.",
                "Murphy M.K.",
                "Bradford G.E."
            ],
            "cit_count": 0,
            "doi": "10.1177/1942602X19890470",
            "journal": "NASN school nurse (Print)",
            "pmid": "31777312",
            "title": "12 Components of a Strong Vision Health System of Care: Part 3-Standardized Approach for Rescreening",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:NASN",
        "biotoolsID": "NASN",
        "description": "12 Components of a Strong Vision Health System of Care.\n\nNational Association of School Nurses.\n\nSkip to main content (Press Enter).\n\nSkip auxiliary navigation (Press Enter).\n\nThe mission of the National Association of School Nurses is to optimize student health and learning by advancing the practice of school nursing.\n\nThe National Center for Children’s Vision and Eye Health at Prevent Blindness has partnered with the NASN to provide national guidance for school nurses and others involved in front-line vision screening.\n\nListen to this podcast from the NASN School Nurse and learn more by reading the related article.\n\nAdverse Community Environments and Adverse Childhood Experiences.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Vision Health'",
        "homepage": "https://www.nasn.org/nasn-resources/practice-topics/vision-health",
        "name": "NASN"
    }
}