{
    "accessibility": "Open access",
    "additionDate": "2019-05-25T15:08:13Z",
    "biotoolsCURIE": "biotools:Q-HIU",
    "biotoolsID": "Q-HIU",
    "cost": "Free of charge",
    "description": "Quantitative hyperspectral image unmixing (Q-HIU) method is intended for quantitative data analysis of multi-set and individual Raman micro-spectroscopy images, allowing to efficiently retrieve non-negative spatial concentration maps and non-negative spectral profiles of the images’ chemical constituents (components) with no a priori information, minimum input parameters, and great operation speed.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/LobanovaEG-LobanovSV/Q-HIU/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LobanovaEG-LobanovSV/Q-HIU",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/LobanovaEG-LobanovSV/Q-HIU/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Q-HIU",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1016/j.aca.2018.11.018",
            "metadata": {
                "abstract": "© 2018 Elsevier B.V.Vibrational micro-spectroscopy is a powerful optical tool, providing a non-invasive label-free chemically specific imaging for many chemical and biomedical applications. However, hyperspectral image produced by Raman micro-spectroscopy typically consists of thousands discrete pixel points, each having individual Raman spectrum at thousand wavenumbers, and therefore requires appropriate image unmixing computational methods to retrieve non-negative spatial concentration and corresponding non-negative spectra of the image biochemical constituents. Here, we present a new efficient Quantitative Hyperspectral Image Unmixing (Q-HIU) method for large-scale Raman micro-spectroscopy data analysis. This method enables to simultaneously analyse multi-set Raman hyperspectral images in three steps: (i) Singular Value Decomposition with innovative Automatic Divisive Correlation which autonomously filters spatially and spectrally uncorrelated noise from data; (ii) a robust subtraction of fluorescent background from the data using a newly developed algorithm called Bottom Gaussian Fitting; (iii) an efficient Quantitative Unsupervised/Partially Supervised Non-negative Matrix Factorization method, which rigorously retrieves non-negative spatial concentration maps and spectral profiles of the samples’ biochemical constituents with no a priori information or when one or several samples’ constituents are known. As compared with state-of-the-art methods, our approach allows to achieve significantly more accurate results and efficient quantification with several orders of magnitude shorter computational time as verified on both artificial and real experimental data. We apply Q-HIU to the analysis of large-scale Raman hyperspectral images of human atherosclerotic aortic tissues and our results show a proof-of-principle for the proposed method to retrieve and quantify the biochemical composition of the tissues, consisting of both high and low concentrated compounds. Along with the established hallmarks of atherosclerosis including cholesterol/cholesterol ester, triglyceride and calcium hydroxyapatite crystals, our Q-HIU allowed to identify the significant accumulations of oxidatively modified lipids co-localizing with the atherosclerotic plaque lesions in the aortic tissues, possibly reflecting the persistent presence of inflammation and oxidative damage in these regions, which are in turn able to promote the disease pathology. For minor chemical components in the diseased tissues, our Q-HIU was able to detect the signatures of calcium hydroxyapatite and β-carotene with relative mean Raman concentrations as low as 0.09% and 0.04% from the original Raman intensity matrix with noise and fluorescent background contributions of 3% and 94%, respectively.",
                "authors": [
                    {
                        "name": "Lobanov S.V."
                    },
                    {
                        "name": "Lobanova E.G."
                    }
                ],
                "citationCount": 7,
                "date": "2019-03-07T00:00:00Z",
                "journal": "Analytica Chimica Acta",
                "title": "Efficient quantitative hyperspectral image unmixing method for large-scale Raman micro-spectroscopy data analysis"
            },
            "pmid": "30661589",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
