{"credit":[{"email":"stephen_a_smith@brown.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://phlawd.net/manual"}],"function":[{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]},{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Phylogeny","uri":"http://edamontology.org/topic_0084"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/phlawd-v1-phylogenetic-dataset-construction.html"}],"publication":[{"abstract":"How will the emerging possibility of inferring ultra-large phylogenies influence our ability to identify shifts in diversification rate? For several large angiosperm clades (Angiospermae, Monocotyledonae, Orchidaceae, Poaceae, Eudicotyledonae, Fabaceae, and Asteraceae), we explore this issue by contrasting two approaches: (1) using small backbone trees with an inferred number of extant species assigned to each terminal clade and (2) using a mega-phylogeny of 55473 seed plant species represented in GenBank. The mega-phylogeny approach assumes that the sample of species in GenBank is at least roughly proportional to the actual species diversity of different lineages, as appears to be the case for many major angiosperm lineages. Using both approaches, we found that diversification rate shifts are not directly associated with the major named clades examined here, with the sole exception of Fabaceae in the GenBank mega-phylogeny. These agreements are encouraging and may support a generality about angiosperm evolution: major shifts in diversification may not be directly associated with major named clades, but rather with clades that are nested not far within these groups. An alternative explanation is that there have been increased extinction rates in early-diverging lineages within these clades. Based on our mega-phylogeny, the shifts in diversification appear to be distributed quite evenly throughout the angiosperms. Mega-phylogenetic studies of diversification hold great promise for revealing new patterns, but we will need to focus more attention on properly specifying null expectation. © 2011 Botanical Society of America.","authors":["Smith S.A.","Beaulieu J.M.","Stamatakis A.","Donoghue M.J."],"cit_count":124,"journal":"American Journal of Botany","pmid":"21613134","title":"Understanding angiosperm diversification using small and large phylogenetic trees","year":"2011-03-01"}],"summary":{"biotoolsCURIE":"biotools:phlawd","biotoolsID":"phlawd","description":"Program written in C++ that constructs datasets from NCBI data (GenBank). This uses the megaphylogeny method to construct extremely large datasets, but is convenient for small ones too.","homepage":"http://phlawd.net/","name":"PHLAWD"}}