
{
    "credit": [
        {
            "name": "Bastien Chevreux",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.linkedin.com/in/bastien-chevreux-1a09a513/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/p/mira-assembler/wiki/Home/#documentation"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We present an EST sequence assembler that specializes in reconstruction of pristine mRNA transcripts, while at the same time detecting and classifying single nucleotide polymorphisms (SNPs) occuring in different variations thereof. The assembler uses iterative multipass strategies centered on high-confidence regions within sequences and has a fallback strategy for using low-confidence regions when needed. It features special functions to assemble high numbers of highly similar sequences without prior masking, an automatic editor that edits and analyzes alignments by inspecting the underlying traces, and detection and classification of sequence properties like SNPs with a high specificity and a sensitivity down to one mutation per sequence. In addition, it includes possibilities to use incorrectly preprocessed sequences, routines to make use of additional sequencing information such as base-error probabilities, template insert sizes, strain information, etc., and functions to detect and resolve possible misassemblies. The assembler is routinely used for such various tasks as mutation detection in different cell types, similarity analysis of transcripts between organisms, and pristine assembly of sequences from various sources for oligo design in clinical microarray experiments. ©2004 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Chevreux B.",
                "Pfisterer T.",
                "Drescher B.",
                "Driesel A.J.",
                "Muller W.E.G.",
                "Wetter T.",
                "Suhai S."
            ],
            "cit_count": 694,
            "journal": "Genome Research",
            "pmid": "15140833",
            "title": "Using the miraEST assembler for reliable and automated mRNA transcript assembly and SNP detection in sequenced ESTs",
            "year": "2004-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mira",
        "biotoolsID": "mira",
        "description": "MIRA 3 - Whole Genome Shotgun and EST Sequence Assembler",
        "homepage": "https://sourceforge.net/p/mira-assembler/wiki/Home/",
        "name": "MIRA"
    }
}