{
    "additionDate": "2017-12-18T00:11:53Z",
    "biotoolsCURIE": "biotools:rnasc",
    "biotoolsID": "rnasc",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.bc.edu/clotelab/"
        }
    ],
    "description": "Compute RNA secondary structure with user-input chemical/enzymatic probing data, especially Selective 2′-hydroxyl acylation analyzed by primer extension (SHAPE) or inline-probing data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinformatics.bc.edu/clotelab/RNAsc/index.spy?tab=manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.bc.edu/clotelab/RNAsc/index.spy",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rnasc-rna-secondary-structure-prediction-using-shape-or-inline-probing-data.html"
        }
    ],
    "name": "RNAsc",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0045160",
            "metadata": {
                "abstract": "Chemical and enzymatic footprinting experiments, such as shape (selective 2′-hydroxyl acylation analyzed by primer extension), yield important information about RNA secondary structure. Indeed, since the 2′-hydroxyl is reactive at flexible (loop) regions, but unreactive at base-paired regions, shape yields quantitative data about which RNA nucleotides are base-paired. Recently, low error rates in secondary structure prediction have been reported for three RNAs of moderate size, by including base stacking pseudo-energy terms derived from shape data into the computation of minimum free energy secondary structure. Here, we describe a novel method, RNAsc (RNA soft constraints), which includes pseudo-energy terms for each nucleotide position, rather than only for base stacking positions. We prove that RNAsc is self-consistent, in the sense that the nucleotide-specific probabilities of being unpaired in the low energy Boltzmann ensemble always become more closely correlated with the input shape data after application of RNAsc. From this mathematical perspective, the secondary structure predicted by RNAsc should be 'correct', in as much as the shape data is 'correct'. We benchmark RNAsc against the previously mentioned method for eight RNAs, for which both shape data and native structures are known, to find the same accuracy in 7 out of 8 cases, and an improvement of 25% in one case. Furthermore, we present what appears to be the first direct comparison of shape data and in-line probing data, by comparing yeast asp-tRNA shape data from the literature with data from in-line probing experiments we have recently performed. With respect to several criteria, we find that shape data appear to be more robust than in-line probing data, at least in the case of asp-tRNA. © 2012 Zarringhalam et al.",
                "authors": [
                    {
                        "name": "Zarringhalam K."
                    },
                    {
                        "name": "Meyer M.M."
                    },
                    {
                        "name": "Dotu I."
                    },
                    {
                        "name": "Chuang J.H."
                    },
                    {
                        "name": "Clote P."
                    }
                ],
                "citationCount": 56,
                "date": "2012-10-16T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Integrating Chemical Footprinting Data into RNA Secondary Structure Prediction"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}