{
    "additionDate": "2021-03-19T08:41:56Z",
    "biotoolsCURIE": "biotools:tailor",
    "biotoolsID": "tailor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matei.ionita@pennmedicine.upenn.edu",
            "name": "Matei Ionita",
            "typeEntity": "Person"
        }
    ],
    "description": "Targeting heavy tails in flow cytometry data with fast, interpretable mixture modeling.\n\nAn R package for clustering via Gaussian Mixture Modeling, optimized for heavy-tailed distributions in flow cytometry data.\n\nIt's easiest to install Tailor with the help of the devtools package.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/matei-ionita/Tailor",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-11T10:33:12Z",
    "name": "Tailor",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/CYTO.A.24307",
            "metadata": {
                "abstract": "© 2021 International Society for Advancement of CytometryAutomated clustering workflows are increasingly used for the analysis of high parameter flow cytometry data. This trend calls for algorithms which are able to quickly process tens of millions of data points, to compare results across subjects or time points, and to provide easily actionable interpretations of the results. To this end, we created Tailor, a model-based clustering algorithm specialized for flow cytometry data. Our approach leverages a phenotype-aware binning scheme to provide a coarse model of the data, which is then refined using a multivariate Gaussian mixture model. We benchmark Tailor using a simulation study and two flow cytometry data sets, and show that the results are robust to moderate departures from normality and inter-sample variation. Moreover, Tailor provides automated, non-overlapping annotations of its clusters, which facilitates interpretation of results and downstream analysis. Tailor is released as an R package, and the source code is publicly available at www.github.com/matei-ionita/Tailor.",
                "authors": [
                    {
                        "name": "Ionita M."
                    },
                    {
                        "name": "Schretzenmair R."
                    },
                    {
                        "name": "Jones D."
                    },
                    {
                        "name": "Moore J."
                    },
                    {
                        "name": "Wang L.-S."
                    },
                    {
                        "name": "Rogers W."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Cytometry Part A",
                "title": "Tailor: Targeting heavy tails in flow cytometry data with fast, interpretable mixture modeling"
            },
            "pmid": "33476090"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}