{
    "additionDate": "2017-08-03T18:36:49Z",
    "biotoolsCURIE": "biotools:beetl",
    "biotoolsID": "beetl",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://tech.groups.yahoo.com/group/BEETL/"
        }
    ],
    "description": "Suite of applications for building and manipulating the Burrows-Wheeler Transform (BWT) of collections of DNA sequences. The algorithms employed are intended to scale to collections of sequences containing one billion entries or more.",
    "documentation": [
        {
            "type": "General",
            "url": "http://tech.groups.yahoo.com/group/BEETL/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                }
            ]
        }
    ],
    "homepage": "http://beetl.github.io/BEETL/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/beetl-0-10-burrows-wheeler-extended-tool-library.html"
        }
    ],
    "name": "BEETL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 The Author. Motivation: FASTQ is a standard file format for DNA sequencing data, which stores both nucleotides and quality scores. A typical sequencing study can easily generate hundreds of gigabytes of FASTQ files, while public archives such as ENA and NCBI and large international collaborations such as the Cancer Genome Atlas can accumulate many terabytes of data in this format. Compression tools such as gzip are often used to reduce the storage burden but have the disadvantage that the data must be decompressed before they can be used. Here, we present BEETL-fastq, a tool that not only compresses FASTQ-formatted DNA reads more compactly than gzip but also permits rapid search for k-mer queries within the archived sequences. Importantly, the full FASTQ record of each matching read or read pair is returned, allowing the search results to be piped directly to any of the many standard tools that accept FASTQ data as input. Results: We show that 6.6 terabytes of human reads in FASTQ format can be transformed into 1.7 terabytes of indexed files, from where we can search for 1, 10, 100, 1000 and a million of 30-mers in 3, 8, 14, 45 and 567 s, respectively, plus 20 ms per output read. Useful applications of the search capability are highlighted, including the genotyping of structural variant breakpoints and 'in silico pull-down' experiments in which only the reads that cover a region of interest are selectively extracted for the purposes of variant calling or visualization.",
                "authors": [
                    {
                        "name": "Janin L."
                    },
                    {
                        "name": "Schulz-Trieglaff O."
                    },
                    {
                        "name": "Cox A.J."
                    }
                ],
                "citationCount": 9,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BEETL-fastq: A searchable compressed archive for DNA reads"
            },
            "pmid": "24950811"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}