{
    "additionDate": "2017-01-17T15:00:10Z",
    "biotoolsCURIE": "biotools:cma",
    "biotoolsID": "cma",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "bernau@ibe.med.uni-muenchen.de",
            "name": "Christoph Bernau",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive collection of various microarray-based classification algorithms both from Machine Learning and Statistics. Variable Selection, Hyperparameter tuning, Evaluation and Comparison can be performed combined or stepwise in a user-friendly environment.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/CMA.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/CMA_1.32.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/CMA.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-2.0",
    "name": "CMA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-439",
            "metadata": {
                "abstract": "Background: For the last eight years, microarray-based classification has been a major topic in statistics, bioinformatics and biomedicine research. Traditional methods often yield unsatisfactory results or may even be inapplicable in the so-called \"p ≫ n\" setting where the number of predictors p by far exceeds the number of observations n, hence the term \"ill-posed-problem\". Careful model selection and evaluation satisfying accepted good-practice standards is a very complex task for statisticians without experience in this area or for scientists with limited statistical background. The multiplicity of available methods for class prediction based on high-dimensional data is an additional practical challenge for inexperienced researchers. Results: In this article, we introduce a new Bioconductor package called CMA (standing for \"Classification for MicroArrays\") for automatically performing variable selection, parameter tuning, classifier construction, and unbiased evaluation of the constructed classifiers using a large number of usual methods. Without much time and effort, users are provided with an overview of the unbiased accuracy of most top-performing classifiers. Furthermore, the standardized evaluation framework underlying CMA can also be beneficial in statistical research for comparison purposes, for instance if a new classifier has to be compared to existing approaches. Conclusion: CMA is a user-friendly comprehensive package for classifier construction and evaluation implementing most usual approaches. It is freely available from the Bioconductor website at http://bioconductor.org/packages/2.3/bioc/html/CMA.html. © 2008 Slawski et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Slawski M."
                    },
                    {
                        "name": "Daumer M."
                    },
                    {
                        "name": "Boulesteix A.-L."
                    }
                ],
                "citationCount": 75,
                "date": "2008-10-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CMA - A comprehensive Bioconductor package for supervised classification with high dimensional data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "1.32.0"
    ]
}