{
    "additionDate": "2020-01-09T17:54:06Z",
    "biotoolsCURIE": "biotools:iRSpot-Pse6NC2.0",
    "biotoolsID": "iRSpot-Pse6NC2.0",
    "confidence_flag": "tool",
    "description": "A comparison and assessment of computational method for identifying recombination hotspots in Saccharomyces cerevisiae.\n\nMeiotic recombination is one of the most important driving forces in the process of biological evolution, which is initiated by double-stand DNA breaks (DSBs). Recombination has important roles in genome diversity and evolution. Based on dataset containing both ORF and non-ORF recombination sites, we construct a predictor called ‘iRSpot-Pse6NC2.0’ using SVM classifier by incorporating the key hexamer features into the general PseKNC (Pseudo K-tuple Nucleotide Composition) via the binomial distribution feature selection approach. The 5-fold cross-validated results showed that the maximum overall accuracy of 77.61%.\n\nMeiotic recombination caused by meiotic double-strand DNA breaks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/server/iRSpot-Pse6NC2.0",
    "lastUpdate": "2020-12-14T13:23:52Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://lin-group.cn/server/iRSpot-pse6NC/"
        }
    ],
    "name": "iRSpot-Pse6NC2.0",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ123",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Meiotic recombination is one of the most important driving forces of biological evolution, which is initiated by double-strand DNA breaks. Recombination has important roles in genome diversity and evolution. This review firstly provides a comprehensive survey of the 15 computational methods developed for identifying recombination hotspots in Saccharomyces cerevisiae. These computational methods were discussed and compared in terms of underlying algorithms, extracted features, predictive capability and practical utility. Subsequently, a more objective benchmark data set was constructed to develop a new predictor iRSpot-Pse6NC2.0 (http://lin-group.cn/server/iRSpot-Pse6NC2.0). To further demonstrate the generalization ability of these methods, we compared iRSpot-Pse6NC2.0 with existing methods on the chromosome XVI of S. cerevisiae. The results of the independent data set test demonstrated that the new predictor is superior to existing tools in the identification of recombination hotspots. The iRSpot-Pse6NC2.0 will become an important tool for identifying recombination hotspot.",
                "authors": [
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Dao F.-Y."
                    },
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Ding H."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 41,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "A comparison and assessment of computational method for identifying recombination hotspots in Saccharomyces cerevisiae"
            },
            "pmid": "31633777"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}