{
    "additionDate": "2021-01-18T11:15:14Z",
    "biotoolsCURIE": "biotools:pandm",
    "biotoolsID": "pandm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ywei@sta.cuhk.edu.hk",
            "name": "Yingying Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "Pan-cancer analysis of differential DNA methylation patterns.\n\nPan-cancer differential methylation (DM) analysis investigates aberrant DNA methylation patterns in multiple distinct cancer types. PanDM is a statistical model for such comprehensive study. By jointly modeling DNA methylation profiles from various cancer types, PanDM is able to learn the pan-cancer commonalities and differences of DM patterns. PanDM works on the summary statistics from the individual DM analyses for each cancer type. Thus, it can be easily integrated with existing DM calling methods. Furthermore, the same framework can also be applied to pan-cancer analyses of other functional genomic profiles, such as transcriptomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://www.sta.cuhk.edu.hk/YWei/PanDM.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T16:56:56Z",
    "name": "PanDM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12920-020-00780-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: DNA methylation is a key epigenetic regulator contributing to cancer development. To understand the role of DNA methylation in tumorigenesis, it is important to investigate and compare differential methylation (DM) patterns between normal and case samples across different cancer types. However, current pan-cancer analyses call DM separately for each cancer, which suffers from lower statistical power and fails to provide a comprehensive view for patterns across cancers. Methods: In this work, we propose a rigorous statistical model, PanDM, to jointly characterize DM patterns across diverse cancer types. PanDM uses the hidden correlations in the combined dataset to improve statistical power through joint modeling. PanDM takes summary statistics from separate analyses as input and performs methylation site clustering, differential methylation detection, and pan-cancer pattern discovery. We demonstrate the favorable performance of PanDM using simulation data. We apply our model to 12 cancer methylome data collected from The Cancer Genome Atlas (TCGA) project. We further conduct ontology- and pathway-enrichment analyses to gain new biological insights into the pan-cancer DM patterns learned by PanDM. Results: PanDM outperforms two types of separate analyses in the power of DM calling in the simulation study. Application of PanDM to TCGA data reveals 37 pan-cancer DM patterns in the 12 cancer methylomes, including both common and cancer-type-specific patterns. These 37 patterns are in turn used to group cancer types. Functional ontology and biological pathways enriched in the non-common patterns not only underpin the cancer-type-specific etiology and pathogenesis but also unveil the common environmental risk factors shared by multiple cancer types. Moreover, we also identify PanDM-specific DM CpG sites that the common strategy fails to detect. Conclusions: PanDM is a powerful tool that provides a systematic way to investigate aberrant methylation patterns across multiple cancer types. Results from real data analyses suggest a novel angle for us to understand the common and specific DM patterns in different cancers. Moreover, as PanDM works on the summary statistics for each cancer type, the same framework can in principle be applied to pan-cancer analyses of other functional genomic profiles. We implement PanDM as an R package, which is freely available at http://www.sta.cuhk.edu.hk/YWei/PanDM.html.",
                "authors": [
                    {
                        "name": "Shi M."
                    },
                    {
                        "name": "Tsui S.K.-W."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Wei Y."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Pan-cancer analysis of differential DNA methylation patterns"
            },
            "pmcid": "PMC7579968",
            "pmid": "33087120"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}