
{
    "credit": [
        {
            "name": "Bader Lab",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://baderzone.org/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://bitbucket.org/pchanda/hapzipper/downloads/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hapzipper-compression-scheme-for-hapmap-phase-iii-phased-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "The rapidly growing amount of genomic sequence data being generated and made publicly available necessitate the development of new data storage and archiving methods. The vast amount of data being shared and manipulated also create new challenges for network resources. Thus, developing advanced data compression techniques is becoming an integral part of data production and analysis. The HapMap project is one of the largest public resources of human single-nucleotide polymorphisms (SNPs), characterizing over 3 million SNPs genotyped in over 1000 individuals. The standard format and biological properties of HapMap data suggest that a dedicated genetic compression method can outperform generic compression tools. We propose a compression methodology for genetic data by introducing HapZipper, a lossless compression tool tailored to compress HapMap data beyond benchmarks defined by generic tools such as gzip, bzip2 and lzma. We demonstrate the usefulness of HapZipper by compressing HapMap 3 populations to <5′ of their original sizes. HapZipper is freely downloadable from https://bitbucket.org/pchanda/hapzipper/downloads/ HapZipper.tar.bz2. © 2012 The Author(s).",
            "authors": [
                "Chanda P.",
                "Elhaik E.",
                "Bader J.S."
            ],
            "cit_count": 2,
            "journal": "Nucleic Acids Research",
            "pmid": "22844100",
            "title": "HapZipper: Sharing HapMap populations just got easier",
            "year": "2012-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hapzipper",
        "biotoolsID": "hapzipper",
        "description": "Lossless compression tool tailored to compress HapMap data beyond benchmarks defined by generic tools such as gzip, bzip2 and lzma.",
        "homepage": "https://bitbucket.org/pchanda/hapzipper",
        "name": "HapZipper"
    }
}