{
    "additionDate": "2021-01-18T08:00:23Z",
    "biotoolsCURIE": "biotools:speciesprimer",
    "biotoolsID": "speciesprimer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matthias.dreier@agroscope.admin.ch",
            "name": "Matthias Dreier",
            "typeEntity": "Person"
        }
    ],
    "description": "a bioinformatics pipeline dedicated to the design of qPCR primers for the quantification of bacterial species.\n\nThe SpeciesPrimer pipeline is intended to help researchers finding specific primer pairs for the detection and quantification of bacterial species in complex ecosystems.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/biologger/speciesprimer"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                }
            ]
        }
    ],
    "homepage": "http://primer3.ut.ee",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T14:11:06Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/biologger/speciesprimer"
        }
    ],
    "name": "SpeciesPrimer",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.7717/PEERJ.8544",
            "metadata": {
                "abstract": "© Copyright 2020 Dreier et al.Background. Quantitative real-time PCR (qPCR) is a well-established method for detecting and quantifying bacteria, and it is progressively replacing culture-based diagnostic methods in food microbiology. High-throughput qPCR using microfluidics brings further advantages by providing faster results, decreasing the costs per sample and reducing errors due to automatic distribution of samples and reagents. In order to develop a high-throughput qPCR approach for the rapid and cost-efficient quantification of microbial species in complex systems such as fermented foods (for instance, cheese), the preliminary setup of qPCR assays working efficiently under identical PCR conditions is required. Identification of target-specific nucleotide sequences and design of specific primers are the most challenging steps in this process. To date, most available tools for primer design require either laborious manual manipulation or highperformance computing systems. Results. We developed the SpeciesPrimer pipeline for automated high-throughput screening of species-specific target regions and the design of dedicated primers. Using SpeciesPrimer,specific primers were designed for four bacterialspecies of importance in cheese quality control, namely Enterococcus faecium, Enterococcus faecalis, Pediococcus acidilactici and Pediococcus pentosaceus. Selected primers were first evaluated in silico and subsequently in vitro using DNA from pure cultures of a variety of strains found in dairy products. Specific qPCR assays were developed and validated, satisfying the criteria of inclusivity, exclusivity and amplification efficiencies. Conclusion. In this work, we present the SpeciesPrimer pipeline, a tool to design species-specific primers for the detection and quantification of bacterial species. We use SpeciesPrimer to design qPCR assays for four bacterial species and describe a workflow to evaluate the designed primers. SpeciesPrimer facilitates efficient primer design for species-specific quantification, paving the way for a fast and accurate quantitative investigation of microbial communities.",
                "authors": [
                    {
                        "name": "Berthoud H."
                    },
                    {
                        "name": "Dreier M."
                    },
                    {
                        "name": "Junier P."
                    },
                    {
                        "name": "Shani N."
                    },
                    {
                        "name": "Wechsler D."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "SpeciesPrimer: A bioinformatics pipeline dedicated to the design of qPCR primers for the quantification of bacterial species"
            },
            "pmcid": "PMC7034379",
            "pmid": "32110486"
        }
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
