{
    "additionDate": "2019-07-04T07:24:49Z",
    "biotoolsCURIE": "biotools:MeroX",
    "biotoolsID": "MeroX",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "info@StavroX.com",
            "name": "Michael Götze",
            "orcidid": "https://orcid.org/0000-0003-4001-2324",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ],
            "url": "https://www.researchgate.net/profile/Michael_Goetze"
        }
    ],
    "description": "Analysis tool for protein-protein cross-linking using MS-cleavable cross-lining reagents such as DSBU, DSSO, CDI or PIR linker",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.StavroX.com/help.htm"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://www.stavrox.com/Download.htm",
            "version": "2.0 (2.0.0.7)"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry spectra",
                        "uri": "http://edamontology.org/data_0943"
                    },
                    "format": [
                        {
                            "term": "MGF",
                            "uri": "http://edamontology.org/format_3651"
                        },
                        {
                            "term": "mzML",
                            "uri": "http://edamontology.org/format_3244"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein sequence record",
                        "uri": "http://edamontology.org/data_2886"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Operation: cross-linking/MS analysis\nOutput: zipped result file (.ZHRM), containing spectra, results and decoy analysis data",
            "operation": [
                {
                    "term": "Operation",
                    "uri": "http://edamontology.org/operation_0004"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "Format",
                            "uri": "http://edamontology.org/format_1915"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://www.stavrox.com",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-01-19T17:48:06Z",
    "license": "Freeware",
    "link": [
        {
            "note": "Extensive online help",
            "type": [
                "Helpdesk"
            ],
            "url": "http://www.StavroX.com/help.htm"
        }
    ],
    "maturity": "Mature",
    "name": "MeroX",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "stavrox",
    "publication": [
        {
            "doi": "10.1007/s13361-014-1001-1",
            "metadata": {
                "abstract": "© 2014 American Society for Mass Spectrometry.CID-MS/MS cleavable cross-linkers hold an enormous potential for an automated analysis of cross-linked products, which is essential for conducting structural proteomics studies. The created characteristic fragment ion patterns can easily be used for an automated assignment and discrimination of cross-linked products. To date, there are only a few software solutions available that make use of these properties, but none allows for an automated analysis of cleavable cross-linked products. The MeroX software fills this gap and presents a powerful tool for protein 3D-structure analysis in combination with MS/MS cleavable cross-linkers. We show that MeroX allows an automatic screening of characteristic fragment ions, considering static and variable peptide modifications, and effectively scores different types of cross-links. No manual input is required for a correct assignment of cross-links and false discovery rates are calculated. The self-explanatory graphical user interface of MeroX provides easy access for an automated cross-link search platform that is compatible with commonly used data file formats, enabling analysis of data originating from different instruments. The combination of an MS/MS cleavable cross-linker with a dedicated software tool for data analysis provides an automated workflow for 3D-structure analysis of proteins. MeroX is available at www.StavroX.com.",
                "authors": [
                    {
                        "name": "Fritzsche R."
                    },
                    {
                        "name": "Gotze M."
                    },
                    {
                        "name": "Ihling C.H."
                    },
                    {
                        "name": "Pettelkau J."
                    },
                    {
                        "name": "Schafer M."
                    },
                    {
                        "name": "Sinz A."
                    }
                ],
                "citationCount": 109,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "Automated assignment of MS/MS cleavable cross-links in protein 3d-structure analysis"
            }
        },
        {
            "doi": "10.1021/acs.analchem.5b04853",
            "metadata": {
                "abstract": "© 2016 American Chemical Society.Cross-linking combined with mass spectrometry (MS) has evolved as an alternative strategy in structural biology for characterizing three-dimensional structures of protein assemblies and for mapping protein-protein interactions. Here, we describe an integrated workflow for an automated identification of cross-linked products that is based on the use of a tandem mass spectrometry (MS/MS) cleavable cross-linker (containing a 1,3-bis-(4-oxo-butyl)-urea group, BuUrBu) generating characteristic doublet patterns upon fragmentation. We evaluate different fragmentation methods available on an Orbitrap Fusion mass spectrometer for three proteins and an E. coli cell lysate. An updated version of the dedicated software tool MeroX was employed for a fully automated identification of cross-links. The strength of our cleavable cross-linker is that characteristic patterns of the cross-linker as well as backbone fragments of the connected peptides are already observed at the MS/MS level, eliminating the need for conducting MS3 or sequential CID (collision-induced dissociation)- and ETD (electron transfer dissociation)-MS/MS experiments. This makes our strategy applicable to a broad range of mass spectrometers with MS/MS capabilities. For purified proteins and protein complexes, our workflow using CID-MS/MS acquisition performs with high confidence, scoring cross-links at 0.5% false discovery rate (FDR). The cross-links provide structural insights into the intrinsically disordered tetrameric tumor suppressor protein p53. As a time-consuming manual inspection of cross-linking data is not required, our workflow will pave the way for making the cross-linking/MS approach a routine technique for structural proteomics studies.",
                "authors": [
                    {
                        "name": "Arlt C."
                    },
                    {
                        "name": "Gotze M."
                    },
                    {
                        "name": "Hage C."
                    },
                    {
                        "name": "Ihling C.H."
                    },
                    {
                        "name": "Schafer M."
                    },
                    {
                        "name": "Sinz A."
                    }
                ],
                "citationCount": 31,
                "date": "2016-08-16T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Integrated Workflow for Structural Proteomics Studies Based on Cross-Linking/Mass Spectrometry with an MS/MS Cleavable Cross-Linker"
            }
        },
        {
            "doi": "10.1038/s41596-018-0068-8",
            "metadata": {
                "abstract": "© 2018, Springer Nature Limited.Chemical cross-linking in combination with mass spectrometric analysis of the created cross-linked products is an emerging technology aimed at deriving valuable structural information from proteins and protein complexes. The goal of our protocol is to obtain distance constraints for structure determination of proteins and to investigate protein–protein interactions. We present an integrated workflow for cross-linking/mass spectrometry (MS) based on protein cross-linking with MS-cleavable reagents, followed by enzymatic digestion, enrichment of cross-linked peptides by strong cation-exchange chromatography (SCX), and LC/MS/MS analysis. To exploit the full potential of MS-cleavable cross-linkers, we developed an updated version of the freely available MeroX software for automated data analysis. The commercially available, MS-cleavable cross-linkers (DSBU and CDI) used herein possess different lengths and react with amine as well as hydroxy groups. Owing to the formation of two characteristic 26-u doublets in their MS/MS spectra, many fewer false positives are found than when using classic, non-cleavable cross-linkers. The protocol, exemplified herein for BSA and the whole Escherichia coli ribosome, is robust and widely applicable, and it allows facile identification of cross-links for deriving spatial constraints from purified proteins and protein complexes. The cross-linking/MS procedure takes 2–3 days to complete.",
                "authors": [
                    {
                        "name": "Arlt C."
                    },
                    {
                        "name": "Gotze M."
                    },
                    {
                        "name": "Hage C."
                    },
                    {
                        "name": "Iacobucci C."
                    },
                    {
                        "name": "Ihling C.H."
                    },
                    {
                        "name": "Piotrowski C."
                    },
                    {
                        "name": "Schafer M."
                    },
                    {
                        "name": "Schmidt R."
                    },
                    {
                        "name": "Sinz A."
                    }
                ],
                "citationCount": 65,
                "date": "2018-12-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "A cross-linking/mass spectrometry workflow based on MS-cleavable cross-linkers and the MeroX software for studying protein structures and protein–protein interactions"
            }
        },
        {
            "metadata": {
                "abstract": "Chemical crosslinking in combination with mass spectrometry has matured into an alternative approach to derive low-resolution structural information of proteins and protein complexes. Yet, one of the major drawbacks of this strategy remains the lack of software that is able to handle the large MS datasets that are created after chemical crosslinking and enzymatic digestion of the crosslinking reaction mixtures. Here, we describe a software, termed StavroX, which has been specifically designed for analyzing highly complex crosslinking datasets. The StavroX software was evaluated for three diverse biological systems: (1) the complex between calmodulin and a peptide derived from Munc13, (2) an N-terminal -laminin fragment, and (3) the complex between guanylyl cyclase activating protein-2 and a peptide derived from retinal guanylyl cyclase. We show that the StavroX software is advantageous for analyzing crosslinked products due to its easy-to-use graphical user interface and the highly automated analysis of mass spectrometry (MS) and tandem mass spectrometry (MS/MS) data resulting in short times for analysis. StavroX is expected to give a further push to the chemical crosslinking approach as a routine technique for protein interaction studies. © 2011 American Society for Mass Spectrometry.",
                "authors": [
                    {
                        "name": "Bosse K."
                    },
                    {
                        "name": "Fritzsche R."
                    },
                    {
                        "name": "Gotze M."
                    },
                    {
                        "name": "Ihling C.H."
                    },
                    {
                        "name": "Krauth F."
                    },
                    {
                        "name": "Kuhn U."
                    },
                    {
                        "name": "Pettelkau J."
                    },
                    {
                        "name": "Schaks S."
                    },
                    {
                        "name": "Sinz A."
                    }
                ],
                "citationCount": 221,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "StavroX-A software for analyzing crosslinked products in protein interaction studies"
            },
            "pmid": "22038510"
        }
    ],
    "relation": [
        {
            "biotoolsID": "stavrox",
            "type": "includes"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1,
    "version": [
        "2.0 (2.0.0.7)"
    ]
}
