{
    "additionDate": "2017-08-03T18:53:56Z",
    "biotoolsCURIE": "biotools:pepis",
    "biotoolsID": "pepis",
    "credit": [
        {
            "email": "pzhao@noble.org",
            "name": "Patrick X. Zhao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "shizhong.xu@ucr.edu",
            "name": "Shizhong Xu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.noble.org/gateway/"
        }
    ],
    "description": "Pipeline that is dedicatedly developed for Polygenic, specifically, Epistatic QTL mapping.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.noble.org/PolyGenic_QTL/Home.gy"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.noble.org/PolyGenic_QTL/",
    "language": [
        "C",
        "C++",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pepis-estimating-epistatic-effect-in-linkage-mapping-and-genome-wide-association-studies.html"
        }
    ],
    "name": "PEPIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Zhang et al.The term epistasis refers to interactions between multiple genetic loci. Genetic epistasis is important in regulating biological function and is considered to explain part of the ‘missing heritability,’ which involves marginal genetic effects that cannot be accounted for in genome-wide association studies. Thus, the study of epistasis is of great interest to geneticists. However, estimating epistatic effects for quantitative traits is challenging due to the large number of interaction effects that must be estimated, thus significantly increasing computing demands. Here, we present a new web server-based tool, the Pipeline for estimating EPIStatic genetic effects (PEPIS), for analyzing polygenic epistatic effects. The PEPIS software package is based on a new linear mixed model that has been used to predict the performance of hybrid rice. The PEPIS includes two main sub-pipelines: the first for kinship matrix calculation, and the second for polygenic component analyses and genome scanning for main and epistatic effects. To accommodate the demand for high-performance computation, the PEPIS utilizes C/C++ for mathematical matrix computing. In addition, the modules for kinship matrix calculations and main and epistatic-effect genome scanning employ parallel computing technology that effectively utilizes multiple computer nodes across our networked cluster, thus significantly improving the computational speed. For example, when analyzing the same immortalized F2 rice population genotypic data examined in a previous study, the PEPIS returned identical results at each analysis step with the original prototype R code, but the computational time was reduced from more than one month to about five minutes. These advances will help overcome the bottleneck frequently encountered in genome wide epistatic genetic effect analysis and enable accommodation of the high computational demand. The PEPIS is publically available at http://bioinfo.noble.org/PolyGenic_QTL/.",
                "authors": [
                    {
                        "name": "Dai X."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Xu S."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhao P.X."
                    }
                ],
                "citationCount": 16,
                "date": "2016-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "PEPIS: A Pipeline for Estimating Epistatic Effects in Quantitative Trait Locus Mapping and Genome-Wide Association Studies"
            },
            "pmid": "27224861"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
