
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://gepard.bioinformatik.uni-saarland.de/Members/thorsten-will/thorsten-will"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/ppixpress/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ppixpress-specific-protein-interaction-networks-from-transcript-expression.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Summary: Protein-protein interaction networks are an important component of modern systems biology. Yet, comparatively few efforts have been made to tailor their topology to the actual cellular condition being studied. Here, we present a network construction method that exploits expression data at the transcript-level and thus reveals alterations in protein connectivity not only caused by differential gene expression but also by alternative splicing. We achieved this by establishing a direct correspondence between individual protein interactions and underlying domain interactions in a complete but condition-unspecific protein interaction network. This knowledge was then used to infer the condition-specific presence of interactions from the dominant protein isoforms. When we compared contextualized interaction networks of matched normal and tumor samples in breast cancer, our transcript-based construction identified more significant alterations that affected proteins associated with cancerogenesis than a method that only uses gene expression data. The approach is provided as the user-friendly tool PPIXpress. Availability and implementation: PPIXpress is available at https://sourceforge.net/projects/ppixpress/. Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Will T.",
                "Helms V."
            ],
            "cit_count": 7,
            "journal": "Bioinformatics",
            "pmid": "26508756",
            "title": "PPIXpress: Construction of condition-specific protein interaction networks based on transcript expression",
            "year": "2015-09-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ppixpress",
        "biotoolsID": "ppixpress",
        "description": "Exploit expression data at the transcript-level and reveal alterations in protein connectivity caused by alternative splicing.",
        "homepage": "http://sourceforge.net/projects/ppixpress/",
        "name": "PPIXpress"
    }
}