{
    "additionDate": "2021-01-18T10:35:17Z",
    "biotoolsCURIE": "biotools:flimj",
    "biotoolsID": "flimj",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eliceiri@wisc.edu",
            "name": "Kevin W Eliceiri",
            "typeEntity": "Person"
        }
    ],
    "description": "FLIMJ is an open-source ImageJ plugin for fluorescence lifetime image data analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://imagej.net/FLIMJ",
    "language": [
        "Python",
        "Groovy"
    ],
    "lastUpdate": "2021-03-11T09:55:55Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/flimlib/flimj-ui"
        }
    ],
    "name": "FLIMJ",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.08.17.253625"
        },
        {
            "doi": "10.1371/journal.pone.0238327",
            "metadata": {
                "abstract": "© 2020 Gao et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In the field of fluorescence microscopy, there is continued demand for dynamic technologies that can exploit the complete information from every pixel of an image. One imaging technique with proven ability for yielding additional information from fluorescence imaging is Fluorescence Lifetime Imaging Microscopy (FLIM). FLIM allows for the measurement of how long a fluorophore stays in an excited energy state, and this measurement is affected by changes in its chemical microenvironment, such as proximity to other fluorophores, pH, and hydrophobic regions. This ability to provide information about the microenvironment has made FLIM a powerful tool for cellular imaging studies ranging from metabolic measurement to measuring distances between proteins. The increased use of FLIM has necessitated the development of computational tools for integrating FLIM analysis with image and data processing. To address this need, we have created FLIMJ, an ImageJ plugin and toolkit that allows for easy use and development of extensible image analysis workflows with FLIM data. Built on the FLIMLib decay curve fitting library and the ImageJ Ops framework, FLIMJ offers FLIM fitting routines with seamless integration with many other ImageJ components, and the ability to be extended to create complex FLIM analysis workflows. Building on ImageJ Ops also enables FLIMJ’s routines to be used with Jupyter notebooks and integrate naturally with science-friendly programming in, e.g., Python and Groovy. We show the extensibility of FLIMJ in two analysis scenarios: lifetime-based image segmentation and image colocalization. We also validate the fitting routines by comparing them against industry FLIM analysis standards.",
                "authors": [
                    {
                        "name": "Gao D."
                    },
                    {
                        "name": "Barber P.R."
                    },
                    {
                        "name": "Chacko J.V."
                    },
                    {
                        "name": "Sagar M.A.K."
                    },
                    {
                        "name": "Rueden C.T."
                    },
                    {
                        "name": "Grislis A.R."
                    },
                    {
                        "name": "Hiner M.C."
                    },
                    {
                        "name": "Eliceiri K.W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FLIMJ: An open-source ImageJ toolkit for fluorescence lifetime image data analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}