{"credit":[{"email":"Xi.Wang@mdc-berlin.de","name":"Xi Wang","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/SeqGSEA.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/SeqGSEA_1.14.0.tar.gz"}],"function":[{"operation":[{"term":"Gene-set enrichment analysis","uri":"http://edamontology.org/operation_2436"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"}]},"publication":[{"abstract":"SeqGSEA is an open-source Bioconductor package for the functional integration of differential expression and splicing analysis in RNA-Seq data. SeqGSEA implements an analysis pipeline, which first computes differential splicing and differential expression scores, followed by integrating them into a per-gene score that quantifies each gene's association with a phenotype of interest, and finally executes gene set enrichment analysis in a cutoff-free manner to achieve biological insights. SeqGSEA accounts for biological variability and determines the statistical significance of gene pathways and networks using subject permutation, and thus requires at least five samples per group. Real applications show that SeqGSEA detects more biologically meaningful gene sets without biases toward long or highly expressed genes. SeqGSEA can be set up to run in parallel to reduce the analysis time. © 2014 The Author. Published by Oxford University Press. All rights reserved.","authors":["Wang X.","Cairns M.J."],"cit_count":28,"doi":"10.1093/bioinformatics/btu090","journal":"Bioinformatics","pmid":"24535097","title":"SeqGSEA: A Bioconductor package for gene set enrichment analysis of RNA-Seq data integrating differential expression and splicing","type":"Primary","year":"2014-06-15"}],"summary":{"biotoolsCURIE":"biotools:seqgsea","biotoolsID":"seqgsea","description":"The package generally provides methods for gene set enrichment analysis of high-throughput RNA-Seq data by integrating differential expression and splicing. It uses negative binomial distribution to model read count data, which accounts for sequencing biases and biological variation. Based on permutation tests, statistical significance can also be achieved regarding each gene's differential expression and splicing, respectively.","homepage":"http://bioconductor.org/packages/release/bioc/html/SeqGSEA.html","name":"SeqGSEA","version":["1.14.0"]}}