{
    "additionDate": "2021-09-27T05:33:21.320849Z",
    "biotoolsCURIE": "biotools:hierarchicell",
    "biotoolsID": "hierarchicell",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kdzimmer@wakehealth.edu",
            "name": "Kip D. Zimmerman",
            "orcidid": "https://orcid.org/0000-0002-2943-6612",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "clangefe@wakehealth.edu",
            "name": "Carl D. Langefeld",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Hierarchicell is an R-package for estimating power for tests of differential expression with single-cell data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kdzimm/hierarchicell",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-09-27T05:33:21.324027Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/kdzimm/hierarchicell/issues"
        }
    ],
    "name": "Hierarchicell",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07635-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Study design is a critical aspect of any experiment, and sample size calculations for statistical power that are consistent with that study design are central to robust and reproducible results. However, the existing power calculators for tests of differential expression in single-cell RNA-seq data focus on the total number of cells and not the number of independent experimental units, the true unit of interest for power. Thus, current methods grossly overestimate the power. Results: Hierarchicell is the first single-cell power calculator to explicitly simulate and account for the hierarchical correlation structure (i.e., within sample correlation) that exists in single-cell RNA-seq data. Hierarchicell, an R-package available on GitHub, estimates the within sample correlation structure from real data to simulate hierarchical single-cell RNA-seq data and estimate power for tests of differential expression. This multi-stage approach models gene dropout rates, intra-individual dispersion, inter-individual variation, variable or fixed number of cells per individual, and the correlation among cells within an individual. Without modeling the within sample correlation structure and without properly accounting for the correlation in downstream analysis, we demonstrate that estimates of power are falsely inflated. Hierarchicell can be used to estimate power for binary and continuous phenotypes based on user-specified number of independent experimental units (e.g., individuals) and cells within the experimental unit. Conclusions: Hierarchicell is a user-friendly R-package that provides accurate estimates of power for testing hypotheses of differential expression in single-cell RNA-seq data. This R-package represents an important addition to single-cell RNA analytic tools and will help researchers design experiments with appropriate and accurate power, increasing discovery and improving robustness and reproducibility.",
                "authors": [
                    {
                        "name": "Zimmerman K.D."
                    },
                    {
                        "name": "Langefeld C.D."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Hierarchicell: an R-package for estimating power for tests of differential expression with single-cell data"
            },
            "pmcid": "PMC8088563",
            "pmid": "33932993",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}