{
    "accessibility": [],
    "additionDate": "2018-07-07T15:56:07Z",
    "biotoolsCURIE": "biotools:pgs_classify",
    "biotoolsID": "pgs_classify",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "federica.martina@unito.it",
            "gridid": null,
            "name": "Federica Martina",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "A new features selection method to improve classification performances in imbalanced data sets.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://github.com/mbeccuti/PGS/blob/master/README.md"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/mbeccuti/PGS",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Peculiar Genes Selection (PGS)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0177475",
            "metadata": {
                "abstract": "© 2017 Martina et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. High-Throughput technologies provide genomic and trascriptomic data that are suitable for biomarker detection for classification purposes. However, the high dimension of the output of such technologies and the characteristics of the data sets analysed represent an issue for the classification task. Here we present a new feature selection method based on three steps to detect class-specific biomarkers in case of high-dimensional data sets. The first step detects the differentially expressed genes according to the experimental conditions tested in the experimental design, the second step filters out the features with low discriminative power and the third step detects the class-specific features and defines the final biomarker as the union of the class-specific features. The proposed procedure is tested on two microarray datasets, one characterized by a strong imbalance between the size of classes and the other one where the size of classes is perfectly balanced. We show that, using the proposed feature selection procedure, the classification performances of a Support Vector Machine on the imbalanced data set reach a 82% whereas other methods do not exceed 73%. Furthermore, in case of perfectly balanced dataset, the classification performances are comparable with other methods. Finally, the Gene Ontology enrichments performed on the signatures selected with the proposed pipeline, confirm the biological relevance of our methodology. The download of the package with the implementation of Peculiar Genes Selection, ‘PGS’, is available for R users at: http://github.com/mbeccuti/PGS.",
                "authors": [
                    {
                        "name": "Martina F."
                    },
                    {
                        "name": "Beccuti M."
                    },
                    {
                        "name": "Balbo G."
                    },
                    {
                        "name": "Cordero F."
                    }
                ],
                "citationCount": 4,
                "date": "2017-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Peculiar genes selection: A new features selection method to improve classification performances in imbalanced data sets"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1,
    "version": []
}