{
    "additionDate": "2018-05-22T21:24:04Z",
    "biotoolsCURIE": "biotools:best_literature",
    "biotoolsID": "best_literature",
    "credit": [
        {
            "email": "kangj@korea.ac.kr",
            "name": "Jaewoo Kang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Next-Generation Biomedical Entity Search Tool for Knowledge Discovery from Biomedical Literature.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://best.korea.ac.kr/help/BEST_Guide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "http://best.korea.ac.kr/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "BEST",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0164680",
            "metadata": {
                "abstract": "© 2016 Lee et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.As the volume of publications rapidly increases, searching for relevant information from the literature becomes more challenging. To complement standard search engines such as PubMed, it is desirable to have an advanced search tool that directly returns relevant biomedical entities such as targets, drugs, and mutations rather than a long list of articles. Some existing tools submit a query to PubMed and process retrieved abstracts to extract information at query time, resulting in a slow response time and limited coverage of only a fraction of the PubMed corpus. Other tools preprocess the PubMed corpus to speed up the response time; however, they are not constantly updated, and thus produce outdated results. Further, most existing tools cannot process sophisticated queries such as searches for mutations that co-occur with query terms in the literature. To address these problems, we introduce BEST, a biomedical entity search tool. BEST returns, as a result, a list of 10 different types of biomedical entities including genes, diseases, drugs, targets, transcription factors, miRNAs, and mutations that are relevant to a user's query. To the best of our knowledge, BEST is the only system that processes free text queries and returns up-todate results in real time including mutation information in the results. BEST is freely accessible at http://best.korea.ac.kr.",
                "authors": [
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Choi J."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Jeon M."
                    },
                    {
                        "name": "Lim S."
                    },
                    {
                        "name": "Choi D."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Tan A.-C."
                    },
                    {
                        "name": "Kang J."
                    }
                ],
                "citationCount": 38,
                "date": "2016-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "BEST: Next-generation biomedical entity search tool for knowledge discovery from biomedical literature"
            },
            "pmcid": "PMC5070740",
            "pmid": "27760149"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}