{
    "additionDate": "2019-11-14T19:56:53Z",
    "biotoolsCURIE": "biotools:TCGenerators",
    "biotoolsID": "TCGenerators",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "gabriel.cardona@uib.es",
            "name": "Gabriel Cardona",
            "orcidid": "https://orcid.org/0000-0001-8845-4290",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'tree-child', 'BTC' | Generation of Binary Tree-Child phylogenetic networks | Supplementary files for \"Generation of Tree-Child phylogenetic networks\" | If you have pipenv installed, the requirements can be installed by executing pipenv install. Notice however that graphviz must be installed previously (only needed to run the Jupyter notebook). Once installed, the jupyter notebooks can be run with pipenv run jupyter-notebook, and the scripts with pipenv run python script.py | The jupyter notebook can also be run without installing anything:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (consensus)",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bielcardona/TCGenerators",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:56:53Z",
    "name": "TCGenerators",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007347",
            "metadata": {
                "abstract": "© 2019 Cardona et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Phylogenetic networks generalize phylogenetic trees by allowing the modelization of events of reticulate evolution. Among the different kinds of phylogenetic networks that have been proposed in the literature, the subclass of binary tree-child networks is one of the most studied ones. However, very little is known about the combinatorial structure of these networks. In this paper we address the problem of generating all possible binary tree-child (BTC) networks with a given number of leaves in an efficient way via reduction/augmentation operations that extend and generalize analogous operations for phylogenetic trees, and are biologically relevant. Since our solution is recursive, this also provides us with a recurrence relation giving an upper bound on the number of such networks. We also show how the operations introduced in this paper can be employed to extend the evolutive history of a set of sequences, represented by a BTC network, to include a new sequence. An implementation in python of the algorithms described in this paper, along with some computational experiments, can be downloaded from https://github.com/bielcardona/TCGenerators.",
                "authors": [
                    {
                        "name": "Cardona G."
                    },
                    {
                        "name": "Pons J.C."
                    },
                    {
                        "name": "Scornavacca C."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Generation of binary tree-child phylogenetic networks"
            },
            "pmcid": "PMC6756559",
            "pmid": "31509525"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}