
{
    "credit": [
        {
            "email": "bsherman@mail.nih.gov",
            "name": "DAVID Bioinformatic Team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://david.ncifcrf.gov/home.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Data mining",
                "uri": "http://edamontology.org/topic_3473"
            }
        ]
    },
    "publication": [
        {
            "abstract": "All tools in the DAVID Bioinformatics Resources aim to provide functional interpretation of large lists of genes derived from genomic studies. The newly updated DAVID Bioinformatics Resources consists of the DAVID Knowledgebase and five integrated, web-based functional annotation tool suites: the DAVID Gene Functional Classification Tool, the DAVID Functional Annotation Tool, the DAVID Gene ID Conversion Tool, the DAVID Gene Name Viewer and the DAVID NIAID Pathogen Genome Browser. The expanded DAVID Knowledgebase now integrates almost all major and well-known public bioinformatics resources centralized by the DAVID Gene Concept, a single-linkage method to agglomerate tens of millions of diverse gene/protein identifiers and annotation terms from a variety of public bioinformatics databases. For any uploaded gene list, the DAVID Resources now provides not only the typical gene-term enrichment analysis, but also new tools and functions that allow users to condense large gene lists into gene functional groups, convert between gene/protein identifiers, visualize many-genes-to-many-terms relationships, cluster redundant and heterogeneous terms into groups, search for interesting and related genes or terms, dynamically view genes from their lists on bio-pathways and more. With DAVID (http://david. niaid.nih.gov), investigators gain more power to interpret the biological mechanisms associated with large gene lists. © 2007 The Author(s).",
            "authors": [
                "Huang D.W.",
                "Sherman B.T.",
                "Tan Q.",
                "Kir J.",
                "Liu D.",
                "Bryant D.",
                "Guo Y.",
                "Stephens R.",
                "Baseler M.W.",
                "Lane H.C.",
                "Lempicki R.A."
            ],
            "cit_count": 803,
            "journal": "Nucleic Acids Research",
            "pmid": "17576678",
            "title": "DAVID Bioinformatics Resources: Expanded annotation database and novel algorithms to better extract biology from large gene lists",
            "year": "2007-07-01"
        },
        {
            "abstract": "BACKGROUND: Functional annotation of differentially expressed genes is a necessary and critical step in the analysis of microarray data. The distributed nature of biological knowledge frequently requires researchers to navigate through numerous web-accessible databases gathering information one gene at a time. A more judicious approach is to provide query-based access to an integrated database that disseminates biologically rich information across large datasets and displays graphic summaries of functional information. RESULTS: Database for Annotation, Visualization, and Integrated Discovery (DAVID; http://www.david.niaid.nih.gov) addresses this need via four web-based analysis modules: 1) Annotation Tool - rapidly appends descriptive data from several public databases to lists of genes; 2) GoCharts - assigns genes to Gene Ontology functional categories based on user selected classifications and term specificity level; 3) KeggCharts - assigns genes to KEGG metabolic processes and enables users to view genes in the context of biochemical pathway maps; and 4) DomainCharts - groups genes according to PFAM conserved protein domains. CONCLUSIONS: Analysis results and graphical displays remain dynamically linked to primary data and external data repositories, thereby furnishing in-depth as well as broad-based data coverage. The functionality provided by DAVID accelerates the analysis of genome-scale datasets by facilitating the transition from data collection to biological meaning.",
            "authors": [
                "Dennis Jr. G.",
                "Sherman B.T.",
                "Hosack D.A.",
                "Yang J.",
                "Gao W.",
                "Lane H.C.",
                "Lempicki R.A."
            ],
            "cit_count": 5510,
            "journal": "Genome biology",
            "pmid": "12734009",
            "title": "DAVID: Database for Annotation, Visualization, and Integrated Discovery.",
            "year": "2003-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:david_bioinformatics_resources",
        "biotoolsID": "david_bioinformatics_resources",
        "description": "The Database for Annotation, Visualization and Integrated Discovery (DAVID) provides a comprehensive set of functional annotation tools for investigators to understand biological meaning behind large list of genes.",
        "homepage": "http://david.abcc.ncifcrf.gov/home.jsp",
        "name": "DAVID Bioinformatics Resources"
    }
}