{
    "additionDate": "2020-01-09T17:47:49Z",
    "biotoolsCURIE": "biotools:DAMEfinder",
    "biotoolsID": "DAMEfinder",
    "confidence_flag": "tool",
    "description": "DAMEfinder (Differential Allele-specific MEthylation finder) is an R-package that detects allele-specific methylation (ASM) in a cohort of samples, and detects regions of differential ASM within groups of interest, based on Bisulfite-sequencing files.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "homepage": "https://github.com/markrobinsonuzh/DAMEfinder",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T18:54:35Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/markrobinsonuzh/DAMEfinder/issues"
        }
    ],
    "name": "DAMEfinder",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/800383"
        },
        {
            "doi": "10.1186/s13072-020-00346-8",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: DNA methylation is a highly studied epigenetic signature that is associated with regulation of gene expression, whereby genes with high levels of promoter methylation are generally repressed. Genomic imprinting occurs when one of the parental alleles is methylated, i.e., when there is inherited allele-specific methylation (ASM). A special case of imprinting occurs during X chromosome inactivation in females, where one of the two X chromosomes is silenced, to achieve dosage compensation between the sexes. Another more widespread form of ASM is sequence dependent (SD-ASM), where ASM is linked to a nearby heterozygous single nucleotide polymorphism (SNP). Results: We developed a method to screen for genomic regions that exhibit loss or gain of ASM in samples from two conditions (treatments, diseases, etc.). The method relies on the availability of bisulfite sequencing data from multiple samples of the two conditions. We leverage other established computational methods to screen for these regions within a new R package called DAMEfinder. It calculates an ASM score for all CpG sites or pairs in the genome of each sample, and then quantifies the change in ASM between conditions. It then clusters nearby CpG sites with consistent change into regions. In the absence of SNP information, our method relies only on reads to quantify ASM. This novel ASM score compares favorably to current methods that also screen for ASM. Not only does it easily discern between imprinted and non-imprinted regions, but also females from males based on X chromosome inactivation. We also applied DAMEfinder to a colorectal cancer dataset and observed that colorectal cancer subtypes are distinguishable according to their ASM signature. We also re-discover known cases of loss of imprinting. Conclusion: We have designed DAMEfinder to detect regions of differential ASM (DAMEs), which is a more refined definition of differential methylation, and can therefore help in breaking down the complexity of DNA methylation and its influence in development and disease.",
                "authors": [
                    {
                        "name": "Orjuela S."
                    },
                    {
                        "name": "Machlab D."
                    },
                    {
                        "name": "Menigatti M."
                    },
                    {
                        "name": "Marra G."
                    },
                    {
                        "name": "Robinson M.D."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Epigenetics and Chromatin",
                "title": "DAMEfinder: A method to detect differential allele-specific methylation"
            },
            "pmcid": "PMC7268773",
            "pmid": "32487212"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}