{
    "additionDate": "2019-11-14T18:37:23Z",
    "biotoolsCURIE": "biotools:binQTL",
    "biotoolsID": "binQTL",
    "confidence_flag": "tool",
    "description": "Mapping quantitative trait loci using binned genotypes | Precise mapping of quantitative trait loci (QTLs) is critical for assessing genetic effects and identifying candidate genes for quantitative traits. Interval and composite interval mappings have been the methods of choice for several decades, which have provided tools for identifying genomic regions harboring causal genes for quantitative traits. Historically, the concept was developed on the basis of sparse marker maps where genotypes of loci within intervals could not be observed. Currently, genomes of many organisms have been saturated with markers due to the new sequencing technologies. Genotyping by sequencing usually generates hundreds of thousands of single nucleotide polymorphisms (SNPs), which often include the causal polymorphisms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "https://github.com/venyao/binQTL",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-05T14:51:37.682135Z",
    "name": "binQTL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JGG.2019.06.005",
            "metadata": {
                "abstract": "© 2019 Institute of Genetics and Developmental Biology, Chinese Academy of Sciences, and Genetics Society of ChinaPrecise mapping of quantitative trait loci (QTLs) is critical for assessing genetic effects and identifying candidate genes for quantitative traits. Interval and composite interval mappings have been the methods of choice for several decades, which have provided tools for identifying genomic regions harboring causal genes for quantitative traits. Historically, the concept was developed on the basis of sparse marker maps where genotypes of loci within intervals could not be observed. Currently, genomes of many organisms have been saturated with markers due to the new sequencing technologies. Genotyping by sequencing usually generates hundreds of thousands of single nucleotide polymorphisms (SNPs), which often include the causal polymorphisms. The concept of interval no longer exists, prompting the necessity of a norm change in QTL mapping technology to make use of the high-volume genomic data. Here we developed a statistical method and a software package to map QTLs by binning markers into haplotype blocks, called bins. The new method detects associations of bins with quantitative traits. It borrows the mixed model methodology with a polygenic control from genome-wide association studies (GWAS) and can handle all kinds of experimental populations under the linear mixed model (LMM) framework. We tested the method using both simulated data and data from populations of rice. The results showed that this method has higher power than the current methods. An R package named binQTL is available from GitHub.",
                "authors": [
                    {
                        "name": "Yao W."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Xu S."
                    }
                ],
                "date": "2019-07-20T00:00:00Z",
                "journal": "Journal of Genetics and Genomics",
                "title": "Mapping quantitative trait loci using binned genotypes"
            },
            "pmid": "31378650"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ]
}