{
    "additionDate": "2021-01-18T11:47:50Z",
    "biotoolsCURIE": "biotools:avian-immunome-db",
    "biotoolsID": "avian-immunome-db",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rmueller@ab.mpg.de",
            "name": "Ralf C. Mueller",
            "orcidid": "https://orcid.org/0000-0002-7348-9164",
            "typeEntity": "Person"
        }
    ],
    "description": "Avian Immunome DB is a user-friendly interface for extracting genetic information about the avian immune system. The avian immune system is characterised by a cascade of complex biological processes underlaid by more than 1000 different genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://avimm.ab.mpg.de",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-29T19:40:58Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/rcmueller/immunomedb"
        }
    ],
    "name": "Avian Immunome DB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03764-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Genomic and genetic studies often require a target list of genes before conducting any hypothesis testing or experimental verification. With the ever-growing number of sequenced genomes and a variety of different annotation strategies, comes the potential for ambiguous gene symbols, making it cumbersome to capture the “correct” set of genes. In this article, we present and describe the Avian Immunome DB (Avimm) for easy gene property extraction as exemplified by avian immune genes. The avian immune system is characterised by a cascade of complex biological processes underlaid by more than 1000 different genes. It is a vital trait to study particularly in birds considering that they are a significant driver in spreading zoonotic diseases. With the completion of phase II of the B10K (“Bird 10,000 Genomes”) consortium’s whole-genome sequencing effort, we have included 363 annotated bird genomes in addition to other publicly available bird genome data which serve as a valuable foundation for Avimm. Construction and content: A relational database with avian immune gene evidence from Gene Ontology, Ensembl, UniProt and the B10K consortium has been designed and set up. The foundation stone or the “seed” for the initial set of avian immune genes is based on the well-studied model organism chicken (Gallus gallus). Gene annotations, different transcript isoforms, nucleotide sequences and protein information, including amino acid sequences, are included. Ambiguous gene names (symbols) are resolved within the database and linked to their canonical gene symbol. Avimm is supplemented by a command-line interface and a web front-end to query the database. Utility and discussion: The internal mapping of unique gene symbol identifiers to canonical gene symbols allows for an ambiguous gene property search. The database is organised within core and feature tables, which makes it straightforward to extend for future purposes. The database design is ready to be applied to other taxa or biological processes. Currently, the database contains 1170 distinct avian immune genes with canonical gene symbols and 612 synonyms across 363 bird species. While the command-line interface readily integrates into bioinformatics pipelines, the intuitive web front-end with download functionality offers sophisticated search functionalities and tracks the origin for each record. Avimm is publicly accessible at https://avimm.ab.mpg.de.",
                "authors": [
                    {
                        "name": "Eoery L."
                    },
                    {
                        "name": "Kraus R.H.S."
                    },
                    {
                        "name": "Kuo R.I."
                    },
                    {
                        "name": "Mallig N."
                    },
                    {
                        "name": "Mueller R.C."
                    },
                    {
                        "name": "Smith J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Avian Immunome DB: an example of a user-friendly interface for extracting genetic information"
            },
            "pmcid": "PMC7661159",
            "pmid": "33176685"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
