{
    "additionDate": "2020-01-14T09:27:29Z",
    "biotoolsCURIE": "biotools:GazeVisual-Lib",
    "biotoolsID": "GazeVisual-Lib",
    "confidence_flag": "tool",
    "description": "Development of Open-source Software and Gaze Data Repositories for Performance Evaluation of Eye Tracking Systems.\n\nRepository for GazeVisual performance evaluation software tools.\n\nThe GazeVisual-Lib is a repository of software tools for practical evaluation of eye trackers and gaze data quality. All codes in this repository are released under GNU General Public License v3.0",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/anuradhakar49/GazeVisual-Lib",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T19:28:00Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/anuradhakar49/GazeVisual-Lib.git"
        }
    ],
    "name": "GazeVisual-Lib",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/VISION3040055",
            "metadata": {
                "abstract": "© MDPI AG. All rights reserved.In this paper, a range of open-source tools, datasets, and software that have been developed for quantitative and in-depth evaluation of eye gaze data quality are presented. Eye tracking systems in contemporary vision research and applications face major challenges due to variable operating conditions such as user distance, head pose, and movements of the eye tracker platform. However, there is a lack of open-source tools and datasets that could be used for quantitatively evaluating an eye tracker’s data quality, comparing performance of multiple trackers, or studying the impact of various operating conditions on a tracker’s accuracy. To address these issues, an open-source code repository named GazeVisual-Lib is developed that contains a number of algorithms, visualizations, and software tools for detailed and quantitative analysis of an eye tracker’s performance and data quality. In addition, a new labelled eye gaze dataset that is collected from multiple user platforms and operating conditions is presented in an open data repository for benchmark comparison of gaze data from different eye tracking systems. The paper presents the concept, development, and organization of these two repositories that are envisioned to improve the performance analysis and reliability of eye tracking systems.",
                "authors": [
                    {
                        "name": "Corcoran P."
                    },
                    {
                        "name": "Kar A."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Vision (Switzerland)",
                "title": "Development of open-source software and gaze data repositories for performance evaluation of eye tracking systems"
            },
            "pmid": "31735856"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
