
{
    "credit": [
        {
            "email": "bibi-help@techfak.uni-bielefeld.de",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/pknotsrg/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2439"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Legacy",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Protein secondary structure",
                "uri": "http://edamontology.org/topic_3542"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            }
        ]
    },
    "publication": [
        {
            "abstract": "RNA pseudoknots are an important structural feature of RNAs, but often neglected in computer predictions for reasons of efficiency. Here, we present the pknotsRG Web Server for single sequence RNA secondary structure prediction including pseudoknots. pknotsRG employs the newest Turner energy rules for finding the structure of minimal free energy. The algorithm has been improved in several ways recently. First, it has been reimplemented in the C programming language, resulting in a 60-fold increase in speed. Second, all suboptimal foldings up to a user-defined threshold can be enumerated. For large scale analysis, a fast sliding window mode is available. Further improvements of the Web Server are a new output visualization using the PseudoViewer Web Service or RNAmovies for a movie like animation of several suboptimal foldings. The tool is available as source code, binary executable, online tool or as Web Service. The latter alternative allows for an easy integration into bioinformatics pipelines. pknotsRG is available at the Bielefeld Bioinformatics Server (http://bibiserv. techfak.uni-bielefeld.de/pknotsrg). © 2007 The Author(s).",
            "authors": [
                "Reeder J.",
                "Steffen P.",
                "Giegerich R."
            ],
            "cit_count": 79,
            "journal": "Nucleic Acids Research",
            "pmid": "17478505",
            "title": "PknotsRG: RNA pseudoknot folding including near-optimal structures and sliding windows",
            "year": "2007-07-01"
        },
        {
            "abstract": "Background: The general problem of RNA secondary structure prediction under the widely used thermodynamic model is known to be NP-complete when the structures considered include arbitrary pseudoknots. For restricted classes of pseudoknots, several polynomial time algorithms have been designed, where the O(n6)time and O(n4) space algorithm by Rivas and Eddy is currently the best available program. Results: We introduce the class of canonical simple recursive pseudoknots and present an algorithm that requires O(n4) time and O(n2) space to predict the energetically optimal structure of an RNA sequence, possible containing such pseudoknots. Evaluation against a large collection of known pseudoknotted structures shows the adequacy of the canonization approach and our algorithm. Conclusions: RNA pseudoknots of medium size can now be predicted reliably as well as efficiently by the new algorithm. © 2004 Reeder and Giegerich; licensee BioMed Central Ltd.",
            "authors": [
                "Reeder J.",
                "Giegerich R."
            ],
            "cit_count": 211,
            "journal": "BMC Bioinformatics",
            "pmid": "15294028",
            "title": "Design, implementation and evaluation of a practical pseudoknot folding algorithm based on thermodynamics",
            "year": "2004-08-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pknotsrg",
        "biotoolsID": "pknotsrg",
        "description": "Server for single sequence RNA secondary structure prediction including pseudoknots, source code, binary executable, and web service available.",
        "homepage": "http://bibiserv.techfak.uni-bielefeld.de/pknotsrg/",
        "name": "pknotsRG"
    }
}