{
    "additionDate": "2021-01-20T10:52:59Z",
    "biotoolsCURIE": "biotools:anonimme",
    "biotoolsID": "anonimme",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bristena.oprisanu.10@ucl.ac.uk",
            "name": "Bristena Oprisanu",
            "typeEntity": "Person"
        }
    ],
    "description": "Bringing anonymity to the Matchmaker Exchange platform for rare disease gene discovery.\n\nAdvances in genome sequencing and genomics research are bringing us closer to a new era of personalized medicine, where healthcare can be tailored to the individual's genetic makeup and to more effective diagnosis and treatment of rare genetic diseases. Much of this progress depends on collaborations and access to data, thus, a number of initiatives have been introduced to support seamless data sharing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bristena-op/AnoniMME",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-05-13T06:32:33Z",
    "name": "AnoniMME",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTY269",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved.Advances in genome sequencing and genomics research are bringing us closer to a new era of personalized medicine, where healthcare can be tailored to the individual?s genetic makeup and to more effective diagnosis and treatment of rare genetic diseases. Much of this progress depends on collaborations and access to data, thus, a number of initiatives have been introduced to support seamless data sharing. Among these, the Global Alliance for Genomics and Health has developed and operates a platform, called Matchmaker Exchange (MME), which allows researchers to perform queries for rare genetic disease discovery over multiple federated databases. Queries include gene variations which are linked to rare diseases, and the ability to find other researchers that have seen or have interest in those variations is extremely valuable. Nonetheless, in some cases, researchers may be reluctant to use the platform since the queries they make (thus, what they are working on) are revealed to other researchers, and this creates concerns with respect to privacy and competitive advantage. In this paper, we present AnoniMME, a framework geared to enable anonymous queries within the MME platform. The framework, building on a cryptographic primitive called Reverse Private Information Retrieval, let researchers anonymously query the federated platform, in a multi-server setting?specifically, they write their query, along with a public encryption key, anonymously in a public database. Responses are also supported, so that other researchers can respond to queries by providing their encrypted contact details.",
                "authors": [
                    {
                        "name": "Oprisanu B."
                    },
                    {
                        "name": "De Cristofaro E."
                    }
                ],
                "citationCount": 2,
                "date": "2018-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AnoniMME: Bringing anonymity to the Matchmaker Exchange platform for rare disease gene discovery"
            },
            "pmcid": "PMC6022625",
            "pmid": "29949992"
        }
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ]
}