{
    "additionDate": "2020-01-14T08:54:14Z",
    "biotoolsCURIE": "biotools:Genome3D",
    "biotoolsID": "Genome3D",
    "confidence_flag": "tool",
    "description": "integrating a collaborative data pipeline to expand the depth and breadth of consensus protein structure annotation.\n\nGenome3D Annotating Genomes with Structures.\n\nSearch Genome3D find structural annotations for your proteins.\n\nTool to interact with the Genome3D API.\n\nGenome3D provides consensus structural annotations and 3D models for sequences from model organisms, including human. These data are generated by several UK based resources in the Genome3D consortium: SCOP, CATH, SUPERFAMILY, Gene3D, FUGUE, THREADER, PHYRE.\n\nThe tool genome3d-api aims to make communicating with the Genome3D API as convenient as possible. However, since the API has been defined using OpenAPI standards, you should be able to point any OpenAPI compatible client to the following specification:",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://www.genome3d.eu/api"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "ftp://orengoftp.biochem.ucl.ac.uk/genome3d/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://www.genome3d.eu",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-03T08:23:37Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://uclorengogroup.github.io/genome3d-openapi-client/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/UCLOrengoGroup/genome3d-openapi-client"
        }
    ],
    "name": "Genome3D",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ967",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Genome3D (https://www.genome3d.eu) is a freely available resource that provides consensus structural annotations for representative protein sequences taken from a selection of model organisms. Since the last NAR update in 2015, the method of data submission has been overhauled, with annotations now being 'pushed' to the database via an API. As a result, contributing groups are now able to manage their own structural annotations, making the resource more flexible and maintainable. The new submission protocol brings a number of additional benefits including: providing instant validation of data and avoiding the requirement to synchronise releases between resources. It also makes it possible to implement the submission of these structural annotations as an automated part of existing internal workflows. In turn, these improvements facilitate Genome3D being opened up to new prediction algorithms and groups. For the latest release of Genome3D (v2.1), the underlying dataset of sequences used as prediction targets has been updated using the latest reference proteomes available in UniProtKB. A number of new reference proteomes have also been added of particular interest to the wider scientific community: cow, pig, wheat and mycobacterium tuberculosis. These additions, along with improvements to the underlying predictions from contributing resources, has ensured that the number of annotations in Genome3D has nearly doubled since the last NAR update article. The new API has also been used to facilitate the dissemination of Genome3D data into InterPro, thereby widening the visibility of both the annotation data and annotation algorithms.",
                "authors": [
                    {
                        "name": "Sillitoe I."
                    },
                    {
                        "name": "Andreeva A."
                    },
                    {
                        "name": "Blundell T.L."
                    },
                    {
                        "name": "Buchan D.W.A."
                    },
                    {
                        "name": "Finn R.D."
                    },
                    {
                        "name": "Gough J."
                    },
                    {
                        "name": "Jones D."
                    },
                    {
                        "name": "Kelley L.A."
                    },
                    {
                        "name": "Paysan-Lafosse T."
                    },
                    {
                        "name": "Lam S.D."
                    },
                    {
                        "name": "Murzin A.G."
                    },
                    {
                        "name": "Pandurangan A.P."
                    },
                    {
                        "name": "Salazar G.A."
                    },
                    {
                        "name": "Skwark M.J."
                    },
                    {
                        "name": "Sternberg M.J.E."
                    },
                    {
                        "name": "Velankar S."
                    },
                    {
                        "name": "Orengo C."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Genome3D: Integrating a collaborative data pipeline to expand the depth and breadth of consensus protein structure annotation"
            },
            "pmid": "31733063"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}