{"credit":[{"email":"ashutosh.singh@snu.edu.in","name":"Ashutosh Singh","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"bb284@snu.edu.in","name":"Basharat Ahmad Bhat","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"gs959@snu.edu.in","name":"Garima Singh","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://lms.snu.edu.in/TM-Aligner/tutorial.php"}],"function":[{"operation":[{"term":"Multiple sequence alignment","uri":"http://edamontology.org/operation_0492"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Membrane and lipoproteins","uri":"http://edamontology.org/topic_0820"}]},"publication":[{"abstract":"© 2017 The Author(s). Membrane proteins plays significant role in living cells. Transmembrane proteins are estimated to constitute approximately 30% of proteins at genomic scale. It has been a difficult task to develop specific alignment tools for transmembrane proteins due to limited number of experimentally validated protein structures. Alignment tools based on homology modeling provide fairly good result by recapitulating 70-80% residues in reference alignment provided all input sequences should have known template structures. However, homology modeling tools took substantial amount of time, thus aligning large numbers of sequences becomes computationally demanding. Here we present TM-Aligner, a new tool for transmembrane protein sequence alignment. TM-Aligner is based on Wu-Manber and dynamic string matching algorithm which has significantly improved its accuracy and speed of multiple sequence alignment. We compared TM-Aligner with prevailing other popular tools and performed benchmarking using three separate reference sets, BaliBASE3.0 reference set7 of alpha-helical transmembrane proteins, structure based alignment of transmembrane proteins from Pfam database and structure alignment from GPCRDB. Benchmarking against reference datasets indicated that TM-Aligner is more advanced method having least turnaround time with significant improvements over the most accurate methods such as PROMALS, MAFFT, TM-Coffee, Kalign, ClustalW, Muscle and PRALINE. TM-Aligner is freely available through http://lms.snu.edu.in/TM-Aligner/.","authors":["Bhat B.","Ganai N.A.","Andrabi S.M.","Shah R.A.","Singh A."],"cit_count":2,"doi":"10.1038/s41598-017-13083-y","journal":"Scientific Reports","title":"TM-Aligner: Multiple sequence alignment tool for transmembrane proteins with reduced time and improved accuracy","year":"2017-12-01"}],"summary":{"biotoolsCURIE":"biotools:tm-aligner","biotoolsID":"tm-aligner","description":"Multiple sequence alignment tool for transmembrane proteins with reduced time and improved accuracy.","homepage":"http://lms.snu.edu.in/TM-Aligner/","name":"TM-Aligner"}}