{
    "additionDate": "2020-01-14T09:22:56Z",
    "biotoolsCURIE": "biotools:FosSahul",
    "biotoolsID": "FosSahul",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "katharina.peters@flinders.edu.au",
            "name": "Katharina J. Peters",
            "orcidid": "https://orcid.org/0000-0002-5967-0928",
            "typeEntity": "Person"
        }
    ],
    "description": "A database for the late quaternary fossil records of Sahul along with data processing scripts.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/GlobalEcologyFlinders/FosSahul",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-11T13:33:31Z",
    "name": "FosSahul",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41597-019-0267-3",
            "metadata": {
                "abstract": "© 2019, The Author(s).The 2016 version of the FosSahul database compiled non-human vertebrate megafauna fossil ages from Sahul published up to 2013 in a standardized format. Its purpose was to create a publicly available, centralized, and comprehensive database for palaeoecological investigations of the continent. Such databases require regular updates and improvements to reflect recent scientific findings. Here we present an updated FosSahul (2.0) containing 11,871 dated non-human vertebrate fossil records from the Late Quaternary published up to 2018. Furthermore, we have extended the information captured in the database to include methodological details and have developed an algorithm to automate the quality-rating process. The algorithm makes the quality-rating more transparent and easier to reproduce, facilitating future database extensions and dissemination. FosSahul has already enabled several palaeoecological analyses, and its updated version will continue to provide a centralized organisation of Sahul’s fossil records. As an example of an application of the database, we present the temporal pattern in megafauna genus richness inferred from available data in relation to palaeoclimate indices over the past 180,000 years.",
                "authors": [
                    {
                        "name": "Bradshaw C.J.A."
                    },
                    {
                        "name": "Friedrich T."
                    },
                    {
                        "name": "Jacobs Z."
                    },
                    {
                        "name": "McDowell M."
                    },
                    {
                        "name": "Peters K.J."
                    },
                    {
                        "name": "Saltre F."
                    },
                    {
                        "name": "Ulm S."
                    },
                    {
                        "name": "Wood R."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "FosSahul 2.0, an updated database for the Late Quaternary fossil records of Sahul"
            },
            "pmcid": "PMC6864098",
            "pmid": "31745083"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}
