{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:48:22Z",
    "biotoolsCURIE": "biotools:fisher-exact-mid-p-method",
    "biotoolsID": "fisher-exact-mid-p-method",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Steinar Thorvaldsen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/2656487-steinar-thorvaldsen"
        }
    ],
    "description": "Fisher's Exact mid-P method to test row/col independence of a 2x2 contingency table.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/29819-fisher-s-exact-with-mid-p-method",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-07T18:40:19Z",
    "name": "Fishers Exact with mid-P",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-573",
            "metadata": {
                "abstract": "Background: Statistical bioinformatics is the study of biological data sets obtained by new micro-technologies by means of proper statistical methods. For a better understanding of environmental adaptations of proteins, orthologous sequences from different habitats may be explored and compared. The main goal of the DeltaProt Toolbox is to provide users with important functionality that is needed for comparative screening and studies of extremophile proteins and protein classes. Visualization of the data sets is also the focus of this article, since visualizations can play a key role in making the various relationships transparent. This application paper is intended to inform the reader of the existence, functionality, and applicability of the toolbox.Results: We present the DeltaProt Toolbox, a software toolbox that may be useful in importing, analyzing and visualizing data from multiple alignments of proteins. The toolbox has been written in MATLAB™ to provide an easy and user-friendly platform, including a graphical user interface, while ensuring good numerical performance. Problems in genome biology may be easily stated thanks to a compact input format. The toolbox also offers the possibility of utilizing structural information from the SABLE or other structure predictors. Different sequence plots can then be viewed and compared in order to find their similarities and differences. Detailed statistics are also calculated during the procedure.Conclusions: The DeltaProt package is open source and freely available for academic, non-commercial use. The latest version of DeltaProt can be obtained from http://services.cbu.uib.no/software/deltaprot/. The website also contains documentation, and the toolbox comes with real data sets that are intended for training in applying the models to carry out bioinformatical and statistical analyses of protein sequences.Equipped with the new algorithms proposed here, DeltaProt serves as an auxiliary analysis tool capable of visualizing and comparing orthologus protein sequences. The framework of the algorithms also enables easy incorporation of extra information on structure, if such data is available. © 2010 Thorvaldsen et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Fla T."
                    },
                    {
                        "name": "Thorvaldsen S."
                    },
                    {
                        "name": "Willassen N.P."
                    }
                ],
                "citationCount": 10,
                "date": "2010-11-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeltaProt: A software toolbox for comparative genomics"
            },
            "pmcid": "PMC3001747",
            "pmid": "21092291",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "deltaprot",
            "type": "includedIn"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "version": [
        "1.0.0.0"
    ]
}
