{
    "accessibility": "Open access",
    "additionDate": "2021-10-22T14:16:11.957311Z",
    "biotoolsCURIE": "biotools:redcm",
    "biotoolsID": "redcm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "aranyi.csaba@med.unideb.hu",
            "name": "Sándor Csaba Aranyi",
            "typeEntity": "Person"
        },
        {
            "name": "Ervin Berényi"
        },
        {
            "name": "Gábor Opposits"
        },
        {
            "name": "Marianna Nagy"
        },
        {
            "name": "Miklós Emri"
        }
    ],
    "description": "Characterizing Network Search Algorithms Developed for Dynamic Causal Modeling.",
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/aranyics/ReDCM/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aranyics/ReDCM",
    "language": [
        "C",
        "Other",
        "R"
    ],
    "lastUpdate": "2021-10-22T14:16:11.959826Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/aranyics/ReDCM"
        }
    ],
    "name": "ReDCM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINF.2021.656486",
            "metadata": {
                "abstract": "© Copyright © 2021 Aranyi, Nagy, Opposits, Berényi and Emri.Dynamic causal modeling (DCM) is a widely used tool to estimate the effective connectivity of specified models of a brain network. Finding the model explaining measured data is one of the most important outstanding problems in Bayesian modeling. Using heuristic model search algorithms enables us to find an optimal model without having to define a model set a priori. However, the development of such methods is cumbersome in the case of large model-spaces. We aimed to utilize commonly used graph theoretical search algorithms for DCM to create a framework for characterizing them, and to investigate relevance of such methods for single-subject and group-level studies. Because of the enormous computational demand of DCM calculations, we separated the model estimation procedure from the search algorithm by providing a database containing the parameters of all models in a full model-space. For test data a publicly available fMRI dataset of 60 subjects was used. First, we reimplemented the deterministic bilinear DCM algorithm in the ReDCM R package, increasing computational speed during model estimation. Then, three network search algorithms have been adapted for DCM, and we demonstrated how modifications to these methods, based on DCM posterior parameter estimates, can enhance search performance. Comparison of the results are based on model evidence, structural similarities and the number of model estimations needed during search. An analytical approach using Bayesian model reduction (BMR) for efficient network discovery is already available for DCM. Comparing model search methods we found that topological algorithms often outperform analytical methods for single-subject analysis and achieve similar results for recovering common network properties of the winning model family, or set of models, obtained by multi-subject family-wise analysis. However, network search methods show their limitations in higher level statistical analysis of parametric empirical Bayes. Optimizing such linear modeling schemes the BMR methods are still considered the recommended approach. We envision the freely available database of estimated model-spaces to help further studies of the DCM model-space, and the ReDCM package to be a useful contribution for Bayesian inference within and beyond the field of neuroscience.",
                "authors": [
                    {
                        "name": "Aranyi S.C."
                    },
                    {
                        "name": "Berenyi E."
                    },
                    {
                        "name": "Emri M."
                    },
                    {
                        "name": "Nagy M."
                    },
                    {
                        "name": "Opposits G."
                    }
                ],
                "date": "2021-06-10T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Characterizing Network Search Algorithms Developed for Dynamic Causal Modeling"
            },
            "pmcid": "PMC8222613",
            "pmid": "34177506"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
