{
    "additionDate": "2017-02-14T09:36:12Z",
    "biotoolsCURIE": "biotools:um-pps",
    "biotoolsID": "um-pps",
    "credit": [
        {
            "email": "bbd@eawag.ch",
            "name": "Kathrin Fenner, EAWAG-BBD Director",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The University of Minnesota Pathway Prediction System (UM-PPS) is a web tool that recognizes functional groups in organic compounds that are potential targets of microbial catabolic reactions and predicts transformations of these groups based on biotransformation rules. Multi-level predictions are made.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://eawag-bbd.ethz.ch/predict/aboutPPS.html#demo"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://eawag-bbd.ethz.ch/predict/aboutPPS.html",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "UM-PPS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The University of Minnesota pathway prediction system (UM-PPS, http://umbbd.msi.umn.edu/predict/) recognizes functional groups in organic compounds that are potential targets of microbial catabolic reactions, and predicts transformations of these groups based on biotransformation rules. Rules are based on the University of Minnesota biocatalysis/biodegradation database (http://umbbd.msi.umn.edu/) and the scientific literature. As rules were added to the UM-PPS, more of them were triggered at each prediction step. The resulting combinatorial explosion is being addressed in four ways. Biodegradation experts give each rule an aerobic likelihood value of Very Likely, Likely, Neutral, Unlikely or Very Unlikely. Users now can choose whether they view all, or only the more aerobically likely, predicted transformations. Relative reasoning, allowing triggering of some rules to inhibit triggering of others, was implemented. Rules were initially assigned to individual chemical reactions. In selected cases, these have been replaced by super rules, which include two or more contiguous reactions that form a small pathway of their own. Rules are continually modified to improve the prediction accuracy; increasing rule stringency can improve predictions and reduce extraneous choices. The UM-PPS is freely available to all without registration. Its value to the scientific community, for academic, industrial and government use, is good and will only increase.",
                "authors": [
                    {
                        "name": "Ellis L.B."
                    },
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Fenner K."
                    },
                    {
                        "name": "Wackett L.P."
                    }
                ],
                "citationCount": 68,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "The University of Minnesota pathway prediction system: predicting metabolic logic."
            },
            "pmid": "18524801"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}