
{
    "credit": [
        {
            "email": "mahony@mit.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "shaun.mahony@nuigalway.ie",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinf.nuigalway.ie/RescueNet/"
        },
        {
            "type": "User manual",
            "url": "http://bioinf.nuigalway.ie/RescueNet/manual_index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage analysis",
                    "uri": "http://edamontology.org/operation_0286"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rescuenet-0-91-codon-usage-anaysis-gene-prediction.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Many current gene prediction methods use only one model to represent protein-coding regions in a genome, and so are less likely to predict the location of genes that have an atypical sequence composition. It is likely that future improvements in gene finding will involve the development of methods that can adequately deal with intra-genomic compositional variation. Results: This work explores a new approach to gene-prediction, based on the Self-Organizing Map, which has the ability to automatically identify multiple gene models within a genome. The current implementation, named RescueNet, uses relative synonymous codon usage as the indicator of protein-coding potential. Conclusions: While its raw accuracy rate can be less than other methods, RescueNet consistently identifies some genes that other methods do not, and should therefore be of interest to geneprediction software developers and genome annotation teams alike. RescueNet is recommended for use in conjunction with, or as a complement to, other gene prediction methods. © 2004 Mahony et al; licensee BioMed Central Ltd.",
            "authors": [
                "Mahony S.",
                "McInerney J.O.",
                "Smith T.J.",
                "Golden A."
            ],
            "cit_count": 18,
            "journal": "BMC Bioinformatics",
            "pmid": "15070404",
            "title": "Gene prediction using the Self-Organizing Map: Automatic generation of multiple gene models",
            "year": "2004-03-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rescuenet",
        "biotoolsID": "rescuenet",
        "description": "An application that uses the Self-Organizing Map neural network algorithm for codon usage anaysis and gene-prediction. In its gene prediction functionality, RescueNet can estimate multiple models of gene codon usage properties during training. This offers advantageous gene-finding performance in cases where a diverse number of codon usage patterns are displayed.",
        "homepage": "http://bioinf.nuigalway.ie/RescueNet/",
        "name": "RescueNet"
    }
}