{
    "additionDate": "2021-11-05T11:36:11.893764Z",
    "biotoolsCURIE": "biotools:easy2hard",
    "biotoolsID": "easy2hard",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Yidan Feng",
            "orcidid": "https://orcid.org/0000-0001-7208-0458"
        }
    ],
    "description": "Learning to Solve the Intractables From a Synthetic Dataset for Structure-Preserving Image Smoothing.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/YidFeng/Easy2Hard",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-11-05T11:36:11.896442Z",
    "name": "Easy2Hard",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2021.3084473",
            "metadata": {
                "abstract": "IEEEImage smoothing is a prerequisite for many computer vision and graphics applications. In this article, we raise an intriguing question whether a dataset that semantically describes meaningful structures and unimportant details can facilitate a deep learning model to smooth complex natural images. To answer it, we generate ground-truth labels from easy samples by candidate generation and a screening test and synthesize hard samples in structure-preserving smoothing by blending intricate and multifarious details with the labels. To take full advantage of this dataset, we present a joint edge detection and structure-preserving image smoothing neural network (JESS-Net). Moreover, we propose the distinctive total variation loss as prior knowledge to narrow the gap between synthetic and real data. Experiments on different datasets and real images show clear improvements of our method over the state of the arts in terms of both the image cleanness and structure-preserving ability. Code and dataset are available at https://github.com/YidFeng/Easy2Hard.",
                "authors": [
                    {
                        "name": "Feng Y."
                    },
                    {
                        "name": "Deng S."
                    },
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Wei M."
                    },
                    {
                        "name": "Liu L."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "Easy2Hard: Learning to Solve the Intractables From a Synthetic Dataset for Structure-Preserving Image Smoothing"
            },
            "pmid": "34111004"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}