
{
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bio3d.colorado.edu/imod/"
        }
    ],
    "function": [
        {
            "note": "IMOD is a set of image processing, modelling and display programs used for tomographic reconstruction and for 3D reconstruction of EM serial sections and optical sections. The package contains tools for assembling and aligning data within multiple types and sizes of image stacks, viewing 3-D data from any orientation, and modelling and display of the image files.Requires third party software. The eTomo program for building tomograms requires a Java run-time environment. Links to Java packages for Linux and Windows on the Download page. The GNU Java version that comes in Fedora Core does not work for eTomo. Windows version requires installation of a Unix toolkit called Cygwin.",
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Instruct"
        ],
        "cost": "Free of charge",
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Workbench"
        ],
        "topic": [
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            },
            {
                "term": "Electron microscopy",
                "uri": "http://edamontology.org/topic_0611"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We have developed a computer software package, IMOD, as a tool for analyzing and viewing three-dimensional biological image data. IMOD is useful for studying and modeling data from tomographic, serial section, and optical section reconstructions. The software allows image data to be visualized by several different methods. Models of the image data can be visualized by volume or contour surface rendering and can yield quantitative information.",
            "authors": [
                "Kremer J.R.",
                "Mastronarde D.N.",
                "McIntosh J.R."
            ],
            "cit_count": 2337,
            "doi": "10.1006/jsbi.1996.0013",
            "journal": "Journal of Structural Biology",
            "title": "Computer visualization of three-dimensional image data using IMOD",
            "type": "Primary",
            "year": "1996-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:imod",
        "biotoolsID": "imod",
        "description": "Set of image processing, modelling and display programs used for tomographic reconstruction and for 3D reconstruction of EM serial sections and optical sections.",
        "homepage": "http://bio3d.colorado.edu/imod/",
        "name": "IMOD",
        "version": [
            "1"
        ]
    }
}