{
    "accessibility": "Open access",
    "additionDate": "2020-02-10T12:59:34Z",
    "biotoolsCURIE": "biotools:SpliceVec-g",
    "biotoolsID": "SpliceVec-g",
    "confidence_flag": "tool",
    "description": "SpliceVec: Distributed feature representations for splice junction prediction",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aaiitggrp/SpliceVec-g",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:27Z",
    "name": "SpliceVec-g",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.aparajita",
    "publication": [
        {
            "doi": "10.1016/j.compbiolchem.2018.03.009",
            "metadata": {
                "abstract": "© 2018 Elsevier LtdIdentification of intron boundaries, called splice junctions, is an important part of delineating gene structure and functions. This also provides valuable insights into the role of alternative splicing in increasing functional diversity of genes. Identification of splice junctions through RNA-seq is by mapping short reads to the reference genome which is prone to errors due to random sequence matches. This encourages identification of splicing junctions through computational methods based on machine learning. Existing models are dependent on feature extraction and selection for capturing splicing signals lying in the vicinity of splice junctions. But such manually extracted features are not exhaustive. We introduce distributed feature representation, SpliceVec, to avoid explicit and biased feature extraction generally adopted for such tasks. SpliceVec is based on two widely used distributed representation models in natural language processing. Learned feature representation in form of SpliceVec is fed to multilayer perceptron for splice junction classification task. An intrinsic evaluation of SpliceVec indicates that it is able to group true and false sites distinctly. Our study on optimal context to be considered for feature extraction indicates inclusion of entire intronic sequence to be better than flanking upstream and downstream region around splice junctions. Further, SpliceVec is invariant to canonical and non-canonical splice junction detection. The proposed model is consistent in its performance even with reduced dataset and class-imbalanced dataset. SpliceVec is computationally efficient and can be trained with user-defined data as well.",
                "authors": [
                    {
                        "name": "Dutta A."
                    },
                    {
                        "name": "Dubey T."
                    },
                    {
                        "name": "Singh K.K."
                    },
                    {
                        "name": "Anand A."
                    }
                ],
                "citationCount": 8,
                "date": "2018-06-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "SpliceVec: Distributed feature representations for splice junction prediction"
            },
            "pmid": "29580738"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}