{
    "additionDate": "2021-01-18T09:43:19Z",
    "biotoolsCURIE": "biotools:itr",
    "biotoolsID": "itr",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jin Zhou",
            "typeEntity": "Person"
        }
    ],
    "description": "An Algorithm for Generating Individualized Treatment Decision Trees and Random Forests.\n\nITR-Forest is used to generate individualized treatment rule (ITR) for both randomized clinical trail data and observational study.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kdoub5ha/ITR.Forest",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T10:44:54Z",
    "name": "ITR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1080/10618600.2018.1451337",
            "metadata": {
                "abstract": "© 2018, © 2018 American Statistical Association, Institute of Mathematical Statistics, and Interface Foundation of North America.With new treatments and novel technology available, precision medicine has become a key topic in the new era of healthcare. Traditional statistical methods for precision medicine focus on subgroup discovery through identifying interactions between a few markers and treatment regimes. However, given the large scale and high dimensionality of modern datasets, it is difficult to detect the interactions between treatment and high-dimensional covariates. Recently, novel approaches have emerged that seek to directly estimate individualized treatment rules (ITR) via maximizing the expected clinical reward by using, for example, support vector machines (SVM) or decision trees. The latter enjoys great popularity in clinical practice due to its interpretability. In this article, we propose a new reward function and a novel decision tree algorithm to directly maximize rewards. We further improve a single tree decision rule by an ensemble decision tree algorithm, ITR random forests. Our final decision rule is an average over single decision trees and it is a soft probability rather than a hard choice. Depending on how strong the treatment recommendation is, physicians can make decisions based on our model along with their own judgment and experience. Performance of ITR forest and tree methods is assessed through simulations along with applications to a randomized controlled trial (RCT) of 1385 patients with diabetes and an EMR cohort of 5177 patients with diabetes. ITR forest and tree methods are implemented using statistical software R (https://github.com/kdoub5ha/ITR.Forest). Supplementary materials for this article are available online.",
                "authors": [
                    {
                        "name": "Doubleday K."
                    },
                    {
                        "name": "Zhou H."
                    },
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 4,
                "date": "2018-10-02T00:00:00Z",
                "journal": "Journal of Computational and Graphical Statistics",
                "title": "An Algorithm for Generating Individualized Treatment Decision Trees and Random Forests"
            },
            "pmcid": "PMC7286561",
            "pmid": "32523325"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}