{
    "additionDate": "2019-11-14T18:02:22Z",
    "biotoolsCURIE": "biotools:DecoMetDIA",
    "biotoolsID": "DecoMetDIA",
    "confidence_flag": "tool",
    "description": "Deconvolution of Multiplexed MS/MS Spectra for Metabolite Identification in SWATH-MS-Based Untargeted Metabolomics | DecoMetDIA was developed to process SWATH-MS based data for metabolomics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ZhuMSLab/DecoMetDIA",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-17T14:56:29Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ZhuMSLab/DecoMetDIA/issues"
        }
    ],
    "name": "DecoMetDIA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.9B02655",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.SWATH-MS-based data-independent acquisition mass spectrometry (DIA-MS) technology has been recently developed for untargeted metabolomics due to its capability to acquire all MS2 spectra with high quantitative accuracy. However, software tools for deconvolving multiplexed MS/MS spectra from SWATH-MS with high efficiency and high quality are still lacking in untargeted metabolomics. Here, we developed a new software tool, namely, DecoMetDIA, to deconvolve multiplexed MS/MS spectra for metabolite identification and support the SWATH-based untargeted metabolomics. In DecoMetDIA, multiple model peaks are selected to model the coeluted and unresolved chromatographic peaks of fragment ions in multiplexed spectra and decompose them into a linear combination of the model peaks. DecoMetDIA enabled us to reconstruct the MS2 spectra of metabolites from a variety of different biological samples with high coverages. We also demonstrated that the deconvolved MS2 spectra from DecoMetDIA were of high accuracy through comparison to the experimental MS2 spectra from data-dependent acquisition (DDA). Finally, about 90% of deconvolved MS2 spectra in various biological samples were successfully annotated using software tools such as MetDNA and Sirius. The results demonstrated that the deconvolved MS2 spectra obtained from DecoMetDIA were accurate and valid for metabolite identification and structural elucidation. The comparison of DecoMetDIA to other deconvolution software such as MS-DIAL demonstrated that it performs very well for small polar metabolites. DecoMetDIA software is freely available at https://github.com/ZhuMSLab/DecoMetDIA.",
                "authors": [
                    {
                        "name": "Yin Y."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Zhu Z.-J."
                    }
                ],
                "citationCount": 14,
                "date": "2019-09-17T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "DecoMetDIA: Deconvolution of Multiplexed MS/MS Spectra for Metabolite Identification in SWATH-MS-Based Untargeted Metabolomics"
            },
            "pmid": "31436405"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Analytical chemistry",
            "uri": "http://edamontology.org/topic_3370"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}