{
    "additionDate": "2017-08-03T19:06:47Z",
    "biotoolsCURIE": "biotools:mpoptag",
    "biotoolsID": "mpoptag",
    "credit": [
        {
            "email": "xuz@niehs.nih.gov",
            "name": "Zongli Xu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.niehs.nih.gov/research/atniehs/labs/epi/molecular/index.cfm"
        },
        {
            "email": "taylor@niehs.nih.gov",
            "name": "Jack Taylor",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.niehs.nih.gov/research/resources/software/epidemiology/mpoptag/index.cfm"
        }
    ],
    "description": "Tool used to select or evaluate linkage disequilibrium (LD) tag SNPs for multiple populations. The program analyzes patterns of LD–measured by composite linkage disequilibrium (CLD) or r2–between polymorphic sites in a genome region for multiple populations. It also uses an agreedy algorithm to select a single set of near-minimum numbers of LD tag SNPs for multiple populations.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://www.niehs.nih.gov/research/resources/assets/docs/manual_508.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://www.niehs.nih.gov/research/resources/software/epidemiology/mpoptag/index.cfm",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mpoptag-multi-population-tag-snp-picker.html"
        }
    ],
    "name": "mPopTag",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "HapMap provides linkage disequilibrium (LD) information on a sample of 3.7 million SNPs that can be used for tag SNP selection in whole-genome association studies. HapMap can also be used for tag SNP selection in candidate genes, although its performance has yet to be evaluated against gene resequencing data, where there is near-complete SNP ascertainment. The Environmental Genome Project (EGP) is the largest gene resequencing effort to date with over 500 resequenced genes. We used HapMap data to select tag SNPs and calculated the proportions of common SNPs (MAF ≥ 0.05) tagged (ρ2≥ 0.8) for each of 127 EGP Panel 2 genes where individual ethnic information was available. Median gene-tagging proportions are 50, 80 and 74% for African, Asian, and European groups, respectively. These low gene-tagging proportions may be problematic for some candidate gene studies. In addition, although HapMap targeted nonsynonymous SNPs (nsSNPs), we estimate only ∼ 30% of nonsynonymous SNPs in EGP are in high LD with any HapMap SNP. We show that gene-tagging proportions can be improved by adding a relatively small number of tag SNPs that were selected based on resequencing data. We also demonstrate that ethnic-mixed data can be used to improve HapMap gene-tagging proportions, but are not as efficient as ethnic-specific data. Finally, we generalized the greedy algorithm proposed by Carlson et al (2004) to select tag SNPs for multiple populations and implemented the algorithm into a freely available software package mPopTag.",
                "authors": [
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Kaplan N.L."
                    },
                    {
                        "name": "Taylor J.A."
                    }
                ],
                "citationCount": 32,
                "date": "2007-10-01T00:00:00Z",
                "journal": "European Journal of Human Genetics",
                "title": "Tag SNP selection for candidate gene association studies using HapMap and gene resequencing data"
            },
            "pmid": "17568388"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}