{
    "additionDate": "2024-07-18T09:40:55.233122Z",
    "biotoolsCURIE": "biotools:varista",
    "biotoolsID": "varista",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "obirk@bgu.ac.il",
            "name": "Ohad S Birk",
            "orcidid": "https://orcid.org/0000-0003-1430-1296",
            "typeEntity": "Person"
        }
    ],
    "description": "Free web platform for streamlined whole-genome variant analysis across T2T, hg38, and hg19.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://VARista.link",
    "lastUpdate": "2024-07-18T09:40:55.235192Z",
    "name": "VARista",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s00439-024-02671-4",
            "metadata": {
                "abstract": "With the increasing importance of genomic data in understanding genetic diseases, there is an essential need for efficient and user-friendly tools that simplify variant analysis. Although multiple tools exist, many present barriers such as steep learning curves, limited reference genome compatibility, or costs. We developed VARista, a free web-based tool, to address these challenges and provide a streamlined solution for researchers, particularly those focusing on rare monogenic diseases. VARista offers a user-centric interface that eliminates much of the technical complexity typically associated with variant analysis. The tool directly supports VCF files generated using reference genomes hg19, hg38, and the emerging T2T, with seamless remapping capabilities between them. Features such as gene summaries and links, tissue and cell-specific gene expression data for both adults and fetuses, as well as automated PCR design and integration with tools such as SpliceAI and AlphaMissense, enable users to focus on the biology and the case itself. As we demonstrate, VARista proved effective in narrowing down potential disease-causing variants, prioritizing them effectively, and providing meaningful biological context, facilitating rapid decision-making. VARista stands out as a freely available and comprehensive tool that consolidates various aspects of variant analysis into a single platform that embraces the forefront of genomic advancements. Its design inherently supports a shift in focus from technicalities to critical thinking, thereby promoting better-informed decisions in genetic disease research. Given its unique capabilities and user-centric design, VARista has the potential to become an essential asset for the genomic research community. https://VARista.link.",
                "authors": [
                    {
                        "name": "Agam N."
                    },
                    {
                        "name": "Aharoni S."
                    },
                    {
                        "name": "Aminov I."
                    },
                    {
                        "name": "Birk O.S."
                    },
                    {
                        "name": "Dolgin V."
                    },
                    {
                        "name": "Drabkin M."
                    },
                    {
                        "name": "Eskin-Schwartz M."
                    },
                    {
                        "name": "Freund O."
                    },
                    {
                        "name": "Gombosh M."
                    },
                    {
                        "name": "Hadar N."
                    },
                    {
                        "name": "Halperin D."
                    },
                    {
                        "name": "Jean M.M."
                    },
                    {
                        "name": "Narkis G."
                    },
                    {
                        "name": "Oustinov K."
                    },
                    {
                        "name": "Poleg T."
                    },
                    {
                        "name": "Proskorovski-Ohayon R."
                    },
                    {
                        "name": "Safran A."
                    },
                    {
                        "name": "Sued-Hendrickson S."
                    },
                    {
                        "name": "Wormser O."
                    },
                    {
                        "name": "Yogev Y."
                    }
                ],
                "date": "2024-05-01T00:00:00Z",
                "journal": "Human Genetics",
                "title": "VARista: a free web platform for streamlined whole-genome variant analysis across T2T, hg38, and hg19"
            },
            "pmid": "38607411"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Molecular medicine",
            "uri": "http://edamontology.org/topic_3388"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
