{
    "accessibility": "Open access",
    "additionDate": "2022-02-17T15:30:59.440512Z",
    "biotoolsCURIE": "biotools:xicra",
    "biotoolsID": "xicra",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jsanchez@igtp.cat"
        },
        {
            "email": "lsumoy@igtp.cat",
            "name": "Lauro Sumoy",
            "orcidid": "https://orcid.org/0000-0003-0005-4618"
        }
    ],
    "description": "Small RNAseq pipeline for paired-end reads",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://xicra.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/HCGB-IGTP/XICRA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-17T15:30:59.443204Z",
    "license": "MIT",
    "maturity": "Emerging",
    "name": "XICRA",
    "operatingSystem": [
        "Mac",
        "Linux"
    ],
    "owner": "jfsanchez",
    "publication": [
        {
            "doi": "10.1186/s12859-021-04128-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Next generation sequencing has allowed the discovery of miRNA isoforms, termed isomiRs. Some isomiRs are derived from imprecise processing of pre-miRNA precursors, leading to length variants. Additional variability is introduced by non-templated addition of bases at the ends or editing of internal bases, resulting in base differences relative to the template DNA sequence. We hypothesized that some component of the isomiR variation reported so far could be due to systematic technical noise and not real. Results: We have developed the XICRA pipeline to analyze small RNA sequencing data at the isomiR level. We exploited its ability to use single or merged reads to compare isomiR results derived from paired-end (PE) reads with those from single reads (SR) to address whether detectable sequence differences relative to canonical miRNAs found in isomiRs are true biological variations or the result of errors in sequencing. We have detected non-negligible systematic differences between SR and PE data which primarily affect putative internally edited isomiRs, and at a much smaller frequency terminal length changing isomiRs. This is relevant for the identification of true isomiRs in small RNA sequencing datasets. Conclusions: We conclude that potential artifacts derived from sequencing errors and/or data processing could result in an overestimation of abundance and diversity of miRNA isoforms. Efforts in annotating the isomiRnome should take this into account.",
                "authors": [
                    {
                        "name": "Sanchez Herrero J.F."
                    },
                    {
                        "name": "Pluvinet R."
                    },
                    {
                        "name": "Luna de Haro A."
                    },
                    {
                        "name": "Sumoy L."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Paired-end small RNA sequencing reveals a possible overestimation in the isomiR sequence repertoire previously reported from conventional single read data analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "mirtop",
            "type": "uses"
        },
        {
            "biotoolsID": "mintmap",
            "type": "uses"
        },
        {
            "biotoolsID": "star",
            "type": "uses"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}