{
    "additionDate": "2018-09-19T15:27:53Z",
    "biotoolsCURIE": "biotools:hrvanalysis",
    "biotoolsID": "hrvanalysis",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://anslabtools.univ-st-etienne.fr/en/contact/section-3-1.html"
        }
    ],
    "description": "HRVanalysis is a free software that can be used to analyze cardiac autonomic activity.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://anslabtools.univ-st-etienne.fr/en/highlights/section-3-1.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://anslabtools.univ-st-etienne.fr/en/index.html",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "HRVanalysis",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.3389/fphys.2016.00557",
            "metadata": {
                "abstract": "© 2016 Pichot, Roche, Celle, Barthélémy and Chouchou.Since the pioneering studies of the 1960s, heart rate variability (HRV) has become an increasingly used non-invasive tool for examining cardiac autonomic functions and dysfunctions in various populations and conditions. Many calculation methods have been developed to address these issues, each with their strengths and weaknesses. Although, its interpretation may remain difficult, this technique provides, from a non-invasive approach, reliable physiological information that was previously inaccessible, in many fields including death and health prediction, training and overtraining, cardiac and respiratory rehabilitation, sleep-disordered breathing, large cohort follow-ups, children's autonomic status, anesthesia, or neurophysiological studies. In this context, we developed HRVanalysis, a software to analyse HRV, used and improved for over 20 years and, thus, designed to meet laboratory requirements. The main strength of HRVanalysis is its wide application scope. In addition to standard analysis over short and long periods of RR intervals, the software allows time-frequency analysis using wavelet transform as well as analysis of autonomic nervous system status on surrounding scored events and on preselected labeled areas. Moreover, the interface is designed for easy study of large cohorts, including batch mode signal processing to avoid running repetitive operations. Results are displayed as figures or saved in TXT files directly employable in statistical softwares. Recordings can arise from RR or EKG files of different types such as cardiofrequencemeters, holters EKG, polygraphs, and data acquisition systems. HRVanalysis can be downloaded freely from the Web page at: https://anslabtools.univ-st-etienne.fr HRVanalysis is meticulously maintained and developed for in-house laboratory use. In this article, after a brief description of the context, we present an overall view of HRV analysis and we describe the methodological approach of the different techniques provided by the software.",
                "authors": [
                    {
                        "name": "Pichot V."
                    },
                    {
                        "name": "Roche F."
                    },
                    {
                        "name": "Celle S."
                    },
                    {
                        "name": "Barthelemy J.-C."
                    },
                    {
                        "name": "Chouchou F."
                    }
                ],
                "citationCount": 41,
                "date": "2016-11-22T00:00:00Z",
                "journal": "Frontiers in Physiology",
                "title": "HRV analysis: A free software for analyzing cardiac autonomic activity"
            },
            "pmcid": "PMC5118625",
            "pmid": "27920726",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}