{
    "accessibility": "Open access",
    "additionDate": "2019-05-27T15:44:45Z",
    "biotoolsCURIE": "biotools:Context-explorer",
    "biotoolsID": "Context-explorer",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Joel Ostblom",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://gitlab.com/joelostblom"
        }
    ],
    "description": "Analysis of spatially organized protein expression in high-throughput screens.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gitlab.com/stemcellbioengineering/context-explorer"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://contextexplorer.readthedocs.io/en/latest/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "Context-explorer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006384",
            "metadata": {
                "abstract": "© 2019 Ostblom et al.A growing body of evidence highlights the importance of the cellular microenvironment as a regulator of phenotypic and functional cellular responses to perturbations. We have previously developed cell patterning techniques to control population context parameters, and here we demonstrate context-explorer (CE), a software tool to improve investigation cell fate acquisitions through community level analyses. We demonstrate the capabilities of CE in the analysis of human and mouse pluripotent stem cells (hPSCs, mPSCs) patterned in colonies of defined geometries in multi-well plates. CE employs a density-based clustering algorithm to identify cell colonies. Using this automatic colony classification methodology, we reach accuracies comparable to manual colony counts in a fraction of the time, both in micropatterned and unpatterned wells. Classifying cells according to their relative position within a colony enables statistical analysis of spatial organization in protein expression within colonies. When applied to colonies of hPSCs, our analysis reveals a radial gradient in the expression of the transcription factors SOX2 and OCT4. We extend these analyses to colonies of different sizes and shapes and demonstrate how the metrics derived by CE can be used to asses the patterning fidelity of micropatterned plates. We have incorporated a number of features to enhance the usability and utility of CE. To appeal to a broad scientific community, all of the software's functionality is accessible from a graphical user interface, and convenience functions for several common data operations are included. CE is compatible with existing image analysis programs such as CellProfiler and extends the analytical capabilities already provided by these tools. Taken together, CE facilitates investigation of spatially heterogeneous cell populations for fundamental research and drug development validation programs.",
                "authors": [
                    {
                        "name": "Ostblom J."
                    },
                    {
                        "name": "Nazareth E.J.P."
                    },
                    {
                        "name": "Tewary M."
                    },
                    {
                        "name": "Zandstra P.W."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Context-explorer: Analysis of spatially organized protein expression in high-throughput screens"
            },
            "pmcid": "PMC6331134",
            "pmid": "30601802",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}