{
    "additionDate": "2017-02-10T14:14:13Z",
    "biotoolsCURIE": "biotools:fastsnp",
    "biotoolsID": "fastsnp",
    "description": "Identify and prioritize SNPs that are likely to have functional effects.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://fastsnp.ibms.sinica.edu.tw",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "FastSNP",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Single nucleotide polymorphism (SNP) prioritization based on the phenotypic risk is essential for association studies. Assessment of the risk requires access to a variety of heterogeneous biological databases and analytical tools. FASTSNP (function analysis and selection tool for single nucleotide polymorphisms) is a web server that allows users to efficiently identify and prioritize high-risk SNPs according to their phenotypic risks and putative functional effects. A unique feature of FASTSNP is that the functional effect information used for SNP prioritization is always up-to-date, because FASTSNP extracts the information from 11 external web servers at query time using a team of web wrapper agents. Moreover, FASTSNP is extendable by simply deploying more Web wrapper agents. To validate the results of our prioritization, we analyzed 1569 SNPs from the SNP500Cancer database. The results show that SNPs with a high predicted risk exhibit low allele frequencies for the minor alleles, consistent with a well-known finding that a strong selective pressure exists for functional polymorphisms. We have been using FASTSNP for 2 years and FASTSNP enables us to discover a novel promoter polymorphism. FASTSNP is available at http://fastsnp.ibms.sinica.edu.tw. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Yuan H.-Y."
                    },
                    {
                        "name": "Chiou J.-J."
                    },
                    {
                        "name": "Tseng W.-H."
                    },
                    {
                        "name": "Liu C.-H."
                    },
                    {
                        "name": "Liu C.-K."
                    },
                    {
                        "name": "Lin Y.-J."
                    },
                    {
                        "name": "Wang H.-H."
                    },
                    {
                        "name": "Yao A."
                    },
                    {
                        "name": "Chen Y.-T."
                    },
                    {
                        "name": "Hsu C.-N."
                    }
                ],
                "citationCount": 424,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "FASTSNP: An always up-to-date and extendable service for SNP function analysis and prioritization"
            },
            "pmid": "16845089"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        }
    ],
    "validated": 1
}