{
    "additionDate": "2021-01-18T10:44:02Z",
    "biotoolsCURIE": "biotools:scopy",
    "biotoolsID": "scopy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "oriental-cds@163.com",
            "name": "Dong-Sheng Cao",
            "typeEntity": "Person"
        },
        {
            "email": "tingjunhou@zju.edu.cn",
            "name": "Ting-Jun Hou",
            "typeEntity": "Person"
        }
    ],
    "description": "an integrated negative design python library for desirable HTS/VS database design.\n\nScopy (Screnning COmpounds in PYthon), an integrated negative design python library designed for screening out undesirable compounds in the early drug discovery. Scopy includes six modules, covering data preparation, screening filters, the calculation of scaffolds and descriptors, and the visualization analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kotori-y/Scopy",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-02-13T15:17:33Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://scopy.iamkotori.com/"
        }
    ],
    "name": "Scopy",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA194",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.BACKGROUND: High-throughput screening (HTS) and virtual screening (VS) have been widely used to identify potential hits from large chemical libraries. However, the frequent occurrence of 'noisy compounds' in the screened libraries, such as compounds with poor drug-likeness, poor selectivity or potential toxicity, has greatly weakened the enrichment capability of HTS and VS campaigns. Therefore, the development of comprehensive and credible tools to detect noisy compounds from chemical libraries is urgently needed in early stages of drug discovery. RESULTS: In this study, we developed a freely available integrated python library for negative design, called Scopy, which supports the functions of data preparation, calculation of descriptors, scaffolds and screening filters, and data visualization. The current version of Scopy can calculate 39 basic molecular properties, 3 comprehensive molecular evaluation scores, 2 types of molecular scaffolds, 6 types of substructure descriptors and 2 types of fingerprints. A number of important screening rules are also provided by Scopy, including 15 drug-likeness rules (13 drug-likeness rules and 2 building block rules), 8 frequent hitter rules (four assay interference substructure filters and four promiscuous compound substructure filters), and 11 toxicophore filters (five human-related toxicity substructure filters, three environment-related toxicity substructure filters and three comprehensive toxicity substructure filters). Moreover, this library supports four different visualization functions to help users to gain a better understanding of the screened data, including basic feature radar chart, feature-feature-related scatter diagram, functional group marker gram and cloud gram. CONCLUSION: Scopy provides a comprehensive Python package to filter out compounds with undesirable properties or substructures, which will benefit the design of high-quality chemical libraries for drug design and discovery. It is freely available at https://github.com/kotori-y/Scopy.",
                "authors": [
                    {
                        "name": "Cao D.-S."
                    },
                    {
                        "name": "Hou T.-J."
                    },
                    {
                        "name": "Lu A.-P."
                    },
                    {
                        "name": "Yang Z.-J."
                    },
                    {
                        "name": "Yang Z.-Y."
                    }
                ],
                "citationCount": 3,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Scopy: an integrated negative design python library for desirable HTS/VS database design"
            },
            "pmid": "32892221"
        }
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
