{
    "additionDate": "2021-03-19T08:35:20Z",
    "biotoolsCURIE": "biotools:dm3loc",
    "biotoolsID": "dm3loc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wangdong79@smu.edu.cn",
            "name": "Dong Wang",
            "typeEntity": "Person"
        },
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person"
        },
        {
            "email": "xudong@missouri.edu",
            "name": "Dong Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "DM3Loc is a web tool for multi-label mRNA subcellular localization prediction and analysis based on multi-head self-attention mechanism. DM3Loc is a novel Deep-learning framework with multi-head self-attention for multi-label mRNA subcellular localization prediction and analyses, which provide prediciton for six subcellular compartments, including nucleus, exosome, cytoplasm, ribosome, membrane, and endoplasmic reticulum.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                }
            ]
        }
    ],
    "homepage": "http://dm3loc.lin-group.cn",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-31T19:51:33Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/duolinwang/DM3Loc"
        }
    ],
    "name": "DM3Loc",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB016",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Subcellular localization of messenger RNAs (mRNAs), as a prevalent mechanism, gives precise and efficient control for the translation process. There is mounting evidence for the important roles of this process in a variety of cellular events. Computational methods for mRNA subcellular localization prediction provide a useful approach for studying mRNA functions. However, few computational methods were designed for mRNA subcellular localization prediction and their performance have room for improvement. Especially, there is still no available tool to predict for mRNAs that have multiple localization annotations. In this paper, we propose a multi-head self-attention method, DM3Loc, for multi-label mRNA subcellular localization prediction. Evaluation results show that DM3Loc outperforms existing methods and tools in general. Furthermore, DM3Loc has the interpretation ability to analyze RNA-binding protein motifs and key signals on mRNAs for subcellular localization. Our analyses found hundreds of instances of mRNA isoform-specific subcellular localizations and many significantly enriched gene functions for mRNAs in different subcellular localizations. &copy; 2021 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.",
                "authors": [
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Mao Z."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 7,
                "date": "2021-05-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DM3Loc: Multi-label mRNA subcellular localization prediction and analysis based on multi-head self-attention mechanism"
            },
            "pmid": "33503258"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ]
}