{
    "additionDate": "2021-01-18T08:58:58Z",
    "biotoolsCURIE": "biotools:fcscan",
    "biotoolsID": "fcscan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pk17@aub.edu.lb",
            "name": "Pierre Khoueiry",
            "orcidid": "https://orcid.org/0000-0001-7643-3310",
            "typeEntity": "Person"
        }
    ],
    "description": "fcScan is a Bioconductor package aiming at clustering genomic features based on a defined window size and combination of sites. fcScan for detecting clusters of coordinates with user defined options.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/fcScan",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-10T21:12:49Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pkhoueiry/fcScan"
        }
    ],
    "name": "fcScan",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3536-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Finding combinations of homotypic or heterotypic genomic sites obeying a specific grammar in DNA sequences is a frequent task in bioinformatics. A typical case corresponds to the identification of cis-regulatory modules characterized by a combination of transcription factor binding sites in a defined window size. Although previous studies identified clusters of genomic sites in species with varying genome sizes, the availability of a dedicated and versatile tool to search for such clusters is lacking. Results: We present fcScan, an R/Bioconductor package to search for clusters of genomic sites based on user defined criteria including cluster size, inter-cluster distances and sites order and orientation allowing users to adapt their search criteria to specific biological questions. It supports GRanges, data frame and VCF/BED files as input and returns data in GRanges format. By performing clustering on vectorized data, fcScan is adapted to search for genomic clusters in millions of sites as input in short time and is thus ideal to scan data generated by high throughput methods including next generation sequencing. Conclusions: fcScan is ideal for detecting cis-regulatory modules of transcription factor binding sites with a specific grammar as well as genomic loci enriched for mutations. The flexibility in input parameters allows users to perform searches targeting specific research questions. It is released under Artistic-2.0 License. The source code is freely available through Bioconductor (https://bioconductor.org/packages/fcScan) and GitHub (https://github.com/pkhoueiry/fcScan).",
                "authors": [
                    {
                        "name": "El-Kurdi A."
                    },
                    {
                        "name": "Khalil G.A."
                    },
                    {
                        "name": "Khazen G."
                    },
                    {
                        "name": "Khoueiry P."
                    }
                ],
                "date": "2020-05-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FcScan: A versatile tool to cluster combinations of sites using genomic coordinates"
            },
            "pmcid": "PMC7236483",
            "pmid": "32429868"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}