{
    "additionDate": "2021-10-19T08:28:58.994937Z",
    "biotoolsCURIE": "biotools:halvade_somatic",
    "biotoolsID": "halvade_somatic",
    "credit": [
        {
            "email": "jan.fostier@ugent.be",
            "name": "Jan Fostier",
            "orcidid": "https://orcid.org/0000-0002-9994-8269"
        }
    ],
    "description": "Halvade implements germline and somatic variant calling pipelines based on the best-practices pipelines from the Broad Institute using the Spark framework. Halvade will produce a VCF output file which contains the single nucleotide polymorphisms (SNPs) and short insertions and deletions (indels) when supported by the used tools. This program requires Spark on either a local cluster with one or more nodes, an Amazon EMR cluster or the Docker image to run.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://halvadeforspark.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "BAM",
                            "uri": "http://edamontology.org/format_2572"
                        },
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Annotated text",
                        "uri": "http://edamontology.org/data_3779"
                    },
                    "format": [
                        {
                            "term": "VCF",
                            "uri": "http://edamontology.org/format_3016"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/dries_decap/halvadeforspark",
    "lastUpdate": "2022-06-14T07:11:24.142570Z",
    "license": "GPL-3.0",
    "name": "Halvade Somatic",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ddecap",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAB094",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press GigaScience.Background: The accurate detection of somatic variants from sequencing data is of key importance for cancer treatment and research. Somatic variant calling requires a high sequencing depth of the tumor sample, especially when the detection of low-frequency variants is also desired. In turn, this leads to large volumes of raw sequencing data to process and hence, large computational requirements. For example, calling the somatic variants according to the GATK best practices guidelines requires days of computing time for a typical whole-genome sequencing sample. Findings: We introduce Halvade Somatic, a framework for somatic variant calling from DNA sequencing data that takes advantage of multi-node and/or multi-core compute platforms to reduce runtime. It relies on Apache Spark to provide scalable I/O and to create and manage data streams that are processed on different CPU cores in parallel. Halvade Somatic contains all required steps to process the tumor and matched normal sample according to the GATK best practices recommendations: read alignment (BWA), sorting of reads, preprocessing steps such as marking duplicate reads and base quality score recalibration (GATK), and, finally, calling the somatic variants (Mutect2). Our approach reduces the runtime on a single 36-core node to 19.5 h compared to a runtime of 84.5 h for the original pipeline, a speedup of 4.3 times. Runtime can be further decreased by scaling to multiple nodes, e.g., we observe a runtime of 1.36 h using 16 nodes, an additional speedup of 14.4 times. Halvade Somatic supports variant calling from both whole-genome sequencing and whole-exome sequencing data and also supports Strelka2 as an alternative or complementary variant calling tool. We provide a Docker image to facilitate single-node deployment. Halvade Somatic can be executed on a variety of compute platforms, including Amazon EC2 and Google Cloud. Conclusions: To our knowledge, Halvade Somatic is the first somatic variant calling pipeline that leverages Big Data processing platforms and provides reliable, scalable performance. Source code is freely available.",
                "authors": [
                    {
                        "name": "Costanza P."
                    },
                    {
                        "name": "De Schaetzen Van Brienen L."
                    },
                    {
                        "name": "Decap D."
                    },
                    {
                        "name": "Fostier J."
                    },
                    {
                        "name": "Herzeel C."
                    },
                    {
                        "name": "Larmuseau M."
                    },
                    {
                        "name": "Marchal K."
                    },
                    {
                        "name": "Wuyts R."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Halvade somatic: Somatic variant calling with Apache Spark"
            },
            "pmcid": "PMC8756192",
            "pmid": "35022699"
        }
    ],
    "version": [
        "2.0.4",
        "2.0.5"
    ]
}
