{
    "additionDate": "2018-08-28T07:48:05Z",
    "biotoolsCURIE": "biotools:girder",
    "biotoolsID": "girder",
    "credit": [
        {
            "name": "Girder",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/girder"
        }
    ],
    "description": "A data management platform for the web, developed by Kitware.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://girder.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service invocation",
                    "uri": "http://edamontology.org/operation_3763"
                }
            ]
        }
    ],
    "homepage": "https://github.com/girder/girder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Artistic-2.0",
    "name": "Girder",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0241-z",
            "metadata": {
                "abstract": "© 2017 The Author(s).An end-to-end platform for chemical science research has been developed that integrates data from computational and experimental approaches through a modern web-based interface. The platform offers an interactive visualization and analytics environment that functions well on mobile, laptop and desktop devices. It offers pragmatic solutions to ensure that large and complex data sets are more accessible. Existing desktop applications/frameworks were extended to integrate with high-performance computing resources, and offer command-line tools to automate interaction - connecting distributed teams to this software platform on their own terms. The platform was developed openly, and all source code hosted on the GitHub platform with automated deployment possible using Ansible coupled with standard Ubuntu-based machine images deployed to cloud machines. The platform is designed to enable teams to reap the benefits of the connected web - going beyond what conventional search and analytics platforms offer in this area. It also has the goal of offering federated instances, that can be customized to the sites/research performed. Data gets stored using JSON, extending upon previous approaches using XML, building structures that support computational chemistry calculations. These structures were developed to make it easy to process data across different languages, and send data to a JavaScript-based web client.",
                "authors": [
                    {
                        "name": "Hanwell M.D."
                    },
                    {
                        "name": "De Jong W.A."
                    },
                    {
                        "name": "Harris C.J."
                    }
                ],
                "citationCount": 6,
                "date": "2017-10-30T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Open chemistry: RESTful web APIs, JSON, NWChem and the modern web application"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Laboratory information management",
            "uri": "http://edamontology.org/topic_0607"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}