{
    "additionDate": "2024-01-05T10:56:52.812142Z",
    "biotoolsCURIE": "biotools:treegoer",
    "biotoolsID": "treegoer",
    "confidence_flag": "high",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "r.kindt@cifor-icraf.org",
            "name": "Roeland Kindt",
            "typeEntity": "Person"
        }
    ],
    "description": "A database with globally observed environmental ranges for 48,129 tree species.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://doi.org/10.5281/zenodo.7922928",
    "lastUpdate": "2024-01-05T10:56:52.814894Z",
    "license": "CC-BY-4.0",
    "name": "TreeGOER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/gcb.16914",
            "metadata": {
                "abstract": "The TreeGOER (Tree Globally Observed Environmental Ranges) database provides information for most known tree species of their environmental ranges for 38 bioclimatic, eight soil and three topographic variables. It is based on species distribution modelling analyses of more than 44 million occurrences. The database can be accessed from https://doi.org/10.5281/zenodo.7922927. Statistics that include 5% and 95% quantiles were estimated for a cleaned and taxonomically standardized occurrence data set with different methods of outlier detection, with estimates for roughly 45% of species being based on 20 or more observation records. Where sufficient representative observations are available, the ranges provide useful preliminary estimates of suitable conditions particularly for lesser-known species under climate change. Inferred core bioclimatic ranges of species along global temperature and moisture index gradients and across continents follow the known global distribution of tree diversity such as its highest levels in moist tropical forests and the ‘odd man out’ pattern of lower levels in Africa. To demonstrate how global analyses for large numbers of tree species can easily be done in R with TreeGOER, here I present two case studies. The first case study investigated latitudinal trends of tree vulnerability and compared these with previous results obtained for urban trees. The second case study focused on tropical areas, compared trends in different longitudinal zones and investigated patterns for the moisture index. TreeGOER is expected to benefit researchers conducting biogeographical and climate change research for a wide range of tree species at a variety of spatial and temporal scales.",
                "authors": [
                    {
                        "name": "Kindt R."
                    }
                ],
                "date": "2023-11-01T00:00:00Z",
                "journal": "Global Change Biology",
                "title": "TreeGOER: A database with globally observed environmental ranges for 48,129 tree species"
            },
            "pmid": "37602408"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
