{
    "accessibility": "Open access",
    "additionDate": "2024-04-19T08:35:02.486462Z",
    "biotoolsCURIE": "biotools:atacamp",
    "biotoolsID": "atacamp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "haoyang.cai@scu.edu.cn",
            "name": "Haoyang Cai",
            "typeEntity": "Person"
        },
        {
            "email": "yangjian89@scu.edu.cn",
            "name": "Jian Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for detecting ecDNA/HSRs from bulk and single-cell ATAC-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chsmiss/ATAC-amp",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-19T08:35:02.488474Z",
    "license": "MIT",
    "name": "ATACAmp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-023-09792-6",
            "metadata": {
                "abstract": "Background: High oncogene expression in cancer cells is a major cause of rapid tumor progression and drug resistance. Recent cancer genome research has shown that oncogenes as well as regulatory elements can be amplified in the form of extrachromosomal DNA (ecDNA) or subsequently integrated into chromosomes as homogeneously staining regions (HSRs). These genome-level variants lead to the overexpression of the corresponding oncogenes, resulting in poor prognosis. Most existing detection methods identify ecDNA using whole genome sequencing (WGS) data. However, these techniques usually detect many false positive regions owing to chromosomal DNA interference. Results: In the present study, an algorithm called “ATACAmp” that can identify ecDNA/HSRs in tumor genomes using ATAC-seq data has been described. High chromatin accessibility, one of the characteristics of ecDNA, makes ATAC-seq naturally enriched in ecDNA and reduces chromosomal DNA interference. The algorithm was validated using ATAC-seq data from cell lines that have been experimentally determined to contain ecDNA regions. ATACAmp accurately identified the majority of validated ecDNA regions. AmpliconArchitect, the widely used ecDNA detecting tool, was used to detect ecDNA regions based on the WGS data of the same cell lines. Additionally, the Circle-finder software, another tool that utilizes ATAC-seq data, was assessed. The results showed that ATACAmp exhibited higher accuracy than AmpliconArchitect and Circle-finder. Moreover, ATACAmp supported the analysis of single-cell ATAC-seq data, which linked ecDNA to specific cells. Conclusions: ATACAmp, written in Python, is freely available on GitHub under the MIT license: https://github.com/chsmiss/ATAC-amp . Using ATAC-seq data, ATACAmp offers a novel analytical approach that is distinct from the conventional use of WGS data. Thus, this method has the potential to reduce the cost and technical complexity associated ecDNA analysis.",
                "authors": [
                    {
                        "name": "Bao G."
                    },
                    {
                        "name": "Cai H."
                    },
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Chu H."
                    },
                    {
                        "name": "Dong L."
                    },
                    {
                        "name": "Gou Y."
                    },
                    {
                        "name": "Liao Y."
                    },
                    {
                        "name": "Ma W."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ATACAmp: a tool for detecting ecDNA/HSRs from bulk and single-cell ATAC-seq data"
            },
            "pmcid": "PMC10638764",
            "pmid": "37950200"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
