{
    "additionDate": "2021-01-18T10:06:43Z",
    "biotoolsCURIE": "biotools:virulencefinder",
    "biotoolsID": "virulencefinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fsc@ssi.dk",
            "name": "Flemming Scheutz",
            "orcidid": "https://orcid.org/0000-0002-3931-4846",
            "typeEntity": "Person"
        }
    ],
    "description": "In Silico Genotyping of Escherichia coli Isolates for Extraintestinal Virulence Genes by Use of Whole-Genome Sequencing Data.\n\nOnly data from one single isolate should be uploaded. If raw sequencing reads are uploaded KMA will be used for mapping. KMA supports the following sequencing platforms: Illumina, Ion Torrent, Roche 454, SOLiD, Oxford Nanopore, and PacBio.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://cge.cbs.dtu.dk/services/VirulenceFinder/",
    "lastUpdate": "2021-03-13T14:05:57Z",
    "name": "VirulenceFinder",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1128/JCM.01269-20",
            "metadata": {
                "abstract": "Copyright © 2020 Malberg Tetzschner et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.Extraintestinal pathogenic Escherichia coli (ExPEC) is the leading cause in humans of urinary tract infection and bacteremia. The previously published web tool VirulenceFinder (http://cge.cbs.dtu.dk/services/VirulenceFinder/) uses whole-genome sequencing (WGS) data for in silico characterization of E. coli isolates and enables researchers and clinical health personnel to quickly extract and interpret virulence-relevant information from WGS data. In this study, 38 ExPEC-associated virulence genes were added to the existing E. coli VirulenceFinder database. In total, 14,441 alleles were downloaded. A total of 1,890 distinct alleles were added to the database after removal of redundant sequences and analysis of the remaining alleles for open reading frames (ORFs). The database now contains 139 genes-of which 44 are related to ExPEC-and 2,826 corresponding alleles. Construction of the database included validation against 27 primer pairs from previous studies, a search for serotype-specific P fimbriae papA alleles, and a BLASTn confirmation of seven genes (etsC, iucC, kpsE, neuC, sitA, tcpC, and terC) not covered by the primers. The augmented database was evaluated using (i) a panel of nine control strains and (ii) 288 human-source E. coli strains classified by PCR as ExPEC and non-ExPEC. We observed very high concordance (average, 93.4%) between PCR and WGS findings, but WGS identified more alleles. In conclusion, the addition of 38 ExPEC-associated genes and the associated alleles to the E. coli VirulenceFinder database allows for a more complete characterization of E. coli isolates based on WGS data, which has become increasingly important considering the plasticity of the E. coli genome.",
                "authors": [
                    {
                        "name": "Tetzschner A.M.M."
                    },
                    {
                        "name": "Johnson J.R."
                    },
                    {
                        "name": "Johnston B.D."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Scheutz F."
                    }
                ],
                "citationCount": 4,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Journal of Clinical Microbiology",
                "title": "In Silico genotyping of Escherichia coli isolates for extraintestinal virulence genes by use of whole-genome sequencing data"
            },
            "pmcid": "PMC7512150",
            "pmid": "32669379"
        }
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}