{
    "accessibility": "Open access",
    "additionDate": "2023-01-17T01:45:10.917049Z",
    "biotoolsCURIE": "biotools:denvis",
    "biotoolsID": "denvis",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "a.krasoulis@deeplab.ai",
            "name": "Agamemnon Krasoulis",
            "orcidid": "http://orcid.org/0000-0002-0468-0627",
            "typeEntity": "Person"
        },
        {
            "name": "Stavros Theodorakis"
        },
        {
            "name": "Nick Antonopoulos",
            "orcidid": "http://orcid.org/0000-0002-3175-8338"
        },
        {
            "name": "Vassilis Pitsikalis",
            "orcidid": "http://orcid.org/0000-0002-1593-7491"
        }
    ],
    "description": "Scalable and high-throughput virtual screening using graph neural networks with atomic and surface protein pocket features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/deeplab-ai/denvis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-17T01:45:10.919752Z",
    "license": "GPL-3.0",
    "name": "DENVIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c01057",
            "metadata": {
                "abstract": "© 2022 American Chemical Society.Computational methods for virtual screening can dramatically accelerate early-stage drug discovery by identifying potential hits for a specified target. Docking algorithms traditionally use physics-based simulations to address this challenge by estimating the binding orientation of a query protein-ligand pair and a corresponding binding affinity score. Over the recent years, classical and modern machine learning architectures have shown potential for outperforming traditional docking algorithms. Nevertheless, most learning-based algorithms still rely on the availability of the protein-ligand complex binding pose, typically estimated via docking simulations, which leads to a severe slowdown of the overall virtual screening process. A family of algorithms processing target information at the amino acid sequence level avoid this requirement, however, at the cost of processing protein data at a higher representation level. We introduce deep neural virtual screening (DENVIS), an end-to-end pipeline for virtual screening using graph neural networks (GNNs). By performing experiments on two benchmark databases, we show that our method performs competitively to several docking-based, machine learning-based, and hybrid docking/machine learning-based algorithms. By avoiding the intermediate docking step, DENVIS exhibits several orders of magnitude faster screening times (i.e., higher throughput) than both docking-based and hybrid models. When compared to an amino acid sequence-based machine learning model with comparable screening times, DENVIS achieves dramatically better performance. Some key elements of our approach include protein pocket modeling using a combination of atomic and surface features, the use of model ensembles, and data augmentation via artificial negative sampling during model training. In summary, DENVIS achieves competitive to state-of-the-art virtual screening performance, while offering the potential to scale to billions of molecules using minimal computational resources.",
                "authors": [
                    {
                        "name": "Antonopoulos N."
                    },
                    {
                        "name": "Krasoulis A."
                    },
                    {
                        "name": "Pitsikalis V."
                    },
                    {
                        "name": "Theodorakis S."
                    }
                ],
                "date": "2022-10-10T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "DENVIS: Scalable and High-Throughput Virtual Screening Using Graph Neural Networks with Atomic and Surface Protein Pocket Features"
            },
            "pmid": "36154119"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
