{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:16:45Z",
    "biotoolsCURIE": "biotools:FluoroCellTrack",
    "biotoolsID": "FluoroCellTrack",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "melvin@lsu.edu",
            "name": "Adam T. Melvin",
            "orcidid": "https://orcid.org/0000-0003-0484-5871",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Algorithm for automated analysis of high-throughput droplet microfluidic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Manibarathi/FluoroCellTrack/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Manibarathi/FluoroCellTrack",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Manibarathi/FluoroCellTrack/issues"
        }
    ],
    "maturity": "Mature",
    "name": "FluoroCellTrack",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0215337",
            "metadata": {
                "abstract": "© 2019 Vaithiyanathan et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.High-throughput droplet microfluidic devices with fluorescence detection systems provide several advantages over conventional end-point cytometric techniques due to their ability to isolate single cells and investigate complex intracellular dynamics. While there have been significant advances in the field of experimental droplet microfluidics, the development of complementary software tools has lagged. Existing quantification tools have limitations including interdependent hardware platforms or challenges analyzing a wide range of high-throughput droplet microfluidic data using a single algorithm. To address these issues, an all-in-one Python algorithm called FluoroCellTrack was developed and its wide-range utility was tested on three different applications including quantification of cellular response to drugs, droplet tracking, and intracellular fluorescence. The algorithm imports all images collected using bright field and fluorescence microscopy and analyzes them to extract useful information. Two parallel steps are performed where droplets are detected using a mathematical Circular Hough Transform (CHT) while single cells (or other contours) are detected by a series of steps defining respective color boundaries involving edge detection, dilation, and erosion. These feature detection steps are strengthened by segmentation and radius/ area thresholding for precise detection and removal of false positives. Individually detected droplet and contour center maps are overlaid to obtain encapsulation information for further analyses. FluoroCellTrack demonstrates an average of a ~92–99% similarity with manual analysis and exhibits a significant reduction in analysis time of 30 min to analyze an entire cohort compared to 20 h required for manual quantification.",
                "authors": [
                    {
                        "name": "Vaithiyanathan M."
                    },
                    {
                        "name": "Safa N."
                    },
                    {
                        "name": "Melvin A.T."
                    }
                ],
                "citationCount": 6,
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FluorocellTrack: An algorithm for automated analysis of high-throughput droplet microfluidic data"
            },
            "pmcid": "PMC6493727",
            "pmid": "31042738",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}