{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T17:58:03Z",
    "biotoolsCURIE": "biotools:RMut",
    "biotoolsID": "RMut",
    "cost": "Free of charge",
    "description": "R package for a Boolean sensitivity analysis against various types of mutations.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://github.com/csclab/RMut/blob/master/RMut_Tutorial.pdf"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/csclab/RMut/blob/master/Readme.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csclab/RMut",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/csclab/RMut/issues"
        }
    ],
    "maturity": "Mature",
    "name": "RMut",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0213736",
            "metadata": {
                "abstract": "© 2019 Trinh, Kwon. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.There have been many in silico studies based on a Boolean network model to investigate network sensitivity against gene or interaction mutations. However, there are no proper tools to examine the network sensitivity against many different types of mutations, including user-defined ones. To address this issue, we developed RMut, which is an R package to analyze the Boolean network-based sensitivity by efficiently employing not only many well-known node-based and edgetic mutations but also novel user-defined mutations. In addition, RMut can specify the mutation area and the duration time for more precise analysis. RMut can be used to analyze large-scale networks because it is implemented in a parallel algorithm using the OpenCL library. In the first case study, we observed that the real biological networks were most sensitive to overexpression/state-flip and edge-addition/-reverse mutations among node-based and edgetic mutations, respectively. In the second case study, we showed that edgetic mutations can predict drug-targets better than node-based mutations. Finally, we examined the network sensitivity to double edge-removal mutations and found an interesting synergistic effect. Taken together, these findings indicate that RMut is a flexible R package to efficiently analyze network sensitivity to various types of mutations. RMut is available at https://github.com/csclab/RMut.",
                "authors": [
                    {
                        "name": "Trinh H.-C."
                    },
                    {
                        "name": "Kwon Y.-K."
                    }
                ],
                "citationCount": 1,
                "date": "2019-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "RMUT: R package for a Boolean sensitivity analysis against various types of mutations"
            },
            "pmcid": "PMC6424452",
            "pmid": "30889216",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}