{
    "additionDate": "2017-03-25T13:09:45Z",
    "biotoolsCURIE": "biotools:antismash",
    "biotoolsID": "antismash",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://antismash.secondarymetabolites.org/#!/contact"
        },
        {
            "email": "kblin@biosustain.dtu.dk",
            "name": "Kai Blin",
            "orcidid": "http://orcid.org/0000-0003-3764-6051",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Rapid genome-wide identification, annotation and analysis of secondary metabolite biosynthesis gene clusters in bacterial and fungal genomes. It integrates and cross-links with a large number of in silico secondary metabolite analysis tools that have been published earlier.",
    "documentation": [
        {
            "note": "About antiSMASH",
            "type": [
                "General"
            ],
            "url": "https://antismash.secondarymetabolites.org/#!/about"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://docs.antismash.secondarymetabolites.org/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://docs.antismash.secondarymetabolites.org/PDFmanual/antiSMASH5manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://antismash.secondarymetabolites.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T16:34:14Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/antismash/antismash/"
        }
    ],
    "name": "antiSMASH",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "kblin",
    "publication": [
        {
            "metadata": {
                "abstract": "Bacterial and fungal secondary metabolism is a rich source of novel bioactive compounds with potential pharmaceutical applications as antibiotics, anti-tumor drugs or cholesterol-lowering drugs. To find new drug candidates, microbiologists are increasingly relying on sequencing genomes of a wide variety of microbes. However, rapidly and reliably pinpointing all the potential gene clusters for secondary metabolites in dozens of newly sequenced genomes has been extremely challenging, due to their biochemical heterogeneity, the presence of unknown enzymes and the dispersed nature of the necessary specialized bioinformatics tools and resources. Here, we present antiSMASH (antibiotics & Secondary Metabolite Analysis Shell), the first comprehensive pipeline capable of identifying biosynthetic loci covering the whole range of known secondary metabolite compound classes (polyketides, non-ribosomal peptides, terpenes, aminoglycosides, aminocoumarins, indolocarbazoles, lantibiotics, bacteriocins, nucleosides, beta-lactams, butyrolactones, siderophores, melanins and others). It aligns the identified regions at the gene cluster level to their nearest relatives from a database containing all other known gene clusters, and integrates or cross-links all previously available secondary-metabolite specific gene analysis methods in one interactive view. antiSMASH is available at http://antismash.secondarymetabolites.org. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Cimermancic P."
                    },
                    {
                        "name": "De Jager V."
                    },
                    {
                        "name": "Zakrzewski P."
                    },
                    {
                        "name": "Fischbach M.A."
                    },
                    {
                        "name": "Weber T."
                    },
                    {
                        "name": "Takano E."
                    },
                    {
                        "name": "Breitling R."
                    }
                ],
                "citationCount": 955,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AntiSMASH: Rapid identification, annotation and analysis of secondary metabolite biosynthesis gene clusters in bacterial and fungal genome sequences"
            },
            "pmid": "21672958",
            "type": [
                "Primary"
            ],
            "version": "1"
        },
        {
            "metadata": {
                "abstract": "Microbial secondary metabolites are a potent source of antibiotics and other pharmaceuticals. Genome mining of their biosynthetic gene clusters has become a key method to accelerate their identification and characterization. In 2011, we developed antiSMASH, a web-based analysis platform that automates this process. Here, we present the highly improved antiSMASH 2.0 release, available at http://antismash.secondarymetabolites.org/. For the new version, antiSMASH was entirely re-designed using a plug-and-play concept that allows easy integration of novel predictor or output modules. antiSMASH 2.0 now supports input of multiple related sequences simultaneously (multi-FASTA/GenBank/EMBL), which allows the analysis of draft genomes comprising multiple contigs. Moreover, direct analysis of protein sequences is now possible. antiSMASH 2.0 has also been equipped with the capacity to detect additional classes of secondary metabolites, including oligosaccharide antibiotics, phenazines, thiopeptides, homo-serine lactones, phosphonates and furans. The algorithm for predicting the core structure of the cluster end product is now also covering lantipeptides, in addition to polyketides and non-ribosomal peptides. The antiSMASH ClusterBlast functionality has been extended to identify sub-clusters involved in the biosynthesis of specific chemical building blocks. The new features currently make antiSMASH 2.0 the most comprehensive resource for identifying and analyzing novel secondary metabolite biosynthetic pathways in microorganisms.",
                "authors": [
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "Kazempour D."
                    },
                    {
                        "name": "Fischbach M.A."
                    },
                    {
                        "name": "Breitling R."
                    },
                    {
                        "name": "Takano E."
                    },
                    {
                        "name": "Weber T."
                    }
                ],
                "citationCount": 559,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "antiSMASH 2.0--a versatile platform for genome mining of secondary metabolite producers."
            },
            "pmid": "23737449",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        },
        {
            "doi": "10.1093/nar/gkv437",
            "metadata": {
                "abstract": "© 2015 The Author(s).Microbial secondary metabolism constitutes a rich source of antibiotics, chemotherapeutics, insecticides and other high-value chemicals. Genome mining of gene clusters that encode the biosynthetic pathways for these metabolites has become a key methodology for novel compound discovery. In 2011, we introduced antiSMASH, a web server and standalone tool for the automatic genomic identification and analysis of biosynthetic gene clusters, available at http://antismash.secondarymetabolites.org. Here, we present version 3.0 of antiSMASH, which has undergone major improvements. A full integration of the recently published ClusterFinder algorithm now allows using this probabilistic algorithm to detect putative gene clusters of unknown types. Also, a new dereplication variant of the ClusterBlast module now identifies similarities of identified clusters to any of 1172 clusters with known end products. At the enzyme level, active sites of key biosynthetic enzymes are now pinpointed through a curated patternmatching procedure and Enzyme Commission numbers are assigned to functionally classify all enzymecoding genes. Additionally, chemical structure prediction has been improved by incorporating polyketide reduction states. Finally, in order for users to be able to organize and analyze multiple antiSMASH outputs in a private setting, a new XML output module allows offline editing of antiSMASH annotations within the Geneious software.",
                "authors": [
                    {
                        "name": "Weber T."
                    },
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Duddela S."
                    },
                    {
                        "name": "Krug D."
                    },
                    {
                        "name": "Kim H.U."
                    },
                    {
                        "name": "Bruccoleri R."
                    },
                    {
                        "name": "Lee S.Y."
                    },
                    {
                        "name": "Fischbach M.A."
                    },
                    {
                        "name": "Muller R."
                    },
                    {
                        "name": "Wohlleben W."
                    },
                    {
                        "name": "Breitling R."
                    },
                    {
                        "name": "Takano E."
                    },
                    {
                        "name": "Medema M.H."
                    }
                ],
                "citationCount": 1274,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AntiSMASH 3.0-A comprehensive resource for the genome mining of biosynthetic gene clusters"
            },
            "pmcid": "PMC4489286",
            "pmid": "25948579",
            "type": [
                "Primary"
            ],
            "version": "3.0"
        },
        {
            "doi": "10.1093/NAR/GKX319",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.Many antibiotics, chemotherapeutics, crop protection agents and food preservatives originate from molecules produced by bacteria, fungi or plants. In recent years, genome mining methodologies have been widely adopted to identify and characterize the biosynthetic gene clusters encoding the production of such compounds. Since 2011, the â € antibiotics and secondary metabolite analysis shell - antiSMASH' has assisted researchers in efficiently performing this, both as a web server and a standalone tool. Here, we present the thoroughly updated antiSMASH version 4, which adds several novel features, including prediction of gene cluster boundaries using the ClusterFinder method or the newly integrated CASSIS algorithm, improved substrate specificity prediction for non-ribosomal peptide synthetase adenylation domains based on the new SANDPUMA algorithm, improved predictions for terpene and ribosomally synthesized and post-translationally modified peptides cluster products, reporting of sequence similarity to proteins encoded in experimentally characterized gene clusters on a per-protein basis and a domain-level alignment tool for comparative analysis of trans-AT polyketide synthase assembly line architectures. Additionally, several usability features have been updated and improved. Together, these improvements make antiSMASH up-to-date with the latest developments in natural product research and will further facilitate computational genome mining for the discovery of novel bioactive molecules.",
                "authors": [
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Wolf T."
                    },
                    {
                        "name": "Chevrette M.G."
                    },
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Schwalen C.J."
                    },
                    {
                        "name": "Kautsar S.A."
                    },
                    {
                        "name": "Suarez Duran H.G."
                    },
                    {
                        "name": "De Los Santos E.L.C."
                    },
                    {
                        "name": "Kim H.U."
                    },
                    {
                        "name": "Nave M."
                    },
                    {
                        "name": "Dickschat J.S."
                    },
                    {
                        "name": "Mitchell D.A."
                    },
                    {
                        "name": "Shelest E."
                    },
                    {
                        "name": "Breitling R."
                    },
                    {
                        "name": "Takano E."
                    },
                    {
                        "name": "Lee S.Y."
                    },
                    {
                        "name": "Weber T."
                    },
                    {
                        "name": "Medema M.H."
                    }
                ],
                "citationCount": 698,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AntiSMASH 4.0 - improvements in chemistry prediction and gene cluster boundary identification"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/NAR/GKAA978",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Microorganisms produce natural products that are frequently used in the development of antibacterial, antiviral, and anticancer drugs, pesticides, herbicides, or fungicides. In recent years, genome mining has evolved into a prominent method to access this potential. antiSMASH is one of the most popular tools for this task. Here, we present version 3 of the antiSMASH database, providing a means to access and query precomputed antiSMASH-5.2-detected biosynthetic gene clusters from representative, publicly available, high-quality microbial genomes via an interactive graphical user interface. In version 3, the database contains 147 517 high quality BGC regions from 388 archaeal, 25 236 bacterial and 177 fungal genomes and is available at https://antismash-db.secondarymetabolites.org/.",
                "authors": [
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Shaw S."
                    },
                    {
                        "name": "Kautsar S.A."
                    },
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "Weber T."
                    }
                ],
                "citationCount": 14,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The antiSMASH database version 3: Increased taxonomic coverage and new query features for modular enzymes"
            },
            "pmid": "33152079"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1,
    "version": [
        "1",
        "2.0",
        "3.0"
    ]
}