{"collectionID": [], "accessibility": [], "topic": [{"term": "Protein structural motifs and surfaces", "uri": "http://edamontology.org/topic_0166"}, {"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}, {"term": "Protein structure analysis", "uri": "http://edamontology.org/topic_2814"}, {"term": "Protein folds and structural domains", "uri": "http://edamontology.org/topic_0736"}, {"term": "Structure analysis", "uri": "http://edamontology.org/topic_0081"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "11025540", "type": null, "pmcid": null, "metadata": {"title": "Bayesian probabilistic approach for predicting backbone structures in terms of protein blocks", "abstract": "By using an unsupervised cluster analyzer, we have identified a local structural alphabet composed of 16 folding patterns of five consecutive Cα ('protein blocks'). The dependence that exists between successive blocks is explicitly taken into account. A Bayesian approach based on the relation protein block-amino acid propensity is used for prediction and leads to a success rate close to 35%. Sharing sequence windows associated with certain blocks into 'sequence families' improves the prediction accuracy by 6%. This prediction accuracy exceeds 75% when keeping the first four predicted protein blocks at each site of the protein. In addition, two different strategies are proposed: the first one defines the number of protein blocks in each site needed for respecting a user-fixed prediction accuracy, and alternatively, the second one defines the different protein sites to be predicted with a user-fixed number of blocks and a chosen accuracy. This last strategy applied to the ubiquitin conjugating enzyme (α/β protein) shows that 91% of the sites may be predicted with a prediction accuracy larger than 77% considering only three blocks per site. The prediction strategies proposed improve our knowledge about sequence-structure dependence and should be very useful in ab initio protein modelling. (C) 2000 Wiley-Liss, Inc.", "citationCount": 187, "authors": [{"name": "De Brevern A.G."}, {"name": "Etchebest C."}, {"name": "Hazout S."}], "date": "2000-11-15T00:00:00Z", "journal": "Proteins: Structure, Function and Genetics"}}, {"doi": null, "note": null, "version": null, "pmid": "16844973", "type": null, "pmcid": null, "metadata": {"title": "Protein Block Expert (PBE): A web-based protein structure analysis server using a structural alphabet", "abstract": "Encoding protein 3D structures into 1D string using short structural prototypes or structural alphabets opens a new front for structure comparison and analysis. Using the well-documented 16 motifs of Protein Blocks (PBs) as structural alphabet, we have developed a methodology to compare protein structures that are encoded as sequences of PBs by aligning them using dynamic programming which uses a substitution matrix for PBs. This methodology is implemented in the applications available in Protein Block Expert (PBE) server. PBE addresses common issues in the field of protein structure analysis such as comparison of proteins structures and identification of protein structures in structural databanks that resemble a given structure. PBE-T provides facility to transform any PDB file into sequences of PBs. PBE-ALIGNc performs comparison of two protein structures based on the alignment of their corresponding PB sequences. PBE-ALIGNm is a facility for mining SCOP database for similar structures based on the alignment of PBs. Besides, PBE provides an interface to a database (PBE-SAdb) of preprocessed PB sequences from SCOP culled at 95% and of all-against-all pairwise PB alignments at family and superfamily levels. PBE server is freely available at http://bioinformatics.univ-reunion.fr/PBE/. © The Author 2006. Published by Oxford University Press. All rights reserved.", "citationCount": 43, "authors": [{"name": "Tyagi M."}, {"name": "Sharma P."}, {"name": "Swamy C.S."}, {"name": "Cadet F."}, {"name": "Srinivasan N."}, {"name": "de Brevern A.G."}, {"name": "Offmann B."}], "date": "2006-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "15996119", "type": null, "pmcid": null, "metadata": {"title": "New assessment of a structural alphabet", "abstract": "A statistical analysis of the Protein Databank (PDB) structures had led us to define a set of small 3D structural prototypes called Protein Blocks (PBs). This structural alphabet includes 16 PBs, each one defined by the (φ, ψ) dihedral angles of 5 consecutive residues. Here, we analyze the effect of the enlargement of the PDB on the PBs' definition. The results highlight the quality of the 3D approximation ensured by the PBs. These last could be of great interest in ab initio modeling. © 2005 - IOS Press and Bioinformation Systems e.V. and the authors. All rights reserved.", "citationCount": 64, "authors": [{"name": "de Brevern A.G."}], "date": "2005-08-24T00:00:00Z", "journal": "In Silico Biology"}}], "homepage_status": 1, "credit": [], "biotoolsCURIE": "biotools:pbe", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://bioinformatics.univ-reunion.fr/PBE/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein modelling", "uri": "http://edamontology.org/operation_0477"}, {"term": "Protein structural motif recognition", "uri": "http://edamontology.org/operation_0245"}, {"term": "Structure alignment", "uri": "http://edamontology.org/operation_0295"}, {"term": "Protein secondary structure comparison", "uri": "http://edamontology.org/operation_2488"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:40Z", "otherID": [], "description": "This tool uses a structural alphabet of short structural motifs to compare protein structures. It uses as its structural alphabet a set of protein blocks derived from structurally aligned homologous proteins present in the PALI Database.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "pbe", "additionDate": "2017-02-10T14:15:44Z", "name": "PBE", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}