{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T00:12:35.586755Z",
    "biotoolsCURIE": "biotools:r2ogs5",
    "biotoolsID": "r2ogs5",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Johannes Boog",
            "orcidid": "https://orcid.org/0000-0003-1094-9255"
        },
        {
            "name": "Philipp Schad",
            "orcidid": "https://orcid.org/0000-0003-3332-5867"
        },
        {
            "name": "Thomas Kalbacher",
            "orcidid": "https://orcid.org/0000-0002-7866-5702"
        }
    ],
    "description": "Calibration of Numerical Groundwater Flow Models with Bayesian Optimization in R.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.opengeosys.org/ogs5/r2ogs5",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-09-04T00:12:35.589033Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/record/5572572#.YxPrD2VBxPY"
        }
    ],
    "name": "r2ogs5",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1111/GWAT.13221",
            "metadata": {
                "abstract": "© 2022 The Authors. Groundwater published by Wiley Periodicals LLC on behalf of National Ground Water Association.Large-scale and high-resolution groundwater models are currently becoming increasingly important in order to clarify the extent to which climate trends and extreme weather affect the groundwater balance regionally. As a result, the parameterization of groundwater models is becoming more detailed and more complex, making conventional calibration methods too time-consuming. Moderating the computational demand to find optimal solutions for the resulting potentially multi-modal objective function requires intelligent and efficient global optimization methods. Moreover, the increasing use of modern scripting languages R and Python to craft environmental analysis workflows calls to integrate groundwater flow simulators in such. Here we introduce and exemplify r2ogs5, a tool that integrates version 5 of the open-source simulation software OpenGeoSys into the programming language R. r2ogs5 allows for calibration of numerical groundwater flow models with a sequential model-based optimization approach that combines Bayesian optimization (BO) with surrogate modeling. Here, we describe the structure and function of r2ogs5 as well as the implemented calibration method. We then demonstrate the calibration method by calibrating 4 and 12 parameters of two simple groundwater flow models. The results indicate that this method needs fewer runs of the groundwater flow model than conventional gradient search and Latin hypercube sampling in case of the 12 parameter model. We believe that our method offers the potential to calibrate computationally expensive groundwater flow models. r2ogs5 supports groundwater flow modelers to access the statistical analysis and visualization capabilities of the R language and is a valuable tool for geoscientists already using R.",
                "authors": [
                    {
                        "name": "Boog J."
                    },
                    {
                        "name": "Kalbacher T."
                    },
                    {
                        "name": "Schad P."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Groundwater",
                "title": "r2ogs5: Calibration of Numerical Groundwater Flow Models with Bayesian Optimization in R"
            },
            "pmid": "35729090"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
