{
    "additionDate": "2021-06-14T12:32:59Z",
    "biotoolsCURIE": "biotools:aptct",
    "biotoolsID": "aptct",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "djb0053@auburn.edu",
            "name": "Dallin J. Bailey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Automated Phonetic Transcription (APT) Comparison Tool (APTct) is an online tool that facilitates the comparison of phonetic transcriptions for a variety of clinical and research purposes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://aptct.auburn.edu",
    "lastUpdate": "2021-08-13T07:59:32Z",
    "name": "APTct",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1080/02699206.2021.1896783",
            "metadata": {
                "abstract": "© 2021 Taylor & Francis Group, LLC.Many computerized tools for comparing phonetic transcriptions have been proposed and shared in the past; however, previous tools are relatively difficult to access and incorporate into clinical and research practice, or require users to learn additional phonetic symbol systems. The purpose of this project was to develop and test a readily available web-based application for quantitatively comparing phonetic transcriptions that are input using International Phonetic Alphabet (IPA) symbols. A web-based computer application was developed to allow for IPA phonetic transcription comparison. A point-and-click keyboard was developed to provide support for character input of the full IPA, as well as most symbols in the extIPA set. The application compares phonetic transcriptions using a modified edit distance algorithm following phonologically informed alignment. Visualizations of the algorithm’s optimal alignment and scoring operations are shown for each comparison input by a user. The application, named the Automated Phonetic Transcription Comparison Tool (APTct), was thoroughly tested for accurate implementation of the algorithm principles. Validity tests through two sample use cases were also performed by comparison of hand calculations to APTct calculations. In function testing, the APTct showed excellent agreement with an expert’s hand scoring using the same algorithm principles. In a validity test, only minor differences between the APTct and hand calculations were observed, primarily due to errors inputting the transcriptions into the APTct. The web-based APTct is a validated and versatile tool for quantitatively comparing even complex IPA phonetic transcriptions. It is freely available to clinicians and researchers, who may find it useful for a variety of potential scenarios. We invite researchers, clinicians, and other individuals to use the tool in their clinical and research work. The permalink for the website is as follows: https://aptct.auburn.edu.",
                "authors": [
                    {
                        "name": "Bailey D.J."
                    },
                    {
                        "name": "Speights Atkins M."
                    },
                    {
                        "name": "Mishra I."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Luan Y."
                    },
                    {
                        "name": "Seals C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Clinical Linguistics and Phonetics",
                "title": "An automated tool for comparing phonetic transcriptions"
            },
            "pmid": "33715568",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        }
    ]
}