
{
    "credit": [
        {
            "email": "anne.siegel@inria.fr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://aureme.genouest.org/aureme.html"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence (raw)",
                        "uri": "http://edamontology.org/data_3497"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "elixir-fr-sdp-2019"
        ],
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool",
            "Workflow",
            "Workbench"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 Aite et al.Genome-scale metabolic models have become the tool of choice for the global analysis of microorganism metabolism, and their reconstruction has attained high standards of quality and reliability. Improvements in this area have been accompanied by the development of some major platforms and databases, and an explosion of individual bioinformatics methods. Consequently, many recent models result from “à la carte” pipelines, combining the use of platforms, individual tools and biological expertise to enhance the quality of the reconstruction. Although very useful, introducing heterogeneous tools, that hardly interact with each other, causes loss of traceability and reproducibility in the reconstruction process. This represents a real obstacle, especially when considering less studied species whose metabolic reconstruction can greatly benefit from the comparison to good quality models of related organisms. This work proposes an adaptable workspace, AuReMe, for sustainable reconstructions or improvements of genome-scale metabolic models involving personalized pipelines. At each step, relevant information related to the modifications brought to the model by a method is stored. This ensures that the process is reproducible and documented regardless of the combination of tools used. Additionally, the workspace establishes a way to browse metabolic models and their metadata through the automatic generation of ad-hoc local wikis dedicated to monitoring and facilitating the process of reconstruction. AuReMe supports exploration and semantic query based on RDF databases. We illustrate how this workspace allowed handling, in an integrated way, the metabolic reconstructions of non-model organisms such as an extremophile bacterium or eukaryote algae. Among relevant applications, the latter reconstruction led to putative evolutionary insights of a metabolic pathway.",
            "authors": [
                "Aite M.",
                "Chevallier M.",
                "Frioux C.",
                "Trottier C.",
                "Got J.",
                "Cortes M.P.",
                "Mendoza S.N.",
                "Carrier G.",
                "Dameron O.",
                "Guillaudeux N.",
                "Latorre M.",
                "Loira N.",
                "Markov G.V.",
                "Maass A.",
                "Siegel A."
            ],
            "cit_count": 7,
            "doi": "10.1371/journal.pcbi.1006146",
            "journal": "PLoS Computational Biology",
            "title": "Traceability, reproducibility and wiki-exploration for “à-la-carte” reconstructions of genome-scale metabolic models",
            "type": "Primary",
            "year": "2018-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:aureme",
        "biotoolsID": "aureme",
        "description": "A unified workspace built around a Python package PADMet (Python library for hAndling metaData of METabolism), to house the reconstruction of genome-scale metabolic models.",
        "homepage": "http://aureme.genouest.org",
        "name": "AuReMe"
    }
}