{
    "accessibility": [],
    "additionDate": "2017-12-18T00:07:29Z",
    "biotoolsCURIE": "biotools:htm-one",
    "biotoolsID": "htm-one",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mizuguchilab.org/"
        }
    ],
    "description": "HTM-ONE takes single amino acid sequence as input and returns residue-wise prediction of several one-dimensional structural properties of helical transmembrane regions.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://mizuguchilab.org/netasa/htmone/",
    "homepage_status": 0,
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/htm-one-prediction-of-one-dimensional-structural-properties-of-helical-transmembrane-proteins.html"
        }
    ],
    "maturity": null,
    "name": "HTM-ONE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-533",
            "metadata": {
                "abstract": "Many structural properties such as solvent accessibility, dihedral angles and helix-helix contacts can be assigned to each residue in a membrane protein. Independent studies exist on the analysis and sequence-based prediction of some of these so-called one-dimensional features. However, there is little explanation of why certain residues are predicted in a wrong structural class or with large errors in the absolute values of these features. On the other hand, membrane proteins undergo conformational changes to allow transport as well as ligand binding. These conformational changes often occur via residues that are inherently flexible and hence, predicting fluctuations in residue positions is of great significance. We performed a statistical analysis of common patterns among selected one-dimensional equilibrium structural features (ESFs) and developed a method for simultaneously predicting all of these features using an integrated system. Our results show that the prediction performance can be improved if multiple structural features are trained in an integrated model, compared to the current practice of developing individual models. In particular, the performance of the solvent accessibility and bend-angle prediction improved in this way. The well-performing bend-angle prediction can be used to predict helical positions with severe kinks at a modest success rate. Further, we showed that single-chain conformational dynamics, measured by B-factors derived from normal mode analysis, could be predicted from observed and predicted ESFs with good accuracy. A web server was developed (http://tardis.nibio.go.jp/netasa/htmone/) for predicting the one-dimensional ESFs from sequence information and analyzing the differences between the predicted and observed values of the ESFs. The prediction performance of the integrated model is significantly better than that of the models performing the task separately for each feature for the solvent accessibility and bend-angle predictions. The predictability of the features also plays a role in determining flexible positions. Although the dynamics studied here concerns local atomic fluctuations, a similar analysis in terms of global structural features will be helpful in predicting large-scale conformational changes, for which work is in progress.",
                "authors": [
                    {
                        "name": "Ahmad S."
                    },
                    {
                        "name": "Singh Y.H."
                    },
                    {
                        "name": "Paudel Y."
                    },
                    {
                        "name": "Mori T."
                    },
                    {
                        "name": "Sugita Y."
                    },
                    {
                        "name": "Mizuguchi K."
                    }
                ],
                "citationCount": 3,
                "date": "2010-01-01T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "Integrated prediction of one-dimensional structural features and their relationships with conformational flexibility in helical membrane proteins."
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Transmembrane regions",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Transmembrane proteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "validated": 1,
    "version": []
}