{"credit":[],"labels":{"topic":[{"term":"Medical informatics","uri":"http://edamontology.org/topic_3063"},{"term":"Medicines research and development","uri":"http://edamontology.org/topic_3376"}]},"publication":[{"abstract":"© 2019 International Medical Informatics Association (IMIA) and IOS Press.This article illustrates the maturation process of innovative technologies in the healthcare domain. The role and the involvement of the stakeholders are explained, as well their interaction in the ecosystem. We focus on how the synergy between partners improves efficiency, boosts product development and accelerates market access. The spiral of the innovation concept is introduced to illustrate the different stages ensuring the correct development of a medical technology. This iterative cycle drives the product maturation, according to medical needs and feedback, and ensures the correct implementation of the innovation in the clinical framework. We finally illustrate how the innovation process is applied to successful drive the ongoing SERENE-IoT project: the spiral of innovation concept is specifically adapted to fit with the project requirements with the final ibjective to identify a panel of medico-economic indicators and to establish the medical service delivered and the opportunities in order to capture the full benefit of the proposed technology.","authors":["Strola S.A.","Castillejo A.","Moreau-Gaudry A."],"cit_count":0,"doi":"10.3233/SHTI190336","journal":"Studies in Health Technology and Informatics","pmid":"31438037","title":"SERENE-IoT project: How the maturation cycle allows the correct development process of innovative technologies in the healthcare domain","year":"2019-08-21"}],"summary":{"biotoolsCURIE":"biotools:SERENE-IoT_project","biotoolsID":"SERENE-IoT_project","description":"> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'SERENE-IoT', 'innovation', 'ibjective', 'medico-economic' | How the Maturation Cycle Allows the Correct Development Process of Innovative Technologies in the Healthcare Domain | This article illustrates the maturation process of innovative technologies in the healthcare domain. The role and the involvement of the stakeholders are explained, as well their interaction in the ecosystem. We focus on how the synergy between partners improves efficiency, boosts product development and accelerates market access. The spiral of the innovation concept is introduced to illustrate the different stages ensuring the correct development of a medical technology. This iterative cycle drives the product maturation, according to medical needs and feedback, and ensures the correct implementation of the innovation in the clinical framework","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31438037","name":"SERENE-IoT project"}}