{
    "additionDate": "2020-01-14T09:49:02Z",
    "biotoolsCURIE": "biotools:demineralized_enamel_demineralized_enamel",
    "biotoolsID": "demineralized_enamel_demineralized_enamel",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "cesar.pucci@unesp.br",
            "name": "Cesar Rogério Pucci",
            "orcidid": "https://orcid.org/0000-0003-4830-0400",
            "typeEntity": "Person"
        }
    ],
    "description": "Adhesive systems effect over bond strength of resin-infiltrated and de/remineralized enamel.\n\nBackground: The purpose of this study was to evaluate the effect of different bonding agents on bond-strength to demineralized enamel after remineralizing treatments and resin infiltration. Methods: Buccal enamel of 120 bovine incisors was polished and then were divided into five experimental groups: SE (sound enamel); DE (demineralized enamel); AS (demineralized enamel immersed in artificial saliva for eight weeks); NaF (demineralized enamel treated with 0.05% sodium fluoride solution (one minute) for eight weeks); Ic (demineralized enamel infiltrated with a low-viscosity resin (Icon-DGM).\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'demineralized enamel demineralized enamel immersed', 'enamel demineralized enamel', 'demineralized enamel', 'demineralized enamel demineralized'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31723426",
    "lastUpdate": "2020-01-14T09:49:02Z",
    "name": "demineralized enamel demineralized enamel",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.20523.1",
            "metadata": {
                "abstract": "© 2019 Borges AB et al.Background: The purpose of this study was to evaluate the effect of different bonding agents on bond-strength to demineralized enamel after remineralizing treatments and resin infiltration. Methods: Buccal enamel of 120 bovine incisors was polished and then were divided into five experimental groups: SE (sound enamel); DE (demineralized enamel); AS (demineralized enamel immersed in artificial saliva for eight weeks); NaF (demineralized enamel treated with 0.05% sodium fluoride solution (one minute) for eight weeks); Ic (demineralized enamel infiltrated with a low-viscosity resin (Icon-DGM). These groups were subdivided according to adhesive system used: Self-etching adhesive Adper Easy One (3M/ESPE) and etch-and-rinse adhesive Single Bond (3M/ESPE). The composite resin blocks were fabricated using a Teflon matrix. A thermomechanical cycling machine was used to carry out the artificial aging of the specimens and thus were sectioned into sticks. The microtensile tests were performed using a universal testing machine at a cross-head speed of 1 mm/min. Data (in MPa) were subjected to two-way ANOVA and Tukey’s tests (5%). Results: Significant differences were found for both factors tested and interactions (p<0.05). Tukey’s test results of µTBS (mean ± SD) were: Etch-and-rinse SE (28.79±3.93); DE (30.41±7.22); AS (29.03±3.33); NaF (29.81±4.06)a; Ic (29.47±5.5); and self-etching SE (30.37±6.96); DE (14.62±4.47); AS (9.79±2.32); NaF (9.36±2.31); Ic (30.78±8.68). Conclusions: Resin infiltration did not affect the bond strength of demineralized enamel for both adhesive systems tested. For etch-and-rinse adhesive, no differences were observed for the tested groups. For self-etching adhesive, only the resin-infiltrated group showed similar bond strength to sound enamel. Both etch-and-rinse and self-etching adhesive systems can be used in resin-infiltrated enamel, if a composite restoration needs to be further performed. In enamel that has undergone the de/remineralization process, the use of a total-etch adhesive might be preferable for the restorative procedure.",
                "authors": [
                    {
                        "name": "Borges A.B."
                    },
                    {
                        "name": "Abu Hasna A."
                    },
                    {
                        "name": "Matuda A.G.N."
                    },
                    {
                        "name": "Lopes S.R."
                    },
                    {
                        "name": "Mafetano A.P.V.P."
                    },
                    {
                        "name": "Arantes A."
                    },
                    {
                        "name": "Duarte A.F."
                    },
                    {
                        "name": "Barcellos D.C."
                    },
                    {
                        "name": "Torres C.R.G."
                    },
                    {
                        "name": "Pucci C.R."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-11T00:00:00Z",
                "journal": "F1000Research",
                "title": "Adhesive systems effect over bond strength of resin-infiltrated and de/remineralized enamel [version 1; peer review: 2 approved]"
            },
            "pmcid": "PMC6833993",
            "pmid": "31723426"
        }
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}