
{
    "credit": [
        {
            "name": "bioinf.uni-leipzig.de",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "pkerp@tbi.univie.ac.at",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/pkerpedjiev/ernwin"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    }
                }
            ],
            "note": "Prediction of RNA tertiary structure. Fasta with dot-bracket strings Ernwin coarse-grain RNA structure files",
            "operation": [
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Structure",
                        "uri": "http://edamontology.org/data_0883"
                    },
                    "format": [
                        {
                            "term": "Tertiary structure format",
                            "uri": "http://edamontology.org/format_2033"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Kerpedjiev et al.; Published by Cold Spring Harbor Laboratory Press for the RNA Society. A 3D model of RNA structure can provide information about its function and regulation that is not possible with just the sequence or secondary structure. Current models suffer from low accuracy and long running times and either neglect or presume knowledge of the long-range interactions which stabilize the tertiary structure. Our coarse-grained, helix-based, tertiary structure model operates with only a few degrees of freedom compared with all-atom models while preserving the ability to sample tertiary structures given a secondary structure. It strikes a balance between the precision of an all-atom tertiary structure model and the simplicity and effectiveness of a secondary structure representation. It provides a simplified tool for exploring global arrangements of helices and loops within RNA structures. We provide an example of a novel energy function relying only on the positions of stems and loops. We show that coupling our model to this energy function produces predictions as good as or better than the current state of the art tools. We propose that given the wide range of conformational space that needs to be explored, a coarse-grain approach can explore more conformations in less iterations than an all-atom model coupled to a fine-grain energy function. Finally, we emphasize the overarching theme of providing an ensemble of predicted structures, something which our tool excels at, rather than providing a handful of the lowest energy structures.",
            "authors": [
                "Kerpedjiev P.",
                "Honer Zu Siederdissen C.",
                "Hofacker I.L."
            ],
            "cit_count": 22,
            "doi": "10.1261/rna.047522.114",
            "journal": "RNA (New York, N.Y.)",
            "title": "Predicting RNA 3D structure using a coarse-grain helix-centered model",
            "type": "Primary",
            "year": "2015-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ernwin",
        "biotoolsID": "ernwin",
        "description": "A tool for predicting coarse grain RNA tertiary structures. Create models of the tertiary structure of RNA molecules starting from the secondary structure. The resulting models contain the positions of the helices and loops in 3D.",
        "homepage": "https://github.com/pkerpedjiev/ernwin",
        "name": "Ernwin",
        "version": [
            "0.1"
        ]
    }
}