{
    "accessibility": "Open access",
    "additionDate": "2021-12-14T23:53:08.257529Z",
    "biotoolsCURIE": "biotools:rsatrace3d",
    "biotoolsID": "rsatrace3d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yuga@affrc.go.jp",
            "name": "Yusaku Uga",
            "orcidid": "https://orcid.org/0000-0003-4006-954X",
            "typeEntity": "Person"
        },
        {
            "name": "Shota Teramoto"
        },
        {
            "name": "Takanari Tanabata"
        }
    ],
    "description": "RSAtrace3D is a vectorization software to measure RSA (root system architecture) traits of monocot plants from 3D volume data such as X-ray CT images.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/st707311g/RSAtrace3D/tree/master/manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/st707311g/RSAtrace3D",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-14T23:53:08.260090Z",
    "license": "Other",
    "name": "RSAtrace3D",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12870-021-03161-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The root distribution in the soil is one of the elements that comprise the root system architecture (RSA). In monocots, RSA comprises radicle and crown roots, each of which can be basically represented by a single curve with lateral root branches or approximated using a polyline. Moreover, RSA vectorization (polyline conversion) is useful for RSA phenotyping. However, a robust software that can enable RSA vectorization while using noisy three-dimensional (3D) volumes is unavailable. Results: We developed RSAtrace3D, which is a robust 3D RSA vectorization software for monocot RSA phenotyping. It manages the single root (radicle or crown root) as a polyline (a vector), and the set of the polylines represents the entire RSA. RSAtrace3D vectorizes root segments between the two ends of a single root. By utilizing several base points on the root, RSAtrace3D suits noisy images if it is difficult to vectorize it using only two end nodes of the root. Additionally, by employing a simple tracking algorithm that uses the center of gravity (COG) of the root voxels to determine the tracking direction, RSAtrace3D efficiently vectorizes the roots. Thus, RSAtrace3D represents the single root shape more precisely than straight lines or spline curves. As a case study, rice (Oryza sativa) RSA was vectorized from X-ray computed tomography (CT) images, and RSA traits were calculated. In addition, varietal differences in RSA traits were observed. The vector data were 32,000 times more compact than raw X-ray CT images. Therefore, this makes it easier to share data and perform re-analyses. For example, using data from previously conducted studies. For monocot plants, the vectorization and phenotyping algorithm are extendable and suitable for numerous applications. Conclusions: RSAtrace3D is an RSA vectorization software for 3D RSA phenotyping for monocots. Owing to the high expandability of the RSA vectorization and phenotyping algorithm, RSAtrace3D can be applied not only to rice in X-ray CT images but also to other monocots in various 3D images. Since this software is written in Python language, it can be easily modified and will be extensively applied by researchers in this field.",
                "authors": [
                    {
                        "name": "Tanabata T."
                    },
                    {
                        "name": "Teramoto S."
                    },
                    {
                        "name": "Uga Y."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Plant Biology",
                "title": "RSAtrace3D: robust vectorization software for measuring monocot root system architecture"
            },
            "pmcid": "PMC8390230",
            "pmid": "34433428"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
