{
    "accessibility": "Open access",
    "additionDate": "2023-01-20T00:54:45.074253Z",
    "biotoolsCURIE": "biotools:sspa_py",
    "biotoolsID": "sspa_py",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Cecilia Wieder",
            "orcidid": "http://orcid.org/0000-0003-1548-4346"
        },
        {
            "name": "Rachel PJ Lai",
            "orcidid": "http://orcid.org/0000-0003-3418-850X"
        },
        {
            "name": "Timothy Ebbels",
            "orcidid": "http://orcid.org/0000-0002-3372-8423"
        }
    ],
    "description": "sspa provides a Python interface for metabolomics pathway analysis. In addition to conventional methods over-representation analysis (ORA) and gene/metabolite set enrichment analysis (GSEA), it also provides a wide range of single-sample pathway analysis (ssPA) methods.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://cwieder.github.io/py-ssPA/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/sspa/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:11:21.269181Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://zenodo.org/record/7515344"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cwieder/py-ssPA"
        }
    ],
    "name": "ssPA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-022-05005-1",
            "metadata": {
                "abstract": "Background: Single sample pathway analysis (ssPA) transforms molecular level omics data to the pathway level, enabling the discovery of patient-specific pathway signatures. Compared to conventional pathway analysis, ssPA overcomes the limitations by enabling multi-group comparisons, alongside facilitating numerous downstream analyses such as pathway-based machine learning. While in transcriptomics ssPA is a widely used technique, there is little literature evaluating its suitability for metabolomics. Here we provide a benchmark of established ssPA methods (ssGSEA, GSVA, SVD (PLAGE), and z-score) alongside the evaluation of two novel methods we propose: ssClustPA and kPCA, using semi-synthetic metabolomics data. We then demonstrate how ssPA can facilitate pathway-based interpretation of metabolomics data by performing a case-study on inflammatory bowel disease mass spectrometry data, using clustering to determine subtype-specific pathway signatures. Results: While GSEA-based and z-score methods outperformed the others in terms of recall, clustering/dimensionality reduction-based methods provided higher precision at moderate-to-high effect sizes. A case study applying ssPA to inflammatory bowel disease data demonstrates how these methods yield a much richer depth of interpretation than conventional approaches, for example by clustering pathway scores to visualise a pathway-based patient subtype-specific correlation network. We also developed the sspa python package (freely available at https://pypi.org/project/sspa/), providing implementations of all the methods benchmarked in this study. Conclusion: This work underscores the value ssPA methods can add to metabolomic studies and provides a useful reference for those wishing to apply ssPA methods to metabolomics data.",
                "authors": [
                    {
                        "name": "Ebbels T.M.D."
                    },
                    {
                        "name": "Lai R.P.J."
                    },
                    {
                        "name": "Wieder C."
                    }
                ],
                "citationCount": 9,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Single sample pathway analysis in metabolomics: performance evaluation and application"
            },
            "pmcid": "PMC9664704",
            "pmid": "36376837"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
