{
    "name": "GRS", 
    "description": "Reference-based data compression for storage of resequencing data.", 
    "homepage": "http://gmdd.shgmo.org/Computational-Biology/GRS", 
    "biotoolsID": "grs", 
    "biotoolsCURIE": "biotools:grs", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0335", 
                    "term": "Formatting"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3071", 
            "term": "Data management"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Shell", 
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21266471", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "A novel compression tool for efficient storage of genome resequencing data", 
                "abstract": "With the advent of DNA sequencing technologies, more and more reference genome sequences are available for many organisms. Analyzing sequence variation and understanding its biological importance are becoming a major research aim. However, how to store and process the huge amount of eukaryotic genome data, such as those of the human, mouse and rice, has become a challenge to biologists. Currently available bioinformatics tools used to compress genome sequence data have some limitations, such as the requirement of the reference single nucleotide polymorphisms (SNPs) map and information on deletions and insertions. Here, we present a novel compression tool for storing and analyzing Genome ReSequencing data, named GRS. GRS is able to process the genome sequence data without the use of the reference SNPs and other sequence variation information and automatically rebuild the individual genome sequence data using the reference genome sequence. When its performance was tested on the first Korean personal genome sequence data set, GRS was able to achieve ∼159-fold compression, reducing the size of the data from 2986.8 to 18.8 MB. While being tested against the sequencing data from rice and Arabidopsis thaliana, GRS compressed the 361.0 MB rice genome data to 4.4 MB, and the A. thaliana genome data from 115.1MB to 6.5KB. This de novo compression tool is available at http://gmdd.shgmo.org/Computational-Biology/GRS. © 2011 The Author(s).", 
                "date": "2011-04-01T00:00:00Z", 
                "citationCount": 55, 
                "authors": [
                    {
                        "name": "Wang C."
                    }, 
                    {
                        "name": "Zhang D."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:14:59Z", 
    "lastUpdate": "2018-12-11T18:40:17Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}