{
    "accessibility": "Open access",
    "additionDate": "2021-11-19T20:50:24.977633Z",
    "biotoolsCURIE": "biotools:cancercocoputs",
    "biotoolsID": "cancercocoputs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Chava.kimchi-sarfaty@fda.hhs.gov",
            "name": "Chava Kimchi-Sarfaty",
            "orcidid": "https://orcid.org/0000-0002-9355-8585",
            "typeEntity": "Person"
        }
    ],
    "description": "Distinct signatures of codon and codon pair usage in 32 primary tumor types in the novel database CancerCoCoPUTs for cancer-specific codon usage.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage table generation",
                    "uri": "http://edamontology.org/operation_0284"
                },
                {
                    "term": "Codon usage bias calculation",
                    "uri": "http://edamontology.org/operation_2962"
                },
                {
                    "term": "Codon usage table comparison",
                    "uri": "http://edamontology.org/operation_0285"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://dnahive.fda.gov/review/cancercocoputs/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-19T20:50:24.980359Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/FDA/Cancer-CoCoPUTs"
        }
    ],
    "name": "CancerCoCoPUTs",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S13073-021-00935-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Gene expression is highly variable across tissues of multi-cellular organisms, influencing the codon usage of the tissue-specific transcriptome. Cancer disrupts the gene expression pattern of healthy tissue resulting in altered codon usage preferences. The topic of codon usage changes as they relate to codon demand, and tRNA supply in cancer is of growing interest. Methods: We analyzed transcriptome-weighted codon and codon pair usage based on The Cancer Genome Atlas (TCGA) RNA-seq data from 6427 solid tumor samples and 632 normal tissue samples. This dataset represents 32 cancer types affecting 11 distinct tissues. Our analysis focused on tissues that give rise to multiple solid tumor types and cancer types that are present in multiple tissues. Results: We identified distinct patterns of synonymous codon usage changes for different cancer types affecting the same tissue. For example, a substantial increase in GGT-glycine was observed in invasive ductal carcinoma (IDC), invasive lobular carcinoma (ILC), and mixed invasive ductal and lobular carcinoma (IDLC) of the breast. Change in synonymous codon preference favoring GGT correlated with change in synonymous codon preference against GGC in IDC and IDLC, but not in ILC. Furthermore, we examined the codon usage changes between paired healthy/tumor tissue from the same patient. Using clinical data from TCGA, we conducted a survival analysis of patients based on the degree of change between healthy and tumor-specific codon usage, revealing an association between larger changes and increased mortality. We have also created a database that contains cancer-specific codon and codon pair usage data for cancer types derived from TCGA, which represents a comprehensive tool for codon-usage-oriented cancer research. Conclusions: Based on data from TCGA, we have highlighted tumor type-specific signatures of codon and codon pair usage. Paired data revealed variable changes to codon usage patterns, which must be considered when designing personalized cancer treatments. The associated database, CancerCoCoPUTs, represents a comprehensive resource for codon and codon pair usage in cancer and is available at https://dnahive.fda.gov/review/cancercocoputs/. These findings are important to understand the relationship between tRNA supply and codon demand in cancer states and could help guide the development of new cancer therapeutics.",
                "authors": [
                    {
                        "name": "Meyer D."
                    },
                    {
                        "name": "Kames J."
                    },
                    {
                        "name": "Bar H."
                    },
                    {
                        "name": "Komar A.A."
                    },
                    {
                        "name": "Alexaki A."
                    },
                    {
                        "name": "Ibla J."
                    },
                    {
                        "name": "Hunt R.C."
                    },
                    {
                        "name": "Santana-Quintero L.V."
                    },
                    {
                        "name": "Golikov A."
                    },
                    {
                        "name": "DiCuccio M."
                    },
                    {
                        "name": "Kimchi-Sarfaty C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Distinct signatures of codon and codon pair usage in 32 primary tumor types in the novel database CancerCoCoPUTs for cancer-specific codon usage"
            },
            "pmcid": "PMC8317675",
            "pmid": "34321100"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}