{
    "additionDate": "2017-01-17T15:02:25Z",
    "biotoolsCURIE": "biotools:moonlightr",
    "biotoolsID": "moonlightr",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "antonio.colaprico@ulb.ac.be",
            "name": "Antonio Colaprico",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "colsen@ulb.ac.be",
            "name": "Catharina Olsen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The understanding of cancer mechanism requires the identification of genes playing a role in the development of the pathology and the characterization of their role. We present an R/bioconductor package which returns a list of candidate driver genes for specific cancer types based on TCGA expression data. First infers gene regulatory networks and then carries out a functional enrichment analysis to score the importance of well-known biological processes with respect to the studied cancer type.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/MoonlightR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MoonlightR_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/MoonlightR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-15T01:43:10Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/torongs82/Moonlight"
        }
    ],
    "name": "MoonlightR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1016/j.spinee.2017.04.022",
            "metadata": {
                "abstract": "© 2017 Elsevier Inc.Background Context Lateral lumbar interbody fusion (LLIF) is a frequently used technique for the treatment of lumbar pathology. Despite its overall success, LLIF has been associated with a unique set of complications. However, there has been inconsistent evidence regarding the complication rate of this approach. Purpose To perform a systematic review analyzing the rates of medical and surgical complications associated with LLIF. Study Design Systematic review. Patient Sample 6,819 patients who underwent LLIF reported in clinical studies through June 2016. Outcome Measures Frequency of complications within cardiac, vascular, pulmonary, urologic, gastrointestinal, transient neurologic, persistent neurologic, and spine (MSK) categories. Methods This systematic review was performed using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. Relevant studies that identified rates of any complication following LLIF procedures were obtained from PubMed, MEDLINE, and EMBASE databases. Articles were excluded if they did not report complications, presented mixed complication data from other procedures, or were characterized as single case reports, reviews, or case series containing less than 10 patients. The primary outcome was frequency of complications within cardiac, vascular, pulmonary, urologic, gastrointestinal, transient neurologic, persistent neurologic, and MSK categories. All rates of complications were based on the sample sizes of studies that mentioned the respective complications. The authors report no conflicts of interest directly or indirectly related to this work, and have not received any funds in support of this work. Results A total of 2,232 articles were identified. Following screening of title, abstract, and full-text availability, 63 articles were included in the review. A total of 6,819 patients had 11,325 levels fused. The rate of complications for the categories included were as follows: wound (1.38%; 95% confidence interval [CI]=1.00%–1.85%), cardiac (1.86%; CI=1.33%–2.52%), vascular (0.81%; CI=0.44%–1.36%), pulmonary (1.47; CI=0.95%–2.16%), gastrointestinal (1.38%; CI=1.00%–1.87%), urologic (0.93%; CI=0.55%–1.47%), transient neurologic (36.07%; CI=34.74%–37.41%), persistent neurologic (3.98%; CI=3.42%–4.60%), and MSK or spine (9.22%; CI=8.28%–10.23%). Conclusions The current study is the first to comprehensively analyze the complication profile for LLIFs. The most significant reported complications were transient neurologic in nature. However, persistent neurologic complications occurred at a much lower rate, bringing into question the significance of transient symptoms beyond the immediate postoperative period. Through this analysis of complication profiles, surgeons can better understand the risks to and expectations for patients following LLIF procedures.",
                "authors": [
                    {
                        "name": "Ahn J."
                    },
                    {
                        "name": "Bohl D.D."
                    },
                    {
                        "name": "DiBattista J.V."
                    },
                    {
                        "name": "Hijji F.Y."
                    },
                    {
                        "name": "Kudaravalli K.T."
                    },
                    {
                        "name": "Long W.W."
                    },
                    {
                        "name": "Narain A.S."
                    },
                    {
                        "name": "Singh K."
                    }
                ],
                "citationCount": 34,
                "date": "2017-10-01T00:00:00Z",
                "journal": "Spine Journal",
                "title": "Lateral lumbar interbody fusion: a systematic review of complication rates"
            },
            "pmid": "28456671",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}
