{
    "additionDate": "2021-01-18T10:53:00Z",
    "biotoolsCURIE": "biotools:ldnfsgb",
    "biotoolsID": "ldnfsgb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xpgao@xtu.edu.cn",
            "name": "Xieping Gao",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of long non-coding rna and disease association using network feature similarity and gradient boosting.\n\nLDNFSGB:Predicting lncRNA-disease associations using network feature similarity and gradient boosting.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MLMIP/LDNFSGB",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-12T11:28:01Z",
    "name": "LDNFSGB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03721-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: A large number of experimental studies show that the mutation and regulation of long non-coding RNAs (lncRNAs) are associated with various human diseases. Accurate prediction of lncRNA-disease associations can provide a new perspective for the diagnosis and treatment of diseases. The main function of many lncRNAs is still unclear and using traditional experiments to detect lncRNA-disease associations is time-consuming. Results: In this paper, we develop a novel and effective method for the prediction of lncRNA-disease associations using network feature similarity and gradient boosting (LDNFSGB). In LDNFSGB, we first construct a comprehensive feature vector to effectively extract the global and local information of lncRNAs and diseases through considering the disease semantic similarity (DISSS), the lncRNA function similarity (LNCFS), the lncRNA Gaussian interaction profile kernel similarity (LNCGS), the disease Gaussian interaction profile kernel similarity (DISGS), and the lncRNA-disease interaction (LNCDIS). Particularly, two methods are used to calculate the DISSS (LNCFS) for considering the local and global information of disease semantics (lncRNA functions) respectively. An autoencoder is then used to reduce the dimensionality of the feature vector to obtain the optimal feature parameter from the original feature set. Furthermore, we employ the gradient boosting algorithm to obtain the lncRNA-disease association prediction. Conclusions: In this study, hold-out, leave-one-out cross-validation, and ten-fold cross-validation methods are implemented on three publicly available datasets to evaluate the performance of LDNFSGB. Extensive experiments show that LDNFSGB dramatically outperforms other state-of-the-art methods. The case studies on six diseases, including cancers and non-cancers, further demonstrate the effectiveness of our method in real-world applications.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Ye F."
                    },
                    {
                        "name": "Xiong D."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Gao X."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LDNFSGB: Prediction of long non-coding rna and disease association using network feature similarity and gradient boosting"
            },
            "pmcid": "PMC7469344",
            "pmid": "32883200"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}