{
    "additionDate": "2020-01-14T09:45:34Z",
    "biotoolsCURIE": "biotools:Nero",
    "biotoolsID": "Nero",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "maria.strillacci@unimi.it",
            "name": "Maria G. Strillacci",
            "typeEntity": "Person"
        },
        {
            "email": "roman.sergio@inifap.gob.mx",
            "name": "Sergio I. Román-Ponce",
            "typeEntity": "Person"
        }
    ],
    "description": "Copy Number Variation Mapping and Genomic Variation of Autochthonous and Commercial Turkey Populations.\n\nAsini - Avicoli - Bovini - Cani - Cavalli - Cavie - Conigli - Gatti - Ovicaprini - Pesci - Polli - Suini - Fauna - Frutteti - Erbacee - Fiori - Alberi - Insetti - Estimo - Prodotti tipici - Funghi - Parchi.\n\nSi tratta di un tacchino la cui selezione è stata curata da un gruppo di allevatori lombardi che, operando una sorta di controselezione volta a ridurre la taglia degli animali, sono riusciti ad ottenere animali di piccola taglia.\n\nOrigine, diffusione e caratteristiche economiche.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'pvclust', 'CNVRs', 'turkey', 'Ermellinato'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://www.agraria.org/tacchini/neroitalia.htm",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:45:34Z",
    "name": "Nero",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00982",
            "metadata": {
                "abstract": "© 2019 Strillacci, Gorla, Ríos-Utrera, Vega-Murillo, Montaño-Bermudez, Garcia-Ruiz, Cerolini, Román-Ponce and Bagnato.This study aims at investigating genomic diversity of several turkey populations using Copy Number Variants (CNVs). A total of 115 individuals from six Italian breeds (Colle Euganei, Bronzato Comune Italiano, Parma e Piacenza, Brianzolo, Nero d’Italia, and Ermellinato di Rovigo), seven Narragansett, 38 commercial hybrids, and 30 Mexican turkeys, were genotyped with the Affymetrix 600K single nucleotide polymorphism (SNP) turkey array. The CNV calling was performed with the Hidden Markov Model of PennCNV software and with the Copy Number Analysis Module of SVS 8.4 by Golden Helix®. CNV were summarized into CNV regions (CNVRs) at population level using BEDTools. Variability among populations has been addressed by hierarchical clustering (pvclust R package) and by principal component analysis (PCA). A total of 2,987 CNVs were identified covering 4.65% of the autosomes of the Turkey_5.0/melGal5 assembly. The CNVRs identified in at least two individuals were 362—189 gains, 116 losses, and 57 complexes. Among these regions the 51% contain annotated genes. This study is the first CNV mapping of turkey population using 600K chip. CNVs clustered the individuals according to population and their geographical origin. CNVs are known to be indicators also of adaptation, as some researches in different species are suggesting.",
                "authors": [
                    {
                        "name": "Strillacci M.G."
                    },
                    {
                        "name": "Gorla E."
                    },
                    {
                        "name": "Rios-Utrera A."
                    },
                    {
                        "name": "Vega-Murillo V.E."
                    },
                    {
                        "name": "Montano-Bermudez M."
                    },
                    {
                        "name": "Garcia-Ruiz A."
                    },
                    {
                        "name": "Cerolini S."
                    },
                    {
                        "name": "Roman-Ponce S.I."
                    },
                    {
                        "name": "Bagnato A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Copy number variation mapping and genomic variation of autochthonous and commercial turkey populations"
            },
            "pmcid": "PMC6828962",
            "pmid": "31737031"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ]
}