{
    "additionDate": "2020-01-14T19:35:43Z",
    "biotoolsCURIE": "biotools:GenoSurf",
    "biotoolsID": "GenoSurf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "arif.canakoglu@polimi.it",
            "name": "Arif Canakoglu",
            "typeEntity": "Person"
        }
    ],
    "description": "metadata driven semantic search system for integrated genomic datasets.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genosurf/api/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://geco.deib.polimi.it/genosurf/",
    "lastUpdate": "2020-12-03T08:41:22.615745Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genosurf/dump/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genosurf/survey/"
        }
    ],
    "name": "GenoSurf",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ132",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Many valuable resources developed by world-wide research institutions and consortia describe genomic datasets that are both open and available for secondary research, but their metadata search interfaces are heterogeneous, not interoperable and sometimes with very limited capabilities. We implemented GenoSurf, a multi-ontology semantic search system providing access to a consolidated collection of metadata attributes found in the most relevant genomic datasets; values of 10 attributes are semantically enriched by making use of the most suited available ontologies. The user of GenoSurf provides as input the search terms, sets the desired level of ontological enrichment and obtains as output the identity of matching data files at the various sources. Search is facilitated by drop-down lists of matching values; aggregate counts describing resulting files are updated in real time while the search terms are progressively added. In addition to the consolidated attributes, users can perform keyword-based searches on the original (raw) metadata, which are also imported; GenoSurf supports the interplay of attribute-based and keyword-based search through well-defined interfaces. Currently, GenoSurf integrates about 40 million metadata of several major valuable data sources, including three providers of clinical and experimental data (TCGA, ENCODE and Roadmap Epigenomics) and two sources of annotation data (GENCODE and RefSeq); it can be used as a standalone resource for targeting the genomic datasets at their original sources (identified with their accession IDs and URLs), or as part of an integrated query answering system for performing complex queries over genomic regions and metadata.",
                "authors": [
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Colombo A."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Ceri S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "GenoSurf: metadata driven semantic search system for integrated genomic datasets"
            },
            "pmcid": "PMC6902006",
            "pmid": "31820804"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}