{
    "additionDate": "2017-01-17T15:04:05Z",
    "biotoolsCURIE": "biotools:ddgraph",
    "biotoolsID": "ddgraph",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "adryan@sysbiol.cam.ac.uk",
            "name": "Boris Adryan",
            "orcidid": "http://orcid.org/0000-0003-4588-7867",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "robert.stojnic@gmail.com",
            "name": "Robert Stojnic",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Distinguish direct from indirect interactions in gene regulation and infer combinatorial code from highly correlated variables such as transcription factor binding profiles. The package implements the Neighbourhood Consistent PC algorithm (NCPC) and draws Direct Dependence Graphs to represent dependence structure around a target variable. The package also provides a unified interface to other Graphical Modelling (Bayesian Network) packages for distinguishing direct and indirect interactions.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/ddgraph.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ddgraph_1.18.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/ddgraph.html",
    "homepage_status": 1,
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-17T13:03:14Z",
    "license": "GPL-3.0",
    "name": "ddgraph",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1002725",
            "metadata": {
                "abstract": "Inferring the combinatorial regulatory code of transcription factors (TFs) from genome-wide TF binding profiles is challenging. A major reason is that TF binding profiles significantly overlap and are therefore highly correlated. Clustered occurrence of multiple TFs at genomic sites may arise from chromatin accessibility and local cooperation between TFs, or binding sites may simply appear clustered if the profiles are generated from diverse cell populations. Overlaps in TF binding profiles may also result from measurements taken at closely related time intervals. It is thus of great interest to distinguish TFs that directly regulate gene expression from those that are indirectly associated with gene expression. Graphical models, in particular Bayesian networks, provide a powerful mathematical framework to infer different types of dependencies. However, existing methods do not perform well when the features (here: TF binding profiles) are highly correlated, when their association with the biological outcome is weak, and when the sample size is small. Here, we develop a novel computational method, the Neighbourhood Consistent PC (NCPC) algorithms, which deal with these scenarios much more effectively than existing methods do. We further present a novel graphical representation, the Direct Dependence Graph (DDGraph), to better display the complex interactions among variables. NCPC and DDGraph can also be applied to other problems involving highly correlated biological features. Both methods are implemented in the R package ddgraph, available as part of Bioconductor (http://bioconductor.org/packages/2.11/bioc/html/ddgraph.html). Applied to real data, our method identified TFs that specify different classes of cis-regulatory modules (CRMs) in Drosophila mesoderm differentiation. Our analysis also found depletion of the early transcription factor Twist binding at the CRMs regulating expression in visceral and somatic muscle cells at later stages, which suggests a CRM-specific repression mechanism that so far has not been characterised for this class of mesodermal CRMs. © 2012 Stojnic et al.",
                "authors": [
                    {
                        "name": "Adryan B."
                    },
                    {
                        "name": "Fu A.Q."
                    },
                    {
                        "name": "Stojnic R."
                    }
                ],
                "citationCount": 3,
                "date": "2012-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "A Graphical Modelling Approach to the Dissection of Highly Correlated Transcription Factor Binding Site Profiles"
            },
            "pmcid": "PMC3493460",
            "pmid": "23144600",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1,
    "version": [
        "1.18.0"
    ]
}
