{
    "additionDate": "2021-12-06T13:33:36.893144Z",
    "biotoolsCURIE": "biotools:sumgnn",
    "biotoolsID": "sumgnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cao.xiao@iqvia.com",
            "name": "Cao Xiao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SumGNN is a tool for multi-typed drug interaction prediction via efficient knowledge graph summarization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yueyu1030/SumGNN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:14:51.556147Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/yueyu1030/SumGNN/issues"
        }
    ],
    "name": "SumGNN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab207",
            "metadata": {
                "abstract": "Motivation: Thanks to the increasing availability of drug-drug interactions (DDI) datasets and large biomedical knowledge graphs (KGs), accurate detection of adverse DDI using machine learning models becomes possible. However, it remains largely an open problem how to effectively utilize large and noisy biomedical KG for DDI detection. Due to its sheer size and amount of noise in KGs, it is often less beneficial to directly integrate KGs with other smaller but higher quality data (e.g. experimental data). Most of existing approaches ignore KGs altogether. Some tries to directly integrate KGs with other data via graph neural networks with limited success. Furthermore most previous works focus on binary DDI prediction whereas the multi-typed DDI pharmacological effect prediction is more meaningful but harder task. Results: To fill the gaps, we propose a new method SumGNN: knowledge summarization graph neural network, which is enabled by a subgraph extraction module that can efficiently anchor on relevant subgraphs from a KG, a self-attention based subgraph summarization scheme to generate reasoning path within the subgraph, and a multi-channel knowledge and data integration module that utilizes massive external biomedical knowledge for significantly improved multi-typed DDI predictions. SumGNN outperforms the best baseline by up to 5.54%, and performance gain is particularly significant in low data relation types. In addition, SumGNN provides interpretable prediction via the generated reasoning paths for each prediction.",
                "authors": [
                    {
                        "name": "Glass L.M."
                    },
                    {
                        "name": "Huang K."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Xiao C."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "citationCount": 106,
                "date": "2021-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SumGNN: multi-typed drug interaction prediction via efficient knowledge graph summarization"
            },
            "pmcid": "PMC10060701",
            "pmid": "33769494",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
