{
    "additionDate": "2017-12-18T00:05:24Z",
    "biotoolsCURIE": "biotools:cpgavas",
    "biotoolsID": "cpgavas",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.herbalgenomics.org/"
        }
    ],
    "description": "CPGAVAS (Chloroplast Genome Annotation, Visualization, Analysis, and GenBank Submission) is a web server which allows accurate genome annotation, the generation of circular chloroplast genome maps, the provision of useful analysis results of the annotated genome, the creation of files that can be submitted to GenBank directly.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.herbalgenomics.org/0506/cpgavas/analyzer/documents"
        }
    ],
    "editPermission": {
        "authors": [
            "Zamarak"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Submission",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Generation",
                    "uri": "http://edamontology.org/operation_3429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://www.herbalgenomics.org/0506/cpgavas/analyzer/home",
    "lastUpdate": "2019-01-17T22:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cpgavas-20130506-chloroplast-genome-annotation-visualization-analysis-genbank-submission-tool.html"
        }
    ],
    "name": "CpGAVAS",
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-13-715",
            "metadata": {
                "abstract": "Background: The complete sequences of chloroplast genomes provide wealthy information regarding the evolutionary history of species. With the advance of next-generation sequencing technology, the number of completely sequenced chloroplast genomes is expected to increase exponentially, powerful computational tools annotating the genome sequences are in urgent need.Results: We have developed a web server CPGAVAS. The server accepts a complete chloroplast genome sequence as input. First, it predicts protein-coding and rRNA genes based on the identification and mapping of the most similar, full-length protein, cDNA and rRNA sequences by integrating results from Blastx, Blastn, protein2genome and est2genome programs. Second, tRNA genes and inverted repeats (IR) are identified using tRNAscan, ARAGORN and vmatch respectively. Third, it calculates the summary statistics for the annotated genome. Fourth, it generates a circular map ready for publication. Fifth, it can create a Sequin file for GenBank submission. Last, it allows the extractions of protein and mRNA sequences for given list of genes and species. The annotation results in GFF3 format can be edited using any compatible annotation editing tools. The edited annotations can then be uploaded to CPGAVAS for update and re-analyses repeatedly. Using known chloroplast genome sequences as test set, we show that CPGAVAS performs comparably to another application DOGMA, while having several superior functionalities.Conclusions: CPGAVAS allows the semi-automatic and complete annotation of a chloroplast genome sequence, and the visualization, editing and analysis of the annotation results. It will become an indispensible tool for researchers studying chloroplast genomes. The software is freely accessible from http://www.herbalgenomics.org/cpgavas. © 2012 Liu et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Shi L."
                    },
                    {
                        "name": "Zhu Y."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Guan X."
                    }
                ],
                "citationCount": 378,
                "date": "2012-12-20T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "CpGAVAS, an integrated web server for the annotation, visualization, analysis, and GenBank submission of completely sequenced chloroplast genome sequences"
            },
            "pmcid": "PMC3543216",
            "pmid": "23256920",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "20130506"
    ]
}