{
    "additionDate": "2021-03-19T09:00:49Z",
    "biotoolsCURIE": "biotools:dexom",
    "biotoolsID": "dexom",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fabien.jourdan@inrae.fr",
            "name": "Fabien Jourdan",
            "orcidid": "https://orcid.org/0000-0001-9401-2894",
            "typeEntity": "Person"
        }
    ],
    "description": "DEXOM is a Matlab library for the reconstruction and enumeration of diverse optimal context-specific metabolic networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MetExplore/dexom",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-27T20:40:36Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MetExplore/dexom/issues"
        }
    ],
    "name": "DEXOM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008730",
            "metadata": {
                "abstract": "Copyright: © 2021 Rodríguez-Mier et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The correct identification of metabolic activity in tissues or cells under different conditions can be extremely elusive due to mechanisms such as post-transcriptional modification of enzymes or different rates in protein degradation, making difficult to perform predictions on the basis of gene expression alone. Context-specific metabolic network reconstruction can overcome some of these limitations by leveraging the integration of multi-omics data into genome-scale metabolic networks (GSMN). Using the experimental information, context-specific models are reconstructed by extracting from the generic GSMN the sub-network most consistent with the data, subject to biochemical constraints. One advantage is that these context-specific models have more predictive power since they are tailored to the specific tissue, cell or condition, containing only the reactions predicted to be active in such context. However, an important limitation is that there are usually many different sub-networks that optimally fit the experimental data. This set of optimal networks represent alternative explanations of the possible metabolic state. Ignoring the set of possible solutions reduces the ability to obtain relevant information about the metabolism and may bias the interpretation of the true metabolic states. In this work we formalize the problem of enumerating optimal metabolic networks and we introduce DEXOM, an unified approach for diversity-based enumeration of context-specific metabolic networks. We developed different strategies for this purpose and we performed an exhaustive analysis using simulated and real data. In order to analyze the extent to which these results are biologically meaningful, we used the alternative solutions obtained with the different methods to measure: 1) the improvement of in silico predictions of essential genes in Saccharomyces cerevisiae using ensembles of metabolic network; and 2) the detection of alternative enriched pathways in different human cancer cell lines. We also provide DEXOM as an open-source library compatible with COBRA Toolbox 3.0, available at https://github.com/MetExplore/ dexom.",
                "authors": [
                    {
                        "name": "Jourdan F."
                    },
                    {
                        "name": "Le Cam L."
                    },
                    {
                        "name": "Poupin N."
                    },
                    {
                        "name": "Rodriguez-Mier P."
                    },
                    {
                        "name": "de Blasio C."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "DEXOM: Diversity-based enumeration of optimal context-specific metabolic networks"
            },
            "pmcid": "PMC7904180",
            "pmid": "33571201"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
