{
    "additionDate": "2022-12-23T08:07:47.689581Z",
    "biotoolsCURIE": "biotools:casee",
    "biotoolsID": "casee",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Yuan Sh"
        }
    ],
    "description": "A lightning transfer-learning model directly used to discriminate cancer/normal cells from scRNA-seq.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuansh3354/CaSee",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-12-23T08:07:47.692414Z",
    "license": "Not licensed",
    "name": "CaSee",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/S41388-022-02478-5",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive licence to Springer Nature Limited.Single-cell RNA sequencing (scRNA-seq) is one of the most efficient technologies for human tumor research. However, data analysis is still faced with technical challenges, especially the difficulty in efficiently and accurately discriminating cancer/normal cells in the scRNA-seq expression matrix. If we can address these challenges, we can have a deeper understanding of the intratumoral and intertumoral heterogeneity. In this study, we developed a cancer/normal cell discrimination pipeline called pan-Cancer Seeker (CaSee) devoted to scRNA-seq expression matrix, which is based on the traditional high-quality pan-cancer bulk sequencing data using transfer learning. CaSee is the first tool directly used to discriminate cancer/normal cells in the scRNA-seq expression matrix, with much wider application fields and higher efficiency than copy number variation (CNV) method which requires corresponding reference cells. CaSee is user-friendly and can adapt to a variety of data sources, including but not limited to scRNA tissue sequencing data, scRNA cell line sequencing data, scRNA xenograft cell sequencing data and scRNA circulating tumor cell sequencing data. It is compatible with mainstream sequencing technology platforms, 10× Genomics Chromium, Smart-seq2, and Microwell-seq. Here, CaSee pipeline exhibited excellent performance in the multicenter data evaluation of 11 retrospective cohorts and one independent dataset, with an average discrimination accuracy of 96.69%. In general, the development of a deep-learning based, pan-cancer cell discrimination model, CaSee, to distinguish cancer cells from normal cells will be compelling to researchers working in the genomics, cancer, and single-cell fields.",
                "authors": [
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Guo C."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Sh Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2022-10-28T00:00:00Z",
                "journal": "Oncogene",
                "title": "CaSee: A lightning transfer-learning model directly used to discriminate cancer/normal cells from scRNA-seq"
            },
            "pmid": "36192479"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
