{
    "additionDate": "2018-07-31T14:43:33Z",
    "biotoolsCURIE": "biotools:rosettr",
    "biotoolsID": "rosettr",
    "credit": [
        {
            "email": "tome@mpipz.mpg.de",
            "name": "Filipa Tomé",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A high-throughput affordable in vitro growth assay for Arabidopsis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hredestig.github.io/rosettR/introduction.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "http://hredestig.github.io/rosettR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "rosettR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13007-017-0163-9",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Growth is an important parameter to consider when studying the impact of treatments or mutations on plant physiology. Leaf area and growth rates can be estimated efficiently from images of plants, but the experiment setup, image analysis, and statistical evaluation can be laborious, often requiring substantial manual effort and programming skills. Results: Here we present rosettR, a non-destructive and high-throughput phenotyping protocol for the measurement of total rosette area of seedlings grown in plates in sterile conditions. We demonstrate that our protocol can be used to accurately detect growth differences among different genotypes and in response to light regimes and osmotic stress. rosettR is implemented as a package for the statistical computing software R and provides easy to use functions to design an experiment, analyze the images, and generate reports on quality control as well as a final comparison across genotypes and applied treatments. Experiment procedures are included as part of the package documentation. Conclusions: Using rosettR it is straight-forward to perform accurate, reproducible measurements of rosette area and relative growth rate with high-throughput using inexpensive equipment. Suitable applications include screening mutant populations for growth phenotypes visible at early growth stages and profiling different genotypes in a wide variety of treatments.",
                "authors": [
                    {
                        "name": "Grundy J."
                    },
                    {
                        "name": "Hannah M.A."
                    },
                    {
                        "name": "Jansseune K."
                    },
                    {
                        "name": "Redestig H."
                    },
                    {
                        "name": "Saey B."
                    },
                    {
                        "name": "Tome F."
                    },
                    {
                        "name": "Vandenbroucke K."
                    }
                ],
                "citationCount": 10,
                "date": "2017-03-15T00:00:00Z",
                "journal": "Plant Methods",
                "title": "Rosettr: Protocol and software for seedling area and growth analysis"
            },
            "pmcid": "PMC5353781",
            "pmid": "28331535"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
