{
    "additionDate": "2017-01-17T14:59:46Z",
    "biotoolsCURIE": "biotools:samspectral",
    "biotoolsID": "samspectral",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "zare@txstate.edu",
            "name": "Habil Zare",
            "orcidid": "http://orcid.org/0000-0001-5902-6238",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Given a matrix of coordinates, this tool constructs the communities to sample the data points. Then, it builds a graph and after weighting the edges by conductance computation, the graph is passed to a classic spectral clustering algorithm to find and combine the spectral clusters. The resulting connected components estimate biological cell populations in the data sample.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/SamSPECTRAL.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/SamSPECTRAL_1.28.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/SamSPECTRAL.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-29T14:52:24Z",
    "license": "GPL-2.0",
    "name": "SamSPECTRAL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-403",
            "metadata": {
                "abstract": "Background: Recent biological discoveries have shown that clustering large datasets is essential for better understanding biology in many areas. Spectral clustering in particular has proven to be a powerful tool amenable for many applications. However, it cannot be directly applied to large datasets due to time and memory limitations. To address this issue, we have modified spectral clustering by adding an information preserving sampling procedure and applying a post-processing stage. We call this entire algorithm SamSPECTRAL.Results: We tested our algorithm on flow cytometry data as an example of large, multidimensional data containing potentially hundreds of thousands of data points (i.e., \"events\" in flow cytometry, typically corresponding to cells). Compared to two state of the art model-based flow cytometry clustering methods, SamSPECTRAL demonstrates significant advantages in proper identification of populations with non-elliptical shapes, low density populations close to dense ones, minor subpopulations of a major population and rare populations.Conclusions: This work is the first successful attempt to apply spectral methodology on flow cytometry data. An implementation of our algorithm as an R package is freely available through BioConductor. © 2010 Zare et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Brinkman R.R."
                    },
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Shooshtari P."
                    },
                    {
                        "name": "Zare H."
                    }
                ],
                "citationCount": 112,
                "date": "2010-07-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Data reduction for spectral clustering to analyze high throughput flow cytometry data"
            },
            "pmcid": "PMC2923634",
            "pmid": "20667133",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1,
    "version": [
        "1.28.0"
    ]
}
