{
    "additionDate": "2021-01-18T08:29:11Z",
    "biotoolsCURIE": "biotools:elliptrack",
    "biotoolsID": "elliptrack",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sabrina.spencer@colorado.edu",
            "name": "Sabrina L. Spencer",
            "typeEntity": "Person"
        }
    ],
    "description": "EllipTrack is a global-local cell-tracking pipeline for 2D Fluorescence Time-Lapse Microscopy. EllipTrack is a global-local hybrid cell tracker optimized for tracking modern large-scale movies. EllipTrack introduces a local track correction module.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://elliptrack.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                }
            ]
        }
    ],
    "homepage": "http://github.com/tianchengzhe/EllipTrack",
    "language": [
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2021-03-05T16:29:10Z",
    "license": "MIT",
    "name": "EllipTrack",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.04.13.036756"
        },
        {
            "doi": "10.1016/j.celrep.2020.107984",
            "metadata": {
                "abstract": "© 2020 The Author(s)Time-lapse microscopy provides an unprecedented opportunity to monitor single-cell dynamics. However, tracking cells for long periods remains a technical challenge, especially for multi-day, large-scale movies with rapid cell migration, high cell density, and drug treatments that alter cell morphology/behavior. Here, we present EllipTrack, a global-local cell-tracking pipeline optimized for tracking such movies. EllipTrack first implements a global track-linking algorithm to construct tracks that maximize the probability of cell lineages. Tracking mistakes are then corrected with a local track-correction module in which tracks generated by the global algorithm are systematically examined and amended if a more probable alternative can be found. Through benchmarking, we show that EllipTrack outperforms state-of-the-art cell trackers and generates nearly error-free cell lineages for multiple large-scale movies. In addition, EllipTrack can adapt to time- and cell-density-dependent changes in cell migration speeds and requires minimal training datasets. EllipTrack is available at https://github.com/tianchengzhe/EllipTrack. © 2020 The Author(s)Tian et al. present a cell-tracking pipeline called EllipTrack that is optimized for modern, multi-day, high-throughput 2D fluorescent time-lapse movies. EllipTrack produces nearly error-free cell lineages for the cell lines tested and represents an improvement over existing tools for hard-to-track cells such as cancer cells.",
                "authors": [
                    {
                        "name": "Tian C."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Spencer S.L."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-04T00:00:00Z",
                "journal": "Cell Reports",
                "title": "EllipTrack: A Global-Local Cell-Tracking Pipeline for 2D Fluorescence Time-Lapse Microscopy"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}