{
    "additionDate": "2021-01-18T09:15:55Z",
    "biotoolsCURIE": "biotools:winrop",
    "biotoolsID": "winrop",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shatriah@usm.my",
            "name": "Ismail Shatriah",
            "orcidid": "https://orcid.org/0000-0002-4753-4814",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficacy of WINROP as a Screening Tool for Retinopathy of Prematurity in the East Coast of Malaysia.\n\nThis online monitoring system, following weight gain, for predicting developing sight threatening ROP, was developed by the research group at The Sahlgrenska Center for Pediatric Ophthalmology Research.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://winrop.com",
    "lastUpdate": "2021-03-18T09:47:31Z",
    "name": "WINROP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.2147/OPTH.S247820",
            "metadata": {
                "abstract": "© 2020 Lim et al.Purpose: To evaluate the efficacy of the “weight, insulin-like growth factor 1, neonatal retinopathy of prematurity” (WINROP) algorithm in predicting retinopathy of prematurity (ROP) requiring treatment in Malaysia. Participants: This was a retrospective study involving premature infants with gestational age less than 32 weeks treated from September 2016 to March 2019 in Hospital Universiti Sains Malaysia. Clinical diagnosis was made based on Early Treatment Retinopathy of Prematurity study. Participants’ weekly weight gain since birth was entered in the website (http://winrop.com), along with date of birth, gestational age and final clinical examination outcome. WINROP software signals an alarm if an infant is at high risk of developing ROP requiring treatment during weight data entry. By using the alarm status, the sensitivity and specificity of this algorithm for predicting ROP requiring treatment were obtained. Results: Ninety-two infants were included in this study. An alarm was detected in 67 infants (72.8%). There were a total of 53 infants (54.6%) with no ROP, 15 (16.3%) of whom developed stage 1 ROP, 10 (10.8%) who developed stage 2 ROP and 14 infants (15.2%) who developed stage 3 ROP. In our study, WINROP sensitivity was 95.2% and specificity was 33.8%. Conclusion: WINROP is recommended as an initial screening tool for premature infants at risk of developing treatment-requiring ROP in Malaysia. It may help to alert clinicians managing severely ill infants when clinical examinations are less possible.",
                "authors": [
                    {
                        "name": "Di Lim Z."
                    },
                    {
                        "name": "Oo K.T."
                    },
                    {
                        "name": "Tai E.L.M."
                    },
                    {
                        "name": "Shatriah I."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Clinical Ophthalmology",
                "title": "Efficacy of WINROP as a screening tool for retinopathy of prematurity in the east coast of Malaysia"
            },
            "pmcid": "PMC7188201",
            "pmid": "32425496"
        }
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        }
    ]
}