{
    "additionDate": "2021-01-18T11:42:52Z",
    "biotoolsCURIE": "biotools:scapatrap",
    "biotoolsID": "scapatrap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xhuister@xmu.edu.cn",
            "name": "Xiaohui Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "This is a package and a shell script for alternative polyadenylation (APA) analysis of 3' tag single-cell RNA-seq data. The shell script \"scAPAscript.R\" takes as input BAM files generated by 10x 3' tag RNA seq pipline and the results of cell clustering.\n\nAlternative polyadenylation (APA) has been indicated to play an important role in regulating mRNA stability, translation and localization.\n\nFasta and chromosome length files for human (hg19) or (and) mouse (mm10).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BMILAB/scAPAtrap",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T17:09:25Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ElkonLab/scAPA"
        }
    ],
    "name": "scAPAtrap",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA273",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Alternative polyadenylation (APA) generates diverse mRNA isoforms, which contributes to transcriptome diversity and gene expression regulation by affecting mRNA stability, translation and localization in cells. The rapid development of 3' tag-based single-cell RNA-sequencing (scRNA-seq) technologies, such as CEL-seq and 10x Genomics, has led to the emergence of computational methods for identifying APA sites and profiling APA dynamics at single-cell resolution. However, existing methods fail to detect the precise location of poly(A) sites or sites with low read coverage. Moreover, they rely on priori genome annotation and can only detect poly(A) sites located within or near annotated genes. Here we proposed a tool called scAPAtrap for detecting poly(A) sites at the whole genome level in individual cells from 3' tag-based scRNA-seq data. scAPAtrap incorporates peak identification and poly(A) read anchoring, enabling the identification of the precise location of poly(A) sites, even for sites with low read coverage. Moreover, scAPAtrap can identify poly(A) sites without using priori genome annotation, which helps locate novel poly(A) sites in previously overlooked regions and improve genome annotation. We compared scAPAtrap with two latest methods, scAPA and Sierra, using scRNA-seq data from different experimental technologies and species. Results show that scAPAtrap identified poly(A) sites with higher accuracy and sensitivity than competing methods and could be used to explore APA dynamics among cell types or the heterogeneous APA isoform expression in individual cells. scAPAtrap is available at https://github.com/BMILAB/scAPAtrap.",
                "authors": [
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Ye C."
                    },
                    {
                        "name": "Ye W."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "scAPAtrap: identification and quantification of alternative polyadenylation sites from single-cell RNA-seq data"
            },
            "pmid": "33142319"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
