{
    "additionDate": "2021-01-18T09:51:11Z",
    "biotoolsCURIE": "biotools:spectraltad",
    "biotoolsID": "spectraltad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mikhail.dozmorov@vcuhealth.org",
            "name": "Mikhail G. Dozmorov",
            "orcidid": "https://orcid.org/0000-0002-0086-8358",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for defining a hierarchy of topologically associated domains using spectral clustering.\n\nSpectralTAD: Hierarchical TAD detection using spectral clustering.\n\nSpectralTAD is an R package designed to identify Topologically Associated Domains (TADs) from Hi-C contact matrices. It uses a modified version of spectral clustering that uses a sliding window to quickly detect TADs. The function works on a range of different formats of contact matrices and returns a bed file of TAD coordinates. The method does not require users to adjust any parameters to work and gives them control over the number of hierarchical levels to be returned.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/SpectralTAD/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-21T13:34:59Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/dozmorovlab/SpectralTAD"
        }
    ],
    "name": "SpectralTAD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03652-W",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The three-dimensional (3D) structure of the genome plays a crucial role in gene expression regulation. Chromatin conformation capture technologies (Hi-C) have revealed that the genome is organized in a hierarchy of topologically associated domains (TADs), sub-TADs, and chromatin loops. Identifying such hierarchical structures is a critical step in understanding genome regulation. Existing tools for TAD calling are frequently sensitive to biases in Hi-C data, depend on tunable parameters, and are computationally inefficient. Methods: To address these challenges, we developed a novel sliding window-based spectral clustering framework that uses gaps between consecutive eigenvectors for TAD boundary identification. Results: Our method, implemented in an R package, SpectralTAD, detects hierarchical, biologically relevant TADs, has automatic parameter selection, is robust to sequencing depth, resolution, and sparsity of Hi-C data. SpectralTAD outperforms four state-of-the-art TAD callers in simulated and experimental settings. We demonstrate that TAD boundaries shared among multiple levels of the TAD hierarchy were more enriched in classical boundary marks and more conserved across cell lines and tissues. In contrast, boundaries of TADs that cannot be split into sub-TADs showed less enrichment and conservation, suggesting their more dynamic role in genome regulation. Conclusion: SpectralTAD is available on Bioconductor, http://bioconductor.org/packages/SpectralTAD/.",
                "authors": [
                    {
                        "name": "Cresswell K.G."
                    },
                    {
                        "name": "Stansfield J.C."
                    },
                    {
                        "name": "Dozmorov M.G."
                    }
                ],
                "date": "2020-07-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SpectralTAD: An R package for defining a hierarchy of topologically associated domains using spectral clustering"
            },
            "pmcid": "PMC7372752",
            "pmid": "32689928"
        }
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}