{
    "additionDate": "2019-11-14T19:30:35Z",
    "biotoolsCURIE": "biotools:f5c",
    "biotoolsID": "f5c",
    "confidence_flag": "tool",
    "description": "GPU Accelerated Adaptive Banded Event Alignment for Rapid Comparative Nanopore Signal Analysis | Re-engineered and optimised Nanopolish call-methylation module (supports CUDA acceleration) | An optimised re-implementation of the call-methylation module in Nanopolish. Given a set of basecalled Nanopore reads and the raw signals, f5c detects the methylated cytosine bases. f5c can optionally utilise NVIDIA graphics cards for acceleration",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://hasindu2008.github.io/f5c/docs/overview"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                }
            ]
        }
    ],
    "homepage": "https://hasindu2008.github.io/f5c/",
    "language": [
        "C"
    ],
    "lastUpdate": "2020-12-28T16:08:10Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hasindu2008/f5c"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hasindu2008/f5c/issues"
        }
    ],
    "name": "f5c",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/756122"
        },
        {
            "doi": "10.1186/s12859-020-03697-x",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Nanopore sequencing enables portable, real-time sequencing applications, including point-of-care diagnostics and in-the-field genotyping. Achieving these outcomes requires efficient bioinformatic algorithms for the analysis of raw nanopore signal data. However, comparing raw nanopore signals to a biological reference sequence is a computationally complex task. The dynamic programming algorithm called Adaptive Banded Event Alignment (ABEA) is a crucial step in polishing sequencing data and identifying non-standard nucleotides, such as measuring DNA methylation. Here, we parallelise and optimise an implementation of the ABEA algorithm (termed f5c) to efficiently run on heterogeneous CPU-GPU architectures. Results: By optimising memory, computations and load balancing between CPU and GPU, we demonstrate how f5c can perform ∼3-5 × faster than an optimised version of the original CPU-only implementation of ABEA in the Nanopolish software package. We also show that f5c enables DNA methylation detection on-the-fly using an embedded System on Chip (SoC) equipped with GPUs. Conclusions: Our work not only demonstrates that complex genomics analyses can be performed on lightweight computing systems, but also benefits High-Performance Computing (HPC). The associated source code for f5c along with GPU optimised ABEA is available at https://github.com/hasindu2008/f5c.",
                "authors": [
                    {
                        "name": "Gamaarachchi H."
                    },
                    {
                        "name": "Lam C.W."
                    },
                    {
                        "name": "Jayatilaka G."
                    },
                    {
                        "name": "Samarakoon H."
                    },
                    {
                        "name": "Simpson J.T."
                    },
                    {
                        "name": "Smith M.A."
                    },
                    {
                        "name": "Parameswaran S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GPU accelerated adaptive banded event alignment for rapid comparative nanopore signal analysis"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}