{"collectionID": [], "accessibility": [], "topic": [{"term": "Sequence sites, features and motifs", "uri": "http://edamontology.org/topic_0160"}, {"term": "Gene and protein families", "uri": "http://edamontology.org/topic_0623"}, {"term": "Pathology", "uri": "http://edamontology.org/topic_0634"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}, {"term": "Genetic variation", "uri": "http://edamontology.org/topic_0199"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "15608197", "type": null, "pmcid": null, "metadata": {"title": "The PANTHER database of protein families, subfamilies, functions and pathways", "abstract": "PANTHER is a large collection of protein families that have been subdivided into functionally related subfamilies, using human expertise. These subfamilies model the divergence of specific functions within protein families, allowing more accurate association with function (ontology terms and pathways), as well as inference of amino acids important for functional specificity. Hidden Markov models (HMMs) are built for each family and subfamily for classifying additional protein sequences. The latest version, 5.0, contains 6683 protein families, divided into 31 705 subfamilies, covering ∼90% of mammalian protein-coding genes. PANTHER 5.0 includes a number of significant improvements over previous versions, most notably (i) representation of pathways (primarily signaling pathways) and association with subfamilies and individual protein sequences; (ii) an improved methodology for defining the PANTHER families and subfamilies, and for building the HMMs; (iii) resources for scoring sequences against PANTHER HMMs both over the web and locally; and (iv) a number of new web resources to facilitate analysis of large gene lists, including data generated from high-throughput expression experiments. Efforts are underway to add PANTHER to the InterPro suite of databases, and to make PANTHER consistent with the PIRSF database. PANTHER is now publicly available without restriction at http://panther.appliedbiosystems.com. © Oxford University Press 2005; all rights reserved.", "citationCount": 512, "authors": [{"name": "Mi H."}, {"name": "Lazareva-Ulitsky B."}, {"name": "Loo R."}, {"name": "Kejariwal A."}, {"name": "Vandergriff J."}, {"name": "Rabkin S."}, {"name": "Guo N."}, {"name": "Muruganujan A."}, {"name": "Doremieux O."}, {"name": "Campbell M.J."}, {"name": "Kitano H."}, {"name": "Thomas P.D."}], "date": "2005-01-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "12952881", "type": null, "pmcid": null, "metadata": {"title": "PANTHER: A library of protein families and subfamilies indexed by function", "abstract": "In the genomic era, one of the fundamental goals is to characterize the function of proteins on a large scale. We describe a method, PANTHER, for relating protein sequence relationships to function relationships in a robust and accurate way. PANTHER is composed of two main components: the PANTHER library (PANTHER/LIB) and the PANTHER index (PANTHER/X). PANTHER/LIB is a collection of \"books,\" each representing a protein family as a multiple sequence alignment, a Hidden Markov Model (HMM), and a family tree. Functional divergence within the family is represented by dividing the tree into subtrees based on shared function, and by subtree HMMs. PANTHER/X is an abbreviated ontology for summarizing and navigating molecular functions and biological processes associated with the families and subfamilies. We apply PANTHER to three areas of active research. First, we report the size and sequence diversity of the families and subfamilies, characterizing the relationship between sequence divergence and functional divergence across a wide range of protein families. Second, we use the PANTHER/X ontology to give a high-level representation of gene function across the human and mouse genomes. Third, we use the family HMMs to rank missense single nucleotide polymorphisms (SNPs), on a database-wide scale, according to their likelihood of affecting protein function.", "citationCount": 1384, "authors": [{"name": "Thomas P.D."}, {"name": "Campbell M.J."}, {"name": "Kejariwal A."}, {"name": "Mi H."}, {"name": "Karlak B."}, {"name": "Daverman R."}, {"name": "Diemer K."}, {"name": "Muruganujan A."}, {"name": "Narechania A."}], "date": "2003-09-01T00:00:00Z", "journal": "Genome Research"}}, {"doi": null, "note": null, "version": null, "pmid": "12520017", "type": null, "pmcid": null, "metadata": {"title": "PANTHER: A browsable database of gene products organized by biological function, using curated protein family and subfamily classification", "abstract": "The PANTHER database was designed for high-throughput analysis of protein sequences. One of the key features is a simplified ontology of protein function, which allows browsing of the database by biological functions. Biologist curators have associated the ontology terms with groups of protein sequences rather than individual sequences. Statistical models (Hidden Markov Models, or HMMs) are built from each of these groups. The advantage of this approach is that new sequences can be automatically classified as they become available. To ensure accurate functional classification, HMMs are constructed not only for families, but also for functionally distinct subfamilies. Multiple sequence alignments and phylogenetic trees, including curator-assigned information, are available for each family. The current version of the PANTHER database includes training sequences from all organisms in the GenBank non-redundant protein database, and the HMMs have been used to classify gene products across the entire genomes of human, and Drosophila melanogaster. PANTHER is publicly available on the web at http://panther.celera.com. © Oxford University Press 2001.", "citationCount": 411, "authors": [{"name": "Thomas P.D."}, {"name": "Kejariwal A."}, {"name": "Campbell M.J."}, {"name": "Mi H."}, {"name": "Diemer K."}, {"name": "Guo N."}, {"name": "Ladunga I."}, {"name": "Ulitsky-Lazareva B."}, {"name": "Muruganujan A."}, {"name": "Rabkin S."}, {"name": "Vandergriff J.A."}, {"name": "Doremieux O."}], "date": "2003-01-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "15492219", "type": null, "pmcid": null, "metadata": {"title": "Coding single-nucleotide polymorphisms associated with complex vs. Mendelian disease: Evolutionary evidence for differences in molecular effects", "abstract": "Most Mendelian diseases studied to date arise from mutations that lead to a single amino acid change in an encoded protein. An increasing number of complex diseases have also been associated with amino acid-changing single-nucleotide polymorphisms (coding SNPs, cSNPs), suggesting potential similarities between Mendelian and complex diseases at the molecular level. Here, we use two different evolutionary analyses to compare Mendelian and complex disease-associated cSNPs. In the first, we estimate the likelihood that a specific amino acid substitution in a protein will affect the protein's function, by using amino acid substitution scores derived from an alignment of related protein sequences and statistics from hidden Markov models. In the second, we use standard Ka/Ks ratios to make comparisons at the gene, rather than the individual amino acid, level. We find that Mendelian disease cSNPs have a very strong tendency to occur at highly conserved amino acid positions in proteins, suggesting that they generally have a severe impact on the function of the protein. Perhaps surprisingly, the distribution of amino acid substitution scores for complex disease cSNPs is dramatically different from the distribution for Mendelian disease cSNPs, and is indistinguishable from the distribution for \"normal\" human variation. Further, the distributions of Ka/Ks ratios for human and mouse orthologs indicate greater positive selection (or less negative selection) pressure on complex disease-associated genes, on average. These findings suggest that caution should be exercised when using Mendelian disease as a model for complex disease, at least with respect to molecular effects on protein function.", "citationCount": 198, "authors": [{"name": "Thomas P.D."}, {"name": "Kejariwal A."}], "date": "2004-10-26T00:00:00Z", "journal": "Proceedings of the National Academy of Sciences of the United States of America"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Support", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "pantherfeedback@yahoo.com"}], "biotoolsCURIE": "biotools:panther", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.pantherdb.org/tools/", "function": [{"note": null, "input": [], "operation": [{"term": "Over-representation analysis", "uri": "http://edamontology.org/operation_3501"}, {"term": "Haplotype mapping", "uri": "http://edamontology.org/operation_0487"}, {"term": "Protein modelling (mutation)", "uri": "http://edamontology.org/operation_0331"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:57Z", "otherID": [], "description": "Unique resource that classifies genes by their functions, using published scientific experimental evidence and evolutionary relationships to predict function. The research tools allow you to score proteins against the HMM library, use it to do gene expression analyses, and download tools and data.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "panther", "additionDate": "2017-03-24T11:31:24Z", "name": "PANTHER Tools", "license": null, "documentation": [{"url": "http://www.pantherdb.org/help/PANTHERhelp.jsp", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}