
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Animals",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Phylogenomics",
                "uri": "http://edamontology.org/topic_0194"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The PhyloFacts 'Fast Approximate Tree Classification' (FAT-CAT) web server provides a novel approach to ortholog identification using subtree hidden Markov model-based placement of protein sequences to phylogenomic orthology groups in the PhyloFacts database. Results on a data set of microbial, plant and animal proteins demonstrate FAT-CAT's high precision at separating orthologs and paralogs and robustness to promiscuous domains. We also present results documenting the precision of ortholog identification based on subtree hidden Markov model scoring. The FAT-CAT phylogenetic placement is used to derive a functional annotation for the query, including confidence scores and drill-down capabilities. PhyloFacts' broad taxonomic and functional coverage, with >7.3 M proteins from across the Tree of Life, enables FAT-CAT to predict orthologs and assign function for most sequence inputs. Four pipeline parameter presets are provided to handle different sequence types, including partial sequences and proteins containing promiscuous domains; users can also modify individual parameters. PhyloFacts trees matching the query can be viewed interactively online using the PhyloScope Javascript tree viewer and are hyperlinked to various external databases. The FAT-CAT web server is available at http://phylogenomics.berkeley.edu/phylofacts/fatcat/.",
            "authors": [
                "Afrasiabi C.",
                "Samad B.",
                "Dineen D.",
                "Meacham C.",
                "Sjolander K."
            ],
            "cit_count": 18,
            "journal": "Nucleic acids research",
            "pmid": "23685612",
            "title": "The PhyloFacts FAT-CAT web server: ortholog identification and function prediction using fast approximate tree classification.",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phylofacts_fat-cat",
        "biotoolsID": "phylofacts_fat-cat",
        "description": "Web server for protein functional annotation and identification of orthologs. Input is a protein sequence up to 2000 a.a.",
        "homepage": "http://phylogenomics.berkeley.edu/phylofacts/fatcat/",
        "name": "PhyloFacts FAT-CAT"
    }
}