{
    "accessibility": "Open access",
    "additionDate": "2023-03-17T10:27:47.672684Z",
    "biotoolsCURIE": "biotools:srns",
    "biotoolsID": "srns",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jianghj@zju.edu.cn",
            "name": "Hangjin Jiang",
            "typeEntity": "Person"
        },
        {
            "email": "maojh88@zju.edu.cn",
            "name": "Jianhua Mao",
            "typeEntity": "Person"
        },
        {
            "name": "Huihui Liu"
        },
        {
            "name": "Qing Ye"
        },
        {
            "name": "Yuzhou Li"
        }
    ],
    "description": "Machine learning models for predicting steroid-resistant of nephrotic syndrome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://datalinkx.shinyapps.io/srns",
    "lastUpdate": "2023-03-17T10:27:47.676970Z",
    "name": "SRNS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2023.1090241",
            "metadata": {
                "abstract": "Background: In the absence of effective measures to predict steroid responsiveness, patients with nonhereditary steroid-resistant nephrotic syndrome (SRNS) have a significantly increased risk of progression to end-stage renal disease. In view of the poor outcomes of SRNS, it is urgent to identify the steroid responsiveness of idiopathic nephrotic syndrome (INS) early. Methods: To build a prediction model for SRNS, we collected 91 subjects; 57 of them had steroid-sensitive nephrotic syndrome, and the others had SRNS. For each subject, 87 clinical variables were measured. In general, only a small part of these variables is informative to SRNS. Thus, we proposed a new variable selection framework including a penalized regression approach (named MLR+TLP) to select variables having a linear effect on the SRNS and a nonparametric screening method (MAC) to select variables having a nonlinear marginal (joint) effect on the SRNS. Thereafter, considering the correlation between selected clinical variables, we used a stepwise method to build our final model for predicting SRNS. In addition, a statistical testing procedure is proposed to test the overfitting of the proposed model. Results: Twenty-six clinical variables were selected to be informative to SRNS, and an SVM model was built to predict SRNS with a leave-one-out cross-validation (LOO-CV) accuracy of 95.2% (overfitting p value<0.005). To make the model more useful, we incorporate prior medical information into the model and consider the correlation between selected variables. Then, a reduced SVM model including only eight clinical variables (erythrocyte sedimentation rate, urine occult blood, percentage of neutrophils, immunoglobulin A, cholesterol, vinculin autoantibody, aspartate aminotransferase, and prolonged prothrombin time) was built to have a LOO-CV accuracy of 92.8% (overfitting p value<0.005). The validation cohort showed that the reduced model obtained an accuracy of 94.0% (overfitting p value<0.005), with a sensitivity of 90.0% and a specificity of 96.7%. Notably, vinculin autoantibody is the only podocyte autoantibody included in this model. It is linearly related to steroid responsiveness. Finally, our model is freely available as a user-friendly web tool at https://datalinkx.shinyapps.io/srns/. Conclusion: The SRNS prediction model constructed in this study comprehensively and objectively evaluates the internal conditions and disease status of INS patients and will provide scientific guidance for selecting treatment methods for children with nonhereditary SRNS.",
                "authors": [
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Mao J."
                    },
                    {
                        "name": "Ye Q."
                    }
                ],
                "date": "2023-01-26T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "Machine learning models for predicting steroid-resistant of nephrotic syndrome"
            },
            "pmcid": "PMC9911108",
            "pmid": "36776850"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
