{
    "additionDate": "2020-01-09T18:23:01Z",
    "biotoolsCURIE": "biotools:cwSDTWnano",
    "biotoolsID": "cwSDTWnano",
    "confidence_flag": "tool",
    "description": "Novel algorithms for efficient subsequence searching and mapping in nanopore raw signals towards targeted sequencing.\n\nHere we proposed two novel algorithms, the Direct Subsequence Dynamic Time Warping for nanopore raw signal search (DSDTWnano) and the continuous wavelet Subsequence DTW for nanopore raw signal search (cwSDTWnano), to enable the direct subsequence inquiry and exact mapping in the nanopore raw signal datasets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                }
            ]
        }
    ],
    "homepage": "https://github.com/icthrm/cwSDTWnano",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2020-12-17T11:50:31Z",
    "name": "cwSDTWnano",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ742",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Genome diagnostics have gradually become a prevailing routine for human healthcare. With the advances in understanding the causal genes for many human diseases, targeted sequencing provides a rapid, cost-efficient and focused option for clinical applications, such as single nucleotide polymorphism (SNP) detection and haplotype classification, in a specific genomic region. Although nanopore sequencing offers a perfect tool for targeted sequencing because of its mobility, PCR-freeness and long read properties, it poses a challenging computational problem of how to efficiently and accurately search and map genomic subsequences of interest in a pool of nanopore reads (or raw signals). Due to its relatively low sequencing accuracy, there is no reliable solution to this problem, especially at low sequencing coverage. Results: Here, we propose a brand new signal-based subsequence inquiry pipeline as well as two novel algorithms to tackle this problem. The proposed algorithms follow the principle of subsequence dynamic time warping and directly operate on the electrical current signals, without loss of information in base-calling. Therefore, the proposed algorithms can serve as a tool for sequence inquiry in targeted sequencing. Two novel criteria are offered for the consequent signal quality analysis and data classification. Comprehensive experiments on real-world nanopore datasets show the efficiency and effectiveness of the proposed algorithms. We further demonstrate the potential applications of the proposed algorithms in two typical tasks in nanopore-based targeted sequencing: SNP detection under low sequencing coverage, and haplotype classification under low sequencing accuracy.",
                "authors": [
                    {
                        "name": "Han R."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Gao X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Novel algorithms for efficient subsequence searching and mapping in nanopore raw signals towards targeted sequencing"
            },
            "pmid": "31593235"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}