{
    "additionDate": "2021-09-27T06:27:17.643238Z",
    "biotoolsCURIE": "biotools:human-ires-atlas",
    "biotoolsID": "human-ires-atlas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thyangza1025@nuk.edu.tw",
            "name": "Tzu-Hsien Yang",
            "orcidid": "https://orcid.org/0000-0001-9420-196X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Human IRES Atlas is an integrative platform for studying IRES-driven translational regulation in humans.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Translation initiation site prediction",
                    "uri": "http://edamontology.org/operation_0439"
                }
            ]
        }
    ],
    "homepage": "http://cobishss0.im.nuk.edu.tw/Human_IRES_Atlas/",
    "lastUpdate": "2021-09-27T06:27:17.645974Z",
    "name": "Human IRES Atlas",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB025",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press.It is now known that cap-independent translation initiation facilitated by internal ribosome entry sites (IRESs) is vital in selective cellular protein synthesis under stress and different physiological conditions. However, three problems make it hard to understand transcriptome-wide cellular IRES-mediated translation initiation mechanisms: (i) complex interplay between IRESs and other translation initiation-related information, (ii) reliability issue of in silico cellular IRES investigation and (iii) labor-intensive in vivo IRES identification. In this research, we constructed the Human IRES Atlas database for a comprehensive understanding of cellular IRESs in humans. First, currently available and suitable IRES prediction tools (IRESfinder, PatSearch and IRESpy) were used to obtain transcriptome-wide human IRESs. Then, we collected eight genres of translation initiation-related features to help study the potential molecular mechanisms of each of the putative IRESs. Three functional tests (conservation, structural RNA-protein scores and conditional translation efficiency) were devised to evaluate the functionality of the identified putative IRESs. Moreover, an easy-to-use interface and an IRES-translation initiation interaction map for each gene transcript were implemented to help understand the interactions between IRESs and translation initiation-related features. Researchers can easily search/browse an IRES of interest using the web interface and deduce testable mechanism hypotheses of human IRES-driven translation initiation based on the integrated results. In summary, Human IRES Atlas integrates putative IRES elements and translation initiation-related experiments for better usage of these data and deduction of mechanism hypotheses.",
                "authors": [
                    {
                        "name": "Liu C.-T."
                    },
                    {
                        "name": "Tsai H.-C."
                    },
                    {
                        "name": "Wang C.-Y."
                    },
                    {
                        "name": "Yang T.-H."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Human IRES Atlas: An integrative platform for studying IRES-driven translational regulation in humans"
            },
            "pmcid": "PMC8094437",
            "pmid": "33942874",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
