{
    "additionDate": "2021-01-18T09:40:08Z",
    "biotoolsCURIE": "biotools:bioentity2vec",
    "biotoolsID": "bioentity2vec",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhuhongyou@ms.xjb.ac.cn",
            "name": "Zhu-Hong You",
            "orcidid": "https://orcid.org/0000-0003-1266-2696",
            "typeEntity": "Person"
        },
        {
            "email": "wangyanbin15@mails.ucas.ac.cn",
            "name": "Yan-Bin Wang",
            "orcidid": "https://orcid.org/0000-0003-1682-5712",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioentity2vec is a method for representing bioentities, which integrates information about the attributes and behaviors of a bioentity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CocoGzh/Bioentity2vec",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-04T13:51:30Z",
    "license": "MIT",
    "name": "Bioentity2vec",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAA032",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Background: The explosive growth of genomic, chemical, and pathological data provides new opportunities and challenges for humans to thoroughly understand life activities in cells. However, there exist few computational models that aggregate various bioentities to comprehensively reveal the physical and functional landscape of biological systems. Results: We constructed a molecular association network, which contains 18 edges (relationships) between 8 nodes (bioentities). Based on this, we propose Bioentity2vec, a new method for representing bioentities, which integrates information about the attributes and behaviors of a bioentity. Applying the random forest classifier, we achieved promising performance on 18 relationships, with an area under the curve of 0.9608 and an area under the precision-recall curve of 0.9572. Conclusions: Our study shows that constructing a network with rich topological and biological information is important for systematic understanding of the biological landscape at the molecular level. Our results show that Bioentity2vec can effectively represent biological entities and provides easily distinguishable information about classification tasks. Our method is also able to simultaneously predict relationships between single types and multiple types, which will accelerate progress in biological experimental research and industrial product development.",
                "authors": [
                    {
                        "name": "Guo Z.-H."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Wang Y.-B."
                    },
                    {
                        "name": "Huang D.-S."
                    },
                    {
                        "name": "Yi H.-C."
                    },
                    {
                        "name": "Chen Z.-H."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Bioentity2vec: Attribute- And behavior-driven representation for predicting multi-type relationships between bioentities"
            },
            "pmcid": "PMC7293023",
            "pmid": "32533701"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}