{
    "accessibility": "Open access",
    "additionDate": "2023-12-09T03:07:09.567374Z",
    "biotoolsCURIE": "biotools:crimp",
    "biotoolsID": "crimp",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Ulrich Lautenschlager",
            "orcidid": "https://orcid.org/0000-0003-1886-2277"
        }
    ],
    "description": "Crimp allows to align clusters across multiple clusterings, based on their matrices of membership coefficients (Q-matrices). This is frequently done to post-process outputs from programs like Structure (Pritchard et al. 2000). Crimp can be used as a much faster and typically more accurate alternative to CLUMPP (Jakobsson & Rosenberg 2007).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Matrix",
                        "uri": "http://edamontology.org/data_2082"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                },
                {
                    "term": "Comparison",
                    "uri": "http://edamontology.org/operation_2424"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ulilautenschlager/crimp",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-24T14:28:51.521227Z",
    "license": "MIT",
    "name": "Crimp",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "ul90",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13734",
            "metadata": {
                "abstract": "When a data set is repeatedly clustered using unsupervised techniques, the resulting clusterings, even if highly similar, may list their clusters in different orders. This so-called ‘label-switching’ phenomenon obscures meaningful differences between clusterings, complicating their comparison and summary. The problem often arises in the context of population structure analysis based on multilocus genotype data. In this field, a variety of popular tools apply model-based clustering, assigning individuals to a prespecified number of ancestral populations. Since such methods often involve stochastic components, it is a common practice to perform multiple replicate analyses based on the same input data and parameter settings. Available postprocessing tools allow to mitigate label switching, but leave room for improvements, in particular, regarding large input data sets. In this work, I present Crimp, a lightweight command-line tool, which offers a relatively fast and scalable heuristic to align clusters across replicate clusterings consisting of the same number of clusters. For small problem sizes, an exact algorithm can be used as an alternative. Additional features include row-specific weights, input and output files similar to those of CLUMPP (Jakobsson & Rosenberg, 2007) and the evaluation of a given solution in terms of CLUMPP as well as its own objective functions. Benchmark analyses show that Crimp, especially when applied to larger data sets, tends to outperform alternative tools considering runtime requirements and various quality measures. While primarily targeting population structure analysis, Crimp can be used as a generic tool to correct multiple clusterings for label switching. This facilitates their comparison and allows to generate an averaged clustering. Crimp's computational efficiency makes it even applicable to relatively large data sets while offering competitive solution quality.",
                "authors": [
                    {
                        "name": "Lautenschlager U."
                    }
                ],
                "citationCount": 1,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "Crimp: An efficient tool for summarizing multiple clusterings in population structure analysis and beyond"
            },
            "pmid": "36349867"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}
