{
    "additionDate": "2017-12-18T00:08:56Z",
    "biotoolsCURIE": "biotools:mpda",
    "biotoolsID": "mpda",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stat.sinica.edu.tw/hsinchou/"
        }
    ],
    "description": "An innovative tool for analyzing hybridization intensity data from microarray-based pooled DNA experiments. Graphic and numerical outputs from MPDA support global and detailed inspection for bulk of genomic data.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.stat.sinica.edu.tw/hsinchou/genetics/pooledDNA/UserManual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.sinica.edu.tw/hsinchou/genetics/pooledDNA/mpda.htm",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mpda-20081110-microarray-pooled-dna-analyzer.html"
        }
    ],
    "name": "MPDA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-196",
            "metadata": {
                "abstract": "Background: Microarray-based pooled DNA experiments that combine the merits of DNA pooling and gene chip technology constitute a pivotal advance in biotechnology. This new technique uses pooled DNA, thereby reducing costs associated with the typing of DNA from numerous individuals. Moreover, use of an oligonucleotide gene chip reduces costs related to processing various DNA segments (e.g., primers, reagents). Thus, the technique provides an overall cost-effective solution for large-scale genomic/genetic research. However, few publicly shared tools are available to systematically analyze the rapidly accumulating volume of whole-genome pooled DNA data. Results: We propose a generalized concept of pooled DNA and present a user-friendly tool named Microarray Pooled DNA Analyzer (MPDA) that we developed to analyze hybridization intensity data from microarray-based pooled DNA experiments. MPDA enables whole-genome DNA preferential amplification/hybridization analysis, allele frequency estimation, association mapping, allelic imbalance detection, and permits integration with shared data resources online. Graphic and numerical outputs from MPDA support global and detailed inspection of large amounts of genomic data. Four whole-genome data analyses are used to illustrate the major functionalities of MPDA. The first analysis shows that MPDA can characterize genomic patterns of preferential amplification/hybridization and provide calibration information for pooled DNA data analysis. The second analysis demonstrates that MPDA can accurately estimate allele frequencies. The third analysis indicates that MPDA is cost-effective and reliable for association mapping. The final analysis shows that MPDA can identify regions of chromosomal aberration in cancer without paired-normal tissue. Conclusion: MPDA, the software that integrates pooled DNA association analysis and allelic imbalance analysis, provides a convenient analysis system for extensive whole-genome pooled DNA data analysis. The software, user manual and illustrated examples are freely available online at the MPDA website listed in the Availability and requirements section. © 2008 Yang et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Yang H.-C."
                    },
                    {
                        "name": "Huang M.-C."
                    },
                    {
                        "name": "Li L.-H."
                    },
                    {
                        "name": "Lin C.-H."
                    },
                    {
                        "name": "Yu A.L.T."
                    },
                    {
                        "name": "Diccianni M.B."
                    },
                    {
                        "name": "Wu J.-Y."
                    },
                    {
                        "name": "Chen Y.-T."
                    },
                    {
                        "name": "Fann C.S.J."
                    }
                ],
                "citationCount": 11,
                "date": "2008-04-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MPDA: Microarray pooled DNA analyzer"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "20081110"
    ]
}