{
    "additionDate": "2020-01-14T09:17:56Z",
    "biotoolsCURIE": "biotools:biocaddie",
    "biotoolsID": "biocaddie",
    "confidence_flag": "tool",
    "description": "Leveraging word embeddings and medical entity extraction for biomedical dataset retrieval using unstructured texts.\n\nMayo's Data for the bioCADDIE 2016 Dataset Retrieval Challenge",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yanshanwang/biocaddie2016mayodata",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-09T13:49:14Z",
    "name": "bioCADDIE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAX091",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press.The recent movement towards open data in the biomedical domain has generated a large number of datasets that are publicly accessible. The Big Data to Knowledge data indexing project, biomedical and healthCAre Data Discovery Index Ecosystem (bioCADDIE), has gathered these datasets in a one-stop portal aiming at facilitating their reuse for accelerating scientific advances. However, as the number of biomedical datasets stored and indexed increases, it becomes more and more challenging to retrieve the relevant datasets according to researchers' queries. In this article, we propose an information retrieval (IR) system to tackle this problem and implement it for the bioCADDIE Dataset Retrieval Challenge. The system leverages the unstructured texts of each dataset including the title and description for the dataset, and utilizes a state-of-the-art IR model, medical named entity extraction techniques, query expansion with deep learning-based word embeddings and a re-ranking strategy to enhance the retrieval performance. In empirical experiments, we compared the proposed system with 11 baseline systems using the bioCADDIE Dataset Retrieval Challenge datasets. The experimental results show that the proposed system outperforms other systems in terms of inference Average Precision and inference normalized Discounted Cumulative Gain, implying that the proposed system is a viable option for biomedical dataset retrieval. Database URL: https://github.com/yanshanwang/biocaddie2016mayodata.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Rastegar-Mojarad M."
                    },
                    {
                        "name": "Komandur-Elayavilli R."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "citationCount": 4,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "Leveraging word embeddings and medical entity extraction for biomedical dataset retrieval using unstructured texts"
            },
            "pmcid": "PMC7243926",
            "pmid": "31725862"
        }
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}