{
    "additionDate": "2021-01-18T11:12:31Z",
    "biotoolsCURIE": "biotools:vffva",
    "biotoolsID": "vffva",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "benguebila@hsph.harvard.edu",
            "name": "Marouen Ben Guebila",
            "orcidid": "https://orcid.org/0000-0001-5934-966X",
            "typeEntity": "Person"
        }
    ],
    "description": "VFFVA performs dynamic load blancing. In runtime, each worker gets a small chunk of reactions to process and once finished, gets another one and so on (right figure). This setting allows i) fast workers to process more reactions which allows all the workers to finish at the same time, and ii) does not require a priori balancing as the workers will automatically get chunk of reactions assigned from the queue.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marouenbg/VFFVA",
    "language": [
        "C",
        "MATLAB",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-12T16:23:36Z",
    "license": "MIT",
    "name": "VFFVA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03711-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Genome-scale metabolic models are increasingly employed to predict the phenotype of various biological systems pertaining to healthcare and bioengineering. To characterize the full metabolic spectrum of such systems, Fast Flux Variability Analysis (FFVA) is commonly used in parallel with static load balancing. This approach assigns to each core an equal number of biochemical reactions without consideration of their solution complexity. Results: Here, we present Very Fast Flux Variability Analysis (VFFVA) as a parallel implementation that dynamically balances the computation load between the cores in runtime which guarantees equal convergence time between them. VFFVA allowed to gain a threefold speedup factor with coupled models and up to 100 with ill-conditioned models along with a 14-fold decrease in memory usage. Conclusions: VFFVA exploits the parallel capabilities of modern machines to enable biological insights through optimizing systems biology modeling. VFFVA is available in C, MATLAB, and Python at https://github.com/marouenbg/VFFVA.",
                "authors": [
                    {
                        "name": "Guebila M.B."
                    }
                ],
                "date": "2020-09-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VFFVA: Dynamic load balancing enables large-scale flux variability analysis"
            },
            "pmcid": "PMC7523073",
            "pmid": "32993482"
        }
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
