{
    "additionDate": "2021-01-18T10:43:28Z",
    "biotoolsCURIE": "biotools:protfold-dfg",
    "biotoolsID": "protfold-dfg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "protein fold recognition by combining Directed Fusion Graph and PageRank algorithm.\n\na: ProtFold-DFG is based on the DeepSVM-fold(CCM), DeepSVM-fold(PSFM), MotifCNN-fold(CCM), MotifCNN-fold(PSFM) and LTR, uses transitive closure and KL-divergence to construct the Directed Fusion Graph and gets the final ranking result through PageRank algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/ProtFold-DFG/download",
    "lastUpdate": "2021-01-28T16:59:27Z",
    "name": "ProtFold-DFG",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA192",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.As one of the most important tasks in protein structure prediction, protein fold recognition has attracted more and more attention. In this regard, some computational predictors have been proposed with the development of machine learning and artificial intelligence techniques. However, these existing computational methods are still suffering from some disadvantages. In this regard, we propose a new network-based predictor called ProtFold-DFG for protein fold recognition. We propose the Directed Fusion Graph (DFG) to fuse the ranking lists generated by different methods, which employs the transitive closure to incorporate more relationships among proteins and uses the KL divergence to calculate the relationship between two proteins so as to improve its generalization ability. Finally, the PageRank algorithm is performed on the DFG to accurately recognize the protein folds by considering the global interactions among proteins in the DFG. Tested on a widely used and rigorous benchmark data set, LINDAHL dataset, experimental results show that the ProtFold-DFG outperforms the other 35 competing methods, indicating that ProtFold-DFG will be a useful method for protein fold recognition. The source code and data of ProtFold-DFG can be downloaded from http://bliulab.net/ProtFold-DFG/download.",
                "authors": [
                    {
                        "name": "Shao J."
                    },
                    {
                        "name": "Liu B."
                    }
                ],
                "citationCount": 9,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "ProtFold-DFG: protein fold recognition by combining Directed Fusion Graph and PageRank algorithm"
            },
            "pmid": "32892224"
        }
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}