{
    "accessibility": "Open access",
    "additionDate": "2023-08-24T10:15:08.106111Z",
    "biotoolsCURIE": "biotools:maw",
    "biotoolsID": "maw",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christoph.steinbeck@uni-jena.de",
            "name": "Christoph Steinbeck",
            "typeEntity": "Person"
        },
        {
            "email": "kristian.peters@ipb-halle.de",
            "name": "Kristian Peters",
            "typeEntity": "Person"
        },
        {
            "email": "mahnoor.zulfiqar@uni-jena.de",
            "name": "Mahnoor Zulfiqar",
            "typeEntity": "Person"
        },
        {
            "name": "Luiz Gadelha",
            "typeEntity": "Person"
        },
        {
            "name": "Maria Sorokina",
            "typeEntity": "Person"
        }
    ],
    "description": "Metabolome Annotation Workflow for untargeted tandem mass spectrometry.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zmahnoor14/MAW",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2023-08-24T10:15:08.108816Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zmahnoor14/MAW-Benchmark"
        }
    ],
    "name": "MAW",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13321-023-00695-Y",
            "metadata": {
                "abstract": "Mapping the chemical space of compounds to chemical structures remains a challenge in metabolomics. Despite the advancements in untargeted liquid chromatography-mass spectrometry (LC–MS) to achieve a high-throughput profile of metabolites from complex biological resources, only a small fraction of these metabolites can be annotated with confidence. Many novel computational methods and tools have been developed to enable chemical structure annotation to known and unknown compounds such as in silico generated spectra and molecular networking. Here, we present an automated and reproducible Metabolome Annotation Workflow (MAW) for untargeted metabolomics data to further facilitate and automate the complex annotation by combining tandem mass spectrometry (MS2) input data pre-processing, spectral and compound database matching with computational classification, and in silico annotation. MAW takes the LC-MS2 spectra as input and generates a list of putative candidates from spectral and compound databases. The databases are integrated via the R package Spectra and the metabolite annotation tool SIRIUS as part of the R segment of the workflow (MAW-R). The final candidate selection is performed using the cheminformatics tool RDKit in the Python segment (MAW-Py). Furthermore, each feature is assigned a chemical structure and can be imported to a chemical structure similarity network. MAW is following the FAIR (Findable, Accessible, Interoperable, Reusable) principles and has been made available as the docker images, maw-r and maw-py. The source code and documentation are available on GitHub (https://github.com/zmahnoor14/MAW). The performance of MAW is evaluated on two case studies. MAW can improve candidate ranking by integrating spectral databases with annotation tools like SIRIUS which contributes to an efficient candidate selection procedure. The results from MAW are also reproducible and traceable, compliant with the FAIR guidelines. Taken together, MAW could greatly facilitate automated metabolite characterization in diverse fields such as clinical metabolomics and natural product discovery.",
                "authors": [
                    {
                        "name": "Gadelha L."
                    },
                    {
                        "name": "Peters K."
                    },
                    {
                        "name": "Sorokina M."
                    },
                    {
                        "name": "Steinbeck C."
                    },
                    {
                        "name": "Zulfiqar M."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "MAW: the reproducible Metabolome Annotation Workflow for untargeted tandem mass spectrometry"
            },
            "pmcid": "PMC9985203",
            "pmid": "36871033"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
