{"credit":[{"email":"roman.mylonas@sib.swiss","name":"Roman Mylonas","note":"Bioinformatician at the Swiss Institute of Bioinformatics.","typeEntity":"Institute","typeRoles":["Maintainer"],"url":"http://www.sib.swiss/people/Roman.Mylonas"},{"email":"roman.mylonas@sib.swiss","name":"Roman Mylonas","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://msviz-docs.vital-it.ch/src/usage.html"},{"type":"GENERAL","url":"https://github.com/vitalit-sib/msviz-docker/blob/master/README.md"}],"download":[{"note":"MsViz Docker images are the recommended way for MsViz installation. You can alternatively directly install from its source code.","type":"Container file","url":"https://github.com/vitalit-sib/msviz-docker"}],"function":[{"operation":[{"term":"Spectral counting","uri":"http://edamontology.org/operation_3637"},{"term":"Mass spectrum visualisation","uri":"http://edamontology.org/operation_3694"},{"term":"Protein quantification","uri":"http://edamontology.org/operation_3630"},{"term":"Ion counting","uri":"http://edamontology.org/operation_3704"},{"term":"Target-Decoy","uri":"http://edamontology.org/operation_3649"}]}],"labels":{"collectionID":["Proteomics"],"cost":"Free of charge","language":["JavaScript","Shell","Scala"],"license":"GPL-2.0","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web API","Web application"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"}]},"link":[{"note":"MsViz Docker images.","type":"REPOSITORY","url":"https://github.com/vitalit-sib/msviz-docker"},{"note":"MsViz frontend source code.","type":"REPOSITORY","url":"https://github.com/vitalit-sib/msviz-ui"},{"note":"MsViz backend source code.","type":"REPOSITORY","url":"https://github.com/vitalit-sib/msviz-docker"}],"publication":[{"abstract":"© 2017 American Chemical Society. Mass spectrometry (MS) has become the tool of choice for the large scale identification and quantitation of proteins and their post-translational modifications (PTMs). This development has been enabled by powerful software packages for the automated analysis of MS data. While data on PTMs of thousands of proteins can nowadays be readily obtained, fully deciphering the complexity and combinatorics of modification patterns even on a single protein often remains challenging. Moreover, functional investigation of PTMs on a protein of interest requires validation of the localization and the accurate quantitation of its changes across several conditions, tasks that often still require human evaluation. Software tools for large scale analyses are highly efficient but are rarely conceived for interactive, in-depth exploration of data on individual proteins. We here describe MsViz, a web-based and interactive software tool that supports manual validation of PTMs and their relative quantitation in small- and medium-size experiments. The tool displays sequence coverage information, peptide-spectrum matches, tandem MS spectra and extracted ion chromatograms through a single, highly intuitive interface. We found that MsViz greatly facilitates manual data inspection to validate PTM location and quantitate modified species across multiple samples.","authors":["Martin-Campos T.","Mylonas R.","Masselot A.","Waridel P.","Petricevic T.","Xenarios I.","Quadroni M."],"cit_count":4,"doi":"10.1021/acs.jproteome.7b00194","journal":"Journal of Proteome Research","pmid":"28636386","title":"MsViz: A Graphical Software Tool for In-Depth Manual Validation and Quantitation of Post-translational Modifications","type":"Primary","year":"2017-08-04"}],"summary":{"biotoolsCURIE":"biotools:msviz","biotoolsID":"msviz","description":"Supports manual validation of post-translational modifications (PTMs) and their relative quantitation in small- and medium-size experiments. Thanks to its interactive interface MsViz can display peptide spectrum matches, sequence coverage information, or tandem mass spectrometry (MS/MS) spectra and extracted ion chromatograms. It allows easy and comprehensive visualization of small and medium bottom-up proteomics datasets.","homepage":"http://msviz-public.vital-it.ch","name":"MsViz","version":["1.0.1"]}}