{
    "additionDate": "2017-01-17T15:00:22Z",
    "biotoolsCURIE": "biotools:mipp",
    "biotoolsID": "mipp",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "s4kim@korea.ac.kr",
            "name": "Sukwoo Kim",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package finds optimal sets of genes that seperate samples into two or more classes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/MiPP.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MiPP_1.46.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/MiPP.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.healthsystem.virginia.edu/internet/hes/biostat/bioinformatics/"
        }
    ],
    "name": "MiPP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bti1020",
            "metadata": {
                "abstract": "Motivation: Genome-wide microarray data are often used in challenging classification problems of clinically relevant subtypes of human diseases. However, the identification of a parsimonious robust prediction model that performs consistently well on future independent data has not been successful due to the biased model selection from an extremely large number of candidate models during the classification model search and construction. Furthermore, common criteria of prediction model performance, such as classification error rates, do not provide a sensitive measure for evaluating performance of such astronomic competing models. Also, even though several different classification approaches have been utilized to tackle such classification problems, no direct comparison on these methods have been made. Results: We introduce a novel measure for assessing the performance of a prediction model, the misclassification-penalized posterior (MiPP), the sum of the posterior classification probabilities penalized by the number of incorrectly classified samples. Using MiPP, we implement a forward step-wise cross-validated procedure to find our optimal prediction models with different numbers of features on a training set. Our final robust classification model and its dimension are determined based on a completely independent test dataset. This MiPP-based classification modeling approach enables us to identify the most parsimonious robust prediction models only with two or three features on well-known microarray datasets. These models show superior performance to other models in the literature that often have more than 40-100 features in their model construction. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Soukup M."
                    },
                    {
                        "name": "Cho H.J."
                    },
                    {
                        "name": "Lee J.K."
                    }
                ],
                "citationCount": 16,
                "date": "2005-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Robust classification modeling on microarray data using misclassification penalized posterior"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1,
    "version": [
        "1.46.0"
    ]
}