{
    "additionDate": "2018-07-23T17:51:28Z",
    "biotoolsCURIE": "biotools:sccmecfinder",
    "biotoolsID": "sccmecfinder",
    "credit": [
        {
            "email": "arl@ssi.dk",
            "name": "Scientific Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "cgehelp@cbs.dtu.dk",
            "name": "Technical support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It identifies SCCmec elements in sequenced S. aureus isolates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cge.cbs.dtu.dk/services/SCCmecFinder/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://cge.cbs.dtu.dk/services/SCCmecFinder/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "SCCmecFinder",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1128/mSphere.00612-17",
            "metadata": {
                "abstract": "© 2018 Kaya et al.Typing of methicillin-resistant Staphylococcus aureus (MRSA) is important in infection control and surveillance. The current nomenclature of MRSA includes the genetic background of the S. aureus strain determined by multilocus sequence typing (MLST) or equivalent methods like spa typing and typing of the mobile genetic element staphylococcal cassette chromosome mec (SCCmec), which carries the mecA or mecC gene. Whereas MLST and spa typing are relatively simple, typing of SCCmec is less trivial because of its heterogeneity. Whole-genome sequencing (WGS) provides the essential data for typing of the genetic background and SCCmec, but so far, no bioinformatic tools for SCCmec typing have been available. Here, we report the development and evaluation of SCCmecFinder for characterization of the SCCmec element from S. aureus WGS data. SCCmecFinder is able to identify all SCCmec element types, designated I to XIII, with subtyping of SCCmec types IV (2B) and V (5C2). SCCmec elements are characterized by two different gene prediction approaches to achieve correct annotation, a Basic Local Alignment Search Tool (BLAST)-based approach and a k-mer-based approach. Evaluation of SCCmecFinder by using a diverse collection of clinical isolates (n = 93) showed a high typeability level of 96.7%, which increased to 98.9% upon modification of the default settings. In conclusion, SCCmecFinder can be an alternative to more laborious SCCmec typing methods and is freely available at https://cge.cbs.dtu.dk/services/ SCCmecFinder. IMPORTANCE SCCmec in MRSA is acknowledged to be of importance not only because it contains the mecA or mecC gene but also for staphylococcal adaptation to different environments, e.g., in hospitals, the community, and livestock. Typing of SCCmec by PCR techniques has, because of its heterogeneity, been challenging, and whole-genome sequencing has only partially solved this since no good bioinformatic tools have been available. In this article, we describe the development of a new bioinformatic tool, SCCmecFinder, that includes most of the needs for infection control professionals and researchers regarding the interpretation of SCCmec elements. The software detects all of the SCCmec elements accepted by the International Working Group on the Classification of Staphylococcal Cassette Chromosome Elements, and users will be prompted if diverging and potential new elements are uploaded. Furthermore, SCCmecFinder will be curated and updated as new elements are found and it is easy to use and freely accessible.",
                "authors": [
                    {
                        "name": "Kaya H."
                    },
                    {
                        "name": "Hasman H."
                    },
                    {
                        "name": "Larsen J."
                    },
                    {
                        "name": "Stegger M."
                    },
                    {
                        "name": "Johannesen T.B."
                    },
                    {
                        "name": "Allesoe R.L."
                    },
                    {
                        "name": "Lemvigh C.K."
                    },
                    {
                        "name": "Aarestrup F.M."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Larsen A.R."
                    }
                ],
                "citationCount": 46,
                "date": "2018-01-01T00:00:00Z",
                "journal": "mSphere",
                "title": "SCCmecFinder, a web-based tool for typing of staphylococcal cassette chromosome mec in staphylococcus aureus using whole-genome sequence data"
            },
            "pmcid": "PMC5812897",
            "pmid": "29468193"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}