{
    "additionDate": "2017-01-17T14:55:00Z",
    "biotoolsCURIE": "biotools:aldex2",
    "biotoolsID": "aldex2",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "ggloor@uwo.ca",
            "name": "Greg Gloor",
            "orcidid": "http://orcid.org/0000-0001-5803-3380",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A differential abundance analysis for the comparison of two or more conditions. It uses a Dirichlet-multinomial model to infer abundance from counts, that has been optimized for three or more experimental replicates. Infers sampling variation and calculates the expected FDR given the biological and sampling variation using the Wilcox rank test and Welches t-test, or the glm and Kruskal Wallis tests. Reports both P and fdr values calculated by the Benjamini Hochberg correction.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/ALDEx2.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ALDEx2_1.6.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression profile",
                        "uri": "http://edamontology.org/data_0928"
                    },
                    "format": [
                        {
                            "term": "Gene expression report format",
                            "uri": "http://edamontology.org/format_2058"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Statistical estimate score",
                        "uri": "http://edamontology.org/data_0951"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/ALDEx2.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-11-02T09:04:16.969822Z",
    "name": "ALDEx2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/2049-2618-2-15",
            "metadata": {
                "abstract": "© 2014 Fernandes et al.Background: Experimental designs that take advantage of high-throughput sequencing to generate datasets include RNA sequencing (RNA-seq), chromatin immunoprecipitation sequencing (ChIP-seq), sequencing of 16S rRNA gene fragments, metagenomic analysis and selective growth experiments. In each case the underlying data are similar and are composed of counts of sequencing reads mapped to a large number of features in each sample. Despite this underlying similarity, the data analysis methods used for these experimental designs are all different, and do not translate across experiments. Alternative methods have been developed in the physical and geological sciences that treat similar data as compositions. Compositional data analysis methods transform the data to relative abundances with the result that the analyses are more robust and reproducible.Results: Data from an in vitro selective growth experiment, an RNA-seq experiment and the Human Microbiome Project 16S rRNA gene abundance dataset were examined by ALDEx2, a compositional data analysis tool that uses Bayesian methods to infer technical and statistical error. The ALDEx2 approach is shown to be suitable for all three types of data: it correctly identifies both the direction and differential abundance of features in the differential growth experiment, it identifies a substantially similar set of differentially expressed genes in the RNA-seq dataset as the leading tools and it identifies as differential the taxa that distinguish the tongue dorsum and buccal mucosa in the Human Microbiome Project dataset. The design of ALDEx2 reduces the number of false positive identifications that result from datasets composed of many features in few samples.Conclusion: Statistical analysis of high-throughput sequencing datasets composed of per feature counts showed that the ALDEx2 R package is a simple and robust tool, which can be applied to RNA-seq, 16S rRNA gene sequencing and differential growth datasets, and by extension to other techniques that use a similar approach.",
                "authors": [
                    {
                        "name": "Edgell D.R."
                    },
                    {
                        "name": "Fernandes A.D."
                    },
                    {
                        "name": "Gloor G.B."
                    },
                    {
                        "name": "Macklaim J.M."
                    },
                    {
                        "name": "McMurrough T.A."
                    },
                    {
                        "name": "Reid J.N.S."
                    }
                ],
                "citationCount": 257,
                "date": "2014-05-05T00:00:00Z",
                "journal": "Microbiome",
                "title": "Unifying the analysis of high-throughput sequencing datasets: Characterizing RNA-seq, 16S rRNA gene sequencing and selective growth experiments by compositional data analysis"
            },
            "pmcid": "PMC4030730",
            "pmid": "24910773",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.0"
    ]
}
