{
    "additionDate": "2017-08-03T19:02:46Z",
    "biotoolsCURIE": "biotools:tiger",
    "biotoolsID": "tiger",
    "credit": [
        {
            "email": "papin@virginia.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.bme.virginia.edu/csbl/Contact1.html"
        }
    ],
    "description": "A software platform for building and analyzing genome-scale models of metabolism. TIGER provides methods for combining gene-protein-reaction associations, transcriptional regulation, and other biological constraints into a single mixed-integer linear programming (MILP) framework.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://csbl.bitbucket.io/tiger/doc/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                }
            ]
        }
    ],
    "homepage": "http://www.bme.virginia.edu/csbl/Downloads1-tiger.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tiger-1-2-0-beta-toolbox-integrating-genome-scale-metabolism-expression-regulation.html"
        }
    ],
    "name": "TIGER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Several methods have been developed for analyzing genome-scale models of metabolism and transcriptional regulation. Many of these methods, such as Flux Balance Analysis, use constrained optimization to predict relationships between metabolic flux and the genes that encode and regulate enzyme activity. Recently, mixed integer programming has been used to encode these gene-protein-reaction (GPR) relationships into a single optimization problem, but these techniques are often of limited generality and lack a tool for automating the conversion of rules to a coupled regulatory/metabolic model.Results: We present TIGER, a Toolbox for Integrating Genome-scale Metabolism, Expression, and Regulation. TIGER converts a series of generalized, Boolean or multilevel rules into a set of mixed integer inequalities. The package also includes implementations of existing algorithms to integrate high-throughput expression data with genome-scale models of metabolism and transcriptional regulation. We demonstrate how TIGER automates the coupling of a genome-scale metabolic model with GPR logic and models of transcriptional regulation, thereby serving as a platform for algorithm development and large-scale metabolic analysis. Additionally, we demonstrate how TIGER's algorithms can be used to identify inconsistencies and improve existing models of transcriptional regulation with examples from the reconstructed transcriptional regulatory network of Saccharomyces cerevisiae.Conclusion: The TIGER package provides a consistent platform for algorithm development and extending existing genome-scale metabolic models with regulatory networks and high-throughput data. © 2011 Jensen et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Jensen P.A."
                    },
                    {
                        "name": "Lutz K.A."
                    },
                    {
                        "name": "Papin J.A."
                    }
                ],
                "citationCount": 43,
                "date": "2011-09-23T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "TIGER: Toolbox for integrating genome-scale metabolic models, expression data, and transcriptional regulatory networks"
            },
            "pmid": "21943338"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}