{
    "additionDate": "2020-01-09T18:14:55Z",
    "biotoolsCURIE": "biotools:LDmotif",
    "biotoolsID": "LDmotif",
    "confidence_flag": "tool",
    "description": "Proteome-level assessment of origin, prevalence and function of Leucine-Aspartic Acid (LD) motifs.\n\nSource code for LD motif detection.\n\nIn this repository, we uploaded the necessary files to set up and environment to predict the LD motif from input sequence. We also have a server for LD motif predition : https://www.cbrc.kaust.edu.sa/ldmf/.\n\nUsers need to run scripts after changing the value of input parameters. The deatils of each parameter is also provide. The code is shared in the folder \"src\". All external jars are shared in the folder \"ExternalJar_Required\" There are two files that should be used for Amino Acid index. These files are also shared.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tanviralambd/LD/",
    "lastUpdate": "2020-12-22T10:32:41Z",
    "name": "LDmotif",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ703",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Leucine-aspartic acid (LD) motifs are short linear interaction motifs (SLiMs) that link paxillin family proteins to factors controlling cell adhesion, motility and survival. The existence and importance of LD motifs beyond the paxillin family is poorly understood. Results: To enable a proteome-wide assessment of LD motifs, we developed an active learning based framework (LD motif finder; LDMF) that iteratively integrates computational predictions with experimental validation. Our analysis of the human proteome revealed a dozen new proteins containing LD motifs. We found that LD motif signalling evolved in unicellular eukaryotes more than 800 Myr ago, with paxillin and vinculin as core constituents, and nuclear export signal as a likely source of de novo LD motifs. We show that LD motif proteins form a functionally homogenous group, all being involved in cell morphogenesis and adhesion. This functional focus is recapitulated in cells by GFP-fused LD motifs, suggesting that it is intrinsic to the LD motif sequence, possibly through their effect on binding partners. Our approach elucidated the origin and dynamic adaptations of an ancestral SLiM, and can serve as a guide for the identification of other SLiMs for which only few representatives are known. Availability and implementation: LDMF is freely available online at www.cbrc.kaust.edu.sa/ldmf; Source code is available at https://github.com/tanviralambd/LD/.",
                "authors": [
                    {
                        "name": "Adamo A."
                    },
                    {
                        "name": "Alam T."
                    },
                    {
                        "name": "Alazmi M."
                    },
                    {
                        "name": "Ali A.J."
                    },
                    {
                        "name": "Arold S.T."
                    },
                    {
                        "name": "Astro V."
                    },
                    {
                        "name": "Bajic V.B."
                    },
                    {
                        "name": "Canlas C.G."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Hong S.B."
                    },
                    {
                        "name": "Huser F."
                    },
                    {
                        "name": "Huser R."
                    },
                    {
                        "name": "Jaremko L."
                    },
                    {
                        "name": "Jaremko M."
                    },
                    {
                        "name": "Merzaban J."
                    },
                    {
                        "name": "Momin A.A."
                    },
                    {
                        "name": "Naser R."
                    },
                    {
                        "name": "Walkiewicz K.W."
                    }
                ],
                "citationCount": 4,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Proteome-level assessment of origin, prevalence and function of leucine-aspartic acid (LD) motifs"
            },
            "pmid": "31584626"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
