{
    "additionDate": "2017-12-18T00:10:36Z",
    "biotoolsCURIE": "biotools:psopia",
    "biotoolsID": "psopia",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mizuguchilab.org/"
        }
    ],
    "description": "PSOPIA (Prediction Server Of Protein-protein InterActions) is an AODE for predicting protein-protein interactions using three seqeucne based features; (I) sequence similarities to a known interacting protein pair, (II) statistical propensities of domain pairs observed in interacting proteins and (III) a sum of edge weights along the shortest path between homologous proteins in a PPI network.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mizuguchilab.org/PSOPIA/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://mizuguchilab.org/PSOPIA/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/psopia-20130501-prediction-server-of-protein-protein-interactions.html"
        }
    ],
    "name": "PSOPIA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-213",
            "metadata": {
                "abstract": "Background: Identification of protein-protein interactions (PPIs) is essential for a better understanding of biological processes, pathways and functions. However, experimental identification of the complete set of PPIs in a cell/organism (\" an interactome\" ) is still a difficult task. To circumvent limitations of current high-throughput experimental techniques, it is necessary to develop high-performance computational methods for predicting PPIs.Results: In this article, we propose a new computational method to predict interaction between a given pair of protein sequences using features derived from known homologous PPIs. The proposed method is capable of predicting interaction between two proteins (of unknown structure) using Averaged One-Dependence Estimators (AODE) and three features calculated for the protein pair: (a) sequence similarities to a known interacting protein pair (FSeq), (b) statistical propensities of domain pairs observed in interacting proteins (FDom) and (c) a sum of edge weights along the shortest path between homologous proteins in a PPI network (FNet). Feature vectors were defined to lie in a half-space of the symmetrical high-dimensional feature space to make them independent of the protein order. The predictability of the method was assessed by a 10-fold cross validation on a recently created human PPI dataset with randomly sampled negative data, and the best model achieved an Area Under the Curve of 0.79 (pAUC0.5% = 0.16). In addition, the AODE trained on all three features (named PSOPIA) showed better prediction performance on a separate independent data set than a recently reported homology-based method.Conclusions: Our results suggest that FNet, a feature representing proximity in a known PPI network between two proteins that are homologous to a target protein pair, contributes to the prediction of whether the target proteins interact or not. PSOPIA will help identify novel PPIs and estimate complete PPI networks. The method proposed in this article is freely available on the web at http://mizuguchilab.org/PSOPIA. © 2014 Murakami and Mizuguchi; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Murakami Y."
                    },
                    {
                        "name": "Mizuguchi K."
                    }
                ],
                "citationCount": 37,
                "date": "2014-06-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Homology-based prediction of interactions between proteins using Averaged One-Dependence Estimators"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein-protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Interactions",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "20130501"
    ]
}