{
    "name": "XBSeq", 
    "description": "This algorithm establishes an statistical model based on the assumption that observed signals are the convolution of true expression signals and sequencing noises. The mapped reads in non-exonic regions are considered as sequencing noises that follow a Poisson distribution. Given measureable observed and noise signals from RNA-seq data, true expression signals can be identified, assuming that they are governed by the negative binomial distribution.", 
    "homepage": "http://bioconductor.org/packages/release/bioc/html/XBSeq.html", 
    "biotoolsID": "xbseq", 
    "biotoolsCURIE": "biotools:xbseq", 
    "version": [
        "1.4.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3223", 
                    "term": "Differential gene expression analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3680", 
                    "term": "RNA-Seq analysis"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0863", 
                        "term": "Sequence alignment"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2330", 
                            "term": "Textual format"
                        }, 
                        {
                            "uri": "http://edamontology.org/format_2306", 
                            "term": "GTF"
                        }
                    ]
                }, 
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2887", 
                        "term": "Nucleic acid sequence record"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2330", 
                            "term": "Textual format"
                        }, 
                        {
                            "uri": "http://edamontology.org/format_2306", 
                            "term": "GTF"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2884", 
                        "term": "Plot"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3547", 
                            "term": "Image format"
                        }
                    ]
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-Seq"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [
        "BioConductor"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/Liuy12/XBSeq", 
            "type": "Mirror", 
            "note": null
        }
    ], 
    "download": [
        {
            "url": "http://bioconductor/packages/release/bioc/src/contrib/XBSeq_1.4.0.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/XBSeq.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2164-16-S7-S14", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Differential expression analysis of RNA sequencing data by incorporating non-exonic mapped reads", 
                "abstract": "© 2015 Chen et al.; licensee BioMed Central Ltd.Background: RNA sequencing (RNA-seq) is a powerful tool for genome-wide expression profiling of biological samples with the advantage of high-throughput and high resolution. There are many existing algorithms nowadays for quantifying expression levels and detecting differential gene expression, but none of them takes the misaligned reads that are mapped to non-exonic regions into account. We developed a novel algorithm, XBSeq, where a statistical model was established based on the assumption that observed signals are the convolution of true expression signals and sequencing noises. The mapped reads in non-exonic regions are considered as sequencing noises, which follows a Poisson distribution. Given measureable observed and noise signals from RNA-seq data, true expression signals, assuming governed by the negative binomial distribution, can be delineated and thus the accurate detection of differential expressed genes. Results: We implemented our novel XBSeq algorithm and evaluated it by using a set of simulated expression datasets under different conditions, using a combination of negative binomial and Poisson distributions with parameters derived from real RNA-seq data. We compared the performance of our method with other commonly used differential expression analysis algorithms. We also evaluated the changes in true and false positive rates with variations in biological replicates, differential fold changes, and expression levels in non-exonic regions. We also tested the algorithm on a set of real RNA-seq data where the common and different detection results from different algorithms were reported. Conclusions: In this paper, we proposed a novel XBSeq, a differential expression analysis algorithm for RNA-seq data that takes non-exonic mapped reads into consideration. When background noise is at baseline level, the performance of XBSeq and DESeq are mostly equivalent. However, our method surpasses DESeq and other algorithms with the increase of non-exonic mapped reads. Only in very low read count condition XBSeq had a slightly higher false discovery rate, which may be improved by adjusting the background noise effect in this situation. Taken together, by considering non-exonic mapped reads, XBSeq can provide accurate expression measurement and thus detect differential expressed genes even in noisy conditions.", 
                "date": "2015-06-11T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Chen H.-I.H."
                    }, 
                    {
                        "name": "Liu Y."
                    }, 
                    {
                        "name": "Zou Y."
                    }, 
                    {
                        "name": "Lai Z."
                    }, 
                    {
                        "name": "Sarkar D."
                    }, 
                    {
                        "name": "Huang Y."
                    }, 
                    {
                        "name": "Chen Y."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Yuanhang Liu", 
            "email": "liuy12@uthscsa.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bioconductor_import", 
    "additionDate": "2017-01-17T14:57:16Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}