{
    "additionDate": "2017-01-13T13:14:09Z",
    "biotoolsCURIE": "biotools:condetri",
    "biotoolsID": "condetri",
    "credit": [
        {
            "name": "ConDeTri team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/linneas"
        }
    ],
    "description": "ConDeTri is a content dependent read trimming software for Illumina/Solexa sequencing data",
    "documentation": [
        {
            "type": "General",
            "url": "https://code.google.com/archive/p/condetri/wikis"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://code.google.com/p/condetri/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "maturity": "Mature",
    "name": "ConDeTri",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "During the last few years, DNA and RNA sequencing have started to play an increasingly important role in biological and medical applications, especially due to the greater amount of sequencing data yielded from the new sequencing machines and the enormous decrease in sequencing costs. Particularly, Illumina/Solexa sequencing has had an increasing impact on gathering data from model and non-model organisms. However, accurate and easy to use tools for quality filtering have not yet been established. We present ConDeTri, a method for content dependent read trimming for next generation sequencing data using quality scores of each individual base. The main focus of the method is to remove sequencing errors from reads so that sequencing reads can be standardized. Another aspect of the method is to incorporate read trimming in next-generation sequencing data processing and analysis pipelines. It can process single-end and paired-end sequence data of arbitrary length and it is independent from sequencing coverage and user interaction. ConDeTri is able to trim and remove reads with low quality scores to save computational time and memory usage during de novo assemblies. Low coverage or large genome sequencing projects will especially gain from trimming reads. The method can easily be incorporated into preprocessing and analysis pipelines for Illumina data. Availability and implementation: Freely available on the web at http://code.google.com/p/condetri. © 2011 Smeds, Künstner. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.",
                "authors": [
                    {
                        "name": "Smeds L."
                    },
                    {
                        "name": "Kunstner A."
                    }
                ],
                "citationCount": 127,
                "date": "2011-10-25T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ConDeTri - a content dependent read trimmer for illumina data"
            },
            "pmid": "22039460"
        },
        {
            "doi": "10.1371/journal.pone.0026314",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}