{
    "additionDate": "2021-06-14T13:11:44Z",
    "biotoolsCURIE": "biotools:4mc-w2vec",
    "biotoolsID": "4mc-w2vec",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person"
        },
        {
            "email": "kitchong@jbnu.ac.kr",
            "name": "Kil To Chong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "4mC-w2vec is a web tool for identifying DNA N4-methylcytosine sites in the rosaceae genome with a deep learning model relying on distributed feature representation.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://nsclbio.jbnu.ac.kr/tools/4mC-w2vec/",
    "lastUpdate": "2021-08-09T09:03:36.823744Z",
    "name": "4mC-w2vec",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.03.015",
            "metadata": {
                "abstract": "© 2021 The AuthorsDNA N4-methylcytosine (4mC), an epigenetic modification found in prokaryotic and eukaryotic species, is involved in numerous biological functions, including host defense, transcription regulation, gene expression, and DNA replication. To identify 4mC sites, previous computational studies mostly focused on finding hand-crafted features. This area of research, therefore, would benefit from the development of a computational approach that relies on automatic feature selection to identify relevant sites. We here report 4mC-w2vec, a computational method that learned automatic feature discrimination in the Rosaceae genomes, especially in Rosa chinensis (R. chinensis) and Fragaria vesca (F. vesca), based on distributed feature representation and through the word embedding technique ‘word2vec’. While a few bioinformatics tools are currently employed to identify 4mC sites in these genomes, their prediction performance is inadequate. Our system processed 4mC and non-4mC sites through a word embedding process, including sub-word information of its biological words through k-mer, which then served as features that were fed into a double layer of convolutional neural network (CNN) to classify whether the sample sequences contained 4mCs or non-4mCs sites. Our tool demonstrated performance superior to current tools that use the same genomic datasets. Additionally, 4mC-w2vec is effective for balanced and imbalanced class datasets alike, and the online web-server is currently available at: http://nsclbio.jbnu.ac.kr/tools/4mC-w2vec/.",
                "authors": [
                    {
                        "name": "Khanal J."
                    },
                    {
                        "name": "Tayara H."
                    },
                    {
                        "name": "Zou Q."
                    },
                    {
                        "name": "Chong K.T."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "Identifying DNA N4-methylcytosine sites in the rosaceae genome with a deep learning model relying on distributed feature representation"
            },
            "pmcid": "PMC8042287",
            "pmid": "33868598"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}