{
    "additionDate": "2021-01-18T08:02:45Z",
    "biotoolsCURIE": "biotools:hlppred-fuse",
    "biotoolsID": "hlppred-fuse",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "glee@ajou.ac.kr",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved and robust prediction of hemolytic peptide and its activity by fusing multiple feature representation.\n\nWelcome to the Home Page of HLPpred-Fuse.\n\nHLPpred-Fuse could be established according to the following steps: (i) feature representation scheme was employed to generate 54 probabilistic features derived from 54 prediction models that utilized nine different types of peptide features, i.e. AAC, DPC, amino acid index (AAI), binary profile (BPF), composition-transition-distribution (CTD), conjoint triad (CTF), quasi-sequence order (QSO), grouped dipeptide composition (GDPC), and grouped tripeptide composition (GTPC), and six ML classifiers, i.e. SVM, RF, gradient boosting (GB), extremely randomized tree (ERT), k-nearest neighbor (KNN), and AdaBoost (AB); and (ii) those 54 probabilistic features were fused and inputted to ERT to develop a final predictor separately for both layers. For a given peptide sequence, HLPpred-Fuse predicts HLPs activity and probability values.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://thegleelab.org/HLPpred-Fuse",
    "lastUpdate": "2021-01-30T11:56:36Z",
    "name": "HLPpred-Fuse",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA160",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Therapeutic peptides failing at clinical trials could be attributed to their toxicity profiles like hemolytic activity, which hamper further progress of peptides as drug candidates. The accurate prediction of hemolytic peptides (HLPs) and its activity from the given peptides is one of the challenging tasks in immunoinformatics, which is essential for drug development and basic research. Although there are a few computational methods that have been proposed for this aspect, none of them are able to identify HLPs and their activities simultaneously. Results: In this study, we proposed a two-layer prediction framework, called HLPpred-Fuse, that can accurately and automatically predict both hemolytic peptides (HLPs or non-HLPs) as well as HLPs activity (high and low). More specifically, feature representation learning scheme was utilized to generate 54 probabilistic features by integrating six different machine learning classifiers and nine different sequence-based encodings. Consequently, the 54 probabilistic features were fused to provide sufficiently converged sequence information which was used as an input to extremely randomized tree for the development of two final prediction models which independently identify HLP and its activity. Performance comparisons over empirical cross-validation analysis, independent test and case study against state-of-the-art methods demonstrate that HLPpred-Fuse consistently outperformed these methods in the identification of hemolytic activity. Contact: glee@ajou.ac.kr or watshara.sho@mahidol.ac.th or bala@ajou.ac.kr",
                "authors": [
                    {
                        "name": "Basith S."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Lee G."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Schaduangrat N."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 43,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HLPpred-Fuse: Improved and robust prediction of hemolytic peptide and its activity by fusing multiple feature representation"
            },
            "pmid": "32145017"
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
