
{
    "credit": [
        {
            "email": "balanagireddy.m@gmail.com",
            "name": "Bala Nagi Reddy M",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "chandubobby@gmail.com",
            "name": "Chandrakanth Reddy B",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "sagar4uonnet@gmail.com",
            "name": "Anand Sagar Kothapalli",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www3.cs.stonybrook.edu/~skiena/shorty/improvements.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Perl"
        ],
        "maturity": "Legacy",
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: New short-read sequencing technologies produce enormous volumes of 25-30 base paired-end reads. The resulting reads have vastly different characteristics than produced by Sanger sequencing, and require different approaches than the previous generation of sequence assemblers. In this paper, we present a short-read de novo assembler particularly targeted at the new ABI SOLiD sequencing technology. Results: This paper presents what we believe to be the first de novo sequence assembly results on real data from the emerging SOLiD platform, introduced by Applied Biosystems. Our assembler SHORTY augments short-paired reads using a trivially small number (5 - 10) of seeds of length 300 - 500 bp. These seeds enable us to produce significant assemblies using short-read coverage no more than 100×, which can be obtained in a single run of these high-capacity sequencers. SHORTY exploits two ideas which we believe to be of interest to the short-read assembly community: (1) using single seed reads to crystallize assemblies, and (2) estimating intercontig distances accurately from multiple spanning paired-end reads. Conclusion: We demonstrate effective assemblies (N50 contig sizes ∼40 kb) of three different bacterial species using simulated SOLiD data. Sequencing artifacts limit our performance on real data, however our results on this data are substantially better than those achieved by competing assemblers. © 2009 Hossain et al; licensee BioMed Central Ltd.",
            "authors": [
                "Hossain M.",
                "Azimi N.",
                "Skiena S."
            ],
            "cit_count": 26,
            "journal": "BMC Bioinformatics",
            "pmid": "19208115",
            "title": "Crystallizing short-read assemblies around seeds",
            "year": "2009-01-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:shorty",
        "biotoolsID": "shorty",
        "description": "Targetted for de novo assembly of microreads with mate pair information and sequencing errors. It has some novel approach and features in addressing the short read assembly problem.",
        "homepage": "http://www.cs.sunysb.edu/%7Eskiena/shorty/",
        "name": "SHORTY"
    }
}