
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Gene expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Humans",
                "uri": "http://edamontology.org/topic_2815"
            },
            {
                "term": "Phenomics",
                "uri": "http://edamontology.org/topic_3298"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Positional MEDLINE (PosMed; http://biolod.org/PosMed) is a powerful Semantic Web Association Study engine that ranks biomedical resources such as genes, metabolites, diseases and drugs, based on the statistical significance of associations between user-specified phenotypic keywords and resources connected directly or inferentially through a Semantic Web of biological databases such as MEDLINE, OMIM, pathways, co-expressions, molecular interactions and ontology terms. Since 2005, PosMed has long been used for in silico positional cloning studies to infer candidate disease-responsible genes existing within chromosomal intervals. PosMed is redesigned as a workbench to discover possible functional interpretations for numerous genetic variants found from exome sequencing of human disease samples. We also show that the association search engine enhances the value of mouse bioresources because most knockout mouse resources have no phenotypic annotation, but can be associated inferentially to phenotypes via genes and biomedical documents. For this purpose, we established text-mining rules to the biomedical documents by careful human curation work, and created a huge amount of correct linking between genes and documents. PosMed associates any phenotypic keyword to mouse resources with 20 public databases and four original data sets as of May 2013.",
            "authors": [
                "Makita Y.",
                "Kobayashi N.",
                "Yoshida Y.",
                "Doi K.",
                "Mochizuki Y.",
                "Nishikata K.",
                "Matsushima A.",
                "Takahashi S.",
                "Ishii M.",
                "Takatsuki T.",
                "Bhatia R.",
                "Khadbaatar Z.",
                "Watabe H.",
                "Masuya H.",
                "Toyoda T."
            ],
            "cit_count": 9,
            "journal": "Nucleic acids research",
            "pmid": "23761449",
            "title": "PosMed: Ranking genes and bioresources based on Semantic Web Association Study.",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:posmed",
        "biotoolsID": "posmed",
        "description": "To assist in prioritizing candidate genes discovered in a linkage analysis, the tool executes a full-text search of documents given a query word input and ranks the positional cloning candidate genes based on direct and indirect inference of the hit documents. It currently supports prioritization of positional cloning candidate genes in human, mouse, rat and Arabidopsis thaliana.",
        "homepage": "http://biolod.org/PosMed",
        "name": "PosMed"
    }
}