{
    "additionDate": "2018-07-25T16:51:07Z",
    "biotoolsCURIE": "biotools:spurio",
    "biotoolsID": "spurio",
    "credit": [
        {
            "email": "AGB@ebi.ac.uk",
            "name": "Alex Bateman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identify spurious protein predictions in prokaryotes. It searches the query protein sequence against a prokaryotic nucleotide database using tblastn and identifies homologous sequences. Features of the matches are used to score the query sequences' likelihood to be a spurious protein prediction using a Gaussian process model.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/bateman-group/spurio"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/bateman-group/spurio",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "Spurio",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.12688/f1000research.14050.1",
            "metadata": {
                "abstract": "© 2018 Höps W et al.We now have access to the sequences of tens of millions of proteins. These protein sequences are essential for modern molecular biology and computational biology. The vast majority of protein sequences are derived from gene prediction tools and have no experimental supporting evidence for their translation. Despite the increasing accuracy of gene prediction tools there likely exists a large number of spurious protein predictions in the sequence databases. We have developed the Spurio tool to help identify spurious protein predictions in prokaryotes. Spurio searches the query protein sequence against a prokaryotic nucleotide database using tblastn and identifies homologous sequences. The tblastn matches are used to score the query sequence's likelihood of being a spurious protein prediction using a Gaussian process model. The most informative feature is the appearance of stop codons within the presumed translation of homologous DNA sequences. Benchmarking shows that the Spurio tool is able to distinguish spurious from true proteins. However, transposon proteins are prone to be predicted as spurious because of the frequency of degraded homologs found in the DNA sequence databases. Our initial experiments suggest that less than 1% of the proteins in the UniProtKB sequence database are likely to be spurious and that Spurio is able to identify over 60 times more spurious proteins than the AntiFam resource. The Spurio software and source code is available under an MIT license at the following URL: https://bitbucket.org/bateman-group/spurio",
                "authors": [
                    {
                        "name": "Hops W."
                    },
                    {
                        "name": "Jeffryes M."
                    },
                    {
                        "name": "Bateman A."
                    }
                ],
                "citationCount": 4,
                "date": "2018-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Gene Unprediction with Spurio: A tool to identify spurious protein sequences [version 1; referees: 2 approved]"
            },
            "pmcid": "PMC5897793",
            "pmid": "29721311"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}