{
    "additionDate": "2021-01-18T10:21:43Z",
    "biotoolsCURIE": "biotools:idssim",
    "biotoolsID": "idssim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shangjunliang110@163.com",
            "name": "Junliang Shang",
            "orcidid": "https://orcid.org/0000-0002-8488-2228",
            "typeEntity": "Person"
        }
    ],
    "description": "an lncRNA functional similarity calculation model based on an improved disease semantic similarity method.\n\nBACKGROUND:It has been widely accepted that long non-coding RNAs (lncRNAs) play important roles in the development and progression of human diseases. Many association prediction models have been proposed for predicting lncRNA functions and identifying potential lncRNA-disease associations. Nevertheless, among them, little effort has been attempted to measure lncRNA functional similarity, which is an essential part of association prediction models. RESULTS:In this study, we presented an lncRNA functional similarity calculation model, IDSSIM for short, based on an improved disease semantic similarity method, highlight of which is the introduction of information content contribution factor into the semantic value calculation to take into account both the hierarchical structures of disease directed acyclic graphs and the disease specificities",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CDMB-lab/IDSSIM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T07:34:05Z",
    "name": "IDSSIM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03699-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: It has been widely accepted that long non-coding RNAs (lncRNAs) play important roles in the development and progression of human diseases. Many association prediction models have been proposed for predicting lncRNA functions and identifying potential lncRNA-disease associations. Nevertheless, among them, little effort has been attempted to measure lncRNA functional similarity, which is an essential part of association prediction models. Results: In this study, we presented an lncRNA functional similarity calculation model, IDSSIM for short, based on an improved disease semantic similarity method, highlight of which is the introduction of information content contribution factor into the semantic value calculation to take into account both the hierarchical structures of disease directed acyclic graphs and the disease specificities. IDSSIM and three state-of-the-art models, i.e., LNCSIM1, LNCSIM2, and ILNCSIM, were evaluated by applying their disease semantic similarity matrices and the lncRNA functional similarity matrices, as well as corresponding matrices of human lncRNA-disease associations coming from either lncRNADisease database or MNDR database, into an association prediction method WKNKN for lncRNA-disease association prediction. In addition, case studies of breast cancer and adenocarcinoma were also performed to validate the effectiveness of IDSSIM. Conclusions: Results demonstrated that in terms of ROC curves and AUC values, IDSSIM is superior to compared models, and can improve accuracy of disease semantic similarity effectively, leading to increase the association prediction ability of the IDSSIM-WKNKN model; in terms of case studies, most of potential disease-associated lncRNAs predicted by IDSSIM can be confirmed by databases and literatures, implying that IDSSIM can serve as a promising tool for predicting lncRNA functions, identifying potential lncRNA-disease associations, and pre-screening candidate lncRNAs to perform biological experiments. The IDSSIM code, all experimental data and prediction results are available online at https://github.com/CDMB-lab/IDSSIM.",
                "authors": [
                    {
                        "name": "Fan W."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Liu J.-X."
                    },
                    {
                        "name": "Shang J."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Yuan S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-31T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IDSSIM: an lncRNA functional similarity calculation model based on an improved disease semantic similarity method"
            },
            "pmcid": "PMC7430881",
            "pmid": "32736513"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
