{
    "additionDate": "2017-01-17T15:00:14Z",
    "biotoolsCURIE": "biotools:gaga",
    "biotoolsID": "gaga",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "rosselldavid@gmail.com",
            "name": "David Rossell",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Implements the GaGa model for high-throughput data analysis, including differential expression analysis, supervised gene clustering and classification. Additionally, it performs sequential sample size calculations using the GaGa and LNNGV models (the latter from EBarrays package).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/gaga.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/gaga_2.20.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/gaga.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "GPL-2.0",
    "name": "gaga",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1214/09-aoas244",
            "metadata": {
                "abstract": "Hierarchical models are a powerful tool for high-throughput data with a small to moderate number of replicates, as they allow sharing information across units of information, for example, genes. We propose two such models and show its increased sensitivity in microarray differential expression applications. We build on the gamma-gamma hierarchical model introduced by Kendziorski et al. [Statist. Med. 22 (2003) 3899-3914] and Newton et al. [Biostatistics 5 (2004) 155-176], by addressing important limitations that may have hampered its performance and its more widespread use. The models parsimoniously describe the expression of thousands of genes with a small number of hyper-parameters. This makes them easy to interpret and analytically tractable. The first model is a simple extension that improves the fit substantially with almost no increase in complexity. We propose a second extension that uses a mixture of gamma distributions to further improve the fit, at the expense of increased computational burden. We derive several approximations that significantly reduce the computational cost. We find that our models outperform the original formulation of the model, as well as some other popular methods for differential expression analysis. The improved performance is specially noticeable for the small sample sizes commonly encountered in high-throughput experiments. Our methods are implemented in the freely available Bioconductor gaga package. © Institute of Mathematical Statistics, 2009.",
                "authors": [
                    {
                        "name": "Rossell D."
                    }
                ],
                "citationCount": 12,
                "date": "2009-03-01T00:00:00Z",
                "journal": "Annals of Applied Statistics",
                "title": "GaGa: A parsimonious and flexible model for differential expression analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "2.20.0"
    ]
}
