{
    "additionDate": "2020-01-14T09:32:57Z",
    "biotoolsCURIE": "biotools:IoT_autogenerated",
    "biotoolsID": "IoT_autogenerated",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "paolo.nesi@unifi.it",
            "name": "Paolo Nesi",
            "orcidid": "https://orcid.org/0000-0003-1044-3107",
            "typeEntity": "Person"
        },
        {
            "email": "yiyoon@sm.ac.kr",
            "name": "Yongik Yoon",
            "orcidid": "https://orcid.org/0000-0002-9385-3306",
            "typeEntity": "Person"
        }
    ],
    "description": "MicroServices Suite for Smart City Applications.\n\nDesign and Implementation of a Trust Information Management Platform for Social Internet of Things Environments.\n\nThis domain has been registered for a customer by nicsell.\n\nThis domain vital-iot.eu was registered successfully by nicsell due to a customer order and will be moved soon.\n\nThis domain has been successfully registered by nicsell.com for our customer. Unfortunately, it is no longer available for you.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Snap4City', 'trust', 'social IoT', 'TIMP', 'IoT businesses'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                }
            ]
        }
    ],
    "homepage": "http://vital-iot.eu/project",
    "lastUpdate": "2020-01-14T09:32:57Z",
    "name": "IoT_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19214798",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Smart Cities are approaching the Internet of Things (IoT) World. Most of the first-generation Smart City solutions are based on Extract Transform Load (ETL); processes and languages that mainly support pull protocols for data gathering. IoT solutions are moving forward to event-driven processes using push protocols. Thus, the concept of IoT applications has turned out to be widespread; but it was initially “implemented” with ETL; rule-based solutions; and finally; with true data flows. In this paper, these aspects are reviewed, highlighting the requirements for smart city IoT applications and in particular, the ones that implement a set of specific MicroServices for IoT Applications in Smart City contexts. Moreover; our experience has allowed us to implement a suite of MicroServices for Node-RED; which has allowed for the creation of a wide range of new IoT applications for smart cities that includes dashboards, IoT Devices, data analytics, discovery, etc., as well as a corresponding Life Cycle. The proposed solution has been validated against a large number of IoT applications, as it can be verified by accessing the https://www.Snap4City.org portal; while only three of them have been described in the paper. In addition, the reported solution assessment has been carried out by a number of smart city experts. The work has been developed in the framework of the Select4Cities PCP (PreCommercial Procurement), funded by the European Commission as Snap4City platform.",
                "authors": [
                    {
                        "name": "Badii C."
                    },
                    {
                        "name": "Bellini P."
                    },
                    {
                        "name": "Difino A."
                    },
                    {
                        "name": "Nesi P."
                    },
                    {
                        "name": "Pantaleo G."
                    },
                    {
                        "name": "Paolucci M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Microservices suite for smart city applications"
            },
            "pmcid": "PMC6864587",
            "pmid": "31690012"
        },
        {
            "doi": "10.3390/S19214707",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.As the vast amount of data in social Internet of Things (IoT) environments considering interactions between IoT and people is accumulated and processed through cloud and big data technologies, the services that utilize them are applied in various fields. The trust between IoT devices and their data is recognized as the core of IoT ecosystem creation and growth. Connection with suspicious IoT devices may pose a risk to services and system operation. Therefore, it is essential to analyze and manage trust information for devices, services, and people, as well as to provide the trust information to the other devices or users that need it. This paper presents a trust information management framework which contains a generic IoT reference model with trust capabilities to achieve the goal of converged trust information management. Additionally, a trust information management platform (TIMP) consisting of trust agents, trust information brokers, and trust information management systems has been proposed, which aims to provide trustworthy and safe interactions among people, virtual objects, and physical things. Implementing and deploying a TIMP enables a trustworthy ecosystem to be built while activating social IoT businesses by reducing transaction costs, as well as by eliminating the uncertainties in the use of social IoT services and data transactions.",
                "authors": [
                    {
                        "name": "Um T.-W."
                    },
                    {
                        "name": "Lee E."
                    },
                    {
                        "name": "Lee G.M."
                    },
                    {
                        "name": "Yoon Y."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Design and implementation of a trust information management platform for social internet of things environments"
            },
            "pmcid": "PMC6864804",
            "pmid": "31671918"
        }
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}