{
    "additionDate": "2021-01-18T06:58:17Z",
    "biotoolsCURIE": "biotools:detedit",
    "biotoolsID": "detedit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asolsonaberga@ucsd.edu",
            "name": "Alba Solsona-Berga",
            "orcidid": "https://orcid.org/0000-0003-4096-742X",
            "typeEntity": "Person"
        }
    ],
    "description": "DetEdit is a tool to visualize and annotate events from large acoustic datasets. It is highly configurable and can be used for multipurpose ranging from annotation and classification of individual or batches of signals and evaluation of signal properties to removing false detections and obtaining false positive rates.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/MarineBioAcousticsRC/DetEdit/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MarineBioAcousticsRC/DetEdit",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-01T07:53:05Z",
    "name": "DetEdit",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007598",
            "metadata": {
                "abstract": "© 2020 Solsona-Berga et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Passive acoustic monitoring has become an important data collection method, yielding massive datasets replete with biological, environmental and anthropogenic information. Automated signal detectors and classifiers are needed to identify events within these datasets, such as the presence of species-specific sounds or anthropogenic noise. These automated methods, however, are rarely a complete substitute for expert analyst review. The ability to visualize and annotate acoustic events efficiently can enhance scientific insights from large, previously intractable datasets. A MATLAB-based graphical user interface, called DetEdit, was developed to accelerate the editing and annotating of automated detections from extensive acoustic datasets. This tool is highly-configurable and multipurpose, with uses ranging from annotation and classification of individual signals or signal-clusters and evaluation of signal properties, to identification of false detections and false positive rate estimation. DetEdit allows users to step through acoustic events, displaying a range of signal features, including time series of received levels, long-term spectral averages, time intervals between detections, and scatter plots of peak frequency, RMS, and peak-to-peak received levels. Additionally, it displays either individual, or averaged sound pressure waveforms, and power spectra within each acoustic event. These views simultaneously provide analysts with signal-level detail and encounter-level context. DetEdit creates datasets of signal labels for further analyses, such as training classifiers and quantifying occurrence, abundances, or trends. Although designed for evaluating underwater-recorded odontocete echolocation click detections, DetEdit can be adapted to almost any stereotyped impulsive signal. Our software package complements available tools for the bioacoustic community and is provided open source at https://github.com/MarineBioAcousticsRC/DetEdit.",
                "authors": [
                    {
                        "name": "Solsona-Berga A."
                    },
                    {
                        "name": "Frasier K.E."
                    },
                    {
                        "name": "Baumann-Pickering S."
                    },
                    {
                        "name": "Wiggins S.M."
                    },
                    {
                        "name": "Hildebrand J.A."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Detedit: A graphical user interface for annotating and editing events detected in long-term acoustic monitoring data"
            },
            "pmcid": "PMC6980688",
            "pmid": "31929520"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ]
}