{
    "additionDate": "2021-01-18T10:52:50Z",
    "biotoolsCURIE": "biotools:adopy",
    "biotoolsID": "adopy",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Woo-Young Ahn",
            "typeEntity": "Person"
        },
        {
            "name": "Jay I. Myung",
            "typeEntity": "Person"
        }
    ],
    "description": "ADOpy is a Python implementation of Adaptive Design Optimization, which computes optimal designs dynamically in an experiment. Its modular structure permit easy integration into existing experimentation code.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://docs.adopy.org/en/stable/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-21T14:06:38Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/adopy/adopy"
        }
    ],
    "name": "ADOpy",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3758/S13428-020-01386-4",
            "metadata": {
                "abstract": "© 2020, The Psychonomic Society, Inc.Experimental design is fundamental to research, but formal methods to identify good designs are lacking. Advances in Bayesian statistics and machine learning offer algorithm-based ways to identify good experimental designs. Adaptive design optimization (ADO; Cavagnaro, Myung, Pitt, & Kujala, 2010; Myung, Cavagnaro, & Pitt, 2013) is one such method. It works by maximizing the informativeness and efficiency of data collection, thereby improving inference. ADO is a general-purpose method for conducting adaptive experiments on the fly and can lead to rapid accumulation of information about the phenomenon of interest with the fewest number of trials. The nontrivial technical skills required to use ADO have been a barrier to its wider adoption. To increase its accessibility to experimentalists at large, we introduce an open-source Python package, ADOpy, that implements ADO for optimizing experimental design. The package, available on GitHub, is written using high-level modular-based commands such that users do not have to understand the computational details of the ADO algorithm. In this paper, we first provide a tutorial introduction to ADOpy and ADO itself, and then illustrate its use in three walk-through examples: psychometric function estimation, delay discounting, and risky choice. Simulation data are also provided to demonstrate how ADO designs compare with other designs (random, staircase).",
                "authors": [
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Pitt M.A."
                    },
                    {
                        "name": "Ahn W.-Y."
                    },
                    {
                        "name": "Myung J.I."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "ADOpy: a python package for adaptive design optimization"
            },
            "pmid": "32901345"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}