{
    "accessibility": "Open access",
    "additionDate": "2022-09-10T15:28:14.893040Z",
    "biotoolsCURIE": "biotools:decode_python_lib",
    "biotoolsID": "decode_python_lib",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mrm@zurich.ibm.com",
            "name": "María Rodríguez Martínez",
            "typeEntity": "Person"
        },
        {
            "name": "An-Phi Nguyen",
            "typeEntity": "Person"
        }
    ],
    "description": "DECODE is a python package that allows the user to generate explanations for a TCR binding model.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/phineasng/DECODE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:40:13.934820Z",
    "license": "Not licensed",
    "name": "DECODE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac257",
            "metadata": {
                "abstract": "Motivation: Understanding the mechanisms underlying T cell receptor (TCR) binding is of fundamental importance to understanding adaptive immune responses. A better understanding of the biochemical rules governing TCR binding can be used, e.g.To guide the design of more powerful and safer T cell-based therapies. Advances in repertoire sequencing technologies have made available millions of TCR sequences. Data abundance has, in turn, fueled the development of many computational models to predict the binding properties of TCRs from their sequences. Unfortunately, while many of these works have made great strides toward predicting TCR specificity using machine learning, the black-box nature of these models has resulted in a limited understanding of the rules that govern the binding of a TCR and an epitope. Results: We present an easy-To-use and customizable computational pipeline, DECODE, to extract the binding rules from any black-box model designed to predict the TCR-epitope binding. DECODE offers a range of analytical and visualization tools to guide the user in the extraction of such rules. We demonstrate our pipeline on a recently published TCR-binding prediction model, TITAN, and show how to use the provided metrics to assess the quality of the computed rules. In conclusion, DECODE can lead to a better understanding of the sequence motifs that underlie TCR binding. Our pipeline can facilitate the investigation of current immunotherapeutic challenges, such as cross-reactive events due to off-Target TCR binding.",
                "authors": [
                    {
                        "name": "Martinez M.R."
                    },
                    {
                        "name": "Nguyen A.-P."
                    },
                    {
                        "name": "Papadopoulou I."
                    },
                    {
                        "name": "Weber A."
                    }
                ],
                "citationCount": 5,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DECODE: A computational pipeline to discover T cell receptor binding rules"
            },
            "pmcid": "PMC9235487",
            "pmid": "35758821"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
