{
    "additionDate": "2021-01-18T12:16:52Z",
    "biotoolsCURIE": "biotools:clonomatch",
    "biotoolsID": "clonomatch",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cinque.soto@vumc.org",
            "name": "Cinque Soto",
            "typeEntity": "Person"
        }
    ],
    "description": "a tool for identifying homologous immunoglobulin and T cell receptor sequences in large databases.\n\nClonoMatch is an open source full-stack web service for an immunoglobulin Clonotype matching database.\n\nThere are multiple steps for setting up ClonoMatch on your own system and it is recommended that the instructions for each step be read thoroughly before beginning. If you are familiar with the technologies involved these instructions will probably be straight forward, but there are a couple of steps that are custom to ClonoMatch and essential to getting the app working.\n\nClonoMatch is webservice that allows users to input V3J clonotypes to search for similar B cell or T cell receptor sequences derived from adaptive immune repertoire sequencing (AIRR-seq).\n\nSingle Clonotype Search Search Multiple Clonotypes From File.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/crowelab/clonomatch",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-02-12T15:57:05Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://clonomatch.accre.vanderbilt.edu/"
        }
    ],
    "name": "ClonoMatch",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1028",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comB-cell receptor (BCR) and T-cell receptor (TCR) repertoires are generated through somatic DNA rearrangements and are responsible for the molecular basis of antigen recognition in the immune system. Next-generation sequencing (NGS) of DNA and the falling cost of sequencing due to continued development of these technologies have made sequencing assays an affordable way to characterize the repertoire of adaptive immune receptors (sometimes termed the 'immunome'). Many new workflows have been developed to take advantage of NGS and have placed the resulting immunome datasets in the public domain. The scale of these NGS datasets has made it challenging to search through the Complementarity-determining region 3 (CDR3), which is responsible for imparting specific antibody-antigen interactions. Thus, there is an increasing demand for sequence analysis tools capable of searching through CDR3s from immunome data collections containing millions of sequences. To address this need, we created a software package called ClonoMatch that facilitates rapid searches in bulk immunome data for BCR or TCR sequences based on their CDR3 sequence or V3J clonotype.",
                "authors": [
                    {
                        "name": "Jones T."
                    },
                    {
                        "name": "Day S.B."
                    },
                    {
                        "name": "Myers L."
                    },
                    {
                        "name": "Crowe J.E."
                    },
                    {
                        "name": "Soto C."
                    }
                ],
                "date": "2020-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ClonoMatch: A tool for identifying homologous immunoglobulin and T-cell receptor sequences in large databases"
            },
            "pmid": "33325481"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}