{
    "additionDate": "2019-11-14T18:34:42Z",
    "biotoolsCURIE": "biotools:Romedi",
    "biotoolsID": "Romedi",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | An Open Data Source About French Drugs on the Semantic Web | The W3C project, \"Linking Open Drug Data\" (LODD), linked several publicly available sources of drug data together. So far, French data, like marketed drugs and their summary of product characteristics, were not integrated and remained difficult to query. In this paper, we present Romedi (Référentiel Ouvert du Médicament), an open dataset that links French data on drugs to international resources. The principles and standard recommendations created by the W3C for sharing information were adopted. Romedi was connected to the Unified Medical Language System and DrugBank, two central resources of the LODD project. A SPARQL endpoint is available to query Romedi and services are provided to annotate textual content with Romedi terms. This paper describes its content, its services, its links to external resources, and expected future developments",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31437889",
    "lastUpdate": "2019-11-14T18:34:42Z",
    "name": "Romedi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3233/SHTI190187",
            "metadata": {
                "abstract": "© 2019 International Medical Informatics Association (IMIA) and IOS Press. This article is published online with Open Access by IOS Press and distributed under the terms of the Creative Commons Attribution Non-Commercial License 4.0 (CC BY-NC 4.0).The W3C project, “Linking Open Drug Data” (LODD), linked several publicly available sources of drug data together. So far, French data, like marketed drugs and their summary of product characteristics, were not integrated and remained difficult to query. In this paper, we present Romedi (Référentiel Ouvert du Médicament), an open dataset that links French data on drugs to international resources. The principles and standard recommendations created by the W3C for sharing information were adopted. Romedi was connected to the Unified Medical Language System and DrugBank, two central resources of the LODD project. A SPARQL endpoint is available to query Romedi and services are provided to annotate textual content with Romedi terms. This paper describes its content, its services, its links to external resources, and expected future developments.",
                "authors": [
                    {
                        "name": "Cossin S."
                    },
                    {
                        "name": "Lebrun L."
                    },
                    {
                        "name": "Lobre G."
                    },
                    {
                        "name": "Loustau R."
                    },
                    {
                        "name": "Jouhet V."
                    },
                    {
                        "name": "Griffier R."
                    },
                    {
                        "name": "Mougin F."
                    },
                    {
                        "name": "Diallo G."
                    },
                    {
                        "name": "Thiessard F."
                    }
                ],
                "date": "2019-08-21T00:00:00Z",
                "journal": "Studies in Health Technology and Informatics",
                "title": "Romedi: An open data source about French drugs on the semantic web"
            },
            "pmid": "31437889"
        }
    ]
}