{"credit":[{"email":"miriah@cs.utah.edu","name":"Miriah Meyer","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cs.utah.edu/~miriah/"},{"email":"tmm@cs.ubc.ca","name":"Tamara Munzner","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cs.utah.edu/~miriah/mizbee/More_Info.html"}],"documentation":[{"type":"GENERAL","url":"http://www.cs.utah.edu/~miriah/mizbee/Video.html"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"}]}],"labels":{"language":["C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Comparative genomics","uri":"http://edamontology.org/topic_0797"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mizbee-multiscale-synteny-browser-exploring-conservation-relationships-comparative-genomics-data.html"}],"publication":[{"abstract":"In the field of comparative genomics, scientists seek to answer questions about evolution and genomic function by comparing the genomes of species to find regions of shared sequences. Conserved syntenic blocks are an important biological data abstraction for indicating regions of shared sequences. The goal of this work is to show multiple types of relationships at multiple scales in a way that is visually comprehensible in accordance with known perceptual principles. We present a task analysis for this domain where the fundamental questions asked by biologists can be understood by a characterization of relationships into the four types of proximity/location, size, orientation, and similarity/strength, and the four scales of genome, chromosome, block, and genomic feature. We also propose a new taxonomy of the design space for visually encoding conservation data. We present MizBee, a multiscale synteny browser with the unique property of providing interactive side-by-side views of the data across the range of scales supporting exploration of all of these relationship types. We conclude with case studies from two biologists who used MizBee to augment their previous automatic analysis work flow, providing anecdotal evidence about the efficacy of the system for the visualization of syntenic data, the analysis of conservation relationships, and the communication of scientific insights. © 2009 IEEE.","authors":["Meyer M.","Munzner T.","Pfister H."],"cit_count":76,"journal":"IEEE Transactions on Visualization and Computer Graphics","pmid":"19834152","title":"MizBee: A multiscale synteny browsers","year":"2009-11-01"}],"summary":{"biotoolsCURIE":"biotools:mizbee","biotoolsID":"mizbee","description":"Multiscale synteny browser for exploring conservation relationships in comparative genomics data. Using side-by-side linked views, MizBee enables efficient data browsing across a range of scales, from the genome to the gene.","homepage":"http://www.cs.utah.edu/~miriah/mizbee/Overview.html","name":"MizBee"}}