{
    "additionDate": "2020-01-14T09:09:21Z",
    "biotoolsCURIE": "biotools:CancerTracer",
    "biotoolsID": "CancerTracer",
    "confidence_flag": "tool",
    "description": "a curated database for intrapatient tumor heterogeneity.\n\nCancerTracer is a manually curated and integrated database aims to help researchers to decipher tumor heterogeneity at individual patient level. It contains two types of tumor heterogeneity data: 1) Intra-tumor or Intra-metastatic heterogeneity: the presence of multiple subclones within a primary tumor or a single metastatic lesion; 2) Inter-metastatic heterogeneity: the presence of different subclones in different metastatic lesions of the same patient. Somatic mutations and copy number alterations are available in CancerTracer, since both of them are principal factors drive heterogeneity in cancer. The structured heterogeneity data enables researchers to identify trunk mutations in different cancer types and investigate the molecular mechanisms underlying intratumor heterogeneity",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "http://cailab.labshare.cn/cancertracer",
    "lastUpdate": "2020-12-10T12:28:16Z",
    "name": "CancerTracer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1061",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Comprehensive genomic analyses of cancers have revealed substantial intrapatient molecular heterogeneities that may explain some instances of drug resistance and treatment failures. Examination of the clonal composition of an individual tumor and its evolution through disease progression and treatment may enable identification of precise therapeutic targets for drug design. Multi-region and single-cell sequencing are powerful tools that can be used to capture intratumor heterogeneity. Here, we present a database we've named CancerTracer (http://cailab.labshare.cn/cancertracer): A manually curated database designed to track and characterize the evolutionary trajectories of tumor growth in individual patients. We collected over 6000 tumor samples from 1548 patients corresponding to 45 different types of cancer. Patient-specific tumor phylogenetic trees were constructed based on somatic mutations or copy number alterations identified in multiple biopsies. Using the structured heterogeneity data, researchers can identify common driver events shared by all tumor regions, and the heterogeneous somatic events present in different regions of a tumor of interest. The database can also be used to investigate the phylogenetic relationships between primary and metastatic tumors. It is our hope that CancerTracer will significantly improve our understanding of the evolutionary histories of tumors, and may facilitate the identification of predictive biomarkers for personalized cancer therapies.",
                "authors": [
                    {
                        "name": "Cai H."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Tao X."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xiao Z.-X."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CancerTracer: A curated database for intrapatient tumor heterogeneity"
            },
            "pmid": "31701131"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
