{
    "accessibility": "Open access",
    "additionDate": "2019-08-04T08:57:11Z",
    "biotoolsCURIE": "biotools:RRBSsim",
    "biotoolsID": "RRBSsim",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xwsun@zju.edu.cn",
            "name": "Xiwei Sun",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Reduced representation bisulfite sequencing simulator for next-generation sequencing.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/xwBio/RRBSsim/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xwBio/RRBSsim",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "MIT",
    "link": [
        {
            "note": "A version of RRBSsim as a Docker image.",
            "type": [
                "Other"
            ],
            "url": "https://github.com/xwBio/Docker-RRBSsim"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/xwBio/RRBSsim/issues"
        }
    ],
    "maturity": "Mature",
    "name": "RRBSsim",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty174",
            "metadata": {
                "abstract": "© The Author(s) 2018.Motivation: The rapid development of next-generation sequencing technology provides an opportunity to study genome-wide DNA methylation at single-base resolution. However, depletion of unmethylated cytosines brings challenges for aligning bisulfite-converted sequencing reads to a large reference. Software tools for aligning methylation reads have not yet been comprehensively evaluated, especially for the widely used reduced representation bisulfite sequencing (RRBS) that involves enrichment for CpG islands (CGIs). Results: We specially developed a simulator, RRBSsim, for benchmarking analysis of RRBS data. We performed extensive comparison of seven mapping algorithms for methylation analysis in both real and simulated RRBS data. Eighteen lung tumors and matched adjacent tissues were sequenced by the RRBS protocols. Our empirical evaluation found that methylation results were less consistent between software tools for CpG sites with low sequencing depth, medium methylation level, on CGI shores or gene body. These observations were further confirmed by simulations that indicated software tools generally had lower recall of detecting these vulnerable CpG sites and lower precision of estimating methylation levels in these CpG sites. Among the software tools tested, bwa-meth and BS-Seeker2 (bowtie2) are currently our preferred aligners for RRBS data in terms of recall, precision and speed. Existing aligners cannot efficiently handle moderately methylated CpG sites and those CpG sites on CGI shores or gene body. Interpretation of methylation results from these vulnerable CpG sites should be treated with caution. Our study reveals several important features inherent in methylation data, and RRBSsim provides guidance to advance sequence-based methylation data analysis and methodological development.",
                "authors": [
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Zhou L."
                    },
                    {
                        "name": "Chen E."
                    },
                    {
                        "name": "Lu B."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Cowley A.W."
                    },
                    {
                        "name": "Liang M."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Liu P."
                    }
                ],
                "citationCount": 7,
                "date": "2018-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A comprehensive evaluation of alignment software for reduced representation bisulfite sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}