{
    "additionDate": "2017-01-17T15:02:32Z",
    "biotoolsCURIE": "biotools:plgem",
    "biotoolsID": "plgem",
    "collectionID": [
        "BioConductor",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "normanpavelka@gmail.com",
            "name": "Norman Pavelka",
            "orcidid": "http://orcid.org/0000-0003-4542-9970",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Power Law Global Error Model has been shown to faithfully model the variance-versus-mean dependence that exists in a variety of genome-wide datasets, including microarray and proteomics data. Its use has been shown to improve the detection of differentially expressed genes or proteins in these datasets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/plgem.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/plgem_1.46.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/plgem.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-07-19T20:06:19Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.genopolis.it"
        }
    ],
    "name": "plgem",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-5-203",
            "metadata": {
                "abstract": "Background: High-density oligonucleotide microarray technology enables the discovery of genes that are transcriptionally modulated in different biological samples due to physiology, disease or intervention. Methods for the identification of these so-called \"differentially expressed genes\" (DEG) would largely benefit from a deeper knowledge of the intrinsic measurement variability. Though it is clear that variance of repeated measures is highly dependent on the average expression level of a given gene, there is still a lack of consensus on how signal reproducibility is linked to signal intensity. The aim of this study was to empirically model the variance versus mean dependence in microarray data to improve the performance of existing methods for identifying DEG. Results: In the present work we used data generated by our lab as well as publicly available data sets to show that dispersion of repeated measures depends on location of the measures themselves following a power law. This enables us to construct a power law global error model (PLGEM) that is applicable to various Affymetrix GeneChip data sets. A new DEG identification method is therefore proposed, consisting of a statistic designed to make explicit use of model-derived measurement spread estimates and a resampling-based hypothesis testing algorithm. Conclusions: The new method provides a control of the false positive rate, a good sensitivity vs. specificity trade-off and consistent results with varying number of replicates and even using single samples. © 2004 Pavelka et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Pavelka N."
                    },
                    {
                        "name": "Pelizzola M."
                    },
                    {
                        "name": "Vizzardelli C."
                    },
                    {
                        "name": "Capozzoli M."
                    },
                    {
                        "name": "Splendiani A."
                    },
                    {
                        "name": "Granucci F."
                    },
                    {
                        "name": "Ricciardi-Castagnoli P."
                    }
                ],
                "citationCount": 77,
                "date": "2004-12-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A power law global error model for the identification of differentially expressed genes in microarray data"
            },
            "pmcid": "PMC545082",
            "pmid": "15606915",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "biobase",
            "type": "uses"
        },
        {
            "biotoolsID": "mass",
            "type": "uses"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "1.46.0"
    ]
}