{
    "name": "parallelnewhybrid", 
    "description": "An R package for the parallelization of hybrid detection using newhybrid.", 
    "homepage": "https://github.com/bwringe/parallelnewhybrid", 
    "biotoolsID": "parallelnewhybrid", 
    "biotoolsCURIE": "biotools:parallelnewhybrid", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3197", 
                    "term": "Genetic variation analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3299", 
            "term": "Evolutionary biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3056", 
            "term": "Population genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/bwringe/parallelnewhybrid", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1111/1755-0998.12597", 
            "pmid": "27617417", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "parallelnewhybrid: an R package for the parallelization of hybrid detection using newhybrids", 
                "abstract": "© 2016 John Wiley & Sons LtdHybridization among populations and species is a central theme in many areas of biology, and the study of hybridization has direct applicability to testing hypotheses about evolution, speciation and genetic recombination, as well as having conservation, legal and regulatory implications. Yet, despite being a topic of considerable interest, the identification of hybrid individuals, and quantification of the (un)certainty surrounding the identifications, remains difficult. Unlike other programs that exist to identify hybrids based on genotypic information, newhybrids is able to assign individuals to specific hybrid classes (e.g. F1, F2) because it makes use of patterns of gene inheritance within each locus, rather than just the proportions of gene inheritance within each individual. For each comparison and set of markers, multiple independent runs of each data set should be used to develop an estimate of the hybrid class assignment accuracy. The necessity of analysing multiple simulated data sets, constructed from large genomewide data sets, presents significant computational challenges. To address these challenges, we present parallelnewhybrid, an r package designed to decrease user burden when undertaking multiple newhybrids analyses. parallelnewhybrid does so by taking advantage of the parallel computational capabilities inherent in modern computers to efficiently and automatically execute separate newhybrids runs in parallel. We show that parallelization of analyses using this package affords users several-fold reductions in time over a traditional serial analysis. parallelnewhybrid consists of an example data set, a readme and three operating system-specific functions to execute parallel newhybrids analyses on each of a computer's c cores. parallelnewhybrid is freely available on the long-term software hosting site github (www.github.com/bwringe/parallelnewhybrid).", 
                "date": "2017-01-01T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Wringe B.F."
                    }, 
                    {
                        "name": "Stanley R.R.E."
                    }, 
                    {
                        "name": "Jeffery N.W."
                    }, 
                    {
                        "name": "Anderson E.C."
                    }, 
                    {
                        "name": "Bradbury I.R."
                    }
                ], 
                "journal": "Molecular Ecology Resources"
            }
        }
    ], 
    "credit": [
        {
            "name": "Brendan Wringe", 
            "email": "bwringe@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-05-01T16:37:38Z", 
    "lastUpdate": "2018-12-10T14:22:23Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}