{
    "additionDate": "2020-01-09T17:41:12Z",
    "biotoolsCURIE": "biotools:Meltos",
    "biotoolsID": "Meltos",
    "confidence_flag": "tool",
    "description": "Multi-Sample Tumor Phylogeny Reconstruction for Structural Variants.\n\nMeltos is a novel approach to estimate the variant allele frequency of somatic SVs from whole genome sequencing (WGS) signals and using these VAFs to identify the phylogenetic relationship between SSVs in a multi-sample cell lineage tree using an SNV-only tree as a basis. Our probabilistic framework allows us to assess multiple types of signals taken from the data simultaneously and more accurately calculate the VAF of SV events. Following the maximum parsimony principle, Meltos uses a novel combinatorial algorithm to assign SV clusters on the branches of the given lineage tree, while modestly augmenting the tree topology if needed",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ih-lab/Meltos",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-23T08:39:51Z",
    "license": "MIT",
    "name": "Meltos",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ737",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: We propose Meltos, a novel computational framework to address the challenging problem of building tumor phylogeny trees using somatic structural variants (SVs) among multiple samples. Meltos leverages the tumor phylogeny tree built on somatic single nucleotide variants (SNVs) to identify high confidence SVs and produce a comprehensive tumor lineage tree, using a novel optimization formulation. While we do not assume the evolutionary progression of SVs is necessarily the same as SNVs, we show that a tumor phylogeny tree using high-quality somatic SNVs can act as a guide for calling and assigning somatic SVs on a tree. Meltos utilizes multiple genomic read signals for potential SV breakpoints in whole genome sequencing data and proposes a probabilistic formulation for estimating variant allele fractions (VAFs) of SV events. Results: In order to assess the ability of Meltos to correctly refine SNV trees with SV information, we tested Meltos on two simulated datasets with five genomes in both. We also assessed Meltos on two real cancer datasets. We tested Meltos on multiple samples from a liposarcoma tumor and on a multi-sample breast cancer data (Yates et al., 2015), where the authors provide validated structural variation events together with deep, targeted sequencing for a collection of somatic SNVs. We show Meltos has the ability to place high confidence validated SV calls on a refined tumor phylogeny tree. We also showed the flexibility of Meltos to either estimate VAFs directly from genomic data or to use copy number corrected estimates.",
                "authors": [
                    {
                        "name": "Ricketts C."
                    },
                    {
                        "name": "Seidman D."
                    },
                    {
                        "name": "Popic V."
                    },
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Batzoglou S."
                    },
                    {
                        "name": "Hajirasouliha I."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Meltos: Multi-sample tumor phylogeny reconstruction for structural variants"
            },
            "pmid": "31584621"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}