{
    "accessibility": "Open access",
    "additionDate": "2024-05-14T10:34:10.969990Z",
    "biotoolsCURIE": "biotools:neo4jsbml",
    "biotoolsID": "neo4jsbml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guillaume.gricourt@inrae.fr",
            "name": "Guillaume Gricourt",
            "typeEntity": "Person"
        },
        {
            "name": "Jean-Loup Faulon",
            "typeEntity": "Person"
        }
    ],
    "description": "Import systems biology markup language data into the graph database Neo4j.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://anaconda.org/conda-forge/neo4jsbml",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-05-14T10:34:10.973001Z",
    "name": "neo4jsbml",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/peerj.16726",
            "metadata": {
                "abstract": "Systems Biology Markup Language (SBML) has emerged as a standard for representing biological models, facilitating model sharing and interoperability. It stores many types of data and complex relationships, complicating data management and analysis. Traditional database management systems struggle to effectively capture these complex networks of interactions within biological systems. Graph-oriented databases perform well in managing interactions between different entities. We present neo4jsbml, a new solution that bridges the gap between the Systems Biology Markup Language data and the Neo4j database, for storing, querying and analyzing data. The Systems Biology Markup Language organizes biological entities in a hierarchical structure, reflecting their interdependencies. The inherent graphical structure represents these hierarchical relationships, offering a natural and efficient means of navigating and exploring the model’s components. Neo4j is an excellent solution for handling this type of data. By representing entities as nodes and their relationships as edges, Cypher, Neo4j’s query language, efficiently traverses this type of graph representing complex biological networks. We have developed neo4jsbml, a Python library for importing Systems Biology Markup Language data into a Neo4j database using a user-defined schema. By leveraging Neo4j’s graphical database technology, exploration of complex biological networks becomes intuitive and information retrieval efficient. Neo4jsbml is a tool designed to import Systems Biology Markup Language data into a Neo4j database. Only the desired data is loaded into the Neo4j database. neo4jsbml is user-friendly and can become a useful new companion for visualizing and analyzing metabolic models through the Neo4j graphical database. neo4jsbml is open source software and available at https://github.com/brsynth/neo4jsbml.",
                "authors": [
                    {
                        "name": "Derozier S."
                    },
                    {
                        "name": "Duigou T."
                    },
                    {
                        "name": "Faulon J.-L."
                    },
                    {
                        "name": "Gricourt G."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "neo4jsbml: import systems biology markup language data into the graph database Neo4j"
            },
            "pmcid": "PMC10798154",
            "pmid": "38250720"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
