{
    "additionDate": "2021-03-19T08:27:16Z",
    "biotoolsCURIE": "biotools:hvidb",
    "biotoolsID": "hvidb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shi_ping_yang@163.com",
            "name": "Shiping Yang",
            "typeEntity": "Person"
        },
        {
            "email": "zidingzhang@cau.edu.cn",
            "name": "Ziding Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive database for human-virus protein-protein interactions.\n\nHere, we introduce a comprehensive human-virus PPI database, HVIDB (http://zzdlab.com/hvidb/), which is based on (i) multiple data resources associated with human-virus PPIs and provides (ii) an integrative, computational platform to predict interactions between human and virus proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://zzdlab.com/hvidb/",
    "lastUpdate": "2021-03-31T18:00:21Z",
    "name": "HVIDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA425",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved.While leading to millions of people's deaths every year the treatment of viral infectious diseases remains a huge public health challenge.Therefore, an in-depth understanding of human-virus protein-protein interactions (PPIs) as the molecular interface between a virus and its host cell is of paramount importance to obtain new insights into the pathogenesis of viral infections and development of antiviral therapeutic treatments. However, current human-virus PPI database resources are incomplete, lack annotation and usually do not provide the opportunity to computationally predict human-virus PPIs. Here, we present the Human-Virus Interaction DataBase (HVIDB, http://zzdlab.com/hvidb/) that provides comprehensively annotated human-virus PPI data as well as seamlessly integrates online PPI prediction tools. Currently, HVIDB highlights 48 643 experimentally verified human-virus PPIs covering 35 virus families, 6633 virally targeted host complexes, 3572 host dependency/restriction factors as well as 911 experimentally verified/predicted 3D complex structures of human-virus PPIs. Furthermore, our database resource provides tissue-specific expression profiles of 6790 human genes that are targeted by viruses and 129 Gene Expression Omnibus series of differentially expressed genes post-viral infections. Based on these multifaceted and annotated data, our database allows the users to easily obtain reliable information about PPIs of various human viruses and conduct an in-depth analysis of their inherent biological significance. In particular, HVIDB also integrates well-performing machine learning models to predict interactions between the human host and viral proteins that are based on (i) sequence embedding techniques, (ii) interolog mapping and (iii) domain-domain interaction inference. We anticipate that HVIDB will serve as a one-stop knowledge base to further guide hypothesis-driven experimental efforts to investigate human-virus relationships.",
                "authors": [
                    {
                        "name": "Fu C."
                    },
                    {
                        "name": "Lian X."
                    },
                    {
                        "name": "Wuchty S."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "HVIDB: A comprehensive database for human-virus protein-protein interactions"
            },
            "pmid": "33515030"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
