{
    "additionDate": "2018-04-22T10:42:02Z",
    "biotoolsCURIE": "biotools:vidjil",
    "biotoolsID": "vidjil",
    "credit": [
        {
            "email": "contact@vidjil.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open-source platform for the interactive analysis of high-throughput sequencing data from lymphocyte recombinations. It contains an algorithm gathering reads into clonotypes according to their V(D)J junctions, a web application made of a sample, experiment and patient database and a visualization for the analysis of clonotypes along the time.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/vidjil/vidjil"
        }
    ],
    "editPermission": {
        "authors": [
            "Vidjil"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://www.vidjil.org/",
    "language": [
        "JavaScript",
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "Vidjil",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Duez et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background The B and T lymphocytes are white blood cells playing a key role in the adaptive immunity. A part of their DNA, called the V(D)J recombinations, is specific to each lymphocyte, and enables recognition of specific antigenes. Today, with new sequencing techniques, one can get billions of DNA sequences from these regions. With dedicated Repertoire Sequencing (RepSeq) methods, it is now possible to picture population of lymphocytes, and to monitor more accurately the immune response as well as pathologies such as leukemia. Methods and Results Vidjil is an open-source platform for the interactive analysis of high-throughput sequencing data from lymphocyte recombinations. It contains an algorithm gathering reads into clonotypes according to their V(D)J junctions, a web application made of a sample, experiment and patient database and a visualization for the analysis of clonotypes along the time. Vidjil is implemented in C++, Python and Javascript and licensed under the GPLv3 open-source license. Source code, binaries and a public web server are available at http://www.vidjil.org and at http://bioinfo.lille.inria.fr/vidjil. Using the Vidjil web application consists of four steps: 1. uploading a raw sequence file (typically a FASTQ); 2. running RepSeq analysis software; 3. visualizing the results; 4. annotating the results and saving them for future use. For the end-user, the Vidjil web application needs no specific installation and just requires a connection and a modern web browser. Vidjil is used by labs in hematology or immunology for research and clinical applications.",
                "authors": [
                    {
                        "name": "Duez M."
                    },
                    {
                        "name": "Giraud M."
                    },
                    {
                        "name": "Herbert R."
                    },
                    {
                        "name": "Rocher T."
                    },
                    {
                        "name": "Salson M."
                    },
                    {
                        "name": "Thonier F."
                    }
                ],
                "citationCount": 26,
                "date": "2016-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Vidjil: A web platform for analysis of high-Throughput repertoire sequencing"
            },
            "pmcid": "PMC5106020",
            "pmid": "27835690",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1371/journal.pone.0172249",
            "metadata": {
                "abstract": "© 2017 Duez et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The affiliation for the sixth author is incorrect. The correct affiliation is: Inserm UMR1151, Institut Necker-Enfants Malades, Paris Descartes University and Necker-Enfants Malades Hospital-Paris, France. There is also an error in the funding section. The current statement fails to mention that the author Florian Thonier (FT) is supported by Fondation EDF. The correct funding statement should read: This work was supported by SIRIC ONCOLille, Grant INCa-DGOS-Inserm 6041. FT is supported by Fondation EDF. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.",
                "authors": [
                    {
                        "name": "Duez M."
                    },
                    {
                        "name": "Giraud M."
                    },
                    {
                        "name": "Herbert R."
                    },
                    {
                        "name": "Rocher T."
                    },
                    {
                        "name": "Salson M."
                    },
                    {
                        "name": "Thonier F."
                    }
                ],
                "citationCount": 1,
                "date": "2017-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Correction: Vidjil: A web platform for analysis of high-throughput repertoire sequencing (PLoS ONE (2016) 11:11 (e0166126) DOI: 10.1371/journal.pone.0166126)"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}