
{
    "credit": [
        {
            "email": "contact@vidjil.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/vidjil/vidjil"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript",
            "C++",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Immunology",
                "uri": "http://edamontology.org/topic_0804"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "pmcid": "PMC5106020",
            "pmid": "27835690",
            "type": "Other"
        },
        {
            "abstract": "© 2017 Duez et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The affiliation for the sixth author is incorrect. The correct affiliation is: Inserm UMR1151, Institut Necker-Enfants Malades, Paris Descartes University and Necker-Enfants Malades Hospital-Paris, France. There is also an error in the funding section. The current statement fails to mention that the author Florian Thonier (FT) is supported by Fondation EDF. The correct funding statement should read: This work was supported by SIRIC ONCOLille, Grant INCa-DGOS-Inserm 6041. FT is supported by Fondation EDF. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.",
            "authors": [
                "Duez M.",
                "Giraud M.",
                "Herbert R.",
                "Rocher T.",
                "Salson M.",
                "Thonier F."
            ],
            "cit_count": 1,
            "doi": "10.1371/journal.pone.0172249",
            "journal": "PLoS ONE",
            "title": "Correction: Vidjil: A web platform for analysis of high-throughput repertoire sequencing (PLoS ONE (2016) 11:11 (e0166126) DOI: 10.1371/journal.pone.0166126)",
            "type": "Primary",
            "year": "2017-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vidjil",
        "biotoolsID": "vidjil",
        "description": "Open-source platform for the interactive analysis of high-throughput sequencing data from lymphocyte recombinations. It contains an algorithm gathering reads into clonotypes according to their V(D)J junctions, a web application made of a sample, experiment and patient database and a visualization for the analysis of clonotypes along the time.",
        "homepage": "http://www.vidjil.org/",
        "name": "Vidjil"
    }
}