{
    "additionDate": "2017-12-18T00:11:03Z",
    "biotoolsCURIE": "biotools:plantrgs",
    "biotoolsID": "plantrgs",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.nipgr.res.in/research/dr_mjain.php"
        }
    ],
    "description": "PlantRGS is a web server for identification of most suitable candidate reference gene(s) for quantitative gene expression studies in plants. PlantRGS identifies the most suitable reference genes with minimum expression variance across the selected experimental conditions based on microarray data.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://14.139.61.3:8080/PlantRGS/tutorial.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.nipgr.res.in/PlantRGS/",
    "homepage_status": 1,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/plantrgs-1-0-plant-reference-gene-server.html"
        }
    ],
    "name": "PlantRGS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/dnares/dsr032",
            "metadata": {
                "abstract": "Normalization of quantitative gene expression data with a suitable reference gene is essential for accurate and reliable results. However, the availability and choice of most suitable reference gene(s) showing uniform expression across all the experimental conditions remain a drawback. We have developed a web server, PlantRGS (http://www.nipgr.res.in/PlantRGS), for the identification of most suitable candidate reference gene(s) at the whole-genome level using microarray data for quantitative gene expression studies in plants. Microarray data from more than 11 000 tissue samples for nine plant species have been included in the PlantRGS for meta-analysis. The web server provides a user-friendly graphical user interface-based analysis tool for the identification of most suitable reference genes in the selected plant species under user-defined experimental conditions. Various parameter options and output formats will help users to investigate desired number of most suitable reference genes with wide range of expression levels. Validation of results revealed that novel reference genes identified by the PlantRGS outperforms the traditionally used reference genes in terms of expression stability. We anticipate that the PlantRGS will provide a platform for the identification of most suitable reference gene(s) under given experimental conditions and facilitate quantitative gene expression studies in plants. © 2011 The Author.",
                "authors": [
                    {
                        "name": "Patel R.K."
                    },
                    {
                        "name": "Jain M."
                    }
                ],
                "citationCount": 5,
                "date": "2011-12-01T00:00:00Z",
                "journal": "DNA Research",
                "title": "PlantRGS: A web server for the identification of most suitable candidate reference genes for quantitative gene expression studies in plants"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Plant",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Plants",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}