{
    "additionDate": "2020-01-09T18:11:57Z",
    "biotoolsCURIE": "biotools:CEthreader",
    "biotoolsID": "CEthreader",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhng@umich.edu",
            "name": "Yang Zhang",
            "orcidid": "https://orcid.org/0000-0002-2739-1916",
            "typeEntity": "Person"
        }
    ],
    "description": "Detecting distant-homology protein structures by aligning deep neural-network based contact maps.\n\nfold recorgnition by eigen-decomposition of contact map.\n\nCEthreader (Contact Eigenvector-based threader) is a new threading algorithm that combines contact-map with profile-based alignments for protein fold recognition.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Sequence profile alignment",
                    "uri": "http://edamontology.org/operation_0300"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/CEthreader",
    "lastUpdate": "2020-12-10T15:42:39Z",
    "name": "CEthreader",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007411",
            "metadata": {
                "abstract": "© 2019 Zheng et al.Accurate prediction of atomic-level protein structure is important for annotating the biological functions of protein molecules and for designing new compounds to regulate the functions. Template-based modeling (TBM), which aims to construct structural models by copying and refining the structural frameworks of other known proteins, remains the most accurate method for protein structure prediction. Due to the difficulty in recognizing distant-homology templates, however, the accuracy of TBM decreases rapidly when the evolutionary relationship between the query and template vanishes. In this study, we propose a new method, CEthreader, which first predicts residue-residue contacts by coupling evolutionary precision matrices with deep residual convolutional neural-networks. The predicted contact maps are then integrated with sequence profile alignments to recognize structural templates from the PDB. The method was tested on two independent benchmark sets consisting collectively of 1,153 nonhomologous protein targets, where CEthreader detected 176% or 36% more correct templates with a TM-score >0.5 than the best state-of-the-art profile- or contact-based threading methods, respectively, for the Hard targets that lacked homologous templates. Moreover, CEthreader was able to identify 114% or 20% more correct templates with the same Fold as the query, after excluding structures from the same SCOPe Superfamily, than the best profileor contact-based threading methods. Detailed analyses show that the major advantage of CEthreader lies in the efficient coupling of contact maps with profile alignments, which helps recognize global fold of protein structures when the homologous relationship between the query and template is weak. These results demonstrate an efficient new strategy to combine ab initio contact map prediction with profile alignments to significantly improve the accuracy of template-based structure prediction, especially for distant-homology proteins.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Mortuza S.M."
                    },
                    {
                        "name": "Pearce R."
                    },
                    {
                        "name": "Ruan J."
                    },
                    {
                        "name": "Wuyun Q."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zheng W."
                    }
                ],
                "citationCount": 13,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Detecting distant-homology protein structures by aligning deep neural-network based contact maps"
            },
            "pmcid": "PMC6818797",
            "pmid": "31622328"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
