{
    "accessibility": "Open access",
    "additionDate": "2020-02-21T13:12:50Z",
    "biotoolsCURIE": "biotools:TRIP_-_T-cell_Receptor_Immunoglobulin_Profiler",
    "biotoolsID": "TRIP_-_T-cell_Receptor_Immunoglobulin_Profiler",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fpsom@certh.gr",
            "name": "Fotis E. Psomopoulos",
            "orcidid": "https://orcid.org/0000-0002-0222-4273",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://biodataanalysisgroup.github.io/"
        }
    ],
    "description": "Antigen receptors are characterized by an extreme diversity of specificities, which poses major computational and analytical challenges, particularly in the era of high-throughput immunoprofiling by next generation sequencing (NGS). The antigen receptor gene profiler tool (TRIP) offers the opportunity for an in-depth analysis based on the processing of the output files of the IMGT/HighV-Quest tool, a standard in NGS immunoprofiling, through a number of interoperable modules. These  provide  detailed  information about antigen receptor gene rearrangements, including variable (V), diversity (D) and joining (J) gene usage, CDR3 amino acid and nucleotide composition and clonality of both T cell receptors (TR) and B cell receptor immunoglobulins (BcR IG), and characteristics of the somatic hypermutation within the BcR IG genes. TRIP is a web application implemented in R shiny.",
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Greece"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BiodataAnalysisGroup/TRIP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-17T08:40:21Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "TRIP - T-cell Receptor Immunoglobulin Profiler",
    "owner": "fpsom",
    "publication": [
        {
            "doi": "10.1186/s12859-020-03669-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Antigen receptors are characterized by an extreme diversity of specificities, which poses major computational and analytical challenges, particularly in the era of high-throughput immunoprofiling by next generation sequencing (NGS). The T cell Receptor/Immunoglobulin Profiler (TRIP) tool offers the opportunity for an in-depth analysis based on the processing of the output files of the IMGT/HighV-Quest tool, a standard in NGS immunoprofiling, through a number of interoperable modules. These provide detailed information about antigen receptor gene rearrangements, including variable (V), diversity (D) and joining (J) gene usage, CDR3 amino acid and nucleotide composition and clonality of both T cell receptors (TR) and B cell receptor immunoglobulins (BcR IG), and characteristics of the somatic hypermutation within the BcR IG genes. TRIP is a web application implemented in R shiny. Results: Two sets of experiments have been performed in order to evaluate the efficiency and performance of the TRIP tool. The first used a number of synthetic datasets, ranging from 250k to 1M sequences, and established the linear response time of the tool (about 6 h for 1M sequences processed through the entire BcR IG data pipeline). The reproducibility of the tool was tested comparing the results produced by the main TRIP workflow with the results from a previous pipeline used on the Galaxy platform. As expected, no significant differences were noted between the two tools; although the preselection process seems to be stricter within the TRIP pipeline, about 0.1% more rearrangements were filtered out, with no impact on the final results. Conclusions: TRIP is a software framework that provides analytical services on antigen receptor gene sequence data. It is accurate and contains functions for data wrangling, cleaning, analysis and visualization, enabling the user to build a pipeline tailored to their needs. TRIP is publicly available at https://bio.tools/TRIP_-_T-cell_Receptor_Immunoglobulin_Profiler.",
                "authors": [
                    {
                        "name": "Agathangelidis A."
                    },
                    {
                        "name": "Chatzidimitriou A."
                    },
                    {
                        "name": "Galigalidou C."
                    },
                    {
                        "name": "Gemenetzi K."
                    },
                    {
                        "name": "Kotouza M.T."
                    },
                    {
                        "name": "Mitkas P.A."
                    },
                    {
                        "name": "Pechlivanis N."
                    },
                    {
                        "name": "Psomopoulos F.E."
                    },
                    {
                        "name": "Sandaltzopoulos R."
                    },
                    {
                        "name": "Stamatopoulos K."
                    },
                    {
                        "name": "Vlachonikola E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TRIP - T cell receptor/immunoglobulin profiler"
            },
            "pmcid": "PMC7525938",
            "pmid": "32993478",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        }
    ],
    "version": [
        "1.0"
    ]
}
