
{
    "credit": [
        {
            "email": "sarisbro@uottawa.ca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.uottawa.ca/stephane/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/sarisbro/MCMCcodonsite/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage analysis",
                    "uri": "http://edamontology.org/operation_0286"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mcmccodonsite-identify-sites-positive-selection.html"
        }
    ],
    "publication": [
        {
            "abstract": "Codon-based substitution models are routinely used to measure selective pressures acting on protein-coding genes. To this effect, the nonsynonymous to synonymous rate ratio (dN/dS = ω) is estimated. The proportion of amino-acid sites potentially under positive selection, as indicated by ω > 1, is inferred by fitting a probability distribution where some sites are permitted to have ω > 1. These sites are then inferred by means of an empirical Bayes or by a Bayes empirical Bayes approach that, respectively, ignores or accounts for sampling errors in maximum-likelihood estimates of the distribution used to infer the proportion of sites with ω > 1. Here, we extend a previous full-Bayes approach to include models with high power and low false-positive rates when inferring sites under positive selection. We propose some heuristics to alleviate the computational burden, and show that (i) full Bayes can be superior to empirical Bayes when analyzing a small data set or small simulated data, (ii) full Bayes has only a small advantage over Bayes empirical Bayes with our small test data, and (iii) Bayesian methods appear relatively insensitive to mild misspecifications of the random process generating adaptive evolution in our simulations, but in practice can prove extremely sensitive to model specification. We suggest that the codon model used to detect amino acids under selection should be carefully selected, for instance using Akaike information criterion (AIC). © 2006 NRC.",
            "authors": [
                "Aris-Brosou S."
            ],
            "cit_count": 4,
            "journal": "Genome",
            "pmid": "16936785",
            "title": "Identifying sites under positive selection with uncertain parameter estimates",
            "year": "2006-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mcmccodonsite",
        "biotoolsID": "mcmccodonsite",
        "description": "Program implementing some codon models allowing \\omega = d_N/d_S to vary among sites (M0, M2a, M3, M7, M8) in a Bayesian framework.",
        "homepage": "http://www.bioinformatics.uottawa.ca/stephane/downloads.html",
        "name": "MCMCcodonsite"
    }
}