{
    "additionDate": "2021-01-18T10:13:18Z",
    "biotoolsCURIE": "biotools:clin-ik-links",
    "biotoolsID": "clin-ik-links",
    "confidence_flag": "tool",
    "description": "CLIN-IK-LINKS is a web-based platform that enables users to create, modify and delete mappings as well as to define and execute workflows. The CLIN-IK-LINKS platform allows the composition and execution of clinical data transformation workflows to convert EHR data into EHR and/or semantic web standards.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://keg.act.uji.es/demoCLINIKLINKS/home.html",
    "lastUpdate": "2021-03-11T14:58:59Z",
    "name": "CLIN-IK-LINKS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2020.105616",
            "metadata": {
                "abstract": "© 2020Background and Objective: Effective sharing and reuse of Electronic Health Records (EHR) requires technological solutions which deal with different representations and different models of data. This includes information models, domain models and, ideally, inference models, which enable clinical decision support based on a knowledge base and facts. Our goal is to develop a framework to support EHR interoperability based on transformation and reasoning services intended for clinical data and knowledge. Methods: Our framework is based on workflows whose primary components are reusable mappings. Key features are an integrated representation, storage, and exploitation of different types of mappings for clinical data transformation purposes, as well as the support for the discovery of new workflows. The current framework supports mappings which take advantage of the best features of EHR standards and ontologies. Our proposal is based on our previous results and experience working with both technological infrastructures. Results: We have implemented CLIN-IK-LINKS, a web-based platform that enables users to create, modify and delete mappings as well as to define and execute workflows. The platform has been applied in two use cases: semantic publishing of clinical laboratory test results; and implementation of two colorectal cancer screening protocols. Real data have been used in both use cases. Conclusions: The CLIN-IK-LINKS platform allows the composition and execution of clinical data transformation workflows to convert EHR data into EHR and/or semantic web standards. Having proved its usefulness to implement clinical data transformation applications of interest, CLIN-IK-LINKS can be regarded as a valuable contribution to improve the semantic interoperability of EHR systems.",
                "authors": [
                    {
                        "name": "Maldonado J.A."
                    },
                    {
                        "name": "Marcos M."
                    },
                    {
                        "name": "Fernandez-Breis J.T."
                    },
                    {
                        "name": "Gimenez-Solano V.M."
                    },
                    {
                        "name": "Legaz-Garcia M.D.C."
                    },
                    {
                        "name": "Martinez-Salvador B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "CLIN-IK-LINKS: A platform for the design and execution of clinical data transformation and reasoning workflows"
            },
            "pmid": "32629294"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}