{
    "additionDate": "2017-01-17T14:59:02Z",
    "biotoolsCURIE": "biotools:oncosimulr",
    "biotoolsID": "oncosimulr",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "rdiaz02@gmail.com",
            "name": "Ramon Diaz-Uriarte",
            "orcidid": "http://orcid.org/0000-0002-6637-9039",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Functions for forward population genetic simulation in asexual populations, with special focus on cancer progression. Also included are functions for simulating random DAGs of the type found in Oncogenetic Trees, Conjunctive Bayesian Networks, and other tumor progression models, and for plotting and sampling from single or multiple realizations of the simulations, including single-cell sampling, as well as functions for plotting the true phylogenetic relationships of the clones.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/OncoSimulR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/OncoSimulR_2.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Physiology parameter",
                        "uri": "http://edamontology.org/data_3722"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Score",
                        "uri": "http://edamontology.org/data_1772"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/OncoSimulR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T00:36:08Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/rdiaz02/OncoSimul"
        },
        {
            "type": [
                "Mirror"
            ],
            "url": "https://popmodels.cancercontrol.cancer.gov/gsr/packages/oncosimulr/"
        }
    ],
    "name": "OncoSimulR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0466-7",
            "metadata": {
                "abstract": "© Diaz-Uriarte; licensee BioMed Central. 2015.Background: Cancer progression is caused by the sequential accumulation of mutations, but not all orders of accumulation are equally likely. When the fixation of some mutations depends on the presence of previous ones, identifying restrictions in the order of accumulation of mutations can lead to the discovery of therapeutic targets and diagnostic markers. The purpose of this study is to conduct a comprehensive comparison of the performance of all available methods to identify these restrictions from cross-sectional data. I used simulated data sets (where the true restrictions are known) but, in contrast to previous work, I embedded restrictions within evolutionary models of tumor progression that included passengers (mutations not responsible for the development of cancer, known to be very common). This allowed me to assess, for the first time, the effects of having to filter out passengers, of sampling schemes (when, how, and how many samples), and of deviations from order restrictions. Results: Poor choices of method, filtering, and sampling lead to large errors in all performance measures. Having to filter passengers lead to decreased performance, especially because true restrictions were missed. Overall, the best method for identifying order restrictions were Oncogenetic Trees, a fast and easy to use method that, although unable to recover dependencies of mutations on more than one mutation, showed good performance in most scenarios, superior to Conjunctive Bayesian Networks and Progression Networks. Single cell sampling provided no advantage, but sampling in the final stages of the disease vs. sampling at different stages had severe effects. Evolutionary model and deviations from order restrictions had major, and sometimes counterintuitive, interactions with other factors that affected performance. Conclusions: This paper provides practical recommendations for using these methods with experimental data. It also identifies key areas of future methodological work and, in particular, it shows that it is both possible and necessary to embed assumptions about order restrictions and the nature of driver status within evolutionary models of cancer progression to evaluate the performance of inferential approaches.",
                "authors": [
                    {
                        "name": "Diaz-Uriarte R."
                    }
                ],
                "citationCount": 11,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Identifying restrictions in the order of accumulation of mutations during tumor progression: Effects of passengers, evolutionary models, and sampling"
            },
            "pmcid": "PMC4339747",
            "pmid": "25879190",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1,
    "version": [
        "2.4.0"
    ]
}