
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://apps.cytoscape.org/help/contact"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://apps.cytoscape.org/apps/kddn"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Data integration and warehousing",
                "uri": "http://edamontology.org/topic_3366"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/kddn-1-1-0-knowledge-fused-differential-dependency-network.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. We have developed an integrated molecular network learning method, within a well-grounded mathematical framework, to construct differential dependency networks with significant rewiring. This knowledge-fused differential dependency networks (KDDN) method, implemented as a Java Cytoscape app, can be used to optimally integrate prior biological knowledge with measured data to simultaneously construct both common and differential networks, to quantitatively assign model parameters and significant rewiring p-values and to provide user-friendly graphical results. The KDDN algorithm is computationally efficient and provides users with parallel computing capability using ubiquitous multi-core machines. We demonstrate the performance of KDDN on various simulations and real gene expression datasets, and further compare the results with those obtained by the most relevant peer methods. The acquired biologically plausible results provide new insights into network rewiring as a mechanistic principle and illustrate KDDN's ability to detect them efficiently and correctly. Although the principal application here involves microarray gene expressions, our methodology can be readily applied to other types of quantitative molecular profiling data.",
            "authors": [
                "Tian Y.",
                "Zhang B.",
                "Hoffman E.P.",
                "Clarke R.",
                "Zhang Z.",
                "Shih I.-M.",
                "Xuan J.",
                "Herrington D.M.",
                "Wang Y."
            ],
            "cit_count": 9,
            "journal": "Bioinformatics",
            "pmid": "25273109",
            "title": "KDDN: An open-source Cytoscape app for constructing differential dependency networks with significant rewiring",
            "year": "2015-01-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kddn",
        "biotoolsID": "kddn",
        "description": "Cytoscape app to learn biological network topology and its changes using profiling data and domain knowledge. It takes input data and runs KDDN algorithm to construct the dependency network.",
        "homepage": "http://apps.cytoscape.org/apps/kddn",
        "name": "KDDN"
    }
}