{
    "additionDate": "2018-05-19T15:31:05Z",
    "biotoolsCURIE": "biotools:dockscore",
    "biotoolsID": "dockscore",
    "credit": [
        {
            "email": "mini@ncbs.res.in",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A webserver for ranking protein-protein docked poses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://caps.ncbs.res.in/dockscore/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://caps.ncbs.res.in/dockscore/",
    "language": [
        "JavaScript",
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "DOCKSCORE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0572-6",
            "metadata": {
                "abstract": "© Malhotra et al.; licensee BioMed Central.Background: Proteins interact with a variety of other molecules such as nucleic acids, small molecules and other proteins inside the cell. Structure-determination of protein-protein complexes is challenging due to several reasons such as the large molecular weights of these macromolecular complexes, their dynamic nature, difficulty in purification and sample preparation. Computational docking permits an early understanding of the feasibility and mode of protein-protein interactions. However, docking algorithms propose a number of solutions and it is a challenging task to select the native or near native pose(s) from this pool. DockScore is an objective scoring scheme that can be used to rank protein-protein docked poses. It considers several interface parameters, namely, surface area, evolutionary conservation, hydrophobicity, short contacts and spatial clustering at the interface for scoring. Results: We have implemented DockScore in form of a webserver for its use by the scientific community. DockScore webserver can be employed, subsequent to docking, to perform scoring of the docked solutions, starting from multiple poses as inputs. The results, on scores and ranks for all the poses, can be downloaded as a csv file and graphical view of the interface of best ranking poses is possible. Conclusions: The webserver for DockScore is made freely available for the scientific community at: http://caps.ncbs.res.in/dockscore/.",
                "authors": [
                    {
                        "name": "Malhotra S."
                    },
                    {
                        "name": "Mathew O.K."
                    },
                    {
                        "name": "Sowdhamini R."
                    }
                ],
                "citationCount": 15,
                "date": "2015-04-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DOCKSCORE: A webserver for ranking protein-protein docked poses"
            },
            "pmcid": "PMC4414291",
            "pmid": "25902779"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}