{"credit":[{"email":"haley@genepi.med.utah.edu","name":"Abel HJ","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www-genepi.med.utah.edu/suppl/SLOPE/slope_guide.txt"}],"function":[{"operation":[{"term":"Structural variation detection","uri":"http://edamontology.org/operation_3228"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA structural variation","uri":"http://edamontology.org/topic_3175"},{"term":"Exome sequencing","uri":"http://edamontology.org/topic_3676"}]},"publication":[{"abstract":"Motivation: Targeted 'deep' sequencing of specific genes or regions is of great interest in clinical cancer diagnostics where some sequence variants, particularly translocations and indels, have known prognostic or diagnostic significance. In this setting, it is unnecessary to sequence an entire genome, and target capture methods can be applied to limit sequencing to important regions, thereby reducing costs and the time required to complete testing. Existing 'next-gen' sequencing analysis packages are optimized for efficiency in whole-genome studies and are unable to benefit from the particular structure of targeted sequence data.Results: We developed SLOPE to detect structural variants from targeted short-DNA reads. We use both real and simulated data to demonstrate SLOPE's ability to rapidly detect insertion/deletion events of various sizes as well as translocations and viral integration sites with high sensitivity and low false discovery rate. © The Author 2010. Published by Oxford University Press. All rights reserved.","authors":["Abel H.J.","Duncavage E.J.","Becker N.","Armstrong J.R.","Magrini V.J.","Pfeifer J.D."],"cit_count":39,"journal":"Bioinformatics","pmid":"20876606","title":"SLOPE: A quick and accurate method for locating non-SNP structural variation from targeted next-generation sequence data","year":"2010-11-01"}],"summary":{"biotoolsCURIE":"biotools:slope","biotoolsID":"slope","description":"Detects structural variants from targeted short DNA reads","homepage":"http://www-genepi.med.utah.edu/suppl/SLOPE/index.html","name":"SLOPE"}}