{
    "additionDate": "2018-07-04T14:57:47Z",
    "biotoolsCURIE": "biotools:coach-d",
    "biotoolsID": "coach-d",
    "credit": [
        {
            "email": "yangjy@nankai.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Protein-ligand binding site prediction. First, five individual methods are used to predict the ligand-binding pockets and residues. Then the ligands (from the templates or the user) are the docked into the binding pockets. he ligand-binding poses are refined to make them physically more realistic, using the efficient molecular docking algorithm AutoDock Vina.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://yanglab.nankai.edu.cn/COACH-D/help/"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://yanglab.nankai.edu.cn/COACH-D/example/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://yanglab.nankai.edu.cn/COACH-D/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "COACH-D",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky439",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.The identification of protein-ligand binding sites is critical to protein function annotation and drug discovery. The consensus algorithm COACH developed by us represents one of the most efficient approaches to protein-ligand binding sites prediction. One of the most commonly seen issues with the COACH prediction are the low quality of the predicted ligand-binding poses, which usually have severe steric clashes to the protein structure. Here, we present COACH-D, an enhanced version of COACH by utilizing molecular docking to refine the ligand-binding poses. The input to the COACH-D server is the amino acid sequence or the three-dimensional structure of a query protein. In addition, the users can also submit their own ligand of interest. For each job submission, the COACH algorithm is first used to predict the protein-ligand binding sites. The ligands from the users or the templates are then docked into the predicted binding pockets to build their complex structures. Blind tests show that the algorithm significantly outperforms other ligand-binding sites prediction methods. Benchmark tests show that the steric clashes between the ligand and the protein structures in the COACH models are reduced by 85% after molecular docking in COACH-D. The COACH-D server is freely available to all users at http://yanglab.nankai.edu.cn/COACH-D/.",
                "authors": [
                    {
                        "name": "Peng Z."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 52,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "COACH-D: Improved protein-ligand binding sites prediction with refined ligand-binding poses through molecular docking"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
