{
    "additionDate": "2018-05-03T16:24:37Z",
    "biotoolsCURIE": "biotools:cdsbank",
    "biotoolsID": "cdsbank",
    "credit": [
        {
            "email": "bart.hazes@ualberta.ca",
            "name": "Bart Hazes",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Taxonomy-aware extraction, selection, renaming and formatting of protein-coding DNA or amino acid sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hazeslab.med.ualberta.ca/CDSbank/CDSbankHelp.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence editing",
                    "uri": "http://edamontology.org/operation_0231"
                }
            ]
        }
    ],
    "homepage": "http://hazeslab.med.ualberta.ca/CDSbank/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "CDSbank",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-61",
            "metadata": {
                "abstract": "Background: Protein-coding DNA sequences and their corresponding amino acid sequences are routinely used to study relationships between sequence, structure, function, and evolution. The rapidly growing size of sequence databases increases the power of such comparative analyses but it makes it more challenging to prepare high quality sequence data sets with control over redundancy, quality, completeness, formatting, and labeling. Software tools for some individual steps in this process exist but manual intervention remains a common and time consuming necessity.Description: CDSbank is a database that stores both the protein-coding DNA sequence (CDS) and amino acid sequence for each protein annotated in Genbank. CDSbank also stores Genbank feature annotation, a flag to indicate incomplete 5′ and 3′ ends, full taxonomic data, and a heuristic to rank the scientific interest of each species. This rich information allows fully automated data set preparation with a level of sophistication that aims to meet or exceed manual processing. Defaults ensure ease of use for typical scenarios while allowing great flexibility when needed. Access is via a free web server at http://hazeslab.med.ualberta.ca/CDSbank/.Conclusions: CDSbank presents a user-friendly web server to download, filter, format, and name large sequence data sets. Common usage scenarios can be accessed via pre-programmed default choices, while optional sections give full control over the processing pipeline. Particular strengths are: extract protein-coding DNA sequences just as easily as amino acid sequences, full access to taxonomy for labeling and filtering, awareness of incomplete sequences, and the ability to take one protein sequence and extract all synonymous CDS or identical protein sequences in other species. Finally, CDSbank can also create labeled property files to, for instance, annotate or re-label phylogenetic trees. © 2014 Hazes; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hazes B."
                    }
                ],
                "citationCount": 2,
                "date": "2014-02-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CDSbank: Taxonomy-aware extraction, selection, renaming and formatting of protein-coding DNA or amino acid sequences"
            },
            "pmcid": "PMC3942066",
            "pmid": "24580755"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
