{
    "additionDate": "2019-11-14T18:03:54Z",
    "biotoolsCURIE": "biotools:DQueST",
    "biotoolsID": "DQueST",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chunhua@columbia.edu",
            "name": "Chunhua Weng",
            "typeEntity": "Person"
        }
    ],
    "description": "DQueST is a web applciation for reducing information overload for trial seekers using dynamic questionnaires.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stormliucong/dquest-flask",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-01-09T14:34:46Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/stormliucong/dquest-flask/issues"
        }
    ],
    "name": "DQueST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/JAMIA/OCZ121",
            "metadata": {
                "abstract": "© 2019 The Author(s).Objective: Information overload remains a challenge for patients seeking clinical trials. We present a novel system (DQueST) that reduces information overload for trial seekers using dynamic questionnaires. Materials and Methods: DQueST first performs information extraction and criteria library curation. DQueST transforms criteria narratives in the ClinicalTrials.gov repository into a structured format, normalizes clinical entities using standard concepts, clusters related criteria, and stores the resulting curated library. DQueST then implements a real-time dynamic question generation algorithm. During user interaction, the initial search is similar to a standard search engine, and then DQueST performs real-time dynamic question generation to select criteria from the library 1 at a time by maximizing its relevance score that reflects its ability to rule out ineligible trials. DQueST dynamically updates the remaining trial set by removing ineligible trials based on user responses to corresponding questions. The process iterates until users decide to stop and begin manually reviewing the remaining trials. Results: In simulation experiments initiated by 10 diseases, DQueST reduced information overload by filtering out 60%-80% of initial trials after 50 questions. Reviewing the generated questions against previous answers, on average, 79.7% of the questions were relevant to the queried conditions. By examining the eligibility of random samples of trials ruled out by DQueST, we estimate the accuracy of the filtering procedure is 63.7%. In a study using 5 mock patient profiles, DQueST on average retrieved trials with a 1.465 times higher density of eligible trials than an existing search engine. In a patient-centered usability evaluation, patients found DQueST useful, easy to use, and returning relevant results. Conclusion: DQueST contributes a novel framework for transforming free-text eligibility criteria to questions and filtering out clinical trials based on user answers to questions dynamically. It promises to augment keyword-based methods to improve clinical trial search.",
                "authors": [
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Yuan C."
                    },
                    {
                        "name": "Butler A.M."
                    },
                    {
                        "name": "Carvajal R.D."
                    },
                    {
                        "name": "Li Z.R."
                    },
                    {
                        "name": "Ta C.N."
                    },
                    {
                        "name": "Weng C."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-22T00:00:00Z",
                "journal": "Journal of the American Medical Informatics Association",
                "title": "DQueST: Dynamic questionnaire for search of clinical trials"
            },
            "pmcid": "PMC6798577",
            "pmid": "31390010"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}