{
    "additionDate": "2020-01-09T18:30:39Z",
    "biotoolsCURIE": "biotools:Cool_Farm_Tool_Water",
    "biotoolsID": "Cool_Farm_Tool_Water",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "benjamin.kayatz@gfz-potsdam.de",
            "name": "Benjamin Kayatz",
            "typeEntity": "Person"
        }
    ],
    "description": "A global on-line tool to assess water use in crop production.\n\nAn online greenhouse gas, water, and biodiversity calculator.\n\nCOOL FARM TOOL AN ONLINE GREENHOUSE GAS, WATER, AND BIODIVERSITY CALCULATOR FOR FARMERS FREE FOR FARMERS THE COOL FARM ALLIANCE AN INDUSTRY PLATFORM FOR SUSTAINABLE AGRICULTURE METRIC DEVELOPMENT AND USE LEARN MORE News & Resources STAY UP TO DATE WITH OUR CASE STUDIES, RESOURCES, NEWS & BLOGS READ MORE.\n\nThe Cool Farm Alliance is Hiring.\n\nThe Cool Farm Alliance is looking to contract for two new roles. Due to the growth of the Alliance, we are looking for two new project management roles, one to support the Development & Operations Committee and one to lead the support to..",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://coolfarmtool.org",
    "lastUpdate": "2020-01-09T18:30:39Z",
    "name": "Cool Farm Tool Water",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JCLEPRO.2018.09.160",
            "metadata": {
                "abstract": "© 2018 The AuthorsThe agricultural sector accounts for 70% of all water consumption and poses great pressure on ground water resources. Therefore, evaluating agricultural water consumption is highly important as it allows supply chain actors to identify practices which are associated with unsustainable water use, which risk depleting current water resources and impacting future production. However, these assessments are often not feasible for crop producers as data, models and experiments are required in order to conduct them. This work introduces a new on-line agricultural water use assessment tool that provides the water footprint and irrigation requirements at field scale based on an enhanced FAO56 approach combined with a global climate, crop and soil databases. This has been included in the Cool Farm Tool – an online tool which already provides metrics for greenhouse gas emissions and biodiversity impacts and therefore allows for a more holistic assessment of environmental sustainability in farming and agricultural supply chains. The model is tested against field scale and state level water footprint data providing good results. The tool provides a practical, reliable way to assess agricultural water use, and offers a means to engage growers and stakeholders in identifying efficient water management practices.",
                "authors": [
                    {
                        "name": "Kayatz B."
                    },
                    {
                        "name": "Baroni G."
                    },
                    {
                        "name": "Hillier J."
                    },
                    {
                        "name": "Ludtke S."
                    },
                    {
                        "name": "Heathcote R."
                    },
                    {
                        "name": "Malin D."
                    },
                    {
                        "name": "van Tonder C."
                    },
                    {
                        "name": "Kuster B."
                    },
                    {
                        "name": "Freese D."
                    },
                    {
                        "name": "Huttl R."
                    },
                    {
                        "name": "Wattenbach M."
                    }
                ],
                "citationCount": 7,
                "date": "2019-01-10T00:00:00Z",
                "journal": "Journal of Cleaner Production",
                "title": "Cool Farm Tool Water: A global on-line tool to assess water use in crop production"
            },
            "pmcid": "PMC6771653",
            "pmid": "31598037"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}