{
    "additionDate": "2022-02-17T15:53:29.019868Z",
    "biotoolsCURIE": "biotools:octopus_hap",
    "biotoolsID": "octopus_hap",
    "description": "Octopus is a mapping-based variant caller that implements several calling models within a unified haplotype-aware framework. Octopus takes inspiration from particle filtering by constructing a tree of haplotypes and dynamically pruning and extending the tree based on haplotype posterior probabilities in a sequential manner. This allows octopus to implicitly consider all possible haplotypes at a given loci in reasonable time.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://luntergroup.github.io/octopus/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/luntergroup/octopus",
    "lastUpdate": "2024-11-24T20:11:37.768336Z",
    "license": "MIT",
    "name": "octopus",
    "owner": "Guerau",
    "publication": [
        {
            "doi": "10.1038/s41587-021-00861-3",
            "metadata": {
                "abstract": "Almost all haplotype-based variant callers were designed specifically for detecting common germline variation in diploid populations, and give suboptimal results in other scenarios. Here we present Octopus, a variant caller that uses a polymorphic Bayesian genotyping model capable of modeling sequencing data from a range of experimental designs within a unified haplotype-aware framework. Octopus combines sequencing reads and prior information to phase-called genotypes of arbitrary ploidy, including those with somatic mutations. We show that Octopus accurately calls germline variants in individuals, including single nucleotide variants, indels and small complex replacements such as microinversions. Using a synthetic tumor data set derived from clean sequencing data from a sample with known germline haplotypes and observed mutations in a large cohort of tumor samples, we show that Octopus is more sensitive to low-frequency somatic variation, yet calls considerably fewer false positives than other methods. Octopus also outputs realigned evidence BAM files to aid validation and interpretation.",
                "authors": [
                    {
                        "name": "Cooke D.P."
                    },
                    {
                        "name": "Lunter G."
                    },
                    {
                        "name": "Wedge D.C."
                    }
                ],
                "citationCount": 43,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "A unified haplotype-based method for accurate and comprehensive variant calling"
            },
            "pmcid": "PMC7611855",
            "pmid": "33782612"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        }
    ]
}
