{
    "accessibility": "Open access",
    "additionDate": "2022-07-06T15:11:30.206632Z",
    "biotoolsCURIE": "biotools:m6_aexpress-reader",
    "biotoolsID": "m6_aexpress-reader",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Qian-qian Ma"
        },
        {
            "name": "Shao-Wu Zhang"
        },
        {
            "name": "Song-Yao Zhang"
        },
        {
            "name": "Teng Zhang"
        }
    ],
    "description": "Prediction of m6A regulated expression genes by integrating m6A sites and reader binding information in specific- context",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NWPU-903PR/m6AexpressReader",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-06T15:11:30.209692Z",
    "license": "Not licensed",
    "name": "m6 Aexpress-Reader",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2022.03.008",
            "metadata": {
                "abstract": "© 2022 Elsevier Inc.N6-methyladenosine (m6A) is the most abundant form of mRNA modification and plays an important role in regulating gene expression. However, the mechanisms of m6A regulated gene expression in cell or condition specific, are still poorly understood. Even though, some methods are able to predict m6A regulated expression (m6A-reg-exp) genes in specific context, they don't introduce the m6A reader binding information, while this information can help to predict m6A-reg-exp genes and more clearly to explain the mechanisms of m6A-mediated gene expression process. Thus, by integrating m6A sites and reader binding information, we proposed a novel method (called m6Aexpress-Reader) to predict m6A-reg-exp genes from limited MeRIP-seq data in specific context. m6Aexpress-Reader adopts the reader binding signal strength to weight the posterior distribution of the estimated regulatory coefficients for enhancing the prediction power. By using m6Aexpress-Reader, we found the complex characteristic of m6A on gene expression regulation and the distinct regulated pattern of m6A-reg-exp genes with different reader binding. m6A readers, YTHDF2 or IGF2BP1/3 all play an important role in various cancers and the key cancer pathways. In addition, m6Aexpress-Reader reveals the distinct m6A regulated mode of reader targeted genes in cancer. m6Aexpress-Reader could be a useful tool for studying the m6A regulation on reader target genes in specific context and it can be freely accessible at: https://github.com/NWPU-903PR/m6AexpressReader.",
                "authors": [
                    {
                        "name": "Ma Q.-Q."
                    },
                    {
                        "name": "Zhang S.-W."
                    },
                    {
                        "name": "Zhang S.-Y."
                    },
                    {
                        "name": "Zhang T."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Methods",
                "title": "m6Aexpress-Reader: Prediction of m6A regulated expression genes by integrating m6A sites and reader binding information in specific- context"
            },
            "pmid": "35314342"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
