
{
    "credit": [
        {
            "email": "cabanskc@gmail.com",
            "name": "Christopher Cabanski",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/ReQON.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ReQON_1.20.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Next-generation sequencing technologies have become important tools for genome-wide studies. However, the quality scores that are assigned to each base have been shown to be inaccurate. If the quality scores are used in downstream analyses, these inaccuracies can have a significant impact on the results.Results: Here we present ReQON, a tool that recalibrates the base quality scores from an input BAM file of aligned sequencing data using logistic regression. ReQON also generates diagnostic plots showing the effectiveness of the recalibration. We show that ReQON produces quality scores that are both more accurate, in the sense that they more closely correspond to the probability of a sequencing error, and do a better job of discriminating between sequencing errors and non-errors than the original quality scores. We also compare ReQON to other available recalibration tools and show that ReQON is less biased and performs favorably in terms of quality score accuracy.Conclusion: ReQON is an open source software package, written in R and available through Bioconductor, for recalibrating base quality scores for next-generation sequencing data. ReQON produces a new BAM file with more accurate quality scores, which can improve the results of downstream analysis, and produces several diagnostic plots showing the effectiveness of the recalibration. © 2012 Cabanski et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Cabanski C.R.",
                "Cavin K.",
                "Bizon C.",
                "Wilkerson M.D.",
                "Parker J.S.",
                "Wilhelmsen K.C.",
                "Perou C.M.",
                "Marron J.S.",
                "Hayes D.N."
            ],
            "cit_count": 8,
            "doi": "10.1186/1471-2105-13-221",
            "journal": "BMC Bioinformatics",
            "title": "ReQON: a Bioconductor package for recalibrating quality scores from next-generation sequencing data",
            "type": "Primary",
            "year": "2012-09-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:reqon",
        "biotoolsID": "reqon",
        "description": "Algorithm for recalibrating the base quality scores for aligned sequencing data in BAM format.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/ReQON.html",
        "name": "ReQON",
        "version": [
            "1.20.0"
        ]
    }
}