{
    "additionDate": "2021-01-18T11:34:36Z",
    "biotoolsCURIE": "biotools:bacwgstdb",
    "biotoolsID": "bacwgstdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yvys119@zju.edu.cn",
            "name": "Yunsong Yu",
            "typeEntity": "Person"
        },
        {
            "email": "r_z@zju.edu.cn",
            "name": "Zhi Ruan",
            "typeEntity": "Person"
        }
    ],
    "description": "BacWGSTdb is a free publicly accessible database we have developed for bacterial whole-genome sequence typing and source tracking. This database incorporates extensive resources for bacterial genome sequencing data and the corresponding metadata, combined with specialized bioinformatics tools that enable the systematic characterization of the bacterial isolates recovered from infections.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Plasmid map drawing",
                    "uri": "http://edamontology.org/operation_0578"
                }
            ]
        }
    ],
    "homepage": "http://bacdb.cn/BacWGSTdb/",
    "lastUpdate": "2021-01-29T21:03:18Z",
    "name": "BacWGSTdb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA821",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited.An increasing prevalence of hospital acquired infections and foodborne illnesses caused by pathogenic and multidrug-resistant bacteria has stimulated a pressing need for benchtop computational techniques to rapidly and accurately classify bacteria from genomic sequence data, and based on that, to trace the source of infection. BacWGSTdb (http://bacdb.org/BacWGSTdb) is a free publicly accessible database we have developed for bacterial whole-genome sequence typing and source tracking. This database incorporates extensive resources for bacterial genome sequencing data and the corresponding metadata, combined with specialized bioinformatics tools that enable the systematic characterization of the bacterial isolates recovered from infections. Here, we present BacWGSTdb 2.0, which encompasses several major updates, including (i) the integration of the core genome multi-locus sequence typing (cgMLST) approach, which is highly scalable and appropriate for typing isolates belonging to different lineages; (ii) the addition of a multiple genome analysis module that can process dozens of user uploaded sequences in a batch mode; (iii) a new source tracking module for comparing user uploaded plasmid sequences to those deposited in the public databases; (iv) the number of species encompassed in BacWGSTdb 2.0 has increased from 9 to 20, which represents bacterial pathogens of medical importance; (v) a newly designed, user-friendly interface and a set of visualization tools for providing a convenient platform for users are also included. Overall, the updated BacWGSTdb 2.0 bears great utility in continuing to provide users, including epidemiologists, clinicians and bench scientists, with a one-stop solution to bacterial genome sequence analysis.",
                "authors": [
                    {
                        "name": "Feng Y."
                    },
                    {
                        "name": "Zou S."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Ruan Z."
                    }
                ],
                "citationCount": 23,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BacWGSTdb 2.0: A one-stop repository for bacterial whole-genome sequence typing and source tracking"
            },
            "note": "Publication for version 2",
            "pmid": "33010178",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkv1004",
            "metadata": {
                "abstract": "© The Author(s) 2015.Whole genome sequencing has become one of the routine methods in molecular epidemiological practice. In this study, we present BacWGSTdb (http://bacdb.org/BacWGSTdb), a bacterial whole genome sequence typing database which is designed for clinicians, clinical microbiologists and hospital epidemiologists. This database borrows the population structure from the current multi-locus sequence typing (MLST) scheme and adopts a hierarchical data structure: species, clonal complex and isolates. When users upload the pre-assembled genome sequences to BacWGSTdb, it offers the functionality of bacterial genotyping at both traditional MLST and whole-genome levels. More importantly, users are told which isolates in the public database are phylogenetically close to the query isolate, along with their clinical information such as host, isolation source, disease, collection time and geographical location. In this way, BacWGSTdb offers a rapid and convenient platform for worldwide users to address a variety of clinical microbiological issues such as source tracking bacterial pathogens.",
                "authors": [
                    {
                        "name": "Ruan Z."
                    },
                    {
                        "name": "Feng Y."
                    }
                ],
                "citationCount": 107,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BacWGSTdb, a database for genotyping and source tracking bacterial pathogens"
            },
            "note": "Publication for first version",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bib/bbz010",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Whole genome sequencing (WGS) has revolutionized the genotyping of bacterial pathogens and is expected to become the new gold standard for tracing the transmissions of bacterial infectious diseases for public health purposes. Traditional genomic epidemiology often uses WGS as a verification tool, namely, when a common source or epidemiological link is suspected, the collected isolates are sequenced for the determination of clonal relationships. However, increasingly frequent international travel and food transportation, and the associated potential for the cross-border transmission of bacterial pathogens, often lead to an absence of information on bacterial transmission routes. Here we introduce the concept of 'reverse genomic epidemiology', i.e. when isolates are inspected by genome comparisons to be sufficiently similar to one another, they are assumed to be a consequence of infection from a common source. Through BacWGSTdb (http://bacdb.org/BacWGSTdb/), a database we have developed for bacterial genome typing and source tracking, we have found that almost the entire analyzed 20 bacterial species exhibit the phenomenon of cross-border clonal dissemination. Five networks were further identified in which isolates sharing nearly identical genomes were collected from at least five different countries. Three of these have been documented as real infectious disease outbreaks, therefore demonstrating the feasibility and authority of reverse genomic epidemiology. Our survey and proposed strategy would be of potential value in establishing a global surveillance system for tracing bacterial transmissions and outbreaks; the related database and techniques require urgent standardization.",
                "authors": [
                    {
                        "name": "Ruan Z."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Feng Y."
                    }
                ],
                "citationCount": 23,
                "date": "2020-03-23T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "The global dissemination of bacterial infections necessitates the study of reverse genomic epidemiology"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "version": [
        "2.0"
    ]
}