{"credit":[{"email":"perseusm@bcgsc.ca","name":"Perseus I Missirlis","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://satellog.bcgsc.ca/documentation.php"}],"function":[{"operation":[{"term":"Repeat sequence detection","uri":"http://edamontology.org/operation_0379"},{"term":"Polymorphism detection","uri":"http://edamontology.org/operation_3202"},{"term":"Repeat sequence analysis","uri":"http://edamontology.org/operation_0237"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"Repeat sequence organisation analysis","uri":"http://edamontology.org/operation_0380"}]}],"labels":{"language":["SQL","Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Sequence composition, complexity and repeats","uri":"http://edamontology.org/topic_0157"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"}]},"publication":[{"abstract":"Background: To date, 35 human diseases, some of which also exhibit anticipation, have been associated with unstable repeats. Anticipation has been reported in a number of diseases in which repeat expansion may have a role in etiology. Despite the growing importance of unstable repeats in disease, currently no resource exists for the prioritization of repeats. Here we present Satellog, a database that catalogs all pure 1-16 repeat unit satellite repeats in the human genome along with supplementary data. Satellog analyzes each pure repeat in UniGene clusters for evidence of repeat polymorphism. Results: A total of 5,546 such repeats were identified, providing the first indication of many novel polymorphic sites in the genome. Overall, polymorphic repeats were over-represented within 3′-UTR sequence relative to 5′-UTR and coding sequence. Interestingly, we observed that repeat polymorphism within coding sequence is restricted to trinucleotide repeats whereas UTR sequence tolerated a wider range of repeat period polymorphisms. For each pure repeat we also calculate its repeat length percentile rank, its location either within or adjacent to EnsEMBL genes, and its expression profile in normal tissues according to the GeneNote database. Conclusions: Satellog provides the ability to dynamically prioritize repeats based on any of their characteristics (i.e. repeat unit, class, period, length, repeat length percentile rank, genomic co-ordinates), polymorphism profile within UniGene, proximity to or presence within gene regions (i.e. cds, UTR, 15 kb upstream etc.), metadata of the genes they are detected within and gene expression profiles within normal human tissues. Unstable repeats associated with 31 diseases were analyzed in Satellog to evaluate their common repeat properties. The utility of Satellog was highlighted by prioritizing repeats for Huntingtons disease and schizophrenia. Satellog is available online at http://satellog.bcgsc.ca. © 2005 Missirlis et al., licensee BioMed Central Ltd.","authors":["Missirlis P.I.","Mead C.-L.R.","Butland S.L.","Ouellette B.F.F.","Devon R.S.","Leavitt B.R.","Holt R.A."],"cit_count":14,"journal":"BMC Bioinformatics","pmid":"15949044","title":"Satellog: A database for the identification and prioritization of satellite repeats in disease association studies","year":"2005-06-10"}],"summary":{"biotoolsCURIE":"biotools:satellog","biotoolsID":"satellog","description":"Database for the identification and prioritization of satellite repeats in disease association studies.","homepage":"http://satellog.bcgsc.ca/","name":"Satellog"}}