{
    "additionDate": "2019-11-14T18:28:37Z",
    "biotoolsCURIE": "biotools:ReconViguRation",
    "biotoolsID": "ReconViguRation",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'keyboards VR', 'keyboards', 'VR', 'physical keyboards VR' | Reconfiguring Physical Keyboards in Virtual Reality | Physical keyboards are common peripherals for personal computers and are efficient standard text entry devices. Recent research has investigated how physical keyboards can be used in immersive head-mounted display-based Virtual Reality (VR). So far, the physical layout of keyboards has typically been transplanted into VR for replicating typing experiences in a standard desktop environment. In this paper, we explore how to fully leverage the immersiveness of VR to change the input and output characteristics of physical keyboard interaction within a VR environment. This allows individual physical keys to be reconfigured to the same or different actions and visual output to be distributed in various ways across the VR representation of the keyboard",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31403423",
    "lastUpdate": "2019-11-14T18:28:37Z",
    "name": "ReconViguRation",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TVCG.2019.2932239",
            "metadata": {
                "abstract": "© 1995-2012 IEEE.Physical keyboards are common peripherals for personal computers and are efficient standard text entry devices. Recent research has investigated how physical keyboards can be used in immersive head-mounted display-based Virtual Reality (VR). So far, the physical layout of keyboards has typically been transplanted into VR for replicating typing experiences in a standard desktop environment. In this paper, we explore how to fully leverage the immersiveness of VR to change the input and output characteristics of physical keyboard interaction within a VR environment. This allows individual physical keys to be reconfigured to the same or different actions and visual output to be distributed in various ways across the VR representation of the keyboard. We explore a set of input and output mappings for reconfiguring the virtual presentation of physical keyboards and probe the resulting design space by specifically designing, implementing and evaluating nine VR-relevant applications: emojis, languages and special characters, application shortcuts, virtual text processing macros, a window manager, a photo browser, a whack-a-mole game, secure password entry and a virtual touch bar. We investigate the feasibility of the applications in a user study with 20 participants and find that, among other things, they are usable in VR. We discuss the limitations and possibilities of remapping the input and output characteristics of physical keyboards in VR based on empirical findings and analysis and suggest future research directions in this area.",
                "authors": [
                    {
                        "name": "Schneider D."
                    },
                    {
                        "name": "Otte A."
                    },
                    {
                        "name": "Gesslein T."
                    },
                    {
                        "name": "Gagel P."
                    },
                    {
                        "name": "Kuth B."
                    },
                    {
                        "name": "Damlakhi M.S."
                    },
                    {
                        "name": "Dietz O."
                    },
                    {
                        "name": "Ofek E."
                    },
                    {
                        "name": "Pahud M."
                    },
                    {
                        "name": "Kristensson P.O."
                    },
                    {
                        "name": "Muller J."
                    },
                    {
                        "name": "Grubert J."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "ReconViguRation: Reconfiguring Physical Keyboards in Virtual Reality"
            },
            "pmid": "31403423"
        }
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        }
    ]
}