{
    "additionDate": "2017-12-18T00:09:15Z",
    "biotoolsCURIE": "biotools:maxcluster",
    "biotoolsID": "maxcluster",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sbg.bio.ic.ac.uk/~maxcluster/index.html#Contact"
        }
    ],
    "description": "Command-line tool for the comparison of protein structures. It provides a simple interface for a large number of common structure comparison tasks. A key feature of the program is the ability to process thousands of structures, either against a single reference protein or in an all-verses-all comparison.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.sbg.bio.ic.ac.uk/~maxcluster/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                }
            ]
        }
    ],
    "homepage": "http://www.sbg.bio.ic.ac.uk/~maxcluster",
    "lastUpdate": "2018-12-16T12:42:27Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/maxcluster-protein-structure-comparison-clustering.html"
        }
    ],
    "name": "MaxCluster",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1110/ps.0215902",
            "metadata": {
                "abstract": "Advances in structural genomics and protein structure prediction require the design of automatic, fast, objective, and well benchmarked methods capable of comparing and assessing the similarity of low-resolution three-dimensional structures, via experimental or theoretical approaches. Here, a new method for sequence-independent structural alignment is presented that allows comparison of an experimental protein structure with an arbitrary low-resolution protein tertiary model. The heuristic algorithm is given and then used to show that it can describe random structural alignments of proteins with different folds with good accuracy by an extreme value distribution. From this observation, a structural similarity score between two proteins or two different conformations of the same protein is derived from the likelihood of obtaining a given structural alignment by chance. The performance of the derived score is then compared with well established, consensus manual-based scores and data sets. We found that the new approach correlates better than other tools with the gold standard provided by a human evaluator. Timings indicate that the algorithm is fast enough for routine use with large databases of protein models. Overall, our results indicate that the new program (MAMMOTH) will be a good tool for protein structure comparisons in structural genomics applications. MAMMOTH is available from our web site at http://physbio.mssm.edu/~ortizg/.",
                "authors": [
                    {
                        "name": "Olmea O."
                    },
                    {
                        "name": "Ortiz A.R."
                    },
                    {
                        "name": "Strauss C.E.M."
                    }
                ],
                "citationCount": 368,
                "date": "2002-11-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "MAMMOTH (Matching molecular models obtained from theory): An automated method for model comparison"
            },
            "pmcid": "PMC2373724",
            "pmid": "12381844",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
