{
    "additionDate": "2021-01-18T10:11:53Z",
    "biotoolsCURIE": "biotools:deepgmap",
    "biotoolsID": "deepgmap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "koh.onimaru@riken.jp",
            "name": "Koh Onimaru",
            "orcidid": "https://orcid.org/0000-0002-2428-9510",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepGMAP is a Deep learning-based Genotype MAPping platform to predict them. It can train different architectures of neural networks with epigenomic data, and \"map\" potential gene regulatory regions on a genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://github.com/koonimaru/DeepGMAP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T16:19:38Z",
    "license": "Apache-2.0",
    "name": "DeepGMAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0235748",
            "metadata": {
                "abstract": "© 2020 Onimaru et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.With advances in sequencing technology, a vast amount of genomic sequence information has become available. However, annotating biological functions particularly of non-proteincoding regions in genome sequences without experiments is still a challenging task. Recently deep learning-based methods were shown to have the ability to predict gene regulatory regions from genome sequences, promising to aid the interpretation of genomic sequence data. Here, we report an improvement of the prediction accuracy for gene regulatory regions by using the design of convolution layers that efficiently process genomic sequence information, and developed a software, DeepGMAP, to train and compare different deep learning-based models (https://github.com/koonimaru/DeepGMAP). First, we demonstrate that our convolution layers, termed forward- and reverse-sequence scan (FRSS) layers, integrate both forward and reverse strand information, and enhance the power to predict gene regulatory regions. Second, we assessed previous studies and identified problems associated with data structures that caused overfitting. Finally, we introduce visualization methods to examine what the program learned. Together, our FRSS layers improve the prediction accuracy for gene regulatory regions.",
                "authors": [
                    {
                        "name": "Onimaru K."
                    },
                    {
                        "name": "Nishimura O."
                    },
                    {
                        "name": "Kuraku S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Predicting gene regulatory regions with a convolutional neural network for processing double-strand genome sequence information"
            },
            "pmcid": "PMC7377372",
            "pmid": "32701977"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}