{"credit":[{"email":"lauris.kaplinski@ut.ee","name":"Lauris Kaplinski","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioinfo.ut.ee/NIPTMer/readme.txt"}],"function":[{"operation":[{"term":"k-mer counting","uri":"http://edamontology.org/operation_3472"}]}],"labels":{"language":["Perl","Python"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"© 2018 The Author(s). Non-invasive prenatal testing (NIPT) is a recent and rapidly evolving method for detecting genetic lesions, such as aneuploidies, of a fetus. However, there is a need for faster and cheaper laboratory and analysis methods to make NIPT more widely accessible. We have developed a novel software package for detection of fetal aneuploidies from next-generation low-coverage whole genome sequencing data. Our tool - NIPTmer - is based on counting pre-defined per-chromosome sets of unique k-mers from raw sequencing data, and applying linear regression model on the counts. Additionally, the filtering process used for k-mer list creation allows one to take into account the genetic variance in a specific sample, thus reducing the source of uncertainty. The processing time of one sample is less than 10 CPU-minutes on a high-end workstation. NIPTmer was validated on a cohort of 583 NIPT samples and it correctly predicted 37 non-mosaic fetal aneuploidies. NIPTmer has the potential to reduce significantly the time and complexity of NIPT post-sequencing analysis compared to mapping-based methods. For non-commercial users the software package is freely available at http://bioinfo.ut.ee/NIPTMer/.","authors":["Sauk M.","Zilina O.","Kurg A.","Ustav E.-L.","Peters M.","Paluoja P.","Roost A.M.","Teder H.","Palta P.","Brison N.","Vermeesch J.R.","Krjutskov K.","Salumets A.","Kaplinski L."],"cit_count":1,"doi":"10.1038/s41598-018-23589-8","journal":"Scientific Reports","title":"NIPTmer: Rapid k-mer-based software package for detection of fetal aneuploidies","year":"2018-12-01"}],"summary":{"biotoolsCURIE":"biotools:niptmer","biotoolsID":"niptmer","description":"Rapid k-mer-based software package for detection of fetal aneuploidies.","homepage":"http://bioinfo.ut.ee/NIPTMer/","name":"NIPTmer"}}