{
    "additionDate": "2017-02-10T14:14:46Z",
    "biotoolsCURIE": "biotools:space",
    "biotoolsID": "space",
    "description": "SPACE (Structure Prediction and Analysis based on Complementarity with Environment) is a suite of tools for predicting and analyzing structures of biomolecules and their complexes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA structure prediction",
                    "uri": "http://edamontology.org/operation_2442"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Quadruplex formation site detection",
                    "uri": "http://edamontology.org/operation_0429"
                }
            ]
        }
    ],
    "homepage": "http://ligin.weizmann.ac.il/space/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "name": "SPACE",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A method is described to dock a ligand into a binding site in a protein on the basis of the complementarity of the intermolecular atomic contacts. Docking is performed by maximization of a complementarity function that is dependent on atomic contact surface area and the chemical properties of the contacting atoms. The generality and simplicity of the complementarity function ensure that a wide range of chemical structures can be handled. The ligand and the protein are treated as rigid bodies, but displacement of a small number of residues lining the ligand binding site can be taken into account. The method can assist in the design of improved ligands by indicating what changes in complementarity may occur as a result of the substitution of an atom in the ligand. The capabilities of the method are demonstrated by application to 14 protein-ligand complexes of known crystal structure.",
                "authors": [
                    {
                        "name": "Edelman M."
                    },
                    {
                        "name": "Sobolev V."
                    },
                    {
                        "name": "Vriend G."
                    },
                    {
                        "name": "Wade R.C."
                    }
                ],
                "citationCount": 156,
                "date": "1996-01-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Molecular docking using surface complementarity"
            },
            "pmid": "8727324"
        },
        {
            "metadata": {
                "abstract": "A web-based tool, termed 'MutaProt', is described which analyses pairs of PDB files whose members differ in one, or two, amino acids. MutaProt examines the micro environment surrounding the exchanged residue(s) and can be searched by specifying a PDB ID, keywords, or any pair of amino acids. Detailed information about accessibility of the exchanged residue(s) and its atomic contacts are provided based on CSU software (Sobolev et al., Bioinformatics, 15, 327-332, 1999). An interactive 3D presentation of the superimposed regions around the mutation(s) is included. MutaProt is updated weekly.",
                "authors": [
                    {
                        "name": "Edelman M."
                    },
                    {
                        "name": "Eyal E."
                    },
                    {
                        "name": "Najmanovich R."
                    },
                    {
                        "name": "Sobolev V."
                    }
                ],
                "citationCount": 8,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MutaProt: A web interface for structural analysis of point mutations"
            },
            "pmid": "11301313"
        },
        {
            "metadata": {
                "abstract": "Contact surface area and chemical properties of atoms are used to concurrently predict conformations of multiple amino acid side chains on a fixed protein backbone. The combination of surface complementarity and solvent-accessible surface accounts for van der Waals forces and solvation free energy. The scoring function is particularly suitable for modeling partially buried side chains. Both iterative and stochastic searching approaches are used. Our programs (Sccomp-I and Sccomp-S), with relatively fast execution times, correctly predict x1 angles for 92-93% of buried residues and 82-84% for all residues, with an RMSD of ∼1.7 Å for side chain heavy atoms. We find that the differential between the atomic solvation parameters and the contact surface parameters (including those between noncomplementary atoms) is positive; i.e., most protein atoms prefer surface contact with other protein atoms rather than with the solvent. This might correspond to the driving force for maximizing packing of the protein. The influence of the crystal packing, completeness of rotamer library and precise positioning of Cβ atoms on the accuracy of side-chain prediction are examined. The Sccomp-S and Sccomp-I programs can be accessed through the Web (http://sgedg.weizmann.ac.il/ sccomp.html) and are available for several platforms. © 2004 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Edelman M."
                    },
                    {
                        "name": "Eyal E."
                    },
                    {
                        "name": "Mcconkey B.J."
                    },
                    {
                        "name": "Najmanovich R."
                    },
                    {
                        "name": "Sobolev V."
                    }
                ],
                "citationCount": 103,
                "date": "2004-04-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "Importance of Solvent Accessibility and Contact Surfaces in Modeling Side-Chain Conformations in Proteins"
            },
            "pmid": "14978714"
        },
        {
            "metadata": {
                "abstract": "Motivation: New software has been designed to assist the molecular biologist in understanding the structural consequences of modifying a ligand and/or protein. Results: Tools are described for the analysis of ligand-protein contacts (LPC software) and contacts of structural units (CSU software) such as helices, sheets, strands and residues. Our approach is based on a detailed analysis of interatomic contacts and interface complementarity. For any ligand or structural unit, these software automatically: (i) calculate the solvent-accessible surface of every atom; (ii) determine the contacting residues and type of interaction they undergo (hydrophobic-hydrophobic, aromatic-aromatic, etc.); (iii) indicate all putative hydrogen bonds. LPC software further predicts changes in binding strength following chemical modification of the ligand. Availability: Both LPC and CSU can be accessed through the PDB and are integrated in the 3DB Atlas page of all PDB files. Finally, LPC and CSU can be accessed at: http://sgedg.weizmann.ac.il/lpc and http://sgedg.weizmann.ac.il/csu.",
                "authors": [
                    {
                        "name": "Abola E.E."
                    },
                    {
                        "name": "Edelman M."
                    },
                    {
                        "name": "Prilusky J."
                    },
                    {
                        "name": "Sobolev V."
                    },
                    {
                        "name": "Sorokine A."
                    }
                ],
                "citationCount": 679,
                "date": "1999-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Automated analysis of interatomic contacts in proteins"
            },
            "pmid": "10320401"
        },
        {
            "metadata": {
                "abstract": "We describe a suite of SPACE tools for analysis and prediction of structures of biomolecules and their complexes. LPC/CSU software provides a common definition of inter-atomic contacts and complementarity of contacting surfaces to analyze protein structure and complexes. In the current version of LPC/CSU, analyses of water molecules and nucleic acids have been added, together with improved and expanded visualization options using Chime or Java based Jmol. The SPACE suite includes servers and programs for: structural analysis of point mutations (MutaProt); side chain modeling based on surface complementarity (SCCOMP); building a crystal environment and analysis of crystal contacts (CryCo); construction and analysis of protein contact maps (CMA) and molecular docking software (LIGIN). The SPACE suite is accessed at http://ligin.weizmann.ac.il/space. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Babor M."
                    },
                    {
                        "name": "Edelman M."
                    },
                    {
                        "name": "Eyal E."
                    },
                    {
                        "name": "Gerzon S."
                    },
                    {
                        "name": "Potapov V."
                    },
                    {
                        "name": "Prilusky J."
                    },
                    {
                        "name": "Sobolev V."
                    }
                ],
                "citationCount": 90,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SPACE: A suite of tools for protein structure prediction and analysis based on complementarity and environment"
            },
            "pmid": "15980496"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
