{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-26T07:25:58.817744Z",
    "biotoolsCURIE": "biotools:distema",
    "biotoolsID": "distema",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chengji@missouri.edu",
            "name": "Jianlin Cheng",
            "orcidid": "https://orcid.org/0000-0003-0305-2853",
            "typeEntity": "Person"
        },
        {
            "name": "Xiao Chen"
        }
    ],
    "description": "Prediction of the quality of single protein model using deep learning and residue-residue distance maps",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jianlin-cheng/DISTEMA",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2022-07-26T07:25:58.820521Z",
    "license": "GPL-3.0",
    "name": "DISTEMA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04683-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Estimation of the accuracy (quality) of protein structural models is important for both prediction and use of protein structural models. Deep learning methods have been used to integrate protein structure features to predict the quality of protein models. Inter-residue distances are key information for predicting protein’s tertiary structures and therefore have good potentials to predict the quality of protein structural models. However, few methods have been developed to fully take advantage of predicted inter-residue distance maps to estimate the accuracy of a single protein structural model. Result: We developed an attentive 2D convolutional neural network (CNN) with channel-wise attention to take only a raw difference map between the inter-residue distance map calculated from a single protein model and the distance map predicted from the protein sequence as input to predict the quality of the model. The network comprises multiple convolutional layers, batch normalization layers, dense layers, and Squeeze-and-Excitation blocks with attention to automatically extract features relevant to protein model quality from the raw input without using any expert-curated features. We evaluated DISTEMA’s capability of selecting the best models for CASP13 targets in terms of ranking loss of GDT-TS score. The ranking loss of DISTEMA is 0.079, lower than several state-of-the-art single-model quality assessment methods. Conclusion: This work demonstrates that using raw inter-residue distance information with deep learning can predict the quality of protein structural models reasonably well. DISTEMA is freely at https://github.com/jianlin-cheng/DISTEMA",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Cheng J."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DISTEMA: distance map-based estimation of single protein model accuracy with attentive 2D convolutional neural network"
            },
            "pmcid": "PMC9019949",
            "pmid": "35439931"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
