{
    "accessibility": "Open access",
    "additionDate": "2021-11-24T15:26:56.848558Z",
    "biotoolsCURIE": "biotools:ddccnn",
    "biotoolsID": "ddccnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "2wangfang@163.com",
            "typeEntity": "Person"
        },
        {
            "email": "dqwei@sjtu.edu.cn",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of Protein Solubility Based on Sequence Feature Fusion and DDcCNN.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://www.ddccnn.wang",
    "lastUpdate": "2021-11-24T15:26:56.850985Z",
    "name": "DDcCNN",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S12539-021-00456-1",
            "metadata": {
                "abstract": "© 2021, International Association of Scientists in the Interdisciplinary Areas.Background: Prediction of protein solubility is an indispensable prerequisite for pharmaceutical research and production. The general and specific objective of this work is to design a new model for predicting protein solubility by using protein sequence feature fusion and deep dual-channel convolutional neural networks (DDcCNN) to improve the performance of existing prediction models. Methods: The redundancy of raw protein is reduced by CD-HIT. The four subsequences are built from protein sequence: one global and three locals. The global subsequence is the entire protein sequence, and these local subsequences are obtained by moving a sliding window with some rules. Using G-gap to extract the features of the above four subsequences, a mixed matrix is constructed as the input of one channel which is composed of three-layer convolutional operating. Additional features are extracted by SCRATCH tool as input of another channel, which is consist of a single convolution in order to find hidden relationships and improve the accuracy of predictor. The outputs of two parallel channels are concatenated as the input of the hidden layer. And the prediction of protein solubility is obtained in the output layer. The best protein solubility prediction model is obtained by doing some comparative experiments of different frameworks. Results: The performance indicators of DDcCNN model (our designed) are as follows: accuracy of 77.82%, Matthew’s correlation coefficient of 0.57, sensitivity of 76.13% and specificity of 79.32%. The results of some comparative experiments show that the overall performance of DDcCNN model is better than existing models (GCNN, LCNN and PCNN). The related models and data are publicly deposited at http://www.ddccnn.wang. Conclusion: The satisfactory performance of DDcCNN model reveals that these features and flexible computational methodologies can reinforce the existing prediction models for better prediction of protein solubility could be applied in several applications, such as to preselect initial targets that are soluble or to alter solubility of target proteins, thus can help to reduce the production cost.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Du Z."
                    },
                    {
                        "name": "Zhu M."
                    },
                    {
                        "name": "Kaushik A.C."
                    },
                    {
                        "name": "Jiang X."
                    },
                    {
                        "name": "Wei D."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "Prediction of Protein Solubility Based on Sequence Feature Fusion and DDcCNN"
            },
            "pmid": "34236625"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}