{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://dceg.cancer.gov/home"}],"documentation":[{"type":"GENERAL","url":"https://dceg.cancer.gov/tools/analysis/multassoc/readme"}],"function":[{"operation":[{"term":"Regression","uri":"http://edamontology.org/operation_3659"}]}],"labels":{"language":["MATLAB"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Disease","uri":"http://edamontology.org/topic_0634"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/multassoc-test-association-disease-group-snps.html"}],"publication":[{"abstract":"In modern genetic epidemiology studies, the association between the disease and a genomic region, such as a candidate gene, is often investigated using multiple SNPs. We propose a multilocus test of genetic association that can account for genetic effects that might be modified by variants in other genes or by environmental factors. We consider use of the venerable and parsimonious Tukey's 1-degree-of-freedom model of interaction, which is natural when individual SNPs within a gene are associated with disease through a common biological mechanism; in contrast, many standard regression models are designed as if each SNP has unique functional significance. On the basis of Tukey's model, we propose a novel but computationally simple generalized test of association that can simultaneously capture both the main effects of the variants within a genomic region and their interactions with the variants in another region or with an environmental exposure. We compared performance of our method with that of two standard tests of association, one ignoring gene-gene/gene-environment interactions and the other based on a saturated model of interactions. We demonstrate major power advantages of our method both in analysis of data from a case-control study of the association between colorectal adenoma and DNA variants in the NAT2 genomic region, which are well known to be related to a common biological phenotype, and under different models of gene-gene interactions with use of simulated data. © 2006 by The American Society of Human Genetics. All rights reserved.","authors":["Chatterjee N.","Kalaylioglu Z.","Moslehi R.","Peters U.","Wacholder S."],"cit_count":124,"doi":"10.1086/509704","journal":"American Journal of Human Genetics","title":"Powerful multilocus tests of genetic association in the presence of gene-gene and gene-environment interactions","type":"Primary","year":"2006-01-01"}],"summary":{"biotoolsCURIE":"biotools:multassoc","biotoolsID":"multassoc","description":"MultAssoc is a MATLAB software package for test of association of a disease with a group of SNPs after accounting for their interaction with another group of SNPs or environmental exposures. In addition to implementing two standard logistic regression based tests, the package implements a novel method, called TukAssoc, that uses the Tukey’s 1 d.f. model for interaction between two groups of covariates.","homepage":"http://dceg.cancer.gov/tools/analysis/multassoc","name":"MultAssoc"}}