{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T07:42:35Z",
    "biotoolsCURIE": "biotools:rstoolbox",
    "biotoolsID": "rstoolbox",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jaume.bonet@gmail.com",
            "name": "Jaume Bonet",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Maintainer",
                "Developer"
            ]
        }
    ],
    "description": "large-scale analysis of computational protein design data and structural bioinformatics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/jaumebonet/RosettaSilentToolbox/blob/master/README.rst"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/jaumebonet/RosettaSilentToolbox/releases/tag/v1.0.0",
            "version": "1.0.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jaumebonet/RosettaSilentToolbox",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/jaumebonet/RosettaSilentToolbox/issues"
        }
    ],
    "maturity": "Mature",
    "name": "rstoolbox",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2796-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Large-scale datasets of protein structures and sequences are becoming ubiquitous in many domains of biological research. Experimental approaches and computational modelling methods are generating biological data at an unprecedented rate. The detailed analysis of structure-sequence relationships is critical to unveil governing principles of protein folding, stability and function. Computational protein design (CPD) has emerged as an important structure-based approach to engineer proteins for novel functions. Generally, CPD workflows rely on the generation of large numbers of structural models to search for the optimal structure-sequence configurations. As such, an important step of the CPD process is the selection of a small subset of sequences to be experimentally characterized. Given the limitations of current CPD scoring functions, multi-step design protocols and elaborated analysis of the decoy populations have become essential for the selection of sequences for experimental characterization and the success of CPD strategies. Results: Here, we present the rstoolbox, a Python library for the analysis of large-scale structural data tailored for CPD applications. rstoolbox is oriented towards both CPD software users and developers, being easily integrated in analysis workflows. For users, it offers the ability to profile and select decoy sets, which may guide multi-step design protocols or for follow-up experimental characterization. rstoolbox provides intuitive solutions for the visualization of large sequence/structure datasets (e.g. logo plots and heatmaps) and facilitates the analysis of experimental data obtained through traditional biochemical techniques (e.g. circular dichroism and surface plasmon resonance) and high-throughput sequencing. For CPD software developers, it provides a framework to easily benchmark and compare different CPD approaches. Here, we showcase the rstoolbox in both types of applications. Conclusions: rstoolbox is a library for the evaluation of protein structures datasets tailored for CPD data. It provides interactive access through seamless integration with IPython, while still being suitable for high-performance computing. In addition to its functionalities for data analysis and graphical representation, the inclusion of rstoolbox in protein design pipelines will allow to easily standardize the selection of design candidates, as well as, to improve the overall reproducibility and robustness of CPD selection processes.",
                "authors": [
                    {
                        "name": "Bonet J."
                    },
                    {
                        "name": "Harteveld Z."
                    },
                    {
                        "name": "Sesterhenn F."
                    },
                    {
                        "name": "Scheck A."
                    },
                    {
                        "name": "Correia B.E."
                    }
                ],
                "citationCount": 4,
                "date": "2019-05-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Rstoolbox - A Python library for large-scale analysis of computational protein design data and structural bioinformatics"
            },
            "pmcid": "PMC6521408",
            "pmid": "31092198",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}