{
    "accessibility": "Open access",
    "additionDate": "2022-12-12T21:04:58.682478Z",
    "biotoolsCURIE": "biotools:scmb3pp",
    "biotoolsID": "scmb3pp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong",
            "typeEntity": "Person"
        },
        {
            "name": "Mohammad Ali Moni"
        },
        {
            "name": "Phasit Charoenkwan"
        },
        {
            "name": "Pramote Chumnanpuen"
        }
    ],
    "description": "Improved prediction and characterization of blood-brain barrier penetrating peptides using estimated propensity scores of dipeptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://pmlabstack.pythonanywhere.com/SCMB3PP",
    "lastUpdate": "2022-12-12T21:04:58.685047Z",
    "name": "SCMB3PP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S10822-022-00476-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive licence to Springer Nature Switzerland AG.The blood-brain barrier (BBB) is the primary barrier with a highly selective semipermeable border between blood vascular endothelial cells and the central nervous system. Since BBB can prevent drugs circulating in the blood from crossing into the interstitial fluid of the brain where neurons reside, many researchers are working hard on developing drug delivery systems to penetrate the BBB which currently poses a challenge. Thus, blood-brain barrier penetrating peptides (B3PPs) are an alternative neurotherapeutic for brain-related disorder since they can facilitate drug delivery into the brain. In the meanwhile, developing computational methods that are effective for both the identification and characterization of B3PPs in a cost-effective manner plays an important role for basic reach and in the pharmaceutical industry. Even though few computational methods for B3PP identification have been developed, their performance might fail in terms of generalization ability and interpretability. In this study, a novel and efficient scoring card method-based predictor (termed SCMB3PP) is presented for improving B3PP identification and characterization. To overcome the limitation of black-box computational approaches, the SCMB3PP predictor can automatically estimate amino acid and dipeptide propensities to be B3PPs. Both cross-validation and independent tests indicate that SCMB3PP can achieve impressive performance and outperform various popular machine learning-based methods and the existing methods on multiple independent test datasets. Furthermore, SCMB3PP-derived amino acid propensities were utilized to identify informative biophysical and biochemical properties for characterizing B3PPs. Finally, an online user-friendly web server (http://pmlabstack.pythonanywhere.com/SCMB3PP) is established to identify novel and potential B3PP cost-effectively. This novel computational approach is anticipated to facilitate the large-scale identification of high potential B3PP candidates for follow-up experimental validation.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Chumnanpuen P."
                    },
                    {
                        "name": "Lio' P."
                    },
                    {
                        "name": "Moni M.A."
                    },
                    {
                        "name": "Schaduangrat N."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "date": "2022-11-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Improved prediction and characterization of blood-brain barrier penetrating peptides using estimated propensity scores of dipeptides"
            },
            "pmid": "36284036"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
