{
    "additionDate": "2015-01-22T11:40:45Z",
    "biotoolsCURIE": "biotools:timeclip",
    "biotoolsID": "timeclip",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "chiara.romualdi@unipd.it",
            "name": "Chiara Romualdi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://romualdi.bio.unipd.it/"
        }
    ],
    "description": "Topology based pathway analysis specifically tailored to long time series without replicates. It combines dimension reduction techniques and graph decomposition theory to explore and identify the portion of pathways that is most time-dependent. In the first step, it selects the time-dependent pathways; in the second step, the most time dependent portions of these pathways are highlighted.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://romualdi.bio.unipd.it/software/pathway-based-methods"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "R package. It takes as input a gene expression matrix with a time course experimental design and a list of graphs (pathways). Then it gives back the list of significantly time dependent pathways with their portion mostly associated to time.",
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://romualdi.bio.unipd.it/software/pathway-based-methods",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:21:25Z",
    "license": "AGPL-3.0",
    "name": "timeClip",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-S5-S3",
            "metadata": {
                "abstract": "© 2014 Martini et al.; licensee BioMed Central Ltd.Background: Time-course gene expression experiments are useful tools for exploring biological processes. In this type of experiments, gene expression changes are monitored along time. Unfortunately, replication of time series is still costly and usually long time course do not have replicates. Many approaches have been proposed to deal with this data structure, but none of them in the field of pathway analysis. Pathway analyses have acquired great relevance for helping the interpretation of gene expression data. Several methods have been proposed to this aim: from the classical enrichment to the more complex topological analysis that gains power from the topology of the pathway. None of them were devised to identify temporal variations in time course data. Results: Here we present timeClip, a topology based pathway analysis specifically tailored to long time series without replicates. timeClip combines dimension reduction techniques and graph decomposition theory to explore and identify the portion of pathways that is most time-dependent. In the first step, timeClip selects the time-dependent pathways; in the second step, the most time dependent portions of these pathways are highlighted. We used timeClip on simulated data and on a benchmark dataset regarding mouse muscle regeneration model. Our approach shows good performance on different simulated settings. On the real dataset, we identify 76 time-dependent pathways, most of which known to be involved in the regeneration process. Focusing on the 'mTOR signaling pathway' we highlight the timing of key processes of the muscle regeneration: from the early pathway activation through growth factor signals to the late burst of protein production needed for the fiber regeneration. Conclusions: timeClip represents a new improvement in the field of time-dependent pathway analysis. It allows to isolate and dissect pathways characterized by time-dependent components. Furthermore, using timeClip on a mouse muscle regeneration dataset we were able to characterize the process of muscle fiber regeneration with its correct timing.",
                "authors": [
                    {
                        "name": "Martini P."
                    },
                    {
                        "name": "Sales G."
                    },
                    {
                        "name": "Calura E."
                    },
                    {
                        "name": "Cagnin S."
                    },
                    {
                        "name": "Chiogna M."
                    },
                    {
                        "name": "Romualdi C."
                    }
                ],
                "citationCount": 11,
                "date": "2014-01-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TimeClip: Pathway analysis for time course data without replicates"
            },
            "pmcid": "PMC4095003",
            "pmid": "25077979",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.2"
    ]
}