
{
    "credit": [
        {
            "name": "IRB-BSC",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "irbbarcelona.org",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "adam.hospital@irbbarcelona.org",
            "name": "Adam Hospital",
            "typeRoles": [
                "Support"
            ],
            "url": "http://mmb.irbbarcelona.org/www/"
        },
        {
            "email": "adam.hospital@irbbarcelona.org",
            "name": "Adam Hospital",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mmb.irbbarcelona.org/www/"
        }
    ],
    "documentation": [
        {
            "type": "CITATION_INSTRUCTIONS",
            "url": "http://mmb.irbbarcelona.org/FlexPortal/"
        },
        {
            "type": "GENERAL",
            "url": "http://mmb.irbbarcelona.org/FlexPortal/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Structure",
                        "uri": "http://edamontology.org/data_0883"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Molecular dynamics simulation",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioExcel",
            "IRB-BSC",
            "ELIXIR-ES",
            "MuG"
        ],
        "cost": "Free of charge",
        "language": [
            "PHP",
            "JavaScript",
            "Python"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Workbench"
        ],
        "topic": [
            {
                "term": "Computational chemistry",
                "uri": "http://edamontology.org/topic_3332"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            }
        ]
    },
    "publication": [
        {
            "abstract": "MDWeb and MDMoby constitute a web-based platform to help access to molecular dynamics (MD) in the standard and high-throughput regime. The platform provides tools to prepare systems from PDB structures mimicking the procedures followed by human experts. It provides inputs and can send simulations for three of the most popular MD packages (Amber, NAMD and Gromacs). Tools for analysis of trajectories, either provided by the user or retrieved from our MoDEL database (http://mmb.pcb.ub.es/MoDEL) are also incorporated. The platform has two ways of access, a set of web-services based on the BioMoby framework (MDMoby), programmatically accessible and a web portal (MDWeb). © The Author 2012. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Hospital A.",
                "Andrio P.",
                "Fenollosa C.",
                "Cicin-Sain D.",
                "Orozco M.",
                "Gelpi J.L."
            ],
            "cit_count": 55,
            "doi": "10.1093/bioinformatics/bts139",
            "journal": "Bioinformatics",
            "pmid": "22437851",
            "title": "MDWeb and MDMoby: An integrated web-based platform for molecular dynamics simulations",
            "type": "Primary",
            "year": "2012-05-01"
        },
        {
            "pmid": "21070939",
            "type": "Other"
        },
        {
            "abstract": "Summary: FlexServ is a web-based tool for the analysis of protein flexibility. The server incorporates powerful protocols for the coarse-grained determination of protein dynamics using different versions of Normal Mode Analysis (NMA), Brownian dynamics (BD) and Discrete Dynamics (DMD). It can also analyze user provided trajectories. The server allows a complete analysis of flexibility using a large variety of metrics, including basic geometrical analysis, B-factors, essential dynamics, stiffness analysis, collectivity measures, Lindemann's indexes, residue correlation, chain-correlations, dynamic domain determination, hinge point detections, etc. Data is presented through a web interface as plain text, 2D and 3D graphics. © The Author 2009. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Camps J.",
                "Carrillo O.",
                "Emperador A.",
                "Orellana L.",
                "Hospital A.",
                "Rueda M.",
                "Cicin-Sain D.",
                "D'Abramo M.",
                "Gelpi J.L.",
                "Orozco M."
            ],
            "cit_count": 53,
            "journal": "Bioinformatics",
            "pmid": "19429600",
            "title": "FlexServ: An integrated tool for the analysis of protein flexibility",
            "type": "Other",
            "year": "2009-06-29"
        },
        {
            "abstract": "We present NAFlex, a new web tool to study the flexibility of nucleic acids, either isolated or bound to other molecules. The server allows the user to incorporate structures from protein data banks, completing gaps and removing structural inconsistencies. It is also possible to define canonical (average or sequence-adapted) nucleic acid structures using a variety of predefined internal libraries, as well to create specific nucleic acid conformations from the sequence. The server offers a variety of methods to explore nucleic acid flexibility, such as a colorless wormlike-chain model, a base-pair resolution mesoscopic model and atomistic molecular dynamics simulations with a wide variety of protocols and force fields. The trajectories obtained by simulations, or imported externally, can be visualized and analyzed using a large number of tools, including standard Cartesian analysis, essential dynamics, helical analysis, local and global stiffness, energy decomposition, principal components and in silico NMR spectra. The server is accessible free of charge from the mmb.irbbarcelona.org/NAFlex webpage.",
            "authors": [
                "Hospital A.",
                "Faustino I.",
                "Collepardo-Guevara R.",
                "Gonzalez C.",
                "Gelpi J.L.",
                "Orozco M."
            ],
            "cit_count": 13,
            "journal": "Nucleic acids research",
            "pmid": "23685436",
            "title": "NAFlex: a web server for the study of nucleic acid flexibility.",
            "type": "Other",
            "year": "2013-01-01"
        },
        {
            "abstract": "© The Author(s) 2015. Molecular dynamics simulation (MD) is, just behind genomics, the bioinformatics tool that generates the largest amounts of data, and that is using the largest amount of CPU time in supercomputing centres. MD trajectories are obtained after months of calculations, analysed in situ, and in practice forgotten. Several projects to generate stable trajectory databases have been developed for proteins, but no equivalence exists in the nucleic acids world. We present here a novel database system to store MD trajectories and analyses of nucleic acids. The initial data set available consists mainly of the benchmark of the new molecular dynamics force-field, parmBSC1. It contains 156 simulations, with over 120 μs of total simulation time. A deposition protocol is available to accept the submission of new trajectory data. The database is based on the combination of two NoSQL engines, Cassandra for storing trajectories and MongoDB to store analysis results and simulation metadata. The analyses available include backbone geometries, helical analysis, NMR observables and a variety of mechanical analyses. Individual trajectories and combined meta-trajectories can be downloaded from the portal. The system is accessible through http://mmb.irbbarcelona.org/BIGNASim/. Supplementary Material is also available on-line at http://mmb. irbbarcelona.org/BIGNASim/SuppMaterial/.",
            "authors": [
                "Hospital A.",
                "Andrio P.",
                "Cugnasco C.",
                "Codo L.",
                "Becerra Y.",
                "Dans P.D.",
                "Battistini F.",
                "Torres J.",
                "Goni R.",
                "Orozco M.",
                "Gelpy J.Ll."
            ],
            "cit_count": 13,
            "journal": "Nucleic Acids Research",
            "pmid": "26612862",
            "title": "BIGNASim: A NoSQL database structure and analysis portal for nucleic acids simulation data",
            "type": "Other",
            "year": "2016-01-01"
        },
        {
            "abstract": "Motivation: A new algorithm to trace conformational transitions in proteins is presented. The method uses discrete molecular dynamics as engine to sample protein conformational space. A multiple minima Go-like potential energy function is used in combination with several enhancing sampling strategies, such as metadynamics, Maxwell Demon molecular dynamics and essential dynamics. The method, which shows an unprecedented computational efficiency, is able to trace a wide range of known experimental transitions. Contrary to simpler methods our strategy does not introduce distortions in the chemical structure of the protein and is able to reproduce well complex non-linear conformational transitions. The method, called GOdMD, can easily introduce additional restraints to the transition (presence of ligand, known intermediate, known maintained contacts, ...) and is freely distributed to the community through the Spanish National Bioinformatics Institute (http://mmb.irbbarcelona.org/GOdMD).Availability: Freely available on the web at http://mmb.irbbarcelona.org/GOdMD.Contact: or modesto@mmb.pcb.ub.esSupplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author 2013. Published by Oxford University Press.",
            "authors": [
                "Sfriso P.",
                "Hospital A.",
                "Emperador A.",
                "Orozco M."
            ],
            "cit_count": 17,
            "journal": "Bioinformatics",
            "pmid": "23740746",
            "title": "Exploration of conformational transition pathways from coarse-grained simulations",
            "type": "Other",
            "year": "2013-08-15"
        },
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: The SEABED web server integrates a variety of docking and QSAR techniques in a user-friendly environment. SEABED goes beyond the basic docking and QSAR web tools and implements extended functionalities like receptor preparation, library editing, flexible ensemble docking, hybrid docking/QSAR experiments or virtual screening on protein mutants. SEABED is not a monolithic workflow tool but Software as a Service platform.",
            "authors": [
                "Fenollosa C.",
                "Oton M.",
                "Andrio P.",
                "Cortes J.",
                "Orozco M.",
                "Goni J.R."
            ],
            "cit_count": 3,
            "journal": "Bioinformatics",
            "pmid": "25348211",
            "title": "SEABED: Small molEcule activity scanner weB servicE baseD",
            "type": "Other",
            "year": "2015-03-01"
        },
        {
            "abstract": "DNAlive is a tool for the analysis and graphical display of structural and physical characteristics of genomic DNA. The web server implements a wide repertoire of metrics to derive physical information from DNA sequences with a powerful interface to derive 3D information on large sequences of both naked and protein-bound DNAs. Furthermore, it implements a mesoscopic Metropolis code which allows the inexpensive study of the dynamic properties of chromatin fibers. In addition, our server also surveys other protein and genomic databases allowing the user to combine and explore the physical properties of selected DNA in the context of functional features annotated on those regions. © The Author 2008. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Goni J.R.",
                "Fenollosa C.",
                "Perez A.",
                "Torrents D.",
                "Orozco M."
            ],
            "cit_count": 18,
            "journal": "Bioinformatics",
            "pmid": "18544548",
            "title": "DNAlive: A tool for the physical analysis of DNA at the genomic scale",
            "type": "Other",
            "year": "2008-01-01"
        },
        {
            "pmid": "26605625",
            "type": "Other"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:flexportal",
        "biotoolsID": "flexportal",
        "description": "FlexPortal is a web portal containing a series of tools and databases related to macromolecular structure flexibility, developed to offer an integrated approach to study flexibility. Tools such as molecular dynamics atomistic and coarse-grained simulations, proteins and nucleic acids dynamics and flexibility analyses and structures and trajectories databases/repositories  are integrated in a publicly available web interface.",
        "homepage": "http://mmb.irbbarcelona.org/FlexPortal/",
        "name": "FlexPortal",
        "version": [
            "1"
        ]
    }
}