{
    "name": "KSP-PUEL", 
    "description": "Application developed for predicting novel substrates of kinases of interest.", 
    "homepage": "https://github.com/PengyiYang/KSP-PUEL", 
    "biotoolsID": "ksp-puel", 
    "biotoolsCURIE": "biotools:ksp-puel", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2492", 
                    "term": "Protein interaction prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0821", 
            "term": "Enzymes"
        }, 
        {
            "uri": "http://edamontology.org/topic_0128", 
            "term": "Protein interactions"
        }, 
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/ksp-puel-predicting-novel-substrates-of-kinases-of-interest.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/PengyiYang/KSP-PUEL/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26395771", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Positive-unlabeled ensemble learning for kinase substrate prediction from dynamic phosphoproteomics data", 
                "abstract": "© 2015 Published by Oxford University Press 2015. Motivation: Protein phosphorylation is a post-translational modification that underlines various aspects of cellular signaling. A key step to reconstructing signaling networks involves identification of the set of all kinases and their substrates. Experimental characterization of kinase substrates is both expensive and time-consuming. To expedite the discovery of novel substrates, computational approaches based on kinase recognition sequence (motifs) from known substrates, protein structure, interaction and co-localization have been proposed. However, rarely do these methods take into account the dynamic responses of signaling cascades measured from in vivo cellular systems. Given that recent advances in mass spectrometry-based technologies make it possible to quantify phosphorylation on a proteome-wide scale, computational approaches that can integrate static features with dynamic phosphoproteome data would greatly facilitate the prediction of biologically relevant kinase-specific substrates. Results: Here, we propose a positive-unlabeled ensemble learning approach that integrates dynamic phosphoproteomics data with static kinase recognition motifs to predict novel substrates for kinases of interest. We extended a positive-unlabeled learning technique for an ensemble model, which significantly improves prediction sensitivity on novel substrates of kinases while retaining high specificity. We evaluated the performance of the proposed model using simulation studies and subsequently applied it to predict novel substrates of key kinases relevant to insulin signaling. Our analyses show that static sequence motifs and dynamic phosphoproteomics data are complementary and that the proposed integrated model performs better than methods relying only on static information for accurate prediction of kinase-specific substrates. Availability and implementation: Executable GUI tool, source code and documentation are freely available at https://github.com/PengyiYang/KSP-PUEL. Contact: or jothi@mail.nih.gov Supplementary information: Supplementary data are available at Bioinformatics online.", 
                "date": "2016-01-15T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Yang P."
                    }, 
                    {
                        "name": "Humphrey S.J."
                    }, 
                    {
                        "name": "James D.E."
                    }, 
                    {
                        "name": "Yang Y.H."
                    }, 
                    {
                        "name": "Jothi R."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "https://www.niehs.nih.gov/research/atniehs/labs/escbl/staff/index.cfm", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:47:40Z", 
    "lastUpdate": "2019-03-26T08:20:59Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}