{
    "additionDate": "2017-08-03T18:43:01Z",
    "biotoolsCURIE": "biotools:forcefield_ncaa",
    "biotoolsID": "forcefield_ncaa",
    "credit": [
        {
            "email": "george@titan.princeton.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Set of self-consistent AMBER forcefield parameters for non-canonical amino acids. It allows you to design and derivatize peptides containing NCAAs for use as drugs.",
    "documentation": [
        {
            "type": "General",
            "url": "http://selene.princeton.edu/FFNCAA/files/instructions.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://selene.princeton.edu/FFNCAA/",
    "lastUpdate": "2018-12-10T12:58:46Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/forcefield_ncaa-amber-forcefield-parameters-for-non-canonical-amino-acids.html"
        }
    ],
    "name": "Forcefield_NCAA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 American Chemical Society.We describe the development and testing of ab initio derived, AMBER ff03 compatible charge parameters for a large library of 147 noncanonical amino acids including β- and N-methylated amino acids for use in applications such as protein structure prediction and de novo protein design. The charge parameter derivation was performed using the RESP fitting approach. Studies were performed assessing the suitability of the derived charge parameters in discriminating the activity/inactivity between 63 analogs of the complement inhibitor Compstatin on the basis of previously published experimental IC50 data and a screening procedure involving short simulations and binding free energy calculations. We found that both the approximate binding affinity (K) and the binding free energy calculated through MM-GBSA are capable of discriminating between active and inactive Compstatin analogs, with MM-GBSA performing significantly better. Key interactions between the most potent Compstatin analog that contains a noncanonical amino acid are presented and compared to the most potent analog containing only natural amino acids and native Compstatin. We make the derived parameters and an associated web interface that is capable of performing modifications on proteins using Forcefield-NCAA and outputting AMBER-ready topology and parameter files freely available for academic use at http://selene.princeton.edu/FFNCAA. The forcefield allows one to incorporate these customized amino acids into design applications with control over size, van der Waals, and electrostatic interactions.",
                "authors": [
                    {
                        "name": "Khoury G.A."
                    },
                    {
                        "name": "Smadbeck J."
                    },
                    {
                        "name": "Tamamis P."
                    },
                    {
                        "name": "Vandris A.C."
                    },
                    {
                        "name": "Kieslich C.A."
                    },
                    {
                        "name": "Floudas C.A."
                    }
                ],
                "citationCount": 26,
                "date": "2014-01-01T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "Forcefield-NCAA: Ab initio charge parameters to aid in the discovery and design of therapeutic proteins and peptides with unnatural amino acids and their application to complement inhibitors of the compstatin family"
            },
            "pmid": "24932669"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}