{
    "accessibility": "Open access",
    "additionDate": "2023-08-24T10:07:23.136581Z",
    "biotoolsCURIE": "biotools:episol",
    "biotoolsID": "episol",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xhuang@chem.wisc.edu",
            "name": "Xuhui Huang",
            "orcidid": "https://orcid.org/0000-0002-7119-9358",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Michael L. Kalin",
            "typeEntity": "Person"
        },
        {
            "name": "Siqin Cao",
            "typeEntity": "Person"
        }
    ],
    "description": "A software package with expanded functions to perform 3D-RISM calculations for the solvation of chemical and biological molecules.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/EPISOLrelease/EPISOL",
    "language": [
        "AWK",
        "PHP",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T14:43:09.453446Z",
    "license": "LGPL-3.0",
    "name": "EPISOL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/jcc.27088",
            "metadata": {
                "abstract": "Integral equation theory (IET) provides an effective solvation model for chemical and biological systems that balances computational efficiency and accuracy. We present a new software package, the expanded package for IET-based solvation (EPISOL), that performs 3D-reference interaction site model (3D-RISM) calculations to obtain the solvation structure and free energies of solute molecules in different solvents. In EPISOL, we have implemented 22 different closures, multiple free energy functionals, and new variations of 3D-RISM theory, including the recent hydrophobicity-induced density inhomogeneity (HI) theory for hydrophobic solutes and ion-dipole correction (IDC) theory for negatively charged solutes. To speed up the convergence and enhance the stability of the self-consistent iterations, we have introduced several numerical schemes in EPISOL, including a newly developed dynamic mixing approach. We show that these schemes have significantly reduced the failure rate of 3D-RISM calculations compared to AMBER-RISM software. EPISOL consists of both a user-friendly graphic interface and a kernel library that allows users to call its routines and adapt them to other programs. EPISOL is compatible with the force-field and coordinate files from both AMBER and GROMACS simulation packages. Moreover, EPISOL is equipped with an internal memory control to efficiently manage the use of physical memory, making it suitable for performing calculations on large biomolecules. We demonstrate that EPISOL can efficiently and accurately calculate solvation density distributions around various solute molecules (including a protein chaperone consisting of 120,715 atoms) and obtain solvent free energy for a wide range of organic compounds. We expect that EPISOL can be widely applied as a solvation model for chemical and biological systems. EPISOL is available at https://github.com/EPISOLrelease/EPISOL.",
                "authors": [
                    {
                        "name": "Cao S."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Kalin M.L."
                    }
                ],
                "citationCount": 3,
                "date": "2023-06-30T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "EPISOL: A software package with expanded functions to perform 3D-RISM calculations for the solvation of chemical and biological molecules"
            },
            "pmid": "36856731"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
