{
    "accessibility": "Open access",
    "additionDate": "2021-11-03T14:35:14.261463Z",
    "biotoolsCURIE": "biotools:drugpy",
    "biotoolsID": "drugpy",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "castilho@ufba.br",
            "typeEntity": "Person"
        },
        {
            "email": "cristy@fcfrp.usp.br",
            "typeEntity": "Person"
        }
    ],
    "description": "Novel insights and opportunities for drug discovery revealed by DRUGpy.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/labimm/DRUGpy/",
    "language": [
        "PyMOL",
        "Python"
    ],
    "lastUpdate": "2021-11-03T14:35:14.264150Z",
    "license": "MIT",
    "name": "DRUGpy",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S10822-021-00403-8",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature Switzerland AG.Assessment of target druggability guided by search and characterization of hot spots is a pivotal step in early stages of drug-discovery. The raw output of FTMap provides the data to perform this task, but it relies on manual intervention to properly combine different sets of consensus sites, therefore allowing identification of hot spots and evaluation of strength, shape and distance among them. Thus, the user’s previous experience on the target and the software has a direct impact on how data generated by FTMap server can be explored. DRUGpy plugin was developed to overcome this limitation. By automatically assembling and scoring all possible combinations of consensus sites, DRUGpy plugin provides FTMap users a straight-forward method to identify and characterize hot spots in protein targets. DRUGpy is available in all operating systems that support PyMOL software. DRUGpy promptly identifies and characterizes pockets that are predicted by FTMap to bind druglike molecules with high-affinity (druggable sites) or low-affinity (borderline sites) and reveals how protein conformational flexibility impacts on the target’s druggability. The use of DRUGpy on the analysis of trypanothione reductases (TR), a validated drug target against trypanosomatids, showcases the usefulness of the plugin, and led to the identification of a druggable pocket in the conserved dimer interface present in this class of proteins, opening new perspectives to the design of selective inhibitors.",
                "authors": [
                    {
                        "name": "Castilho M.S."
                    },
                    {
                        "name": "Froes T.Q."
                    },
                    {
                        "name": "Lacerda P."
                    },
                    {
                        "name": "Nonato M.C."
                    },
                    {
                        "name": "Teixeira O."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Druggable hot spots in trypanothione reductase: novel insights and opportunities for drug discovery revealed by DRUGpy"
            },
            "pmid": "34181199"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
