{
    "additionDate": "2019-11-14T19:48:09Z",
    "biotoolsCURIE": "biotools:SMOG-mapping",
    "biotoolsID": "SMOG-mapping",
    "confidence_flag": "tool",
    "description": "> HOMEPAGE MISSING! | > NAME EQUAL TO (PUB. DIFFERENT) bio.tools/smog | A Lightweight Tool for Object-Spreadsheet Mapping | In the life science domain, experts are usually familiar with spreadsheet software and often use it in their daily work to collect and structure required domain knowledge. The processing and analysis of spreadsheet data is an important task that must be supported by efficient software solutions. A typical application scenario is for example an integration of spreadsheet data (specified or derived) in an ontology to provide reasoning or search. Different converter tools were developed to support a spreadsheet-to-ontology transformation. Such tools allow often only a relatively simple structure of the spreadsheet template or they require complex mapping processes to map the spreadsheet and ontological entities",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Onto-Med/SMOG",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-21T11:29:59Z",
    "name": "SMOG",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3233/SHTI190814",
            "metadata": {
                "abstract": "© 2019 The authors and IOS Press.In the life science domain, experts are usually familiar with spreadsheet software and often use it in their daily work to collect and structure required domain knowledge. The processing and analysis of spreadsheet data is an important task that must be supported by efficient software solutions. A typical application scenario is for example an integration of spreadsheet data (specified or derived) in an ontology to provide reasoning or search. Different converter tools were developed to support a spreadsheet-to-ontology transformation. Such tools allow often only a relatively simple structure of the spreadsheet template or they require complex mapping processes to map the spreadsheet and ontological entities. In many cases, it is impossible to use the existing converter tools because the spreadsheet data must be processed first before the derived data can be integrated into the ontology. In such cases, an efficient and fast development of customized software solutions is of great importance. In this paper, we present a general spreadsheet processing framework to efficiently read and write spreadsheet data. The Spreadsheet Model Generator (SMOG) provides a simple mechanism to automatically generate the Java object model and mappings between object code and spreadsheet entities. Our solution greatly simplifies the implementation of spreadsheet access methods and enables an efficient development of spreadsheet-based applications. The SMOG has already been used successfully in several biomedical projects under real world conditions.",
                "authors": [
                    {
                        "name": "Uciteli A."
                    },
                    {
                        "name": "Beger C."
                    },
                    {
                        "name": "Kropf S."
                    },
                    {
                        "name": "Herre H."
                    }
                ],
                "date": "2019-09-03T00:00:00Z",
                "journal": "Studies in Health Technology and Informatics",
                "title": "Spreadsheet model generator (SMOG): A lightweight tool for object-spreadsheet mapping"
            },
            "pmid": "31483262"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "validated": 1
}