{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-26T07:32:54.124856Z",
    "biotoolsCURIE": "biotools:dmnet",
    "biotoolsID": "dmnet",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "rinabao@mail.missouri.edu",
            "name": "Rina Bao",
            "typeEntity": "Person"
        },
        {
            "name": "Noor M. Al-Shakarji",
            "typeEntity": "Person"
        }
    ],
    "description": "A dual-stream marker-guided network (DMNet) for segmentation of touching cells in microscopy videos of many cell types.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://celltrackingchallenge.net/participants/MU-Ba-US/",
    "lastUpdate": "2022-07-26T07:32:54.127379Z",
    "license": "Not licensed",
    "name": "DMNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/ICCVW54120.2021.00375",
            "metadata": {
                "abstract": "© 2021 IEEE.Accurate segmentation and tracking of cells in microscopy image sequences is extremely beneficial in clinical diagnostic applications and biomedical research. A continuing challenge is the segmentation of dense touching cells and deforming cells with indistinct boundaries, in low signal-to-noise-ratio images. In this paper, we present a dual-stream marker-guided network (DMNet) for segmentation of touching cells in microscopy videos of many cell types. DMNet uses an explicit cell marker-detection stream, with a separate mask-prediction stream using a distance map penalty function, which enables supervised training to focus attention on touching and nearby cells. For multi-object cell tracking we use M2Track tracking-by-detection approach with multi-step data association. Our M2Track with mask overlap includes short term track-to-cell association followed by track-to-track association to re-link tracklets with missing segmentation masks over a short sequence of frames. Our combined detection, segmentation and tracking algorithm has proven its potential on the IEEE ISBI 2021 6th Cell Tracking Challenge (CTC-6) where we achieved multiple top three rankings for diverse cell types. Our team name is MU-Ba-US, and the implementation of DMNet is available at, http://celltrackingchallenge.net/participants/MU-Ba-US/.",
                "authors": [
                    {
                        "name": "Al-Shakarji N.M."
                    },
                    {
                        "name": "Bao R."
                    },
                    {
                        "name": "Bunyak F."
                    },
                    {
                        "name": "Palaniappan K."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Proceedings of the IEEE International Conference on Computer Vision",
                "title": "DMNet: Dual-Stream Marker Guided Deep Network for Dense Cell Segmentation and Lineage Tracking"
            },
            "pmcid": "PMC8982054",
            "pmid": "35386855"
        }
    ],
    "toolType": [
        "Web application",
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}
