{
    "additionDate": "2019-11-14T18:02:55Z",
    "biotoolsCURIE": "biotools:CompScore",
    "biotoolsID": "CompScore",
    "confidence_flag": "high",
    "description": "> HOMEPAGE BROKEN! | Boosting Structure-Based Virtual Screening Performance by Incorporating Docking Scoring Function Components into Consensus Scoring | Consensus scoring has become a commonly used strategy within structure-based virtual screening (VS) workflows with improved performance compared to those based in a single scoring function. However, no research has been devoted to analyze the worth of docking scoring functions components in consensus scoring. We implemented and tested a method that incorporates docking scoring functions components into the setting of high performance VS workflows. This method uses genetic algorithms for finding the combination of scoring components that maximizes the VS enrichment for any target. Our methodology was validated using a data set including ligands and decoys for 102 targets that have been widely used in VS validation studies. Results show that our approach outperforms other methods for all targets",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://bioquimio.udla.edu.ec/compscore/",
    "lastUpdate": "2019-11-14T18:02:55Z",
    "name": "CompScore",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00343",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Consensus scoring has become a commonly used strategy within structure-based virtual screening (VS) workflows with improved performance compared to those based in a single scoring function. However, no research has been devoted to analyze the worth of docking scoring functions components in consensus scoring. We implemented and tested a method that incorporates docking scoring functions components into the setting of high performance VS workflows. This method uses genetic algorithms for finding the combination of scoring components that maximizes the VS enrichment for any target. Our methodology was validated using a data set including ligands and decoys for 102 targets that have been widely used in VS validation studies. Results show that our approach outperforms other methods for all targets. It also boosts the initial enrichment performance of the traditional use of whole scoring functions in consensus scoring by an average of 45%. Our methodology showed to be outstandingly predictive when challenged to rescore external (previously unseen) data. Remarkably, CompScore was able not only to retain its performance after redocking with a different software, but also proved that the enrichment obtained was not artificial. CompScore is freely available at: http://bioquimio.udla.edu.ec/compscore/.",
                "authors": [
                    {
                        "name": "Perez-Castillo Y."
                    },
                    {
                        "name": "Sotomayor-Burneo S."
                    },
                    {
                        "name": "Jimenes-Vargas K."
                    },
                    {
                        "name": "Gonzalez-Rodriguez M."
                    },
                    {
                        "name": "Cruz-Monteagudo M."
                    },
                    {
                        "name": "Armijos-Jaramillo V."
                    },
                    {
                        "name": "Cordeiro M.N.D.S."
                    },
                    {
                        "name": "Borges F."
                    },
                    {
                        "name": "Sanchez-Rodriguez A."
                    },
                    {
                        "name": "Tejera E."
                    }
                ],
                "date": "2019-09-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "CompScore: Boosting Structure-Based Virtual Screening Performance by Incorporating Docking Scoring Function Components into Consensus Scoring"
            },
            "pmid": "31449403"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}