
{
    "credit": [
        {
            "email": "bbglab@irbbarcelona.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bg.upf.edu/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bg.upf.edu/group/projects/oncodrive-fm.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/oncodrivefm-0-0-1-uncover-driver-genes-gene-modules.html"
        }
    ],
    "publication": [
        {
            "abstract": "Identifying cancer driver genes and pathways among all somatic mutations detected in a cohort of tumors is a key challenge in cancer genomics. Traditionally, this is done by prioritizing genes according to the recurrence of alterations that they bear. However, this approach has some known limitations, such as the difficulty to correctly estimate the background mutation rate, and the fact that it cannot identify lowly recurrently mutated driver genes. Here we present a novel approach, Oncodrive-fm, to detect candidate cancer drivers which does not rely on recurrence. First, we hypothesized that any bias toward the accumulation of variants with high functional impact observed in a gene or group of genes may be an indication of positive selection and can thus be used to detect candidate driver genes or gene modules. Next, we developed a method to measure this bias (FM bias) and applied it to three datasets of tumor somatic variants. As a proof of concept of our hypothesis we show that most of the highly recurrent and well-known cancer genes exhibit a clear FM bias. Moreover, this novel approach avoids some known limitations of recurrence-based approaches, and can successfully identify lowly recurrent candidate cancer drivers. © 2012 The Author(s).",
            "authors": [
                "Gonzalez-Perez A.",
                "Lopez-Bigas N."
            ],
            "cit_count": 134,
            "journal": "Nucleic Acids Research",
            "pmid": "22904074",
            "title": "Functional impact bias reveals cancer drivers",
            "year": "2012-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:oncodrivefm",
        "biotoolsID": "oncodrivefm",
        "description": "Detects candidate cancer driver genes and pathways from catalogs of somatic mutations in a cohort of tumors by computing the bias towards the accumulation of functional mutations (FM bias).",
        "homepage": "http://bg.upf.edu/group/projects/oncodrive-fm.php",
        "name": "OncodriveFM"
    }
}