{
    "additionDate": "2021-01-18T10:34:43Z",
    "biotoolsCURIE": "biotools:clone",
    "biotoolsID": "clone",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matteo.dalperaro@epfl.ch",
            "name": "Dal Peraro Matteo",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated clustering based on local density neighborhoods for application to biomolecular structural ensembles.\n\nCLoNe - Clustering based on local density neighborhoods.\n\nCLoNe is a clustering algorithm with highly general applicability. Based on the Density Peaks algorithm from Rodriguez and Laio (Science, 2014), it improves on it by requiring a single parameter, 'pdc', that is intuitive and easy to use. 'pdc' can be incremeted if there are too many clusters, and decremented if there are not enough. Integer values between 1 and 10 are usually enough, with many values leading to the same results in most cases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://www.epfl.ch/labs/lbm/resources",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-12T15:52:57Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/LBM-EPFL/CLoNe"
        }
    ],
    "name": "CLoNe",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA742",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Proteins are intrinsically dynamic entities. Flexibility sampling methods, such as molecular dynamics or those arising from integrative modeling strategies, are now commonplace and enable the study of molecular conformational landscapes in many contexts. Resulting structural ensembles increase in size as technological and algorithmic advancements take place, making their analysis increasingly demanding. In this regard, cluster analysis remains a go-to approach for their classification. However, many state-of-the-art algorithms are restricted to specific cluster properties. Combined with tedious parameter fine-tuning, cluster analysis of protein structural ensembles suffers from the lack of a generally applicable and easy to use clustering scheme. Results: We present CLoNe, an original Python-based clustering scheme that builds on the Density Peaks algorithm of Rodriguez and Laio. CLoNe relies on a probabilistic analysis of local density distributions derived from nearest neighbors to find relevant clusters regardless of cluster shape, size, distribution and amount. We show its capabilities on many toy datasets with properties otherwise dividing state-of-the-art approaches and improves on the original algorithm in key aspects. Applied to structural ensembles, CLoNe was able to extract meaningful conformations from membrane binding events and ligand-binding pocket opening as well as identify dominant dimerization motifs or inter-domain organization. CLoNe additionally saves clusters as individual trajectories for further analysis and provides scripts for automated use with molecular visualization software.",
                "authors": [
                    {
                        "name": "Trager S."
                    },
                    {
                        "name": "Tamo G."
                    },
                    {
                        "name": "Aydin D."
                    },
                    {
                        "name": "Fonti G."
                    },
                    {
                        "name": "Audagnotto M."
                    },
                    {
                        "name": "Dal Peraro M."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CLoNe: Automated clustering based on local density neighborhoods for application to biomolecular structural ensembles"
            },
            "pmid": "32821900"
        }
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Clone library",
            "uri": "http://edamontology.org/topic_3341"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}