{
    "additionDate": "2017-01-13T13:16:30Z",
    "biotoolsCURIE": "biotools:simseq",
    "biotoolsID": "simseq",
    "credit": [
        {
            "email": "sgbenidt@gmail.com",
            "name": "S. Benidt",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Illumina paired-end and mate-pair short read simulator. Used to sample reads from the simulated genome for the first Assemblathon.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/jstjohn/SimSeq/blob/master/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jstjohn/SimSeq",
    "language": [
        "C",
        "Java",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:24:32.997825Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "SimSeq",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006947"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv124",
            "metadata": {
                "abstract": "Motivation: RNA sequencing analysis methods are often derived by relying on hypothetical parametric models for read counts that are not likely to be precisely satisfied in practice. Methods are often tested by analyzing data that have been simulated according to the assumed model. This testing strategy can result in an overly optimistic view of the performance of an RNA-seq analysis method. Results: We develop a data-based simulation algorithm for RNA-seq data. The vector of read counts simulated for a given experimental unit has a joint distribution that closely matches the distribution of a source RNA-seq dataset provided by the user. We conduct simulation experiments based on the negative binomial distribution and our proposed nonparametric simulation algorithm. We compare performance between the two simulation experiments over a small subset of statistical methods for RNA-seq analysis available in the literature. We use as a benchmark the ability of a method to control the false discovery rate. Not surprisingly, methods based on parametric modeling assumptions seem to perform better with respect to false discovery rate control when data are simulated from parametric models rather than using our more realistic nonparametric simulation strategy. Availability and implementation: The nonparametric simulation algorithm developed in this article is implemented in the R package SimSeq, which is freely available under the GNU General Public License (version 2 or later) from the Comprehensive R Archive Network (http://cran.rproject.org/).",
                "authors": [
                    {
                        "name": "Benidt S."
                    },
                    {
                        "name": "Nettleton D."
                    }
                ],
                "citationCount": 41,
                "date": "2015-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SimSeq: A nonparametric approach to simulation of RNA-sequence datasets"
            },
            "pmcid": "PMC4481850",
            "pmid": "25725090",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}
