{
    "additionDate": "2021-01-18T07:45:59Z",
    "biotoolsCURIE": "biotools:tbcaps",
    "biotoolsID": "tbcaps",
    "confidence_flag": "tool",
    "description": "A toolbox for co-activation pattern analysis.\n\nFunctional magnetic resonance imaging provides rich spatio-temporal data of human brain activity during task and rest. Many recent efforts have focussed on characterising dynamics of brain activity. One notable instance is co-activation pattern (CAP) analysis, a frame-wise analytical approach that disentangles the different functional brain networks interacting with a user-defined seed region. While promising applications in various clinical settings have been demonstrated, there is not yet any centralised, publicly accessible resource to facilitate the deployment of the technique",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://miplab.epfl.ch/index.php/software/tbcaps",
    "lastUpdate": "2021-02-26T16:44:32Z",
    "name": "TbCAPs",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2020.116621",
            "metadata": {
                "abstract": "© 2020 The AuthorsFunctional magnetic resonance imaging provides rich spatio-temporal data of human brain activity during task and rest. Many recent efforts have focussed on characterising dynamics of brain activity. One notable instance is co-activation pattern (CAP) analysis, a frame-wise analytical approach that disentangles the different functional brain networks interacting with a user-defined seed region. While promising applications in various clinical settings have been demonstrated, there is not yet any centralised, publicly accessible resource to facilitate the deployment of the technique. Here, we release a working version of TbCAPs, a new toolbox for CAP analysis, which includes all steps of the analytical pipeline, introduces new methodological developments that build on already existing concepts, and enables a facilitated inspection of CAPs and resulting metrics of brain dynamics. The toolbox is available on a public academic repository at https://c4science.ch/source/CAP_Toolbox.git. In addition, to illustrate the feasibility and usefulness of our pipeline, we describe an application to the study of human cognition. CAPs are constructed from resting-state fMRI using as seed the right dorsolateral prefrontal cortex, and, in a separate sample, we successfully predict a behavioural measure of continuous attentional performance from the metrics of CAP dynamics (R ​= ​0.59).",
                "authors": [
                    {
                        "name": "Bolton T.A.W."
                    },
                    {
                        "name": "Tuleasca C."
                    },
                    {
                        "name": "Wotruba D."
                    },
                    {
                        "name": "Rey G."
                    },
                    {
                        "name": "Dhanis H."
                    },
                    {
                        "name": "Gauthier B."
                    },
                    {
                        "name": "Delavari F."
                    },
                    {
                        "name": "Morgenroth E."
                    },
                    {
                        "name": "Gaviria J."
                    },
                    {
                        "name": "Blondiaux E."
                    },
                    {
                        "name": "Smigielski L."
                    },
                    {
                        "name": "Van De Ville D."
                    }
                ],
                "citationCount": 8,
                "date": "2020-05-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "TbCAPs: A toolbox for co-activation pattern analysis"
            },
            "pmid": "32058000"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        }
    ]
}