{
    "additionDate": "2016-01-28T14:13:16Z",
    "biotoolsCURIE": "biotools:reprof",
    "biotoolsID": "reprof",
    "credit": [
        {
            "email": "yachdav@rostlab.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://rostlab.org/group/people/lab-members"
        },
        {
            "name": "tum.de",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Protein secondary structure and accessibility predictor from the Rost Lab. Prediction is either done from protein sequence alone or from an alignment - the latter should be used for optimal performance. The language choosen was Perl.",
    "documentation": [
        {
            "type": [
                "Citation instructions"
            ],
            "url": "http://manpages.ubuntu.com/manpages/vivid/man1/reprof.1.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Rostlab/reprof",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "reprof",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "roc.reguant@tum.de",
    "publication": [
        {
            "metadata": {
                "abstract": "We have trained a two-layered feed-forward neural network on a non-redundant data base of 130 protein chains to predict the secondary structure of water-soluble proteins. A new key aspect is the use of evolutionary information in the form of multiple sequence alignments that are used as input in place of single sequences. The inclusion of protein family information in this form increases the prediction accuracy by six to eight percentage points. A combination of three levels of networks results in an overall three state accuracy of 70.8% for globular proteins (sustained performance). If four membrane protein chains are included in the evaluation, the overall accuracy drops to 70.2%. The prediction is well balanced between α-helix, β-strand and loop: 65% of the observed strand residues are predicted correctly. The accuray in predicting the content of three secondary structure types is comparable to that of circular dichroism spectroscopy. The performance accuracy is verified by a sevenfold cross-validation test, and an additional test on 26 recently solved proteins. Of particular practical importance is the definition of a position-specific reliability index. For half of the residues predicted with a high level of reliability the overall accuracy increases to better than 82%. A further strength of the method is the more realistic prediction of segment length. The protein family prediction method is available for testing by academic researchers via an electronic mail server.",
                "authors": [
                    {
                        "name": "Rost B."
                    },
                    {
                        "name": "Sander C."
                    }
                ],
                "citationCount": 2604,
                "date": "1993-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Prediction of protein secondary structure at better than 70% accuracy"
            },
            "pmid": "8345525",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.1"
    ]
}
