{
    "additionDate": "2020-01-14T09:09:39Z",
    "biotoolsCURIE": "biotools:CNN",
    "biotoolsID": "CNN",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "sji@wpi.edu",
            "name": "Songbai Ji",
            "typeEntity": "Person"
        }
    ],
    "description": "Convolutional neural network for efficient estimation of regional brain strains.\n\nConvolutional neural network for efficient estimation of regional brain strains [link of the paper].\n\nThis page will be updated as needed.\n\nThree pretrained CNN neural network models are provided based on all of the brain response samples available in the published study (N=3069). They correspond to the peak maximum principal strain (MPS) of the whole brain (WB), MPS of the corpus callosum (CC), and fiber strain (FS) of the CC, all assessed at the 95th percentile levels",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jilab-biomechanics/CNN-brain-strains",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2020-01-14T09:09:39Z",
    "license": "GPL-3.0",
    "name": "CNN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-53551-1",
            "metadata": {
                "abstract": "© 2019, The Author(s).Head injury models are important tools to study concussion biomechanics but are impractical for real-world use because they are too slow. Here, we develop a convolutional neural network (CNN) to estimate regional brain strains instantly and accurately by conceptualizing head rotational velocity profiles as two-dimensional images for input. We use two impact datasets with augmentation to investigate the CNN prediction performances with a variety of training-testing configurations. Three strain measures are considered, including maximum principal strain (MPS) of the whole brain, MPS of the corpus callosum, and fiber strain of the corpus callosum. The CNN is further tested using an independent impact dataset (N = 314) measured in American football. Based on 2592 training samples, it achieves a testing R2 of 0.916 and root mean squared error (RMSE) of 0.014 for MPS of the whole brain. Combining all impact-strain response data available (N = 3069), the CNN achieves an R2 of 0.966 and RMSE of 0.013 in a 10-fold cross-validation. This technique may enable a clinical diagnostic capability to a sophisticated head injury model, such as facilitating head impact sensors in concussion detection via a mobile device. In addition, it may transform current acceleration-based injury studies into focusing on regional brain strains. The trained CNN is publicly available along with associated code and examples at https://github.com/Jilab-biomechanics/CNN-brain-strains. They will be updated as needed in the future.",
                "authors": [
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Zhao W."
                    },
                    {
                        "name": "Ghazi K."
                    },
                    {
                        "name": "Ji S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Convolutional neural network for efficient estimation of regional brain strains"
            },
            "pmcid": "PMC6874599",
            "pmid": "31758002"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}