{"collectionID": [], "accessibility": [], "topic": [{"term": "Primers", "uri": "http://edamontology.org/topic_0632"}, {"term": "SNP", "uri": "http://edamontology.org/topic_2885"}, {"term": "Interactions", "uri": "http://edamontology.org/topic_0602"}, {"term": "DNA", "uri": "http://edamontology.org/topic_0654"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.2144/04372ST03", "note": null, "version": null, "pmid": "15335214", "type": "Primary", "pmcid": null, "metadata": {"title": "AutoDimer: A screening tool for primer-dimer and hairpin structures", "abstract": "The ability to select short DNA oligonucleotide sequences capable of binding solely to their intended target is of great importance in developing nucleic acid based detection technologies. Applications such as multiplex PCR rely on primers binding to unique regions in a genome. Competing side reactions with other primer pairs or template DNA decrease PCR efficiency. Freely available primer design software such as Primer3 screens for potential hairpin and primer-dimer interactions while selecting a single primer pair. The development of multiplex PCR assays (in the range of 5 to 20 loci) requires the screening of all primer pairs for potential cross-reactivity. However, a logistical problem results due to the number of total number of comparisons required. Comparing the primer set for a 10-plex assay (20 total primer sequences) results in 210 primer-primer combinations that must be screened. The ability to screen sets of candidate oligomers rapidly for potential cross-reactivity reduces overall assay development time. Here we report the application of a familiar sliding algorithm for comparing two strands of DNA in an overlapping fashion. The algorithm has been employed in a software package wherein the user can compare multiple sequences in a single computational run. After the screening is completed, a score is assigned to potential duplex interactions exceeding a user-defined threshold. Additional criteria of predicted melting temperature (Tm) and free energy of melting (ΔG) are included for further ranking. Sodium counterion and total stand concentrations can be adjusted for the Tm and ΔG calculations. The predicted interactions are saved in a text file for further evaluation.", "citationCount": 279, "authors": [{"name": "Vallone P.M."}, {"name": "Butler J.M."}], "date": "2004-08-01T00:00:00Z", "journal": "BioTechniques"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.nist.gov/mml/bmd/genetics/peter_m_vallone.cfm", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:autodimer", "elixirPlatform": [], "elixirNode": [], "version": ["1.0"], "elixir_badge": 0, "homepage": "http://www.cstl.nist.gov/strbase/AutoDimerHomepage/AutoDimerProgramHomepage.htm", "function": [{"note": null, "input": [], "operation": [{"term": "PCR primer design", "uri": "http://edamontology.org/operation_0308"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-16T13:43:25Z", "otherID": [], "description": "AutoDimer software was developed to rapidly screen previously selected PCR primers for primer-dimer and hairpin interactions in short DNA oligomers (< 30 nucleotides). AutoDimer was originally created to assist in the development of multiplex PCR assays for probing STR and SNP markers for forensic purposes.", "toolType": ["Desktop application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/autodimer-1-0-screening-tool-primer-dimer-hairpin-structures.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "autodimer", "additionDate": "2017-12-18T00:03:45Z", "name": "AutoDimer", "license": null, "documentation": [{"url": "https://strbase.nist.gov//AutoDimerHomepage/RunningAutoDimer.htm", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Windows"]}