{
    "additionDate": "2019-11-14T18:32:53Z",
    "biotoolsCURIE": "biotools:C-I-TASSER",
    "biotoolsID": "C-I-TASSER",
    "confidence_flag": "tool",
    "description": "Deep-learning contact-map guided protein structure prediction in CASP13 | contact-guided protein structure prediction | C-I-TASSER (Contact-guided Iterative Threading ASSEmbly Refinement) is a composite approach that uses contact information to enhance the accuracy of protein structure and function predictions | [View example output] [Check previous jobs] [Server statistics] [Help] [Forum]",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Protein quaternary structure prediction",
                    "uri": "http://edamontology.org/operation_3350"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/C-I-TASSER/",
    "language": [
        "C"
    ],
    "lastUpdate": "2020-12-09T16:22:06Z",
    "name": "C-I-TASSER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PROT.25792",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.We report the results of two fully automated structure prediction pipelines, “Zhang-Server” and “QUARK”, in CASP13. The pipelines were built upon the C-I-TASSER and C-QUARK programs, which in turn are based on I-TASSER and QUARK but with three new modules: (a) a novel multiple sequence alignment (MSA) generation protocol to construct deep sequence-profiles for contact prediction; (b) an improved meta-method, NeBcon, which combines multiple contact predictors, including ResPRE that predicts contact-maps by coupling precision-matrices with deep residual convolutional neural-networks; and (c) an optimized contact potential to guide structure assembly simulations. For 50 CASP13 FM domains that lacked homologous templates, average TM-scores of the first models produced by C-I-TASSER and C-QUARK were 28% and 56% higher than those constructed by I-TASSER and QUARK, respectively. For the first time, contact-map predictions demonstrated usefulness on TBM domains with close homologous templates, where TM-scores of C-I-TASSER models were significantly higher than those of I-TASSER models with a P-value <.05. Detailed data analyses showed that the success of C-I-TASSER and C-QUARK was mainly due to the increased accuracy of deep-learning-based contact-maps, as well as the careful balance between sequence-based contact restraints, threading templates, and generic knowledge-based potentials. Nevertheless, challenges still remain for predicting quaternary structure of multi-domain proteins, due to the difficulties in domain partitioning and domain reassembly. In addition, contact prediction in terminal regions was often unsatisfactory due to the sparsity of MSAs. Development of new contact-based domain partitioning and assembly methods and training contact models on sparse MSAs may help address these issues.",
                "authors": [
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Pearce R."
                    },
                    {
                        "name": "Mortuza S.M."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 28,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "Deep-learning contact-map guided protein structure prediction in CASP13"
            },
            "pmcid": "PMC6851476",
            "pmid": "31365149"
        }
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}