{
    "accessibility": "Open access",
    "additionDate": "2022-07-24T22:00:09.425931Z",
    "biotoolsCURIE": "biotools:simsi-transfer",
    "biotoolsID": "simsi-transfer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bernhard Kuster",
            "orcidid": "https://orcid.org/0000-0002-9094-1677"
        },
        {
            "name": "Firas Hamood",
            "orcidid": "https://orcid.org/0000-0002-4141-7051"
        },
        {
            "name": "Matthew The",
            "orcidid": "https://orcid.org/0000-0002-5401-5553"
        }
    ],
    "description": "Software-assisted reduction of missing values in phosphoproteomic and proteomic isobaric labeling data using tandem mass spectrum clustering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Label-free quantification",
                    "uri": "http://edamontology.org/operation_3634"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "TMT-tag",
                    "uri": "http://edamontology.org/operation_3641"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kusterlab/SIMSI-Transfer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:53:32.524802Z",
    "license": "Apache-2.0",
    "name": "SIMSI-Transfer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.mcpro.2022.100238",
            "metadata": {
                "abstract": "Isobaric stable isotope labeling techniques such as tandem mass tags (TMTs) have become popular in proteomics because they enable the relative quantification of proteins with high precision from up to 18 samples in a single experiment. While missing values in peptide quantification are rare in a single TMT experiment, they rapidly increase when combining multiple TMT experiments. As the field moves toward analyzing ever higher numbers of samples, tools that reduce missing values also become more important for analyzing TMT datasets. To this end, we developed SIMSI-Transfer (Similarity-based Isobaric Mass Spectra 2 [MS2] Identification Transfer), a software tool that extends our previously developed software MaRaCluster (© Matthew The) by clustering similar tandem MS2 from multiple TMT experiments. SIMSI-Transfer is based on the assumption that similarity-clustered MS2 spectra represent the same peptide. Therefore, peptide identifications made by database searching in one TMT batch can be transferred to another TMT batch in which the same peptide was fragmented but not identified. To assess the validity of this approach, we tested SIMSI-Transfer on masked search engine identification results and recovered >80% of the masked identifications while controlling errors in the transfer procedure to below 1% false discovery rate. Applying SIMSI-Transfer to six published full proteome and phosphoproteome datasets from the Clinical Proteomic Tumor Analysis Consortium led to an increase of 26 to 45% of identified MS2 spectra with TMT quantifications. This significantly decreased the number of missing values across batches and, in turn, increased the number of peptides and proteins identified in all TMT batches by 43 to 56% and 13 to 16%, respectively.",
                "authors": [
                    {
                        "name": "Bayer F.P."
                    },
                    {
                        "name": "Hamood F."
                    },
                    {
                        "name": "Kuster B."
                    },
                    {
                        "name": "The M."
                    },
                    {
                        "name": "Wilhelm M."
                    }
                ],
                "citationCount": 10,
                "date": "2022-08-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "SIMSI-Transfer: Software-Assisted Reduction of Missing Values in Phosphoproteomic and Proteomic Isobaric Labeling Data Using Tandem Mass Spectrum Clustering"
            },
            "pmcid": "PMC9389303",
            "pmid": "35462064"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
