{
    "additionDate": "2019-11-14T19:53:49Z",
    "biotoolsCURIE": "biotools:DeepCOP",
    "biotoolsID": "DeepCOP",
    "confidence_flag": "tool",
    "description": "Deep Learning-Based Approach to Predict Gene Regulating Effects of Small Molecules | MOTIVATION:Recent advances in the areas of bioinformatics and chemogenomics are poised to accelerate the discovery of small-molecule regulators of cell development. Combining large genomics and molecular data sources with powerful deep learning techniques has the potential to revolutionize predictive biology. In this study, we present Deep Compound Profiler (DeepCOP), a deep learning based model that can predict gene regulating effects of low-molecular weight compounds. This model can be used for direct identification of a drug candidate causing a desired gene expression response, without utilizing any information on its interactions with protein target(s)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/godwinwoo/DeepCOP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T15:51:34Z",
    "license": "MIT",
    "name": "Deep gene compound profiler (DeepCOP)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ645",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Recent advances in the areas of bioinformatics and chemogenomics are poised to accelerate the discovery of small molecule regulators of cell development. Combining large genomics and molecular data sources with powerful deep learning techniques has the potential to revolutionize predictive biology. In this study, we present Deep gene COmpound Profiler (DeepCOP), a deep learning based model that can predict gene regulating effects of low-molecular weight compounds. This model can be used for direct identification of a drug candidate causing a desired gene expression response, without utilizing any information on its interactions with protein target(s). Results: In this study, we successfully combined molecular fingerprint descriptors and gene descriptors (derived from gene ontology terms) to train deep neural networks that predict differential gene regulation endpoints collected in LINCS database. We achieved 10-fold cross-validation RAUC scores of and above 0.80, as well as enrichment factors of >5. We validated our models using an external RNA-Seq dataset generated in-house that described the effect of three potent antiandrogens (with different modes of action) on gene expression in LNCaP prostate cancer cell line. The results of this pilot study demonstrate that deep learning models can effectively synergize molecular and genomic descriptors and can be used to screen for novel drug candidates with the desired effect on gene expression. We anticipate that such models can find a broad use in developing novel cancer therapeutics and can facilitate precision oncology efforts.",
                "authors": [
                    {
                        "name": "Woo G."
                    },
                    {
                        "name": "Fernandez M."
                    },
                    {
                        "name": "Hsing M."
                    },
                    {
                        "name": "Lack N.A."
                    },
                    {
                        "name": "Cavga A.D."
                    },
                    {
                        "name": "Cherkasov A."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepCOP: Deep learning-based approach to predict gene regulating effects of small molecules"
            },
            "pmid": "31504186"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}