{
    "accessibility": "Open access",
    "additionDate": "2016-02-11T12:02:14Z",
    "biotoolsCURIE": "biotools:sider",
    "biotoolsID": "sider",
    "collectionID": [
        "de.NBI"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "European Molecular Biology Laboratory (EMBL)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.embl.de/"
        },
        {
            "name": "HD-HuB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.hd-hub.de/"
        },
        {
            "name": "Michael Kuhn",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "mkuhn@embl.de",
            "name": "Michael Kuhn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Peer Bork",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ],
            "url": "https://www.embl.de/research/units/scb/bork/members/index.php?s_personId=CP-60003241"
        }
    ],
    "description": "Contains information on marketed medicines and their recorded adverse drug reactions. The information is extracted from public documents and package inserts. The available information include side effect frequency, drug and side effect classifications as well as links to further information, for example drug–target relations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sideeffects.embl.de/about/"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://sideeffects.embl.de/download/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Molecule name",
                        "uri": "http://edamontology.org/data_0984"
                    }
                },
                {
                    "data": {
                        "term": "Disease name",
                        "uri": "http://edamontology.org/data_3668"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phenotype name",
                        "uri": "http://edamontology.org/data_3275"
                    }
                }
            ]
        }
    ],
    "homepage": "http://sideeffects.embl.de/",
    "lastUpdate": "2021-05-16T13:25:38Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "SIDER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_004321"
        }
    ],
    "owner": "hdhub",
    "publication": [
        {
            "doi": "10.1093/nar/gkv1075",
            "metadata": {
                "abstract": "© The Author(s) 2015.Unwanted side effects of drugs are a burden on patients and a severe impediment in the development of new drugs. At the same time, adverse drug reactions (ADRs) recorded during clinical trials are an important source of human phenotypic data. It is therefore essential to combine data on drugs, targets and side effects into a more complete picture of the therapeutic mechanism of actions of drugs and the ways in which they cause adverse reactions. To this end, we have created the SIDER ('Side Effect Resource', http://sideeffects.embl.de) database of drugs and ADRs. The current release, SIDER 4, contains data on 1430 drugs, 5880 ADRs and 140 064 drug-ADR pairs, which is an increase of 40% compared to the previous version. For more fine-grained analyses, we extracted the frequency with which side effects occur from the package inserts. This information is available for 39% of drug-ADR pairs, 19% of which can be compared to the frequency under placebo treatment. SIDER furthermore contains a data set of drug indications, extracted from the package inserts using Natural Language Processing. These drug indications are used to reduce the rate of false positives by identifying medical terms that do not correspond to ADRs.",
                "authors": [
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 384,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The SIDER database of drugs and side effects"
            },
            "pmcid": "PMC4702794",
            "pmid": "26481350",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Copyright © 2013 EMBO and Macmillan Publishers Limited.Side effect similarities of drugs have recently been employed to predict new drug targets, and networks of side effects and targets have been used to better understand the mechanism of action of drugs. Here, we report a large-scale analysis to systematically predict and characterize proteins that cause drug side effects. We integrated phenotypic data obtained during clinical trials with known drug-target relations to identify overrepresented protein-side effect combinations. Using independent data, we confirm that most of these overrepresentations point to proteins which, when perturbed, cause side effects. Of 1428 side effects studied, 732 were predicted to be predominantly caused by individual proteins, at least 137 of them backed by existing pharmacological or phenotypic data. We prove this concept in vivo by confirming our prediction that activation of the serotonin 7 receptor (HTR7) is responsible for hyperesthesia in mice, which, in turn, can be prevented by a drug that selectively inhibits HTR7. Taken together, we show that a large fraction of complex drug side effects are mediated by individual proteins and create a reference for such relations.",
                "authors": [
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "Al Banchaabouchi M."
                    },
                    {
                        "name": "Campillos M."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Gross C."
                    },
                    {
                        "name": "Gavin A.-C."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 85,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Molecular Systems Biology",
                "title": "Systematic identification of proteins that elicit drug side effects"
            },
            "pmid": "23632385"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}