{
    "additionDate": "2017-08-03T18:52:44Z",
    "biotoolsCURIE": "biotools:nettest",
    "biotoolsID": "nettest",
    "credit": [
        {
            "email": "miguelab@uvigo.es",
            "name": "Miguel Arenas",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://darwin.uvigo.es/"
        }
    ],
    "description": "Web server for the characterization of directed or rooted reticulate networks, through their assignment to specific categories: “Tree”, “Tree-sibling”, “Tree-child”, “Galled-tree”, “Time-consistent”).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://darwin.uvigo.es/software/nettest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://darwin.uvigo.es/software/nettest/",
    "homepage_status": 1,
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/nettest-analyzing-phylogenetic-networks.html"
        }
    ],
    "name": "NetTest",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Typical evolutionary events like recombination, hybridization or gene transfer make necessary the use of phylogenetic networks to properly depict the evolution of DNA and protein sequences. Although several theoretical classes have been proposed to characterize these networks, they make stringent assumptions that will likely not be met by the evolutionary process. We have recently shown that the complexity of simulated networks is a function of the population recombination rate, and that at moderate and large recombination rates the resulting networks cannot be categorized. However, we do not know whether these results extend to networks estimated from real data.Results: We introduce a web server for the categorization of explicit phylogenetic networks, including the most relevant theoretical classes developed so far. Using this tool, we analyzed statistical parsimony phylogenetic networks estimated from ~5,000 DNA alignments, obtained from the NCBI PopSet and Polymorphix databases. The level of characterization was correlated to nucleotide diversity, and a high proportion of the networks derived from these data sets could be formally characterized.Conclusions: We have developed a public web server, NetTest (freely available from the software section at http://darwin.uvigo.es), to formally characterize the complexity of phylogenetic networks. Using NetTest we found that most statistical parsimony networks estimated with the program TCS could be assigned to a known network class. The level of network characterization was correlated to nucleotide diversity and dependent upon the intra/interspecific levels, although no significant differences were detected among genes. More research on the properties of phylogenetic networks is clearly needed. © 2010 Arenas et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Arenas M."
                    },
                    {
                        "name": "Patricio M."
                    },
                    {
                        "name": "Posada D."
                    },
                    {
                        "name": "Valiente G."
                    }
                ],
                "citationCount": 12,
                "date": "2010-05-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Characterization of phylogenetic networks with NetTest"
            },
            "pmid": "20487540"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}