{
    "additionDate": "2020-01-14T09:51:39Z",
    "biotoolsCURIE": "biotools:data-driven_materials_science",
    "biotoolsID": "data-driven_materials_science",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "patrick.rinke@aalto.fi",
            "name": "Patrick Rinke",
            "typeEntity": "Person"
        }
    ],
    "description": "Status, Challenges, and Perspectives.\n\nSpringerMaterials – properties of materials.\n\nSpringerMaterials: search, manipulate, and export data in materials science, physics, chemistry, and engineering.\n\nWe use cookies to ensure the functionality of our website, to personalize content and advertising, to provide social media features, and to analyze our traffic. If you allow us to do so, we also inform our social media, advertising and analysis partners about your use of our website. You can decide for yourself which categories you want to deny or allow. Please note that based on your settings not all functionalities of the site are available. Further information can be found in our Privacy Policy .\n\nSpringerMaterials celebrates the 2019 Nobel Prize in Chemistry winners",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://materials.springer.com",
    "lastUpdate": "2020-01-14T09:51:39Z",
    "name": "data-driven materials science",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ADVS.201900808",
            "metadata": {
                "abstract": "© 2019 The Authors. Published by WILEY-VCH Verlag GmbH & Co. KGaA, WeinheimData-driven science is heralded as a new paradigm in materials science. In this field, data is the new resource, and knowledge is extracted from materials datasets that are too big or complex for traditional human reasoning—typically with the intent to discover new or improved materials or materials phenomena. Multiple factors, including the open science movement, national funding, and progress in information technology, have fueled its development. Such related tools as materials databases, machine learning, and high-throughput methods are now established as parts of the materials research toolset. However, there are a variety of challenges that impede progress in data-driven materials science: data veracity, integration of experimental and computational data, data longevity, standardization, and the gap between industrial interests and academic efforts. In this perspective article, the historical development and current state of data-driven materials science, building from the early evolution of open science to the rapid expansion of materials data infrastructures are discussed. Key successes and challenges so far are also reviewed, providing a perspective on the future development of the field.",
                "authors": [
                    {
                        "name": "Himanen L."
                    },
                    {
                        "name": "Geurts A."
                    },
                    {
                        "name": "Foster A.S."
                    },
                    {
                        "name": "Rinke P."
                    }
                ],
                "citationCount": 23,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Advanced Science",
                "title": "Data-Driven Materials Science: Status, Challenges, and Perspectives"
            },
            "pmcid": "PMC6839624",
            "pmid": "31728276"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}