{
    "additionDate": "2021-01-18T11:31:08Z",
    "biotoolsCURIE": "biotools:natdrap",
    "biotoolsID": "natdrap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kc.w@cityu.edu.hk",
            "name": "Ka-Chun Wong",
            "typeEntity": "Person"
        },
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Xiangtao Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of pan-cancer Ras pathway activation with deep learning.\n\n##The identification of hidden responders are often the essential challenges in precision oncology.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lixt314/NatDRAP1",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T09:28:49Z",
    "name": "NatDRAP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA258",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The identification of hidden responders is often an essential challenge in precision oncology. A recent attempt based on machine learning has been proposed for classifying aberrant pathway activity from multiomic cancer data. However, we note several critical limitations there, such as high-dimensionality, data sparsity and model performance. Given the central importance and broad impact of precision oncology, we propose nature-inspired deep Ras activation pan-cancer (NatDRAP), a deep neural network (DNN) model, to address those restrictions for the identification of hidden responders. In this study, we develop the nature-inspired deep learning model that integrates bulk RNA sequencing, copy number and mutation data from PanCanAltas to detect pan-cancer Ras pathway activation. In NatDRAP, we propose to synergize the nature-inspired artificial bee colony algorithm with different gradient-based optimizers in one framework for optimizing DNNs in a collaborative manner. Multiple experiments were conducted on 33 different cancer types across PanCanAtlas. The experimental results demonstrate that the proposed NatDRAP can provide superior performance over other benchmark methods with strong robustness towards diagnosing RAS aberrant pathway activity across different cancer types. In addition, gene ontology enrichment and pathological analysis are conducted to reveal novel insights into the RAS aberrant pathway activity identification and characterization. NatDRAP is written in Python and available at https://github.com/lixt314/NatDRAP1.",
                "authors": [
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Identification of pan-cancer Ras pathway activation with deep learning"
            },
            "pmid": "33126245"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
