{
    "additionDate": "2021-01-18T09:39:24Z",
    "biotoolsCURIE": "biotools:d-peptide-builder",
    "biotoolsID": "d-peptide-builder",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Bárbara I. Díaz‐Eufracio",
            "typeEntity": "Person"
        },
        {
            "name": "José L. Medina‐Franco",
            "typeEntity": "Person"
        }
    ],
    "description": "D-Peptide Builder is a web Service to Enumerate, Analyze, and Visualize the Chemical Space of Combinatorial Peptide Libraries.\n\nPeptide-based drug discovery is re-gaining attention in drug discovery. Similarly, combinatorial chemistry continues to be a useful technique for the rapid exploration of chemical space. A current challenge, however, is the enumeration of combinatorial peptide libraries using freely accessible tools. To facilitate the swift enumeration of combinatorial peptide libraries, we introduce herein D-Peptide Builder. In the current version, the user can build up to pentapeptides, linear or cyclic, using the natural pool of 20 amino acids. The user can use non- and or N-methylated amino acids. The server also enables the rapid visualization of the chemical space of the newly enumerated peptides in comparison with other libraries relevant to drug discovery and preloaded in the server",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "http://dpeptidebuilder.quimica.unam.mx:4000/",
    "language": [
        "D"
    ],
    "lastUpdate": "2021-02-22T14:20:42Z",
    "name": "D-Peptide Builder",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/MINF.202000035",
            "metadata": {
                "abstract": "© 2020 Wiley-VCH Verlag GmbH & Co. KGaA, WeinheimPeptide-based drug discovery is re-gaining attention in drug discovery. Similarly, combinatorial chemistry continues to be a useful technique for the rapid exploration of chemical space. A current challenge, however, is the enumeration of combinatorial peptide libraries using freely accessible tools. To facilitate the swift enumeration of combinatorial peptide libraries, we introduce herein D-Peptide Builder. In the current version, the user can build up to pentapeptides, linear or cyclic, using the natural pool of 20 amino acids. The user can use non- and/or N-methylated amino acids. The server also enables the rapid visualization of the chemical space of the newly enumerated peptides in comparison with other libraries relevant to drug discovery and preloaded in the server. D-Peptide Builder is freely accessible at http://dpeptidebuilder. quimica.unam.mx:4000/. It is also accessible through the open D-Tools platform (DIFACQUIM Tools for Chemoinformatics https://www.difacquim.com/d-tools/).",
                "authors": [
                    {
                        "name": "Diaz-Eufracio B.I."
                    },
                    {
                        "name": "Palomino-Hernandez O."
                    },
                    {
                        "name": "Arredondo-Sanchez A."
                    },
                    {
                        "name": "Medina-Franco J.L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Molecular Informatics",
                "title": "D-Peptide Builder: A Web Service to Enumerate, Analyze, and Visualize the Chemical Space of Combinatorial Peptide Libraries"
            },
            "pmid": "32558380"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}