{
    "additionDate": "2021-01-18T09:13:26Z",
    "biotoolsCURIE": "biotools:anmj-morph",
    "biotoolsID": "anmj-morph",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ross.jones@ed.ac.uk",
            "name": "Ross A. Jones",
            "orcidid": "https://orcid.org/0000-0002-1569-2500",
            "typeEntity": "Person"
        }
    ],
    "description": "A simple ImageJ macro for rapid analysis of neuromuscular junction morphology.\n\nLarge-scale data analysis of synaptic morphology is becoming increasingly important to the field of neurobiological research (e.g. 'connectomics'). In particular, a detailed knowledge of neuromuscular junction (NMJ) morphology has proven to be important for understanding the form and function of synapses in both health and disease. The recent introduction of a standardized approach to the morphometric analysis of the NMJ-'NMJ-morph'-has provided the first common software platform with which to analyse and integrate NMJ data from different research laboratories. ImageJ macro language was used to encode the complete NMJ-morph workflow into seven navigation windows that generate robust data for 19 individual pre- post-synaptic variables",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://datashare.ed.ac.uk/handle/10283/3421",
    "lastUpdate": "2021-01-23T16:01:32Z",
    "license": "CC-BY-4.0",
    "name": "aNMJ-morph",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1098/RSOS.200128",
            "metadata": {
                "abstract": "© 2020 The Authors.Large-scale data analysis of synaptic morphology is becoming increasingly important to the field of neurobiological research (e.g. 'connectomics'). In particular, a detailed knowledge of neuromuscular junction (NMJ) morphology has proven to be important for understanding the form and function of synapses in both health and disease. The recent introduction of a standardized approach to the morphometric analysis of the NMJ - 'NMJ-morph' - has provided the first common software platform with which to analyse and integrate NMJ data from different research laboratories. Here, we describe the design and development of a novel macro - 'automated NMJ-morph' or 'aNMJ-morph' - to update and streamline the original NMJ-morph methodology. ImageJ macro language was used to encode the complete NMJ-morph workflow into seven navigation windows that generate robust data for 19 individual pre-/post-synaptic variables. The aNMJ-morph scripting was first validated against reference data generated by the parent workflow to confirm data reproducibility. aNMJ-morph was then compared with the parent workflow in large-scale data analysis of original NMJ images (240 NMJs) by multiple independent investigators. aNMJ-morph conferred a fourfold increase in data acquisition rate compared with the parent workflow, with average analysis times reduced to approximately 1 min per NMJ. Strong concordance was demonstrated between the two approaches for all 19morphological variables, confirming the robust nature of aNMJ-morph. aNMJ-morph is a freely available and easy-to-use macro for the rapid and robust analysis of NMJ morphology and offers significant improvements in data acquisition and learning curve compared to the original NMJ-morph workflow.",
                "authors": [
                    {
                        "name": "Alhindi A."
                    },
                    {
                        "name": "Boehm I."
                    },
                    {
                        "name": "Gibb L."
                    },
                    {
                        "name": "Gillingwater T.H."
                    },
                    {
                        "name": "Hoppen A."
                    },
                    {
                        "name": "Jones R.A."
                    },
                    {
                        "name": "Miller J."
                    },
                    {
                        "name": "Minty G."
                    },
                    {
                        "name": "Potter E."
                    },
                    {
                        "name": "Skipworth R.J.E."
                    },
                    {
                        "name": "Wagner B.C."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Royal Society Open Science",
                "title": "ANMJ-morph: A simple macro for rapid analysis of neuromuscular junction morphology"
            },
            "pmcid": "PMC7211862",
            "pmid": "32431902"
        }
    ],
    "toolType": [
        "Plug-in",
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
