{
    "additionDate": "2020-01-14T09:01:08Z",
    "biotoolsCURIE": "biotools:AIDE",
    "biotoolsID": "AIDE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jli@stat.ucla.edu",
            "name": "Wei Vivian Li",
            "orcidid": "https://orcid.org/0000-0002-2087-2709",
            "typeEntity": "Person"
        },
        {
            "email": "shihb@scu.edu.cn",
            "name": "Shan Li",
            "typeEntity": "Person"
        }
    ],
    "description": "annotation-assisted isoform discovery with high precision.\n\nAIDE: annotation-assisted isoform discovery and quantification from RNA-seq data.\n\nAIDE is a statistical method which identifies full-length mRNA isoforms from a novel perspective: using the likelihood ratio test to find novel isoforms in a stepwise manner given annotated isoforms, by prioritizing and selectively borrowing information from the annotated isoforms. Please refer to our preprint at Biorxiv for detailed description of our method",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Vivianstats/AIDE",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2020-12-01T15:49:10Z",
    "name": "AIDE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/GR.251108.119",
            "metadata": {
                "abstract": "© 2019 Li et al.Genome-wide accurate identification and quantification of full-length mRNA isoforms is crucial for investigating transcriptional and posttranscriptional regulatory mechanisms of biological phenomena. Despite continuing efforts in developing effective computational tools to identify or assemble full-length mRNA isoforms from second-generation RNA-seq data, it remains a challenge to accurately identify mRNA isoforms from short sequence reads owing to the substantial information loss in RNA-seq experiments. Here, we introduce a novel statistical method, annotation-assisted isoform discovery (AIDE), the first approach that directly controls false isoform discoveries by implementing the testing-based model selection principle. Solving the isoform discovery problem in a stepwise and conservative manner, AIDE prioritizes the annotated isoforms and precisely identifies novel isoforms whose addition significantly improves the explanation of observed RNA-seq reads. We evaluate the performance of AIDE based on multiple simulated and real RNA-seq data sets followed by PCR-Sanger sequencing validation. Our results show that AIDE effectively leverages the annotation information to compensate the information loss owing to short read lengths. AIDE achieves the highest precision in isoform discovery and the lowest error rates in isoform abundance estimation, compared with three state-of-the-art methods Cufflinks, SLIDE, and StringTie. As a robust bioinformatics tool for transcriptome analysis, AIDE enables researchers to discover novel transcripts with high confidence.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Li J.J."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Li W.V."
                    },
                    {
                        "name": "Shi H."
                    },
                    {
                        "name": "Tong X."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "AIDE: Annotation-assisted isoform discovery with high precision"
            },
            "pmcid": "PMC6886511",
            "pmid": "31694868"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
