{
    "additionDate": "2023-01-28T14:14:42.045529Z",
    "biotoolsCURIE": "biotools:glmsingle",
    "biotoolsID": "glmsingle",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jacob.samuel.prince@gmail.com",
            "name": "Jacob S Prince",
            "orcidid": "https://orcid.org/0000-0001-6169-9503",
            "typeEntity": "Person"
        }
    ],
    "description": "GLMsingle is a toolbox for obtaining accurate single-trial estimates in fMRI time-series data. We provide both MATLAB and Python implementations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cvnlab/GLMsingle",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2023-01-28T14:14:42.048090Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jacob-prince/GLMsingle_paper"
        }
    ],
    "name": "GLMsingle",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7554/ELIFE.77599",
            "metadata": {
                "abstract": "© Prince et al.Advances in artificial intelligence have inspired a paradigm shift in human neurosci-ence, yielding large-scale functional magnetic resonance imaging (fMRI) datasets that provide high-resolution brain responses to thousands of naturalistic visual stimuli. Because such experiments necessarily involve brief stimulus durations and few repetitions of each stimulus, achieving sufficient signal-to-noise ratio can be a major challenge. We address this challenge by introducing GLMsingle, a scalable, user-friendly toolbox available in MATLAB and Python that enables accurate estimation of single-trial fMRI responses (glmsingle.org). Requiring only fMRI time-series data and a design matrix as inputs, GLMsingle integrates three techniques for improving the accuracy of trial-wise general linear model (GLM) beta estimates. First, for each voxel, a custom hemodynamic response function (HRF) is identified from a library of candidate functions. Second, cross-validation is used to derive a set of noise regressors from voxels unrelated to the experiment. Third, to improve the stability of beta estimates for closely spaced trials, betas are regularized on a voxel-wise basis using ridge regression. Applying GLMsingle to the Natural Scenes Dataset and BOLD5000, we find that GLMsingle substantially improves the reliability of beta estimates across visually-responsive cortex in all subjects. Comparable improvements in reliability are also observed in a smaller-scale auditory dataset from the StudyForrest experiment. These improvements translate into tangible benefits for higher-level analyses relevant to systems and cognitive neuroscience. We demonstrate that GLMsingle: (i) helps decorrelate response estimates between trials nearby in time; (ii) enhances representational similarity between subjects within and across datasets; and (iii) boosts one-versus-many decoding of visual stimuli. GLMsingle is a publicly available tool that can significantly improve the quality of past, present, and future neuroimaging datasets sampling brain activity across many experimental conditions.",
                "authors": [
                    {
                        "name": "Charest I."
                    },
                    {
                        "name": "Kay K.N."
                    },
                    {
                        "name": "Kurzawski J.W."
                    },
                    {
                        "name": "Prince J.S."
                    },
                    {
                        "name": "Pyles J.A."
                    },
                    {
                        "name": "Tarr M.J."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "eLife",
                "title": "Improving the accuracy of single-trial fMRI response estimates using GLMsingle"
            },
            "pmcid": "PMC9708069",
            "pmid": "36444984"
        }
    ],
    "toolType": [
        "Library",
        "Script",
        "Suite"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
