{
    "additionDate": "2017-03-27T07:56:44Z",
    "biotoolsCURIE": "biotools:metacyc",
    "biotoolsID": "metacyc",
    "credit": [
        {
            "email": "biocyc-support@ai.sri.com",
            "name": "MetaCyc Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The MetaCyc database is a comprehensive resource for metabolic pathways and enzymes from all domains of life. The pathways in MetaCyc are experimentally determined, small-molecule metabolic pathways and are curated from the primary scientific literature. Pathways reactions are linked to one or more well-characterized enzymes, and both pathways and enzymes are annotated with reviews, evidence codes, and literature citations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://metacyc.org/PToolsWebsiteHowto.shtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://metacyc.org/",
    "lastUpdate": "2021-04-22T05:56:27Z",
    "name": "MetaCyc",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_007778"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The MetaCyc database (MetaCyc.org) is a comprehensive and freely accessible resource for metabolic pathways and enzymes from all domains of life. The pathways in MetaCyc are experimentally determined, small-molecule metabolic pathways and are curated from the primary scientific literature. With more than 1400 pathways, MetaCyc is the largest collection of metabolic pathways currently available. Pathways reactions are linked to one or more well-characterized enzymes, and both pathways and enzymes are annotated with reviews, evidence codes, and literature citations. BioCyc (BioCyc.org) is a collection of more than 500 organism-specific Pathway/Genome Databases (PGDBs). Each BioCyc PGDB contains the full genome and predicted metabolic network of one organism. The network, which is predicted by the Pathway Tools software using MetaCyc as a reference, consists of metabolites, enzymes, reactions and metabolic pathways. BioCyc PGDBs also contain additional features, such as predicted operons, transport systems, and pathway hole-fillers. The BioCyc Web site offers several tools for the analysis of the PGDBs, including Omics Viewers that enable visualization of omics datasets on two different genome-scale diagrams and tools for comparative analysis. The BioCyc PGDBs generated by SRI are offered for adoption by any party interested in curation of metabolic, regulatory, and genome-related information about an organism. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Altman T."
                    },
                    {
                        "name": "Caspi R."
                    },
                    {
                        "name": "Dale J.M."
                    },
                    {
                        "name": "Dreher K."
                    },
                    {
                        "name": "Fulcher C.A."
                    },
                    {
                        "name": "Gilham F."
                    },
                    {
                        "name": "Kaipa P."
                    },
                    {
                        "name": "Karp P.D."
                    },
                    {
                        "name": "Karthikeyan A.S."
                    },
                    {
                        "name": "Kothari A."
                    },
                    {
                        "name": "Krummenacker M."
                    },
                    {
                        "name": "Latendresse M."
                    },
                    {
                        "name": "Mueller L.A."
                    },
                    {
                        "name": "Paley S."
                    },
                    {
                        "name": "Popescu L."
                    },
                    {
                        "name": "Pujar A."
                    },
                    {
                        "name": "Shearer A.G."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "citationCount": 365,
                "date": "2009-10-22T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The MetaCyc database of metabolic pathways and enzymes and the BioCyc collection of pathway/genome databases"
            },
            "pmid": "19850718"
        },
        {
            "metadata": {
                "abstract": "The MetaCyc database (http://metacyc.org/) provides a comprehensive and freely accessible resource for metabolic pathways and enzymes from all domains of life. The pathways in MetaCyc are experimentally determined, small-molecule metabolic pathways and are curated from the primary scientific literature. MetaCyc contains more than 1800 pathways derived from more than 30 000 publications, and is the largest curated collection of metabolic pathways currently available. Most reactions in MetaCyc pathways are linked to one or more well-characterized enzymes, and both pathways and enzymes are annotated with reviews, evidence codes and literature citations. BioCyc (http://biocyc.org/) is a collection of more than 1700 organism-specific Pathway/Genome Databases (PGDBs). Each BioCyc PGDB contains the full genome and predicted metabolic network of one organism. The network, which is predicted by the Pathway Tools software using MetaCyc as a reference database, consists of metabolites, enzymes, reactions and metabolic pathways. BioCyc PGDBs contain additional features, including predicted operons, transport systems and pathway-hole fillers. The BioCyc website and Pathway Tools software offer many tools for querying and analysis of PGDBs, including Omics Viewers and comparative analysis. New developments include a zoomable web interface for diagrams; flux-balance analysis model generation from PGDBs; web services; and a new tool called Web Groups. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "Altman T."
                    },
                    {
                        "name": "Caspi R."
                    },
                    {
                        "name": "Dreher K."
                    },
                    {
                        "name": "Fulcher C.A."
                    },
                    {
                        "name": "Karp P.D."
                    },
                    {
                        "name": "Keseler I.M."
                    },
                    {
                        "name": "Kothari A."
                    },
                    {
                        "name": "Krummenacker M."
                    },
                    {
                        "name": "Latendresse M."
                    },
                    {
                        "name": "Mueller L.A."
                    },
                    {
                        "name": "Ong Q."
                    },
                    {
                        "name": "Paley S."
                    },
                    {
                        "name": "Pujar A."
                    },
                    {
                        "name": "Shearer A.G."
                    },
                    {
                        "name": "Subhraveti P."
                    },
                    {
                        "name": "Travers M."
                    },
                    {
                        "name": "Weerasinghe D."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "citationCount": 438,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The MetaCyc database of metabolic pathways and enzymes and the BioCyc collection of pathway/genome databases"
            },
            "pmid": "22102576"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
