{
    "additionDate": "2021-01-18T11:53:34Z",
    "biotoolsCURIE": "biotools:halcyon",
    "biotoolsID": "halcyon",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "imoto@ims.u-tokyo.ac.jp",
            "name": "Seiya Imoto",
            "typeEntity": "Person"
        }
    ],
    "description": "An Accurate Basecaller Exploiting An Encoder-Decoder Model With Monotonic Attention.\n\nHalcyon incorporates neural-network techniques frequently used in the field of machine translation, and employs monotonic-attention mechanisms to learn semantic correspondences between nucleotides and signal levels without any pre-segmentation against input signals.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "https://github.com/relastle/halcyon",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:46:20.297636Z",
    "license": "GPL-3.0",
    "name": "Halcyon",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa953",
            "metadata": {
                "abstract": "Motivation: In recent years, nanopore sequencing technology has enabled inexpensive long-read sequencing, which promises reads longer than a few thousand bases. Such long-read sequences contribute to the precise detection of structural variations and accurate haplotype phasing. However, deciphering precise DNA sequences from noisy and complicated nanopore raw signals remains a crucial demand for downstream analyses based on higher-quality nanopore sequencing, although various basecallers have been introduced to date. Results: To address this need, we developed a novel basecaller, Halcyon, that incorporates neural-network techniques frequently used in the field of machine translation. Our model employs monotonic-attention mechanisms to learn semantic correspondences between nucleotides and signal levels without any pre-segmentation against input signals. We evaluated performance with a human whole-genome sequencing dataset and demonstrated that Halcyon outperformed existing third-party basecallers and achieved competitive performance against the latest Oxford Nanopore Technologies' basecallers. Availabilityand implementation: The source code (halcyon) can be found at https://github.com/relastle/halcyon.",
                "authors": [
                    {
                        "name": "Furukawa Y."
                    },
                    {
                        "name": "Imoto S."
                    },
                    {
                        "name": "Konishi H."
                    },
                    {
                        "name": "Yamaguchi K."
                    },
                    {
                        "name": "Yamaguchi R."
                    }
                ],
                "citationCount": 16,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Halcyon: An accurate basecaller exploiting an encoder-decoder model with monotonic attention"
            },
            "pmcid": "PMC8189681",
            "pmid": "33165508"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
