{
    "additionDate": "2021-01-18T10:03:12Z",
    "biotoolsCURIE": "biotools:geo-measures",
    "biotoolsID": "geo-measures",
    "confidence_flag": "tool",
    "description": "A PyMOL plugin for protein structure ensembles analysis.\n\nThe Geo Measures Plugin can carry out geometric analysis on protein structures.In addition, it makes other trajectory analyzes such as Probability Density Function (PDF), Root Mean Square Deviation (RMSD), Radius of Gyration (RG), Free Energy Landscape (FEL), Principal Component Analysis (PCA), Ramachandran map, Root Mean Square Fluctuation (RMSF), Define Secondary Structure of Proteins (DSSP), and Modevectors. Altogether there are 14 tools, which can be easily used by the graphical interface.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                }
            ]
        }
    ],
    "homepage": "https://pymolwiki.org/index.php/Geo_Measures_Plugin",
    "language": [
        "Python",
        "PyMOL"
    ],
    "lastUpdate": "2021-01-23T09:14:41Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lkagami/geo_measures_pymol/archive/master.zip"
        }
    ],
    "name": "Geo-Measures",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2020.107322",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdAlthough molecular dynamics encompasses several applications, studies focusing on biomolecular systems are central issues of this research area. Such simulations require the generation of trajectory files, which provide a path for the analysis and interpretation of results with biological significance. However, although several programs have been developed in Python language for the analyses of molecular dynamics (MD) trajectories, they usually require some knowledge of programming languages in order to write or run the scripts using command lines, which certainly hinders the access of MD simulations to many scientists with the necessary biological background to interpret their results. To ease the access to Python packages focusing on MD trajectory analyses, we built a user-friendly and easy-to-install graphical PyMOL interface. Geo-Measures integrates the PyMOL functionalities with MDTraj, a powerful library of trajectory analyses, allowing the users to access up to 14 different types of analyses. Two sample cases are reported here to demonstrate the use of Geo-Measures. In the first example, which involves the use a MD trajectory file of hemoglobin from the MoDEL MD bank, we exemplified the analyses of the following variables: root mean square deviation, radius of gyration, free energy landscape and principal component analysis. In the second case, we built a trajectory file for the ecto-5′-nucleotidase using the LiGRO program to study the carbon alpha pincer angles, to define the secondary structure of the proteins and to analyze the Modevectors. This user-friendly graphical PyMOL plugin, which can be used to generate several descriptive analyses for protein structures, is open source and can be downloaded at: https://pymolwiki.org/index.php/Geo_Measures_Plugin.",
                "authors": [
                    {
                        "name": "Kagami L.P."
                    },
                    {
                        "name": "das Neves G.M."
                    },
                    {
                        "name": "Timmers L.F.S.M."
                    },
                    {
                        "name": "Caceres R.A."
                    },
                    {
                        "name": "Eifler-Lima V.L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "Geo-Measures: A PyMOL plugin for protein structure ensembles analysis"
            },
            "pmid": "32604028"
        }
    ],
    "toolType": [
        "Library",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}