
{
    "credit": [
        {
            "email": "anling@email.arizona.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://cals.arizona.edu/~anling/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://cals.arizona.edu/~anling/software.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/taec-an-r-package-for-taxonomic-analysis-by-elimination-and-correction.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 Sohn et al.; licensee BioMed Central Ltd. Background: Metagenomics has a great potential to discover previously unattainable information about microbial communities. An important prerequisite for such discoveries is to accurately estimate the composition of microbial communities. Most of prevalent homology-based approaches utilize solely the results of an alignment tool such as BLAST, limiting their estimation accuracy to high ranks of the taxonomy tree.Results: We developed a new homology-based approach called Taxonomic Analysis by Elimination and Correction (TAEC), which utilizes the similarity in the genomic sequence in addition to the result of an alignment tool. The proposed method is comprehensively tested on various simulated benchmark datasets of diverse complexity of microbial structure. Compared with other available methods designed for estimating taxonomic composition at a relatively low taxonomic rank, TAEC demonstrates greater accuracy in quantification of genomes in a given microbial sample. We also applied TAEC on two real metagenomic datasets, oral cavity dataset and Crohn's disease dataset. Our results, while agreeing with previous findings at higher ranks of the taxonomy tree, provide accurate estimation of taxonomic compositions at the species/strain level, narrowing down which species/strains need more attention in the study of oral cavity and the Crohn's disease.Conclusions: By taking account of the similarity in the genomic sequence TAEC outperforms other available tools in estimating taxonomic composition at a very low rank, especially when closely related species/strains exist in a metagenomic sample.",
            "authors": [
                "Sohn M.B.",
                "An L.",
                "Pookhao N.",
                "Li Q."
            ],
            "cit_count": 10,
            "journal": "BMC Bioinformatics",
            "pmid": "25027647",
            "title": "Accurate genome relative abundance estimation for closely related species in a metagenomic sample",
            "year": "2014-07-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:taec",
        "biotoolsID": "taec",
        "description": "A new homology-based approach for taxonomic analysis, utilizes the similarity in the genomic sequence in addition to the result of an alignment tool.",
        "homepage": "http://cals.arizona.edu/~anling/software.htm",
        "name": "TAEC"
    }
}