{
    "additionDate": "2018-05-20T08:34:57Z",
    "biotoolsCURIE": "biotools:phylo-node",
    "biotoolsID": "phylo-node",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/dohalloran/Phylo-Node/issues"
        }
    ],
    "description": "A molecular phylogenetic toolkit using Node.js.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/dohalloran/phylo-node"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dohalloran/phylo-node",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "MIT",
    "name": "phylo-node",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0175480",
            "metadata": {
                "abstract": "© 2017 Damien M. O'Halloran. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Node.js is an open-source and cross-platform environment that provides a JavaScript codebase for back-end server-side applications. JavaScript has been used to develop very fast and user-friendly front-end tools for bioinformatic and phylogenetic analyses. However, no such toolkits are available using Node.js to conduct comprehensive molecular phylogenetic analysis. Results To address this problem, I have developed, phylo-node, which was developed using Node. js and provides a stable and scalable toolkit that allows the user to perform diverse molecular and phylogenetic tasks. phylo-node can execute the analysis and process the resulting outputs from a suite of software options that provides tools for read processing and genome alignment, sequence retrieval, multiple sequence alignment, primer design, evolutionary modeling, and phylogeny reconstruction. Furthermore, phylo-node enables the user to deploy server dependent applications, and also provides simple integration and interoperation with other Node modules and languages using Node inheritance patterns, and a customized piping module to support the production of diverse pipelines. Conclusions phylo-node is open-source and freely available to all users without sign-up or login requirements. All source code and user guidelines are openly available at the GitHub repository: https://github.com/dohalloran/phylo-node.",
                "authors": [
                    {
                        "name": "O'Halloran D.M."
                    }
                ],
                "citationCount": 1,
                "date": "2017-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Phylo-node: A molecular phylogenetic toolkit using Node.js"
            },
            "pmcid": "PMC5391935",
            "pmid": "28410421"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}