{
    "additionDate": "2024-06-19T07:05:05.837980Z",
    "biotoolsCURIE": "biotools:mottle",
    "biotoolsID": "mottle",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Thomas.Howard@newcastle.ac.uk",
            "name": "Thomas P. Howard",
            "orcidid": "https://orcid.org/0000-0002-5546-4043",
            "typeEntity": "Person"
        }
    ],
    "description": "Accurate pairwise substitution distance at high divergence through the exploitation of short-read mappers and gradient descent.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tphoward/Mottle_Repo",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-06-19T07:05:05.840353Z",
    "license": "Apache-2.0",
    "name": "Mottle",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0298834",
            "metadata": {
                "abstract": "Current tools for estimating the substitution distance between two related sequences struggle to remain accurate at a high divergence. Difficulties at distant homologies, such as false seeding and over-alignment, create a high barrier for the development of a stable estimator. This is especially true for viral genomes, which carry a high rate of mutation, small size, and sparse taxonomy. Developing an accurate substitution distance measure would help to elucidate the relationship between highly divergent sequences, interrogate their evolutionary history, and better facilitate the discovery of new viral genomes. To tackle these problems, we propose an approach that uses short-read mappers to create whole-genome maps, and gradient descent to isolate the homologous fraction and calculate the final distance value. We implement this approach as Mottle. With the use of simulated and biological sequences, Mottle was able to remain stable to 0.66-0.96 substitutions per base pair and identify viral outgroup genomes with 95% accuracy at the family-order level. Our results indicate that Mottle performs as well as existing programs in identifying taxonomic relationships, with more accurate numerical estimation of genomic distance over greater divergences. By contrast, one limitation is a reduced numerical accuracy at low divergences, and on genomes where insertions and deletions are uncommon, when compared to alternative approaches. We propose that Mottle may therefore be of particular interest in the study of viruses, viral relationships, and notably for viral discovery platforms, helping in benchmarking of homology search tools and defining the limits of taxonomic classification methods. The code for Mottle is available at https://github.com/tphoward/Mottle_Repo.",
                "authors": [
                    {
                        "name": "Boonham N."
                    },
                    {
                        "name": "Fox A."
                    },
                    {
                        "name": "Howard T.P."
                    },
                    {
                        "name": "Prusokiene A."
                    }
                ],
                "date": "2024-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Mottle: Accurate pairwise substitution distance at high divergence through the exploitation of short-read mappers and gradient descent"
            },
            "pmcid": "PMC10956839",
            "pmid": "38512939"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
