{
    "accessibility": "Open access",
    "additionDate": "2018-07-17T13:39:28Z",
    "biotoolsCURIE": "biotools:premeta",
    "biotoolsID": "premeta",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "z.tang@vanderbilt.edu",
            "name": "Zheng-Zheng Tang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Facilitates the exchange of information between four software packages for meta-analysis of rare-variant associations: MASS, RAREMETAL, MetaSKAT, and seqMeta.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dlin.web.unc.edu/files/2015/02/documentation.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://dlin.web.unc.edu/software/premeta/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "PreMeta",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12864-017-3573-1",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Meta-analysis is essential to the discovery of rare variants that influence complex diseases and traits. Four major software packages, namely MASS, MetaSKAT, RAREMETAL, and seqMeta, have been developed to perform meta-analysis of rare-variant associations. These packages first generate summary statistics for each study and then perform the meta-analysis by combining the summary statistics. Because of incompatible file formats and non-equivalent summary statistics, the output files from the study-level analysis of one package cannot be directly used to perform meta-analysis in another package. Results: We developed a computationally efficient software program, PreMeta, to resolve the non-compatibility of the four software packages and to facilitate meta-analysis of large-scale sequencing studies in a consortium setting. PreMeta reformats the output files of study-level summary statistics generated by the four packages (text files produced by MASS and RAREMETAL, binary files produced by MetaSKAT, and R data files produced by seqMeta) and translates the summary statistics from one form to another, such that the summary statistics from any package can be used to perform meta-analysis in any other package. With this tool, consortium members are not required to use the same software for study-level analyses. In addition, PreMeta checks for allele mismatches, corrects summary statistics, and allows the rescaled inverse normal transformation to be performed at the meta-analysis stage by rescaling summary statistics. Conclusions: PreMeta processes summary statistics from the four packages to make them compatible and avoids the need to redo study-level analyses. PreMeta documentation and executable are available at: http://dlin.web.unc.edu/software/premeta.",
                "authors": [
                    {
                        "name": "Tang Z.-Z."
                    },
                    {
                        "name": "Bunn P."
                    },
                    {
                        "name": "Tao R."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Lin D.-Y."
                    }
                ],
                "citationCount": 1,
                "date": "2017-02-14T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "PreMeta: A tool to facilitate meta-analysis of rare-variant associations"
            },
            "pmcid": "PMC5310051",
            "pmid": "28196472"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}