{
    "accessibility": "Open access",
    "additionDate": "2019-05-22T07:48:53Z",
    "biotoolsCURIE": "biotools:COMMAND",
    "biotoolsID": "COMMAND",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "marco.moretto@fmach.it",
            "name": "Marco Moretto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.researchgate.net/profile/Marco_Moretto"
        }
    ],
    "description": "Web-based application used to download, collect and manage gene expression data from public databases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marcomoretto/command",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "COMMAND",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2643-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Exploring cellular responses to stimuli using extensive gene expression profiles has become a routine procedure performed on a daily basis. Raw and processed data from these studies are available on public databases but the opportunity to fully exploit such rich datasets is limited due to the large heterogeneity of data formats. In recent years, several approaches have been proposed to effectively integrate gene expression data for analysis and exploration at a broader level. Despite the different goals and approaches towards gene expression data integration, the first step is common to any proposed method: data acquisition. Although it is seemingly straightforward to extract valuable information from a set of downloaded files, things can rapidly get complicated, especially as the number of experiments grows. Transcriptomic datasets are deposited in public databases with little regard to data format and thus retrieving raw data might become a challenging task. While for RNA-seq experiments such problem is partially mitigated by the fact that raw reads are generally available on databases such as the NCBI SRA, for microarray experiments standards are not equally well established, or enforced during submission, and thus a multitude of data formats has emerged. Results: COMMAND>_ is a specialized tool meant to simplify gene expression data acquisition. It is a flexible multi-user web-application that allows users to search and download gene expression experiments, extract only the relevant information from experiment files, re-annotate microarray platforms, and present data in a simple and coherent data model for subsequent analysis. Conclusions: COMMAND>_ facilitates the creation of local datasets of gene expression data coming from both microarray and RNA-seq experiments and may be a more efficient tool to build integrated gene expression compendia. COMMAND>_ is free and open-source software, including publicly available tutorials and documentation.",
                "authors": [
                    {
                        "name": "Engelen K."
                    },
                    {
                        "name": "Moretto M."
                    },
                    {
                        "name": "Sonego P."
                    },
                    {
                        "name": "Villasenor-Altamirano A.B."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "First step toward gene expression data integration: Transcriptomic data acquisition with COMMAND>_"
            },
            "pmcid": "PMC6348648",
            "pmid": "30691411",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
