{
    "additionDate": "2019-11-14T18:04:27Z",
    "biotoolsCURIE": "biotools:scGen",
    "biotoolsID": "scGen",
    "confidence_flag": "tool",
    "description": "scGen predicts single-cell perturbation responses | Single cell perturbation prediction | Generative modeling and latent space arithmetics predict single-cell perturbation response across cell types, studies and species | This repository includes python scripts in code and notebooks in the Jupyter Notebooks folder to reproduce figures from the paper (bioRxiv, 2018) according to the table bellow | A tensorflow implementation of scGen. scGen is a generative model to predict single-cell perturbation response across cell types, studies and species (Nature Methods, 2019)  | Jupyter Notebooks/SupplFig1.ipynb | Jupyter Notebooks/SupplFig2.ipynb",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/theislab/scgen",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T09:31:34Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/theislab/scgen-reproducibility"
        }
    ],
    "name": "scGen",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41592-019-0494-8",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.Accurately modeling cellular response to perturbations is a central goal of computational biology. While such modeling has been based on statistical, mechanistic and machine learning models in specific settings, no generalization of predictions to phenomena absent from training data (out-of-sample) has yet been demonstrated. Here, we present scGen (https://github.com/theislab/scgen), a model combining variational autoencoders and latent space vector arithmetics for high-dimensional single-cell gene expression data. We show that scGen accurately models perturbation and infection response of cells across cell types, studies and species. In particular, we demonstrate that scGen learns cell-type and species-specific responses implying that it captures features that distinguish responding from non-responding genes and cells. With the upcoming availability of large-scale atlases of organs in a healthy state, we envision scGen to become a tool for experimental design through in silico screening of perturbation response in the context of disease and drug treatment.",
                "authors": [
                    {
                        "name": "Lotfollahi M."
                    },
                    {
                        "name": "Theis F.J."
                    },
                    {
                        "name": "Wolf F.A."
                    }
                ],
                "citationCount": 28,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "scGen predicts single-cell perturbation responses"
            },
            "pmid": "31363220"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
