
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRoles": [
                "Contributor"
            ]
        },
        {
            "email": "Frederique.Lisacek@isb-sib.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://mzjava.expasy.org/daily/Cookbook.html"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "MGF",
                            "uri": "http://edamontology.org/format_3651"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Loading",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Protein sequence cleavage",
                    "uri": "http://edamontology.org/operation_0366"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ms-utils",
            "Proteomics"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://ms-utils.org"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Elsevier B.V. Mass spectrometry (MS) is a widely used and evolving technique for the high-throughput identification of molecules in biological samples. The need for sharing and reuse of code among bioinformaticians working with MS data prompted the design and implementation of MzJava, an open-source Java Application Programming Interface (API) for MS related data processing. MzJava provides data structures and algorithms for representing and processing mass spectra and their associated biological molecules, such as metabolites, glycans and peptides. MzJava includes functionality to perform mass calculation, peak processing (e.g. centroiding, filtering, transforming), spectrum alignment and clustering, protein digestion, fragmentation of peptides and glycans as well as scoring functions for spectrum-spectrum and peptide/glycan-spectrum matches. For data import and export MzJava implements readers and writers for commonly used data formats. For many classes support for the Hadoop MapReduce (hadoop.apache.org) and Apache Spark (spark.apache.org) frameworks for cluster computing was implemented. The library has been developed applying best practices of software engineering. To ensure that MzJava contains code that is correct and easy to use the library's API was carefully designed and thoroughly tested. MzJava is an open-source project distributed under the AGPL v3.0 licence. MzJava requires Java 1.7 or higher. Binaries, source code and documentation can be downloaded from http://mzjava.expasy.org and https://bitbucket.org/sib-pig/mzjava.This article is part of a Special Issue entitled: Computational Proteomics.",
            "authors": [
                "Horlacher O.",
                "Nikitin F.",
                "Alocci D.",
                "Mariethoz J.",
                "Muller M.",
                "Lisacek F."
            ],
            "cit_count": 15,
            "doi": "10.1016/j.jprot.2015.06.013",
            "journal": "Journal of Proteomics",
            "title": "MzJava: An open source library for mass spectrometry data processing",
            "type": "Primary",
            "year": "2015-05-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mzjava",
        "biotoolsID": "mzjava",
        "description": "Library for the analysis of mass spectrometry data from large scale proteomics and glycomics experiments.",
        "homepage": "http://mzjava.expasy.org/",
        "name": "MzJava"
    }
}