{
    "additionDate": "2021-06-14T13:12:41Z",
    "biotoolsCURIE": "biotools:alibaseq",
    "biotoolsID": "alibaseq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aknys001@ucr.edu",
            "name": "Alexander Knyshov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/AlexKnyshov"
        }
    ],
    "description": "Alignment-based sequence extraction software (ALiBaSeq) is designed to retrieve homologous regions from a FASTA file with contigs (e.g., an NGS read assembly file). The retrieval is done based on reading BLAST, HMMER, or LASTZ search tab-delimited output tables or SAM / BAM alignment files and then searching for the results in an assembly file.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AlexKnyshov/alibaseq",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-09T12:17:45Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/AlexKnyshov/alibaseq/issues"
        }
    ],
    "name": "ALiBaSeq",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11019",
            "metadata": {
                "abstract": "Copyright 2021 Knyshov et al.Despite many bioinformatic solutions for analyzing sequencing data, few options exist for targeted sequence retrieval from whole genomic sequencing (WGS) data with the ultimate goal of generating a phylogeny. Available tools especially struggle at deep phylogenetic levels and necessitate amino-acid space searches, which may increase rates of false positive results. Many tools are also difficult to install and may lack adequate user resources. Here, we describe a program that uses freely available similarity search tools to find homologs in assembled WGS data with unparalleled freedom to modify parameters. We evaluate its performance compared to other commonly used bioinformatics tools on two divergent insect species (>200 My) for which annotated genomes exist, and on one large set each of highly conserved and more variable loci. Our software is capable of retrieving orthologs from well-curated or unannotated, low or high depth shotgun, and target capture assemblies as well or better than other software as assessed by recovering the most genes with maximal coverage and with a low rate of false positives throughout all datasets. When assessing this combination of criteria, ALiBaSeq is frequently the best evaluated tool for gathering the most comprehensive and accurate phylogenetic alignments on all types of data tested. The software (implemented in Python), tutorials, and manual are freely available at https://github.com/AlexKnyshov/alibaseq.",
                "authors": [
                    {
                        "name": "Gordon E.R.L."
                    },
                    {
                        "name": "Knyshov A."
                    },
                    {
                        "name": "Weirauch C."
                    }
                ],
                "date": "2021-03-31T00:00:00Z",
                "journal": "PeerJ",
                "title": "New alignment-based sequence extraction software (ALiBaSeq) and its utility for deep level phylogenetics"
            },
            "pmcid": "PMC8019319",
            "pmid": "33850647"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
