{
    "additionDate": "2021-01-20T10:54:32Z",
    "biotoolsCURIE": "biotools:ada-m",
    "biotoolsID": "ada-m",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ajb97@leicester.ac.uk",
            "name": "Anthony J. Brookes",
            "typeEntity": "Person"
        }
    ],
    "description": "Responsible sharing of biomedical data and biospecimens via the \"Automatable Discovery and Access Matrix\" (ADA-M).\n\nThe Automatable Discovery and Access Matrix (ADA-M) provides a standardized way to unambiguously represent the conditions related to data discovery and access. By adopting ADA-M, data custodians can generally describe what their data are (the Header section), who can access them (the Permissions section), terms related to their use (the Terms section), and special conditions (the Meta-Conditions). By doing so, data custodians can participate in data sharing and collaboration by making meta information about their data computer-readable and hence directly available for digital communication, searching and automation activities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ga4gh/ADA-M",
    "language": [
        "Ada"
    ],
    "lastUpdate": "2021-05-13T05:31:16Z",
    "license": "Apache-2.0",
    "name": "ADA-M",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41525-018-0057-4",
            "metadata": {
                "abstract": "© 2018, The Author(s).Given the data-rich nature of modern biomedical research, there is a pressing need for a systematic, structured, computer-readable way to capture, communicate, and manage sharing rules that apply to biomedical resources. This is essential for responsible recording, versioning, communication, querying, and actioning of resource sharing plans. However, lack of a common “information model” for rules and conditions that govern the sharing of materials, methods, software, data, and knowledge creates a fundamental barrier. Without this, it can be virtually impossible for Research Ethics Committees (RECs), Institutional Review Boards (IRBs), Data Access Committees (DACs), biobanks, and end users to confidently track, manage, and interpret applicable legal and ethical requirements. This raises costs and burdens of data stewardship and decreases efficient and responsible access to data, biospecimens, and other resources. To address this, the GA4GH and IRDiRC organizations sponsored the creation of the Automatable Discovery and Access Matrix (ADA-M, read simply as “Adam”). ADA-M is a comprehensive information model that provides the basis for producing structured metadata “Profiles” of regulatory conditions, thereby enabling efficient application of those conditions across regulatory spheres. Widespread use of ADA-M will aid researchers in globally searching and prescreening potential data and/or biospecimen resources for compatibility with their research plans in a responsible and efficient manner, increasing likelihood of timely DAC approvals while also significantly reducing time and effort DACs, RECs, and IRBs spend evaluating resource requests and research proposals. Extensive online documentation, software support, video guides, and an Application Programming Interface (API) for ADA-M have been made available.",
                "authors": [
                    {
                        "name": "Brookes A.J."
                    },
                    {
                        "name": "Cabili M.N."
                    },
                    {
                        "name": "Dyke S.O.M."
                    },
                    {
                        "name": "Gaff C."
                    },
                    {
                        "name": "Gibson S.J."
                    },
                    {
                        "name": "Hazard J.G."
                    },
                    {
                        "name": "Jeanson F."
                    },
                    {
                        "name": "Kirby E."
                    },
                    {
                        "name": "Knoppers B.M."
                    },
                    {
                        "name": "Ladas V."
                    },
                    {
                        "name": "Leslie J."
                    },
                    {
                        "name": "Rushton G."
                    },
                    {
                        "name": "Tasse A.-M."
                    },
                    {
                        "name": "Thorogood A."
                    },
                    {
                        "name": "Veal C.D."
                    },
                    {
                        "name": "Wilbanks J."
                    },
                    {
                        "name": "Woolley J.P."
                    }
                ],
                "citationCount": 12,
                "date": "2018-12-01T00:00:00Z",
                "journal": "npj Genomic Medicine",
                "title": "Responsible sharing of biomedical data and biospecimens via the “Automatable Discovery and Access Matrix” (ADA-M)"
            },
            "pmcid": "PMC6056554",
            "pmid": "30062047"
        }
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Data governance",
            "uri": "http://edamontology.org/topic_3571"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
