{
    "additionDate": "2017-01-17T15:05:51Z",
    "biotoolsCURIE": "biotools:cispath",
    "biotoolsID": "cispath",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "wanglk@hsc.pku.edu.cn",
            "name": "Likun Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package that uses web browsers to visualize and manage protein-protein interaction networks.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/cisPath.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/cisPath_1.14.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/cisPath.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-3.0",
    "name": "cisPath",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1752-0509-9-s1-s1",
            "metadata": {
                "abstract": "© 2015 Wang et al.Background: With the burgeoning development of cloud technology and services, there are an increasing number of users who prefer cloud to run their applications. All software and associated data are hosted on the cloud, allowing users to access them via a web browser from any computer, anywhere. This paper presents cisPath, an R/Bioconductor package deployed on cloud servers for client users to visualize, manage, and share functional protein interaction networks. Results: With this R package, users can easily integrate downloaded protein-protein interaction information from different online databases with private data to construct new and personalized interaction networks. Additional functions allow users to generate specific networks based on private databases. Since the results produced with the use of this package are in the form of web pages, cloud users can easily view and edit the network graphs via the browser, using a mouse or touch screen, without the need to download them to a local computer. This package can also be installed and run on a local desktop computer. Depending on user preference, results can be publicized or shared by uploading to a web server or cloud driver, allowing other users to directly access results via a web browser. Conclusions: This package can be installed and run on a variety of platforms. Since all network views are shown in web pages, such package is particularly useful for cloud users. The easy installation and operation is an attractive quality for R beginners and users with no previous experience with cloud services.",
                "authors": [
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Peng Z."
                    },
                    {
                        "name": "Lu D."
                    },
                    {
                        "name": "Jin Y."
                    },
                    {
                        "name": "McNutt M."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 4,
                "date": "2015-01-21T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "cisPath: An R/Bioconductor package for cloud users for visualization and management of functional protein interaction networks"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.0"
    ]
}