{
    "additionDate": "2021-01-18T09:04:35Z",
    "biotoolsCURIE": "biotools:pathwaypca",
    "biotoolsID": "pathwaypca",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lily.wangg@gmail.com",
            "name": "Lily Wang",
            "typeEntity": "Person"
        },
        {
            "email": "xi.steven.chen@gmail.com",
            "name": "Xi Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "pathwayPCA an R/Bioconductor Package for Pathway Based Integrative Analysis of Multi-Omics Data.\n\nIntegrative Pathway Analysis with Modern PCA Methodology and Gene Selection.\n\nWith the advance in high-throughput technology for molecular assays, multi-omics datasets have become increasingly available. However, most currently available pathway analysis software do not provide estimates on sample-specific pathway activities, and provide little or no functionalities for analyzing multiple types of omics data simultaneously. To address these challenges, we present pathwayPCA, a unique integrative pathway analysis software that utilizes modern statistical methodology on principal component analysis (PCA) and gene selection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://gabrielodom.github.io/pathwayPCA/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T18:29:40Z",
    "name": "pathwayPCA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/PMIC.201900409",
            "metadata": {
                "abstract": "© 2020 WILEY-VCH Verlag GmbH & Co. KGaA, WeinheimThe authors present pathwayPCA, an R/Bioconductor package for integrative pathway analysis that utilizes modern statistical methodology, including supervised and adaptive, elastic-net, sparse principal component analysis. pathwayPCA can be applied to continuous, binary, and survival outcomes in studies with multiple covariates and/or interaction effects. It outperforms several alternative methods at identifying disease-associated pathways in integrative analysis using both simulated and real datasets. In addition, several case studies are provided to illustrate pathwayPCA analysis with gene selection, estimating, and visualizing sample-specific pathway activities, identifying sex-specific pathway effects in kidney cancer, and building integrative models for predicting patient prognosis. pathwayPCA is an open-source R package, freely available through the Bioconductor repository. pathwayPCA is expected to be a useful tool for empowering the wider scientific community to analyze and interpret the wealth of available proteomics data, along with other types of molecular data recently made available by Clinical Proteomic Tumor Analysis Consortium and other large consortiums.",
                "authors": [
                    {
                        "name": "Odom G.J."
                    },
                    {
                        "name": "Ban Y."
                    },
                    {
                        "name": "Colaprico A."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Silva T.C."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Pico A.R."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Chen X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "PathwayPCA: an R/Bioconductor Package for Pathway Based Integrative Analysis of Multi-Omics Data"
            },
            "pmcid": "PMC7677175",
            "pmid": "32430990"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}