{
    "accessibility": "Open access",
    "additionDate": "2024-04-19T11:31:13.116284Z",
    "biotoolsCURIE": "biotools:lion_localizer",
    "biotoolsID": "lion_localizer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "roca@illinois.edu",
            "name": "Alfred L Roca",
            "typeEntity": "Person"
        },
        {
            "name": "Wesley C Au",
            "typeEntity": "Person"
        }
    ],
    "description": "Software tool for inferring the provenance of lions (Panthera leo) using mitochondrial DNA.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://lionlocalizer.org",
    "lastUpdate": "2024-04-19T11:31:13.118404Z",
    "name": "Lion Localizer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/JHERED/ESAD072",
            "metadata": {
                "abstract": "The illegal poaching of lions for their body parts poses a severe threat to lion populations across Africa. Poaching accounts for 35% of all human-caused lion deaths, with 51% attributed to retaliatory killings following livestock predation. In nearly half of the retaliatory killings, lion body parts are removed, suggesting that high demand for lion body parts may fuel killings attributed to human-lion conflict. Trafficked items are often confiscated in transit or destination countries far from their country of origin. DNA from lion parts may in some cases be the only available means for examining their geographic origins. In this paper, we present the Lion Localizer, a full-stack software tool that houses a comprehensive database of lion mitochondrial DNA (mtDNA) sequences sourced from previously published studies. The database covers 146 localities from across the African continent and India, providing information on the potential provenance of seized lion body parts. Lion mtDNA sequences of 350 or 1,140 bp corresponding to the cytochrome b region can be generated from lion products and queried against the Lion Localizer database. Using the query sequence, the Lion Localizer generates a listing of exact or partial matches, which are displayed on an interactive map of Africa. This allows for the rapid identification of potential regions and localities where lions have been or are presently being targeted by poachers. By examining the potential provenance of lion samples, the Lion Localizer serves as a valuable resource in the fight against lion poaching. The software is available at https://lionlocalizer.org.",
                "authors": [
                    {
                        "name": "Au W.C."
                    },
                    {
                        "name": "Dures S.G."
                    },
                    {
                        "name": "Green C.E."
                    },
                    {
                        "name": "Ishida Y."
                    },
                    {
                        "name": "Ogden R."
                    },
                    {
                        "name": "Roca A.L."
                    },
                    {
                        "name": "Zhao K."
                    }
                ],
                "date": "2024-03-01T00:00:00Z",
                "journal": "Journal of Heredity",
                "title": "Lion Localizer: A software tool for inferring the provenance of lions (Panthera leo) using mitochondrial DNA"
            },
            "pmid": "37952226"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
