{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:09:35Z",
    "biotoolsCURIE": "biotools:SEMA",
    "biotoolsID": "SEMA",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Kakajan.Komurov@cchmc.org",
            "name": "Kakajan Komurov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "> COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/gddp (RESEARCH.CCHMC.ORG) | > CORRECT NAME OF TOOL COULD ALSO BE 'CONCLUSION:SEMA' | Graphical data mining of cancer mechanisms with SEMA | SEMA is a graphical hypothesis testing platform for multidimensional cancer genomics data | SEMA is a graphical hypothesis testing platform for multidimensinoal cancer genomics data, written in R Shiny and JavaScript. SEMA uses Structural Equation Modeling (SEM) for the analyses of graphical models | Free HTML5 Template by FreeHTML5.CO | Graphical data mining from cancer genomic datasets",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://sema.research.cchmc.org/images/SEMA_Tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://sema.research.cchmc.org/",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/msolmazm/sema/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/msolmazm/sema"
        }
    ],
    "maturity": "Mature",
    "name": "SEMA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ303",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: An important goal of cancer genomics initiatives is to provide the research community with the resources for the unbiased query of cancer mechanisms. Several excellent web platforms have been developed to enable the visual analyses of molecular alterations in cancers from these datasets. However, there are few tools to allow the researchers to mine these resources for mechanisms of cancer processes and their functional interactions in an intuitive unbiased manner. Results: To address this need, we developed SEMA, a web platform for building and testing of models of cancer mechanisms from large multidimensional cancer genomics datasets. Unlike the existing tools for the analyses and query of these resources, SEMA is explicitly designed to enable exploratory and confirmatory analyses of complex cancer mechanisms through a suite of intuitive visual and statistical functionalities. Here, we present a case study of the functional mechanisms of TP53-mediated tumor suppression in various cancers, using SEMA, and identify its role in the regulation of cell cycle progression, DNA repair and signal transduction in different cancers. SEMA is a first-in-its-class web application designed to allow visual data mining and hypothesis testing from the multidimensional cancer datasets. The web application, an extensive tutorial and several video screencasts with case studies are freely available for academic use at https://sema.research.cchmc.org/. Availability and implementation: SEMA is freely available at https://sema.research.cchmc.org. The web site also contains a detailed Tutorial (also in Supplementary Information), and a link to the YouTube channel for video screencasts of analyses, including the analyses presented here. The Shiny and JavaScript source codes have been deposited to GitHub: https://github.com/msolmazm/sema. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Akmamedova O."
                    },
                    {
                        "name": "Gonen B."
                    },
                    {
                        "name": "Gunes M.H."
                    },
                    {
                        "name": "Komurov K."
                    },
                    {
                        "name": "Lane A."
                    },
                    {
                        "name": "Solmaz M."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Graphical data mining of cancer mechanisms with SEMA"
            },
            "pmid": "31070723",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
