{
    "additionDate": "2018-07-16T17:19:45Z",
    "biotoolsCURIE": "biotools:multi-dice",
    "biotoolsID": "multi-dice",
    "credit": [
        {
            "email": "XanderXue@gmail.com",
            "name": "Alexander Xue",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comparative population genomic inference under hierarchical co‐demographic models of independent single‐population size changes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/xanderxue/Multi-DICE/blob/master/Multi-DICE-1.0.2_MANUAL.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xanderxue/Multi-DICE",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-02-06T13:13:14Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/xanderxue/Multi-DICE/issues"
        }
    ],
    "name": "multi-dice",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1111/1755-0998.12686",
            "metadata": {
                "abstract": "© 2017 The Authors. Molecular Ecology Resources Published by John Wiley & Sons Ltd.Population genetic data from multiple taxa can address comparative phylogeographic questions about community-scale response to environmental shifts, and a useful strategy to this end is to employ hierarchical co-demographic models that directly test multi-taxa hypotheses within a single, unified analysis. This approach has been applied to classical phylogeographic data sets such as mitochondrial barcodes as well as reduced-genome polymorphism data sets that can yield 10,000s of SNPs, produced by emergent technologies such as RAD-seq and GBS. A strategy for the latter had been accomplished by adapting the site frequency spectrum to a novel summarization of population genomic data across multiple taxa called the aggregate site frequency spectrum (aSFS), which potentially can be deployed under various inferential frameworks including approximate Bayesian computation, random forest and composite likelihood optimization. Here, we introduce the r package multi-dice, a wrapper program that exploits existing simulation software for flexible execution of hierarchical model-based inference using the aSFS, which is derived from reduced genome data, as well as mitochondrial data. We validate several novel software features such as applying alternative inferential frameworks, enforcing a minimal threshold of time surrounding co-demographic pulses and specifying flexible hyperprior distributions. In sum, multi-dice provides comparative analysis within the familiar R environment while allowing a high degree of user customization, and will thus serve as a tool for comparative phylogeography and population genomics.",
                "authors": [
                    {
                        "name": "Xue A.T."
                    },
                    {
                        "name": "Hickerson M.J."
                    }
                ],
                "citationCount": 16,
                "date": "2017-11-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "multi-dice: r package for comparative population genomic inference under hierarchical co-demographic models of independent single-population size changes"
            },
            "pmcid": "PMC5724483",
            "pmid": "28449263"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.2"
    ]
}