{
    "additionDate": "2020-01-14T09:46:01Z",
    "biotoolsCURIE": "biotools:CASet",
    "biotoolsID": "CASet",
    "confidence_flag": "tool",
    "description": "Distance Measures for Tumor Evolutionary Trees.\n\nMOTIVATION:There has been recent increased interest in using algorithmic methods to infer the evolutionary tree underlying the developmental history of a tumor. Quantitative measures that compare such trees are vital to a number of different applications including benchmarking tree inference methods and evaluating common inheritance patterns across patients. However, few appropriate distance measures exist, and those that do have low resolution for differentiating trees or do not fully account for the complex relationship between tree topology and the inheritance of the mutations labeling that topology.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/oesperlab/stereodist/src/master/",
    "lastUpdate": "2020-12-10T13:27:01Z",
    "name": "CASet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ869",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: There has been recent increased interest in using algorithmic methods to infer the evolutionary tree underlying the developmental history of a tumor. Quantitative measures that compare such trees are vital to a number of different applications including benchmarking tree inference methods and evaluating common inheritance patterns across patients. However, few appropriate distance measures exist, and those that do have low resolution for differentiating trees or do not fully account for the complex relationship between tree topology and the inheritance of the mutations labeling that topology. Results: Here, we present two novel distance measures, Common Ancestor Set distance (CASet) and Distinctly Inherited Set Comparison distance (DISC), that are specifically designed to account for the subclonal mutation inheritance patterns characteristic of tumor evolutionary trees. We apply CASet and DISC to multiple simulated datasets and two breast cancer datasets and show that our distance measures allow for more nuanced and accurate delineation between tumor evolutionary trees than existing distance measures.",
                "authors": [
                    {
                        "name": "DInardo Z."
                    },
                    {
                        "name": "Tomlinson K."
                    },
                    {
                        "name": "Ritz A."
                    },
                    {
                        "name": "Oesper L."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Distance measures for tumor evolutionary trees"
            },
            "pmcid": "PMC7141873",
            "pmid": "31750900"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}