
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "license": "GPL-3.0",
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The Authors.Despite the fact that the velocity threshold method is widely applied, the detection of microsaccades continues to be a challenging problem, due to gaze-tracking inaccuracy and the transient nature of microsaccades. Important parameters associated with a saccadic event, e.g., saccade duration, amplitude, and maximum velocity, are sometimes imprecisely estimated, which may lead to biases in inferring the roles of microsaccades in perception and cognition. To overcome the biases and have a better detection algorithm for microsaccades, we propose a novel statistical model for the tracked gaze positions during eye fixations. In this model, we incorporate a parametrization that has been previously applied to model saccades, which allows us to veridically capture the velocity profile of saccadic eye movements. Based on our model, we derive the Neyman Pearson Detector (NPD) for saccadic events. Implemented in conjunction with the maximum likelihood estimation method, our NPD can detect a saccadic event and estimate all parameters simultaneously. Because of its adaptive nature and its statistical optimality, our NPD method was able to better detect microsaccades in some datasets when compared with a recently proposed stateof- the-art method based on convolutional neural networks. NPD also yielded comparable performance with a recently developed Bayesian algorithm, with the added benefit of modeling a more biologically veridical velocity profile of the saccade. As opposed to these algorithms, NPD can lend itself better to online saccade detection, and thus has potential for human-computer interaction applications. Our algorithm is publicly available at https://github.com/hz-zhu/NPD-microsaccade- detection.",
            "authors": [
                "Zhu H.",
                "Salcudean S.",
                "Rohling R."
            ],
            "cit_count": 0,
            "doi": "10.1167/19.13.17",
            "journal": "Journal of Vision",
            "pmid": "31752016",
            "title": "The Neyman Pearson detection of microsaccades with maximum likelihood estimation of parameters",
            "year": "2019-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:NPD",
        "biotoolsID": "NPD",
        "description": "The Neyman Pearson detection of microsaccades with maximum likelihood estimation of parameters.\n\nNeyman–Pearson Detector (NPD) for saccadic eye movements.\n\nBy default, our algorithm reads in files X.csv and Y.csv, where the X and Y coordinates of the tracked eye-gaze positions are stored in each of the csv files. Data in the X.csv and Y.csv must be square matrices of same dimensions, and each trail of the tracked eye-gaze positions forms the rows of the input file. Our algorithm can perform the NPD on each row of the dataset independently",
        "homepage": "https://github.com/hz-zhu/NPD-micro-saccade-detection",
        "name": "NPD"
    }
}