{
    "accessibility": "Open access",
    "additionDate": "2023-12-30T20:23:36.212791Z",
    "biotoolsCURIE": "biotools:otargen",
    "biotoolsID": "otargen",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "amir.feizi@omass.com",
            "name": "Amir Feizi",
            "orcidid": "https://orcid.org/0000-0003-0566-0422",
            "typeEntity": "Person"
        },
        {
            "name": "Kamalika Ray",
            "typeEntity": "Person"
        }
    ],
    "description": "GraphQL-based R package for tidy data accessing and processing from Open Targets Genetics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://amirfeizi.github.io/otargen/",
    "language": [
        "JavaScript",
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:26:47.712431Z",
    "license": "CC-BY-4.0",
    "name": "otargen",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad441",
            "metadata": {
                "abstract": "Motivation: Open Target Genetics is a comprehensive resource portal that offers variant-centric statistical evidence, enabling the prioritization of causal variants and the identification of potential drug targets. The portal uses GraphQL technology for efficient data query and provides endpoints for programmatic access for R and Python users. However, leveraging GraphQL for data retrieval can be challenging, time-consuming, and repetitive, requiring familiarity with the GraphQL query language and processing outputs in nested JSON (JavaScript Object Notation) format into tidy data tables. Therefore, developing open-source tools are required to simplify data retrieval processes to integrate valuable genetic information into data-driven target discovery pipelines seamlessly. Results: otargen is an open-source R package designed to make data retrieval and analysis from the Open Target Genetics portal as simple as possible for R users. The package offers a suite of functions covering all query types, allowing streamlined data access in a tidy table format. By executing only a single line of code, the otargen users avoid the repetitive scripting of complex GraphQL queries, including the post-processing steps. In addition, otargen contains convenient plotting functions to visualize and gain insights from complex data tables returned by several key functions.",
                "authors": [
                    {
                        "name": "Feizi A."
                    },
                    {
                        "name": "Ray K."
                    }
                ],
                "citationCount": 2,
                "date": "2023-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "otargen: GraphQL-based R package for tidy data accessing and processing from Open Targets Genetics"
            },
            "pmcid": "PMC10394122",
            "pmid": "37467069"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
