{
    "additionDate": "2015-02-16T10:07:06Z",
    "biotoolsCURIE": "biotools:imagic",
    "biotoolsID": "imagic",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Image analysis software package for electron microscopy, which is also used to process images from other devices, spectra and other multi-dimensional data-sets.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://imagescience.de/manuals.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "IMAGIC is an image analysis software package for electron microscopy, which is also used to process images from other devices, spectra and other multi-dimensional data-sets. Typical operations are: multi-dimensional mixed-radix Fourier transforms, correlation analysis, alignments, multivariate statistical classification, angular reconstitution to find the spatial orientation of EM projection images, three-dimensional reconstruction from EM projections, 2D image and 3D volume image processing.",
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://imagescience.de/imagic/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "Imagic",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1016/0304-3991(81)90001-2",
            "metadata": {
                "abstract": "IMAGIC is a general purpose, interactive image analysis software package that, in several aspects, compares favourably to other systems. The system is highly user-oriented, making simple as well as very complicated image analysis procedures available to users with no previous computer experience. Efficient organization of image files, Input/Output operations and of program structure make the system intrinsically fast. Certain problems are solved up to three times faster than in comparable systems. The software package, written in FORTRAN 77, has been applied in the field of high resolution biological electron microscopy mainly. Advanced techniques for analysis of images of single particles, including pattern recognition, are available in IMAGIC. © 1981.",
                "authors": [
                    {
                        "name": "van Heel M."
                    },
                    {
                        "name": "Keegstra W."
                    }
                ],
                "citationCount": 161,
                "date": "1981-01-01T00:00:00Z",
                "journal": "Ultramicroscopy",
                "title": "IMAGIC: A fast, flexible and friendly image analysis software system"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}