{
    "additionDate": "2020-01-09T18:13:07Z",
    "biotoolsCURIE": "biotools:EpiEstim",
    "biotoolsID": "EpiEstim",
    "confidence_flag": "tool",
    "description": "Improved inference of time-varying reproduction numbers during infectious disease outbreaks.\n\nThis web application generates an estimate of infectious disease transmissibility throughout an outbreak. The time-dependent reproduction number (R) is inferred from disease incidence time series and patient data or estimates of the serial interval.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/EpiEstim/EpiEstim.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://shiny.dide.imperial.ac.uk/epiestim",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T19:17:50Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=EpiEstim"
        }
    ],
    "name": "EpiEstim",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.EPIDEM.2019.100356",
            "metadata": {
                "abstract": "© 2019 The AuthorsAccurate estimation of the parameters characterising infectious disease transmission is vital for optimising control interventions during epidemics. A valuable metric for assessing the current threat posed by an outbreak is the time-dependent reproduction number, i.e. the expected number of secondary cases caused by each infected individual. This quantity can be estimated using data on the numbers of observed new cases at successive times during an epidemic and the distribution of the serial interval (the time between symptomatic cases in a transmission chain). Some methods for estimating the reproduction number rely on pre-existing estimates of the serial interval distribution and assume that the entire outbreak is driven by local transmission. Here we show that accurate inference of current transmissibility, and the uncertainty associated with this estimate, requires: (i) up-to-date observations of the serial interval to be included, and; (ii) cases arising from local transmission to be distinguished from those imported from elsewhere. We demonstrate how pathogen transmissibility can be inferred appropriately using datasets from outbreaks of H1N1 influenza, Ebola virus disease and Middle-East Respiratory Syndrome. We present a tool for estimating the reproduction number in real-time during infectious disease outbreaks accurately, which is available as an R software package (EpiEstim 2.2). It is also accessible as an interactive, user-friendly online interface (EpiEstim App), permitting its use by non-specialists. Our tool is easy to apply for assessing the transmission potential, and hence informing control, during future outbreaks of a wide range of invading pathogens.",
                "authors": [
                    {
                        "name": "Thompson R.N."
                    },
                    {
                        "name": "Stockwin J.E."
                    },
                    {
                        "name": "van Gaalen R.D."
                    },
                    {
                        "name": "Polonsky J.A."
                    },
                    {
                        "name": "Kamvar Z.N."
                    },
                    {
                        "name": "Demarsh P.A."
                    },
                    {
                        "name": "Dahlqwist E."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Miguel E."
                    },
                    {
                        "name": "Jombart T."
                    },
                    {
                        "name": "Lessler J."
                    },
                    {
                        "name": "Cauchemez S."
                    },
                    {
                        "name": "Cori A."
                    }
                ],
                "citationCount": 67,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Epidemics",
                "title": "Improved inference of time-varying reproduction numbers during infectious disease outbreaks"
            },
            "pmid": "31624039"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ],
    "validated": 1
}