{
    "additionDate": "2021-01-18T09:12:51Z",
    "biotoolsCURIE": "biotools:pb-net",
    "biotoolsID": "pb-net",
    "confidence_flag": "tool",
    "description": "Automatic peak integration by sequential deep learning for multiple reaction monitoring.\n\n PeakBoundaryNet: a sequential neural network for peak boundary detection and peak area integration.\n\nPredictions by sequential and reference-based PB-Nets are respectively stored in test_preds.pkl and test_preds_ref.pkl, as a list of numpy arrays representing peak start/end probabilities (in the same order as input). These predictions can also be generated through run.py, based on the pre-trained models.\n\nThe data used for test is stored in test_input.pkl as a list of peak instances, each instance is a tuple of (X, y, metainfo, sample name & peak name).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "MRM/SRM",
                    "uri": "http://edamontology.org/operation_3636"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://github.com/miaecle/PB-net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T06:39:11Z",
    "license": "GPL-3.0",
    "name": "PB-Net",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2020.103820",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Mass spectrometry (MS) based proteomics has become an indispensable component of modern molecular and cellular biochemistry analysis. Multiple reaction monitoring (MRM) is one of the most well-established MS techniques for molecule detection and quantification. Despite its wide usage, there lacks an accurate computational framework to analyze MRM data, and expert annotation is often required, especially to perform peak integration. Here we propose a deep learning method PB-Net (Peak Boundary Neural Network), built upon recent advances in sequential neural networks, for fully automatic chromatographic peak integration. To train PB-Net, we generated a large dataset of over 170,000 expert annotated peaks from MS transitions spanning a wide dynamic range, including both peptides and intact glycopeptides. Our model demonstrated outstanding performances on unseen test samples, reaching near-perfect agreement (Pearson's r 0.997) with human annotated ground truth. Systematic evaluations also show that PB-Net is substantially more robust and accurate compared to previous state-of-the-art peak integration software. PB-Net can benefit the wide community of mass spectrometry data analysis, especially in applications involving high-throughput MS experiments. Codes and test data used in this work are available at https://github.com/miaecle/PB-net. Significance: Human annotations serve an important role in accurate quantification of multiple reaction monitoring (MRM) experiments, though they are costly to collect and limit analysis throughput. In this work we proposed and developed a novel technique for the peak-integration step in MRM, based on recent innovations in sequential deep learning models. We collected in total 170,000 expert-annotated MRM peaks and trained a set of accurate and robust neural networks for the task. Results demonstrated a substantial improvement over the current state-of-the-art software for mass spectrometry analysis and comparable level of accuracy and precision as human annotators.",
                "authors": [
                    {
                        "name": "Serie D."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Xu G."
                    },
                    {
                        "name": "Zou J."
                    }
                ],
                "date": "2020-07-15T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "PB-Net: Automatic peak integration by sequential deep learning for multiple reaction monitoring"
            },
            "pmid": "32416316"
        }
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
