{
    "additionDate": "2021-01-18T11:18:00Z",
    "biotoolsCURIE": "biotools:iamy-scm",
    "biotoolsID": "iamy-scm",
    "confidence_flag": "tool",
    "description": "Improved prediction and analysis of amyloid proteins using a scoring card method with propensity scores of dipeptides.\n\nThis is the website for predicting Amyloid Proteins from the publication called ...\n\niAMY-SCM: Improved Prediction and Analysis of Amyloid Proteins Using Scoring Card Method.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://camt.pythonanywhere.com/iAMY-SCM",
    "lastUpdate": "2021-02-01T09:19:35Z",
    "name": "iAMY-SCM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.YGENO.2020.09.065",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.Fast, accurate identification and characterization of amyloid proteins at a large-scale is essential for understating their role in therapeutic intervention strategies. As a matter of fact, there exist only one in silico model for amyloid protein identification using the random forest (RF) model in conjunction with various feature types namely the RFAmy. However, it suffers from low interpretability for biologists. Thus, it is highly desirable to develop a simple and easily interpretable prediction method with robust accuracy as compared to the existing complicated model. In this study, we propose iAMY-SCM, the first scoring card method-based predictor for predicting and analyzing amyloid proteins. Herein, the iAMY-SCM made use of a simple weighted-sum function in conjunction with the propensity scores of dipeptides for the amyloid protein identification. Cross-validation results indicated that iAMY-SCM provided an accuracy of 0.895 that corresponded to 10–22% higher performance than that of widely used machine learning models. Furthermore, iAMY-SCM achieving an accuracy of 0.827 as evaluated by an independent test, which was found to be comparable to that of RFAmy and was approximately 9–13% higher than widely used machine learning models. Furthermore, the analysis of estimated propensity scores of amino acids and dipeptides were performed to provide insights into the biophysical and biochemical properties of amyloid proteins. As such, this demonstrates that the proposed iAMY-SCM is efficient and reliable in terms of simplicity, interpretability and implementation. To facilitate ease of use of the proposed iAMY-SCM, a user-friendly and publicly accessible web server at http://camt.pythonanywhere.com/iAMY-SCM has been established. We anticipate that that iAMY-SCM will be an important tool for facilitating the large-scale prediction and characterization of amyloid protein.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Kanthawong S."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Genomics",
                "title": "iAMY-SCM: Improved prediction and analysis of amyloid proteins using a scoring card method with propensity scores of dipeptides"
            },
            "pmid": "33017626"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ]
}
