{
    "additionDate": "2021-01-18T09:04:55Z",
    "biotoolsCURIE": "biotools:dbpsp",
    "biotoolsID": "dbpsp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pengdi@hust.edu.cn",
            "name": "Di Peng",
            "typeEntity": "Person"
        },
        {
            "email": "xueyu@hust.edu.cn",
            "name": "Yu Xue",
            "typeEntity": "Person"
        }
    ],
    "description": "dbPSP (database of Phosphorylation Sites in Prokaryotes) is an updated resource for annotating protein phosphorylation sites (p-sites) in prokaryotes (bacteria and archaea).",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://dbpsp.biocuckoo.cn/Download.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "http://dbpsp.biocuckoo.cn",
    "lastUpdate": "2021-02-22T15:36:52Z",
    "license": "CC-BY-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BioCUCKOO/dbPSP2.0"
        }
    ],
    "name": "dbPSP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41597-020-0506-7",
            "metadata": {
                "abstract": "© 2020, The Author(s).In prokaryotes, protein phosphorylation plays a critical role in regulating a broad spectrum of biological processes and occurs mainly on various amino acids, including serine (S), threonine (T), tyrosine (Y), arginine (R), aspartic acid (D), histidine (H) and cysteine (C) residues of protein substrates. Through literature curation and public database integration, here we reported an updated database of phosphorylation sites (p-sites) in prokaryotes (dbPSP 2.0) that contains 19,296 experimentally identified p-sites in 8,586 proteins from 200 prokaryotic organisms, which belong to 12 phyla of two kingdoms, bacteria and archaea. To carefully annotate these phosphoproteins and p-sites, we integrated the knowledge from 88 publicly available resources that covers 9 aspects, namely, taxonomy annotation, genome annotation, function annotation, transcriptional regulation, sequence and structure information, family and domain annotation, interaction, orthologous information and biological pathway. In contrast to version 1.0 (~30 MB), dbPSP 2.0 contains ~9 GB of data, with a 300-fold increased volume. We anticipate that dbPSP 2.0 can serve as a useful data resource for further investigating phosphorylation events in prokaryotes. dbPSP 2.0 is free for all users to access at: http://dbpsp.biocuckoo.cn.",
                "authors": [
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Shi Y."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "dbPSP 2.0, an updated database of protein phosphorylation sites in prokaryotes"
            },
            "note": "Version 2.0",
            "pmcid": "PMC7260176",
            "pmid": "32472030"
        },
        {
            "doi": "10.1093/database/bav031",
            "metadata": {
                "abstract": "© The Author(s) 2015. Published by Oxford University Press.As one of the most important post-translational modifications, phosphorylation is highly involved in almost all of biological processes through temporally and spatially modifying substrate proteins. Recently, phosphorylation in prokaryotes attracted much attention for its critical roles in various cellular processes such as signal transduction. Thus, an integrative data resource of the prokaryotic phosphorylation will be useful for further analysis. In this study, we presented a curated database of phosphorylation sites in prokaryotes (dbPSP, Database URL: http://dbpsp.biocuckoo.org) for 96 prokaryotic organisms, which belong to 11 phyla in two domains including bacteria and archaea. From the scientific literature, we manually collected experimentally identified phosphorylation sites on seven types of residues, including serine, threonine, tyrosine, aspartic acid, histidine, cysteine and arginine. In total, the dbPSP database contains 7391 phosphorylation sites in 3750 prokaryotic proteins. With the dataset, the sequence preferences of the phosphorylation sites and functional annotations of the phosphoproteins were analyzed, while the results shows that there were obvious differences among the phosphorylation in bacteria, archaea and eukaryotes. All the phosphorylation sites were annotated with original references and other descriptions in the database, which could be easily accessed through user-friendly website interface including various search and browse options. Taken together, the dbPSP database provides a comprehensive data resource for further studies of protein phosphorylation in prokaryotes.",
                "authors": [
                    {
                        "name": "Jian R."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Pan Z."
                    },
                    {
                        "name": "Ullah S."
                    },
                    {
                        "name": "Wang B."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 15,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Database",
                "title": "DbPSP: A curated database for protein phosphorylation sites in prokaryotes"
            },
            "pmcid": "PMC4385273",
            "pmid": "25841437"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "version": [
        "2.0"
    ]
}
