{
    "additionDate": "2020-01-14T19:36:17Z",
    "biotoolsCURIE": "biotools:ngsReports",
    "biotoolsID": "ngsReports",
    "confidence_flag": "tool",
    "description": "A Bioconductor package for managing FastQC reports and other NGS related log files.\n\nThe shiny app that accompanies the ngsReports R package",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UofABioinformaticsHub/shinyNgsreports",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-04T08:19:56Z",
    "name": "ngsReports",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ937",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: High throughput next generation sequencing (NGS) has become exceedingly cheap, facilitating studies to be undertaken containing large sample numbers. Quality control (QC) is an essential stage during analytic pipelines and the outputs of popular bioinformatics tools such as FastQC and Picard can provide information on individual samples. Although these tools provide considerable power when carrying out QC, large sample numbers can make inspection of all samples and identification of systemic bias a challenge. Results: We present ngsReports, an R package designed for the management and visualization of NGS reports from within an R environment. The available methods allow direct import into R of FastQC reports along with outputs from other tools. Visualization can be carried out across many samples using default, highly customizable plots with options to perform hierarchical clustering to quickly identify outlier libraries. Moreover, these can be displayed in an interactive shiny app or HTML report for ease of analysis.",
                "authors": [
                    {
                        "name": "Ward C.M."
                    },
                    {
                        "name": "To T.-H."
                    },
                    {
                        "name": "Pederson S.M."
                    }
                ],
                "citationCount": 9,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NgsReports: A Bioconductor package for managing FastQC reports and other NGS related log files"
            },
            "pmid": "31841127"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}