{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-29T08:40:38Z",
    "biotoolsCURIE": "biotools:INTERPRET_DSS",
    "biotoolsID": "INTERPRET_DSS",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mail.gabrmn@gmail.com",
            "name": "Biomedical Applications of Magnetic Resonance research group",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software generated to aid in MRS analysis to achieve a specific diagnosis for brain lesions.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "http://gabrmn.uab.es/sites/default/files/dss/How_to_evaluate_a_case_with_the_INTERPRET_DSS.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://gabrmn.uab.es/dss",
    "language": [
        "Java",
        "C++",
        "C"
    ],
    "lastUpdate": "2019-05-29T08:41:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "INTERPRET DSS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-581",
            "metadata": {
                "abstract": "Background: Proton Magnetic Resonance (MR) Spectroscopy (MRS) is a widely available technique for those clinical centres equipped with MR scanners. Unlike the rest of MR-based techniques, MRS yields not images but spectra of metabolites in the tissues. In pathological situations, the MRS profile changes and this has been particularly described for brain tumours. However, radiologists are frequently not familiar to the interpretation of MRS data and for this reason, the usefulness of decision-support systems (DSS) in MRS data analysis has been explored.Results: This work presents the INTERPRET DSS version 3.0, analysing the improvements made from its first release in 2002. Version 3.0 is aimed to be a program that 1st, can be easily used with any new case from any MR scanner manufacturer and 2nd, improves the initial analysis capabilities of the first version. The main improvements are an embedded database, user accounts, more diagnostic discrimination capabilities and the possibility to analyse data acquired under additional data acquisition conditions. Other improvements include a customisable graphical user interface (GUI). Most diagnostic problems included have been addressed through a pattern-recognition based approach, in which classifiers based on linear discriminant analysis (LDA) were trained and tested.Conclusions: The INTERPRET DSS 3.0 allows radiologists, medical physicists, biochemists or, generally speaking, any person with a minimum knowledge of what an MR spectrum is, to enter their own SV raw data, acquired at 1.5 T, and to analyse them. The system is expected to help in the categorisation of MR Spectra from abnormal brain masses. © 2010 Pérez-Ruiz et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Perez-Ruiz A."
                    },
                    {
                        "name": "Julia-Sape M."
                    },
                    {
                        "name": "Mercadal G."
                    },
                    {
                        "name": "Olier I."
                    },
                    {
                        "name": "Majos C."
                    },
                    {
                        "name": "Arus C."
                    }
                ],
                "citationCount": 31,
                "date": "2010-11-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The INTERPRET Decision-Support System version 3.0 for evaluation of Magnetic Resonance Spectroscopy data from human brain tumours and other abnormal brain masses"
            },
            "type": [
                "Primary"
            ],
            "version": "3.0"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "version": [
        "3.2"
    ]
}