{
    "accessibility": "Open access",
    "additionDate": "2022-06-15T09:25:55.621534Z",
    "biotoolsCURIE": "biotools:ngsml",
    "biotoolsID": "ngsml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bairong Shen"
        },
        {
            "name": "Chunjiang Yu"
        },
        {
            "name": "Wenying Yan"
        }
    ],
    "description": "A medium for the representation and exchange of NGS data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://www.sysbio.org.cn/NGSML",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-06-15T09:25:55.624066Z",
    "license": "GPL-3.0",
    "name": "NGSML",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TCBB.2022.3144170",
            "metadata": {
                "abstract": "IEEEWith the increasing demand for low-cost high-throughput sequencing of large genomes, next-generation sequencing (NGS) technology has developed rapidly. NGS can not only be used in basic scientific research but also in clinical diagnostics and healthcare. Numerous software systems and tools have been developed to analyze NGS data, and various data formats have been produced to accommodate different sequencing equipment providers or analytical software. However, the data interoperability between these tools brings great challenges to researchers. A generic format that could be shared by most of the software and tools in the NGS field would make data interoperability and sharing easier. In this paper, we defined a general XML-based NGS markup language (NGSML) format for the representation and exchange of NGS data. We also developed a user-friendly GUI tool, NGSMLEditor, for presenting, creating, editing, and converting NGSML files. By using NGSML, various types of NGS data can be saved in one unified format. Compared with the unstructured plain text file, a structured data format based on XML technology solves the incompatibility of various NGS data formats. The NGSML specifications are freely available from http://www.sysbio.org.cn/NGSML. NGSMLEditor is open source under GNU GPL and can be downloaded from the website.",
                "authors": [
                    {
                        "name": "Qi X."
                    },
                    {
                        "name": "Shen B."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Yan W."
                    },
                    {
                        "name": "Yu C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Next-generation sequencing markup language (NGSML): a medium for the representation and exchange of NGS data"
            },
            "pmid": "35085089"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
