{
    "additionDate": "2021-01-18T10:45:12Z",
    "biotoolsCURIE": "biotools:tengexa",
    "biotoolsID": "tengexa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mondaltk@yahoo.com",
            "name": "Tapan Kumar Mondal",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package based tool for tissue enrichment and gene expression analysis.\n\nTissue-Enrichment Analysis of any Number of Genes and Tissues.\n\nWhile working on transcripts such as CDS, alternative splicing, circular RNAs or lncRNAs, one can annotate them to assign some biological process or functions to relate with some specific pathway or network analysis.\n\nWhile working on transcripts such as CDS, alternative splicing, circular RNAs or lncRNAs, one can annotate them to assign some biological process or functions to relate with some specific pathway or network analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "http://webtom.cabgrid.res.in/tissue_enrich/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-26T18:16:15Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ubagithub/TEnGExA/"
        }
    ],
    "name": "TEnGExA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA221",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.RNA-seq data analysis with rapidly advancing high-throughput sequencing technology, nowadays provides large number of transcripts or genes to perform downstream analysis including functional annotation and pathway analysis. However for the data from multiple tissues, downstream analysis with tissue-specific or tissue-enriched transcripts is highly preferable. However, there is still a need of tool for quickly performing tissue-enrichment and gene expression analysis irrespective of number of input genes or tissues at various fragments per kilobase of transcript per million fragments mapped (FPKM) thresholds. To fulfill this need, we presented a freely available R package and web-interface tool, TEnGExA, which allows tissue-enrichment analysis (TEA) for any number of genes or transcripts for any species provided only a read-count or FPKM-value matrix as input. Based on the different FPKM value and fold thresholds, TEnGExA classifies the user provided gene lists into tissue-enriched or tissue-specific transcripts along with other standard classes. By analyzing the published sample data from human, plant and microorganism, we signifies that TEnGExA can easily handle complex or large data from any species to provided tissue-enriched gene list for downstream analysis in quick time. In summary, TEnGExA is quick, easy to use and an efficient tool for TEA. The R package is freely available at https://github.com/ubagithub/TEnGExA/ and the GUI web interface is accessible at http://webtom.cabgrid.res.in/tissue_enrich/.",
                "authors": [
                    {
                        "name": "Rawal H.C."
                    },
                    {
                        "name": "Angadi U."
                    },
                    {
                        "name": "Mondal T.K."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "TEnGExA: an R package based tool for tissue enrichment and gene expression analysis"
            },
            "pmid": "32960209"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}