{
    "additionDate": "2021-01-18T09:05:55Z",
    "biotoolsCURIE": "biotools:deepseg",
    "biotoolsID": "deepseg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Ramy.Zeineldin@Reutlingen-University.DE",
            "name": "Ramy A. Zeineldin",
            "orcidid": "https://orcid.org/0000-0002-8630-9046",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepSeg: is deep neural network framework for automatic brain tumor segmentation using magnetic resonance FLAIR Images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/razeineldin/DeepSeg/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T15:10:06Z",
    "license": "MIT",
    "name": "DeepSeg",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S11548-020-02186-Z",
            "metadata": {
                "abstract": "© 2020, The Author(s).Purpose: Gliomas are the most common and aggressive type of brain tumors due to their infiltrative nature and rapid progression. The process of distinguishing tumor boundaries from healthy cells is still a challenging task in the clinical routine. Fluid-attenuated inversion recovery (FLAIR) MRI modality can provide the physician with information about tumor infiltration. Therefore, this paper proposes a new generic deep learning architecture, namely DeepSeg, for fully automated detection and segmentation of the brain lesion using FLAIR MRI data. Methods: The developed DeepSeg is a modular decoupling framework. It consists of two connected core parts based on an encoding and decoding relationship. The encoder part is a convolutional neural network (CNN) responsible for spatial information extraction. The resulting semantic map is inserted into the decoder part to get the full-resolution probability map. Based on modified U-Net architecture, different CNN models such as residual neural network (ResNet), dense convolutional network (DenseNet), and NASNet have been utilized in this study. Results: The proposed deep learning architectures have been successfully tested and evaluated on-line based on MRI datasets of brain tumor segmentation (BraTS 2019) challenge, including s336 cases as training data and 125 cases for validation data. The dice and Hausdorff distance scores of obtained segmentation results are about 0.81 to 0.84 and 9.8 to 19.7 correspondingly. Conclusion: This study showed successful feasibility and comparative performance of applying different deep learning models in a new DeepSeg framework for automated brain tumor segmentation in FLAIR MR images. The proposed DeepSeg is open source and freely available at https://github.com/razeineldin/DeepSeg/.",
                "authors": [
                    {
                        "name": "Zeineldin R.A."
                    },
                    {
                        "name": "Karar M.E."
                    },
                    {
                        "name": "Coburger J."
                    },
                    {
                        "name": "Wirtz C.R."
                    },
                    {
                        "name": "Burgert O."
                    }
                ],
                "citationCount": 18,
                "date": "2020-06-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "DeepSeg: deep neural network framework for automatic brain tumor segmentation using magnetic resonance FLAIR images"
            },
            "pmcid": "PMC7303084",
            "pmid": "32372386"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}