{"credit":[{"email":"christoph.grunau@methdb.de","name":"christoph.grunau@methdb.de","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Methylation analysis","uri":"http://edamontology.org/operation_3204"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Epigenetics","uri":"http://edamontology.org/topic_3295"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Methylated DNA immunoprecipitation","uri":"http://edamontology.org/topic_3674"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"Methylation of cytosine in the 5 position of the pyrimidine ring is a major modification of the DNA in most organisms. In eukaryotes, the distribution and number of 5-methylcytosines (5mC) along the DNA is heritable but can also change with the developmental state of the cell and as a response to modifications of the environment. While DNA methylation probably has a number of functions, scientific interest has recently focused on the gene silencing effect methylation can have in eukaryotic cells. In particular, the discovery of changes in the methylation level during cancer development has increased the interest in this field. In the past, a vast amount of data has been generated with different levels of resolution ranging from 5mC content of total DNA to the methylation status of single nucleotides. We present here a database for DNA methylation data that attempts to unify these results in a common resource. The database is accessible via WWW (http://www.methdb.de). It stores information about the origin of the investigated sample and the experimental procedure, and contains the DNA methylation data. Query masks allow for searching for 5mC content, species, tissue, gene, sex, phenotype, sequence ID and DNA type. The output lists all available information including the relative gene expression level. DNA methylation patterns and methylation profiles are shown both as a graphical representation and as G/A/T/C/5mC-sequences or tables with sequence positions and methylation levels, respectively.","authors":["Grunau C.","Renault E.","Rosenthal A.","Roizes G."],"cit_count":60,"journal":"Nucleic Acids Research","pmid":"11125109","title":"MethDB - A public database for DNA methylation data","year":"2001-01-01"}],"summary":{"biotoolsCURIE":"biotools:methdb","biotoolsID":"methdb","description":"The database contains information about the occurrence of methylated cytosines in the DNA.","homepage":"http://www.methdb.de/","name":"DNA Methylation Database"}}