{
    "accessibility": "Open access",
    "additionDate": "2024-01-01T22:43:15.359554Z",
    "biotoolsCURIE": "biotools:mvmapit",
    "biotoolsID": "mvmapit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "julian_stamp@brown.edu",
            "name": "Julian Stamp",
            "typeEntity": "Person"
        },
        {
            "email": "lcrawford@microsoft.com",
            "name": "Lorin Crawford",
            "typeEntity": "Person"
        }
    ],
    "description": "Leveraging the genetic correlation between traits to detect epistasis in genome-wide association studies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lcrawlab/mvMAPIT",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:26:10.358575Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://lcrawlab.github.io/mvMAPIT/"
        }
    ],
    "name": "mvMAPIT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/g3journal/jkad118",
            "metadata": {
                "abstract": "Epistasis, commonly defined as the interaction between genetic loci, is known to play an important role in the phenotypic variation of complex traits. As a result, many statistical methods have been developed to identify genetic variants that are involved in epistasis, and nearly all of these approaches carry out this task by focusing on analyzing one trait at a time. Previous studies have shown that jointly modeling multiple phenotypes can often dramatically increase statistical power for association mapping. In this study, we present the “multivariate MArginal ePIstasis Test” (mvMAPIT)—a multioutcome generalization of a recently proposed epistatic detection method which seeks to detect marginal epistasis or the combined pairwise interaction effects between a given variant and all other variants. By searching for marginal epistatic effects, one can identify genetic variants that are involved in epistasis without the need to identify the exact partners with which the variants interact—thus, potentially alleviating much of the statistical and computational burden associated with conventional explicit search-based methods. Our proposed mvMAPIT builds upon this strategy by taking advantage of correlation structure between traits to improve the identification of variants involved in epistasis. We formulate mvMAPIT as a multivariate linear mixed model and develop a multitrait variance component estimation algorithm for efficient parameter inference and P-value computation. Together with reasonable model approximations, our proposed approach is scalable to moderately sized genome-wide association studies. With simulations, we illustrate the benefits of mvMAPIT over univariate (or single-trait) epistatic mapping strategies. We also apply mvMAPIT framework to protein sequence data from two broadly neutralizing anti-influenza antibodies and approximately 2,000 heterogeneous stock of mice from the Wellcome Trust Centre for Human Genetics. The mvMAPIT R package can be downloaded at https://github.com/lcrawlab/mvMAPIT.",
                "authors": [
                    {
                        "name": "Crawford L."
                    },
                    {
                        "name": "DenAdel A."
                    },
                    {
                        "name": "Stamp J."
                    },
                    {
                        "name": "Weinreich D."
                    }
                ],
                "citationCount": 4,
                "date": "2023-08-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "Leveraging the genetic correlation between traits improves the detection of epistasis in genome-wide association studies"
            },
            "pmcid": "PMC10484060",
            "pmid": "37243672"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Epistasis",
            "uri": "http://edamontology.org/topic_3974"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
