{
    "accessibility": "Open access",
    "additionDate": "2022-09-02T18:31:28.907929Z",
    "biotoolsCURIE": "biotools:boss",
    "biotoolsID": "boss",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leslie.smith@nrl.navy.mil",
            "name": "Leslie N. Smith",
            "typeEntity": "Person"
        },
        {
            "name": "Adam Conovaloff"
        }
    ],
    "description": "Building one-shot semi-supervised (BOSS) learning on CIFAR-10 and SVHN up to attain test accuracies that are comparable to fully supervised learning.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/lnsmith54/BOSS",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-09-02T18:31:28.910621Z",
    "license": "Other",
    "name": "BOSS",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FRAI.2022.880729",
            "metadata": {
                "abstract": "Copyright © 2022 Smith and Conovaloff.Reaching the performance of fully supervised learning with unlabeled data and only labeling one sample per class might be ideal for deep learning applications. We demonstrate for the first time the potential for building one-shot semi-supervised (BOSS) learning on CIFAR-10 and SVHN up to attain test accuracies that are comparable to fully supervised learning. Our method combines class prototype refining, class balancing, and self-training. A good prototype choice is essential and we propose a technique for obtaining iconic examples. In addition, we demonstrate that class balancing methods substantially improve accuracy results in semi-supervised learning to levels that allow self-training to reach the level of fully supervised learning performance. Our experiments demonstrate the value with computing and analyzing test accuracies for every class, rather than only a total test accuracy. We show that our BOSS methodology can obtain total test accuracies with CIFAR-10 images and only one labeled sample per class up to 95% (compared to 94.5% for fully supervised). Similarly, the SVHN images obtains test accuracies of 97.8%, compared to 98.27% for fully supervised. Rigorous empirical evaluations provide evidence that labeling large datasets is not necessary for training deep neural networks. Our code is available at https://github.com/lnsmith54/BOSS to facilitate replication.",
                "authors": [
                    {
                        "name": "Conovaloff A."
                    },
                    {
                        "name": "Smith L.N."
                    }
                ],
                "date": "2022-06-02T00:00:00Z",
                "journal": "Frontiers in Artificial Intelligence",
                "title": "Building One-Shot Semi-Supervised (BOSS) Learning Up to Fully Supervised Performance"
            },
            "pmcid": "PMC9200967",
            "pmid": "35719691"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
