{
    "additionDate": "2018-08-26T10:06:41Z",
    "biotoolsCURIE": "biotools:opera-qsar",
    "biotoolsID": "opera-qsar",
    "credit": [
        {
            "email": "mansourikamel@gmail.com",
            "name": "Kamel Mansouri",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Command line application providing QSAR models predictions as well as applicability domain and accuracy assessment for physicochemical properties and environmental fate endpoints.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/kmansouri/OPERA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kmansouri/OPERA",
    "language": [
        "MATLAB",
        "C++",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "MIT",
    "name": "OPERA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-018-0263-1",
            "metadata": {
                "abstract": "© 2018, The Author(s).The collection of chemical structure information and associated experimental data for quantitative structure–activity/property relationship (QSAR/QSPR) modeling is facilitated by an increasing number of public databases containing large amounts of useful data. However, the performance of QSAR models highly depends on the quality of the data and modeling methodology used. This study aims to develop robust QSAR/QSPR models for chemical properties of environmental interest that can be used for regulatory purposes. This study primarily uses data from the publicly available PHYSPROP database consisting of a set of 13 common physicochemical and environmental fate properties. These datasets have undergone extensive curation using an automated workflow to select only high-quality data, and the chemical structures were standardized prior to calculation of the molecular descriptors. The modeling procedure was developed based on the five Organization for Economic Cooperation and Development (OECD) principles for QSAR models. A weighted k-nearest neighbor approach was adopted using a minimum number of required descriptors calculated using PaDEL, an open-source software. The genetic algorithms selected only the most pertinent and mechanistically interpretable descriptors (2–15, with an average of 11 descriptors). The sizes of the modeled datasets varied from 150 chemicals for biodegradability half-life to 14,050 chemicals for logP, with an average of 3222 chemicals across all endpoints. The optimal models were built on randomly selected training sets (75%) and validated using fivefold cross-validation (CV) and test sets (25%). The CV Q2 of the models varied from 0.72 to 0.95, with an average of 0.86 and an R2 test value from 0.71 to 0.96, with an average of 0.82. Modeling and performance details are described in QSAR model reporting format and were validated by the European Commission’s Joint Research Center to be OECD compliant. All models are freely available as an open-source, command-line application called OPEn structure–activity/property Relationship App (OPERA). OPERA models were applied to more than 750,000 chemicals to produce freely available predicted data on the U.S. Environmental Protection Agency’s CompTox Chemistry Dashboard.[Figure not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Mansouri K."
                    },
                    {
                        "name": "Grulke C.M."
                    },
                    {
                        "name": "Judson R.S."
                    },
                    {
                        "name": "Williams A.J."
                    }
                ],
                "citationCount": 69,
                "date": "2018-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "OPERA models for predicting physicochemical properties and environmental fate endpoints"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Synthetic chemistry",
            "uri": "http://edamontology.org/topic_3371"
        }
    ],
    "validated": 1
}