
{
    "credit": [
        {
            "email": "bingshan.li@vanderbilt.edu",
            "name": "Bingshan Li",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.vumc.org/cgg/contact"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://genome.sph.umich.edu/wiki/GTDT#Introduction"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            },
            {
                "term": "Human genetics",
                "uri": "http://edamontology.org/topic_3574"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gtdt-0-01-a-group-wise-tdt-for-haplotype-based-association-testing-of-rare-variants-with-complex-disease.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author. Published by Oxford University Press. Motivation: A major focus of current sequencing studies for human genetics is to identify rare variants associated with complex diseases. Aside from reduced power of detecting associated rare variants, controlling for population stratification is particularly challenging for rare variants. Transmission/disequilibrium tests (TDT) based on family designs are robust to population stratification and admixture, and therefore provide an effective approach to rare variant association studies to eliminate spurious associations. To increase power of rare variant association analysis, gene-based collapsing methods become standard approaches for analyzing rare variants. Existing methods that extend this strategy to rare variants in families usually combine TDT statistics at individual variants and therefore lack the flexibility of incorporating other genetic models. Results: In this study, we describe a haplotype-based framework for group-wise TDT (gTDT) that is flexible to encompass a variety of genetic models such as additive, dominant and compound heterozygous (CH) (i.e. recessive) models as well as other complex interactions. Unlike existing methods, gTDT constructs haplotypes by transmission when possible and inherently takes into account the linkage disequilibrium among variants. Through extensive simulations we showed that type I error was correctly controlled for rare variants under all models investigated, and this remained true in the presence of population stratification. Under a variety of genetic models, gTDT showed increased power compared with the single marker TDT. Application of gTDT to an autism exome sequencing data of 118 trios identified potentially interesting candidate genes with CH rare variants.",
            "authors": [
                "Chen R.",
                "Wei Q.",
                "Zhan X.",
                "Zhong X.",
                "Sutcliffe J.S.",
                "Cox N.J.",
                "Cook E.H.",
                "Li C.",
                "Chen W.",
                "Li B."
            ],
            "cit_count": 6,
            "journal": "Bioinformatics",
            "pmid": "25568282",
            "title": "A haplotype-based framework for group-wise transmission/disequilibrium tests for rare variant association analysis",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gtdt",
        "biotoolsID": "gtdt",
        "description": "Implemented gene-based or group-wise TDT for rare variant aggregation analysis. Currently gTDT implemented haplotype-based tests for 6 models, M1-M6. It takes as input a ped file and a dat file that specify the relationships, and a VCF file that stores genotype data.",
        "homepage": "http://genome.sph.umich.edu/wiki/GTDT",
        "name": "gTDT"
    }
}