{
    "additionDate": "2021-01-18T11:10:10Z",
    "biotoolsCURIE": "biotools:pygna",
    "biotoolsID": "pygna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "giovanni.stracquadanio@ed.ac.uk",
            "name": "Giovanni Stracquadanio",
            "orcidid": "https://orcid.org/0000-0001-9819-3645",
            "typeEntity": "Person"
        }
    ],
    "description": "PyGNA is a framework for statistical network analysis of high-throughput experiments. It can be used both as a standalone command line application or it can be used as API to develop custom analyses.\n\nA simple Snakemake workflow to perform network analyses using the Python Geneset Network Analysis (PyGNA) package.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://github.com/stracquadaniolab/pygna",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T15:22:09Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/stracquadaniolab/workflow-pygna"
        }
    ],
    "name": "PyGNA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03801-1",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Gene and protein interaction experiments provide unique opportunities to study the molecular wiring of a cell. Integrating high-throughput functional genomics data with this information can help identifying networks associated with complex diseases and phenotypes. Results: Here we introduce an integrated statistical framework to test network properties of single and multiple genesets under different interaction models. We implemented this framework as an open-source software, called Python Geneset Network Analysis (PyGNA). Our software is designed for easy integration into existing analysis pipelines and to generate high quality figures and reports. We also developed PyGNA to take advantage of multi-core systems to generate calibrated null distributions on large datasets. We then present the results of extensive benchmarking of the tests implemented in PyGNA and a use case inspired by RNA sequencing data analysis, showing how PyGNA can be easily integrated to study biological networks. PyGNA is available at http://github.com/stracquadaniolab/pygna and can be easily installed using the PyPi or Anaconda package managers, and Docker. Conclusions: We present a tool for network-aware geneset analysis. PyGNA can either be readily used and easily integrated into existing high-performance data analysis pipelines or as a Python package to implement new tests and analyses. With the increasing availability of population-scale omic data, PyGNA provides a viable approach for large scale geneset network analysis.",
                "authors": [
                    {
                        "name": "Cassano F."
                    },
                    {
                        "name": "Fanfani V."
                    },
                    {
                        "name": "Stracquadanio G."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PyGNA: a unified framework for geneset network analysis"
            },
            "pmcid": "PMC7579948",
            "pmid": "33092528"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
