{
    "additionDate": "2019-11-14T18:11:28Z",
    "biotoolsCURIE": "biotools:VOLARE",
    "biotoolsID": "VOLARE",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jsiebert@cytoanalytics.com",
            "name": "Janet C. Siebert",
            "orcidid": "https://orcid.org/0000-0001-8505-9359",
            "typeEntity": "Person"
        }
    ],
    "description": "visual analysis of disease-associated microbiome-immune system interplay | Visualization of Linear Regression Elements | Visualization of linear regression elements comparing microbiome and immune system readouts",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://aasix.cytoanalytics.com/volare/",
    "lastUpdate": "2019-11-14T18:11:28Z",
    "name": "VOLARE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3021-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Relationships between specific microbes and proper immune system development, composition, and function have been reported in a number of studies. However, researchers have discovered only a fraction of the likely relationships. \"Omic\" methodologies such as 16S ribosomal RNA (rRNA) sequencing and time-of-flight mass cytometry (CyTOF) immunophenotyping generate data that support generation of hypotheses, with the potential to identify additional relationships at a level of granularity ripe for further experimentation. Pairwise linear regressions between microbial and host immune features provide one approach for quantifying relationships between \"omes\", and the differences in these relationships across study cohorts or arms. This approach yields a top table of candidate results. However, the top table alone lacks the detail that domain experts such as microbiologists and immunologists need to vet candidate results for follow-up experiments. Results: To support this vetting, we developed VOLARE (Visualization Of LineAr Regression Elements), a web application that integrates a searchable top table, small in-line graphs illustrating the fitted models, a network summarizing the top table, and on-demand detailed regression plots showing full sample-level detail. We applied VOLARE to three case studies - microbiome:cytokine data from fecal samples in human immunodeficiency virus (HIV), microbiome:cytokine data in inflammatory bowel disease and spondyloarthritis, and microbiome:immune cell data from gut biopsies in HIV. We present both patient-specific phenomena and relationships that differ by disease state. We also analyzed interaction data from system logs to characterize usage scenarios. This log analysis revealed that users frequently generated detailed regression plots, suggesting that this detail aids the vetting of results. Conclusions: Systematically integrating microbe:immune cell readouts through pairwise linear regressions and presenting the top table in an interactive environment supports the vetting of results for scientific relevance. VOLARE allows domain experts to control the analysis of their results, screening dozens of candidate relationships with ease. This interactive environment transcends the limitations of a static top table.",
                "authors": [
                    {
                        "name": "Siebert J.C."
                    },
                    {
                        "name": "Neff C.P."
                    },
                    {
                        "name": "Schneider J.M."
                    },
                    {
                        "name": "Regner E.H."
                    },
                    {
                        "name": "Ohri N."
                    },
                    {
                        "name": "Kuhn K.A."
                    },
                    {
                        "name": "Palmer B.E."
                    },
                    {
                        "name": "Lozupone C.A."
                    },
                    {
                        "name": "Gorg C."
                    }
                ],
                "date": "2019-08-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VOLARE: Visual analysis of disease-associated microbiome-immune system interplay"
            },
            "pmcid": "PMC6701114",
            "pmid": "31429723"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}