{
    "name": "iMISS", 
    "description": "Package for integrative missing value estimation of microarray data sets with limited number of samples, high level of noise, or high rate of missing values. iMISS works by incorporating information from multiple reference microarray datasets to screen reliable neighbor genes used in basic local estimation algorithms such as the Local Least Squares (LLS) algorithm. In addition to the integrative algorithms, implementations of KNN and LLS based imputation algorithms are also provided.", 
    "homepage": "http://zhoulab.usc.edu/iMISS/", 
    "biotoolsID": "iMISS", 
    "biotoolsCURIE": "biotools:iMISS", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Gene expression analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3518", 
            "term": "Microarray experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_3572", 
            "term": "Data quality management"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/imiss-1-0-integrative-missing-estimation-microarray-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://zhoulab.usc.edu/iMISS/", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-449", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Integrative missing value estimation for microarray data", 
                "abstract": "Background: Missing value estimation is an important preprocessing step in microarray analysis. Although several methods have been developed to solve this problem, their performance is unsatisfactory for datasets with high rates of missing data, high measurement noise, or limited numbers of samples. In fact, more than 80% of the time-series datasets in Stanford Microarray Database contain less than eight samples. Results: We present the integrative Missing Value Estimation method (iMISS) by incorporating information from multiple reference microarray datasets to improve missing value estimation. For each gene with missing data, we derive a consistent neighbor-gene list by taking reference data sets into consideration. To determine whether the given reference data sets are sufficiently informative for integration, we use a submatrix imputation approach. Our experiments showed that iMISS can significantly and consistently improve the accuracy of the state-of-the-art Local Least Square (LLS) imputation algorithm by up to 15% improvement in our benchmark tests. Conclusion: We demonstrated that the order-statistics-based integrative imputation algorithms can achieve significant improvements over the state-of-the-art missing value estimation approaches such as LLS and is especially good for imputing microarray datasets with a limited number of samples, high rates of missing data, or very noisy measurements. With the rapid accumulaition of microarray datasets, the performance of our approach can be further improved by incorporating larger and more appropriate reference datasets. © 2006 Hu et al; licensee BioMed Central Ltd.", 
                "date": "2006-10-12T00:00:00Z", 
                "citationCount": 24, 
                "authors": [
                    {
                        "name": "Hu J."
                    }, 
                    {
                        "name": "Li H."
                    }, 
                    {
                        "name": "Waterman M.S."
                    }, 
                    {
                        "name": "Zhou X.J."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://zhoulab.usc.edu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:14:58Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}