{
    "accessibility": "Open access",
    "additionDate": "2023-02-28T19:58:12.318455Z",
    "biotoolsCURIE": "biotools:4dr-gan",
    "biotoolsID": "4dr-gan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Lingkun Gu"
        },
        {
            "name": "Mei Yang"
        },
        {
            "name": "Mo Weng"
        },
        {
            "name": "Yingtao Jiang"
        },
        {
            "name": "Yang Jiao",
            "orcidid": "http://orcid.org/0000-0002-6390-2517"
        }
    ],
    "description": "Digitally Predicting Protein Localization and Manipulating Protein Activity in Fluorescence Images Using Four-dimensional Reslicing GAN.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YangJiaoUSA/4DR-GAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-28T19:58:12.321100Z",
    "license": "MIT",
    "name": "4DR-GAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac719",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.MOTIVATION: While multi-channel fluorescence microscopy is a vital imaging method in biological studies, the number of channels that can be imaged simultaneously is limited by technical and hardware limitations such as emission spectra cross-talk. One solution is using deep neural networks to model the localization relationship between two proteins so that the localization of one protein can be digitally predicted. Furthermore, the input and predicted localization implicitly reflect the modeled relationship. Accordingly, observing the response of the prediction via manipulating input localization could provide an informative way to analyze the modeled relationships between the input and the predicted proteins. RESULTS: We propose a protein localization prediction (PLP) method using a cGAN named 4D Reslicing Generative Adversarial Network (4DR-GAN) to digitally generate additional channels. 4DR-GAN models the joint probability distribution of input and output proteins by simultaneously incorporating the protein localization signals in four dimensions including space and time. Because protein localization often correlates with protein activation state, based on accurate PLP, we further propose two novel tools: digital activation (DA) and digital inactivation (DI) to digitally activate and inactivate a protein, in order to observing the response of the predicted protein localization. Compared with genetic approaches, these tools allow precise spatial and temporal control. A comprehensive experiment on six pairs of proteins shows that 4DR-GAN achieves higher-quality PLP than Pix2Pix, and the DA and DI responses are consistent with the known protein functions. The proposed PLP method helps simultaneously visualize additional proteins, and the developed DA and DI tools provide guidance to study localization-based protein functions. AVAILABILITY AND IMPLEMENTATION: The open-source code is available at https://github.com/YangJiaoUSA/4DR-GAN. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Gu L."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Jiao Y."
                    },
                    {
                        "name": "Weng M."
                    },
                    {
                        "name": "Yang M."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Digitally predicting protein localization and manipulating protein activity in fluorescence images using 4D reslicing GAN"
            },
            "pmcid": "PMC9805574",
            "pmid": "36373962"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
