
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                },
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Protein expression",
                "uri": "http://edamontology.org/topic_0108"
            },
            {
                "term": "Physics",
                "uri": "http://edamontology.org/topic_3318"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Copyright © 2019 American Chemical Society.The second virial coefficient, B2, measures a protein solution's deviation from ideal behavior. It is widely used to predict or explain solubility, crystallization condition, aggregation propensity, and critical temperature for liquid-liquid phase separation. B2 is determined by the interaction energy between two protein molecules and, specifically, by the integration of the Mayer f-function in the relative configurational space (translation and rotation) of the two molecules. Simple theoretical models, such as one attributed to Derjaguin, Landau, Verwey, and Overbeek (DLVO), can fit the dependence of B2 on salt concentrations. However, model parameters derived often are physically unrealistic and hardly transferable from protein to protein. Previous B2 calculations incorporating atomistic details were done with limited sampling in the configurational space, due to enormous computational cost. Our FMAP method, based on fast Fourier transform, can considerably accelerate such calculations, and here we adapt it to calculate B2 values for proteins represented at the atomic level in implicit solvent. After tuning of a single parameter in the energy function, FMAPB2 predicts well the B2 values for lysozyme and other proteins over wide ranges of solvent conditions (salt concentration, pH, and temperature). The method is available as a web server at http://pipe.rcc.fsu.edu/fmapb2.",
            "authors": [
                "Qin S.",
                "Zhou H.-X."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JPCB.9B06808",
            "journal": "Journal of Physical Chemistry B",
            "pmid": "31490691",
            "title": "Calculation of Second Virial Coefficients of Atomistic Proteins Using Fast Fourier Transform",
            "year": "2019-10-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:FMAPB2",
        "biotoolsID": "FMAPB2",
        "description": "Calculation of Second Virial Coefficients of Atomistic Proteins Using Fast Fourier Transform | Web Server for Calculating Protein Second Virial Coefficients | PI2PE: Protein Interface/Interior Prediction Engine | FMAPB2 implements FMAP, a method based on fast Fourier transform (FFT), to calculate second virial coefficients ( B 2 ) for proteins represented at the all-atom level in implicit solvent. FMAP stands for F FT-based M odeling of A tomistic P rotein-protein interactions. In FMAPB2, we express terms of the protein-protein inteaction energy as correlation functions, and evaluate them by FFT. These terms include steric repulsion, nonpolar attraction (in the form of a Lennard-Jones potential), and electrostatic interactions (in the form of a Debye-H&#252ckel potential)",
        "homepage": "http://pipe.rcc.fsu.edu/fmapb2",
        "name": "FMAPB2"
    }
}