{
    "additionDate": "2021-01-18T08:46:02Z",
    "biotoolsCURIE": "biotools:rf-dl-malosite",
    "biotoolsID": "rf-dl-malosite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dukka.kc@wichita.edu",
            "name": "Dukka KC",
            "typeEntity": "Person"
        }
    ],
    "description": "RF-MaloSite and DL-MaloSite are methods based on random forest and deep learning to identify malonylation sites. The computational methods for malonylation site prediction  are based on random forest and deep learning machine learning algorithms, RF-MaloSite and DL-MaloSite, respectively. DL-MaloSite requires the primary amino acid sequence as an input and RF-MaloSite utilizes a diverse set of biochemical, physiochemical and sequence-based features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dukkakc/DL-MaloSite-and-RF-MaloSite",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T10:56:08Z",
    "name": "RF-MaloSite and DL-MaloSite",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2020.02.012",
            "metadata": {
                "abstract": "© 2020 The AuthorsMalonylation, which has recently emerged as an important lysine modification, regulates diverse biological activities and has been implicated in several pervasive disorders, including cardiovascular disease and cancer. However, conventional global proteomics analysis using tandem mass spectrometry can be time-consuming, expensive and technically challenging. Therefore, to complement and extend existing experimental methods for malonylation site identification, we developed two novel computational methods for malonylation site prediction based on random forest and deep learning machine learning algorithms, RF-MaloSite and DL-MaloSite, respectively. DL-MaloSite requires the primary amino acid sequence as an input and RF-MaloSite utilizes a diverse set of biochemical, physiochemical and sequence-based features. While systematic assessment of performance metrics suggests that both ‘RF-MaloSite’ and ‘DL-MaloSite’ perform well in all metrics tested, our methods perform particularly well in the areas of accuracy, sensitivity and overall method performance (assessed by the Matthew's Correlation Coefficient). For instance, RF-MaloSite exhibited MCC scores of 0.42 and 0.40 using 10-fold cross-validation and an independent test set, respectively. Meanwhile, DL-MaloSite was characterized by MCC scores of 0.51 and 0.49 based on 10-fold cross-validation and an independent set, respectively. Importantly, both methods exhibited efficiency scores that were on par or better than those achieved by existing malonylation site prediction methods. The identification of these sites may also provide important insights into the mechanisms of crosstalk between malonylation and other lysine modifications, such as acetylation, glutarylation and succinylation. To facilitate their use, both methods have been made freely available to the research community at https://github.com/dukkakc/DL-MaloSite-and-RF-MaloSite.",
                "authors": [
                    {
                        "name": "AL-barakati H."
                    },
                    {
                        "name": "Hiroto S."
                    },
                    {
                        "name": "KC D."
                    },
                    {
                        "name": "Newman R.H."
                    },
                    {
                        "name": "Roy K."
                    },
                    {
                        "name": "Thapa N."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "RF-MaloSite and DL-Malosite: Methods based on random forest and deep learning to identify malonylation sites"
            },
            "pmcid": "PMC7160427",
            "pmid": "32322367"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
