{
    "additionDate": "2021-01-18T09:02:37Z",
    "biotoolsCURIE": "biotools:ddrp",
    "biotoolsID": "ddrp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "brittany.barker@oregonstate.edu",
            "name": "Brittany S. Barker",
            "typeEntity": "Person"
        }
    ],
    "description": "DDRP is a platform for real-time phenology and climatic suitability modeling of invasive insects.\n\nA final production version of the DDRP platform that includes cohorts, parallel processing, and improving mapping routines. The objective of the Degree-Day, establishment Risk, and Pest event mapping system (DDRP) is to predict phenology and climate suitability of invasive, biocontrol, and IPM species for the conterminous United States. DDRP is ….",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bbarker505/ddrp_v2",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:42:05.305473Z",
    "name": "DDRP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0244005",
            "metadata": {
                "abstract": "Rapidly detecting and responding to new invasive species and the spread of those that are already established is essential for reducing their potential threat to food production, the economy, and the environment. We describe a new spatial modeling platform that integrates mapping of phenology and climatic suitability in real-time to provide timely and comprehensive guidance for stakeholders needing to know both where and when invasive insect species could potentially invade the conterminous United States. The Degree-Days, Risk, and Phenological event mapping (DDRP) platform serves as an open-source and relatively easy-to-parameterize decision support tool to help detect new invasive threats, schedule monitoring and management actions, optimize biological control, and predict potential impacts on agricultural production. DDRP uses a process-based modeling approach in which degree-days and temperature stress are calculated daily and accumulate over time to model phenology and climatic suitability, respectively. Outputs include predictions of the number of completed generations, life stages present, dates of phenological events, and climatically suitable areas based on two levels of climate stress. Species parameter values can be derived from laboratory and field studies or estimated through an additional modeling step. DDRP is written entirely in R, making it flexible and extensible, and capitalizes on multiple R packages to generate gridded and graphical outputs. We illustrate the DDRP modeling platform and the process of model parameterization using two invasive insect species as example threats to United States agriculture: the light brown apple moth, Epiphyas postvittana, and the small tomato borer, Neoleucinodes elegantalis. We then discuss example applications of DDRP as a decision support tool, review its potential limitations and sources of model error, and outline some ideas for future improvements to the platform.",
                "authors": [
                    {
                        "name": "Barker B.S."
                    },
                    {
                        "name": "Cook G."
                    },
                    {
                        "name": "Coop L."
                    },
                    {
                        "name": "Grevstad F."
                    },
                    {
                        "name": "Wepprich T."
                    }
                ],
                "citationCount": 24,
                "date": "2020-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "DDRP: Real-time phenology and climatic suitability modeling of invasive insects"
            },
            "pmcid": "PMC7775054",
            "pmid": "33382722",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/2020.05.18.102681",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        }
    ]
}
