{
    "additionDate": "2024-06-18T12:54:57.808981Z",
    "biotoolsCURIE": "biotools:metdit",
    "biotoolsID": "metdit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wangyf0622@tjutcm.edu.cn",
            "name": "Yuefei Wang"
        }
    ],
    "description": "Transforming and analyzing clinical metabolomics data with convolutional neural networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                }
            ]
        }
    ],
    "homepage": "http://metdit.bioinformatics.vip/",
    "lastUpdate": "2024-06-18T12:54:57.811123Z",
    "license": "MIT",
    "name": "MetDIT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.3c04607",
            "metadata": {
                "abstract": "Clinical metabolomics is growing as an essential tool for precision medicine. However, classical machine learning algorithms struggle to comprehensively encode and analyze the metabolomics data due to their high dimensionality and complex intercorrelations. This article introduces a new method called MetDIT, designed to analyze intricate metabolomics data effectively using deep convolutional neural networks (CNN). MetDIT comprises two components: TransOmics and NetOmics. Since CNN models have difficulty in processing one-dimensional (1D) sequence data efficiently, we developed TransOmics, a framework that transforms sequence data into two-dimensional (2D) images while maintaining a one-to-one correspondence between the sequences and images. NetOmics, the second component, leverages a CNN architecture to extract more discriminative representations from the transformed samples. To overcome the overfitting due to the small sample size and class imbalance, we introduced a feature augmentation module (FAM) and a loss function to improve the model performance. Furthermore, we systematically optimized the model backbone and image resolution to balance the model parameters and computational costs. To demonstrate the performance of the proposed MetDIT, we conducted extensive experiments using three different clinical metabolomics data sets and achieved better classification performance than classical machine learning methods used in metabolomics, including Random Forest, SVM, XGBoost, and LightGBM. The source code is available at the GitHub repository at https://github.com/Li-OmicsLab/MetDIT, and the WebApp can be found at http://metdit.bioinformatics.vip/.",
                "authors": [
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Luo G."
                    },
                    {
                        "name": "Meng W."
                    },
                    {
                        "name": "Sha Y."
                    },
                    {
                        "name": "Tong H.H.Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhai X."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "MetDIT: Transforming and Analyzing Clinical Metabolomics Data with Convolutional Neural Networks"
            },
            "pmid": "38324756"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
