{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.genesilico.pl/"}],"documentation":[{"type":"GENERAL","url":"http://www.genesilico.pl/"}],"function":[{"operation":[{"term":"Pairwise sequence alignment","uri":"http://edamontology.org/operation_0491"},{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"collectionID":["BLAST"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web service"],"topic":[{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/2070"}],"publication":[{"abstract":"© 2016 The Author(s) The diverse functional cellular roles played by ribonucleic acids (RNA) have emphasized the need to develop rapid and accurate methodologies to elucidate the relationship between the structure and function of RNA. Structural biology tools such as X-ray crystallography and Nuclear Magnetic Resonance are highly useful methods to obtain atomic-level resolution models of macromolecules. However, both methods have sample, time, and technical limitations that prevent their application to a number of macromolecules of interest. An emerging alternative to high-resolution structural techniques is to employ a hybrid approach that combines low-resolution shape information about macromolecules and their complexes from experimental hydrodynamic (e.g. analytical ultracentrifugation) and solution scattering measurements (e.g., solution X-ray or neutron scattering), with computational modeling to obtain atomic-level models. While promising, scattering methods rely on aggregation-free, monodispersed preparations and therefore the careful development of a quality control pipeline is fundamental to an unbiased and reliable structural determination. This review article describes hydrodynamic techniques that are highly valuable for homogeneity studies, scattering techniques useful to study the low-resolution shape, and strategies for computational modeling to obtain high-resolution 3D structural models of RNAs, proteins, and RNA-protein complexes.","authors":["Patel T.R.","Chojnowski G.","Astha","Koul A.","McKenna S.A.","Bujnicki J.M."],"cit_count":7,"doi":"10.1016/j.ymeth.2016.12.002","journal":"Methods","title":"Structural studies of RNA-protein complexes: A hybrid approach involving hydrodynamics, scattering, and computational methods","type":"Other","year":"2017-04-15"}],"summary":{"biotoolsCURIE":"biotools:bujnicki_lab_tools","biotoolsID":"bujnicki_lab_tools","description":"Range of bioinformatics tools including Blast, PsiBlast, PhyloTable.","homepage":"http://www.genesilico.pl/","name":"Bujnicki Lab Tools","version":["1"]}}