{
    "additionDate": "2017-08-03T18:36:53Z",
    "biotoolsCURIE": "biotools:bhit",
    "biotoolsID": "bhit",
    "credit": [
        {
            "email": "wangjue@missouri.edu",
            "name": "Juexin Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://digbio.missouri.edu/"
        }
    ],
    "description": "Bayesian High-order Interaction Toolkit, a novel Bayesian partition computational method for detecting SNP interactions (epistasis).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://digbio.missouri.edu/BHIT/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "http://digbio.missouri.edu/BHIT/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bhit-snp-interaction-detection.html"
        }
    ],
    "name": "BHIT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Wang et al. Background: A central question for disease studies and crop improvements is how genetics variants drive phenotypes. Genome Wide Association Study (GWAS) provides a powerful tool for characterizing the genotype-phenotype relationships in complex traits and diseases. Epistasis (gene-gene interaction), including high-order interaction among more than two genes, often plays important roles in complex traits and diseases, but current GWAS analysis usually just focuses on additive effects of single nucleotide polymorphisms (SNPs). The lack of effective computational modelling of high-order functional interactions often leads to significant under-utilization of GWAS data. Results: We have developed a novel Bayesian computational method with a Markov Chain Monte Carlo (MCMC) search, and implemented the method as a Bayesian High-order Interaction Toolkit (BHIT) for detecting epistatic interactions among SNPs. BHIT first builds a Bayesian model on both continuous data and discrete data, which is capable of detecting high-order interactions in SNPs related to case-control or quantitative phenotypes. We also developed a pipeline that enables users to apply BHIT on different species in different use cases. Conclusions: Using both simulation data and soybean nutritional seed composition studies on oil content and protein content, BHIT effectively detected some high-order interactions associated with phenotypes, and it outperformed a number of other available tools. BHIT is freely available for academic users at http://digbio.missouri.edu/BHIT/.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Joshi T."
                    },
                    {
                        "name": "Valliyodan B."
                    },
                    {
                        "name": "Shi H."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Nguyen H.T."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 14,
                "date": "2015-11-25T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A Bayesian model for detection of high-order interactions among genetic variants in genome-wide association studies"
            },
            "pmid": "26607428"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}