{
    "additionDate": "2017-01-17T15:01:39Z",
    "biotoolsCURIE": "biotools:ringo",
    "biotoolsID": "ringo",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jtoedling@yahoo.de",
            "name": "J. Toedling",
            "orcidid": "http://orcid.org/0000-0003-1471-1295",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package facilitates primary analysis of ChIP-chip data. Its main functionalities are data read-in, quality assessment, data visualisation and identification of genomic regions showing enrichment in ChIP-chip. It has functions to deal with two-color nucleotide microarrays from NimbleGen used in ChIP-chip projects, but also contains more general functions for ChIP-chip data analysis, given that the data is supplied as RGList or ExpressionSet. It employs functions from various other packages.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/Ringo.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/Ringo_1.38.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/Ringo.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-24T21:58:19Z",
    "license": "Artistic-2.0",
    "name": "Ringo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-221",
            "metadata": {
                "abstract": "Background: Chromatin immunoprecipitation combined with DNA microarrays (ChIP-chip) is a high-throughput assay for DNA-protein-binding or post-translational chromatin/histone modifications. However, the raw microarray intensity readings themselves are not immediately useful to researchers, but require a number of bioinformatic analysis steps. Identified enriched regions need to be bioinformatically annotated and compared to related datasets by statistical methods. Results: We present a free, open-source R package Ringo that facilitates the analysis of ChIP-chip experiments by providing functionality for data import, quality assessment, normalization and visualization of the data, and the detection of ChIP-enriched genomic regions. Conclusion: Ringo integrates with other packages of the Bioconductor project, uses common data structures and is accompanied by ample documentation. It facilitates the construction of programmed analysis workflows, offers benefits in scalability, reproducibility and methodical scope of the analyses and opens up a broad selection of follow-up statistical and bioinformatic methods. © 2007 Toedling et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Huber W."
                    },
                    {
                        "name": "Sklyar O."
                    },
                    {
                        "name": "Toedling J."
                    }
                ],
                "citationCount": 126,
                "date": "2007-06-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Ringo - An R/Bioconductor package for analyzing ChIP-chip readouts"
            },
            "pmcid": "PMC1906858",
            "pmid": "17594472",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1,
    "version": [
        "1.38.0"
    ]
}
