{
    "additionDate": "2017-05-12T11:11:34Z",
    "biotoolsCURIE": "biotools:4pipe4",
    "biotoolsID": "4pipe4",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Francisco Pina Martins",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/StuntsPT/4Pipe4/issues"
        }
    ],
    "description": "A pipeline with emphasis on SNP detection. It will detect SNPs in NGS data where no reference sequence nor strain information is available.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/StuntsPT/4Pipe4/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/StuntsPT/4Pipe4/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set (nucleic acid)",
                        "uri": "http://edamontology.org/data_1234"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        },
                        {
                            "term": "SFF",
                            "uri": "http://edamontology.org/format_3284"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/StuntsPT/4Pipe4",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-3.0",
    "maturity": "Legacy",
    "name": "4Pipe4",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Stunts",
    "publication": [
        {
            "doi": "10.1186/s12859-016-0892-1",
            "metadata": {
                "abstract": "© 2016 Pina-Martins et al.Background: Next-generation sequencing datasets are becoming more frequent, and their use in population studies is becoming widespread. For non-model species, without a reference genome, it is possible from a panel of individuals to identify a set of SNPs that can be used for further population genotyping. However the lack of a reference genome to which the sequenced data could be compared makes the finding of SNPs more troublesome. Additionally when the data sources (strains) are not identified (e.g. in datasets of pooled individuals), the problem of finding reliable variation in these datasets can become much more difficult due to the lack of specialized software for this specific task. Results: Here we describe 4Pipe4, a 454 data analysis pipeline particularly focused on SNP detection when no reference or strain information is available. It uses a command line interface to automatically call other programs, parse their outputs and summarize the results. The variation detection routine is built-in in the program itself. Despite being optimized for SNP mining in 454 EST data, it is flexible enough to automate the analysis of genomic data or even data from other NGS technologies. 4Pipe4 will output several HTML formatted reports with metrics on many of the most common assembly values, as well as on all the variation found. There is also a module available for finding putative SSRs in the analysed datasets. Conclusions: This program can be especially useful for researchers that have 454 datasets of a panel of pooled individuals and want to discover and characterize SNPs for subsequent individual genotyping with customized genotyping arrays. In comparison with other SNP detection approaches, 4Pipe4 showed the best validation ratio, retrieving a smaller number of SNPs but with a considerably lower false positive rate than other methods. 4Pipe4's source code is available at https://github.com/StuntsPT/4Pipe4.",
                "authors": [
                    {
                        "name": "Pina-Martins F."
                    },
                    {
                        "name": "Vieira B.M."
                    },
                    {
                        "name": "Seabra S.G."
                    },
                    {
                        "name": "Batista D."
                    },
                    {
                        "name": "Paulo O.S."
                    }
                ],
                "citationCount": 1,
                "date": "2016-01-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "4Pipe4 - A 454 data analysis pipeline for SNP detection in datasets with no reference sequence or strain information"
            },
            "pmcid": "PMC4719533",
            "pmid": "26787189",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.7.1"
    ]
}