{
    "additionDate": "2022-09-14T06:28:27.979981Z",
    "biotoolsCURIE": "biotools:fat-ptm",
    "biotoolsID": "fat-ptm",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "iwallace@unr.edu",
            "name": "Ian S. Wallace",
            "typeEntity": "Person"
        },
        {
            "name": "Madison N. Blea"
        }
    ],
    "description": "A Functional Analysis Tools for Post-translational Modifications (FAT-PTM) database, which supports data from publicly available proteomic analyses encompassing eight different types of PTMs and over 49,000 PTM sites.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "https://bioinformatics.cse.unr.edu/fat-ptm/help/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.cse.unr.edu/fat-ptm",
    "lastUpdate": "2022-09-14T06:28:27.982423Z",
    "license": "Not licensed",
    "name": "FAT-PTM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-2317-6_7",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive license to Springer Science+Business Media, LLC, part of Springer Nature.Posttranslational modifications (PTMs) are critical regulators of protein behavior, and over 200 different types of PTMs have been identified. Recent developments in mass spectrometry technology and sample enrichment approaches have led to a massive expansion in the number of identified PTM types and sites within eukaryotic proteins. As these types of data become increasingly available, it is important to develop additional analysis tools and data repositories to investigate PTM cross talk and larger networks of PTMs. Recently, we developed the Functional Analysis Tools for Post-translational Modifications (FAT-PTM) database, which supports data from publicly available proteomic analyses encompassing eight different types of PTMs and over 49,000 PTM sites. In this chapter, we describe the utility of FAT-PTM for analysis of posttranslationally modified proteins in three different contexts. First, a simple protein search tool is available that allows users to investigate proteins in the Arabidopsis proteome to identify types of PTMs that are associated with the query protein as well as quantitative phosphorylation site changes associated with ten different experimental conditions. Second, FAT-PTM contains a metabolic pathway analysis tool to investigate PTMs in the broader context of over 600 different metabolic pathways compiled from the Plant Metabolic Network. Finally, FAT-PTM contains a comodification tool that can be used to identify groups of proteins that are subject to two or more user-defined PTMs. Overall, FAT-PTM provides a user-friendly platform to visualize posttranslationally modified proteins at the individual, metabolic pathway, and PTM cross-talk levels.",
                "authors": [
                    {
                        "name": "Blea M.N."
                    },
                    {
                        "name": "Wallace I.S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Analysis of Posttranslational Modifications in Arabidopsis Proteins and Metabolic Pathways Using the FAT-PTM Database"
            },
            "pmid": "35696079"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
