{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://metaquery.docpollard.org/contact.html"}],"documentation":[{"type":"GENERAL","url":"http://metaquery.docpollard.org/cgi-bin/about.py"}],"function":[{"operation":[{"term":"Sequence annotation","uri":"http://edamontology.org/operation_0361"}]},{"operation":[{"term":"Quantification","uri":"http://edamontology.org/operation_3799"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Microbial ecology","uri":"http://edamontology.org/topic_3697"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/metaquery-annotation-and-quantitative-analysis-of-genes-in-the-human-gut-microbiome.html"}],"publication":[{"abstract":"© 2015 The Author. Summary: Microbiome researchers frequently want to know how abundant a particular microbial gene or pathway is across different human hosts, including its association with disease and its cooccurrence with other genes or microbial taxa. With thousands of publicly available metagenomes, these questions should be easy to answer. However, computational barriers prevent most researchers from conducting such analyses. We address this problem with MetaQuery, a web application for rapid and quantitative analysis of specific genes in the human gut microbiome. The user inputs one or more query genes, and our software returns the estimated abundance of these genes across 1267 publicly available fecal metagenomes from American, European and Chinese individuals. In addition, our application performs downstream statistical analyses to identify features that are associated with gene variation, including other query genes (i.e. gene co-variation), taxa, clinical variables (e.g. inflammatory bowel disease and diabetes) and average genome size. The speed and accessibility of MetaQuery are a step toward democratizing metagenomics research, which should allow many researchers to query the abundance and variation of specific genes in the human gut microbiome.","authors":["Nayfach S.","Fischbach M.A.","Pollard K.S."],"cit_count":16,"journal":"Bioinformatics","pmid":"26104745","title":"MetaQuery: A web server for rapid annotation and quantitative analysis of specific genes in the human gut microbiome","year":"2015-03-25"}],"summary":{"biotoolsCURIE":"biotools:metaquery","biotoolsID":"metaquery","description":"Web application for rapid and quantitative analysis of specific genes in the human gut microbiome.","homepage":"http://metaquery.docpollard.org/","name":"MetaQuery"}}