{
    "additionDate": "2017-01-13T13:15:33Z",
    "biotoolsCURIE": "biotools:mrsfast",
    "biotoolsID": "mrsfast",
    "credit": [
        {
            "name": "Iman Sarrafi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/isarrafi/"
        },
        {
            "name": "Faraz Hach",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/fhach"
        }
    ],
    "description": "micro-read substitution-only Fast Alignment Search Tool. Short read mapper that optimizes cache usage to get higher performance.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/sfu-compbio/mrsfast/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sfu-compbio/mrsfast",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "mrsFAST",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1038/nmeth0810-576",
            "metadata": {
                "authors": [
                    {
                        "name": "Hach F."
                    },
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Alkan C."
                    },
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Birol I."
                    },
                    {
                        "name": "Eichler E.E."
                    },
                    {
                        "name": "Sahinalp S.C."
                    }
                ],
                "citationCount": 184,
                "date": "2010-08-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "MrsFAST: A cache-oblivious algorithm for short-read mapping"
            },
            "pmcid": "PMC3115707",
            "pmid": "20676076",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-14-184",
            "metadata": {
                "abstract": "Background: The development of next-generation sequencing instruments has led to the generation of millions of short sequences in a single run. The process of aligning these reads to a reference genome is time consuming and demands the development of fast and accurate alignment tools. However, the current proposed tools make different compromises between the accuracy and the speed of mapping. Moreover, many important aspects are overlooked while comparing the performance of a newly developed tool to the state of the art. Therefore, there is a need for an objective evaluation method that covers all the aspects. In this work, we introduce a benchmarking suite to extensively analyze sequencing tools with respect to various aspects and provide an objective comparison.Results: We applied our benchmarking tests on 9 well known mapping tools, namely, Bowtie, Bowtie2, BWA, SOAP2, MAQ, RMAP, GSNAP, Novoalign, and mrsFAST (mrFAST) using synthetic data and real RNA-Seq data. MAQ and RMAP are based on building hash tables for the reads, whereas the remaining tools are based on indexing the reference genome. The benchmarking tests reveal the strengths and weaknesses of each tool. The results show that no single tool outperforms all others in all metrics. However, Bowtie maintained the best throughput for most of the tests while BWA performed better for longer read lengths. The benchmarking tests are not restricted to the mentioned tools and can be further applied to others.Conclusion: The mapping process is still a hard problem that is affected by many factors. In this work, we provided a benchmarking suite that reveals and evaluates the different factors affecting the mapping process. Still, there is no tool that outperforms all of the others in all the tests. Therefore, the end user should clearly specify his needs in order to choose the tool that provides the best results. © 2013 Hatem et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hatem A."
                    },
                    {
                        "name": "Bozdag D."
                    },
                    {
                        "name": "Toland A.E."
                    },
                    {
                        "name": "Catalyurek U.V."
                    }
                ],
                "citationCount": 119,
                "date": "2013-06-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Benchmarking short sequence mapping tools"
            },
            "pmcid": "PMC3694458",
            "pmid": "23758764",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}