
{
    "credit": [
        {
            "email": "jeremiah.faith@mssm.edu",
            "name": "Jeremiah Faith",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.jeremiahfaith.com/"
        }
    ],
    "documentation": [
        {
            "url": "http://lwgv.sourceforge.net/lwgv.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/lwgv-0-4-lightweight-genome-viewer.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Lightweight genome viewer (lwgv) is a web-based tool for visualization of sequence annotations in their chromosomal context. It performs most of the functions of larger genome browsers, while relying on standard flat-file formats and bypassing the database needs of most visualization tools. Visualization as an aide to discovery requires display of novel data in conjunction with static annotations in their chromosomal context. With database-based systems, displaying dynamic results requires temporary tables that need to be tracked for removal. Results: lwgv simplifies the visualization of user-generated results on a local computer. The dynamic results of these analyses are written to transient files, which can import static content from a more permanent file. lwgv is currently used in many different applications, from whole genome browsers to single-gene RNAi design visualization, demonstrating its applicability in a large variety of contexts and scales. Conclusion: lwgv provides a lightweight alternative to large genome browsers for visualizing biological annotations and dynamic analyses in their chromosomal context. It is particularly suited for applications ranging from short sequences to medium-sized genomes when the creation and maintenance of a large software and database infrastructure is not necessary or desired. © 2007 Faith et al; licensee BioMed Central Ltd.",
            "authors": [
                "Faith J.J.",
                "Olson A.J.",
                "Gardner T.S.",
                "Sachidanandam R."
            ],
            "cit_count": 8,
            "journal": "BMC Bioinformatics",
            "pmid": "17877794",
            "title": "Lightweight genome viewer: Portable software for browsing genomics data in its chromosomal context",
            "year": "2007-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lwgv",
        "biotoolsID": "lwgv",
        "description": "Uses a simple language for describing features on a genome or biological sequence and provides a browsable image of these features.",
        "homepage": "http://lwgv.sourceforge.net/",
        "name": "lwgv"
    }
}