
{
    "credit": [
        {
            "typeEntity": "Project",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://ball-project.org/contact/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/BALL-Project/ball/wiki/ballaxy"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "Computational biology",
                "uri": "http://edamontology.org/topic_3307"
            },
            {
                "term": "Workflows",
                "uri": "http://edamontology.org/topic_0769"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ballaxy-galaxy-based-workflow-toolkit-for-structural-bioinformatics.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 The Author. Motivation: Web-based workflow systems have gained considerable momentum in sequence-oriented bioinformatics. In structural bioinformatics, however, such systems are still relatively rare; while commercial stand-alone workflow applications are common in the pharmaceutical industry, academic researchers often still rely on command-line scripting to glue individual tools together. Results: In this work, we address the problem of building a web-based system for workflows in structural bioinformatics. For the underlying molecular modelling engine, we opted for the BALL framework because of its extensive and well-tested functionality in the field of structural bioinformatics. The large number of molecular data structures and algorithms implemented in BALL allows for elegant and sophisticated development of new approaches in the field. We hence connected the versatile BALL library and its visualization and editing front end BALLView with the Galaxy workflow framework. The result, which we call ballaxy, enables the user to simply and intuitively create sophisticated pipelines for applications in structure-based computational biology, integrated into a standard tool for molecular modelling. Availability and implementation: ballaxy consists of three parts: some minor modifications to the Galaxy system, a collection of tools and an integration into the BALL framework and the BALLView application for molecular modelling. Modifications to Galaxy will be submitted to the Galaxy project, and the BALL and BALLView integrations will be integrated in the next major BALL release. After acceptance of the modifications into the Galaxy project, we will publish all ballaxy tools via the Galaxy toolshed. In the meantime, all three components are available from http://www.ball-project.org/ballaxy. Also, docker images for ballaxy are available at https://registry.hub.docker.com/u/anhi/ballaxy/dockerfile/. ballaxy is licensed under the terms of the GPL. Supplementary information: Supplementary data are available at Bioinformatics online. Contact: or andreas.hildebrandt@uni-mainz.de",
            "authors": [
                "Hildebrandt A.K.",
                "Stockel D.",
                "Fischer N.M.",
                "De La Garza L.",
                "Krouger J.",
                "Nickels S.",
                "Rottig M.",
                "Scharfe C.",
                "Schumann M.",
                "Thiel P.",
                "Lenhof H.-P.",
                "Kohlbacher O.",
                "Hildebrandt A."
            ],
            "cit_count": 4,
            "doi": "10.1093/bioinformatics/btu574",
            "journal": "Bioinformatics",
            "pmid": "25183489",
            "title": "Ballaxy: Web services for structural bioinformatics",
            "type": "Primary",
            "year": "2015-01-01"
        },
        {
            "abstract": "The Biochemical Algorithms Library (BALL) is a comprehensive rapid application development framework for structural bioinformatics. It provides an extensive C++ class library of data structures and algorithms for molecular modeling and structural bioinformatics. Using BALL as a programming toolbox does not only allow to greatly reduce application development times but also helps in ensuring stability and correctness by avoiding the error-prone reimplementation of complex algorithms and replacing them with calls into the library that has been well-tested by a large number of developers. In the ten years since its original publication, BALL has seen a substantial increase in functionality and numerous other improvements. Here, we discuss BALL's current functionality and highlight the key additions and improvements: support for additional file formats, molecular edit-functionality, new molecular mechanics force fields, novel energy minimization techniques, docking algorithms, and support for cheminformatics. BALL is available for all major operating systems, including Linux, Windows, and MacOS X. It is available free of charge under the Lesser GNU Public License (LPGL). Parts of the code are distributed under the GNU Public License (GPL). BALL is available as source code and binary packages from the project web site at http://www.ball-project.org. Recently, it has been accepted into the debian project; integration into further distributions is currently pursued.",
            "authors": [
                "Hildebrandt A.",
                "Dehof A.K.",
                "Rurainski A.",
                "Bertsch A.",
                "Schumann M.",
                "Toussaint N.C.",
                "Moll A.",
                "Stockel D.",
                "Nickels S.",
                "Mueller S.C.",
                "Lenhof H.P.",
                "Kohlbacher O."
            ],
            "cit_count": 54,
            "doi": "10.1186/1471-2105-11-531",
            "journal": "BMC bioinformatics",
            "title": "BALL--biochemical algorithms library 1.3.",
            "type": "Other",
            "year": "2010-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ballaxy",
        "biotoolsID": "ballaxy",
        "description": "Galaxy-based workflow toolkit for structural bioinformatics.",
        "homepage": "https://ball-project.org/ballaxy/",
        "name": "ballaxy"
    }
}