{
    "additionDate": "2019-11-14T19:42:10Z",
    "biotoolsCURIE": "biotools:bigPint",
    "biotoolsID": "bigPint",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lindsayannerutter@gmail.com",
            "name": "Lindsay Rutter",
            "orcidid": "https://orcid.org/0000-0003-2123-3949",
            "typeEntity": "Person"
        }
    ],
    "description": "Visualization methods for differential expression analysis | Methods for visualizing large multivariate datasets using static and interactive scatterplot matrices, parallel coordinate plots, volcano plots, and litre plots. Includes examples for visualizing RNA-sequencing datasets and differentially expressed genes | Big multivariate data plotted interactively | bigPint: Make BIG data pint-sized | Welcome to the bigPint package website! If you are a new user, please begin by reading from the Get Started tab at the top of this website. There are ten short vignette articles in that tab, and we recommend reading them in order. These short vignette articles consist of reproducible code that provide: | Alternatives to data metrics object | Clustering, DataImport, DifferentialExpression, GeneExpression, MultipleComparison, Normalization, Preprocessing, QualityControl, RNASeq, Sequencing, Software, Transcription, Visualization",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://lindsayrutter.github.io/bigPint",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-05T14:34:39Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/devel/bioc/html/bigPint.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lindsayrutter/bigPint/"
        }
    ],
    "name": "bigPint",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2968-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Despite the availability of many ready-made testing software, reliable detection of differentially expressed genes in RNA-seq data is not a trivial task. Even though the data collection is considered high-throughput, data analysis has intricacies that require careful human attention. Researchers should use modern data analysis techniques that incorporate visual feedback to verify the appropriateness of their models. While some RNA-seq packages provide static visualization tools, their capabilities should be expanded and their meaningfulness should be explicitly demonstrated to users. Results: In this paper, we 1) introduce new interactive RNA-seq visualization tools, 2) compile a collection of examples that demonstrate to biologists why visualization should be an integral component of differential expression analysis. We use public RNA-seq datasets to show that our new visualization tools can detect normalization issues, differential expression designation problems, and common analysis errors. We also show that our new visualization tools can identify genes of interest in ways undetectable with models. Our R package \"bigPint\" includes the plotting tools introduced in this paper, many of which are unique additions to what is currently available. The \"bigPint\" website is located at https://lindsayrutter.github.io/bigPint and contains short vignette articles that introduce new users to our package, all written in reproducible code. Conclusions: We emphasize that interactive graphics should be an indispensable component of modern RNA-seq analysis, which is currently not the case. This paper and its corresponding software aim to persuade 1) users to slightly modify their differential expression analyses by incorporating statistical graphics into their usual analysis pipelines, 2) developers to create additional complex and interactive plotting methods for RNA-seq data, possibly using lessons learned from our open-source codes. We hope our work will serve a small part in upgrading the RNA-seq analysis world into one that more wholistically extracts biological information using both models and visuals.",
                "authors": [
                    {
                        "name": "Cook D."
                    },
                    {
                        "name": "Graham M.A."
                    },
                    {
                        "name": "Moran Lauter A.N."
                    },
                    {
                        "name": "Rutter L."
                    }
                ],
                "citationCount": 6,
                "date": "2019-09-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Visualization methods for differential expression analysis"
            },
            "pmcid": "PMC6731617",
            "pmid": "31492109"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
