{
    "additionDate": "2021-01-18T10:37:11Z",
    "biotoolsCURIE": "biotools:venoms",
    "biotoolsID": "venoms",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "laurent.bigler@chem.uzh.ch",
            "name": "Laurent Bigler",
            "orcidid": "https://orcid.org/0000-0003-3548-3594",
            "typeEntity": "Person"
        }
    ],
    "description": "Website for the Low Molecular Mass Compounds in Spider Venoms.\n\nvenoMS is a free database for low molecular mass compounds found in spider venoms (< 1000 Da) and provides fast access to ESI-MS/MS spectra, fragment ion annotation and literature references about the structure elucidation, synthesis and biological activity of the metabolites. The spider taxonomy is based on the latest version of the World Spider Catalog.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "homepage": "http://www.venoms.ch",
    "lastUpdate": "2021-03-11T10:33:03Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ms-uzh/venoms"
        }
    ],
    "name": "venoms",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/METABO10080327",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Spider venoms are highly complex mixtures. Numerous spider venom metabolites are uniquely found in spider venoms and are of interest concerning their potential use in pharmacology, agriculture, and cosmetics. A nontargeted ultra-high performance high-resolution electrospray tandem mass spectrometry (UHPLC-HR-ESI-MS/MS) approach offers a resource-saving way for the analysis of crude spider venom. However, the identification of known as well as the structure elucidation of unknown low molecular mass spider venom compounds based on their MS/MS spectra is challenging because (1) acylpolyamine toxins are exclusively found in spider and wasp venom, (2) reference MS/MS spectra are missing in established mass spectrometry databases, and (3) trivial names for the various toxin metabolites are used in an inconsistent way in literature. Therefore, we introduce the freely accessible MS website for low molecular mass spider venom metabolites, venoMS, containing structural information, MS/MS spectra, and links to related literature. Currently the database contains the structures of 409 acylpolyamine toxins, 36 free linear polyamines, and 81 additional spider venom metabolites. Implemented into this website is a fragment ion calculator (FRIOC) that allows us to predict fragment ions of linear polyamine derivatives. With three metabolites from the venom of the spider Agelenopsis aperta, it was demonstrated how the new website can support the structural elucidation of acylpolyamines using their MS/MS spectra.",
                "authors": [
                    {
                        "name": "Forster Y.M."
                    },
                    {
                        "name": "Reusser S."
                    },
                    {
                        "name": "Forster F."
                    },
                    {
                        "name": "Bienz S."
                    },
                    {
                        "name": "Bigler L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "VenoMS—A website for the low molecular mass compounds in spider venoms"
            },
            "pmcid": "PMC7464580",
            "pmid": "32796671"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}