{
    "name": "MultiPhyl", 
    "description": "High-throughput maximum Llkelihood based phylogeny analysis program that allows researchers to create a virtual phylogenetic supercomputer from a group semi-idle desktop machines.", 
    "homepage": "http://www.cs.nuim.ie/distributed/multiphyl.php", 
    "biotoolsID": "multiphyl", 
    "biotoolsCURIE": "biotools:multiphyl", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0547", 
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0084", 
            "term": "Phylogeny"
        }, 
        {
            "uri": "http://edamontology.org/topic_3293", 
            "term": "Phylogenetics"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17553837", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MultiPhyl: A high-throughput phylogenomics webserver using distributed computing", 
                "abstract": "With the number of fully sequenced genomes increasing steadily, there is greater interest in performing large-scale phylogenomic analyses from large numbers of individual gene families. Maximum likelihood (ML) has been shown repeatedly to be one of the most accurate methods for phylogenetic construction. Recently, there have been a number of algorithmic improvements in maximum-likelihood-based tree search methods. However, it can still take a long time to analyse the evolutionary history of many gene families using a single computer. Distributed computing refers to a method of combining the computing power of multiple computers in order to perform some larger overall calculation. In this article, we present the first high-throughput implementation of a distributed phylogenetics platform, MultiPhyl, capable of using the idle computational resources of many heterogeneous non-dedicated machines to form a phylogenetics supercomputer. MultiPhyl allows a user to upload hundreds or thousands of amino acid or nucleotide alignments simultaneously and perform computationally intensive tasks such as model selection, tree searching and bootstrapping of each of the alignments using many desktop machines. The program implements a set of 88 amino acid models and 56 nucleotide maximum likelihood models and a variety of statistical methods for choosing between alternative models. A MultiPhyl webserver is available for public use at: http://www.cs.nuim.ie/distributed/multiphyl.php. © 2007 The Author(s).", 
                "date": "2007-07-01T00:00:00Z", 
                "citationCount": 53, 
                "authors": [
                    {
                        "name": "Keane T.M."
                    }, 
                    {
                        "name": "Naughton T.J."
                    }, 
                    {
                        "name": "McInerney J.O."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15513992", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "DPRml: Distributed phylogeny reconstruction by maximum likelihood", 
                "abstract": "Motivation: In recent years there has been increased interest in producing large and accurate phylogenetic trees using statistical approaches. However for a large number of taxa, it is not feasible to construct large and accurate trees using only a single processor. A number of specialized parallel programs have been produced in an attempt to address the huge computational requirements of maximum likelihood. We express a number of concerns about the current set of parallel phylogenetic programs which are currently severely limiting the widespread availability and use of parallel computing in maximum likelihood-based phylogenetic analysis. Results: We have identified the suitability of phylogenetic analysis to large-scale heterogeneous distributed computing. We have completed a distributed and fully cross-platform phylogenetic tree building program called distributed phylogeny reconstruction by maximum likelihood. It uses an already proven maximum likelihood-based tree building algorithm and a popular phylogenetic analysis library for all its likelihood calculations. It offers one of the most extensive sets of DNA substitution models currently available. We are the first, to our knowledge, to report the completion of a distributed phylogenetic tree building program that can achieve near-linear speedup while only using the idle clock cycles of machines. For those in an academic or corporate environment with hundreds of idle desktop machines, we have shown how distributed computing can deliver a 'free' ML supercomputer. © The Author 2004. Published by Oxford University Press. All rights reserved.", 
                "date": "2005-04-01T00:00:00Z", 
                "citationCount": 39, 
                "authors": [
                    {
                        "name": "Keane T.M."
                    }, 
                    {
                        "name": "Naughton T.J."
                    }, 
                    {
                        "name": "Travers S.A.A."
                    }, 
                    {
                        "name": "McInerney J.O."
                    }, 
                    {
                        "name": "McCormack G.P."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:14:26Z", 
    "lastUpdate": "2018-12-10T12:58:39Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}