{
    "additionDate": "2021-01-18T12:28:54Z",
    "biotoolsCURIE": "biotools:survclust",
    "biotoolsID": "survclust",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aroraa@mskcc.org",
            "name": "Arshi Arora",
            "typeEntity": "Person"
        },
        {
            "email": "shenr@mskcc.org",
            "name": "Ronglai Shen",
            "orcidid": "https://orcid.org/0000-0001-9694-584X",
            "typeEntity": "Person"
        }
    ],
    "description": "Pan-cancer identification of clinically relevant genomic subtypes using outcome-weighted integrative clustering.\n\nsurvClust is an outcome weighted supervised clustering algorithm, designed to classify patients according to their molecular as well as time-event or end point of interest. Until now, sub-typing in cancer biology has relied heavily upon clustering/mining of molecular data alone. We present classification of samples on molecular data supervised by time-event data like Overall Survival (OS), Progression Free Survival etc.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/arorarshi/survClust",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2021-02-24T12:40:29Z",
    "name": "survClust",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S13073-020-00804-8",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Comprehensive molecular profiling has revealed somatic variations in cancer at genomic, epigenomic, transcriptomic, and proteomic levels. The accumulating data has shown clearly that molecular phenotypes of cancer are complex and influenced by a multitude of factors. Conventional unsupervised clustering applied to a large patient population is inevitably driven by the dominant variation from major factors such as cell-of-origin or histology. Translation of these data into clinical relevance requires more effective extraction of information directly associated with patient outcome. Methods: Drawing from ideas in supervised text classification, we developed survClust, an outcome-weighted clustering algorithm for integrative molecular stratification focusing on patient survival. survClust was performed on 18 cancer types across multiple data modalities including somatic mutation, DNA copy number, DNA methylation, and mRNA, miRNA, and protein expression from the Cancer Genome Atlas study to identify novel prognostic subtypes. Results: Our analysis identified the prognostic role of high tumor mutation burden with concurrently high CD8 T cell immune marker expression and the aggressive clinical behavior associated with CDKN2A deletion across cancer types. Visualization of somatic alterations, at a genome-wide scale (total mutation burden, mutational signature, fraction genome altered) and at the individual gene level, using circomap further revealed indolent versus aggressive subgroups in a pan-cancer setting. Conclusions: Our analysis has revealed prognostic molecular subtypes not previously identified by unsupervised clustering. The algorithm and tools we developed have direct utility toward patient stratification based on tumor genomics to inform clinical decision-making. The survClust software tool is available at https://github.com/arorarshi/survClust.",
                "authors": [
                    {
                        "name": "Arora A."
                    },
                    {
                        "name": "Olshen A.B."
                    },
                    {
                        "name": "Seshan V.E."
                    },
                    {
                        "name": "Shen R."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Pan-cancer identification of clinically relevant genomic subtypes using outcome-weighted integrative clustering"
            },
            "pmcid": "PMC7716509",
            "pmid": "33272320"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}