{
    "additionDate": "2017-01-13T13:15:14Z",
    "biotoolsCURIE": "biotools:locas",
    "biotoolsID": "locas",
    "credit": [
        {
            "email": "kleinj@informatik.uni-tuebingen.de",
            "name": "Juliane D. Klein",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "LOCAS low-coverage short-read assembler",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://ab.inf.uni-tuebingen.de/software/locas/LOCAS_Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www-ab.informatik.uni-tuebingen.de/software/locas",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "LOCAS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Next Generation Sequencing (NGS) is a frequently applied approach to detect sequence variations between highly related genomes. Recent large-scale re-sequencing studies as the Human 1000 Genomes Project utilize NGS data of low coverage to afford sequencing of hundreds of individuals. Here, SNPs and micro-indels can be detected by applying an alignment-consensus approach. However, computational methods capable of discovering other variations such as novel insertions or highly diverged sequence from low coverage NGS data are still lacking. Results: We present LOCAS, a new NGS assembler particularly designed for low coverage assembly of eukaryotic genomes using a mismatch sensitive overlap-layout-consensus approach. LOCAS assembles homologous regions in a homology-guided manner while it performs de novo assemblies of insertions and highly polymorphic target regions subsequently to an alignment-consensus approach. LOCAS has been evaluated in homology-guided assembly scenarios with low sequence coverage of Arabidopsis thaliana strains sequenced as part of the Arabidopsis 1001 Genomes Project. While assembling the same amount of long insertions as state-of-the-art NGS assemblers, LOCAS showed best results regarding contig size, error rate and runtime. Conclusion: LOCAS produces excellent results for homology-guided assembly of eukaryotic genomes with short reads and low sequencing depth, and therefore appears to be the assembly tool of choice for the detection of novel sequence variations in this scenario. © 2011 Klein et al.",
                "authors": [
                    {
                        "name": "Klein J.D."
                    },
                    {
                        "name": "Ossowski S."
                    },
                    {
                        "name": "Schneeberger K."
                    },
                    {
                        "name": "Weigel D."
                    },
                    {
                        "name": "Huson D.H."
                    }
                ],
                "citationCount": 15,
                "date": "2011-08-19T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Locas - A low coverage assembly tool for resequencing projects"
            },
            "pmid": "21858125"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}