{
    "additionDate": "2017-12-18T00:03:19Z",
    "biotoolsCURIE": "biotools:ard2",
    "biotoolsID": "ard2",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cbdm.mdc-berlin.de/"
        }
    ],
    "description": "ARD2 (Alpha-rod Repeat Detector) is an application for the identification of alpha-rod repeats, also defined as alpha-solenoids (HEAT, Armadillo among others) in protein sequences using a neural network.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cbdm-01.zdv.uni-mainz.de/~fournier/ard2/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://cbdm-01.zdv.uni-mainz.de/~fournier/ard2/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ard2-alpha-rod-detector.html"
        }
    ],
    "name": "ARD2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0079894",
            "metadata": {
                "abstract": "Alpha-solenoids are flexible protein structural domains formed by ensembles of alpha-helical repeats (Armadillo and HEAT repeats among others). While homology can be used to detect many of these repeats, some alpha-solenoids have very little sequence homology to proteins of known structure and we expect that many remain undetected. We previously developed a method for detection of alpha-helical repeats based on a neural network trained on a dataset of protein structures. Here we improved the detection algorithm and updated the training dataset using recently solved structures of alpha-solenoids. Unexpectedly, we identified occurrences of alpha-solenoids in solved protein structures that escaped attention, for example within the core of the catalytic subunit of PI3KC. Our results expand the current set of known alpha-solenoids. Application of our tool to the protein universe allowed us to detect their significant enrichment in proteins interacting with many proteins, confirming that alpha-solenoids are generally involved in protein-protein interactions. We then studied the taxonomic distribution of alpha-solenoids to discuss an evolutionary scenario for the emergence of this type of domain, speculating that alpha-solenoids have emerged in multiple taxa in independent events by convergent evolution. We observe a higher rate of alpha-solenoids in eukaryotic genomes and in some prokaryotic families, such as Cyanobacteria and Planctomycetes, which could be associated to increased cellular complexity. The method is available at http://cbdm.mdc-berlin.de/~ard2/. © 2013 Fournier et al.",
                "authors": [
                    {
                        "name": "Andrade-Navarro M.A."
                    },
                    {
                        "name": "Fournier D."
                    },
                    {
                        "name": "Palidwor G.A."
                    },
                    {
                        "name": "Perez-Iratxeta C."
                    },
                    {
                        "name": "Schaefer M.H."
                    },
                    {
                        "name": "Shcherbinin S."
                    },
                    {
                        "name": "Szengel A."
                    }
                ],
                "citationCount": 20,
                "date": "2013-11-21T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Functional and genomic analyses of alpha-solenoid proteins"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
