{
    "additionDate": "2019-11-14T18:41:52Z",
    "biotoolsCURIE": "biotools:tmhop",
    "biotoolsID": "tmhop",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "sarel@weizmann.ac.il",
            "name": "Sarel Jacob Fleishman",
            "orcidid": "https://orcid.org/0000-0003-3177-7560",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/UTAP (WEIZMANN.AC.IL), bio.tools/equilibrator (WEIZMANN.AC.IL), bio.tools/promateus (WEIZMANN.AC.IL), bio.tools/dipole (WEIZMANN.AC.IL), bio.tools/space (WEIZMANN.AC.IL) | > CORRECT NAME OF TOOL COULD ALSO BE 'energy', 'dsTbL', 'Rosetta' | A lipophilicity-based energy function for membrane-protein modelling and design | Valid academic email address to send the reports to | I am from an academic institute*",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://tmhop.weizmann.ac.il",
    "lastUpdate": "2019-11-14T18:41:52Z",
    "name": "tmhop",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007318",
            "metadata": {
                "abstract": "Copyright: © 2019 Weinstein et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Membrane-protein design is an exciting and increasingly successful research area which has led to landmarks including the design of stable and accurate membrane-integral proteins based on coiled-coil motifs. Design of topologically more complex proteins, such as most receptors, channels, and transporters, however, demands an energy function that balances contributions from intra-protein contacts and protein-membrane interactions. Recent advances in water-soluble all-atom energy functions have increased the accuracy in structure-prediction benchmarks. The plasma membrane, however, imposes different physical constraints on protein solvation. To understand these constraints, we recently developed a high-throughput experimental screen, called dsTβL, and inferred apparent insertion energies for each amino acid at dozens of positions across the bacterial plasma membrane. Here, we express these profiles as lipophilicity energy terms in Rosetta and demonstrate that the new energy function outperforms previous ones in modelling and design benchmarks. Rosetta ab initio simulations starting from an extended chain recapitulate two-thirds of the experimentally determined structures of membrane-spanning homo-oligomers with <2.5Å root-mean-square deviation within the top-predicted five models (available online: http://tmhop.weizmann.ac.il). Furthermore, in two sequence-design benchmarks, the energy function improves discrimination of stabilizing point mutations and recapitulates natural membrane-protein sequences of known structure, thereby recommending this new energy function for membrane-protein modelling and design.",
                "authors": [
                    {
                        "name": "Weinstein J.Y."
                    },
                    {
                        "name": "Elazar A."
                    },
                    {
                        "name": "Fleishman S.J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "A lipophilicity-based energy function for membrane-protein modelling and design"
            },
            "pmcid": "PMC6736313",
            "pmid": "31461441"
        }
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}