
{
    "credit": [
        {
            "email": "hong.wang@uky.edu",
            "name": "hong wang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/NanoStringDiff.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/NanoStringDiff_1.4.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.The advanced medium-throughput NanoString nCounter technology has been increasingly used for mRNA or miRNA differential expression (DE) studies due to its advantages including direct measurement of molecule expression levels without amplification, digital readout and superior applicability to formalin fixed paraffin embedded samples. However, the analysis of nCounter data is hampered because most methods developed are based on t-tests, which do not fit the count data generated by the NanoString nCounter system. Furthermore, data normalization procedures of current methods are either not suitable for counts or not specific for NanoString nCounter data. We develop a novel DE detection method based on NanoString nCounter data. The method, named NanoStringDiff, considers a generalized linear model of the negative binomial family to characterize count data and allows for multifactor design. Data normalization is incorporated in the model framework through data normalization parameters, which are estimated from positive controls, negative controls and housekeeping genes embedded in the nCounter system. We propose an empirical Bayes shrinkage approach to estimate the dispersion parameter in the model and a likelihood ratio test to identify differentially expressed genes. Simulations and real data analysis demonstrate that the proposed method performs better than existing methods.",
            "authors": [
                "Wang H.",
                "Horbinski C.",
                "Wu H.",
                "Liu Y.",
                "Sheng S.",
                "Liu J.",
                "Weiss H.",
                "Stromberg A.J.",
                "Wang C."
            ],
            "cit_count": 14,
            "doi": "10.1093/nar/gkw677",
            "journal": "Nucleic Acids Research",
            "title": "NanoStringDiff: A novel statistical method for differential expression analysis based on NanoString nCounter data",
            "type": "Primary",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nanostringdiff",
        "biotoolsID": "nanostringdiff",
        "description": "This Package utilizes a generalized linear model(GLM) of the negative binomial family to characterize count data and allows for multi-factor design. It incorporates size factors, calculated from positive controls and housekeeping controls, and background level, obtained from negative controls, in the model framework so that all the normalization information provided by NanoString nCounter Analyzer is fully utilized.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/NanoStringDiff.html",
        "name": "NanoStringDiff",
        "version": [
            "1.4.0"
        ]
    }
}