{
    "additionDate": "2020-01-14T08:51:53Z",
    "biotoolsCURIE": "biotools:Easy-HLA",
    "biotoolsID": "Easy-HLA",
    "confidence_flag": "tool",
    "description": "A validated web application suite to reveal the full details of HLA typing.\n\nNomenclature for Factors of the HLA System.\n\nThe WHO Nomenclature Committee for Factors of the HLA System comprises the following individuals:.\n\nEasyMatch-R is a tool designed to find unrelated donors in silico. We aim to improve efficiency by saving time and resources in HLA labs. From a patient’s HLA typing in input, Easymatch-R displays probability of finding a potential unrelated bone marrow donor according to the required matching level. In addition to the number of expected donors, Easymatch-R provides complementary typings recomendations.\nHLA-Upgrade uses the power of haplotypes to predict full high resolution HLA-A, B, C, DRB1, DQB1 genotypes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://hla.univ-nantes.fr",
    "lastUpdate": "2020-12-25T11:22:49Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://hla.alleles.org/nomenclature/committee.html"
        }
    ],
    "name": "Easy-HLA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ875",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: The HLA system plays a pivotal role in both clinical applications and immunology research. Typing HLA genes in patient and donor is indeed required in hematopoietic stem cell and solid-organ transplantation, and the histocompatibility complex region exhibits countless genetic associations with immune-related pathologies. Since the discovery of HLA antigens, the HLA system nomenclature and typing methods have constantly evolved, which leads to difficulties in using data generated with older methodologies. Results: Here, we present Easy-HLA, a web-based software suite designed to facilitate analysis and gain knowledge from HLA typing, regardless of nomenclature or typing method. Easy-HLA implements a computational and statistical method of HLA haplotypes inference based on published reference populations containing over 600 000 haplotypes to upgrade missing or partial HLA information: 'HLA-Upgrade' tool infers high-resolution HLA typing and 'HLA-2-Haplo' imputes haplotype pairs and provides additional functional annotations (e.g. amino acids and KIR ligands). We validated both tools using two independent cohorts (total n = 2500). For HLA-Upgrade, we reached a prediction accuracy of 92% from low-to high-resolution of European genotypes. We observed a 96% call rate and 76% accuracy with HLA-2-Haplo European haplotype pairs prediction. In conclusion, Easy-HLA tools facilitate large-scale immunogenetic analysis and promotes the multi-faceted HLA expertise beyond allelic associations by providing new functional immunogenomics parameters.",
                "authors": [
                    {
                        "name": "Geffard E."
                    },
                    {
                        "name": "Limou S."
                    },
                    {
                        "name": "Walencik A."
                    },
                    {
                        "name": "Daya M."
                    },
                    {
                        "name": "Watson H."
                    },
                    {
                        "name": "Torgerson D."
                    },
                    {
                        "name": "Barnes K.C."
                    },
                    {
                        "name": "Cesbron Gautier A."
                    },
                    {
                        "name": "Gourraud P.-A."
                    },
                    {
                        "name": "Vince N."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Easy-HLA: A validated web application suite to reveal the full details of HLA typing"
            },
            "pmid": "31750874"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}