{
    "additionDate": "2018-06-18T11:25:09Z",
    "biotoolsCURIE": "biotools:circadiomics",
    "biotoolsID": "circadiomics",
    "credit": [
        {
            "email": "pfbaldi@ics.uci.edu",
            "name": "Pierre Baldi",
            "orcidid": "https://orcid.org/0000-0001-8752-4664"
        },
        {
            "email": "nickceglia@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Integrating circadian genomics, transcriptomics, proteomics and metabolomics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://circadiomics.ics.uci.edu/help#trouble"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://circadiomics.ics.uci.edu",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-09-23T13:24:26.173479Z",
    "name": "CircadiOmics",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky441",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Circadian rhythms play a fundamental role at all levels of biological organization. Understanding the mechanisms and implications of circadian oscillations continues to be the focus of intense research. However, there has been no comprehensive and integrated way for accessing and mining all circadian omic datasets. The latest release of CircadiOmics (http://circadiomics.ics.uci.edu) fills this gap for providing the most comprehensive web server for studying circadian data. The newly updated version contains high-throughput 227 omic datasets corresponding to over 74 million measurements sampled over 24 h cycles. Users can visualize and compare oscillatory trajectories across species, tissues and conditions. Periodicity statistics (e.g. period, amplitude, phase, P-value, q-value etc.) obtained from BIO-CYCLE and other methods are provided for all samples in the repository and can easily be downloaded in the form of publication-ready figures and tables. New features and substantial improvements in performance and data volume make CircadiOmics a powerful web portal for integrated analysis of circadian omic data.",
                "authors": [
                    {
                        "name": "Agostinelli F."
                    },
                    {
                        "name": "Baldi P."
                    },
                    {
                        "name": "Ceglia N."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Eckel-Mahan K."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Sassone-Corsi P."
                    }
                ],
                "citationCount": 24,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CircadiOmics: Circadian omic web portal"
            }
        },
        {
            "doi": "10.1093/NAR/GKAC419",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Circadian rhythms are a foundational aspect of biology. These rhythms are found at the molecular level in every cell of every living organism and they play a fundamental role in homeostasis and a variety of physiological processes. As a result, biomedical research of circadian rhythms continues to expand at a rapid pace. To support this research, CircadiOmics (http://circadiomics.igb.uci.edu/) is the largest annotated repository and analytic web server for high-throughput omic (e.g. transcriptomic, metabolomic, proteomic) circadian time series experimental data. CircadiOmics contains over 290 experiments and over 100 million individual measurements, across >20 unique tissues/organs, and 11 different species. Users are able to visualize and mine these datasets by deriving and comparing periodicity statistics for oscillating molecular species including: period, amplitude, phase, P-value and q-value. These statistics are obtained from BIO_CYCLE and JTK_CYCLE and are intuitively aggregated and displayed for comparison. CircadiOmics is the most up-to-date and cutting-edge web portal for searching and analyzing circadian omic data and is used by researchers around the world.",
                "authors": [
                    {
                        "name": "Agostinelli F."
                    },
                    {
                        "name": "Baldi P."
                    },
                    {
                        "name": "Samad M."
                    },
                    {
                        "name": "Sato T."
                    },
                    {
                        "name": "Shimaji K."
                    }
                ],
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CircadiOmics: circadian omic web portal"
            },
            "pmcid": "PMC9252794",
            "pmid": "35657089"
        }
    ],
    "toolType": [
        "Database portal",
        "Web service"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        }
    ],
    "validated": 1
}
