
{
    "credit": [
        {
            "email": "nickceglia@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://circadiomics.ics.uci.edu/help#trouble"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Python"
        ],
        "toolType": [
            "Web service",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research. Circadian rhythms play a fundamental role at all levels of biological organization. Understanding the mechanisms and implications of circadian oscillations continues to be the focus of intense research. However, there has been no comprehensive and integrated way for accessing and mining all circadian omic datasets. The latest release of CircadiOmics (http://circadiomics.ics.uci.edu) fills this gap for providing the most comprehensive web server for studying circadian data. The newly updated version contains high-throughput 227 omic datasets corresponding to over 74 million measurements sampled over 24 h cycles. Users can visualize and compare oscillatory trajectories across species, tissues and conditions. Periodicity statistics (e.g. period, amplitude, phase, P-value, q-value etc.) obtained from BIO-CYCLE and other methods are provided for all samples in the repository and can easily be downloaded in the form of publication-ready figures and tables. New features and substantial improvements in performance and data volume make CircadiOmics a powerful web portal for integrated analysis of circadian omic data.",
            "authors": [
                "Ceglia N.",
                "Liu Y.",
                "Chen S.",
                "Agostinelli F.",
                "Eckel-Mahan K.",
                "Sassone-Corsi P.",
                "Baldi P."
            ],
            "cit_count": 1,
            "doi": "10.1093/nar/gky441",
            "journal": "Nucleic Acids Research",
            "title": "CircadiOmics: Circadian omic web portal",
            "year": "2018-07-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:circadiomics",
        "biotoolsID": "circadiomics",
        "description": "Integrating circadian genomics, transcriptomics, proteomics and metabolomics.",
        "homepage": "http://circadiomics.ics.uci.edu",
        "name": "CircadiOmics"
    }
}