{
    "additionDate": "2017-08-03T18:57:24Z",
    "biotoolsCURIE": "biotools:rapid",
    "biotoolsID": "rapid",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biomine.cs.vcu.edu/index.html"
        }
    ],
    "description": "Server providing fast and accurate sequence based prediction of protein disorder content.",
    "documentation": [
        {
            "type": "General",
            "url": "http://biomine.cs.vcu.edu/servers/RAPID/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://biomine.cs.vcu.edu/servers/RAPID/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rapid-regression-based-accurate-prediction-of-protein-intrinsic-disorder-content.html"
        }
    ],
    "name": "RAPID",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Recent research in the protein intrinsic disorder was stimulated by the availability of accurate computational predictors. However, most of these methods are relatively slow, especially considering proteome-scale applications, and were shown to produce relatively large errors when estimating disorder at the protein- (in contrast to residue-) level, which is defined by the fraction/content of disordered residues. To this end, we propose a novel support vector Regression-based Accurate Predictor of Intrinsic Disorder (RAPID). Key advantages of RAPID are speed (prediction of anaverage-size eukaryotic proteome takes <1 hon a modern desktop computer); sophisticated design (multiple, complementary information sources that are aggregated over an input chain are combined using feature selection); and high-quality and robust predictive performance. Empirical tests on two diverse benchmark datasets reveal that RAPID's predictive performance compares favorably to a comprehensive set of state-of-the-art disorder and disorder content predictors. Drawing on high speed and good predictive quality, RAPID was used to perform large-scale characterization of disorder in 200+ fully sequenced eukaryotic proteomes. Our analysis reveals interesting relations of disorder with structural coverage and chain length, and unusual distribution of fully disordered chains. We also performed a comprehensive (using 56000+ annotated chains, which doubles the scope of previous studies) investigation of cellular functions and localizations that are enriched inthe disorder in the human proteome. RAPID, which allows for batch (proteome-wide) predictions, is available as a web server at http://biomine.ece.ualberta.ca/RAPID/. © 2013 Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Yan J."
                    },
                    {
                        "name": "Mizianty M.J."
                    },
                    {
                        "name": "Filipow P.L."
                    },
                    {
                        "name": "Uversky V.N."
                    },
                    {
                        "name": "Kurgan L."
                    }
                ],
                "citationCount": 22,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Proteins and Proteomics",
                "title": "RAPID: Fast and accurate sequence-based prediction of intrinsic disorder content on proteomic scale"
            },
            "pmid": "23732563"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}