{
    "additionDate": "2017-03-27T07:56:40Z",
    "biotoolsCURIE": "biotools:t3db",
    "biotoolsID": "t3db",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://feedback.wishartlab.com/?site=t3db"
        },
        {
            "name": "Wishart Lab's twitter",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://twitter.com/WishartLab"
        }
    ],
    "description": "Unique bioinformatics resource that compiles comprehensive information about common or ubiquitous toxins and their toxin-targets. Each record (ToxCard) contains over 80 data fields providing detailed information on chemical properties and descriptors, toxicity values, protein and gene sequences (for both targets and toxins), molecular and cellular interaction data, toxicological data, mechanistic information and references.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.t3db.ca/help/fields"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.t3db.org",
    "language": [
        "Perl",
        "Ruby"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "T3DB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In an effort to capture meaningful biological, chemical and mechanistic information about clinically relevant, commonly encountered or important toxins, we have developed the Toxin and Toxin-Target Database (T3DB). The T3DB is a unique bioinformatics resource that compiles comprehensive information about common or ubiquitous toxins and their toxin-targets into a single electronic repository. The database currently contains over 2900 small molecule and peptide toxins, 1300 toxin-targets and more than 33 000 toxin-target associations. Each T3DB record (ToxCard) contains over 80 data fields providing detailed information on chemical properties and descriptors, toxicity values, protein and gene sequences (for both targets and toxins), molecular and cellular interaction data, toxicological data, mechanistic information and references. This information has been manually extracted and manually verified from numerous sources, including other electronic databases, government documents, textbooks and scientific journals. A key focus of the T3DB is on providing 'depth' over 'breadth' with detailed descriptions, mechanisms of action, and information on toxins and toxin-targets. T3DB is fully searchable and supports extensive text, sequence, chemical structure and relational query searches, similar to those found in the Human Metabolome Database (HMDB) and DrugBank. Potential applications of the T3DB include clinical metabolomics, toxin target prediction, toxicity prediction and toxicology education. The T3DB is available online at http://www.t3db.org. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Djoumbou Y."
                    },
                    {
                        "name": "Guo A.C."
                    },
                    {
                        "name": "Knox C."
                    },
                    {
                        "name": "Lim E."
                    },
                    {
                        "name": "Neveu V."
                    },
                    {
                        "name": "Pon A."
                    },
                    {
                        "name": "Shrivastava S."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 84,
                "date": "2009-11-06T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "T3DB: A comprehensively annotated database of common toxins and their targets"
            },
            "pmid": "19897546"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ],
    "validated": 1
}
