{
    "additionDate": "2020-01-09T17:51:39Z",
    "biotoolsCURIE": "biotools:TITAN",
    "biotoolsID": "TITAN",
    "confidence_flag": "high",
    "description": "A Code for Modeling and Generating Electric Fields-Features and Applications to Enzymatic Reactivity.\n\nTITAN (elecTric fIeld generaTion And maNipulation) is being developed by:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein dipole moment calculation",
                    "uri": "http://edamontology.org/operation_0386"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://titan-code.github.io",
    "lastUpdate": "2020-01-09T17:51:39Z",
    "name": "TITAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JCC.26072",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.We present here a versatile computational code named “elecTric fIeld generaTion And maNipulation (TITAN),” capable of generating various types of external electric fields, as well as quantifying the local (or intrinsic) electric fields present in proteins and other biological systems according to Coulomb's Law. The generated electric fields can be coupled with quantum mechanics (QM), molecular mechanics (MM), QM/MM, and molecular dynamics calculations in most available software packages. The capabilities of the TITAN code are illustrated throughout the text with the help of examples. We end by presenting an application, in which the effects of the local electric field on the hydrogen transfer reaction in cytochrome P450 OleTJE enzyme and the modifications induced by the application of an oriented external electric field are examined. We find that the protein matrix in P450 OleTJE acts as a moderate catalyst and that orienting an external electric field along the Fe─O bond of compound I has the biggest impact on the reaction barrier. The induced catalysis/inhibition correlates with the calculated spin density on the O-atom. © 2019 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Stuyver T."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Mallick D."
                    },
                    {
                        "name": "Danovich D."
                    },
                    {
                        "name": "Shaik S."
                    }
                ],
                "date": "2020-01-05T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "TITAN: A Code for Modeling and Generating Electric Fields—Features and Applications to Enzymatic Reactivity"
            },
            "pmid": "31568581"
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ]
}