{
    "additionDate": "2017-01-17T15:00:02Z",
    "biotoolsCURIE": "biotools:narrowpeaks",
    "biotoolsID": "narrowpeaks",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "pm12@sanger.ac.uk",
            "name": "Pedro Madrigal",
            "orcidid": "http://orcid.org/0000-0003-1959-8199",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package applies a functional version of principal component analysis to postprocess data in wiggle track format, commonly produced by generic ChIP-seq peak callers, by applying FPCA over a set of read-enriched regions (ChIP-seq peaks) and to analyse differential variation between multiple ChIP-seq samples with replicates.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/NarrowPeaks.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/NarrowPeaks_1.18.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component plotting",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/NarrowPeaks.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T00:35:20Z",
    "license": "Artistic-2.0",
    "name": "NarrowPeaks",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s13059-015-0597-1",
            "metadata": {
                "abstract": "© 2015 Mateos et al.; licensee BioMed Central.Background: The initiation of flowering is an important developmental transition as it marks the beginning of the reproductive phase in plants. The MADS-box transcription factors (TFs) FLOWERING LOCUS C (FLC) and SHORT VEGETATIVE PHASE (SVP) form a complex to repress the expression of genes that initiate flowering in Arabidopsis. Both TFs play a central role in the regulatory network by conferring seasonal patterns of flowering. However, their interdependence and biological relevance when acting as a complex have not been extensively studied. Results: We characterized the effects of both TFs individually and as a complex on flowering initiation using transcriptome profiling and DNA-binding occupancy. We find four major clusters regulating transcriptional responses, and that DNA binding scenarios are highly affected by the presence of the cognate partner. Remarkably, we identify genes whose regulation depends exclusively on simultaneous action of both proteins, thus distinguishing between the specificity of the SVP:FLC complex and that of each TF acting individually. The downstream targets of the SVP:FLC complex include a higher proportion of genes regulating floral induction, whereas those bound by either TF independently are biased towards floral development. Many genes involved in gibberellin-related processes are bound by the SVP:FLC complex, suggesting that direct regulation of gibberellin metabolism by FLC and SVP contributes to their effects on flowering. Conclusions: The regulatory codes controlled by SVP and FLC were deciphered at the genome-wide level revealing substantial flexibility based on dependent and independent DNA binding that may contribute to variation and robustness in the regulation of flowering.",
                "authors": [
                    {
                        "name": "Mateos J.L."
                    },
                    {
                        "name": "Madrigal P."
                    },
                    {
                        "name": "Tsuda K."
                    },
                    {
                        "name": "Rawat V."
                    },
                    {
                        "name": "Richter R."
                    },
                    {
                        "name": "Romera-Branchat M."
                    },
                    {
                        "name": "Fornara F."
                    },
                    {
                        "name": "Schneeberger K."
                    },
                    {
                        "name": "Krajewski P."
                    },
                    {
                        "name": "Coupland G."
                    }
                ],
                "citationCount": 63,
                "date": "2015-02-11T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Combinatorial activities of SHORT VEGETATIVE PHASE and FLOWERING LOCUS C define distinct modes of flowering regulation in Arabidopsis"
            },
            "pmcid": "PMC4378019",
            "pmid": "25853185",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "1.18.0"
    ]
}