{
    "additionDate": "2018-10-14T19:42:27Z",
    "biotoolsCURIE": "biotools:rregrs",
    "biotoolsID": "rregrs",
    "credit": [
        {
            "email": "gtsiliki@central.nuta.gr",
            "name": "Georgia Tsiliki",
            "orcidid": "http://orcid.org/0000-0001-7209-3670",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RRegrs is an integrated framework for creating multiple regression models.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/enanomapper/RRegrs/blob/master/RRegrs-package-tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/enanomapper/RRegrs",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T01:22:51Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/enanomapper/RRegrs/issues"
        }
    ],
    "name": "RRegrs",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s13321-015-0094-2",
            "metadata": {
                "abstract": "© 2015 Tsiliki et al.Background: Predictive regression models can be created with many different modelling approaches. Choices need to be made for data set splitting, cross-validation methods, specific regression parameters and best model criteria, as they all affect the accuracy and efficiency of the produced predictive models, and therefore, raising model reproducibility and comparison issues. Cheminformatics and bioinformatics are extensively using predictive modelling and exhibit a need for standardization of these methodologies in order to assist model selection and speed up the process of predictive model development. A tool accessible to all users, irrespectively of their statistical knowledge, would be valuable if it tests several simple and complex regression models and validation schemes, produce unified reports, and offer the option to be integrated into more extensive studies. Additionally, such methodology should be implemented as a free programming package, in order to be continuously adapted and redistributed by others. Results: We propose an integrated framework for creating multiple regression models, called RRegrs. The tool offers the option of ten simple and complex regression methods combined with repeated 10-fold and leave-one-out cross-validation. Methods include Multiple Linear regression, Generalized Linear Model with Stepwise Feature Selection, Partial Least Squares regression, Lasso regression, and Support Vector Machines Recursive Feature Elimination. The new framework is an automated fully validated procedure which produces standardized reports to quickly oversee the impact of choices in modelling algorithms and assess the model and cross-validation results. The methodology was implemented as an open source R package, available at https://www.github.com/enanomapper/RRegrs, by reusing and extending on the caret package. Conclusion: The universality of the new methodology is demonstrated using five standard data sets from different scientific fields. Its efficiency in cheminformatics and QSAR modelling is shown with three use cases: proteomics data for surface-modified gold nanoparticles, nano-metal oxides descriptor data, and molecular descriptors for acute aquatic toxicity data. The results show that for all data sets RRegrs reports models with equal or better performance for both training and test sets than those reported in the original publications. Its good performance as well as its adaptability in terms of parameter optimization could make RRegrs a popular framework to assist the initial exploration of predictive models, and with that, the design of more comprehensive in silico screening applications. Graphical abstract RRegrs is a computer-aided model selection framework for R multiple regression models; this is a fully validated procedure with application to QSAR modelling.",
                "authors": [
                    {
                        "name": "Tsiliki G."
                    },
                    {
                        "name": "Munteanu C.R."
                    },
                    {
                        "name": "Seoane J.A."
                    },
                    {
                        "name": "Fernandez-Lozano C."
                    },
                    {
                        "name": "Sarimveis H."
                    },
                    {
                        "name": "Willighagen E.L."
                    }
                ],
                "citationCount": 32,
                "date": "2015-09-15T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "RRegrs: An R package for computer-aided model selection with multiple regression models"
            },
            "pmcid": "PMC4570700",
            "pmid": "26379782",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "0.0.5"
    ]
}