{
    "additionDate": "2019-11-14T19:33:46Z",
    "biotoolsCURIE": "biotools:cuteSV",
    "biotoolsID": "cuteSV",
    "confidence_flag": "tool",
    "description": "Long Read based Human Genomic Structural Variation Detection with cuteSV | Long-read sequencing technologies enable to comprehensively discover structural variations (SVs). However, it is still non-trivial for state-of-the-art approaches to detect SVs with high sensitivity or high performance or both. Herein, we propose cuteSV, a sensitive, fast and lightweight SV detection approach. cuteSV uses tailored methods to comprehensively collect various types of SV signatures, and a clustering-and-refinement method to implement a stepwise SV detection, which enables to achieve high sensitivity without loss of accuracy. Benchmark results demonstrate that cuteSV has better yields on real datasets. Further, its speed and scalability are outstanding and promising to large-scale data analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Split read mapping",
                    "uri": "http://edamontology.org/operation_3199"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tjiangHIT/cuteSV",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T10:46:55Z",
    "license": "MIT",
    "name": "cuteSV",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/780700"
        },
        {
            "doi": "10.1186/s13059-020-02107-y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Long-read sequencing is promising for the comprehensive discovery of structural variations (SVs). However, it is still non-trivial to achieve high yields and performance simultaneously due to the complex SV signatures implied by noisy long reads. We propose cuteSV, a sensitive, fast, and scalable long-read-based SV detection approach. cuteSV uses tailored methods to collect the signatures of various types of SVs and employs a clustering-and-refinement method to implement sensitive SV detection. Benchmarks on simulated and real long-read sequencing datasets demonstrate that cuteSV has higher yields and scaling performance than state-of-the-art tools. cuteSV is available at https://github.com/tjiangHIT/cuteSV.",
                "authors": [
                    {
                        "name": "Cui Z."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Jiang T."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 7,
                "date": "2020-08-03T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Long-read-based human genomic structural variation detection with cuteSV"
            },
            "pmcid": "PMC7477834",
            "pmid": "32746918"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
