{
    "additionDate": "2018-07-17T14:39:43Z",
    "biotoolsCURIE": "biotools:animalnexus",
    "biotoolsID": "animalnexus",
    "credit": [
        {
            "email": "slazerte@tru.ca",
            "name": "Stefanie E. LaZerte",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Transforming and visualizing animal movement data from static stations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://animalnexus.ca/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "http://animalnexus.ca/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "animalnexus",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1002/ece3.3240",
            "metadata": {
                "abstract": "© 2017 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Radio frequency identification (RFID) provides a simple and inexpensive approach for examining the movements of tagged animals, which can provide information on species behavior and ecology, such as habitat/resource use and social interactions. In addition, tracking animal movements is appealing to naturalists, citizen scientists, and the general public and thus represents a tool for public engagement in science and science education. Although a useful tool, the large amount of data collected using RFID may quickly become overwhelming. Here, we present an R package (feedr) we have developed for loading, transforming, and visualizing time-stamped, georeferenced data, such as RFID data collected from static logger stations. Using our package, data can be transformed from raw RFID data to visits, presence (regular detections by a logger over time), movements between loggers, displacements, and activity patterns. In addition, we provide several conversion functions to allow users to format data for use in functions from other complementary R packages. Data can also be visualized through static or interactive maps or as animations over time. To increase accessibility, data can be transformed and visualized either through R directly, or through the companion site: http://animalnexus.ca, an online, user-friendly, R-based Shiny Web application. This system can be used by professional and citizen scientists alike to view and study animal movements. We have designed this package to be flexible and to be able to handle data collected from other stationary sources (e.g., hair traps, static very high frequency (VHF) telemetry loggers, observations of marked individuals in colonies or staging sites), and we hope this framework will become a meeting point for science, education, and community awareness of the movements of animals. We aim to inspire citizen engagement while simultaneously enabling robust scientific analysis.",
                "authors": [
                    {
                        "name": "LaZerte S.E."
                    },
                    {
                        "name": "Reudink M.W."
                    },
                    {
                        "name": "Otter K.A."
                    },
                    {
                        "name": "Kusack J."
                    },
                    {
                        "name": "Bailey J.M."
                    },
                    {
                        "name": "Woolverton A."
                    },
                    {
                        "name": "Paetkau M."
                    },
                    {
                        "name": "de Jong A."
                    },
                    {
                        "name": "Hill D.J."
                    }
                ],
                "citationCount": 5,
                "date": "2017-10-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "feedr and animalnexus.ca: A paired R package and user-friendly Web application for transforming and visualizing animal movement data from static stations"
            },
            "pmcid": "PMC5632613",
            "pmid": "29043042"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ],
    "validated": 1
}