{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-10-22T09:29:00Z",
    "biotoolsCURIE": "biotools:bpositive",
    "biotoolsID": "bpositive",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jbvieira@ibmc.up.pt",
            "name": "Jorge Vieira",
            "orcidid": "https://orcid.org/0000-0001-7032-5220",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mrjato@uvigo.es",
            "name": "Miguel Reboiro-Jato",
            "orcidid": "https://orcid.org/0000-0001-8749-2703",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "hlfernandez@uvigo.es",
            "name": "Hugo López-Fernández",
            "orcidid": "https://orcid.org/0000-0002-6476-7206",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "nvazquezg@gmail.com",
            "name": "Noé Vázquez",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "cgvieira@ibmc.up.pt",
            "name": "Cristina P. Vieira",
            "orcidid": "https://orcid.org/0000-0002-7139-2107",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "email": "riverola@uvigo.es",
            "name": "Florentino Fdez-Riverola",
            "orcidid": "https://orcid.org/0000-0002-3943-8013",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Instituto de Investigação e Inovação em Saúde (i3S)",
            "typeEntity": "Institute",
            "url": "https://www.i3s.up.pt/"
        },
        {
            "name": "Instituto de Biologia Molecular e Celular (IBMC)",
            "typeEntity": "Institute",
            "url": "https://www.ibmc.up.pt/"
        },
        {
            "name": "Universidade de Vigo",
            "typeEntity": "Institute",
            "url": "https://www.uvigo.gal/en"
        },
        {
            "name": "Centro de Investigaciones Biomédicas (CINBIO)",
            "typeEntity": "Institute",
            "url": "http://cinbio.es/en/portada-en/"
        },
        {
            "name": "Instituto de Investigación Sanitaria Galicia Sur (IISGS)",
            "typeEntity": "Institute",
            "url": "http://www.iisgaliciasur.es/?lang=en"
        }
    ],
    "description": "A database of positive selection projects in ADOPS format.",
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Portugal"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://bpositive.i3s.up.pt/",
    "lastUpdate": "2019-10-22T14:02:46Z",
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/sing-group/bpositive"
        }
    ],
    "maturity": "Mature",
    "name": "bpositive",
    "owner": "jbvieira",
    "publication": [
        {
            "doi": "10.1007/s12539-018-0282-7",
            "metadata": {
                "abstract": "© 2018, The Author(s). When changes at few amino acid sites are the target of selection, adaptive amino acid changes in protein sequences can be identified using maximum-likelihood methods based on models of codon substitution (such as codeml). Although such methods have been employed numerous times using a variety of different organisms, the time needed to collect the data and prepare the input files means that tens or hundreds of coding regions are usually analyzed. Nevertheless, the recent availability of flexible and easy to use computer applications that collect relevant data (such as BDBM) and infer positively selected amino acid sites (such as ADOPS), means that the entire process is easier and quicker than before. However, the lack of a batch option in ADOPS, here reported, still precludes the analysis of hundreds or thousands of sequence files. Given the interest and possibility of running such large-scale projects, we have also developed a database where ADOPS projects can be stored. Therefore, this study also presents the B+ database, which is both a data repository and a convenient interface that looks at the information contained in ADOPS projects without the need to download and unzip the corresponding ADOPS project file. The ADOPS projects available at B+ can also be downloaded, unzipped, and opened using the ADOPS graphical interface. The availability of such a database ensures results repeatability, promotes data reuse with significant savings on the time needed for preparing datasets, and effortlessly allows further exploration of the data contained in ADOPS projects.",
                "authors": [
                    {
                        "name": "Vazquez N."
                    },
                    {
                        "name": "Vieira C.P."
                    },
                    {
                        "name": "Amorim B.S.R."
                    },
                    {
                        "name": "Torres A."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Fdez-Riverola F."
                    },
                    {
                        "name": "Sousa J.L.R."
                    },
                    {
                        "name": "Reboiro-Jato M."
                    },
                    {
                        "name": "Vieira J."
                    }
                ],
                "citationCount": 4,
                "date": "2018-03-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "Large Scale Analyses and Visualization of Adaptive Amino Acid Changes Projects"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1007/978-3-319-60816-7_3",
            "metadata": {
                "abstract": "© Springer International Publishing AG 2017. When changes at few amino acid sites are the target of selection, adaptive amino acid changes in protein sequences can be identified using maximum-likelihood methods based on models of codon substitution (such as codeml). Such methods have been used numerous times using a variety of different organisms but the time needed to collect the data and prepare the input files means that tens or a couple of hundred coding regions are usually analyzed. Nevertheless, the recent availability of flexible and ease to use computer applications to collect the relevant data (such as BDBM), and infer positively selected amino acid sites (such as ADOPS) means that the whole process is easier and quicker than before, but the lack of a batch option in ADOPS, here reported, still precluded the analysis of hundreds or thousands of sequence files. Given the interest and possibility of running such large scale projects, we also developed a database where ADOPS projects can be stored. Therefore, here we also present B+ that is both a data repository and a convenient interface to look at the information contained in ADOPS projects without the need to download and unzip the corresponding ADOPS project file. The ADOPS projects available at B+ can also be downloaded, unzipped, and opened using the ADOPS graphical interface. The availability of such a database ensures results repeatability, promotes data reuse with significant savings on the time needed for preparing datasets, and allows further exploration of the data contained in ADOPS projects effortlessly.",
                "authors": [
                    {
                        "name": "Vazquez N."
                    },
                    {
                        "name": "Vieira C.P."
                    },
                    {
                        "name": "Amorim B.S.R."
                    },
                    {
                        "name": "Torres A."
                    },
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Fdez-Riverola F."
                    },
                    {
                        "name": "Sousa J.L.R."
                    },
                    {
                        "name": "Reboiro-Jato M."
                    },
                    {
                        "name": "Vieira J."
                    }
                ],
                "date": "2017-01-01T00:00:00Z",
                "journal": "Advances in Intelligent Systems and Computing",
                "title": "Automated collection and sharing of adaptive amino acid changes data"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ]
}