{
    "additionDate": "2018-08-06T13:01:29Z",
    "biotoolsCURIE": "biotools:cmfsm",
    "biotoolsID": "cmfsm",
    "credit": [
        {
            "email": "benyunshi@outlook.com",
            "name": "Benyun Shi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "pengshaoliang@nudt.edu.cn",
            "name": "Shaoliang PengEmail author",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A parallel acceleration tool for classical frequent subgraph mining algorithm. The core idea is to employ parallel techniques to parallelize extension tasks, so as to reduce computation time. On the other hand, multi-node strategy is employed to solve the problem of memory constraints.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ysycloud/cmFSM/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ysycloud/cmFSM",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "cmFSM",
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2071-z",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Frequent subgraphs mining is a significant problem in many practical domains. The solution of this kind of problem can particularly used in some large-scale drug molecular or biological libraries to help us find drugs or core biological structures rapidly and predict toxicity of some unknown compounds. The main challenge is its efficiency, as (i) it is computationally intensive to test for graph isomorphisms, and (ii) the graph collection to be mined and mining results can be very large. Existing solutions often require days to derive mining results from biological networks even with relative low support threshold. Also, the whole mining results always cannot be stored in single node memory. Results: In this paper, we implement a parallel acceleration tool for classical frequent subgraph mining algorithm called cmFSM. The core idea is to employ parallel techniques to parallelize extension tasks, so as to reduce computation time. On the other hand, we employ multi-node strategy to solve the problem of memory constraints. The parallel optimization of cmFSM is carried out on three different levels, including the fine-grained OpenMP parallelization on single node, multi-node multi-process parallel acceleration and CPU-MIC collaborated parallel optimization. Conclusions: Evaluation results show that cmFSM clearly outperforms the existing state-of-the-art miners even if we only hold a few parallel computing resources. It means that cmFSM provides a practical solution to frequent subgraph mining problem with huge number of mining results. Specifically, our solution is up to one order of magnitude faster than the best CPU-based approach on single node and presents a promising scalability of massive mining tasks in multi-node scenario. More source code are available at:Source Code: https://github.com/ysycloud/cmFSM.",
                "authors": [
                    {
                        "name": "Guo R."
                    },
                    {
                        "name": "Liao X."
                    },
                    {
                        "name": "Liu R."
                    },
                    {
                        "name": "Peng S."
                    },
                    {
                        "name": "Shi B."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 5,
                "date": "2018-05-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "cmFSM: A scalable CPU-MIC coordinated drug-finding tool by frequent subgraph mining"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}
