{
    "additionDate": "2021-01-18T08:36:46Z",
    "biotoolsCURIE": "biotools:avis",
    "biotoolsID": "avis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yasuoka@mech.keio.ac.jp",
            "name": "Kenji Yasuoka",
            "typeEntity": "Person"
        }
    ],
    "description": "AViS is an Analysis and Visualization Software for Molecular Dynamics Simulations",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://avis-md.github.io/docs/index.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/avis-md/avis/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/avis-md/avis",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2021-01-29T19:47:08Z",
    "name": "AViS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0231714",
            "metadata": {
                "abstract": "© 2020 Pua et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The study of molecular dynamics simulations is largely facilitated by analysis and visualization toolsets. However, these toolsets are often designed for specific use cases and those only, while scripting extensions to such toolsets is often exceedingly complicated. To overcome this problem, we designed a software application called AViS which focuses on the extensibility of analysis. By utilizing the dataflow programming (DFP) paradigm, algorithms can be defined by execution graphs, and arbitrary data can be transferred between nodes using visual connectors. Extension nodes can be implemented in either Python, C++, and Fortran, and combined in the same algorithm. AViS offers a comprehensive collection of nodes for sophisticated visualization state modifications, thus greatly simplifying the rules for writing extensions. Input files can also be read from the server automatically, and data is fetched automatically to improve memory usage. In addition, the visualization system of AViS uses physically-based rendering techniques, improving the 3D perception of molecular structures for interactive visualization. By performing two case studies on complex molecular systems, we show that the DFP workflow offers a much higher level of flexibility and extensibility when compared to legacy workflows.",
                "authors": [
                    {
                        "name": "Ayuba S."
                    },
                    {
                        "name": "Pua K."
                    },
                    {
                        "name": "Yasuoka K."
                    },
                    {
                        "name": "Yuhara D."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Dataflow programming for the analysis of molecular dynamics with AViS, an analysis and visualization software application"
            },
            "pmcid": "PMC7173788",
            "pmid": "32315327"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "version": [
        "0.12c"
    ]
}
