{"credit":[{"email":"proteincomplexmap@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://proteincomplexes.org/about"}],"download":[{"type":"Biological data","url":"http://proteincomplexes.org/download"}],"function":[{"input":[{"data":{"term":"Identifier (by type of data)","uri":"http://edamontology.org/data_0976"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]}],"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"},{"term":"Protein interaction analysis","uri":"http://edamontology.org/operation_2949"}],"output":[{"data":{"term":"Database search results","uri":"http://edamontology.org/data_2080"},"format":[{"term":"Protein report format","uri":"http://edamontology.org/format_2062"}]}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Laboratory information management","uri":"http://edamontology.org/topic_0607"}]},"publication":[{"abstract":"© 2017 The Authors. Published under the terms of the CC BY 4.0 license Macromolecular protein complexes carry out many of the essential functions of cells, and many genetic diseases arise from disrupting the functions of such complexes. Currently, there is great interest in defining the complete set of human protein complexes, but recent published maps lack comprehensive coverage. Here, through the synthesis of over 9,000 published mass spectrometry experiments, we present hu.MAP, the most comprehensive and accurate human protein complex map to date, containing > 4,600 total complexes, > 7,700 proteins, and > 56,000 unique interactions, including thousands of confident protein interactions not identified by the original publications. hu.MAP accurately recapitulates known complexes withheld from the learning procedure, which was optimized with the aid of a new quantitative metric (k-cliques) for comparing sets of sets. The vast majority of complexes in our map are significantly enriched with literature annotations, and the map overall shows improved coverage of many disease-associated proteins, as we describe in detail for ciliopathies. Using hu.MAP, we predicted and experimentally validated candidate ciliopathy disease genes in vivo in a model vertebrate, discovering CCDC138, WDR90, and KIAA1328 to be new cilia basal body/centriolar satellite proteins, and identifying ANKRD55 as a novel member of the intraflagellar transport machinery. By offering significant improvements to the accuracy and coverage of human protein complexes, hu.MAP (http://proteincomplexes.org) serves as a valuable resource for better understanding the core cellular functions of human proteins and helping to determine mechanistic foundations of human disease.","authors":["Drew K.","Lee C.","Huizar R.L.","Tu F.","Borgeson B.","McWhite C.D.","Ma Y.","Wallingford J.B.","Marcotte E.M."],"cit_count":26,"doi":"10.15252/msb.20167490","journal":"Molecular Systems Biology","title":"Integration of over 9,000 mass spectrometry experiments builds a global map of human protein complexes","year":"2017-06-01"}],"summary":{"biotoolsCURIE":"biotools:hu.map","biotoolsID":"hu.map","description":"A reference map data repository for human protein complexes, containing > 4,600 total complexes, > 7,700 proteins, and > 56,000 unique interactions, including thousands of confident protein interactions not identified by the original publications.","homepage":"http://proteincomplexes.org/","name":"hu.MAP"}}