{
    "additionDate": "2017-01-17T15:00:50Z",
    "biotoolsCURIE": "biotools:rqubic",
    "biotoolsID": "rqubic",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jitao_david.zhang@roche.com",
            "name": "Jitao David Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package implements the QUBIC algorithm for the qualitative biclustering with gene expression data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/rqubic.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/rqubic_1.20.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/rqubic.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-29T14:10:28Z",
    "license": "GPL-2.0",
    "name": "rqubic",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkp491",
            "metadata": {
                "abstract": "Biclustering extends the traditional clustering techniques by attempting to find (all) subgroups of genes with similar expression patterns under to-be-identified subsets of experimental conditions when applied to gene expression data. Still the real power of this clustering strategy is yet to be fully realized due to the lack of effective and efficient algorithms for reliably solving the general biclustering problem. We report a QUalitative BIClustering algorithm (QUBIC) that can solve the biclustering problem in a more general form, compared to existing algorithms, through employing a combination of qualitative (or semi-quantitative) measures of gene expression data and a combinatorial optimization technique. One key unique feature of the QUBIC algorithm is that it can identify all statistically significant biclusters including biclusters with the so-called 'scaling patterns', a problem considered to be rather challenging; another key unique feature is that the algorithm solves such general biclustering problems very efficiently, capable of solving biclustering problems with tens of thousands of genes under up to thousands of conditions in a few minutes of the CPU time on a desktop computer. We have demonstrated a considerably improved biclustering performance by our algorithm compared to the existing algorithms on various benchmark sets and data sets of our own. QUBIC was written in ANSI C and tested using GCC (version 4.1.2) on Linux. Its source code is available at: http://csbl.bmb.uga.edu/~maqin/bicluster. A server version of QUBIC is also available upon request. © 2009 The Author(s).",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Paterson A.H."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "citationCount": 162,
                "date": "2009-09-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "QUBIC: A qualitative biclustering algorithm for analyses of gene expression data"
            },
            "pmcid": "PMC2731891",
            "pmid": "19509312",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.20.0"
    ]
}
