{
    "additionDate": "2018-07-23T18:07:56Z",
    "biotoolsCURIE": "biotools:marv",
    "biotoolsID": "marv",
    "credit": [
        {
            "email": "m.kaakinen@imperial.ac.uk",
            "name": "Marika Kaakinen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multi-phenotype Analysis of Rare Variants.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ImperialStatGen/MARV/blob/master/MARV_v1.0.4_tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ImperialStatGen/MARV",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "BSD-3-Clause",
    "name": "MARV",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1530-2",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Genome-wide association studies have enabled identification of thousands of loci for hundreds of traits. Yet, for most human traits a substantial part of the estimated heritability is unexplained. This and recent advances in technology to produce high-dimensional data cost-effectively have led to method development beyond standard common variant analysis, including single-phenotype rare variant and multi-phenotype common variant analysis, with the latter increasing power for locus discovery and providing suggestions of pleiotropic effects. However, there are currently no optimal methods and tools for the combined analysis of rare variants and multiple phenotypes. Results: We propose a user-friendly software tool MARV for Multi-phenotype Analysis of Rare Variants. The tool is based on a method that collapses rare variants within a genomic region and models the proportion of minor alleles in the rare variants on a linear combination of multiple phenotypes. MARV provides analyses of all phenotype combinations within one run and calculates the Bayesian Information Criterion to facilitate model selection. The running time increases with the size of the genetic data while the number of phenotypes to analyse has little effect both on running time and required memory. We illustrate the use of MARV with analysis of triglycerides (TG), fasting insulin (FI) and waist-to-hip ratio (WHR) in 4,721 individuals from the Northern Finland Birth Cohort 1966. The analysis suggests novel multi-phenotype effects for these metabolic traits at APOA5 and ZNF259, and at ZNF259 provides stronger support for association (P TG+FI = 1.8 × 10-9) than observed in single phenotype rare variant analyses (P TG = 6.5 × 10-8 and P FI = 0.27). Conclusions: MARV is a computationally efficient, flexible and user-friendly software tool allowing rapid identification of rare variant effects on multiple phenotypes, thus paving the way for novel discoveries and insights into biology of complex traits.",
                "authors": [
                    {
                        "name": "Kaakinen M."
                    },
                    {
                        "name": "Magi R."
                    },
                    {
                        "name": "Fischer K."
                    },
                    {
                        "name": "Heikkinen J."
                    },
                    {
                        "name": "Jarvelin M.-R."
                    },
                    {
                        "name": "Morris A.P."
                    },
                    {
                        "name": "Prokopenko I."
                    }
                ],
                "citationCount": 7,
                "date": "2017-02-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MARV: A tool for genome-wide multi-phenotype analysis of rare variants"
            },
            "pmcid": "PMC5311849",
            "pmid": "28209135"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}