{
    "additionDate": "2021-03-19T08:40:30Z",
    "biotoolsCURIE": "biotools:lgpr",
    "biotoolsID": "lgpr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "harri.lahdesmaki@aalto.fi",
            "name": "Harri Lähdesmäki",
            "typeEntity": "Person"
        },
        {
            "email": "juho.timonen@aalto.fi",
            "name": "Juho Timonen",
            "typeEntity": "Person"
        }
    ],
    "description": "An interpretable nonparametric method for inferring covariate effects from longitudinal Data.\n\nLongitudinal Gaussian Process Regression.\n\nR package for Longitudinal Gaussian Process Regression.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://jtimonen.github.io/lgpr-usage",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:37:14.354464Z",
    "name": "lgpr",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab021",
            "metadata": {
                "abstract": "Motivation: Longitudinal study designs are indispensable for studying disease progression. Inferring covariate effects from longitudinal data, however, requires interpretable methods that can model complicated covariance structures and detect non-linear effects of both categorical and continuous covariates, as well as their interactions. Detecting disease effects is hindered by the fact that they often occur rapidly near the disease initiation time, and this time point cannot be exactly observed. An additional challenge is that the effect magnitude can be heterogeneous over the subjects. Results: We present lgpr, a widely applicable and interpretable method for non-parametric analysis of longitudinal data using additive Gaussian processes. We demonstrate that it outperforms previous approaches in identifying the relevant categorical and continuous covariates in various settings. Furthermore, it implements important novel features, including the ability to account for the heterogeneity of covariate effects, their temporal uncertainty, and appropriate observation models for different types of biomedical data. The lgpr tool is implemented as a comprehensive and user-friendly R-package.",
                "authors": [
                    {
                        "name": "Lahdesmaki H."
                    },
                    {
                        "name": "Mannerstrom H."
                    },
                    {
                        "name": "Timonen J."
                    },
                    {
                        "name": "Vehtari A."
                    }
                ],
                "citationCount": 9,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lgpr: An interpretable non-parametric method for inferring covariate effects from longitudinal data"
            },
            "pmcid": "PMC8317115",
            "pmid": "33471072"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
