{
    "additionDate": "2017-02-14T09:35:00Z",
    "biotoolsCURIE": "biotools:fmm",
    "biotoolsID": "fmm",
    "credit": [
        {
            "email": "bryan@mail.NCTU.edu.tw",
            "name": "FMM Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "From Metabolite to Metabolite (FMM) is a web server for metabolic pathway reconstruction from one metabolite to another metabolite in a different species based on the KEGG pathway and other integrated databases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fmm.mbc.nctu.edu.tw/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://FMM.mbc.nctu.edu.tw/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "FMM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Synthetic Biology, a multidisciplinary field, is growing rapidly. Improving the understanding of biological systems through mimicry and producing bio-orthogonal systems with new functions are two complementary pursuits in this field. A web server called FMM (From Metabolite to Metabolite) was developed for this purpose. FMM can reconstruct metabolic pathways form one metabolite to another metabolite among different species, based mainly on the Kyoto Encyclopedia of Genes and Genomes (KEGG) database and other integrated biological databases. Novel presentation for connecting different KEGG maps is newly provided. Both local and global graphical views of the metabolic pathways are designed. FMM has many applications in Synthetic Biology and Metabolic Engineering. For example, the reconstruction of metabolic pathways to produce valuable metabolites or secondary metabolites in bacteria or yeast is a promising strategy for drug production. FMM provides a highly effective way to elucidate the genes from which species should be cloned into those microorganisms based on FMM pathway comparative analysis. Consequently, FMM is an effective tool for applications in synthetic biology to produce both drugs and biofuels. This novel and innovative resource is now freely available at http://FMM.mbc.nctu.edu.tw/.",
                "authors": [
                    {
                        "name": "Chou C.-H."
                    },
                    {
                        "name": "Chang W.-C."
                    },
                    {
                        "name": "Chiu C.-M."
                    },
                    {
                        "name": "Huang C.-C."
                    },
                    {
                        "name": "Huang H.-D."
                    }
                ],
                "citationCount": 49,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "FMM: A web server for metabolic pathway reconstruction and comparative analysis"
            },
            "pmid": "19401437"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1
}