{
    "additionDate": "2017-08-03T19:05:56Z",
    "biotoolsCURIE": "biotools:glmgraph",
    "biotoolsID": "glmgraph",
    "credit": [
        {
            "email": "li.chen@emory.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for variable selection and predictive modeling of structured genomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/glmgraph/glmgraph.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/glmgraph/index.html",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/glmgraph-graph-constrained-regularization-for-sparse-generalized-linear-models.html"
        }
    ],
    "name": "glmgraph",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.One central theme of modern high-throughput genomic data analysis is to identify relevant genomic features as well as build up a predictive model based on selected features for various tasks such as personalized medicine. Correlating the large number of 'omics' features with a certain phenotype is particularly challenging due to small sample size 〈n〉 and high dimensionality 〈p〉. To address this small n, large p problem, various forms of sparse regression models have been proposed by exploiting the sparsity assumption. Among these, network-constrained sparse regression model is of particular interest due to its ability to utilize the prior graph/network structure in the omics data. Despite its potential usefulness for omics data analysis, no efficient R implementation is publicly available. Here we present an R software package 'glmgraph' that implements the graph-constrained regularization for both sparse linear regression and sparse logistic regression. We implement both the L1 penalty and minimax concave penalty for variable selection and Laplacian penalty for coefficient smoothing. Efficient coordinate descent algorithm is used to solve the optimization problem. We demonstrate the use of the package by applying it to a human microbiome dataset, where phylogeny structure among bacterial taxa is available.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Kocher J.-P.A."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "citationCount": 8,
                "date": "2015-07-03T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Glmgraph: An R package for variable selection and predictive modeling of structured genomic data"
            },
            "pmid": "26315909"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
