{
    "additionDate": "2019-11-14T19:50:53Z",
    "biotoolsCURIE": "biotools:ApicoTFdb",
    "biotoolsID": "ApicoTFdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dinesh@icgeb.res.in",
            "name": "Dinesh Gupta",
            "orcidid": "https://orcid.org/0000-0002-7548-8835",
            "typeEntity": "Person"
        }
    ],
    "description": "The comprehensive web repository of apicomplexan transcription factors and transcription-associated co-factors | Despite significant progress in apicomplexan genome sequencing and genomics, the current list of experimentally validated transcription factors (TFs) in these genomes is incomplete and mainly consists of AP2 family of proteins, with only a limited number of non-AP2 family TFs and transcription-associated co-factors (TcoFs). We have performed a systematic bioinformatics-aided prediction of TFs and TcoFs in apicomplexan genomes and developed the ApicoTFdb database which consists of experimentally validated as well as computationally predicted TFs and TcoFs in 14 apicomplexan species. The predicted TFs are manually curated to complement the existing annotations. The current version of the database includes 1292 TFs which includes experimentally validated and computationally predicted TFs, representing 20 distinct families across 14 apicomplexan species",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.icgeb.res.in/PtDB/",
    "lastUpdate": "2020-12-09T13:01:10Z",
    "name": "ApicoTFdb",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ094",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Despite significant progress in apicomplexan genome sequencing and genomics, the current list of experimentally validated transcription factors (TFs) in these genomes is incomplete and mainly consists of AP2 family of proteins, with only a limited number of non-AP2 family TFs and transcription-associated co-factors (TcoFs). We have performed a systematic bioinformatics-aided prediction of TFs and TcoFs in apicomplexan genomes and developed the ApicoTFdb database which consists of experimentally validated as well as computationally predicted TFs and TcoFs in 14 apicomplexan species. The predicted TFs are manually curated to complement the existing annotations. The current version of the database includes 1292 TFs which includes experimentally validated and computationally predicted TFs, representing 20 distinct families across 14 apicomplexan species. The predictions include TFs of TUB, NAC, BSD, HTH, Cupin/Jumonji, winged helix and FHA family proteins, not reported earlier as TFs in the genomes. Apart from TFs, ApicoTFdb also classifies TcoFs into three main subclasses: TRs, CRRs and RNARs, representing 2491 TcoFs in 14 apicomplexan species, are analyzed in this study. The database is designed to integrate different tools for comparative analysis. All entries in the database are dynamically linked with other databases, literature reference, protein-protein interactions, pathways and annotations associated with each protein. ApicoTFdb will be useful to the researchers interested in less-studied gene regulatory mechanisms mediating the complex life cycle of the apicomplexan parasites. The database will aid in the discovery of novel drug targets to much needed combat the growing drug resistance in the parasites.",
                "authors": [
                    {
                        "name": "Sardar R."
                    },
                    {
                        "name": "Kaushik A."
                    },
                    {
                        "name": "Pandey R."
                    },
                    {
                        "name": "Mohmmed A."
                    },
                    {
                        "name": "Ali S."
                    },
                    {
                        "name": "Gupta D."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "ApicoTFdb: The comprehensive web repository of apicomplexan transcription factors and transcription-associated co-factors"
            },
            "pmcid": "PMC6748703",
            "pmid": "31529106"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}