{
    "additionDate": "2024-05-23T23:32:08.197305Z",
    "biotoolsCURIE": "biotools:autonoms",
    "biotoolsID": "autonoms",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "reder@kth.se",
            "name": "Gabriel K. Reder",
            "orcidid": "https://orcid.org/0000-0001-8918-0789",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated ion mobility metabolomic fingerprinting.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://autonoms.readthedocs.io",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-05-23T23:32:08.199490Z",
    "name": "AutonoMS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/jasms.3c00396",
            "metadata": {
                "abstract": "Automation is dramatically changing the nature of laboratory life science. Robotic lab hardware that can perform manual operations with greater speed, endurance, and reproducibility opens an avenue for faster scientific discovery with less time spent on laborious repetitive tasks. A major bottleneck remains in integrating cutting-edge laboratory equipment into automated workflows, notably specialized analytical equipment, which is designed for human usage. Here we present AutonoMS, a platform for automatically running, processing, and analyzing high-throughput mass spectrometry experiments. AutonoMS is currently written around an ion mobility mass spectrometry (IM-MS) platform and can be adapted to additional analytical instruments and data processing flows. AutonoMS enables automated software agent-controlled end-to-end measurement and analysis runs from experimental specification files that can be produced by human users or upstream software processes. We demonstrate the use and abilities of AutonoMS in a high-throughput flow-injection ion mobility configuration with 5 s sample analysis time, processing robotically prepared chemical standards and cultured yeast samples in targeted and untargeted metabolomics applications. The platform exhibited consistency, reliability, and ease of use while eliminating the need for human intervention in the process of sample injection, data processing, and analysis. The platform paves the way toward a more fully automated mass spectrometry analysis and ultimately closed-loop laboratory workflows involving automated experimentation and analysis coupled to AI-driven experimentation utilizing cutting-edge analytical instrumentation. AutonoMS documentation is available at https://autonoms.readthedocs.io.",
                "authors": [
                    {
                        "name": "Bjurstrom E.Y."
                    },
                    {
                        "name": "Brunnsaker D."
                    },
                    {
                        "name": "Dodds J.N."
                    },
                    {
                        "name": "King R.D."
                    },
                    {
                        "name": "Kronstrom F."
                    },
                    {
                        "name": "Lasin P."
                    },
                    {
                        "name": "May J.C."
                    },
                    {
                        "name": "McLean J.A."
                    },
                    {
                        "name": "Reder G.K."
                    },
                    {
                        "name": "Savolainen O.I."
                    },
                    {
                        "name": "Tiukova I."
                    },
                    {
                        "name": "Wikswo J.P."
                    }
                ],
                "date": "2024-03-06T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "AutonoMS: Automated Ion Mobility Metabolomic Fingerprinting"
            },
            "pmid": "38310603"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
