{
    "accessibility": "Open access",
    "additionDate": "2021-02-22T11:05:11Z",
    "biotoolsCURIE": "biotools:distributeddata.jl",
    "biotoolsID": "distributeddata.jl",
    "collectionID": [
        "ELIXIR-LU",
        "PerMedCoE"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "Utility functions library for manipulating massive datasets within a distributed environment, using Julia.",
    "documentation": [
        {
            "type": [
                "API documentation",
                "Quick start guide",
                "User manual"
            ],
            "url": "https://lcsb-biocore.github.io/DistributedData.jl/stable/"
        }
    ],
    "editPermission": {
        "authors": [
            "laurentheirendt",
            "trefex"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Luxembourg",
        "Czech Republic"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LCSB-BioCore/DistributedData.jl",
    "language": [
        "Julia"
    ],
    "lastUpdate": "2021-05-21T13:17:38.795633Z",
    "license": "Apache-2.0",
    "maturity": "Mature",
    "name": "DistributedData.jl",
    "operatingSystem": [
        "Mac",
        "Linux"
    ],
    "owner": "exaexa",
    "publication": [
        {
            "doi": "10.1093/gigascience/giaa127",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press GigaScience.Background: The amount of data generated in large clinical and phenotyping studies that use single-cell cytometry is constantly growing. Recent technological advances allow the easy generation of data with hundreds of millions of single-cell data points with >40 parameters, originating from thousands of individual samples. The analysis of that amount of high-dimensional data becomes demanding in both hardware and software of high-performance computational resources. Current software tools often do not scale to the datasets of such size; users are thus forced to downsample the data to bearable sizes, in turn losing accuracy and ability to detect many underlying complex phenomena. Results: We present GigaSOM.jl, a fast and scalable implementation of clustering and dimensionality reduction for flow and mass cytometry data. The implementation of GigaSOM.jl in the high-level and high-performance programming language Julia makes it accessible to the scientific community and allows for efficient handling and processing of datasets with billions of data points using distributed computing infrastructures. We describe the design of GigaSOM.jl, measure its performance and horizontal scaling capability, and showcase the functionality on a large dataset from a recent study. Conclusions: GigaSOM.jl facilitates the use of commonly available high-performance computing resources to process the largest available datasets within minutes, while producing results of the same quality as the current state-of-art software. Measurements indicate that the performance scales to much larger datasets. The example use on the data from a massive mouse phenotyping effort confirms the applicability of GigaSOM.jl to huge-scale studies.",
                "authors": [
                    {
                        "name": "Kratochvil M."
                    },
                    {
                        "name": "Hunewald O."
                    },
                    {
                        "name": "Heirendt L."
                    },
                    {
                        "name": "Verissimo V."
                    },
                    {
                        "name": "Vondrasek J."
                    },
                    {
                        "name": "Satagopam V.P."
                    },
                    {
                        "name": "Schneider R."
                    },
                    {
                        "name": "Trefois C."
                    },
                    {
                        "name": "Ollert M."
                    }
                ],
                "date": "2020-11-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "GigaSOM.jl: High-performance clustering and visualization of huge cytometry datasets"
            },
            "pmcid": "PMC7672468",
            "pmid": "33205814",
            "type": [
                "Usage"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "gigasom.jl",
            "type": "includedIn"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}