{
    "additionDate": "2023-11-14T13:49:30.094057Z",
    "biotoolsCURIE": "biotools:genenetfusion",
    "biotoolsID": "genenetfusion",
    "credit": [
        {
            "email": "marco.masseroli@polimi.it",
            "name": "Marco Masseroli",
            "orcidid": "https://orcid.org/0000-0003-2574-1174",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "GeneNetFusion is a computatinal pipeline for the construction of fused co-expression networks and the extraction of relevant gene biomarkers.",
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/DEIB-GECO/GeneNetFusion"
        }
    ],
    "editPermission": {
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/DEIB-GECO/GeneNetFusion",
    "lastUpdate": "2024-11-24T14:31:19.759447Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DEIB-GECO/GeneNetFusion"
        }
    ],
    "name": "GeneNetFusion",
    "owner": "ELIXIR-ITA-POLIMI",
    "publication": [
        {
            "doi": "10.1038/s41540-021-00175-9",
            "metadata": {
                "abstract": "The complexity of cancer has always been a huge issue in understanding the source of this disease. However, by appreciating its complexity, we can shed some light on crucial gene associations across and in specific cancer types. In this study, we develop a general framework to infer relevant gene biomarkers and their gene-to-gene associations using multiple gene co-expression networks for each cancer type. Specifically, we infer computationally and biologically interesting communities of genes from kidney renal clear cell carcinoma, liver hepatocellular carcinoma, and prostate adenocarcinoma data sets of The Cancer Genome Atlas (TCGA) database. The gene communities are extracted through a data-driven pipeline and then evaluated through both functional analyses and literature findings. Furthermore, we provide a computational validation of their relevance for each cancer type by comparing the performance of normal/cancer classification for our identified gene sets and other gene signatures, including the typically-used differentially expressed genes. The hallmark of this study is its approach based on gene co-expression networks from different similarity measures: using a combination of multiple gene networks and then fusing normal and cancer networks for each cancer type, we can have better insights on the overall structure of the cancer-type-specific network.",
                "authors": [
                    {
                        "name": "Ceddia G."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Pido S."
                    }
                ],
                "citationCount": 9,
                "date": "2021-12-01T00:00:00Z",
                "journal": "npj Systems Biology and Applications",
                "title": "Computational analysis of fused co-expression networks for the identification of candidate cancer gene biomarkers"
            },
            "pmcid": "PMC7955132",
            "pmid": "33712625"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
