{
    "accessibility": "Open access",
    "additionDate": "2023-01-07T02:04:10.610574Z",
    "biotoolsCURIE": "biotools:tampa",
    "biotoolsID": "tampa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jaqueline Brito"
        },
        {
            "name": "Serghei Mangul"
        },
        {
            "name": "Varuni Sarwal"
        },
        {
            "name": "David Koslicki",
            "orcidid": "http://orcid.org/0000-0002-0640-954X"
        }
    ],
    "description": "TAMPA (Taxonomic metagenome profiling evaluation) , is a robust and easy-to-use method that allows scientists to easily interpret and interact with taxonomic profiles produced by the many different taxonomic profiler methods beyond the standard metrics used by the scientific community.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dkoslicki/TAMPA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:48:42.089445Z",
    "license": "MIT",
    "name": "TAMPA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "vsarwal",
    "publication": [
        {
            "doi": "10.1093/gigascience/giad008",
            "metadata": {
                "abstract": "Background: Metagenomic taxonomic profiling aims to predict the identity and relative abundance of taxa in a given whole-genome sequencing metagenomic sample. A recent surge in computational methods that aim to accurately estimate taxonomic profiles, called taxonomic profilers, has motivated community-driven efforts to create standardized benchmarking datasets and platforms, standardized taxonomic profile formats, and a benchmarking platform to assess tool performance. While this standardization is essential, there is currently a lack of tools to visualize the standardized output of the many existing taxonomic profilers. Thus, benchmarking studies rely on a single-value metrics to compare performance of tools and compare to benchmarking datasets. This is one of the major problems in analyzing metagenomic profiling data, since single metrics, such as the F1 score, fail to capture the biological differences between the datasets. Findings: Here we report the development of TAMPA (Taxonomic metagenome profiling evaluation), a robust and easy-to-use method that allows scientists to easily interpret and interact with taxonomic profiles produced by the many different taxonomic profiler methods beyond the standard metrics used by the scientific community. We demonstrate the unique ability of TAMPA to generate a novel biological hypothesis by highlighting the taxonomic differences between samples otherwise missed by commonly utilized metrics. Conclusion: In this study, we show that TAMPA can help visualize the output of taxonomic profilers, enabling biologists to effectively choose the most appropriate profiling method to use on their metagenomics data. TAMPA is available on GitHub, Bioconda, and Galaxy Toolshed at https://github.com/dkoslicki/TAMPA and is released under the MIT license.",
                "authors": [
                    {
                        "name": "Brito J."
                    },
                    {
                        "name": "Koslicki D."
                    },
                    {
                        "name": "Mangul S."
                    },
                    {
                        "name": "Sarwal V."
                    }
                ],
                "citationCount": 1,
                "date": "2023-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "TAMPA: interpretable analysis and visualization of metagenomics-based taxon abundance profiles"
            },
            "pmcid": "PMC9972184",
            "pmid": "36852763"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
