
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/htchu/profile/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/projects/seqentropy/?source=navbar"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C#"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/seqentropy-2-0-1-assessmemt-tool-sequence-repeats-short-read-sequencing.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Recent studies on genome assembly from short-read sequencing data reported the limitation of this technology to reconstruct the entire genome even at very high depth coverage. We investigated the limitation from the perspective of information theory to evaluate the effect of repeats on short-read genome assembly using idealized (error-free) reads at different lengths. Methodology/Principal Findings: We define a metric H(k) to be the entropy of sequencing reads at a read length k and use the relative loss of entropy ΔH(k) to measure the impact of repeats for the reconstruction of whole-genome from sequences of length k. In our experiments, we found that entropy loss correlates well with de-novo assembly coverage of a genome, and a score of ΔH(k)>1% indicates a severe loss in genome reconstruction fidelity. The minimal read lengths to achieve ΔH(k)<1% are different for various organisms and are independent of the genome size. For example, in order to meet the threshold of ΔH(k)<1%, a read length of 60 bp is needed for the sequencing of human genome (3.2 109 bp) and 320 bp for the sequencing of fruit fly (1.8×108 bp). We also calculated the ΔH(k) scores for 2725 prokaryotic chromosomes and plasmids at several read lengths. Our results indicate that the levels of repeats in different genomes are diverse and the entropy of sequencing reads provides a measurement for the repeat structures. Conclusions/Significance: The proposed entropy-based measurement, which can be calculated in seconds to minutes in most cases, provides a rapid quantitative evaluation on the limitation of idealized short-read genome sequencing. Moreover, the calculation can be parallelized to scale up to large euakryotic genomes. This approach may be useful to tune the sequencing parameters to achieve better genome assemblies when a closely related genome is already available. © 2013 Chu et al.",
            "authors": [
                "Chu H.-T.",
                "Hsiao W.W.L.",
                "Tsao T.T.H.",
                "Hsu D.F.",
                "Chen C.-C.",
                "Lee S.-A.",
                "Kao C.-Y."
            ],
            "cit_count": 4,
            "journal": "PLoS ONE",
            "pmid": "23544073",
            "title": "SeqEntropy: Genome-Wide Assessment of Repeats for Short Read Sequencing",
            "year": "2013-03-27"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:seqentropy",
        "biotoolsID": "seqentropy",
        "description": "Assessmemt tool of sequence repeats for short read sequencing.",
        "homepage": "http://sourceforge.net/projects/seqentropy/?source=navbar",
        "name": "SeqEntropy"
    }
}