{
    "accessibility": "Open access",
    "additionDate": "2022-03-01T22:03:33.536200Z",
    "biotoolsCURIE": "biotools:genetic_u-net",
    "biotoolsID": "genetic_u-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jiahong Wei",
            "orcidid": "https://orcid.org/0000-0002-8148-2683"
        },
        {
            "name": "Jiajie Mo",
            "orcidid": "https://orcid.org/0000-0003-2551-5329"
        },
        {
            "name": "Xinjian Chen",
            "orcidid": "https://orcid.org/0000-0002-0871-293X"
        },
        {
            "name": "Yibiao Rong",
            "orcidid": "https://orcid.org/0000-0002-8776-9415"
        },
        {
            "name": "Zhun Fan",
            "orcidid": "https://orcid.org/0000-0002-4232-8229"
        }
    ],
    "description": "Automatically Designed Deep Networks for Retinal Vessel Segmentation Using a Genetic Algorithm.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/96jhwei/Genetic-U-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-01T22:03:33.538872Z",
    "license": "MIT",
    "name": "Genetic U-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3111679",
            "metadata": {
                "abstract": "© 2021 IEEE.Recently, many methods based on hand-designed convolutional neural networks (CNNs) have achieved promising results in automatic retinal vessel segmentation. However, these CNNs remain constrained in capturing retinal vessels in complex fundus images. To improve their segmentation performance, these CNNs tend to have many parameters, which may lead to overfitting and high computational complexity. Moreover, the manual design of competitive CNNs is time-consuming and requires extensive empirical knowledge. Herein, a novel automated design method, called Genetic U-Net, is proposed to generate a U-shaped CNN that can achieve better retinal vessel segmentation but with fewer architecture-based parameters, thereby addressing the above issues. First, we devised a condensed but flexible search space based on a U-shaped encoder-decoder. Then, we used an improved genetic algorithm to identify better-performing architectures in the search space and investigated the possibility of finding a superior network architecture with fewer parameters. The experimental results show that the architecture obtained using the proposed method offered a superior performance with less than 1% of the number of the original U-Net parameters in particular and with significantly fewer parameters than other state-of-the-art models. Furthermore, through in-depth investigation of the experimental results, several effective operations and patterns of networks to generate superior retinal vessel segmentations were identified. The codes of this work are available at https://github.com/96jhwei/Genetic-U-Net.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Fan Z."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Mo J."
                    },
                    {
                        "name": "Rong Y."
                    },
                    {
                        "name": "Wei J."
                    },
                    {
                        "name": "Zhu G."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Genetic U-Net: Automatically Designed Deep Networks for Retinal Vessel Segmentation Using a Genetic Algorithm"
            },
            "pmid": "34506278"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
