{
    "accessibility": [],
    "additionDate": "2017-12-18T00:14:16Z",
    "biotoolsCURIE": "biotools:wmaxc",
    "biotoolsID": "wmaxc",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://combio.gist.ac.kr/"
        }
    ],
    "description": "Weighted MAXimum Clique. Method for identifying condition specific sub-network. Reveals a subset of genes which are closely related to a particular disease. It integrates gene expression data and protein-protein interaction information to construct molecular network, and then extracts the most density connected sub-network using an integration of a global search method and efficient projection procedure.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://combio.gist.ac.kr/WMAXC/ReadMe.txt"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://combio.gist.ac.kr/WMAXC/WMAXC.html",
    "homepage_status": 1,
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/wmaxc-20131115-weighted-maximum-clique-method-for-identifying-condition-specific-sub-network.html"
        }
    ],
    "maturity": null,
    "name": "WMAXC",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0104993",
            "metadata": {
                "abstract": "Sub-networks can expose complex patterns in an entire bio-molecular network by extracting interactions that depend on temporal or condition-specific contexts. When genes interact with each other during cellular processes, they may form differential co-expression patterns with other genes across different cell states. The identification of condition-specific sub-networks is of great importance in investigating how a living cell adapts to environmental changes. In this work, we propose the weighted MAXimum clique (WMAXC) method to identify a condition-specific sub-network. WMAXC first proposes scoring functions that jointly measure condition-specific changes to both individual genes and gene-gene coexpressions. It then employs a weaker formula of a general maximum clique problem and relates the maximum scored clique of a weighted graph to the optimization of a quadratic objective function under sparsity constraints. We combine a continuous genetic algorithm and a projection procedure to obtain a single optimal sub-network that maximizes the objective function (scoring function) over the standard simplex (sparsity constraints). We applied the WMAXC method to both simulated data and real data sets of ovarian and prostate cancer. Compared with previous methods, WMAXC selected a large fraction of cancer-related genes, which were enriched in cancer-related pathways. The results demonstrated that our method efficiently captured a subset of genes relevant under the investigated condition. © 2014 Amgalan, Lee.",
                "authors": [
                    {
                        "name": "Amgalan B."
                    },
                    {
                        "name": "Lee H."
                    }
                ],
                "citationCount": 8,
                "date": "2014-08-22T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "WMAXC: A Weighted Maximum Clique method for identifying condition-specific sub-network"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Disease",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "20131115"
    ]
}