{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T16:57:26.426169Z",
    "biotoolsCURIE": "biotools:starpepdb",
    "biotoolsID": "starpepdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ymarrero@usfq.edu.ec",
            "name": "Yovani Marrero-Ponce",
            "orcidid": "https://orcid.org/0000-0003-2721-1142",
            "typeEntity": "Person",
            "url": "http://www.uv.es/yoma/"
        },
        {
            "name": "Ana Cristina Aguilar"
        },
        {
            "name": "Longendri Aguilera-Mendoza",
            "orcidid": "https://orcid.org/0000-0002-2421-0382"
        },
        {
            "name": "Sebastián Ayala-Ruano",
            "orcidid": "https://orcid.org/0000-0001-9756-6745"
        }
    ],
    "description": "Network Science and Group Fusion Similarity-Based Searching to Explore the Chemical Space of Antiparasitic Peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://mobiosd-hub.com/starpep",
    "language": [
        "Java"
    ],
    "lastUpdate": "2023-02-13T16:57:26.431595Z",
    "name": "StarPepDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.2C03398",
            "metadata": {
                "abstract": "© 2022 American Chemical Society. All rights reserved.Antimicrobial peptides (AMPs) have appeared as promising compounds to treat a wide range of diseases. Their clinical potentialities reside in the wide range of mechanisms they can use for both killing microbes and modulating immune responses. However, the hugeness of the AMPs' chemical space (AMPCS), represented by more than 1065unique sequences, has represented a big challenge for the discovery of new promising therapeutic peptides and for the identification of common structural motifs. Here, we introduce network science and a similarity searching approach to discover new promising AMPs, specifically antiparasitic peptides (APPs). We exploited the network-based representation of APPs' chemical space (APPCS) to retrieve valuable information by using three network types: chemical space (CSN), half-space proximal (HSPN), and metadata (METN). Some centrality measures were applied to identify in each network the most important and nonredundant peptides. Then, these central peptides were considered as queries (Qs) in group fusion similarity-based searches against a comprehensive collection of known AMPs, stored in the graph database StarPepDB, to propose new potential APPs. The performance of the resulting multiquery similarity-based search models (mQSSMs) was evaluated in five benchmarking data sets of APP/non-APPs. The predictions performed by the best mQSSM showed a strong-to-very-strong performance since their external Matthews correlation coefficient (MCC) values ranged from 0.834 to 0.965. Outstanding MCC values (>0.85) were attained by the mQSSM with 219 Qs from both networks CSN and HSPN with 0.5 as similarity threshold in external data sets. Then, the performance of our best mQSSM was compared with the APPs prediction servers AMPDiscover and AMPFun. The proposed model showed its relevance by outperforming state-of-the-art machine learning models to predict APPs. After applying the best mQSSM and additional filters on the non-APP space from StarPepDB, 95 AMPs were repurposed as potential APP hits. Due to the high sequence diversity of these peptides, different computational approaches were applied to identify relevant motifs for searching and designing new APPs. Lastly, we identified 11 promising APP lead candidates by using our best mQSSMs together with diversity-based network analyses, and 24 web servers for activity/toxicity and drug-like properties. These results support that network-based similarity searches can be an effective and reliable strategy to identify APPs. The proposed models and pipeline are freely available through the StarPep toolbox software at http://mobiosd-hub.com/starpep.",
                "authors": [
                    {
                        "name": "Aguero-Chapin G."
                    },
                    {
                        "name": "Aguilar A.C."
                    },
                    {
                        "name": "Aguilera-Mendoza L."
                    },
                    {
                        "name": "Antunes A."
                    },
                    {
                        "name": "Ayala-Ruano S."
                    },
                    {
                        "name": "Marrero-Ponce Y."
                    },
                    {
                        "name": "Perez N."
                    }
                ],
                "date": "2022-12-20T00:00:00Z",
                "journal": "ACS Omega",
                "title": "Network Science and Group Fusion Similarity-Based Searching to Explore the Chemical Space of Antiparasitic Peptides"
            },
            "pmcid": "PMC9773354",
            "pmid": "36570318"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
