{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-11T09:09:56.426949Z",
    "biotoolsCURIE": "biotools:brhd",
    "biotoolsID": "brhd",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "jianli2014@seu.edu.cn",
            "name": "Jian Li",
            "orcidid": "https://orcid.org/0000-0001-8706-6421",
            "typeEntity": "Person"
        },
        {
            "name": "Chen Pin",
            "orcidid": "https://orcid.org/0000-0002-8823-4586"
        }
    ],
    "description": "Brain Research Hotspot Database (BRHD) a A comprehensive platform for the latest advances in brain research",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.brainresearch.cn/",
    "lastUpdate": "2022-08-11T09:11:03.894859Z",
    "license": "CC-BY-SA-3.0",
    "name": "BRHD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/BRAINSCI12050638",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Brain science, an emerging, dynamic, multidisciplinary basic research field, is generating numerous valuable data. However, there are still several obstacles for the utilization of these data, such as data fragmentation, heterogeneity, availability, and annotation divergence. Thus, to overcome these obstacles and construct an online community, we developed a panoramic database named Brain Research Hotspot Database (BRHD). As of 30 January 2022, the database had been integrated with standardized vocabularies from various resources, including 423,681 papers, 46,344 patents, 9585 transcriptomic datasets, 261 cell markers, as well as with information regarding brain initiatives that were officially launched and well-known scholars in brain research. Based on the keywords entered by users and the search options they set, data can be accessed and retrieved through exact and fuzzy search scenarios. In addition, for brain diseases, we developed three featured functions based on deep data mining: (1) a brain disease–genome network, which collects the associations between common brain diseases, genes, and mutations reported in the literature; (2) brain and gut microbiome associations, based on the literature related to this topic, with added annotations for reference; (3) 3D brain structure, containing a high-precision brain anatomy model with visual links to quickly connect to an organ-on-a-chip database. In short, the BRHD integrates data from a variety of brain science resources to provide a friendly user interface and freely accessible viewing and downloading environment. Furthermore, the original functions developed based on these data provide references and insights for brain research.",
                "authors": [
                    {
                        "name": "Chen P."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Liu A."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Brain Sciences",
                "title": "The Brain Research Hotspot Database (BRHD): A Panoramic Database of the Latest Hotspots in Brain Research"
            },
            "pmcid": "PMC9139690",
            "pmid": "35625024"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
