
{
    "credit": [
        {
            "email": "valentina.boeva@inserm.fr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/InstitutCurie"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/BoevaLab/SV-Bay"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/sv-bay-detection-of-structural-variants-in-cancer-mate-pair-and-paired-end-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 The Author 2016. Published by Oxford University Press.Motivation: Whole genome sequencing of paired-end reads can be applied to characterize the landscape of large somatic rearrangements of cancer genomes. Several methods for detecting structural variants with whole genome sequencing data have been developed. So far, none of these methods has combined information about abnormally mapped read pairs connecting rearranged regions and associated global copy number changes automatically inferred from the same sequencing data file. Our aim was to create a computational method that could use both types of information, i.e. normal and abnormal reads, and demonstrate that by doing so we can highly improve both sensitivity and specificity rates of structural variant prediction. Results: We developed a computational method, SV-Bay, to detect structural variants from whole genome sequencing mate-pair or paired-end data using a probabilistic Bayesian approach. This approach takes into account depth of coverage by normal reads and abnormalities in read pair mappings. To estimate the model likelihood, SV-Bay considers GC-content and read mappability of the genome, thus making important corrections to the expected read count. For the detection of somatic variants, SV-Bay makes use of a matched normal sample when it is available. We validated SV-Bay on simulated datasets and an experimental mate-pair dataset for the CLB-GA neuroblastoma cell line. The comparison of SV-Bay with several other methods for structural variant detection demonstrated that SV-Bay has better prediction accuracy both in terms of sensitivity and false-positive detection rate.",
            "authors": [
                "Iakovishina D.",
                "Janoueix-Lerosey I.",
                "Barillot E.",
                "Regnier M.",
                "Boeva V."
            ],
            "cit_count": 9,
            "journal": "Bioinformatics",
            "pmid": "26740523",
            "title": "SV-Bay: Structural variant detection in cancer genomes using a Bayesian approach with correction for GC-content and read mappability",
            "year": "2016-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sv-bay",
        "biotoolsID": "sv-bay",
        "description": "A computational method to detect structural variants from whole genome sequencing mate-pair or paired-end data using a probabilistic Bayesian approach.",
        "homepage": "https://github.com/InstitutCurie/SV-Bay",
        "name": "SV-Bay"
    }
}