{
    "additionDate": "2021-01-18T08:14:35Z",
    "biotoolsCURIE": "biotools:elmsi",
    "biotoolsID": "elmsi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wangjiayin@mail.xjtu.edu.cn",
            "name": "Jiayin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "ELMSI is a method for the detection of micro-satellite instability events based on the next generation sequencing technology. ELMSI can estimate the specific length distributions and states of micro-satellite regions from a mixed tumor sample paired with a control one. It first estimated the purity of the tumor sample based on the read counts of the filtered SNVs loci. Then, the algorithm identified the length distributions and the states of short micro-satellites by adding the Maximum Likelihood Estimation (MLE) step to the existing algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YixuanWang1120/ELMSI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-05T16:32:55Z",
    "name": "ELMSI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3349-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Genomic micro-satellites are the genomic regions that consist of short and repetitive DNA motifs. Estimating the length distribution and state of a micro-satellite region is an important computational step in cancer sequencing data pipelines, which is suggested to facilitate the downstream analysis and clinical decision supporting. Although several state-of-the-art approaches have been proposed to identify micro-satellite instability (MSI) events, they are limited in dealing with regions longer than one read length. Moreover, based on our best knowledge, all of these approaches imply a hypothesis that the tumor purity of the sequenced samples is sufficiently high, which is inconsistent with the reality, leading the inferred length distribution to dilute the data signal and introducing the false positive errors. Results: In this article, we proposed a computational approach, named ELMSI, which detected MSI events based on the next generation sequencing technology. ELMSI can estimate the specific length distributions and states of micro-satellite regions from a mixed tumor sample paired with a control one. It first estimated the purity of the tumor sample based on the read counts of the filtered SNVs loci. Then, the algorithm identified the length distributions and the states of short micro-satellites by adding the Maximum Likelihood Estimation (MLE) step to the existing algorithm. After that, ELMSI continued to infer the length distributions of long micro-satellites by incorporating a simplified Expectation Maximization (EM) algorithm with central limit theorem, and then used statistical tests to output the states of these micro-satellites. Based on our experimental results, ELMSI was able to handle micro-satellites with lengths ranging from shorter than one read length to 10kbps. Conclusions: To verify the reliability of our algorithm, we first compared the ability of classifying the shorter micro-satellites from the mixed samples with the existing algorithm MSIsensor. Meanwhile, we varied the number of micro-satellite regions, the read length and the sequencing coverage to separately test the performance of ELMSI on estimating the longer ones from the mixed samples. ELMSI performed well on mixed samples, and thus ELMSI was of great value for improving the recognition effect of micro-satellite regions and supporting clinical decision supporting. The source codes have been uploaded and maintained at https://github.com/YixuanWang1120/ELMSI for academic use only.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Zhang F.-R."
                    },
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Feng X."
                    },
                    {
                        "name": "Zhao Z."
                    },
                    {
                        "name": "Guan Y."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Accurately estimating the length distributions of genomic micro-satellites by tumor purity deconvolution"
            },
            "pmcid": "PMC7069170",
            "pmid": "32164528"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}