{
    "additionDate": "2020-01-14T09:00:34Z",
    "biotoolsCURIE": "biotools:PlantRegMap",
    "biotoolsID": "PlantRegMap",
    "confidence_flag": "tool",
    "description": "charting functional regulatory maps in plants.\n\nPlant Regulation Data and Analysis Platform.\n\nPlantRegMap, a portal for the regulation data and analsyis tools in plants.\n\nPlant Transcriptional Regulatory Map.\n\nTranscriptional regulations in PlantRegMap are identified from literature and ChIP-seq data, or inferred by combining TF binding motifs and regulatory elements data (see methods for more details). Users can select one of the three modes to retrieve regulations according to your requirement: 1) “TF (retrieve targets)” to retrieve the downstream targets of input TFs, 2) “Target (retrieve TFs)” to retrieve the upstream regulators of input genes, and 3) “Gene (retrieve regulations among them)” to retrieve the inside regulations among input genes",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://plantregmap.cbi.pku.edu.cn/download.php"
        },
        {
            "type": "Binaries",
            "url": "ftp://ftp.cbi.pku.edu.cn/pub/database/PlantRegMap/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://plantregmap.gao-lab.org/",
    "lastUpdate": "2020-12-05T11:50:35.363498Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://plantregmap.cbi.pku.edu.cn/network.php"
        }
    ],
    "name": "PlantRegMap",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1020",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.With the goal of charting plant transcriptional regulatory maps (i.e.Transcription factors (TFs), cis-elements and interactions between them), we have upgraded the TF-centred database PlantTFDB (http://planttfdb.cbi.pku.edu.cn/) to a plant regulatory data and analysis platform PlantRegMap (http://plantregmap.cbi.pku.edu.cn/) over the past three years. In this version, we updated the annotations for the previously collected TFs and set up a new section, 'extended TF repertoires' (TFext), to allow users prompt access to the TF repertoires of newly sequenced species. In addition to our regular TF updates, we are dedicated to updating the data on cis-elements and functional interactions between TFs and cis-elements. We established genome-wide conservation landscapes for 63 representative plants and then developed an algorithm, FunTFBS, to screen for functional regulatory elements and interactions by coupling the base-varied binding affinities of TFs with the evolutionary footprints on their binding sites. Using the FunTFBS algorithm and the conservation landscapes, we further identified over 20 million functional TF binding sites (TFBSs) and two million functional interactions for 21 346 TFs, charting the functional regulatory maps of these 63 plants. These resources are publicly available at PlantRegMap (http://plantregmap.cbi.pku.edu.cn/) and a cloud-based mirror (http://plantregmap.gao-lab.org/), providing the plant research community with valuable resources for decoding plant transcriptional regulatory systems.",
                "authors": [
                    {
                        "name": "Tian F."
                    },
                    {
                        "name": "Yang D.-C."
                    },
                    {
                        "name": "Meng Y.-Q."
                    },
                    {
                        "name": "Jin J."
                    },
                    {
                        "name": "Gao G."
                    }
                ],
                "citationCount": 38,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PlantRegMap: Charting functional regulatory maps in plants"
            },
            "pmid": "31701126"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}