
{
    "credit": [
        {
            "email": "gregory.nuel@parisdescartes.fr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://nuel.perso.math.cnrs.fr/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/waffect/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Simulated gene expression data generation",
                    "uri": "http://edamontology.org/operation_3566"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/waffect-a-package-to-simulate-constrained-phenotypes-under-disease-model-h1.html"
        }
    ],
    "publication": [
        {
            "abstract": "Objective: Assessing the statistical power to detect susceptibility variants plays a critical role in genome-wide association (GWA) studies both from the prospective and retrospective point of view. Power is empirically estimated by simulating phenotypes under a disease model H1. For this purpose, the gold standard consists in simulating genotypes given the phenotypes (e.g.Hapgen). We introduce here an alternative approach for simulating phenotypes under H1 that does not require generating new genotypes for each simulation. Methods: In order to simulate phenotypes with a fixed total number of cases and under a given disease model, we suggest 3 algorithms: (1) a simple rejection algorithm;(2) a numerical Markov chain Monte-Carlo (MCMC) approach, and (3) an exact and efficient backward sampling algorithm. In our study, we validated the 3 algorithms both on a simulated dataset and by comparing them with Hapgen on a more realistic dataset. For an application, we then conducted a simulation study on a 1000 Genomes Project dataset consisting of 629 individuals (314 cases) and 8,048 SNPs from chromosome X. We arbitrarily defined an additive disease model with two susceptibility SNPs and an epistatic effect. Results: The 3 algorithms are consistent, but backward sampling is dramatically faster than the other two. Our approach also gives consistent results with Hapgen. Using our application data, we showed that our limited design requires a biological a priori to limit the investigated region. We also proved that epistatic effects can play a significant role even when simple marker statistics (e.g. trend) are used. We finally showed that the overall performance of a GWA study strongly depends on the prevalence of the disease: the larger the prevalence, the better the power. Conclusions: Our approach is a valid alternative to Hapgen-type methods;it is not only dramatically faster but has 2 main advantages: (1) there is no need for sophisticated genotype models (e.g. haplotype frequencies, or recombination rates), and (2) the choice of the disease model is completely unconstrained (number of SNPs involved, gene-environment interactions, hybrid genetic models, etc.). Our 3 algorithms are available in an R package called 'waffect' ('double-u affect', for weighted affectations). Copyright ©2012 S. Karger AG, Basel.",
            "authors": [
                "Perduca V.",
                "Sinoquet C.",
                "Mourad R.",
                "Nuel G."
            ],
            "cit_count": 2,
            "journal": "Human Heredity",
            "pmid": "22472690",
            "title": "Alternative methods for H1 simulations in genome-wide association studies",
            "year": "2012-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:waffect",
        "biotoolsID": "waffect",
        "description": "Package to simulate phenotypic (case or control) datasets under a disease model H1 such that the total number of cases is constant across all the simulations (the constrain in the title).",
        "homepage": "http://nuel.perso.math.cnrs.fr/#software",
        "name": "WAFFECT"
    }
}