{
    "additionDate": "2021-01-18T12:24:41Z",
    "biotoolsCURIE": "biotools:nnu-net",
    "biotoolsID": "nnu-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Klaus H. Maier-Hein",
            "typeEntity": "Person"
        }
    ],
    "description": "nnU-Net is the first segmentation method that is designed to deal with the dataset diversity found in the domain. It condenses and automates the keys decisions for designing a successful segmentation pipeline for any given dataset.\n\nIn 3D biomedical image segmentation, dataset properties like imaging modality, image sizes, voxel spacings, class ratios etc vary drastically.\n\nIn current research practice, segmentation pipelines are designed manually and with one specific dataset in mind.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MIC-DKFZ/nnUNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T14:11:14Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mic-dkfz/nnunet"
        }
    ],
    "name": "nnU-Net",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41592-020-01008-Z",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature America, Inc.Biomedical imaging is a driver of scientific discovery and a core component of medical care and is being stimulated by the field of deep learning. While semantic segmentation algorithms enable image analysis and quantification in many applications, the design of respective specialized solutions is non-trivial and highly dependent on dataset properties and hardware conditions. We developed nnU-Net, a deep learning-based segmentation method that automatically configures itself, including preprocessing, network architecture, training and post-processing for any new task. The key design choices in this process are modeled as a set of fixed parameters, interdependent rules and empirical decisions. Without manual intervention, nnU-Net surpasses most existing approaches, including highly specialized solutions on 23 public datasets used in international biomedical segmentation competitions. We make nnU-Net publicly available as an out-of-the-box tool, rendering state-of-the-art segmentation accessible to a broad audience by requiring neither expert knowledge nor computing resources beyond standard network training.",
                "authors": [
                    {
                        "name": "Isensee F."
                    },
                    {
                        "name": "Jaeger P.F."
                    },
                    {
                        "name": "Kohl S.A.A."
                    },
                    {
                        "name": "Maier-Hein K.H."
                    },
                    {
                        "name": "Petersen J."
                    }
                ],
                "citationCount": 55,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "nnU-Net: a self-configuring method for deep learning-based biomedical image segmentation"
            },
            "pmid": "33288961"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
