{
    "accessibility": "Open access",
    "additionDate": "2023-03-28T10:33:42.131094Z",
    "biotoolsCURIE": "biotools:differentiable_btr",
    "biotoolsID": "differentiable_btr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ymatsunaga@mail.saitama-u.ac.jp",
            "name": "Yasuhiro Matsunaga",
            "orcidid": "http://orcid.org/0000-0003-2872-3908",
            "typeEntity": "Person"
        },
        {
            "name": "Shoji Takada"
        },
        {
            "name": "Sotaro Fuchigami"
        },
        {
            "name": "Tomonori Ogane"
        }
    ],
    "description": "End-to-End Differentiable Blind Tip Reconstruction for Noisy Atomic Force Microscopy Images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Molecular surface comparison",
                    "uri": "http://edamontology.org/operation_3666"
                }
            ]
        }
    ],
    "homepage": "https://github.com/matsunagalab/differentiable_BTR",
    "language": [
        "Julia",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:50:57.325761Z",
    "license": "GPL-3.0",
    "name": "differentiable BTR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/s41598-022-27057-2",
            "metadata": {
                "abstract": "Observing the structural dynamics of biomolecules is vital to deepening our understanding of biomolecular functions. High-speed (HS) atomic force microscopy (AFM) is a powerful method to measure biomolecular behavior at near physiological conditions. In the AFM, measured image profiles on a molecular surface are distorted by the tip shape through the interactions between the tip and molecule. Once the tip shape is known, AFM images can be approximately deconvolved to reconstruct the surface geometry of the sample molecule. Thus, knowing the correct tip shape is an important issue in the AFM image analysis. The blind tip reconstruction (BTR) method developed by Villarrubia (J Res Natl Inst Stand Technol 102:425, 1997) is an algorithm that estimates tip shape only from AFM images using mathematical morphology operators. While the BTR works perfectly for noise-free AFM images, the algorithm is susceptible to noise. To overcome this issue, we here propose an alternative BTR method, called end-to-end differentiable BTR, based on a modern machine learning approach. In the method, we introduce a loss function including a regularization term to prevent overfitting to noise, and the tip shape is optimized with automatic differentiation and backpropagations developed in deep learning frameworks. Using noisy pseudo-AFM images of myosin V motor domain as test cases, we show that our end-to-end differentiable BTR is robust against noise in AFM images. The method can also detect a double-tip shape and deconvolve doubled molecular images. Finally, application to real HS-AFM data of myosin V walking on an actin filament shows that the method can reconstruct the accurate surface geometry of actomyosin consistent with the structural model. Our method serves as a general post-processing for reconstructing hidden molecular surfaces from any AFM images. Codes are available at https://github.com/matsunagalab/differentiable_BTR.",
                "authors": [
                    {
                        "name": "Fuchigami S."
                    },
                    {
                        "name": "Matsunaga Y."
                    },
                    {
                        "name": "Ogane T."
                    },
                    {
                        "name": "Takada S."
                    }
                ],
                "citationCount": 8,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "End-to-end differentiable blind tip reconstruction for noisy atomic force microscopy images"
            },
            "pmcid": "PMC9813222",
            "pmid": "36599879"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
