{
    "additionDate": "2021-01-18T09:59:04Z",
    "biotoolsCURIE": "biotools:vam",
    "biotoolsID": "vam",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rob.frost@dartmouth.edu",
            "name": "Hildreth Robert Frost",
            "orcidid": "https://orcid.org/0000-0002-6794-9945",
            "typeEntity": "Person"
        }
    ],
    "description": "Variance-adjusted Mahalanobis (VAM): a fast and accurate method for cell-specific gene set scoring\n\nDistribution of squared modified Mahalanobis distances computed using the VAM method on simulated null scRNA-seq data. The densities of the non-central chi-squared approximation and estimated gamma distribution are also plotted. a) Density estimates for data with a simulated sparsity of 0.5. b) Density estimates for data with a simulated sparsity of 0.8.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.dartmouth.edu/~hrfrost/VAM",
    "lastUpdate": "2021-03-11T08:36:17Z",
    "name": "VAM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA582",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Statistical analysis of single cell RNA-sequencing (scRNA-seq) data is hindered by high levels of technical noise and inflated zero counts. One promising approach for addressing these challenges is gene set testing, or pathway analysis, which can mitigate sparsity and noise, and improve interpretation and power, by aggregating expression data to the pathway level. Unfortunately, methods optimized for bulk transcriptomics perform poorly on scRNA-seq data and progress on single cell-specific techniques has been limited. Importantly, no existing methods support cell-level gene set inference. To address this challenge, we developed a new gene set testing method, Variance-adjusted Mahalanobis (VAM), that integrates with the Seurat framework and can accommodate the technical noise, sparsity and large sample sizes characteristic of scRNA-seq data. The VAM method computes cell-specific pathway scores to transform a cell-by-gene matrix into a cell-by-pathway matrix that can be used for both data visualization and statistical enrichment analysis. Because the distribution of these scores under the null of uncorrelated technical noise has an accurate gamma approximation, both population and cell-level inference is supported. As demonstrated using simulated and real scRNA-seq data, the VAM method provides superior classification accuracy at a lower computation cost relative to existing single sample gene set testing approaches.",
                "authors": [
                    {
                        "name": "Frost H.R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Variance-adjusted Mahalanobis (VAM): A fast and accurate method for cell-specific gene set scoring"
            },
            "pmcid": "PMC7498348",
            "pmid": "32633778"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}