{
    "additionDate": "2023-11-07T10:10:37.062155Z",
    "biotoolsCURIE": "biotools:deeparappi",
    "biotoolsID": "deeparappi",
    "confidence_flag": "high",
    "description": "An integrated deep learning framework that uses sequence, domain and Gene Ontology information to predict PPIs of Arabidopsis thaliana. DeepAraPPI currently consists of three basic models: (i) a Siamese recurrent convolutional neural network (RCNN) model based on word2vec encoding, (ii) a multiple layer perceptron model based on Domain2vec encoding, and (iii) an multiple layer perceptron model based on GO2vec encoding. Finally, DeepAraPPI combines the results of three individual predictors using a logistic regression model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://zzdlab.com/deeparappi/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-11-07T10:11:35.511609Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zjy1125/DeepAraPPI"
        }
    ],
    "name": "DeepAraPPI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/TPJ.16188",
            "metadata": {
                "abstract": "Currently, the experimentally identified interactome of Arabidopsis (Arabidopsis thaliana) is still far from complete, suggesting that computational prediction methods can complement experimental techniques. Motivated by the prosperity and success of deep learning algorithms and natural language processing techniques, we introduce an integrative deep learning framework, DeepAraPPI, allowing us to predict protein–protein interactions (PPIs) of Arabidopsis utilizing sequence, domain and Gene Ontology (GO) information. Our current DeepAraPPI comprises: (i) a word2vec encoding-based Siamese recurrent convolutional neural network (RCNN) model; (ii) a Domain2vec encoding-based multiple-layer perceptron (MLP) model; and (iii) a GO2vec encoding-based MLP model. Finally, DeepAraPPI combines the prediction results of the three individual predictors through a logistic regression model. Compiling high-quality positive and negative training and test samples by applying strict filtering strategies, DeepAraPPI shows superior performance compared with existing state-of-the-art Arabidopsis PPI prediction methods. DeepAraPPI also provides better cross-species predictive ability in rice (Oryza sativa) than traditional machine learning methods, although the overall performance in cross-species prediction remains to be improved. DeepAraPPI is freely accessible at http://zzdlab.com/deeparappi/. In the meantime, we have also made the source code and data sets of DeepAraPPI available at https://github.com/zjy1125/DeepAraPPI.",
                "authors": [
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Wuchty S."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "citationCount": 1,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "Deep learning-assisted prediction of protein–protein interactions in Arabidopsis thaliana"
            },
            "pmid": "36919205"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
