{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:07:49Z",
    "biotoolsCURIE": "biotools:SpliceV",
    "biotoolsID": "SpliceV",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "erik@tulane.edu",
            "name": "Erik Flemington",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis and publication quality printing of linear and circular RNA splicing, expression and regulation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/flemingtonlab/SpliceV/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "https://github.com/flemingtonlab/SpliceV",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/flemingtonlab/SpliceV/issues"
        }
    ],
    "maturity": "Mature",
    "name": "SpliceV",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2865-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In eukaryotes, most genes code for multiple transcript isoforms that are generated through the complex and tightly regulated process of RNA splicing. Despite arising from identical precursor transcripts, alternatively spliced RNAs can have dramatically different functions. Transcriptome complexity is elevated further by the production of circular RNAs (circRNAs), another class of mature RNA that results from the splicing of a downstream splice donor to an upstream splice acceptor. While there has been a rapid expansion of circRNA catalogs in the last few years through the utilization of next generation sequencing approaches, our understanding of the mechanisms and regulation of circular RNA biogenesis, the impact that circRNA generation has on parental transcript processing, and the functions carried out by circular RNAs remains limited. Results: Here, we present a visualization and analysis tool, SpliceV, that rapidly plots all relevant forward- A nd back-splice data, with exon and single nucleotide level coverage information from RNA-seq experiments in a publication quality format. SpliceV also integrates analysis features that assist investigations into splicing regulation and transcript functions through the display of predicted RNA binding protein sites and the configuration of repetitive elements along the primary transcript. Conclusions: SpliceV is an easy-to-use splicing visualization tool, compatible with both Python 2.7 and 3+, and distributed under the GNU Public License. The source code is freely available for download at https://github.com/flemingtonlab/SpliceV and can be installed from PyPI using pip.",
                "authors": [
                    {
                        "name": "Flemington E."
                    },
                    {
                        "name": "Ungerleider N."
                    }
                ],
                "citationCount": 3,
                "date": "2019-05-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SpliceV: Analysis and publication quality printing of linear and circular RNA splicing, expression and regulation"
            },
            "pmcid": "PMC6507234",
            "pmid": "31068132",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
