{
    "additionDate": "2015-10-09T16:27:09Z",
    "biotoolsCURIE": "biotools:smart",
    "biotoolsID": "smart",
    "collectionID": [
        "DRCAT"
    ],
    "credit": [
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://smart.embl.de/help/feedback.shtml"
        }
    ],
    "description": "SMART protein domain database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://smart.embl.de/help/smart_about.shtml"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "SMART accession number",
                        "uri": "http://edamontology.org/data_1139"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure report",
                        "uri": "http://edamontology.org/data_1537"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        },
        {
            "input": [
                {
                    "data": {
                        "term": "SMART domain name",
                        "uri": "http://edamontology.org/data_2782"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure report",
                        "uri": "http://edamontology.org/data_1537"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://smart.embl.de/",
    "lastUpdate": "2024-11-24T15:59:48.894570Z",
    "name": "Simple modular architecture research tool (SMART)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_005026"
        }
    ],
    "owner": "hdhub",
    "publication": [
        {
            "doi": "10.1073/pnas.95.11.5857",
            "metadata": {
                "abstract": "Accurate multiple alignments of 86 domains that occur in signaling proteins have been constructed and used to provide a Web-based tool (SMART: simple modular architecture research tool) that allows rapid identification and annotation of signaling domain sequences. The majority of signaling proteins are multidomain in character with a considerable variety of domain combinations known. Comparison with established databases showed that 25% of our domain set could not be deduced from SwissProt and 41% could not be annotated by Pfam. SMART is able to determine the modular architectures of single sequences or genomes; application to the entire yeast genome revealed that at least 6.7% of its genes contain one or more signaling domains, approximately 350 greater than previously annotated. The process of constructing SMART predicted (i) novel domain homologues in unexpected locations such as band 4.1-homologous domains in focal adhesion kinases; (ii) previously unknown domain families, including a citron-homology domain; (iii) putative functions of domain families after identification of additional family members, for example, a ubiquitin-binding role for ubiquitin- associated domains (UBA); (iv) cellular roles for proteins, such predicted DEATH domains in netrin receptors further implicating these molecules in axonal guidance; (v) signaling domains in known disease genes such as SPRY domains in both marenostrin/pyrin and Midline 1; (vi) domains in unexpected phylogenetic contexts such as diacylglycerol kinase homologues in yeast and bacteria; and (vii) likely protein misclassifications exemplified by a predicted pleckstrin homology domain in a Candida albicans protein, previously described as an integrin.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Milpetz F."
                    },
                    {
                        "name": "Ponting C.P."
                    },
                    {
                        "name": "Schultz J."
                    }
                ],
                "citationCount": 3119,
                "date": "1998-05-26T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "SMART, a simple modular architecture research tool: Identification of signaling domains"
            },
            "pmcid": "PMC34487",
            "pmid": "9600884"
        },
        {
            "doi": "10.1093/nar/28.1.231",
            "metadata": {
                "abstract": "SMART (a Simple Modular Architecture Research Tool) allows the identification and annotation of genetically mobile domains and the analysis of domain architectures (http://SMART.embl-heidelberg.de). More than 400 domain families found in signalling, extracellular and chromatin-associated proteins are detectable. These domains are extensively annotated with respect to phyletic distributions, functional class, tertiary structures and functionally important residues. Each domain found in a non-redundant protein database as well as search parameters and taxonomic information are stored in a relational database system. User interfaces to this database allow searches for proteins containing specific combinations of domains in defined taxa.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Copley R.R."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Ponting C.P."
                    },
                    {
                        "name": "Schultz J."
                    }
                ],
                "citationCount": 1127,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SMART: A web-based tool for the study of genetically mobile domains"
            },
            "pmcid": "PMC102444",
            "pmid": "10592234"
        },
        {
            "doi": "10.1093/nar/30.1.242",
            "metadata": {
                "abstract": "SMART (Simple Modular Architecture Research Tool, http://smart.embl-heidelberg.de) is a web-based resource used for the annotation of protein domains and the analysis of domain architectures, with particular emphasis on mobile eukaryotic domains. Extensive annotation for each domain family is available, providing information relating to function, subcellular localization, phyletic distribution and tertiary structure. The January 2002 release has added more than 200 hand-curated domain models. This brings the total to over 600 domain families that are widely represented among nuclear, signalling and extracellular proteins. Annotation now includes links to the Online Mendelian Inheritance in Man (OMIM) database in cases where a human disease is associated with one or more mutations in a particular domain. We have implemented new analysis methods and updated others. New advanced queries provide direct access to the SMART relational database using SQL. This database now contains information on intrinsic sequence features such as transmembrane regions, coiled-coils, signal peptides and internal repeats. SMART output can now be easily included in users' documents. A SMART mirror has been created at http://smart.ox.ac.uk.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Ciccarelli F."
                    },
                    {
                        "name": "Copley R.R."
                    },
                    {
                        "name": "Dickens N.J."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Goodstadt L."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Mott R."
                    },
                    {
                        "name": "Ponting C.P."
                    },
                    {
                        "name": "Schultz J."
                    }
                ],
                "citationCount": 574,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Recent improvements to the SMART domain-based sequence-annotation resource"
            },
            "pmcid": "PMC99073",
            "pmid": "11752305"
        },
        {
            "doi": "10.1093/nar/gkj079",
            "metadata": {
                "abstract": "The Simple Modular Architecture Research Tool (SMART) is an online resource (http://smart.embl.de/) used for protein domain identification and the analysis of protein domain architectures. Many new features were implemented to make SMART more accessible to scientists from different fields. The new 'Genomic' mode in SMART makes it easy to analyze domain architectures in completely sequenced genomes. Domain annotation has been updated with a detailed taxonomic breakdown and a prediction of the catalytic activity for 50 SMART domains is now available, based on the presence of essential amino acids. Furthermore, intrinsically disordered protein regions can be identified and displayed. The network context is now displayed in the results page for more than 350 000 proteins, enabling easy analyses of domain interactions.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Copley R.R."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Pils B."
                    },
                    {
                        "name": "Pinkert S."
                    },
                    {
                        "name": "Schultz J."
                    }
                ],
                "citationCount": 834,
                "date": "2006-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "SMART 5: domains in the context of genomes and networks."
            },
            "pmcid": "PMC1347442",
            "pmid": "16381859"
        },
        {
            "doi": "10.1093/nar/gkn808",
            "metadata": {
                "abstract": "Simple modular architecture research tool (SMART) is an online tool (http://smart.embl.de/) for the identification and annotation of protein domains. It provides a user-friendly platform for the exploration and comparative study of domain architectures in both proteins and genes. The current release of SMART contains manually curated models for 784 protein domains. Recent developments were focused on further data integration and improving user friendliness. The underlying protein database based on completely sequenced genomes was greatly expanded and now includes 630 species, compared to 191 in the previous release. As an initial step towards integrating information on biological pathways into SMART, our domain annotations were extended with data on metabolic pathways and links to several pathways resources. The interaction network view was completely redesigned and is now available for more than 2 million proteins. In addition to the standard web access to the database, users can now query SMART using distributed annotation system (DAS) or through a simple object access protocol (SOAP) based web service. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 826,
                "date": "2009-01-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SMART 6: Recent updates and new developments"
            },
            "pmcid": "PMC2686533",
            "pmid": "18978020"
        },
        {
            "doi": "10.1093/nar/gkr931",
            "metadata": {
                "abstract": "SMART (Simple Modular Architecture Research Tool) is an online resource (http://smart.embl.de/) for the identification and annotation of protein domains and the analysis of protein domain architectures. SMART version 7 contains manually curated models for 1009 protein domains, 200 more than in the previous version. The current release introduces several novel features and a streamlined user interface resulting in a faster and more comfortable workflow. The underlying protein databases were greatly expanded, resulting in a 2-fold increase in number of annotated domains and features. The database of completely sequenced genomes now includes 1133 species, compared to 630 in the previous release. Domain architecture analysis results can now be exported and visualized through the iTOL phylogenetic tree viewer. 'metaSMART' was introduced as a novel subresource dedicated to the exploration and analysis of domain architectures in various metagenomics data sets. An advanced full text search engine was implemented, covering the complete annotations for SMART and Pfam domains, as well as the complete set of protein descriptions, allowing users to quickly find relevant information. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 1402,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SMART 7: Recent updates to the protein domain annotation resource"
            },
            "pmcid": "PMC3245027",
            "pmid": "22053084"
        },
        {
            "doi": "10.1093/nar/gkx922",
            "metadata": {
                "abstract": "SMART (Simple Modular Architecture Research Tool) is a web resource (http://smart.embl.de) for the identification and annotation of protein domains and the analysis of protein domain architectures. SMART version 8 contains manually curated models for more than 1300 protein domains, with approximately 100 new models added since our last update article (1). The underlying protein databases were synchronized with UniProt (2), Ensembl (3) and STRING (4), doubling the total number of annotated domains and other protein features to more than 200 million. In its 20th year, the SMART analysis results pages have been streamlined again and its information sources have been updated. SMART's vector based display engine has been extended to all protein schematics in SMART and rewritten to use the latest web technologies. The internal full text search engine has been redesigned and updated, resulting in greatly increased search speed.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 1368,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "20 years of the SMART protein domain annotation resource"
            },
            "pmcid": "PMC5753352",
            "pmid": "29040681"
        },
        {
            "doi": "10.1093/nar/gku949",
            "metadata": {
                "abstract": "SMART (Simple Modular Architecture Research Tool) is a web resource (http://smart.embl.de/) providing simple identification and extensive annotation of protein domains and the exploration of protein domain architectures. In the current version, SMART contains manually curated models for more than 1200 protein domains, with ∼200 new models since our last update article. The underlying protein databases were synchronized with UniProt, Ensembl and STRING, bringing the total number of annotated domains and other protein features above 100 million. SMART's 'Genomic' mode, which annotates proteins from completely sequenced genomes was greatly expanded and now includes 2031 species, compared to 1133 in the previous release. SMART analysis results pages have been completely redesigned and include links to several new information sources. A new, vector-based display engine has been developed for protein schematics in SMART, which can also be exported as highresolution bitmap images for easy inclusion into other documents. Taxonomic tree displays in SMART have been significantly improved, and can be easily navigated using the integrated search engine.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Letunic I."
                    }
                ],
                "citationCount": 1315,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SMART: Recent updates, new developments and status in 2015"
            },
            "pmcid": "PMC4384020",
            "pmid": "25300481",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkh088",
            "pmcid": "PMC308822",
            "pmid": "14681379"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}
