
{
    "credit": [
        {
            "email": "radoslaw.suchecki@adelaide.edu.au",
            "name": "Rad Suchecki",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://crobiad.agwine.adelaide.edu.au/potage/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "labels": {
        "license": "CC-BY-4.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s).POPSEQ Ordered Triticum aestivum Gene Expression (POTAGE) is a web application which accelerates the process of identifying candidate genes for quantitative trait loci (QTL) in hexaploid wheat. This is achieved by leveraging several of the most commonly used data sets in wheat research. These include the Chromosome Survey Sequences, their order along the chromosomes determined by the population sequencing (POPSEQ) approach, the gene predictions and RNA-Seq expression data. POTAGE aggregates those data sets and provides an intuitive interface for biologists to explore the expression of the predicted genes and their functional annotation in a chromosomal context. The interface accelerates some of the laborious and repetitive tasks commonly undertaken in the process of identifying and prioritising genes which may underlie QTL. We illustrate the utility of POTAGE by showing how a short-list of candidate genes can quickly be identified for a QTL linked to pre-harvest sprouting - a major cause of quality and yield loss in wheat production. The candidate genes identified using POTAGE included TaMKK3, which was recently reported as a causal gene for seed dormancy in wheat, and a mutation in its barley ortholog has been shown to reduce pre-harvest sprouting. POTAGE is available at http://crobiad.agwine.adelaide.edu.au/potage.",
            "authors": [
                "Suchecki R.",
                "Watson-Haigh N.S.",
                "Baumann U."
            ],
            "cit_count": 2,
            "doi": "10.1038/s41598-017-14591-7",
            "journal": "Scientific Reports",
            "title": "POTAGE: A Visualisation Tool for Speeding up Gene Discovery in Wheat",
            "year": "2017-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:potage-wheat",
        "biotoolsID": "potage-wheat",
        "description": "Visualisation tool for speeding up gene discovery in wheat.",
        "homepage": "http://crobiad.agwine.adelaide.edu.au/potage/",
        "name": "POTAGE"
    }
}