{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T07:42:02.225426Z",
    "biotoolsCURIE": "biotools:emirge",
    "biotoolsID": "emirge",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christopher.s.miller@ucdenver.edu",
            "name": "Christopher S. Miller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/csmiller"
        }
    ],
    "description": "EMIRGE (Expectation-Maximization Iterative Reconstruction of Genes from the Environment)  reconstructs full length ribosomal genes from short read sequencing data. In the process, it also provides estimates of the sequences' abundances. EMIRGE uses a modification of the EM algorithm to iterate between estimating the expected value of the abundance of all SSU sequences present in a sample and estimating the probabilities for each read that a specific sequence generated that read.  At the end of each iteration, those probabilities are used to re-calculate (correct) a consensus sequence for each reference SSU sequence, and the mapping is\nrepeated, followed by the estimations of probabilities. The iterations should usually stop when the reference sequences no longer change from one iteration to the next.  Practically, 40-80 iterations is usually sufficient for many samples. Right now EMIRGE uses Bowtie alignments internally, though in theory a different mapper could be used.",
    "editPermission": {
        "authors": [
            "Kigaard"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csmiller/EMIRGE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-21T11:10:14.372489Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/csmiller/EMIRGE/issues"
        }
    ],
    "name": "EMIRGE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/gb-2011-12-5-r44."
        },
        {
            "doi": "10.1371/journal.pone.0056018",
            "metadata": {
                "abstract": "In microbial ecology, a fundamental question relates to how community diversity and composition change in response to perturbation. Most studies have had limited ability to deeply sample community structure (e.g. Sanger-sequenced 16S rRNA libraries), or have had limited taxonomic resolution (e.g. studies based on 16S rRNA hypervariable region sequencing). Here, we combine the higher taxonomic resolution of near-full-length 16S rRNA gene amplicons with the economics and sensitivity of short-read sequencing to assay the abundance and identity of organisms that represent as little as 0.01% of sediment bacterial communities. We used a new version of EMIRGE optimized for large data size to reconstruct near-full-length 16S rRNA genes from amplicons sheared and sequenced with Illumina technology. The approach allowed us to differentiate the community composition among samples acquired before perturbation, after acetate amendment shifted the predominant metabolism to iron reduction, and once sulfate reduction began. Results were highly reproducible across technical replicates, and identified specific taxa that responded to the perturbation. All samples contain very high alpha diversity and abundant organisms from phyla without cultivated representatives. Surprisingly, at the time points measured, there was no strong loss of evenness, despite the selective pressure of acetate amendment and change in the terminal electron accepting process. However, community membership was altered significantly. The method allows for sensitive, accurate profiling of the \"long tail\" of low abundance organisms that exist in many microbial communities, and can resolve population dynamics in response to environmental change. © 2013 Miller et al.",
                "authors": [
                    {
                        "name": "Banfield J.F."
                    },
                    {
                        "name": "Frischkorn K.R."
                    },
                    {
                        "name": "Handley K.M."
                    },
                    {
                        "name": "Miller C.S."
                    },
                    {
                        "name": "Thomas B.C."
                    },
                    {
                        "name": "Wrighton K.C."
                    }
                ],
                "citationCount": 97,
                "date": "2013-02-06T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Short-Read Assembly of Full-Length 16S Amplicons Reveals Bacterial Diversity in Subsurface Sediments"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
