{
    "additionDate": "2021-11-29T09:17:08.422981Z",
    "biotoolsCURIE": "biotools:rcsl",
    "biotoolsID": "rcsl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guojunsdu@gmail.com",
            "name": "Guojun Li",
            "orcidid": "https://orcid.org/0000-0003-1581-5897",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zcsu@uncc.edu",
            "name": "Zhengchang Su",
            "orcidid": "https://orcid.org/0000-0003-4636-3440",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Rank Constrained Similarity Learning (RCSL) is Clustering single-cell RNA-seq data by rank constrained similarity learning. RCSL is an R toolkit for single-cell clustering and trajectory analysis using single-cell RNA-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QinglinMei/RCSL",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:15:44.323430Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/QinglinMei/RCSL/issues"
        }
    ],
    "name": "RCSL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab276",
            "metadata": {
                "abstract": "Motivation: Recent breakthroughs of single-cell RNA sequencing (scRNA-seq) technologies offer an exciting opportunity to identify heterogeneous cell types in complex tissues. However, the unavoidable biological noise and technical artifacts in scRNA-seq data as well as the high dimensionality of expression vectors make the problem highly challenging. Consequently, although numerous tools have been developed, their accuracy remains to be improved. Results: Here, we introduce a novel clustering algorithm and tool RCSL (Rank Constrained Similarity Learning) to accurately identify various cell types using scRNA-seq data from a complex tissue. RCSL considers both local similarity and global similarity among the cells to discern the subtle differences among cells of the same type as well as larger differences among cells of different types. RCSL uses Spearman's rank correlations of a cell's expression vector with those of other cells to measure its global similarity, and adaptively learns neighbor representation of a cell as its local similarity. The overall similarity of a cell to other cells is a linear combination of its global similarity and local similarity. RCSL automatically estimates the number of cell types defined in the similarity matrix, and identifies them by constructing a block-diagonal matrix, such that its distance to the similarity matrix is minimized. Each block-diagonal submatrix is a cell cluster/type, corresponding to a connected component in the cognate similarity graph. When tested on 16 benchmark scRNA-seq datasets in which the cell types are well-annotated, RCSL substantially outperformed six state-of-the-art methods in accuracy and robustness as measured by three metrics.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Mei Q."
                    },
                    {
                        "name": "Su Z."
                    }
                ],
                "citationCount": 8,
                "date": "2021-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Clustering single-cell RNA-seq data by rank constrained similarity learning"
            },
            "pmid": "33961003",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
