{
    "additionDate": "2021-01-18T11:46:24Z",
    "biotoolsCURIE": "biotools:yoripred",
    "biotoolsID": "yoripred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bala@ajou.ac.kr",
            "name": "Balachandran Manavalan",
            "typeEntity": "Person"
        },
        {
            "email": "glee@ajou.ac.kr",
            "name": "Gwang Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational prediction of species-specific yeast DNA replication origin via iterative feature representation.\n\nIn yORIpred, 40 optimal baseline models were constructed by exploring eight different sequence-based encodings and five different machine learning classifiers, namely random forest, support vector machine, and extremely randomized tree. The predicted probability of 40 models was concatenated and considered as the novel features that enable us to learn the informative features from several sequential models in a supervised iterative mode. For a given sequence, the yORIpred predicts ORIs or non-ORIs and also the predicted probability value of ORIs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://thegleelab.org/yORIpred",
    "lastUpdate": "2021-03-18T12:35:20Z",
    "name": "yORIpred",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA304",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Deoxyribonucleic acid replication is one of the most crucial tasks taking place in the cell, and it has to be precisely regulated. This process is initiated in the replication origins (ORIs), and thus it is essential to identify such sites for a deeper understanding of the cellular processes and functions related to the regulation of gene expression. Considering the important tasks performed by ORIs, several experimental and computational approaches have been developed in the prediction of such sites. However, existing computational predictors for ORIs have certain curbs, such as building only single-feature encoding models, limited systematic feature engineering efforts and failure to validate model robustness. Hence, we developed a novel species-specific yeast predictor called yORIpred that accurately identify ORIs in the yeast genomes. To develop yORIpred, we first constructed optimal 40 baseline models by exploring eight different sequence-based encodings and five different machine learning classifiers. Subsequently, the predicted probability of 40 models was considered as the novel feature vector and carried out iterative feature learning approach independently using five different classifiers. Our systematic analysis revealed that the feature representation learned by the support vector machine algorithm (yORIpred) could well discriminate the distribution characteristics between ORIs and non-ORIs when compared with the other four algorithms. Comprehensive benchmarking experiments showed that yORIpred achieved superior and stable performance when compared with the existing predictors on the same training datasets. Furthermore, independent evaluation showcased the best and accurate performance of yORIpred thus underscoring the significance of iterative feature representation. To facilitate the users in obtaining their desired results without undergoing any mathematical, statistical or computational hassles, we developed a web server for the yORIpred predictor, which is available at: http://thegleelab.org/yORIpred.",
                "authors": [
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Basith S."
                    },
                    {
                        "name": "Shin T.H."
                    },
                    {
                        "name": "Lee G."
                    }
                ],
                "citationCount": 3,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Computational prediction of species-specific yeast DNA replication origin via iterative feature representation"
            },
            "pmid": "33232970"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ]
}