{
    "accessibility": "Open access",
    "additionDate": "2023-03-28T22:38:43.551020Z",
    "biotoolsCURIE": "biotools:laptrack",
    "biotoolsID": "laptrack",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ysk@yfukai.net",
            "name": "Yohsuke T. Fukai",
            "orcidid": "http://orcid.org/0000-0002-8860-7178",
            "typeEntity": "Person"
        },
        {
            "name": "Kyogo Kawaguchi",
            "orcidid": "http://orcid.org/0000-0001-9395-9875"
        }
    ],
    "description": "Linear assignment particle tracking with tunable metrics.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://laptrack.readthedocs.io/en/stable/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/yfukai/laptrack",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-28T22:40:54.214022Z",
    "license": "BSD-3-Clause",
    "name": "LapTrack",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac799",
            "metadata": {
                "abstract": "MOTIVATION: Particle tracking is an important step of analysis in a variety of scientific fields and is particularly indispensable for the construction of cellular lineages from live images. Although various supervised machine learning methods have been developed for cell tracking, the diversity of the data still necessitates heuristic methods that require parameter estimations from small amounts of data. For this, solving tracking as a linear assignment problem (LAP) has been widely applied and demonstrated to be efficient. However, there has been no implementation that allows custom connection costs, parallel parameter tuning with ground truth annotations, and the functionality to preserve ground truth connections, limiting the application to datasets with partial annotations. RESULTS: We developed LapTrack, a LAP-based tracker which allows including arbitrary cost functions and inputs, parallel parameter tuning and ground-truth track preservation. Analysis of real and artificial datasets demonstrates the advantage of custom metric functions for tracking score improvement from distance-only cases. The tracker can be easily combined with other Python-based tools for particle detection, segmentation and visualization. AVAILABILITY AND IMPLEMENTATION: LapTrack is available as a Python package on PyPi, and the notebook examples are shared at https://github.com/yfukai/laptrack. The data and code for this publication are hosted at https://github.com/NoneqPhysLivingMatterLab/laptrack-optimisation. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Fukai Y.T."
                    },
                    {
                        "name": "Kawaguchi K."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "LapTrack: linear assignment particle tracking with tunable metrics"
            },
            "pmcid": "PMC9825786",
            "pmid": "36495181"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
