{
    "additionDate": "2017-08-03T18:35:19Z",
    "biotoolsCURIE": "biotools:2kplus2",
    "biotoolsID": "2kplus2",
    "credit": [
        {
            "email": "dan.maclean@tsl.ac.uk",
            "name": "Team MacLean",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.danmaclean.info/"
        }
    ],
    "description": "Algorithm that searches graphs produced from the de novo assembler cortex.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/danmaclean/2kplus2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://github.com/danmaclean/2kplus2",
    "language": [
        "Ruby",
        "C++",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/2kplus2-0-1-find-single-nucleotide-polymorphisms-in-k-mer-graphs.html"
        }
    ],
    "name": "2kplus2",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: Single nucleotide polymorphism (SNP) discovery is an important preliminary for understanding genetic variation. With current sequencing methods, we can sample genomes comprehensively. SNPs are found by aligning sequence reads against longer assembled references. De Bruijn graphs are efficient data structures that can deal with the vast amount of data from modern technologies. Recent work has shown that the topology of these graphs captures enough information to allow the detection and characterization of genetic variants, offering an alternative to alignment-based methods. Such methods rely on depth-first walks of the graph to identify closing bifurcations. These methods are conservative or generate many false-positive results, particularly when traversing highly inter-connected (complex) regions of the graph or in regions of very high coverage. Results: We devised an algorithm that calls SNPs in converted De Bruijn graphs by enumerating 2k+2 cycles. We evaluated the accuracy of predicted SNPs by comparison with SNP lists from alignment-based methods. We tested accuracy of the SNP calling using sequence data from 16 ecotypes of Arabidopsis thaliana and found that accuracy was high. We found that SNP calling was even across the genome and genomic feature types. Using sequence-based attributes of the graph to train a decision tree allowed us to increase accuracy of SNP calls further. Together these results indicate that our algorithm is capable of finding SNPs accurately in complex sub-graphs and potentially comprehensively from whole genome graphs.",
                "authors": [
                    {
                        "name": "Younsi R."
                    },
                    {
                        "name": "MacLean D."
                    }
                ],
                "citationCount": 3,
                "date": "2015-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Using 2k+2 bubble searches to find single nucleotide polymorphisms in k-mer graphs"
            },
            "pmid": "25344498"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}