{
    "additionDate": "2021-11-06T10:11:54.878117Z",
    "biotoolsCURIE": "biotools:epinano",
    "biotoolsID": "epinano",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eva.novoa@crg.eu",
            "typeEntity": "Person"
        }
    ],
    "description": "Detection of RNA modifications from Oxford Nanopore direct RNA sequencing reads.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://github.com/enovoa/EpiNano",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-11-06T10:11:54.880609Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://github.com/enovoa/EpiNano/wiki/EpiNano-wiki"
        }
    ],
    "name": "EpiNano",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-1374-0_3",
            "metadata": {
                "abstract": "© 2021, Springer Science+Business Media, LLC, part of Springer Nature.RNA modifications play pivotal roles in the RNA life cycle and RNA fate, and are now appreciated as a major posttranscriptional regulatory layer in the cell. In the last few years, direct RNA nanopore sequencing (dRNA-seq) has emerged as a promising technology that can provide single-molecule resolution maps of RNA modifications in their native RNA context. While native RNA can be successfully sequenced using this technology, the detection of RNA modifications is still challenging. Here, we provide an upgraded version of EpiNano (version 1.2), an algorithm to predict m6A RNA modifications from dRNA-seq datasets. The latest version of EpiNano contains models for predicting m6A RNA modifications in dRNA-seq data that has been base-called with Guppy. Moreover, it can now train models with features extracted from both base-called dRNA-seq FASTQ data and raw FAST5 nanopore outputs. Finally, we describe how EpiNano can be used in stand-alone mode to extract base-calling “error” features and current intensity information from dRNA-seq datasets. In this chapter, we provide step-by-step instructions on how to produce in vitro transcribed constructs to train EpiNano, as well as detailed information on how to use EpiNano to train, test, and predict m6A RNA modifications in dRNA-seq data.",
                "authors": [
                    {
                        "name": "Begik O."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Novoa E.M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "EpiNano: Detection of m6A RNA Modifications Using Oxford Nanopore Direct RNA Sequencing"
            },
            "pmid": "34085237"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
