{
    "additionDate": "2023-02-08T14:49:24.046015Z",
    "biotoolsCURIE": "biotools:linearsampling",
    "biotoolsID": "linearsampling",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liang.huang.sh@gmail.com",
            "name": "Liang Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast stochastic sampling of RNA secondary structure with applications to SARS-CoV-2.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure covariance model generation",
                    "uri": "http://edamontology.org/operation_3469"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LinearFold/LinearSampling",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:04:39.043544Z",
    "license": "Other",
    "name": "LinearSampling",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/nar/gkac1029",
            "metadata": {
                "abstract": "Many RNAs fold into multiple structures at equilibrium, and there is a need to sample these structures according to their probabilities in the ensemble. The conventional sampling algorithm suffers from two limitations: (i) the sampling phase is slow due to many repeated calculations; and (ii) the end-to-end runtime scales cubically with the sequence length. These issues make it difficult to be applied to long RNAs, such as the full genomes of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). To address these problems, we devise a new sampling algorithm, LazySampling, which eliminates redundant work via on-demand caching. Based on LazySampling, we further derive LinearSampling, an end-to-end linear time sampling algorithm. Benchmarking on nine diverse RNA families, the sampled structures from LinearSampling correlate better with the well-established secondary structures than Vienna RNAsubopt and RNAplfold. More importantly, LinearSampling is orders of magnitude faster than standard tools, being 428× faster (72 s versus 8.6 h) than RNAsubopt on the full genome of SARS-CoV-2 (29 903 nt). The resulting sample landscape correlates well with the experimentally guided secondary structure models, and is closer to the alternative conformations revealed by experimentally driven analysis. Finally, LinearSampling finds 23 regions of 15 nt with high accessibilities in the SARS-CoV-2 genome, which are potential targets for COVID-19 diagnostics and therapeutics.",
                "authors": [
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Mathews D.H."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 4,
                "date": "2023-01-25T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LazySampling and LinearSampling: fast stochastic sampling of RNA secondary structure with applications to SARS-CoV-2"
            },
            "pmcid": "PMC9881153",
            "pmid": "36401871"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}
