{
    "name": "MULCCH", 
    "description": "Consensus extension of a multi-task clustering algorithm to infer high-confidence strain-specific host response modules under infections from multiple virus strains.", 
    "homepage": "https://bitbucket.org/roygroup/mulcch", 
    "biotoolsID": "mulcch", 
    "biotoolsCURIE": "biotools:mulcch", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3461", 
                    "term": "Virulence prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3308", 
            "term": "Transcriptomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3324", 
            "term": "Infectious disease"
        }, 
        {
            "uri": "http://edamontology.org/topic_0804", 
            "term": "Immunology"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mulcch-multi-task-spectral-consensus-clustering-for-hierarchically-related-tasks.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/Roy-lab/MULCCH/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26801959", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Multi-task consensus clustering of genome-wide transcriptomes from related biological conditions", 
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved. Motivation: Identifying the shared and pathogen-specific components of host transcriptional regulatory programs is important for understanding the principles of regulation of immune response. Recent efforts in systems biology studies of infectious diseases have resulted in a large collection of datasets measuring host transcriptional response to various pathogens. Computational methods to identify and compare gene expression modules across different infections offer a powerful way to identify strain-specific and shared components of the regulatory program. An important challenge is to identify statistically robust gene expression modules as well as to reliably detect genes that change their module memberships between infections. Results: We present MULCCH (MULti-task spectral Consensus Clustering for Hierarchically related tasks), a consensus extension of a multi-task clustering algorithm to infer high-confidence strain-specific host response modules under infections from multiple virus strains. On simulated data, MULCCH more accurately identifies genes exhibiting pathogen-specific patterns compared to non-consensus and nonmulti-task clustering approaches. Application of MULCCH to mammalian transcriptional response to a panel of influenza viruses showed that our method identifies clusters with greater coherence compared to non-consensus methods. Further, MULCCH derived clusters are enriched for several immune system-related processes and regulators. In summary, MULCCH provides a reliable module-based approach to identify molecular pathways and gene sets characterizing commonality and specificity of host response to viruses of different pathogenicities. Availability and implementation: The source code is available at https://bitbucket.org/roygroup/mulcch.", 
                "date": "2016-05-15T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Niu Z."
                    }, 
                    {
                        "name": "Chasman D."
                    }, 
                    {
                        "name": "Eisfeld A.J."
                    }, 
                    {
                        "name": "Kawaoka Y."
                    }, 
                    {
                        "name": "Roy S."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Roy S", 
            "email": "sroy@biostat.wisc.edu", 
            "url": "http://pages.discovery.wisc.edu/~sroy/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:50:21Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}