{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T07:37:35Z",
    "biotoolsCURIE": "biotools:ep3-secretion",
    "biotoolsID": "ep3-secretion",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fguo@tju.edu.cn",
            "name": "Fei Guo",
            "typeEntity": "Person"
        },
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person"
        }
    ],
    "description": "EP3 is an ensemble predictor that accurately identifies type III secreted effectors",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://lab.malab.cn/~lijing/EP3.html",
    "lastUpdate": "2021-03-08T07:38:55Z",
    "name": "EP3",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA008",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Type III secretion systems (T3SS) can be found in many pathogenic bacteria, such as Dysentery bacillus, Salmonella typhimurium, Vibrio cholera and pathogenic Escherichia coli. The routes of infection of these bacteria include the T3SS transferring a large number of type III secreted effectors (T3SE) into host cells, thereby blocking or adjusting the communication channels of the host cells. Therefore, the accurate identification of T3SEs is the precondition for the further study of pathogenic bacteria. In this article, a new T3SEs ensemble predictor was developed, which can accurately distinguish T3SEs from any unknown protein. In the course of the experiment, methods and models are strictly trained and tested. Compared with other methods, EP3 demonstrates better performance, including the absence of overfitting, strong robustness and powerful predictive ability. EP3 (an ensemble predictor that accurately identifies T3SEs) is designed to simplify the user's (especially nonprofessional users) access to T3SEs for further investigation, which will have a significant impact on understanding the progression of pathogenic bacterial infections. Based on the integrated model that we proposed, a web server had been established to distinguish T3SEs from non-T3SEs, where have EP3_1 and EP3_2. The users can choose the model according to the species of the samples to be tested. Our related tools and data can be accessed through the link http://lab.malab.cn/∼lijing/EP3.html.",
                "authors": [
                    {
                        "name": "Guo F."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 8,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "EP3: An ensemble predictor that accurately identifies type III secreted effectors"
            },
            "pmid": "32043137"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
