{
    "additionDate": "2021-01-18T08:03:42Z",
    "biotoolsCURIE": "biotools:blamm",
    "biotoolsID": "blamm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jan.fostier@ugent.be",
            "name": "Jan Fostier",
            "typeEntity": "Person"
        }
    ],
    "description": "BLAS Accelerated Motif Matching or blamm is a tool to find Position Weight Matrix (PWM) occurrences in DNA sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biointec/blamm",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-04T16:06:00Z",
    "license": "GPL-3.0",
    "name": "BLAMM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3348-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The identification of all matches of a large set of position weight matrices (PWMs) in long DNA sequences requires significant computational resources for which a number of efficient yet complex algorithms have been proposed. Results: We propose BLAMM, a simple and efficient tool inspired by high performance computing techniques. The workload is expressed in terms of matrix-matrix products that are evaluated with high efficiency using optimized BLAS library implementations. The algorithm is easy to parallelize and implement on CPUs and GPUs and has a runtime that is independent of the selected p-value. In terms of single-core performance, it is competitive with state-of-the-art software for PWM matching while being much more efficient when using multithreading. Additionally, BLAMM requires negligible memory. For example, both strands of the entire human genome can be scanned for 1404 PWMs in the JASPAR database in 13 min with a p-value of 10-4 using a 36-core machine. On a dual GPU system, the same task can be performed in under 5 min. Conclusions: BLAMM is an efficient tool for identifying PWM matches in large DNA sequences. Its C++ source code is available under the GNU General Public License Version 3 at https://github.com/biointec/blamm.",
                "authors": [
                    {
                        "name": "Fostier J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BLAMM: BLAS-based algorithm for finding position weight matrix occurrences in DNA sequences on CPUs and GPUs"
            },
            "pmcid": "PMC7068855",
            "pmid": "32164557"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Pure mathematics",
            "uri": "http://edamontology.org/topic_3570"
        }
    ]
}