{
    "additionDate": "2021-01-18T11:20:19Z",
    "biotoolsCURIE": "biotools:kimi",
    "biotoolsID": "kimi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fanyingy@marshall.usc.edu",
            "name": "Yingying Fan",
            "typeEntity": "Person"
        },
        {
            "email": "fsun@usc.edu",
            "name": "Fengzhu Sun",
            "typeEntity": "Person"
        }
    ],
    "description": "Knockoff Inference for Motif Identification from molecular sequences with controlled false discovery rate.\n\nKIMI: R package based on Knockoff Inference for Motif Identification from molecular sequences with controlled false discovery rate.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xinbaiusc/KIMI",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-02-12T10:28:13Z",
    "name": "KIMI",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA912",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: The rapid development of sequencing technologies has enabled us to generate a large number of metagenomic reads from genetic materials in microbial communities, making it possible to gain deep insights into understanding the differences between the genetic materials of different groups of microorganisms, such as bacteria, viruses, plasmids, etc. Computational methods based on k-mer frequencies have been shown to be highly effective for classifying metagenomic sequencing reads into different groups. However, such methods usually use all the k-mers as features for prediction without selecting relevant k-mers for the different groups of sequences, i.e. unique nucleotide patterns containing biological significance. Results: To select k-mers for distinguishing different groups of sequences with guaranteed false discovery rate (FDR) control, we develop KIMI, a general framework based on model-X Knockoffs regarded as the state-of-the-art statistical method for FDR control, for sequence motif discovery with arbitrary target FDR level, such that reproducibility can be theoretically guaranteed. KIMI is shown through simulation studies to be effective in simultaneously controlling FDR and yielding high power, outperforming the broadly used Benjamini-Hochberg procedure and the q-value method for FDR control. To illustrate the usefulness of KIMI in analyzing real datasets, we take the viral motif discovery problem as an example and implement KIMI on a real dataset consisting of viral and bacterial contigs. We show that the accuracy of predicting viral and bacterial contigs can be increased by training the prediction model only on relevant k-mers selected by KIMI. Availabilityand implementation: Our implementation of KIMI is available at https://github.com/xinbaiusc/KIMI.",
                "authors": [
                    {
                        "name": "Bai X."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Sun F."
                    }
                ],
                "date": "2021-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "KIMI: Knockoff Inference for Motif Identification from molecular sequences with controlled false discovery rate"
            },
            "pmid": "33119059"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}