{
    "additionDate": "2021-01-18T12:25:16Z",
    "biotoolsCURIE": "biotools:fvtlda",
    "biotoolsID": "fvtlda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wanglei@xtu.edu.cn",
            "name": "Lei Wang",
            "orcidid": "https://orcid.org/0000-0002-5065-8447",
            "typeEntity": "Person"
        }
    ],
    "description": "FVTLDA is a novel computational model for predicting potential LncRNA-disease associations based on both direct and indirect features of LncRNA-disease pairs.",
    "editPermission": {
        "authors": [
            "Kigaard"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xiaoyubin123/FVTLDA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-11T13:17:37Z",
    "name": "FVTLDA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03906-7",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Accumulating evidence has demonstrated that long non-coding RNAs (lncRNAs) are closely associated with human diseases, and it is useful for the diagnosis and treatment of diseases to get the relationships between lncRNAs and diseases. Due to the high costs and time complexity of traditional bio-experiments, in recent years, more and more computational methods have been proposed by researchers to infer potential lncRNA-disease associations. However, there exist all kinds of limitations in these state-of-the-art prediction methods as well. Results: In this manuscript, a novel computational model named FVTLDA is proposed to infer potential lncRNA-disease associations. In FVTLDA, its major novelty lies in the integration of direct and indirect features related to lncRNA-disease associations such as the feature vectors of lncRNA-disease pairs and their corresponding association probability fractions, which guarantees that FVTLDA can be utilized to predict diseases without known related-lncRNAs and lncRNAs without known related-diseases. Moreover, FVTLDA neither relies solely on known lncRNA-disease nor requires any negative samples, which guarantee that it can infer potential lncRNA-disease associations more equitably and effectively than traditional state-of-the-art prediction methods. Additionally, to avoid the limitations of single model prediction techniques, we combine FVTLDA with the Multiple Linear Regression (MLR) and the Artificial Neural Network (ANN) for data analysis respectively. Simulation experiment results show that FVTLDA with MLR can achieve reliable AUCs of 0.8909, 0.8936 and 0.8970 in 5-Fold Cross Validation (fivefold CV), 10-Fold Cross Validation (tenfold CV) and Leave-One-Out Cross Validation (LOOCV), separately, while FVTLDA with ANN can achieve reliable AUCs of 0.8766, 0.8830 and 0.8807 in fivefold CV, tenfold CV, and LOOCV respectively. Furthermore, in case studies of gastric cancer, leukemia and lung cancer, experiment results show that there are 8, 8 and 8 out of top 10 candidate lncRNAs predicted by FVTLDA with MLR, and 8, 7 and 8 out of top 10 candidate lncRNAs predicted by FVTLDA with ANN, having been verified by recent literature. Comparing with the representative prediction model of KATZLDA, comparison results illustrate that FVTLDA with MLR and FVTLDA with ANN can achieve the average case study contrast scores of 0.8429 and 0.8515 respectively, which are both notably higher than the average case study contrast score of 0.6375 achieved by KATZLDA. Conclusion: The simulation results show that FVTLDA has good prediction performance, which is a good supplement to future bioinformatics research.",
                "authors": [
                    {
                        "name": "Xiao Y."
                    },
                    {
                        "name": "Xiao Z."
                    },
                    {
                        "name": "Feng X."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Kuang L."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A novel computational model for predicting potential LncRNA-disease associations based on both direct and indirect features of LncRNA-disease pairs"
            },
            "pmcid": "PMC7709313",
            "pmid": "33267800"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}