{
    "additionDate": "2019-11-14T18:16:42Z",
    "biotoolsCURIE": "biotools:BJASS",
    "biotoolsID": "BJASS",
    "confidence_flag": "tool",
    "description": "A new joint screening method for right-censored time-to-event data with ultra-high dimensional covariates | Liu, Y., Chen, X., & Li, G. (2019). A new joint screening method for right-censored time-to-event data with ultra-high dimensional covariates. Statistical methods in medical research, 0962280219864710 | This program implements the BJASS joint screening method for DLBCL data (stored in matlab.mat) described in Section 4 of the paper",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yiucla/BJASS",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-09T14:25:29Z",
    "name": "BJASS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1177/0962280219864710",
            "metadata": {
                "abstract": "© The Author(s) 2019.In an ultra-high dimensional setting with a huge number of covariates, variable screening is useful for dimension reduction before applying a more refined method for model selection and statistical analysis. This paper proposes a new sure joint screening procedure for right-censored time-to-event data based on a sparsity-restricted semiparametric accelerated failure time model. Our method, referred to as Buckley-James assisted sure screening (BJASS), consists of an initial screening step using a sparsity-restricted least-squares estimate based on a synthetic time variable and a refinement screening step using a sparsity-restricted least-squares estimate with the Buckley-James imputed event times. The refinement step may be repeated several times to obtain more stable results. We show that with any fixed number of refinement steps, the BJASS procedure retains all important variables with probability tending to 1. Simulation results are presented to illustrate its performance in comparison with some marginal screening methods. Real data examples are provided using a diffuse large-B-cell lymphoma (DLBCL) data and a breast cancer data. We have implemented the BJASS method using Matlab and made it available to readers through Github https://github.com/yiucla/BJASS.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Liu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Statistical Methods in Medical Research",
                "title": "A new joint screening method for right-censored time-to-event data with ultra-high dimensional covariates"
            },
            "pmid": "31359834"
        }
    ],
    "validated": 1
}
