{"credit":[{"email":"michel.petitjean@univ-paris-diderot.fr","name":"Michel Petitjean","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://petitjeanmichel.free.fr/itoweb.petitjean.freeware.html"},{"email":"pierre.tuffery@univ-paris-diderot.fr","name":"Pierre Tuffery","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Protein-ligand docking","uri":"http://edamontology.org/operation_0482"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Compound libraries and screening","uri":"http://edamontology.org/topic_3343"}]},"publication":[{"abstract":"The wwLigCSRre web server performs ligand-based screening using a 3D molecular similarity engine. Its aim is to provide an online versatile facility to assist the exploration of the chemical similarity of families of compounds, or to propose some scaffold hopping from a query compound. The service allows the user to screen several chemically diversified focused banks, such as Kinase-, CNS-, GPCR-, Ion-channel-, Antibacterial-, Anticancer- and Analgesic-focused libraries. The server also provides the possibility to screen the DrugBank and DSSTOX-Carcinogenic compounds databases. User banks can also been downloaded. The 3D similarity search combines both geometrical (3D) and physicochemical information. Starting from one 3D ligand molecule as query, the screening of such databases can lead to unraveled compound scaffold as hits or help to optimize previously identified hit molecules in a SAR (Structure activity relationship) project. wwLigCSRre can be accessed at http://bioserv.rpbs.univ-paris-diderot.fr/wwLigCSRre.html.","authors":["Sperandio O.","Petitjean M.","Tuffery P."],"cit_count":16,"journal":"Nucleic Acids Research","pmid":"19429687","title":"wwLigCSRre: A 3D ligand-based server for hit identification and optimization","year":"2009-08-04"}],"summary":{"biotoolsCURIE":"biotools:wwligcsrre","biotoolsID":"wwligcsrre","description":"The  wwLigCSRre web server performs ligand-based screening using 3D molecular similarity engine. Inputted 3D ligand molecules may be screened against banks such as Kinase-, CNS-, GPCR-, ion-channel-, antibacterial-, anticancer-, and analgesic-focused libraries or DrugBank database.","homepage":"http://bioserv.rpbs.univ-paris-diderot.fr/wwLigCSRre.html","name":"wwLigCSRre"}}