{
    "additionDate": "2021-03-19T08:39:53Z",
    "biotoolsCURIE": "biotools:simplephy",
    "biotoolsID": "simplephy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lago@psych.ucsb.edu",
            "name": "Miguel A. Lago",
            "typeEntity": "Person"
        }
    ],
    "description": "An open-source tool for quick online perception experiments.\n\nBecause of the COVID-19 pandemic, researchers are facing unprecedented challenges that affect our ability to run in-person experiments. With mandated social distancing in a controlled laboratory environment, many researchers are searching for alternative options to conduct research, such as online experimentation. However, online experimentation comes at a cost; learning online tools for building and publishing psychophysics experiments can be complicated and time-consuming. This learning cost is unfortunate because researchers typically only need to use a small percentage of these tools' capabilities, but they still have to deal with these systems' complexities (e.g., complex graphical user interfaces or difficult programming languages). Furthermore, after the experiment is built, researchers often have to find an online platform compatible with the tool they used to program the experiment",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://simplephy.psych.ucsb.edu/",
    "lastUpdate": "2021-04-09T10:04:45Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/malago/simplephy"
        }
    ],
    "name": "SimplePhy",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3758/S13428-020-01515-Z",
            "metadata": {
                "abstract": "© 2021, The Psychonomic Society, Inc.Because of the COVID-19 pandemic, researchers are facing unprecedented challenges that affect our ability to run in-person experiments. With mandated social distancing in a controlled laboratory environment, many researchers are searching for alternative options to conduct research, such as online experimentation. However, online experimentation comes at a cost; learning online tools for building and publishing psychophysics experiments can be complicated and time-consuming. This learning cost is unfortunate because researchers typically only need to use a small percentage of these tools’ capabilities, but they still have to deal with these systems’ complexities (e.g., complex graphical user interfaces or difficult programming languages). Furthermore, after the experiment is built, researchers often have to find an online platform compatible with the tool they used to program the experiment. To simplify and streamline the online process of programming and hosting an experiment, I have created SimplePhy. SimplePhy can save researchers’ time and energy by allowing them to create a study in just a few clicks. All researchers have to do is select among a few experiment settings and upload the stimuli. SimplePhy is able to run most psychophysical perception experiments that require mouse clicks and button presses. In addition to collecting online behavioral data, SimplePhy can also collect information regarding the estimated viewing distance between the participant and the monitor, the screen size, and the experimental trial’s timing—features not always offered in other online platforms. Overall, SimplePhy is a simple, free, open-source tool (code can be found here: https://gitlab.com/malago/simplephy) aimed to help labs conduct their experiments online.",
                "authors": [
                    {
                        "name": "Lago M.A."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "SimplePhy: An open-source tool for quick online perception experiments"
            },
            "pmcid": "PMC7808115",
            "pmid": "33443729"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}