{
    "additionDate": "2020-01-09T18:13:17Z",
    "biotoolsCURIE": "biotools:RsHSF",
    "biotoolsID": "RsHSF",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "nauliulw@njau.edu.cn",
            "name": "Liwang Liu",
            "orcidid": "https://orcid.org/0000-0001-7355-4408",
            "typeEntity": "Person"
        }
    ],
    "description": "Genome-wide characterization and evolutionary analysis of heat shock transcription factors (HSFs) to reveal their potential role under abiotic stresses in radish (Raphanus sativus L.).\n\nGeneral Information about HEATSTER.\n\nAbbreviations of HSF domains and sequence motifs.\n\nThe HEATSTER database contains the full length amino acid and open reading frame nucleotide sequences of heat stress transcription factors (HSFs) compiled for plant species with completed or far advanced genome sequencing projects. The initial version includes 23 angiosperm species with 17 eudicots and 6 monocots and was extended by including additional 10 species in January 2014. The collection will be extended in the future as soon as more annotated whole genome sequencing projects will become available.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'HSF', 'radish', 'HSFs', 'radish abiotic'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://www.cibiv.at/services/hsf/info",
    "lastUpdate": "2020-01-09T18:13:17Z",
    "name": "RsHSF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6121-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Abiotic stresses due to climate change pose a great threat to crop production. Heat shock transcription factors (HSFs) are vital regulators that play key roles in protecting plants against various abiotic stresses. Therefore, the identification and characterization of HSFs is imperative to dissect the mechanism responsible for plant stress responses. Although the HSF gene family has been extensively studied in several plant species, its characterization, evolutionary history and expression patterns in the radish (Raphanus sativus L.) remain limited. Results: In this study, 33 RsHSF genes were obtained from the radish genome, which were classified into three main groups based on HSF protein domain structure. Chromosomal localization analysis revealed that 28 of 33 RsHSF genes were located on nine chromosomes, and 10 duplicated RsHSF genes were grouped into eight gene pairs by whole genome duplication (WGD). Moreover, there were 23 or 9 pairs of orthologous HSFs were identified between radish and Arabidopsis or rice, respectively. Comparative analysis revealed a close relationship among radish, Chinese cabbage and Arabidopsis. RNA-seq data showed that eight RsHSF genes including RsHSF-03, were highly expressed in the leaf, root, cortex, cambium and xylem, indicating that these genes might be involved in plant growth and development. Further, quantitative real-time polymerase chain reaction (RT-qPCR) indicated that the expression patterns of 12 RsHSF genes varied upon exposure to different abiotic stresses including heat, salt, and heavy metals. These results indicated that the RsHSFs may be involved in abiotic stress response. Conclusions: These results could provide fundamental insights into the characteristics and evolution of the HSF family and facilitate further dissection of the molecular mechanism responsible for radish abiotic stress responses.",
                "authors": [
                    {
                        "name": "Tang M."
                    },
                    {
                        "name": "Xu L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Cheng W."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Fan L."
                    },
                    {
                        "name": "Liu L."
                    }
                ],
                "date": "2019-10-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Genome-wide characterization and evolutionary analysis of heat shock transcription factors (HSFs) to reveal their potential role under abiotic stresses in radish (Raphanus sativus L.)"
            },
            "pmcid": "PMC6814140",
            "pmid": "31651257"
        }
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}