{
    "additionDate": "2016-03-10T12:26:32Z",
    "biotoolsCURIE": "biotools:flowsim",
    "biotoolsID": "flowsim",
    "credit": [
        {
            "name": "imr.no",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ketil@malde.org",
            "name": "Ketil Malde",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "ketil@malde.org",
            "name": "Ketil Malde",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Suite of tools to help simulate sets of sequence reads. While the original target was to simulate 454 reads, the different tools can be used quite flexibly to simulate other kinds of sequence data sets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biohaskell.org/Applications/FlowSim"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://malde.org/~ketil/biohaskell/flowsim/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Simulates molecular sequencing",
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://hackage.haskell.org/package/flowsim",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "FlowSim",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ketil.malde@imr.no",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq365",
            "metadata": {
                "abstract": "© The Author(s) 2010.Motivation: The commercial launch of 454 pyrosequencing in 2005 was a milestone in genome sequencing in terms of performance and cost. Throughout the three available releases, average read lengths have increased to ~500 base pairs and are thus approaching read lengths obtained from traditional Sanger sequencing. Study design of sequencing projects would benefit from being able to simulate experiments. Results: We explore 454 raw data to investigate its characteristics and derive empirical distributions for the flow values generated by pyrosequencing. Based on our findings, we implement Flowsim, a simulator that generates realistic pyrosequencing data files of arbitrary size from a given set of input DNA sequences. We finally use our simulator to examine the impact of sequence lengths on the results of concrete whole-genome assemblies, and we suggest its use in planning of sequencing projects, benchmarking of assembly methods and other fields.",
                "authors": [
                    {
                        "name": "Balzer S."
                    },
                    {
                        "name": "Malde K."
                    },
                    {
                        "name": "Lanzen A."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Jonassen I."
                    }
                ],
                "citationCount": 1,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Characteristics of 454 pyrosequencing data-enabling realistic simulation with flowsim"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1756-0500-7-68",
            "metadata": {
                "abstract": "Background: The field of population genetics use the genetic composition of populations to study the effects of ecological and evolutionary factors, including selection, genetic drift, mating structure, and migration. Until recently, these studies were usually based upon the analysis of relatively few (typically 10-20) DNA markers on samples from multiple populations. In contrast, high-throughput sequencing provides large amounts of data and consequently very high resolution genetic information. Recent technological developments are rapidly making this a cost-effective alternative. In addition, sequencing allows both the direct study of genomic differences between population, and the discovery of single nucleotide polymorphism marker that can be subsequently used in high-throughput genotyping. Much of the analysis in population genetics was developed before large scale sequencing became feasible. Methods often do not take into account the characteristics of the different sequencing technologies, and consequently, may not always be well suited to this kind of data. Results: Although the FlowSim suite of tools originally targeted simulation of de novo 454 genomics data, recent developments and enhancements makes it suitable also for simulating other kinds of data. We examine its application to population genomics, and provide examples and supplementary scripts and utilities to aid in this task. Conclusions: Simulation is an important tool to study and develop methods in many fields, and here we demonstrate how to simulate a high-throughput sequencing dataset for population genomics. © 2014 Malde; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Malde K."
                    }
                ],
                "citationCount": 2,
                "date": "2014-01-31T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Simulating a population genomics data set using FlowSim"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btr251",
            "metadata": {
                "abstract": "Motivation: 454 pyrosequencing, by Roche Diagnostics, has emerged as an alternative to Sanger sequencing when it comes to read lengths, performance and cost, but shows higher per-base error rates. Although there are several tools available for noise removal, targeting different application fields, data interpretation would benefit from a better understanding of the different error types. Results: By exploring 454 raw data, we quantify to what extent different factors account for sequencing errors. In addition to the well-known homopolymer length inaccuracies, we have identified errors likely to originate from other stages of the sequencing process. We use our findings to extend the flowsim pipeline with functionalities to simulate these errors, and thus enable a more realistic simulation of 454 pyrosequencing data with flowsim. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Balzer S."
                    },
                    {
                        "name": "Malde K."
                    },
                    {
                        "name": "Jonassen I."
                    }
                ],
                "citationCount": 67,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Systematic exploration of error sources in pyrosequencing flowgram data"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1,
    "version": [
        "0.3.5"
    ]
}