{
    "additionDate": "2019-11-14T19:50:03Z",
    "biotoolsCURIE": "biotools:RNATracker",
    "biotoolsID": "RNATracker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "blanchem@cs.mcgill.ca",
            "name": "Mathieu Blanchette",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of mRNA subcellular localization using deep recurrent neural networks | RNATracker is a deep learning approach to learn mRNA subcellular localization patterns and to infer its outcome. It operates on the cDNA of the longest isoformic protein-coding transcript of a gene with or without its corresponding secondary structure annnotations. The learning targets are fractions/percentage of the transcripts being localized to a fixed set of subcellular compartments of interest",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "https://www.github.com/HarveyYan/RNATracker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-14T08:18:18Z",
    "license": "GPL-3.0",
    "name": "RNATracker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ337",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Messenger RNA subcellular localization mechanisms play a crucial role in post-transcriptional gene regulation. This trafficking is mediated by trans-acting RNA-binding proteins interacting with cis-regulatory elements called zipcodes. While new sequencing-based technologies allow the high-throughput identification of RNAs localized to specific subcellular compartments, the precise mechanisms at play, and their dependency on specific sequence elements, remain poorly understood. Results: We introduce RNATracker, a novel deep neural network built to predict, from their sequence alone, the distributions of mRNA transcripts over a predefined set of subcellular compartments. RNATracker integrates several state-of-the-art deep learning techniques (e.g. CNN, LSTM and attention layers) and can make use of both sequence and secondary structure information. We report on a variety of evaluations showing RNATracker's strong predictive power, which is significantly superior to a variety of baseline predictors. Despite its complexity, several aspects of the model can be isolated to yield valuable, testable mechanistic hypotheses, and to locate candidate zipcode sequences within transcripts.",
                "authors": [
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Lecuyer E."
                    },
                    {
                        "name": "Blanchette M."
                    }
                ],
                "citationCount": 14,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Prediction of mRNA subcellular localization using deep recurrent neural networks"
            },
            "pmcid": "PMC6612824",
            "pmid": "31510698"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}