{
    "additionDate": "2019-11-14T19:47:33Z",
    "biotoolsCURIE": "biotools:AOP",
    "biotoolsID": "AOP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Noyes.pamela@epa.gov",
            "name": "Pamela D. Noyes",
            "typeEntity": "Person"
        }
    ],
    "description": "Opportunities and Challenges with in Vitro Testing and Adverse Outcome Pathway Approaches | Welcome to the Collaborative Adverse Outcome Pathway Wiki (AOP-Wiki) | This wiki is hosted by the Society for the Advancement of Adverse Outcome Pathways (SAAOP) and serves as one component of a larger OECD-sponsored AOP Knowledgebase (AOP-KB) effort. The AOP-KB represents the central repository for all AOPs developed as part of the OECD AOP Development Effort by the Extended Advisory Group on Molecular Screening and Toxicogenomics. All AOPs from the AOP Knowledgebase are available via the e.AOP.Portal, which is the primary entry point for the AOP-KB. More information about the AOP-KB efforts, the organizations supporting these efforts, and the other modules of the AOP-KB are available on the About page",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://aopwiki.org/",
    "lastUpdate": "2020-12-09T12:56:55.277686Z",
    "name": "AOP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1289/EHP5297",
            "metadata": {
                "abstract": "© 2019, Public Health Services, US Dept of Health and Human Services. All rights reserved.BACKGROUND: Extensive clinical and experimental research documents the potential for chemical disruption of thyroid hormone (TH) signaling through multiple molecular targets. Perturbation of TH signaling can lead to abnormal brain development, cognitive impairments, and other adverse outcomes in humans and wildlife. To increase chemical safety screening efficiency and reduce vertebrate animal testing, in vitro assays that identify chemical interactions with molecular targets of the thyroid system have been developed and implemented. OBJECTIVES: We present an adverse outcome pathway (AOP) network to link data derived from in vitro assays that measure chemical interactions with thyroid molecular targets to downstream events and adverse outcomes traditionally derived from in vivo testing. We examine the role of new in vitro technologies, in the context of the AOP network, in facilitating consideration of several important regulatory and biological challenges in characterizing chemicals that exert effects through a thyroid mechanism. DISCUSSION: There is a substantial body of knowledge describing chemical effects on molecular and physiological regulation of TH signaling and associated adverse outcomes. Until recently, few alternative nonanimal assays were available to interrogate chemical effects on TH signaling. With the development of these new tools, screening large libraries of chemicals for interactions with molecular targets of the thyroid is now possible. Measuring early chemical interactions with targets in the thyroid pathway provides a means of linking adverse outcomes, which may be influenced by many biological processes, to a thyroid mechanism. However, the use of in vitro assays beyond chemical screening is complicated by continuing limits in our knowledge of TH signaling in important life stages and tissues, such as during fetal brain development. Nonetheless, the thyroid AOP network provides an ideal tool for defining causal linkages of a chemical exerting thyroid-dependent effects and identifying research needs to quantify these effects in support of regulatory decision making. https://doi.org/10.1289/EHP5297.",
                "authors": [
                    {
                        "name": "Noyes P.D."
                    },
                    {
                        "name": "Friedman K.P."
                    },
                    {
                        "name": "Browne P."
                    },
                    {
                        "name": "Haselman J.T."
                    },
                    {
                        "name": "Gilbert M.E."
                    },
                    {
                        "name": "Hornung M.W."
                    },
                    {
                        "name": "Barone S."
                    },
                    {
                        "name": "Crofton K.M."
                    },
                    {
                        "name": "Laws S.C."
                    },
                    {
                        "name": "Stoker T.E."
                    },
                    {
                        "name": "Simmons S.O."
                    },
                    {
                        "name": "Tietge J.E."
                    },
                    {
                        "name": "Degitz S.J."
                    }
                ],
                "citationCount": 10,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Environmental Health Perspectives",
                "title": "Evaluating chemicals for thyroid disruption: Opportunities and challenges with in Vitro testing and adverse outcome pathway approaches"
            },
            "pmcid": "PMC6791490",
            "pmid": "31487205"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ]
}