{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:22:58Z",
    "biotoolsCURIE": "biotools:QuantileBootstrap",
    "biotoolsID": "QuantileBootstrap",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "james@tropmedres.ac",
            "name": "James A. Watson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Decision-theoretic approach to the evaluation of machine learning algorithms in computational drug discovery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/owatson/QuantileBootstrap",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/owatson/QuantileBootstrap/issues"
        }
    ],
    "maturity": "Mature",
    "name": "QuantileBootstrap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ293",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Artificial intelligence, trained via machine learning (e.g. neural nets, random forests) or computational statistical algorithms (e.g. support vector machines, ridge regression), holds much promise for the improvement of small-molecule drug discovery. However, small-molecule structure- activity data are high dimensional with low signal-to-noise ratios and proper validation of predictive methods is difficult. It is poorly understood which, if any, of the currently available machine learning algorithms will best predict new candidate drugs. Results: The quantile-activity bootstrap is proposed as a new model validation framework using quantile splits on the activity distribution function to construct training and testing sets. In addition, we propose two novel rank-based loss functions which penalize only the out-of-sample predicted ranks of high-activity molecules. The combination of these methods was used to assess the performance of neural nets, random forests, support vector machines (regression) and ridge regression applied to 25 diverse high-quality structure-activity datasets publicly available on ChEMBL. Model validation based on random partitioning of available data favours models that overfit and 'memorize' the training set, namely random forests and deep neural nets. Partitioning based on quantiles of the activity distribution correctly penalizes extrapolation of models onto structurally different molecules outside of the training data. Simpler, traditional statistical methods such as ridge regression can outperform state-of-the-art machine learning methods in this setting. In addition, our new rank-based loss functions give considerably different results from mean squared error highlighting the necessity to define model optimality with respect to the decision task at hand.",
                "authors": [
                    {
                        "name": "Watson O.P."
                    },
                    {
                        "name": "Cortes-Ciriano I."
                    },
                    {
                        "name": "Taylor A.R."
                    },
                    {
                        "name": "Watson J.A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A decision-theoretic approach to the evaluation of machine learning algorithms in computational drug discovery"
            },
            "pmid": "31070704",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}