{
    "accessibility": "Open access",
    "additionDate": "2022-06-13T10:30:50.804992Z",
    "biotoolsCURIE": "biotools:fazseg",
    "biotoolsID": "fazseg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jothibalaji@gmail.com",
            "name": "Janarthanam Jothi Balaji",
            "orcidid": "https://orcid.org/0000-0003-4138-9334",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool to validate newly developed automated segmentation algorithms.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VIEKASH2001/FAZSeg",
    "lastUpdate": "2022-06-13T10:30:50.807593Z",
    "name": "FAZSeg",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.2147/OPTH.S346145",
            "metadata": {
                "abstract": "© 2021 Viekash et al.Introduction: Various ocular diseases and high myopia influence the anatomical reference point Foveal Avascular Zone (FAZ) dimensions. Therefore, it is important to segment and quantify the FAZs dimensions accurately. To the best of our knowledge, there is no automated tool or algorithms available to segment the FAZ’s deep retinal layer. The paper describes a new open-access software with a Graphical User Interface (GUI) and compares the results with the ground truth (manual segmentation). Methods: Ninety-three healthy normal subjects included 30 emmetropia and 63 myopic subjects without any sight-threatening retinal conditions, were included in the study. The 6mm x 6mm using the Angioplex protocol (Cirrus 5000 Carl Zeiss Meditec Inc., Dublin, CA) was used, and all the images were aligned with the centre of the fovea. Each FAZ image corresponding to dimensions 420×420 pixels were used in this study. These FAZ image dimensions for the superficial and deep layers were quantified using the New Automated Software Method (NAM). The NAM-based FAZ dimensions were validated with the ground truth. Results: The age distribution for all 93 subjects was 28.02 ± 10.79 (range, 10.0–66.0) years. For normal subjects mean ± SD age distribution was 32.13 ± 16.27 years. Similarly, the myopia age distribution was 26.06 ± 6.06 years. The NAM had an accuracy of 91.40%. Moreover, the NAM on superficial layer FAZ gave a Dice Similarity Coefficient (DSC) score of 0.94 and Structural Similarity Index Metric (SSIM) of 0.97, while the NAM on deep layer FAZ gave a DSC score of 0.96 and SSIM of 0.98. Conclusion: A clinician-based GUI software was designed and tested on the FAZ images from deep and superficial layers. The NAM outperformed the device’s inbuilt algorithm when measuring the superficial layer. This open-source software package is in the public domain and can be downloaded online.",
                "authors": [
                    {
                        "name": "Balaji J.J."
                    },
                    {
                        "name": "Lakshminarayanan V."
                    },
                    {
                        "name": "Viekash V.K."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Clinical Ophthalmology",
                "title": "FAZSeg: A New Software for Quantification of the Foveal Avascular Zone"
            },
            "pmcid": "PMC8714006",
            "pmid": "34992342"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
