{
    "additionDate": "2017-08-20T15:57:30Z",
    "biotoolsCURIE": "biotools:hotspotter",
    "biotoolsID": "hotspotter",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wuolong@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software for identifying recombination hotspots from population SNP data.",
    "documentation": [
        {
            "note": "Documentation can be found in the downloadable archive.",
            "type": [
                "General"
            ],
            "url": "http://stephenslab.uchicago.edu/software.html#hotspotter"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "http://stephenslab.uchicago.edu/software.html#hotspotter",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "HOTSPOTTER",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "metadata": {
                "abstract": "We introduce a new statistical model for patterns of linkage disequilibrium (LD) among multiple SNPs in a population sample. The model overcomes limitations of existing approaches to understanding, summarizing, and interpreting LD by (i) relating patterns of LD directly to the underlying recombination process; (ii) considering all loci simultaneously, rather than pairwise; (iii) avoiding the assumption that LD necessarily has a \"block-like\" structure; and (iv) being computationally tractable for huge genomic regions (up to complete chromosomes). We examine in detail one natural application of the model: estimation of underlying recombination rates from population data. Using simulation, we show that in the case where recombination is assumed constant across the region of interest, recombination rate estimates based on our model are competitive with the very best of current available methods. More importantly, we demonstrate, on real and simulated data, the potential of the model to help identify and quantify fine-scale variation in recombination rate from population data. We also outline how the model could be useful in other contexts, such as in the development of more efficient haplotype-based methods for LD mapping.",
                "authors": [
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 585,
                "date": "2003-12-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Modeling Linkage Disequilibrium and Identifying Recombination Hotspots Using Single-Nucleotide Polymorphism Data"
            },
            "pmcid": "PMC1462870",
            "pmid": "14704198",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}