{
    "additionDate": "2020-01-14T08:56:28Z",
    "biotoolsCURIE": "biotools:WPMIAS",
    "biotoolsID": "WPMIAS",
    "confidence_flag": "tool",
    "description": "Whole-degradome-based Plant MicroRNA-Target Interaction Analysis Server.\n\nIf you use WPMIAS, please cite this article: Yuhan Fei, Yiyang Mao, Chengji Shen, Rui Wang, Hongsheng Zhang, Ji Huang, \"WPMIAS: Whole-degradome-based Plant MicroRNA-Target Interaction Analysis Server\", Bioinformatics, 2019, in press. DOI:10.1093/bioinformatics/btz820",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://cbi.njau.edu.cn/WPMIAS/",
    "lastUpdate": "2021-01-06T15:09:16Z",
    "name": "WPMIAS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ820",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.A critical aspect for exploring the biological function of a microRNA (miRNA) lies on exact detection and validation of its target mRNAs. However, no convenient and efficient web-based server is available for plant biologists to identify the experimentally verified target mRNAs of miRNAs. In this work, we built a comprehensive web-based platform for miRNA–target analysis, named as Whole-degradome-based Plant MiRNA–target Interaction Analysis Server (WPMIAS), for validation of predicted interactions of miRNAs and their target mRNAs (MTIs) by user-submitted data or all available pre-loaded degradome data. Besides, the server can construct degradome-based miRNA regulatory networks (MRNs) based on the validated MTIs to help study the functions and relations among miRNAs and target mRNAs. WPMIAS is also suitable for other small RNAs (sRNAs), such as 21-nt phased siRNAs and natural antisense siRNAs, which direct cleavage of target mRNAs. Currently, WPMIAS supports 68 plant species with 189 cDNA and 271 pre-loaded plant degradome datasets. The user can identify all validated MTIs by analyzing all degradome data at a time and understand when and where MTIs take place and their cleavage levels. With the data obtained from WPMIAS, the user can build a plant miRNA–target map, where it is convenient to find interesting research ideas on miRNAs. In summary, WPMIAS is able to support a comprehensive web-based plant miRNA–target analysis and expected to greatly promote future research on plant miRNAs.",
                "authors": [
                    {
                        "name": "Fei Y."
                    },
                    {
                        "name": "Mao Y."
                    },
                    {
                        "name": "Shen C."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Huang J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "WPMIAS: Whole-degradome-based plant MicroRNA–Target interaction analysis server"
            },
            "pmid": "31693067"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1
}