{
    "additionDate": "2020-03-30T09:08:37Z",
    "biotoolsCURIE": "biotools:medusa3",
    "biotoolsID": "medusa3",
    "credit": [
        {
            "name": "Georgios Pavlopoulos",
            "orcidid": "http://orcid.org/0000-0002-4577-8276"
        }
    ],
    "description": "Visualization of networks with multi-edge connections",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://sites.google.com/site/medusa3visualization/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-25T13:58:38.810102Z",
    "maturity": "Mature",
    "name": "Medusa3",
    "owner": "g.pavlopoulos",
    "publication": [
        {
            "doi": "10.1186/1756-0500-4-384",
            "metadata": {
                "abstract": "Abstract. Background: Biological processes such as metabolic pathways, gene regulation or protein-protein interactions are often represented as graphs in systems biology. The understanding of such networks, their analysis, and their visualization are today important challenges in life sciences. While a great variety of visualization tools that try to address most of these challenges already exists, only few of them succeed to bridge the gap between visualization and network analysis. Findings. Medusa is a powerful tool for visualization and clustering analysis of large-scale biological networks. It is highly interactive and it supports weighted and unweighted multi-edged directed and undirected graphs. It combines a variety of layouts and clustering methods for comprehensive views and advanced data analysis. Its main purpose is to integrate visualization and analysis of heterogeneous data from different sources into a single network. Conclusions: Medusa provides a concise visual tool, which is helpful for network analysis and interpretation. Medusa is offered both as a standalone application and as an applet written in Java. It can be found at: https://sites.google.com/site/medusa3visualization. © 2011 Pavlopoulos et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Aerts J."
                    },
                    {
                        "name": "Hooper S.D."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Schneider R."
                    },
                    {
                        "name": "Sifrim A."
                    }
                ],
                "citationCount": 49,
                "date": "2011-10-07T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Medusa: A tool for exploring and clustering biological networks"
            },
            "pmcid": "PMC3197509",
            "pmid": "21978489"
        },
        {
            "doi": "10.1093/bioinformatics/bti696",
            "metadata": {
                "abstract": "Summary: Medusa is a Java application for visualizing and manipulating graphs of interaction, such as data from the STRING database. It features an intuitive user interface developed with the help of biologists. Medusa is optimized for accessing protein interaction data from STRING, but can be used for any type of graph from any scientific field. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Hooper S.D."
                    }
                ],
                "citationCount": 149,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Medusa: A simple tool for interaction graph analysis"
            },
            "pmid": "16188923"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
