{
    "additionDate": "2021-02-16T17:45:54Z",
    "biotoolsCURIE": "biotools:iqtree",
    "biotoolsID": "iqtree",
    "description": "A fast and effective stochastic algorithm to infer phylogenetic trees by maximum likelihood. IQ-TREE compares favorably to RAxML and PhyML in terms of likelihoods with similar computing time",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://www.iqtree.org/",
    "lastUpdate": "2024-11-24T20:43:30.383454Z",
    "name": "iqtree",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1093/molbev/msu300",
            "metadata": {
                "abstract": "Large phylogenomics data sets require fast tree inference methods, especially for maximum-likelihood (ML) phylogenies. Fast programs exist, but due to inherent heuristics to find optimal trees, it is not clear whether the best tree is found. Thus, there is need for additional approaches that employ different search strategies to find ML trees and that are at the same time as fast as currently available ML programs. We show that a combination of hill-climbing approaches and a stochastic perturbation method can be time-efficiently implemented. If we allow the same CPU time as RAxML and PhyML, then our software IQ-TREE found higher likelihoods between 62.2% and 87.1% of the studied alignments, thus efficiently exploring the tree-space. If we use the IQ-TREE stopping rule, RAxML and PhyML are faster in 75.7% and 47.1% of the DNA alignments and 42.2% and 100% of the protein alignments, respectively. However, the range of obtaining higher likelihoods with IQ-TREE improves to 73.3-97.1%. IQ-TREE is freely available at http://www.cibiv.at/software/iqtree.",
                "authors": [
                    {
                        "name": "Minh B.Q."
                    },
                    {
                        "name": "Nguyen L.-T."
                    },
                    {
                        "name": "Schmidt H.A."
                    },
                    {
                        "name": "Von Haeseler A."
                    }
                ],
                "citationCount": 15872,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "IQ-TREE: A fast and effective stochastic algorithm for estimating maximum-likelihood phylogenies"
            },
            "pmcid": "PMC4271533",
            "pmid": "25371430"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}
