
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://exonfinder.sourceforge.net/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Introns",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Exons",
                "uri": "http://edamontology.org/topic_3512"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/exonfinder-2-0-extract-novel-cassette-exonsretained-introns.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Chuang et al.Background: Crop plants such as rice, maize and sorghum play economically-important roles as main sources of food, fuel, and animal feed. However, current genome annotations of crop plants still suffer false-positive predictions; a more comprehensive registry of alternative splicing (AS) events is also in demand. Comparative genomics of crop plants is largely unexplored. Results: We performed a large-scale comparative analysis (ExonFinder) of the expressed sequence tag (EST) library from nine grass plants against three crop genomes (rice, maize, and sorghum) and identified 2,879 previously-unannotated exons (i.e., novel exons) in the three crops. We validated 81% of the tested exons by RT-PCR-sequencing, supporting the effectiveness of our in silico strategy. Evolutionary analysis reveals that the novel exons, comparing with their flanking annotated ones, are generally under weaker selection pressure at the protein level, but under stronger pressure at the RNA level, suggesting that most of the novel exons also represent novel alternatively spliced variants (ASVs). However, we also observed the consistency of evolutionary rates between certain novel exons and their flanking exons, which provided further evidence of their co-occurrence in the transcripts, suggesting that previously-annotated isoforms might be subject to erroneous predictions. Our validation showed that 54% of the tested genes expressed the newly-identified isoforms that contained the novel exons, rather than the previously-annotated isoforms that excluded them. The consistent results were steadily observed across cultivated (Oryza sativa and O. glaberrima) and wild (O. rufipogon and O. nivara) rice species, asserting the necessity of our curation of the crop genome annotations. Our comparative analyses also inferred the common ancestral transcriptome of grass plants and gain- and loss-of-ASV events. Conclusions: We have reannotated the rice, maize, and sorghum genomes, and showed that evolutionary rates might serve as an indicator for determining whether the identified exons were alternatively spliced. This study not only presents an effective in silico strategy for the improvement of plant annotations, but also provides further insights into the role of AS events in the evolution and domestication of crop plants. ExonFinder and the novel exons/ASVs identified are publicly accessible at http://exonfinder.sourceforge.net/.",
            "authors": [
                "Chuang T.-J.",
                "Yang M.-Y.",
                "Lin C.-C.",
                "Hsieh P.-H.",
                "Hung L.-Y."
            ],
            "cit_count": 4,
            "doi": "10.1186/s12870-015-0431-7",
            "journal": "BMC Plant Biology",
            "title": "Comparative genomics of grass EST libraries reveals previously uncharacterized splicing events in crop plants",
            "type": "Primary",
            "year": "2015-02-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:exonfinder",
        "biotoolsID": "exonfinder",
        "description": "ExonFinder provides a pipeline to extract novel cassette exons and novel retained-introns from the results of mapping cross-species ESTs against a target genome via blat.",
        "homepage": "http://exonfinder.sourceforge.net/",
        "name": "ExonFinder",
        "version": [
            "2.0"
        ]
    }
}