{
    "additionDate": "2020-01-14T19:40:51Z",
    "biotoolsCURIE": "biotools:mango_eda",
    "biotoolsID": "mango_eda",
    "confidence_flag": "tool",
    "description": "Exploratory Data Analysis for Large-Scale Sequencing Datasets.\n\nMango User Guide — bdgenomics.mango 0.0.5 documentation.\n\nFree document hosting provided by Read the Docs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://bdg-mango.readthedocs.io/en/latest/",
    "lastUpdate": "2021-01-14T08:11:25Z",
    "name": "Mango_EDA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2019.11.002",
            "metadata": {
                "abstract": "© 2019 The AuthorsThe decreasing cost of DNA sequencing over the past decade has led to an explosion of sequencing datasets, leaving us with petabytes of data to analyze. However, current sequencing visualization tools are designed to run on single machines, which limits their scalability and interactivity on modern genomic datasets. Here, we leverage the scalability of Apache Spark to provide Mango, consisting of a Jupyter notebook and genome browser, which removes scalability and interactivity constraints by leveraging multi-node compute clusters to allow interactive analysis over terabytes of sequencing data. We demonstrate scalability of the Mango tools by performing quality control analyses on 10 terabytes of 100 high-coverage sequencing samples from the Simons Genome Diversity Project, enabling capability for interactive genomic exploration of multi-sample datasets that surpass the computational limitations of single-node visualization tools. Mango is freely available for download with full documentation at https://bdg-mango.readthedocs.io/en/latest/. The decreasing cost of DNA sequencing has led to petabytes of sequencing data for analysts in research and clinical settings to develop data-driven hypotheses from. Mango is a sequence visualization tool that leverages multi-node compute clusters to allow interactive analysis over large sequencing datasets. Mango provides a genome browser graphical user interface and python notebook form factor to allow users of varying analytical experience to explore large sequencing datasets.",
                "authors": [
                    {
                        "name": "He G.Z."
                    },
                    {
                        "name": "Joseph A.D."
                    },
                    {
                        "name": "Morrow A.K."
                    },
                    {
                        "name": "Nothaft F.A."
                    },
                    {
                        "name": "Paschall J."
                    },
                    {
                        "name": "Tu E.T."
                    },
                    {
                        "name": "Yosef N."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-18T00:00:00Z",
                "journal": "Cell Systems",
                "title": "Mango: Exploratory Data Analysis for Large-Scale Sequencing Datasets"
            },
            "pmid": "31812694"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}
