{
    "additionDate": "2023-01-26T15:35:05.561875Z",
    "biotoolsCURIE": "biotools:caa-net",
    "biotoolsID": "caa-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jinhao Li"
        }
    ],
    "description": "a novel end-to-end fully convolutional network, named Class-Aware Attention Network (CAA-Net), for automatically diagnosing infectious keratitis (normal, viral keratitis, fungal keratitis, and bacterial keratitis) using corneal photographs",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/SWF-hao/CAA-Net_Pytorch",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:08:52.321767Z",
    "license": "Not licensed",
    "name": "CAA-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.106301",
            "metadata": {
                "abstract": "Infectious keratitis is one of the common ophthalmic diseases and also one of the main blinding eye diseases in China, hence rapid and accurate diagnosis and treatment for infectious keratitis are urgent to prevent the progression of the disease and limit the degree of corneal injury. Unfortunately, the traditional manual diagnosis accuracy is usually unsatisfactory due to the indistinguishable visual features. In this paper, we propose a novel end-to-end fully convolutional network, named Class-Aware Attention Network (CAA-Net), for automatically diagnosing infectious keratitis (normal, viral keratitis, fungal keratitis, and bacterial keratitis) using corneal photographs. In CAA-Net, a class-aware classification module is first trained to learn class-related discriminative features using separate branches for each class. Then, the learned class-aware discriminative features are fed into the main branch and fused with other feature maps using two attention strategies to assist the final multi-class classification performance. For the experiments, we have built a new corneal photograph dataset with 1886 images from 519 patients and conducted comprehensive experiments to verify the effectiveness of our proposed method. The code is available at https://github.com/SWF-hao/CAA-Net_Pytorch.",
                "authors": [
                    {
                        "name": "Hu S."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xu P."
                    },
                    {
                        "name": "Ye J."
                    }
                ],
                "citationCount": 12,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Class-Aware Attention Network for infectious keratitis diagnosis using corneal photographs"
            },
            "pmid": "36403354"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
