{
    "additionDate": "2025-07-30T10:37:08.226825Z",
    "biotoolsCURIE": "biotools:eukrep",
    "biotoolsID": "eukrep",
    "description": "Classification of Eukaryotic and Prokaryotic sequences from metagenomic datasets",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/patrickwest/EukRep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2025-07-30T10:37:08.229304Z",
    "license": "MIT",
    "name": "EukRep",
    "owner": "m.bernt",
    "publication": [
        {
            "doi": "10.1101/gr.228429.117",
            "metadata": {
                "abstract": "Microbial eukaryotes are integral components of natural microbial communities, and their inclusion is critical for many ecosystem studies, yet the majority of published metagenome analyses ignore eukaryotes. In order to include eukaryotes in environmental studies, we propose a method to recover eukaryotic genomes from complex metagenomic samples. A key step for genome recovery is separation of eukaryotic and prokaryotic fragments. We developed a k-mer-based strategy, EukRep, for eukaryotic sequence identification and applied it to environmental samples to show that it enables genome recovery, genome completeness evaluation, and prediction of metabolic potential. We used this approach to test the effect of addition of organic carbon on a geyser-associated microbial community and detected a substantial change of the community metabolism, with selection against almost all candidate phyla bacteria and archaea and for eukaryotes. Near complete genomes were reconstructed for three fungi placed within the Eurotiomycetes and an arthropod. While carbon fixation and sulfur oxidation were important functions in the geyser community prior to carbon addition, the organic carbon-impacted community showed enrichment for secreted proteases, secreted lipases, cellulose targeting CAZymes, and methanol oxidation. We demonstrate the broader utility of EukRep by reconstructing and evaluating relatively high-quality fungal, protist, and rotifer genomes from complex environmental samples. This approach opens the way for cultivation-independent analyses of whole microbial communities.",
                "authors": [
                    {
                        "name": "Banfield J.F."
                    },
                    {
                        "name": "Grigoriev I.V."
                    },
                    {
                        "name": "Probst A.J."
                    },
                    {
                        "name": "Thomas B.C."
                    },
                    {
                        "name": "West P.T."
                    }
                ],
                "citationCount": 143,
                "date": "2018-04-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Genome-reconstruction for eukaryotes from complex natural microbial communities"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}
