{
    "additionDate": "2018-06-14T15:12:08Z",
    "biotoolsCURIE": "biotools:isescan",
    "biotoolsID": "isescan",
    "credit": [
        {
            "email": "xiezhq@hotmail.com",
            "name": "Zhiqun Xie",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated identification of insertion sequence elements in prokaryotic genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/xiezhq/ISEScan"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xiezhq/ISEScan",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "ISEScan",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx433",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.comMotivation: The insertion sequence (IS) elements are the smallest but most abundant autonomous transposable elements in prokaryotic genomes, which play a key role in prokaryotic genome organization and evolution. With the fast growing genomic data, it is becoming increasingly critical for biology researchers to be able to accurately and automatically annotate ISs in prokaryotic genome sequences. The available automatic IS annotation systems are either providing only incomplete IS annotation or relying on the availability of existing genome annotations. Here, we present a new IS elements annotation pipeline to address these issues.Results: ISEScan is a highly sensitive software pipeline based on profile hidden Markov models constructed from manually curated IS elements. ISEScan performs better than existing IS annotation systems when tested on prokaryotic genomes with curated annotations of IS elements. Applying it to 2784 prokaryotic genomes, we report the global distribution of IS families across taxonomic clades in Archaea and Bacteria.Availability and implementation: ISEScan is implemented in Python and released as an open source software at https://github.com/xiezhq/ISEScan.Contact: hatang@indiana.edu.Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Xie Z."
                    }
                ],
                "citationCount": 44,
                "date": "2017-11-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "ISEScan: automated identification of insertion sequence elements in prokaryotic genomes"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
