
{
    "credit": [
    ],
    "documentation": [
        {
            "url": "https://www.saavpedia.org/guide/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "Apache-2.0",
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Pharmacology",
                "uri": "http://edamontology.org/topic_0202"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/saavpedia/python/"
        }
    ],
    "publication": [
        {
            "abstract": "Copyright © 2019 American Chemical Society.Next-generation genome sequencing has enabled the discovery of numerous disease-or drug-response-associated nonsynonymous single nucleotide variants (nsSNVs) that alter the amino acid sequences of a protein. Although several studies have attempted to characterize pathogenic nsSNVs, few have been confirmed as single amino acid variants (SAAVs) at the protein level. Here we developed the SAAVpedia platform to identify, annotate, and retrieve pathogenic SAAV candidates from proteomic and genomic data. The platform consists of four modules: SAAVidentifier, SAAVannotator, SNV/SAAVretriever, and SAAVvisualizer. The SAAVidentifier provides a reference database containing 18â»206â»090 SAAVs and performs the identification and quality assessment of SAAVs. The SAAVannotator provides functional annotation with biological, clinical, and pharmacological information for the interpretation of condition-specific SAAVs. The SNV/SAAVretriever module enables bidirectional navigation between relevant SAAVs and nsSNVs with diverse genomic and proteomic data. SAAVvisualizer provides various statistical plots based on functional annotations of detected SAAVs. To demonstrate the utility of SAAVpedia, the proteogenomic pipeline with protein-protein interaction network analysis was applied to proteomic data from breast cancer and glioblastoma patients. We identified 1326 and 12 breast-cancer- A nd glioblastoma-related genes that contained one or more SAAVs, including BRCA2 and FAM49B, respectively. SAAVpedia is a suitable platform for confirming whether a genomic variant is maintained in an amino acid sequence. Furthermore, as a result of the SAAV discovery of these positive controls, the SAAVpedia could play a key role in the protein functional study for the Human Proteome Project (HPP). ©",
            "authors": [
                "Lee S.Y.",
                "Hwang H.",
                "Kang Y.-M.",
                "Kim H.",
                "Kim D.G.",
                "Jeong J.E.",
                "Kim J.Y.",
                "Yoo J.S."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JPROTEOME.9B00366",
            "journal": "Journal of Proteome Research",
            "pmid": "31612721",
            "title": "SAAVpedia: Identification, Functional Annotation, and Retrieval of Single Amino Acid Variants for Proteogenomic Interpretation",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:SAAVpedia",
        "biotoolsID": "SAAVpedia",
        "description": "Identification, Functional Annotation, and Retrieval of Single Amino Acid Variants for Proteogenomic Interpretation.\n\nSAAVpedia is a platform for identification, functional annotation, retrieval of single amino-acid variants from proteomic and genomic data.\n\nHome Y.-M. Kang 2019-12-24T08:52:37+00:00.\n\nS ingle A mino- A cid V ariant Encyclo pedia :.\n\nUser Guide Y.-M. Kang 2018-11-28T11:06:16+00:00.\n\nThe SAAVpedia is a comprehensive proteogenomic interpretation platform that identifies, annotates, and retrieves SAAVs from proteomic and genomic sequence data to discover true pathogenic variant candidates. SAAVpedia provides a proteogenomic analysis pipeline to prioritize and interpret SAAVs.\n\nThe SAAVpedia is a platform to identify, annotate, and retrieve pathogenic SAAV candidates from proteomic and genomic data.\n\nIdentification, functional annotation, and retrieval of single amino-acid variants for proteogenomic interpretation",
        "homepage": "https://www.SAAVpedia.org/",
        "name": "SAAVpedia"
    }
}