{
    "additionDate": "2017-02-10T11:35:38Z",
    "biotoolsCURIE": "biotools:molprobity",
    "biotoolsID": "molprobity",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://molprobity.biochem.duke.edu/index.php?MolProbSID=9rbbpkib4lr5f4ojg4qc5mpl95&eventID=10"
        }
    ],
    "description": "MolProbity is a structure validation web service for diagnosing problems in 3D models of proteins, nucleic acids or complexes.  It adds and optimizes H atoms (correcting 180° flipped Asn/Gln/His sidechains), and then calculates global and local validation for all-atom contacts (steric clashes, H-bonds & vdW), covalent geometry, and conformation (Ramachandran & rotamers for protein, ribose puckers & suite conformers for RNA).  Results are displayed online as 3D graphics and sortable charts.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://molprobity.biochem.duke.edu/index.php?MolProbSID=rabo3cdpjeuv8cufioek3amj73&eventID=3"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Protein geometry validation",
                    "uri": "http://edamontology.org/operation_1844"
                },
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://molprobity.biochem.duke.edu/",
    "lastUpdate": "2024-11-24T20:08:16.620324Z",
    "name": "MolProbity",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkh398",
            "metadata": {
                "abstract": "MolProbity is a general-purpose web service offering quality validation for three-dimensional (3D) structures of proteins, nucleic acids and complexes. It provides detailed all-atom contact analysis of any steric problems within the molecules and can calculate and display the H-bond and van der Waals contacts in the interfaces between components. An integral step in the process is the addition and full optimization of all hydrogen atoms, both polar and nonpolar. The results are reported in multiple forms: as overall numeric scores, as lists, as downloadable PDB and graphics files, and most notably as informative, manipulable 3D kinemage graphics shown on-line in the KiNG viewer. This service is available free to all users at http://kinemage.biochem.duke.edu. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Davis I.W."
                    },
                    {
                        "name": "Murray L.W."
                    },
                    {
                        "name": "Richardson D.C."
                    },
                    {
                        "name": "Richardson J.S."
                    }
                ],
                "citationCount": 858,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MolProbity: Structure validation and all-atom contact analysis for nucleic acids and their complexes"
            },
            "pmcid": "PMC441536",
            "pmid": "15215462"
        },
        {
            "doi": "10.1093/nar/gkm216",
            "metadata": {
                "abstract": "MolProbity is a general-purpose web server offering quality validation for 3D structures of proteins, nucleic acids and complexes. It provides detailed all-atom contact analysis of any steric problems within the molecules as well as updated dihedralangle diagnostics, and it can calculate and display the H-bond and van der Waals contacts in the interfaces between components. An integral step in the process is the addition and full optimization of all hydrogen atoms, both polar and nonpolar. New analysis functions have been added for RNA, for interfaces, and for NMR ensembles. Additionally, both the web site and major component programs have been rewritten to improve speed, convenience, clarity and integration with other resources. MolProbity results are reported in multiple forms: as overall numeric scores, as lists or charts of local problems, as downloadable PDB and graphics files, and most notably as informative, manipulable 3D kinemage graphics shown online in the KiNG viewer. This service is available free to all users at http://molprobity.biochem.duke.edu. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Arendall III W.B."
                    },
                    {
                        "name": "Block J.N."
                    },
                    {
                        "name": "Chen V.B."
                    },
                    {
                        "name": "Davis I.W."
                    },
                    {
                        "name": "Kapral G.J."
                    },
                    {
                        "name": "Leaver-Fay A."
                    },
                    {
                        "name": "Murray L.W."
                    },
                    {
                        "name": "Richardson D.C."
                    },
                    {
                        "name": "Richardson J.S."
                    },
                    {
                        "name": "Snoeyink J."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 3231,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MolProbity: All-atom contacts and structure validation for proteins and nucleic acids"
            },
            "pmcid": "PMC1933162",
            "pmid": "17452350"
        },
        {
            "doi": "10.1107/s0907444909042073",
            "metadata": {
                "abstract": "MolProbity is a structure-validation web service that provides broad-spectrum solidly based evaluation of model quality at both the global and local levels for both proteins and nucleic acids. It relies heavily on the power and sensitivity provided by optimized hydrogen placement and all-atom contact analysis, complemented by updated versions of covalent-geometry and torsion-angle criteria. Some of the local corrections can be performed automatically in MolProbity and all of the diagnostics are presented in chart and graphical forms that help guide manual rebuilding. X-ray crystallography provides a wealth of biologically important molecular data in the form of atomic three-dimensional structures of proteins, nucleic acids and increasingly large complexes in multiple forms and states. Advances in automation, in everything from crystallization to data collection to phasing to model building to refinement, have made solving a structure using crystallo-graphy easier than ever. However, despite these improvements, local errors that can affect biological interpretation are widespread at low resolution and even high-resolution structures nearly all contain at least a few local errors such as Ramachandran outliers, flipped branched protein side chains and incorrect sugar puckers. It is critical both for the crystallographer and for the end user that there are easy and reliable methods to diagnose and correct these sorts of errors in structures. MolProbity is the authors contribution to helping solve this problem and this article reviews its general capabilities, reports on recent enhancements and usage, and presents evidence that the resulting improvements are now beneficially affecting the global database. © 2010 International Union of Crystallography Printed in Singapore - all rights reserved.",
                "authors": [
                    {
                        "name": "Arendall III W.B."
                    },
                    {
                        "name": "Chen V.B."
                    },
                    {
                        "name": "Headd J.J."
                    },
                    {
                        "name": "Immormino R.M."
                    },
                    {
                        "name": "Kapral G.J."
                    },
                    {
                        "name": "Keedy D.A."
                    },
                    {
                        "name": "Murray L.W."
                    },
                    {
                        "name": "Richardson D.C."
                    },
                    {
                        "name": "Richardson J.S."
                    }
                ],
                "citationCount": 11257,
                "date": "2010-01-26T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "MolProbity: All-atom structure validation for macromolecular crystallography"
            },
            "pmcid": "PMC2803126",
            "pmid": "20057044",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1002/prot.10286",
            "metadata": {
                "abstract": "Geometrical validation around the Cα is described, with a new Cβ measure and updated Ramachandran plot. Deviation of the observed Cβ atom from ideal position provides a single measure encapsulating the major structure-validation information contained in bond angle distortions. Cβ deviation is sensitive to incompatibilities between sidechain and backbone caused by misfit conformations or inappropriate refinement restraints. A new φ,ψ plot using density-dependent smoothing for 81,234 non-Gly, non-Pro, and nonprePro residues with B < 30 from 500 high-resolution proteins shows sharp boundaries at critical edges and clear delineation between large empty areas and regions that are allowed but disfavored. One such region is the γ-turn conformation near +75°,-60°, counted as forbidden by common structure-validation programs; however, it occurs in well-ordered parts of good structures, it is overrepresented near functional sites, and strain is partly compensated by the γ-turn H-bond. Favored and allowed φ,ψ regions are also defined for Pro, pre. Pro, and Gly (important because Gly φ,ψ angles are more permissive but less accurately determined). Details of these accurate empirical distributions are poorly predicted by previous theoretical calculations, including a region left of α-helix, which rates as favorable in energy yet rarely occurs. A proposed factor explaining this discrepancy is that crowding of the two-peptide NHs permits donating only a single H-bond. New calculations by Hu et al. [Proteins 2002 (this issue)] for Ala and Gly dipeptides, using mixed quantum mechanics and molecular mechanics, fit our nonrepetitive data in excellent detail. To run our geometrical evaluations on a user-uploaded file, see MOLPROBITY (http://kinemage.biochem.duke.edu) or RAMPAGE (httpd/www.cryst. bioc.cam.ac.uk/rampage). © 2003 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Arendall III W.B."
                    },
                    {
                        "name": "Davis I.W."
                    },
                    {
                        "name": "De Bakker P.I.W."
                    },
                    {
                        "name": "Lovell S.C."
                    },
                    {
                        "name": "Prisant M.G."
                    },
                    {
                        "name": "Richardson D.C."
                    },
                    {
                        "name": "Richardson J.S."
                    },
                    {
                        "name": "Word J.M."
                    }
                ],
                "citationCount": 4125,
                "date": "2003-02-15T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Structure validation by Cα geometry: φ,ψ and Cβ deviation"
            },
            "pmid": "12557186"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
