{"credit":[{"email":"brian.bennett@nih.gov","name":"Brian D. Bennett","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/manuals/goSTAG/man/goSTAG.pdf"}],"download":[{"url":"http://bioconductor.org/packages/release/bioc/src/contrib/goSTAG_1.4.0.tar.gz"}],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]},{"operation":[{"term":"Differential gene expression analysis","uri":"http://edamontology.org/operation_3223"}]},{"operation":[{"term":"Gene-set enrichment analysis","uri":"http://edamontology.org/operation_2436"}]},{"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"collectionID":["BioConductor"],"cost":"Free of charge","language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"}]},"link":[{"type":"MIRROR","url":"http://bioconductor.org/packages/goSTAG/"}],"publication":[{"abstract":"© 2017 The Author(s). Background: Over-representation analysis (ORA) detects enrichment of genes within biological categories. Gene Ontology (GO) domains are commonly used for gene/gene-product annotation. When ORA is employed, often times there are hundreds of statistically significant GO terms per gene set. Comparing enriched categories between a large number of analyses and identifying the term within the GO hierarchy with the most connections is challenging. Furthermore, ascertaining biological themes representative of the samples can be highly subjective from the interpretation of the enriched categories. Results: We developed goSTAG for utilizing GO Subtrees to Tag and Annotate Genes that are part of a set. Given gene lists from microarray, RNA sequencing (RNA-Seq) or other genomic high-throughput technologies, goSTAG performs GO enrichment analysis and clusters the GO terms based on the p-values from the significance tests. GO subtrees are constructed for each cluster, and the term that has the most paths to the root within the subtree is used to tag and annotate the cluster as the biological theme. We tested goSTAG on a microarray gene expression data set of samples acquired from the bone marrow of rats exposed to cancer therapeutic drugs to determine whether the combination or the order of administration influenced bone marrow toxicity at the level of gene expression. Several clusters were labeled with GO biological processes (BPs) from the subtrees that are indicative of some of the prominent pathways modulated in bone marrow from animals treated with an oxaliplatin/topotecan combination. In particular, negative regulation of MAP kinase activity was the biological theme exclusively in the cluster associated with enrichment at 6 h after treatment with oxaliplatin followed by control. However, nucleoside triphosphate catabolic process was the GO BP labeled exclusively at 6 h after treatment with topotecan followed by control. Conclusions: goSTAG converts gene lists from genomic analyses into biological themes by enriching biological categories and constructing GO subtrees from over-represented terms in the clusters. The terms with the most paths to the root in the subtree are used to represent the biological themes. goSTAG is developed in R as a Bioconductor package and is available at https://bioconductor.org/packages/goSTAG","authors":["Bennett B.D.","Bushel P.R."],"cit_count":0,"doi":"10.1186/s13029-017-0066-1","journal":"Source Code for Biology and Medicine","title":"goSTAG: Gene ontology subtrees to tag and annotate genes within a set","type":"Primary","year":"2017-04-13"}],"summary":{"biotoolsCURIE":"biotools:gostag","biotoolsID":"gostag","description":"Given a Gene Ontology (GO) and an annotation of genes, significance of the over-representation of the genes within the ontological categories is determined by a Fisher's exact test or modeling according to a hypergeometric distribution. goSTAG uses GO subtrees to tag and annotate genes within a set. goSTAG visualizes the similarities between the over-representation of DEGs by clustering the p-values from the enrichment statistical tests and labels clusters with the GO term.","homepage":"http://bioconductor.org/packages/release/bioc/html/goSTAG.html","name":"goSTAG","version":["1.4.0"]}}