{
    "additionDate": "2017-01-17T14:56:01Z",
    "biotoolsCURIE": "biotools:harman",
    "biotoolsID": "harman",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jason.ross@csiro.au",
            "name": "Jason Ross",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PCA and constrained optimisation based technique that maximises the removal of batch effects from datasets, with the constraint that the probability of overcorrection (i.e. removing genuine biological signal along with batch noise) is kept to a fraction which is set by the end-user.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/Harman.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/Harman_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Principal component plotting",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/Harman.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-13T17:21:53Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.bioinformatics.csiro.au/harman/"
        }
    ],
    "name": "Harman",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1212-5",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Batch effects are a persistent and pervasive form of measurement noise which undermine the scientific utility of high-throughput genomic datasets. At their most benign, they reduce the power of statistical tests resulting in actual effects going unidentified. At their worst, they constitute confounds and render datasets useless. Attempting to remove batch effects will result in some of the biologically meaningful component of the measurement (i.e. signal) being lost. We present and benchmark a novel technique, called Harman. Harman maximises the removal of batch noise with the constraint that the risk of also losing biologically meaningful component of the measurement is kept to a fraction which is set by the user. Results: Analyses of three independent publically available datasets reveal that Harman removes more batch noise and preserves more signal at the same time, than the current leading technique. Results also show that Harman is able to identify and remove batch effects no matter what their relative size compared to other sources of variation in the dataset. Of particular advantage for meta-analyses and data integration is Harman's superior consistency in achieving comparable noise suppression - signal preservation trade-offs across multiple datasets, with differing number of treatments, replicates and processing batches. Conclusion: Harman's ability to better remove batch noise, and better preserve biologically meaningful signal simultaneously within a single study, and maintain the user-set trade-off between batch noise rejection and signal preservation across different studies makes it an effective alternative method to deal with batch effects in high-throughput genomic datasets. Harman is flexible in terms of the data types it can process. It is available publically as an R package (https://bioconductor.org/packages/release/bioc/html/Harman.html), as well as a compiled Matlab package (http://www.bioinformatics.csiro.au/harman/) which does not require a Matlab license to run.",
                "authors": [
                    {
                        "name": "Oytam Y."
                    },
                    {
                        "name": "Sobhanmanesh F."
                    },
                    {
                        "name": "Duesing K."
                    },
                    {
                        "name": "Bowden J.C."
                    },
                    {
                        "name": "Osmond-McLeod M."
                    },
                    {
                        "name": "Ross J."
                    }
                ],
                "citationCount": 28,
                "date": "2016-09-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Risk-conscious correction of batch effects: Maximising information extraction from high-throughput genomic datasets"
            },
            "pmcid": "PMC5009651",
            "pmid": "27585881",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.0"
    ]
}