{
    "additionDate": "2020-01-14T09:06:45Z",
    "biotoolsCURIE": "biotools:Microndata",
    "biotoolsID": "Microndata",
    "confidence_flag": "high",
    "description": "A simple, web-based repository for the management, access and analysis of micrographic images.\n\nMicroscopy is advancing at a rapid pace, enabling high-speed, high-resolution analyses to be conducted in a wide range of cellular contexts. For example, the capacity to quickly capture high-resolution images from multiple optical sections over multiple channels with confocal microscopy has allowed researchers to gain deeper understanding of tissue morphology via techniques such as three-dimensional rendering, as have more recent advances such as lattice light sheet microscopy and superresolution structured illumination microscopy. With this, though, comes the challenge of storing, curating, analysing and sharing data. While there are ways in which this has been attempted previously, few approaches have provided a central repository in which all of these different aspects of microscopy can be seamlessly integrated",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "http://www.microndata.net/",
    "lastUpdate": "2020-01-14T09:06:45Z",
    "name": "Microndata",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S10735-019-09850-Y",
            "metadata": {
                "abstract": "© 2019, Springer Nature B.V.Microscopy is advancing at a rapid pace, enabling high-speed, high-resolution analyses to be conducted in a wide range of cellular contexts. For example, the capacity to quickly capture high-resolution images from multiple optical sections over multiple channels with confocal microscopy has allowed researchers to gain deeper understanding of tissue morphology via techniques such as three-dimensional rendering, as have more recent advances such as lattice light sheet microscopy and superresolution structured illumination microscopy. With this, though, comes the challenge of storing, curating, analysing and sharing data. While there are ways in which this has been attempted previously, few approaches have provided a central repository in which all of these different aspects of microscopy can be seamlessly integrated. Here, we describe a web-based storage and analysis platform called Microndata, that enables relatively straightforward storage, annotation, tracking, analysis and multi-user access to micrographs. This easy to use tool will simplify and harmonise laboratory work flows, and, importantly, will provide a central storage repository that is readily accessed, even after the researcher responsible for capturing the images has left the laboratory. Microndata is open-source software, available at http://www.microndata.net/.",
                "authors": [
                    {
                        "name": "Davila R.A."
                    },
                    {
                        "name": "Harkins D."
                    },
                    {
                        "name": "Currey L."
                    },
                    {
                        "name": "Fraser J."
                    },
                    {
                        "name": "Bowles J."
                    },
                    {
                        "name": "Piper M."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Molecular Histology",
                "title": "A simple, web-based repository for the management, access and analysis of micrographic images"
            },
            "pmid": "31667690"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}