{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-20T13:43:32.541065Z",
    "biotoolsCURIE": "biotools:automal_6000",
    "biotoolsID": "automal_6000",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "haakon.tvedt@ntnu.no",
            "name": "Haakon Tvedt"
        },
        {
            "name": "Randi Holmestad",
            "orcidid": "https://orcid.org/0000-0002-4274-5794"
        }
    ],
    "description": "Scientific software for analyzing 6xxx Al-Mg-Si-(Cu) precipitates in atomic resolution HAADF-STEM images.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://automal.org/doc.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://automal.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-20T13:43:32.543728Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Haawk666/AutomAl-6000"
        }
    ],
    "name": "AutomAl 6000",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.ULTRAMIC.2022.113493",
            "metadata": {
                "abstract": "© 2022 The AuthorsWhen the Al–Mg–Si(–Cu) alloy system is subjected to age hardening, different types of precipitates nucleate depending on the composition and thermomechanical treatment. The main hardening precipitates extend as needles, laths or rods along the <100> directions in the aluminium matrix. It has been found that the structures of all metastable precipitates may be generalized as stacks of <100> columns, where most of these columns are replaced by solute elements. In the precipitates, a column relates to neighbour columns by a set of simple structural principles, which allows identification of species and relative longitudinal displacement over the (100) cross-section. Aberration-corrected high-angle annular dark field scanning transmission electron microscopy (HAADF-STEM) is an important tool for studying such precipitates. With the goal of analysing atomic resolution HAADF-STEM images of precipitate cross-sections in the Al–Mg–Si(–Cu) system, we have developed the stand-alone software AutomAl 6000, which features a column characterization algorithm based on the symbiosis of a statistical model and the structural principles formulated in a digraph-like framework. The software can semi-autonomously determine the 3D column positions in the image, as well as column species. In turn, AutomAl 6000 can then display, analyse and/or export the structure data. This paper describes the methodology of AutomAl 6000 and applies it on three different HAADF-STEM images, which demonstrate the methodology. The software, as well as other resources, are available at http://automal.org. The source code is also directly available from https://github.com/Haawk666/AutomAl-6000.",
                "authors": [
                    {
                        "name": "Andersen S.J."
                    },
                    {
                        "name": "Hell C."
                    },
                    {
                        "name": "Holmestad R."
                    },
                    {
                        "name": "Marioara C.D."
                    },
                    {
                        "name": "Thronsen E."
                    },
                    {
                        "name": "Tvedt H."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Ultramicroscopy",
                "title": "AutomAl 6000: Semi-automatic structural labelling of HAADF-STEM images of precipitates in Al–Mg–Si(–Cu) alloys"
            },
            "pmid": "35349939"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
