{
    "additionDate": "2021-01-18T08:34:59Z",
    "biotoolsCURIE": "biotools:sequoya",
    "biotoolsID": "sequoya",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "antonio.benitez@lcc.uma.es",
            "name": "Antonio Benítez-Hidalgo",
            "typeEntity": "Person"
        }
    ],
    "description": "multiobjective multiple sequence alignment in Python.\n\nSequoya is an open source software tool aimed at for solving Multiple Sequence Alignment problems with multi-objective metaheuristics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/benhid/Sequoya",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-20T17:01:36Z",
    "license": "MIT",
    "name": "Sequoya",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA257",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Multiple sequence alignment (MSA) consists of finding the optimal alignment of three or more biological sequences to identify highly conserved regions that may be the result of similarities and relationships between the sequences. MSA is an optimization problem with NP-hard complexity (non-deterministic polynomial-time hardness), because the time needed to find optimal alignments raises exponentially along with the number of sequences and their length. Furthermore, the problem becomes multiobjective when more than one score is considered to assess the quality of an alignment, such as maximizing the percentage of totally conserved columns and minimizing the number of gaps. Our motivation is to provide a Python tool for solving MSA problems using evolutionary algorithms, a nonexact stochastic optimization approach that has proven to be effective to solve multiobjective problems. Results: The software tool we have developed, called Sequoya, is written in the Python programming language, which offers a broad set of libraries for data analysis, visualization and parallelism. Thus, Sequoya offers a graphical tool to visualize the progress of the optimization in real time, the ability to guide the search toward a preferred region in run-time, parallel support to distribute the computation among nodes in a distributed computing system, and a graphical component to assist in the analysis of the solutions found at the end of the optimization.",
                "authors": [
                    {
                        "name": "Benitez-Hidalgo A."
                    },
                    {
                        "name": "Nebro A.J."
                    },
                    {
                        "name": "Aldana-Montes J.F."
                    }
                ],
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Sequoya: Multiobjective multiple sequence alignment in Python"
            },
            "pmid": "32315391"
        }
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}