{"credit":[{"name":"Jacques van Helden","typeEntity":"Person","typeRoles":["Primary contact"]}],"download":[{"note":"Several versions available.","type":"Source code","url":"http://download.rsat.eu"}],"function":[{"cmd":"retrieve-seq  -org Saccharomyces_cerevisiae  -type upstream -from -800 -to -1 -i geneIDs.txt","input":[{"data":{"term":"Gene ID","uri":"http://edamontology.org/data_2295"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]}],"note":"Retrieve upstream non-coding sequences for a given set of gene ids, and a given organism.","operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"}],"output":[{"data":{"term":"DNA sequence","uri":"http://edamontology.org/data_3494"},"format":[{"term":"raw","uri":"http://edamontology.org/format_1957"},{"term":"ig","uri":"http://edamontology.org/format_1942"},{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]}]}],"labels":{"accessibility":["Open access"],"collectionID":["RSAT"],"cost":"Free of charge","elixirNode":["France"],"language":["Perl"],"maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool","Web application","Web API","Web service"],"topic":[{"term":"Gene regulation","uri":"http://edamontology.org/topic_0204"}]},"publication":[{"abstract":"A series of computer programs were developed for the analysis of regulatory sequences, with a special focus on yeast. These tools are publicly available on the web (http://www.ucmb.ulb.ac.be/bioinformatics/rsa-tools/). Basically, three classical problems can be addressed: (a) search for known regulatory patterns in the upstream regions of known genes; (b) discovery of unknown regulatory patterns within a set of upstream regions known to be co-regulated; (c) search for unknown genes potentially regulated by a known transcription factor. Each of these tasks can be performed on basis of a simple (string) or more refined (matrix) description of the regulatory patterns. A feature-map progam automatically generates visual representations of the positions at which patterns were found. The site also provides a series of general utilities, such as generation of random sequence, automatic drawing of XY graphs, interconversions between sequence formats, etc. Several tools are linked together to allow their sequential utilization (piping), but each one can also be used independently by filling the web form with external data. This widens the scope of the site to the analysis of nonregulatory and/or non-yeast sequences. Copyright (C) 2000 John Wiley and Sons, Ltd.","authors":["Van Helden J.","Andre B.","Collado-Vides J."],"cit_count":145,"journal":"Yeast","pmid":"10641039","title":"A web site for the computational analysis of yeast regulatory sequences","type":"Primary","year":"2000-01-30"},{"abstract":"© 2018 The Author(s). RSAT (Regulatory Sequence Analysis Tools) is a suite ofmodular tools for the detection and the analysis of cis-regulatory elements in genome sequences. Its main applications are (i) motif discovery, including from genome-wide datasets like ChIP-seq/ATACseq, (ii) motif scanning, (iii) motif analysis (quality assessment, comparisons and clustering), (iv) analysis of regulatory variations, (v) comparative genomics. Six public servers jointly support 10 000 genomes from all kingdoms. Six novel or refactored programs have been added since the 2015 NAR Web Software Issue, including updated programs to analyse regulatory variants (retrieve-variation-seq, variationscan, convert-variations), along with tools to extract sequences from a list of coordinates (retrieve-seqbed), to select motifs from motif collections (retrievematrix), and to extract orthologs based on Ensembl Compara (get-orthologs-compara). Three use cases illustrate the integration of new and refactored tools to the suite. This Anniversary update gives a 20-year perspective on the software suite.","authors":["Nguyen N.T.T.","Contreras-Moreira B.","Castro-Mondragon J.A.","Santana-Garcia W.","Ossio R.","Robles-Espinoza C.D.","Bahin M.","Collombet S.","Vincens P.","Thieffry D.","Van Helden J.","Medina-Rivera A.","Thomas-Chollier M."],"cit_count":10,"doi":"10.1093/nar/gky317","journal":"Nucleic Acids Research","title":"RSAT 2018: Regulatory sequence analysis tools 20th anniversary","type":"Other","year":"2018-07-02"}],"summary":{"biotoolsCURIE":"biotools:RSAT_-_Retrieve_Sequence","biotoolsID":"RSAT_-_Retrieve_Sequence","description":"Starting from a list of genes, returns upstream or downstream sequences.","homepage":"http://pedagogix-tagc.univ-mrs.fr/rsat/retrieve-seq_form.cgi","name":"RSAT - Retrieve Sequence"}}