{
    "additionDate": "2017-12-18T00:09:05Z",
    "biotoolsCURIE": "biotools:mstmap",
    "biotoolsID": "mstmap",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://alumni.cs.ucr.edu/~yonghui/"
        }
    ],
    "description": "It is capable of constructing genetic linkage maps efficiently and accurately. It can handle various mapping populations including BC1, DH, Hap, and RIL, among others. The tool builds the genetic linkage map by first constructing a Minimum Spanning Tree, and hence the name MSTMap. The algorithm implemented in MSTMap is very efficient and can handle ultra-dense maps of up to 10,000~100,000 markers.",
    "documentation": [
        {
            "type": "General",
            "url": "http://alumni.cs.ucr.edu/~yonghui/mstmap.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://alumni.cs.ucr.edu/~yonghui/mstmap.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mstmap-construct-genetic-linkage-maps.html"
        }
    ],
    "name": "MSTMap",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1000212",
            "metadata": {
                "abstract": "Genetic linkage maps are cornerstones of a wide spectrum of biotechnology applications, including map-assisted breeding, association genetics, and map-assisted gene cloning. During the past several years, the adoption of high-throughput genotyping technologies has been paralleled by a substantial increase in the density and diversity of genetic markers. New genetic mapping algorithms are needed in order to efficiently process these large datasets and accurately construct high-density genetic maps. In this paper, we introduce a novel algorithm to order markers on a genetic linkage map. Our method is based on a simple yet fundamental mathematical property that we prove under rather general assumptions. The validity of this property allows one to determine efficiently the correct order of markers by computing the minimum spanning tree of an associated graph. Our empirical studies obtained on genotyping data for three mapping populations of barley (Hordeum vulgare), as well as extensive simulations on synthetic data, show that our algorithm consistently outperforms the best available methods in the literature, particularly when the input data are noisy or incomplete. The software implementing our algorithm is available in the public domain as a web tool under the name MSTMAP. © 2008 Wu et al.",
                "authors": [
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Bhat P.R."
                    },
                    {
                        "name": "Close T.J."
                    },
                    {
                        "name": "Lonardi S."
                    }
                ],
                "citationCount": 215,
                "date": "2008-10-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Efficient and accurate construction of genetic linkage maps from the minimum spanning tree of a graph"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}