{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T07:01:26Z",
    "biotoolsCURIE": "biotools:ffparam",
    "biotoolsID": "ffparam",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alex@outerbanks.umaryland.edu",
            "name": "Alexander D. MacKerell",
            "typeEntity": "Person"
        }
    ],
    "description": "FFParam is a Standalone python package for CHARMM force field parametrization including both the additive CGenFF/CHARMM36 and Classical Drude polarizable force fields. To assist in the parametrization process, the program is provided with a graphical user interface (GUI) and it is cross-platform. FFParam shields the user from labor-intensive manual work and shifts the focus towards the improvement and the quality of parameters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://ffparam.umaryland.edu",
    "lastUpdate": "2021-03-10T21:49:21Z",
    "name": "FFParam",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/JCC.26138",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Accurate force-field (FF) parameters are key to reliable prediction of properties obtained from molecular modeling (MM) and molecular dynamics (MD) simulations. With ever-widening applicability of MD simulations, robust parameters need to be generated for a wider range of chemical species. The CHARMM General Force Field program (CGenFF, https://cgenff.umaryland.edu/) is a tool for obtaining initial parameters for a given small molecule based on analogy with the available CGenFF parameters. However, improvement of these parameters is often required and performing their optimization remains tedious and time consuming. In addition, tools for optimization of small molecule parameters in the context of the Drude polarizable FF are not yet available. To overcome these issues, the FFParam package has been designed to facilitate the parametrization process. The package includes a graphical user interface (GUI) created using Qt libraries. FFParam supports Gaussian and Psi4 for performing quantum mechanical calculations and CHARMM and OpenMM for MM calculations. A Monte Carlo simulated annealing (MCSA) algorithm has been implemented for automated fitting of partial atomic charge, atomic polarizabilities and Thole scale parameters. The LSFITPAR program is called for automated fitting of bonded parameters. Accordingly, FFParam provides all the features required for generation and analysis of CHARMM and Drude FF parameters for small molecules. FFParam-GUI includes a text editor, graph plotter, molecular visualization, and text to table converter to meet various requirements of the parametrization process. It is anticipated that FFParam will facilitate wider use of CGenFF as well as promote future use of the Drude polarizable FF.",
                "authors": [
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Yoluk O."
                    },
                    {
                        "name": "MacKerell A.D."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-05T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "FFParam: Standalone package for CHARMM additive and Drude polarizable force field parametrization of small molecules"
            },
            "pmcid": "PMC7323454",
            "pmid": "31886576"
        }
    ],
    "toolType": [
        "Desktop application",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ]
}