{
    "additionDate": "2017-08-03T18:43:49Z",
    "biotoolsCURIE": "biotools:funcpatch",
    "biotoolsID": "funcpatch",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://info.mcmaster.ca/yifei/FuncPatch/contact.php"
        }
    ],
    "description": "This tool was developed for inferring conserved functional regions in protein tertiary structures.",
    "documentation": [
        {
            "type": "General",
            "url": "http://info.mcmaster.ca/yifei/FuncPatch/manual.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://info.mcmaster.ca/yifei/FuncPatch/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/funcpatch-inferring-conserved-functional-regions-in-protein-tertiary-structures.html"
        }
    ],
    "name": "FuncPatch",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 The Author. Motivation: A number of statistical phylogenetic methods have been developed to infer conserved functional sites or regions in proteins. Many methods, e.g. Rate4Site, apply the standard phylogenetic models to infer site-specific substitution rates and totally ignore the spatial correlation of substitution rates in protein tertiary structures, which may reduce their power to identify conserved functional patches in protein tertiary structures when the sequences used in the analysis are highly similar. The 3D sliding window method has been proposed to infer conserved functional patches in protein tertiary structures, but the window size, which reflects the strength of the spatial correlation, must be predefined and is not inferred from data. We recently developed GP4Rate to solve these problems under the Bayesian framework. Unfortunately, GP4Rate is computationally slow. Here, we present an intuitive web server, FuncPatch, to perform a fast approximate Bayesian inference of conserved functional patches in protein tertiary structures. Results: Both simulations and four case studies based on empirical data suggest that FuncPatch is a good approximation to GP4Rate. However, FuncPatch is orders of magnitudes faster than GP4Rate. In addition, simulations suggest that FuncPatch is potentially a useful tool complementary to Rate4Site, but the 3D sliding window method is less powerful than FuncPatch and Rate4Site. The functional patches predicted by FuncPatch in the four case studies are supported by experimental evidence, which corroborates the usefulness of FuncPatch.",
                "authors": [
                    {
                        "name": "Huangy Y.-F."
                    },
                    {
                        "name": "Brian Golding G."
                    }
                ],
                "citationCount": 6,
                "date": "2015-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Func Patch: A web server for the fast Bayesian inference of conserved functional patches in protein 3D structures"
            },
            "pmid": "25322839"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1
}