{
    "additionDate": "2022-01-03T09:05:09.946637Z",
    "biotoolsCURIE": "biotools:dbgenvoc",
    "biotoolsID": "dbgenvoc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nkb1@nibmg.ac.in",
            "name": "Nidhan K Biswas",
            "orcidid": "https://orcid.org/0000-0001-7960-3290",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "dbGENVOC, a comprehensive, flexible database framework, developed with an aim to allow potential users to access, query, browse and download clinically relevant somatic and germline variation data from Indian oral cancer patients. This database will store variant calls from various studies that uses massively parallel sequencing to generate genome-scale data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://research.nibmg.ac.in/dbcares/dbgenvoc/",
    "lastUpdate": "2022-01-03T09:05:09.949386Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.actrec.gov.in/OCDB/"
        }
    ],
    "name": "dbGENVOC",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB034",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Oral cancer is highly prevalent in India and is the most frequent cancer type among Indian males. It is also very common in southeast Asia. India has participated in the International Cancer Genome Consortium (ICGC) and some national initiatives to generate large-scale genomic data on oral cancer patients and analyze to identify associations and systematically catalog the associated variants. We have now created an open, web-accessible database of these variants found significantly associated with Indian oral cancer patients, with a user-friendly interface to enable easy mining. We have value added to this database by including relevant data collated from various sources on other global populations, thereby providing opportunities of comparative geographical and/or ethnic analyses. Currently, no other database of similar nature is available on oral cancer. We have developed Database of GENomic Variants of Oral Cancer, a browsable online database framework for storage, retrieval and analysis of large-scale data on genomic variants and make it freely accessible to the scientific community. Presently, the web-accessible database allows potential users to mine data on ∼24 million clinically relevant somatic and germline variants derived from exomes (n = 100) and whole genomes (n = 5) of Indian oral cancer patients; all generated by us. Variant data from The Cancer Genome Atlas and data manually curated from peer-reviewed publications were also incorporated into the database for comparative analyses. It allows users to query the database by a single gene, multiple genes, multiple variant sites, genomic region, patient ID and pathway identities. Database URL: http://research.nibmg.ac.in/dbcares/dbgenvoc/",
                "authors": [
                    {
                        "name": "Pradhan S."
                    },
                    {
                        "name": "Das S."
                    },
                    {
                        "name": "Singh A.K."
                    },
                    {
                        "name": "Das C."
                    },
                    {
                        "name": "Basu A."
                    },
                    {
                        "name": "Majumder P.P."
                    },
                    {
                        "name": "Biswas N.K."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "DbGENVOC: Database of GENomic Variants of Oral Cancer, with special reference to India"
            },
            "pmcid": "PMC8163239",
            "pmid": "34048545",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}