{
    "additionDate": "2017-12-18T00:13:36Z",
    "biotoolsCURIE": "biotools:tmatch",
    "biotoolsID": "tmatch",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://web.njit.edu/~wangj/"
        }
    ],
    "description": "TMatch is a tool for comparing two rooted ordered labeled trees, which are represented in a preorder parenthesized form. The tool calculates the editing distance of the two trees and displays the edit operations (insertions, deletions and substitutions) needed to transform one tree to the other.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://web.njit.edu/~wangj/tmatch.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://web.njit.edu/~wangj/tmatch.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tmatch-compute-editing-distance-ordered-trees.html"
        }
    ],
    "name": "TMatch",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1109/69.298173",
            "metadata": {
                "abstract": "Ordered, labeled trees are trees in which each node has a label and the left-to-right order of its children (if it has any) is fixed. Such trees have many applications in vision, pattern recognition, molecular biology, programming compilation, and natural language processing. Many of the applications involve comparing trees or retrieving/extracting information from a repository of trees. Examples include classification of unknown patterns, analysis of newly sequenced RNA structures, semantic taxonomy for dictionary definitions, generation of interpreters for nonprocedural programming languages, and automatic error recovery and correction for programming languages. Previous systems use exact matching (or generalized regular expression matching) for tree comparison. This paper presents a system, called Approximate-Tree-By-Example (ATBE), which allows inexact matching of trees. The ATBE system interacts with the user through a simple but powerful query language; graphical devices are provided to facilitate inputing the queries. The paper describes the architecture of ATBE, illustrates its use and describes some aspects of ATBE implementation. We also discuss the underlying algorithms and provide some sample applications. © 1994 IEEE",
                "authors": [
                    {
                        "name": "Wang J.T.-L."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Jeong K."
                    },
                    {
                        "name": "Shasha D."
                    }
                ],
                "citationCount": 88,
                "date": "1994-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Knowledge and Data Engineering",
                "title": "A System for Approximate Tree Matching"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}