{
    "additionDate": "2017-01-17T14:50:29Z",
    "biotoolsCURIE": "biotools:pfind_studio",
    "biotoolsID": "pfind_studio",
    "collectionID": [
        "ms-utils",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "Computational platform for mass spectrometry-based proteomics, including pFind , pNovo and pQuant.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pfind.ict.ac.cn/software/pFind/index.html#Introduction"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "http://pfind.ict.ac.cn/index.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-03-26T08:31:35Z",
    "license": "Proprietary",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "name": "pFind Studio",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "msutils_import",
    "publication": [
        {
            "metadata": {
                "abstract": "This paper describes the pFind 2.0 software package for peptide and protein identification via tandem mass spectrometry. Firstly, the most important feature of pFind 2.0 is that it offers a modularized and customized platform for third parties to test and compare their algorithms. The developers can create their own modules following the open application programming interface (API) standards and then add it into workflows in place of the default modules. In addition, to accommodate different requirements, the package provides four automated workflows adopting different algorithm modules, executing processes and result reports. Based on this design, pFind 2.0 provides an automated target-decoy database search strategy: The user can just specify a certain false positive rate (FPR) and start searching. Then the system will return the protein identification results automatically filtered by such an estimated FPR. Secondly, pFind 2.0 is also of high accuracy and high speed. Many pragmatic preprocessing, peptide-scoring, validation, and protein inference algorithms have been incorporated. To speed up the searching process, a toolbox for indexing protein databases is developed for high-throughput applications and all modules are implemented under a new architecture designed for large-scale parallel and distributed searching. An experiment on a public dataset shows that pFind 2.0 can identify more peptides than SEQUEST and Mascot at the 1% FPR. It is also demonstrated that this version of pFind 2.0 has better usability and higher speed than its previous versions. The software and more detailed supplementary information can both be accessed at http://pfind.ict.ac.cn/. Copyright © 2007 John Wiley & Sons, Ltd.",
                "authors": [
                    {
                        "name": "Wang L.-H."
                    },
                    {
                        "name": "Li D.-Q."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Wang H.-P."
                    },
                    {
                        "name": "Zhang J.-F."
                    },
                    {
                        "name": "Yuan Z.-F."
                    },
                    {
                        "name": "Sun R.-X."
                    },
                    {
                        "name": "Zeng R."
                    },
                    {
                        "name": "He S.-M."
                    },
                    {
                        "name": "Gao W."
                    }
                ],
                "citationCount": 122,
                "date": "2007-09-19T00:00:00Z",
                "journal": "Rapid Communications in Mass Spectrometry",
                "title": "pFind 2.0: A software package for peptide and protein identification via tandem mass spectrometry"
            },
            "pmid": "17702057"
        },
        {
            "metadata": {
                "abstract": "De novo peptide sequencing is the only tool for extracting peptide sequences directly from tandem mass spectrometry (MS) data without any protein database. However, neither the accuracy nor the efficiency of de novo sequencing has been satisfactory, mainly due to incomplete fragmentation information in experimental spectra. Recent advancement in MS technology has enabled acquisition of higher energy collisional dissociation (HCD) and electron transfer dissociation (ETD) spectra of the same precursor. These spectra contain complementary fragmentation information and can be collected with high resolution and high mass accuracy. Taking these advantages, we have developed a new algorithm called pNovo+, which greatly improves the accuracy and speed of de novo sequencing. On tryptic peptides, 86% of the topmost candidate sequences deduced by pNovo+ from HCD + ETD spectral pairs matched the database search results, and the success rate reached 95% if the top three candidates were included, which was much higher than using only HCD (87%) or only ETD spectra (57%). On Asp-N, Glu-C, or Elastase digested peptides, 69-87% of the HCD + ETD spectral pairs were correctly identified by pNovo+ among the topmost candidates, or 84-95% among the top three. On average, it takes pNovo+ only 0.018 s to extract the sequence from a spectrum or spectral pair on a common personal computer. This is more than three times as fast as other de novo sequencing programs. The increase of speed is mainly due to pDAG, a component algorithm of pNovo+. pDAG finds the k longest paths in a directed acyclic graph without the antisymmetry restriction. We have verified that the antisymmetry restriction is unnecessary for high resolution, high mass accuracy data. The extensive use of HCD and ETD spectral information and the pDAG algorithm make pNovo+ an excellent de novo sequencing tool. © 2012 American Chemical Society.",
                "authors": [
                    {
                        "name": "Chi H."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "He K."
                    },
                    {
                        "name": "Wu L."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Sun R.-X."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Zeng W.-F."
                    },
                    {
                        "name": "Song C.-Q."
                    },
                    {
                        "name": "He S.-M."
                    },
                    {
                        "name": "Dong M.-Q."
                    }
                ],
                "citationCount": 46,
                "date": "2013-02-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "PNovo+: De novo peptide sequencing using complementary HCD and ETD tandem mass spectra"
            },
            "pmid": "23272783"
        },
        {
            "metadata": {
                "abstract": "In relative protein abundance determination from peptide intensities recorded in full mass scans, a major complication that affects quantitation accuracy is signal interference from coeluting ions of similar m/z values. Here, we present pQuant, a quantitation software tool that solves this problem. pQuant detects interference signals, identifies for each peptide a pair of least interfered isotopic chromatograms: one for the light and one for the heavy isotope-labeled peptide. On the basis of these isotopic pairs, pQuant calculates the relative heavy/light peptide ratios along with their 99.75% confidence intervals (CIs). From the peptides ratios and their CIs, pQuant estimates the protein ratios and associated CIs by kernel density estimation. We tested pQuant, Census and MaxQuant on data sets obtained from mixtures (at varying mixing ratios from 10:1 to 1:10) of light- and heavy-SILAC labeled HeLa cells or 14N- and 15N-labeled Escherichia coli cells. pQuant quantitated more peptides with better accuracy than Census and MaxQuant in all 14 data sets. On the SILAC data sets, the nonquantified \"NaN\" (not a number) ratios generated by Census, MaxQuant, and pQuant accounted for 2.5-10.7%, 1.8-2.7%, and 0.01-0.5% of all ratios, respectively. On the 14N/15N data sets, which cannot be quantified by MaxQuant, Census and pQuant produced 0.9-10.0% and 0.3-2.9% NaN ratios, respectively. Excluding these NaN results, the standard deviations of the numerical ratios calculated by Census or MaxQuant are 30-100% larger than those by pQuant. These results show that pQuant outperforms Census and MaxQuant in SILAC and 15N-based quantitation. © 2014 American Chemical Society.",
                "authors": [
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Song C.-Q."
                    },
                    {
                        "name": "Yuan Z.-F."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Chi H."
                    },
                    {
                        "name": "Wang L.-H."
                    },
                    {
                        "name": "Fan S.-B."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Zeng W.-F."
                    },
                    {
                        "name": "He S.-M."
                    },
                    {
                        "name": "Dong M.-Q."
                    },
                    {
                        "name": "Sun R.-X."
                    }
                ],
                "citationCount": 23,
                "date": "2014-06-03T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "PQuant improves quantitation by keeping out interfering signals and evaluating the accuracy of calculated ratios"
            },
            "pmid": "24799117"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}