{
    "additionDate": "2020-01-09T17:56:48Z",
    "biotoolsCURIE": "biotools:KETOS",
    "biotoolsID": "KETOS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "julian.gruendner@fau.de",
            "name": "Julian Gruendner",
            "orcidid": "https://orcid.org/0000-0001-7204-5329",
            "typeEntity": "Person"
        }
    ],
    "description": "A training and deployment platform based on Docker, OMOP-CDM, and FHIR Web Services.\n\nBACKGROUND AND OBJECTIVE:To take full advantage of decision support, machine learning, and patient-level prediction models, it is important that models are not only created, but also deployed in a clinical setting. The KETOS platform demonstrated in this work implements a tool for researchers allowing them to perform statistical analyses and deploy resulting models in a secure environment. METHODS:The proposed system uses Docker virtualization to provide researchers with reproducible data analysis and development environments, accessible via Jupyter Notebook, to perform statistical analysis and develop, train and deploy models based on standardized input data. The platform is built in a modular fashion and interfaces with web services using the Health Level 7 (HL7) Fast Healthcare Interoperability Resources (FHIR) standard to access patient data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://ketos.ai/hb/home",
    "lastUpdate": "2020-12-14T14:16:37Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://ketos.ai/environments"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/juliangruendner/ketos_develop"
        }
    ],
    "name": "KETOS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223010",
            "metadata": {
                "abstract": "© 2019 Gruendner et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background and objective To take full advantage of decision support, machine learning, and patient-level prediction models, it is important that models are not only created, but also deployed in a clinical setting. The KETOS platform demonstrated in this work implements a tool for researchers allowing them to perform statistical analyses and deploy resulting models in a secure environment. Methods The proposed system uses Docker virtualization to provide researchers with reproducible data analysis and development environments, accessible via Jupyter Notebook, to perform statistical analysis and develop, train and deploy models based on standardized input data. The platform is built in a modular fashion and interfaces with web services using the Health Level 7 (HL7) Fast Healthcare Interoperability Resources (FHIR) standard to access patient data. In our prototypical implementation we use an OMOP common data model (OMOP-CDM) database. The architecture supports the entire research lifecycle from creating a data analysis environment, retrieving data, and training to final deployment in a hospital setting. Results We evaluated the platform by establishing and deploying an analysis and end user application for hemoglobin reference intervals within the University Hospital Erlangen. To demonstrate the potential of the system to deploy arbitrary models, we loaded a colorectal cancer dataset into an OMOP database and built machine learning models to predict patient outcomes and made them available via a web service. We demonstrated both the integration with FHIR as well as an example end user application. Finally, we integrated the platform with the open source DataSHIELD architecture to allow for distributed privacy preserving data analysis and training across networks of hospitals. Conclusion The KETOS platform takes a novel approach to data analysis, training and deploying decision support models in a hospital or healthcare setting. It does so in a secure and privacy-preserving manner, combining the flexibility of Docker virtualization with the advantages of standardized vocabularies, a widely applied database schema (OMOP-CDM), and a standardized way to exchange medical data (FHIR).",
                "authors": [
                    {
                        "name": "Gruendner J."
                    },
                    {
                        "name": "Schwachhofer T."
                    },
                    {
                        "name": "Sippl P."
                    },
                    {
                        "name": "Wolf N."
                    },
                    {
                        "name": "Erpenbeck M."
                    },
                    {
                        "name": "Gulden C."
                    },
                    {
                        "name": "Kapsner L.A."
                    },
                    {
                        "name": "Zierk J."
                    },
                    {
                        "name": "Mate S."
                    },
                    {
                        "name": "Sturzl M."
                    },
                    {
                        "name": "Croner R."
                    },
                    {
                        "name": "Prokosch H.-U."
                    },
                    {
                        "name": "Toddenroth D."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Ketos: Clinical decision support and machine learning as a service – A training and deployment platform based on Docker, OMOP-CDM, and FHIR Web Services"
            },
            "pmcid": "PMC6776354",
            "pmid": "31581246"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        }
    ],
    "validated": 1
}