{
    "accessibility": "Open access",
    "additionDate": "2019-04-15T21:50:28Z",
    "biotoolsCURIE": "biotools:IDSM",
    "biotoolsID": "IDSM",
    "collectionID": [
        "ELIXIR-CZ",
        "IOCB CAS CZ"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jakub.galgonek@uochb.cas.cz",
            "name": "Jakub Galgonek",
            "orcidid": "http://orcid.org/0000-0002-7038-544X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Maintainer",
                "Developer"
            ]
        },
        {
            "name": "Mirek Kratochvíl",
            "orcidid": "https://orcid.org/0000-0001-7356-4075",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "IOCB CAS",
            "typeEntity": "Institute"
        },
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Consortium"
        }
    ],
    "description": "Integrated Database of Small Molecules",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://idsm.elixir-czech.cz/sparql/doc/manual.html"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Query script",
                        "uri": "http://edamontology.org/data_3786"
                    },
                    "format": [
                        {
                            "term": "SPARQL",
                            "uri": "http://edamontology.org/format_3790"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    },
                    "format": [
                        {
                            "term": "RDF/XML",
                            "uri": "http://edamontology.org/format_3261"
                        },
                        {
                            "term": "Turtle",
                            "uri": "http://edamontology.org/format_3255"
                        },
                        {
                            "term": "N-Triples",
                            "uri": "http://edamontology.org/format_3256"
                        },
                        {
                            "term": "N-Quads",
                            "uri": "http://edamontology.org/format_3956"
                        },
                        {
                            "term": "XML",
                            "uri": "http://edamontology.org/format_2332"
                        },
                        {
                            "term": "JSON",
                            "uri": "http://edamontology.org/format_3464"
                        },
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        },
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        },
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://idsm.elixir-czech.cz/",
    "language": [
        "Java",
        "C",
        "SQL",
        "JavaScript"
    ],
    "lastUpdate": "2021-05-26T13:20:31Z",
    "maturity": "Mature",
    "name": "IDSM",
    "owner": "galgonek",
    "publication": [
        {
            "doi": "10.1186/s13321-021-00515-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).The Resource Description Framework (RDF), together with well-defined ontologies, significantly increases data interoperability and usability. The SPARQL query language was introduced to retrieve requested RDF data and to explore links between them. Among other useful features, SPARQL supports federated queries that combine multiple independent data source endpoints. This allows users to obtain insights that are not possible using only a single data source. Owing to all of these useful features, many biological and chemical databases present their data in RDF, and support SPARQL querying. In our project, we primary focused on PubChem, ChEMBL and ChEBI small-molecule datasets. These datasets are already being exported to RDF by their creators. However, none of them has an official and currently supported SPARQL endpoint. This omission makes it difficult to construct complex or federated queries that could access all of the datasets, thus underutilising the main advantage of the availability of RDF data. Our goal is to address this gap by integrating the datasets into one database called the Integrated Database of Small Molecules (IDSM) that will be accessible through a SPARQL endpoint. Beyond that, we will also focus on increasing mutual interoperability of the datasets. To realise the endpoint, we decided to implement an in-house developed SPARQL engine based on the PostgreSQL relational database for data storage. In our approach, data are stored in the traditional relational form, and the SPARQL engine translates incoming SPARQL queries into equivalent SQL queries. An important feature of the engine is that it optimises the resulting SQL queries. Together with optimisations performed by PostgreSQL, this allows efficient evaluations of SPARQL queries. The endpoint provides not only querying in the dataset, but also the compound substructure and similarity search supported by our Sachem project. Although the endpoint is accessible from an internet browser, it is mainly intended to be used for programmatic access by other services, for example as a part of federated queries. For regular users, we offer a rich web application called ChemWebRDF using the endpoint. The application is publicly available at https://idsm.elixir-czech.cz/chemweb/.",
                "authors": [
                    {
                        "name": "Galgonek J."
                    },
                    {
                        "name": "Vondrasek J."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "IDSM ChemWebRDF: SPARQLing small-molecule datasets"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/s13321-019-0367-2",
            "metadata": {
                "abstract": "© The Author(s) 2019.Motivation: The existing connections between large databases of chemicals, proteins, metabolites and assays offer valuable resources for research in fields ranging from drug design to metabolomics. Transparent search across multiple databases provides a way to efficiently utilize these resources. To simplify such searches, many databases have adopted semantic technologies that allow interoperable querying of the datasets using SPARQL query language. However, the interoperable interfaces of the chemical databases still lack the functionality of structure-driven chemical search, which is a fundamental method of data discovery in the chemical search space. Results: We present a SPARQL service that augments existing semantic services by making interoperable substructure and similarity searches in small-molecule databases possible. The service thus offers new possibilities for querying interoperable databases, and simplifies writing of heterogeneous queries that include chemical-structure search terms. Availability: The service is freely available and accessible using a standard SPARQL endpoint interface. The service documentation and user-oriented demonstration interfaces that allow quick explorative querying of datasets are available at https://idsm.elixir-czech.cz.",
                "authors": [
                    {
                        "name": "Kratochvil M."
                    },
                    {
                        "name": "Vondrasek J."
                    },
                    {
                        "name": "Galgonek J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Interoperable chemical structure search service"
            }
        }
    ],
    "toolType": [
        "SPARQL endpoint",
        "Web application",
        "Database portal",
        "Web service"
    ],
    "topic": [
        {
            "term": "Chemical biology",
            "uri": "http://edamontology.org/topic_3369"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ],
    "validated": 1
}