{
    "additionDate": "2020-01-14T08:52:52Z",
    "biotoolsCURIE": "biotools:SIMLIN",
    "biotoolsID": "SIMLIN",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "Jiangning.Song@monash.edu",
            "name": "Jiangning Song",
            "orcidid": "https://orcid.org/0000-0001-8031-9086",
            "typeEntity": "Person"
        },
        {
            "email": "Geoff.Webb@monash.edu",
            "name": "Geoffrey I. Webb",
            "typeEntity": "Person"
        }
    ],
    "description": "a bioinformatics tool for prediction of S-sulphenylation in the human proteome based on multi-stage ensemble-learning models.\n\nSIMLIN: an improved bioinformatics approach based on multi-stage ensemble learning model for S-sulphenylation prediction",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://simlin.erc.monash.edu/",
    "lastUpdate": "2020-01-14T08:52:52Z",
    "name": "SIMLIN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3178-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: S-sulphenylation is a ubiquitous protein post-translational modification (PTM) where an S-hydroxyl (-SOH) bond is formed via the reversible oxidation on the Sulfhydryl group of cysteine (C). Recent experimental studies have revealed that S-sulphenylation plays critical roles in many biological functions, such as protein regulation and cell signaling. State-of-the-art bioinformatic advances have facilitated high-throughput in silico screening of protein S-sulphenylation sites, thereby significantly reducing the time and labour costs traditionally required for the experimental investigation of S-sulphenylation. Results: In this study, we have proposed a novel hybrid computational framework, termed SIMLIN, for accurate prediction of protein S-sulphenylation sites using a multi-stage neural-network based ensemble-learning model integrating both protein sequence derived and protein structural features. Benchmarking experiments against the current state-of-the-art predictors for S-sulphenylation demonstrated that SIMLIN delivered competitive prediction performance. The empirical studies on the independent testing dataset demonstrated that SIMLIN achieved 88.0% prediction accuracy and an AUC score of 0.82, which outperforms currently existing methods. Conclusions: In summary, SIMLIN predicts human S-sulphenylation sites with high accuracy thereby facilitating biological hypothesis generation and experimental validation. The web server, datasets, and online instructions are freely available at http://simlin.erc.monash.edu / for academic purposes.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Sharma V.S."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Webb G.I."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SIMLIN: a bioinformatics tool for prediction of S-sulphenylation in the human proteome based on multi-stage ensemble-learning models"
            },
            "pmcid": "PMC6868744",
            "pmid": "31752668"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}