{
    "additionDate": "2018-06-12T18:59:34Z",
    "biotoolsCURIE": "biotools:htssip",
    "biotoolsID": "htssip",
    "credit": [
        {
            "email": "seb369@cornell.edu",
            "name": "Samuel Barnett",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The tool functions for analyzing high throughput sequencing stable isotope probing (HTS-SIP) data. Analyses include high resolution stable isotope probing (HR-SIP), multi-window high resolution stable isotope probing (MW-HR-SIP), and quantitative stable isotope probing (q-SIP).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/HTSSIP/HTSSIP.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/HTSSIP/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "HTSSIP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0189616",
            "metadata": {
                "abstract": "© 2018 Youngblut et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Combining high throughput sequencing with stable isotope probing (HTS-SIP) is a powerful method for mapping in situ metabolic processes to thousands of microbial taxa. However, accurately mapping metabolic processes to taxa is complex and challenging. Multiple HTSSIP data analysis methods have been developed, including high-resolution stable isotope probing (HR-SIP), multi-window high-resolution stable isotope probing (MW-HR-SIP), quantitative stable isotope probing (qSIP), and ΔBD. Currently, there is no publicly available software designed specifically for analyzing HTS-SIP data. To address this shortfall, we have developed the HTSSIP R package, an open-source, cross-platform toolset for conducting HTS-SIP analyses in a straightforward and easily reproducible manner. The HTSSIP package, along with full documentation and examples, is available from CRAN at https://cran.rproject.org/web/packages/HTSSIP/index.html and Github at https://github.com/buckleylab/HTSSIP.",
                "authors": [
                    {
                        "name": "Youngblut N.D."
                    },
                    {
                        "name": "Barnett S.E."
                    },
                    {
                        "name": "Buckley D.H."
                    }
                ],
                "citationCount": 11,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "HTSSIP: An r package for analysis of high throughput sequencing data from nucleic acid stable isotope probing (sip) experiments"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        }
    ],
    "validated": 1
}