{
    "accessibility": "Open access",
    "additionDate": "2023-01-25T21:39:25.786413Z",
    "biotoolsCURIE": "biotools:steps_4.0",
    "biotoolsID": "steps_4.0",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "erik@oist.jp",
            "name": "Erik De Schutter",
            "typeEntity": "Person"
        },
        {
            "name": "Felix Schürmann"
        },
        {
            "name": "Tristan Carel"
        },
        {
            "name": "Weiliang Chen"
        }
    ],
    "description": "Fast and memory-efficient molecular simulations of neurons at the nanoscale.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "http://steps.sourceforge.net/",
    "lastUpdate": "2023-01-25T21:39:25.789374Z",
    "name": "STEPS 4.0",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINF.2022.883742",
            "metadata": {
                "abstract": "Copyright © 2022 Chen, Carel, Awile, Cantarutti, Castiglioni, Cattabiani, Del Marmol, Hepburn, King, Kotsalos, Kumbhar, Lallouette, Melchior, Schürmann and De Schutter.Recent advances in computational neuroscience have demonstrated the usefulness and importance of stochastic, spatial reaction-diffusion simulations. However, ever increasing model complexity renders traditional serial solvers, as well as naive parallel implementations, inadequate. This paper introduces a new generation of the STochastic Engine for Pathway Simulation (STEPS) project (http://steps.sourceforge.net/), denominated STEPS 4.0, and its core components which have been designed for improved scalability, performance, and memory efficiency. STEPS 4.0 aims to enable novel scientific studies of macroscopic systems such as whole cells while capturing their nanoscale details. This class of models is out of reach for serial solvers due to the vast quantity of computation in such detailed models, and also out of reach for naive parallel solvers due to the large memory footprint. Based on a distributed mesh solution, we introduce a new parallel stochastic reaction-diffusion solver and a deterministic membrane potential solver in STEPS 4.0. The distributed mesh, together with improved data layout and algorithm designs, significantly reduces the memory footprint of parallel simulations in STEPS 4.0. This enables massively parallel simulations on modern HPC clusters and overcomes the limitations of the previous parallel STEPS implementation. Current and future improvements to the solver are not sustainable without following proper software engineering principles. For this reason, we also give an overview of how the STEPS codebase and the development environment have been updated to follow modern software development practices. We benchmark performance improvement and memory footprint on three published models with different complexities, from a simple spatial stochastic reaction-diffusion model, to a more complex one that is coupled to a deterministic membrane potential solver to simulate the calcium burst activity of a Purkinje neuron. Simulation results of these models suggest that the new solution dramatically reduces the per-core memory consumption by more than a factor of 30, while maintaining similar or better performance and scalability.",
                "authors": [
                    {
                        "name": "Awile O."
                    },
                    {
                        "name": "Cantarutti N."
                    },
                    {
                        "name": "Carel T."
                    },
                    {
                        "name": "Castiglioni G."
                    },
                    {
                        "name": "Cattabiani A."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "De Schutter E."
                    },
                    {
                        "name": "Del Marmol B."
                    },
                    {
                        "name": "Hepburn I."
                    },
                    {
                        "name": "King J.G."
                    },
                    {
                        "name": "Kotsalos C."
                    },
                    {
                        "name": "Kumbhar P."
                    },
                    {
                        "name": "Lallouette J."
                    },
                    {
                        "name": "Melchior S."
                    },
                    {
                        "name": "Schurmann F."
                    }
                ],
                "date": "2022-10-26T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "STEPS 4.0: Fast and memory-efficient molecular simulations of neurons at the nanoscale"
            },
            "pmcid": "PMC9645802",
            "pmid": "36387588"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
