{
    "additionDate": "2020-01-14T09:28:24Z",
    "biotoolsCURIE": "biotools:De-smokeGCN",
    "biotoolsID": "De-smokeGCN",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Nigel W. John",
            "orcidid": "https://orcid.org/0000-0001-5153-182X",
            "typeEntity": "Person"
        },
        {
            "name": "Tao Ruan Wan",
            "orcidid": "https://orcid.org/0000-0001-6220-2423",
            "typeEntity": "Person"
        },
        {
            "name": "Wen Tang",
            "orcidid": "https://orcid.org/0000-0001-6220-2423",
            "typeEntity": "Person"
        },
        {
            "name": "Long Chen",
            "orcidid": "https://orcid.org/0000-0002-4985-9516",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Jian Jun Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Generative cooperative networks for joint surgical smoke detection and removal in order to remove surgical smoke and improve the quality of intra-operative imaging and reduce hazards in image-guided surgery.  This is a highly desirable post-process for many clinical applications.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/melights/cnn_desmoke",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-09T14:27:57Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/melights/cnn_desmoke/issues"
        }
    ],
    "name": "De-smokeGCN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TMI.2019.2953717",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.Surgical smoke removal algorithms can improve the quality of intra-operative imaging and reduce hazards in image-guided surgery, a highly desirable post-process for many clinical applications. These algorithms also enable effective computer vision tasks for future robotic surgery. In this article, we present a new unsupervised learning framework for high-quality pixel-wise smoke detection and removal. One of the well recognized grand challenges in using convolutional neural networks (CNNs) for medical image processing is to obtain intra-operative medical imaging datasets for network training and validation, but availability and quality of these datasets are scarce. Our novel training framework does not require ground-truth image pairs. Instead, it learns purely from computer-generated simulation images. This approach opens up new avenues and bridges a substantial gap between conventional non-learning based methods and which requiring prior knowledge gained from extensive training datasets. Inspired by the Generative Adversarial Network (GAN), we have developed a novel generative-collaborative learning scheme that decomposes the de-smoke process into two separate tasks: smoke detection and smoke removal. The detection network is used as prior knowledge, and also as a loss function to maximize its support for training of the smoke removal network. Quantitative and qualitative studies show that the proposed training framework outperforms the state-of-the-art de-smoking approaches including the latest GAN framework (such as PIX2PIX). Although trained on synthetic images, experimental results on clinical images have proved the effectiveness of the proposed network for detecting and removing surgical smoke on both simulated and real-world laparoscopic images.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "John N.W."
                    },
                    {
                        "name": "Tang W."
                    },
                    {
                        "name": "Wan T.R."
                    },
                    {
                        "name": "Zhang J.J."
                    }
                ],
                "citationCount": 6,
                "date": "2020-05-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "De-smokeGCN: Generative Cooperative Networks for Joint Surgical Smoke Detection and Removal"
            },
            "pmid": "31751268"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
