{
    "additionDate": "2021-03-19T08:47:10Z",
    "biotoolsCURIE": "biotools:nlt",
    "biotoolsID": "nlt",
    "confidence_flag": "tool",
    "description": "Modeling the Domain Shift for Crowd Counting.\n\nPyTorch implementations of the paper: \"Neuron Linear Transformation: Modeling the Domain Shift for Crowd Counting (T-NNLS, 2021).\".",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/taohan10200/NLT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-11T11:52:35.929631Z",
    "name": "NLT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2021.3051371",
            "metadata": {
                "abstract": "IEEECross-domain crowd counting (CDCC) is a hot topic due to its importance in public safety. The purpose of CDCC is to alleviate the domain shift between the source and target domain. Recently, typical methods attempt to extract domain-invariant features via image translation and adversarial learning. When it comes to specific tasks, we find that the domain shifts are reflected in model parameters' differences. To describe the domain gap directly at the parameter level, we propose a neuron linear transformation (NLT) method, exploiting domain factor and bias weights to learn the domain shift. Specifically, for a specific neuron of a source model, NLT exploits few labeled target data to learn domain shift parameters. Finally, the target neuron is generated via a linear transformation. Extensive experiments and analysis on six real-world data sets validate that NLT achieves top performance compared with other domain adaptation methods. An ablation study also shows that the NLT is robust and more effective than supervised and fine-tune training. Code is available at https://github.com/taohan10200/NLT.",
                "authors": [
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Han T."
                    },
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "Neuron Linear Transformation: Modeling the Domain Shift for Crowd Counting"
            },
            "pmid": "33502985"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}