{
    "name": "3D-Jury", 
    "description": "3D-Jury is a protein structure prediction server that collects predictions from multiple servers and generates the final model using a consensus approach.", 
    "homepage": "http://meta.bioinfo.pl/submit_wizard.pl", 
    "biotoolsID": "3d-jury", 
    "biotoolsCURIE": "biotools:3d-jury", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0477", 
                    "term": "Protein modelling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0268", 
                    "term": "Protein super-secondary structure prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0267", 
                    "term": "Protein secondary structure prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0474", 
                    "term": "Protein structure prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0082", 
            "term": "Structure prediction"
        }, 
        {
            "uri": "http://edamontology.org/topic_2814", 
            "term": "Protein structure analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_0736", 
            "term": "Protein folds and structural domains"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_3542", 
            "term": "Protein secondary structure"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12824423", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "ORFeus: Detection of distant homology using sequence profiles and predicted secondary structure", 
                "abstract": "ORFeus is a fully automated, sensitive protein sequence similarity search server available to the academic community via the Structure Prediction Meta Server (http://BioInfo.PL/Meta/). The goal of the development of ORFeus was to increase the sensitivity of the detection of distantly related protein families. Predicted secondary structure information was added to the information about sequence conservation and variability, a technique known from hybrid threading approaches. The accuracy of the meta profiles created this way is compared with profiles containing only sequence information and with the standard approach of aligning a single sequence with a profile. Additionally, the alignment of meta profiles is more sensitive in detecting remote homology between protein families than if aligning two sequence-only profiles or if aligning a profile with a sequence. The specificity of the alignment score is improved in the lower specificity range compared with the robust sequence-only profiles.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 115, 
                "authors": [
                    {
                        "name": "Ginalski K."
                    }, 
                    {
                        "name": "Pas J."
                    }, 
                    {
                        "name": "Wyrwicz L.S."
                    }, 
                    {
                        "name": "von Grotthuss M."
                    }, 
                    {
                        "name": "Bujnicki J.M."
                    }, 
                    {
                        "name": "Rychlewski L."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12761065", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "3D-Jury: A simple approach to improve protein structure predictions", 
                "abstract": "Motivation: Consensus structure prediction methods (meta-predictors) have higher accuracy than individual structure prediction algorithms (their components). The goal for the development of the 3D-Jury system is to create a simple but powerful procedure for generating meta-predictions using variable sets of models obtained from diverse sources. The resulting protocol should help to improve the quality of structural annotations of novel proteins. Results: The 3D-Jury system generates meta-predictions from sets of models created using variable methods. It is not necessary to know prior characteristics of the methods. The system is able to utilize immediately new components (additional prediction providers). The accuracy of the system is comparable with other well-tuned prediction servers. The algorithm resembles methods of selecting models generated using ab initio folding simulations. It is simple and offers a portable solution to improve the accuracy of other protein structure prediction protocols.", 
                "date": "2003-05-22T00:00:00Z", 
                "citationCount": 630, 
                "authors": [
                    {
                        "name": "Ginalski K."
                    }, 
                    {
                        "name": "Elofsson A."
                    }, 
                    {
                        "name": "Fischer D."
                    }, 
                    {
                        "name": "Rychlewski L."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "12824309", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Detection of reliable and unexpexted protein fold predictions using 3D-Jury", 
                "abstract": "3D-Jury is a fully automated protein structure meta prediction system accessible via the Meta Server interface (http://BioInfo.PL/Meta). This is one of the meta predictors, which have made a dramatic, unprecedented impact on the last CASP-5 experiment. The 3D-Jury is comparable with other meta servers but it has the highest combined specificity and sensitivity. The presented method is also very simple and versatile and can be used to create meta predictions even from sets of models produced by humans. An additional and very important and novel feature of the system is the high correlation between the reported confidence score and the accuracy of the model. The number of correctly predicted residues can be estimated directly from the prediction score. The high reliability of the method enables any biologist to submit a target of interest to the Meta Server and screen with relatively high confidence, whether the target can be predicted by fold recognition methods while being unpredictable using standard approaches like PSI-Blast. This can point to interesting relationships which could have been missed in annotations of proteins or genomes and provide very valuable information for novel scientific discoveries.", 
                "date": "2003-07-01T00:00:00Z", 
                "citationCount": 60, 
                "authors": [
                    {
                        "name": "Ginalski K."
                    }, 
                    {
                        "name": "Rychlewski L."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-07T13:52:15Z", 
    "lastUpdate": "2018-12-10T12:58:44Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}