{
    "additionDate": "2020-01-14T08:51:28Z",
    "biotoolsCURIE": "biotools:LncTarD",
    "biotoolsID": "LncTarD",
    "confidence_flag": "tool",
    "description": "A manually-curated database of experimentally-supported functional lncRNA-target regulations in human diseases.\n\nSearch and download the information for the Mutual exclusivity. MutExGenome is a database of Mutual Exclusive mutations in mutiple species.\n\nLncTarD provides key lncRNA-target regulations, their influenced functions and lncRNA-mediated regulatory mechanisms in human diseases.\n\nQuick Search, start typing keywords, press ESC to close suggestions",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://biocc.hrbmu.edu.cn/LncTarD/",
    "lastUpdate": "2020-12-22T11:20:18Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bio-bigdata.hrbmu.edu.cn/LncTarD"
        }
    ],
    "name": "LncTarD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ985",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Long non-coding RNAs (lncRNAs) are associated with human diseases. Although lncRNA-disease associations have received significant attention, no online repository is available to collect lncRNA-mediated regulatory mechanisms, key downstream targets, and important biological functions driven by disease-related lncRNAs in human diseases. We thus developed LncTarD (http://biocc.hrbmu.edu.cn/LncTarD/or http://bio-bigdata.hrbmu.edu.cn/LncTarD), a manually-curated database that provides a comprehensive resource of key lncRNA-target regulations, lncRNA-influenced functions, and lncRNA-mediated regulatory mechanisms in human diseases. LncTarD offers (i) 2822 key lncRNA-target regulations involving 475 lncRNAs and 1039 targets associated with 177 human diseases; (ii) 1613 experimentally-supported functional regulations and 1209 expression associations in human diseases; (iii) important biological functions driven by disease-related lncRNAs in human diseases; (iv) lncRNA-target regulations responsible for drug resistance or sensitivity in human diseases and (v) lncRNA microarray, lncRNA sequence data and transcriptome data of an 11 373 pan-cancer patient cohort from TCGA to help characterize the functional dynamics of these lncRNA-target regulations. LncTarD also provides a user-friendly interface to conveniently browse, search, and download data. LncTarD will be a useful resource platform for the further understanding of functions and molecular mechanisms of lncRNA deregulation in human disease, which will help to identify novel and sensitive biomarkers and therapeutic targets.",
                "authors": [
                    {
                        "name": "Huang W."
                    },
                    {
                        "name": "Lei J."
                    },
                    {
                        "name": "Leng Z."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Shi J."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Xiao Y."
                    },
                    {
                        "name": "Xie A."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Yu L."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 27,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LncTarD: A manually-curated database of experimentally-supported functional lncRNA-target regulations in human diseases"
            },
            "pmid": "31713618"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
