{
    "additionDate": "2024-05-23T23:21:43.538849Z",
    "biotoolsCURIE": "biotools:mrmpro",
    "biotoolsID": "mrmpro",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yu.sdfmu@gmail.com",
            "name": "Changbin Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "Web-based tool to improve the speed of manual calibration for multiple reaction monitoring data analysis by mass spectrometry.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "MRM/SRM",
                    "uri": "http://edamontology.org/operation_3636"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "http://mrmpro.csibio.com/",
    "lastUpdate": "2024-11-24T13:56:59.392994Z",
    "name": "MRMPro",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05685-x",
            "metadata": {
                "abstract": "Background: As a gold-standard quantitative technique based on mass spectrometry, multiple reaction monitoring (MRM) has been widely used in proteomics and metabolomics. In the analysis of MRM data, as no peak picking algorithm can achieve perfect accuracy, manual inspection is necessary to correct the errors. In large cohort analysis scenarios, the time required for manual inspection is often considerable. Apart from the commercial software that comes with mass spectrometers, the open-source and free software Skyline is the most popular software for quantitative omics. However, this software is not optimized for manual inspection of hundreds of samples, the interactive experience also needs to be improved. Results: Here we introduce MRMPro, a web-based MRM data analysis platform for efficient manual inspection. MRMPro supports data analysis of MRM and schedule MRM data acquired by mass spectrometers of mainstream vendors. With the goal of improving the speed of manual inspection, we implemented a collaborative review system based on cloud architecture, allowing multiple users to review through browsers. To reduce bandwidth usage and improve data retrieval speed, we proposed a MRM data compression algorithm, which reduced data volume by more than 60% and 80% respectively compared to vendor and mzML format. To improve the efficiency of manual inspection, we proposed a retention time drift estimation algorithm based on similarity of chromatograms. The estimated retention time drifts were then used for peak alignment and automatic EIC grouping. Compared with Skyline, MRMPro has higher quantification accuracy and better manual inspection support. Conclusions: In this study, we proposed MRMPro to improve the usability of manual calibration for MRM data analysis. MRMPro is free for non-commercial use. Researchers can access MRMPro through http://mrmpro.csibio.com/. All major mass spectrometry formats (wiff, raw, mzML, etc.) can be analyzed on the platform. The final identification results can be exported to a common.xlsx format for subsequent analysis.",
                "authors": [
                    {
                        "name": "An S."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Lu M."
                    },
                    {
                        "name": "Tong J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Yu C."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MRMPro: a web-based tool to improve the speed of manual calibration for multiple reaction monitoring data analysis by mass spectrometry"
            },
            "pmcid": "PMC10848457",
            "pmid": "38321388"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
