{
    "accessibility": "Open access",
    "additionDate": "2023-11-10T13:32:48.473916Z",
    "biotoolsCURIE": "biotools:nerna",
    "biotoolsID": "nerna",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "duygu.sacar@agu.edu.tr",
            "name": "Müşerref Duygu Saçar Demirci",
            "orcidid": "https://orcid.org/0000-0003-2012-0598"
        }
    ],
    "description": "A negative data generation framework for machine learning applications of noncoding RNAs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Mehmeteminorhan/NegativeRNA",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-11-10T13:32:48.476612Z",
    "license": "MIT",
    "name": "NeRNA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2023.106861",
            "metadata": {
                "abstract": "Many supervised machine learning based noncoding RNA (ncRNA) analysis methods have been developed to classify and identify novel sequences. During such analysis, the positive learning datasets usually consist of known examples of ncRNAs and some of them might even have weak or strong experimental validation. On the contrary, there are neither databases listing the confirmed negative sequences for a specific ncRNA class nor standardized methodologies developed to generate high quality negative examples. To overcome this challenge, a novel negative data generation method, NeRNA (negative RNA), is developed in this work. NeRNA uses known examples of given ncRNA sequences and their calculated structures for octal representation to create negative sequences in a manner similar to frameshift mutations but without deletion or insertion. NeRNA is tested individually with four different ncRNA datasets including microRNA (miRNA), transfer RNA (tRNA), long noncoding RNA (lncRNA), and circular RNA (circRNA). Furthermore, a species-specific case analysis is performed to demonstrate and compare the performance of NeRNA for miRNA prediction. The results of 1000 fold cross-validation on Decision Tree, Naïve Bayes and Random Forest classifiers, and deep learning algorithms such as Multilayer Perceptron, Convolutional Neural Network, and Simple feedforward Neural Networks indicate that models obtained by using NeRNA generated datasets, achieves substantially high prediction performance. NeRNA is released as an easy-to-use, updatable and modifiable KNIME workflow that can be downloaded with example datasets and required extensions. In particular, NeRNA is designed to be a powerful tool for RNA sequence data analysis.",
                "authors": [
                    {
                        "name": "Demirci Y.M."
                    },
                    {
                        "name": "Orhan M.E."
                    },
                    {
                        "name": "Sacar Demirci M.D."
                    }
                ],
                "date": "2023-06-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "NeRNA: A negative data generation framework for machine learning applications of noncoding RNAs"
            },
            "pmid": "37075604",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
