{
    "name": "PedPhase", 
    "description": "Suite of computer programs for haplotype inference from genotypes on pedigree data. It consists of several different algorithms that are designed based on a combinatorial formulation of haplotype inference, namely the minimum-recombinant haplotype configuration (MRHC) problem, and are effective for different types of data.", 
    "homepage": "http://engr.case.edu/li_jing/haplotyping.html", 
    "biotoolsID": "pedphase", 
    "biotoolsCURIE": "biotools:pedphase", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0487", 
                    "term": "Haplotype mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Suite"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "DNA polymorphism"
        }, 
        {
            "uri": "http://edamontology.org/topic_0625", 
            "term": "Genotype and phenotype"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/pedphase-3-0-haplotype-inference-genotypes-pedigree-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://engr.case.edu/li_jing/haplotyping.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "19507288", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "An almost linear time algorithm for a general haplotype solution on tree pedigrees with no recombination and its extensions", 
                "abstract": "We study the haplotype inference problem from pedigree data under the zero recombination assumption, which is well supported by real data for tightly linked markers (i.e. single nucleotide polymorphisms (SNPs)) over a relatively large chromosome segment. We solve the problem in a rigorous mathematical manner by formulating genotype constraints as a linear system of inheritance variables. We then utilize disjoint-set structures to encode connectivity information among individuals, to detect constraints from genotypes, and to check consistency of constraints. On a tree pedigree without missing data, our algorithm can output a general solution as well as the number of total specific solutions in a nearly linear time O(mn · α(n)), where m is the number of loci, n is the number of individuals and α is the inverse Ackermann function, which is a further improvement over existing ones. We also extend the idea to looped pedigrees and pedigrees with missing data by considering existing (partial) constraints on inheritance variables. The algorithm has been implemented in C++ and will be incorporated into our PedPhase package. Experimental results show that it can correctly identify all 0-recombinant solutions with great efficiency. Comparisons with other two popular algorithms show that the proposed algorithm achieves 10 to 105-fold improvements over a variety of parameter settings. The experimental study also provides empirical evidences on the complexity bounds suggested by theoretical analysis. © 2009 Imperial College Press.", 
                "date": "2009-06-19T00:00:00Z", 
                "citationCount": 18, 
                "authors": [
                    {
                        "name": "Li X."
                    }, 
                    {
                        "name": "Li J."
                    }
                ], 
                "journal": "Journal of Bioinformatics and Computational Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Jing Li", 
            "email": "jingli@case.edu", 
            "url": "https://sites.google.com/a/case.edu/jingli/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:55:24Z", 
    "lastUpdate": "2018-12-10T12:58:49Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}