
{
    "credit": [
    ],
    "labels": {
        "topic": [
            {
                "term": "Geriatric medicine",
                "uri": "http://edamontology.org/topic_3399"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Critical care medicine",
                "uri": "http://edamontology.org/topic_3403"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© James Cook University.Introduction: The burden of stroke for Aboriginal and Torres Strait Islander peoples in Australia is significant. The National Stroke Foundation has identified that Aboriginal and Torres Strait Islander people are more likely to have a stroke at a younger age than the non-Indigenous population and are twice as likely for stroke to result in death, and that those Aboriginal and Torres Strait Islander people living in rural and remote areas are less likely to have access to an acute stroke unit. The only acute stroke unit in Far North Queensland treats six times more Aboriginal and Torres Strait Islander patients than the Queensland average, a large proportion of whom reside in the rural and remote communities of the Cape and Torres Strait. This article describes part of the qualitative phase of a project titled 'Culturally appropriate stroke services for Aboriginal and Torres Strait Islander people', received Closing the Gap funding to identify the needs of Aboriginal and Torres Strait Islander stroke survivors in Far North Queensland and establish a model of care that is responsive to these needs. Method: Data were collected from 24 stroke survivors, 10 carers and 70 stakeholders through surveys. The surveys incorporated open-ended questions and were administered through face to face interviews with participants from across 18 diverse Aboriginal and Torres Strait Islander communities within Far North Queensland. Guided by the principles of thematic analysis the data were coded, categories created and themes and subthemes identified. Results: This study emphasises the need for an inclusive coordinated and culturally responsive approach to Aboriginal and Torres Strait Islander stroke care that values the role of the client, their family and community. The Aboriginal and Torres Strait Islander liaison officer has a pivotal role within the multidisciplinary team. Resources specific to the language, literacy and cultural needs of Aboriginal and Torres Strait Islander stroke survivors are required as is advocacy for the availability and use of Aboriginal and Torres Strait Islander language interpreters. Aboriginal and Torres Strait Islander stroke survivors have limited opportunity to fulfil their rehabilitation potential after hospital discharge. Conclusion: An integrated patient centred model of care that spans the care continuum and places value on an extended role for the Aboriginal and Torres Strait Islander health worker workforce is indicated, as is an increased utilisation of allied health and specialist follow-up close to home.",
            "authors": [
                "Quigley R.",
                "Mann J.",
                "Robertson J.",
                "Bonython-Ericson S."
            ],
            "cit_count": 0,
            "doi": "10.22605/RRH4850",
            "journal": "Rural and Remote Health",
            "pmid": "31487467",
            "title": "Are we there yet? Exploring the journey to quality stroke care for Aboriginal and Torres Strait Islander peoples in rural and remote Queensland",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Aboriginal_Torres_Strait_Islander_stroke",
        "biotoolsID": "Aboriginal_Torres_Strait_Islander_stroke",
        "description": "> HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'Aboriginal Torres Strait Islander', 'Torres Strait Islander stroke survivors', 'Torres Strait Islander stroke', 'Aboriginal Torres Strait' | Are we there yet? Exploring the journey to quality stroke care for Aboriginal and Torres Strait Islander peoples in rural and remote Queensland | INTRODUCTION:The burden of stroke for Aboriginal and Torres Strait Islander peoples in Australia is significant. The National Stroke Foundation has identified that Aboriginal and Torres Strait Islander people are more likely to have a stroke at a younger age than the non-Indigenous population and are twice as likely for stroke to result in death, and that those Aboriginal and Torres Strait Islander people living in rural and remote areas are less likely to have access to an acute stroke unit",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31487467",
        "name": "Aboriginal Torres Strait Islander stroke"
    }
}