{
    "additionDate": "2018-07-28T13:20:37Z",
    "biotoolsCURIE": "biotools:primersuite",
    "biotoolsID": "primersuite",
    "credit": [
        {
            "email": "jennifer.lu@uqconnect.edu.au",
            "name": "Jennifer Lu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "High-Throughput Web-Based Primer Design Program for Multiplex Bisulfite PCR.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.primer-suite.com/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://www.primer-suite.com/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "PrimerSuite",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/srep41328",
            "metadata": {
                "abstract": "© The Author(s) 2017.The analysis of DNA methylation at CpG dinucleotides has become a major research focus due to its regulatory role in numerous biological processes, but the requisite need for assays which amplify bisulfite-converted DNA represents a major bottleneck due to the unique design constraints imposed on bisulfite-PCR primers. Moreover, a review of the literature indicated no available software solutions which accommodated both high-throughput primer design, support for multiplex amplification assays, and primer-dimer prediction. In response, the tri-modular software package PrimerSuite was developed to support bisulfite multiplex PCR applications. This software was constructed to (i) design bisulfite primers against multiple regions simultaneously (PrimerSuite), (ii) screen for primer-primer dimerizing artefacts (PrimerDimer), and (iii) support multiplex PCR assays (PrimerPlex). Moreover, a major focus in the development of this software package was the emphasis on extensive empirical validation, and over 1300 unique primer pairs have been successfully designed and screened, with over 94% of them producing amplicons of the expected size, and an average mapping efficiency of 93% when screened using bisulfite multiplex resequencing. The potential use of the software in other bisulfite-based applications such as methylation-specific PCR is under consideration for future updates. This resource is freely available for use at PrimerSuite website (www.primer-suite.com).",
                "authors": [
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "Johnston A."
                    },
                    {
                        "name": "Berichon P."
                    },
                    {
                        "name": "Ru K.-L."
                    },
                    {
                        "name": "Korbie D."
                    },
                    {
                        "name": "Trau M."
                    }
                ],
                "citationCount": 12,
                "date": "2017-01-24T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "PrimerSuite: A high-throughput web-based primer design program for multiplex bisulfite PCR"
            },
            "pmcid": "PMC5259761",
            "pmid": "28117430"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}