{
    "additionDate": "2021-01-18T09:00:28Z",
    "biotoolsCURIE": "biotools:hpolabeler",
    "biotoolsID": "hpolabeler",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhusf@fudan.edu.cn",
            "name": "Shanfeng Zhu",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving prediction of human protein-phenotype associations by learning to rank.\n\nPredict human protein-HPO term associations using Learning to Rank.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "http://issubmission.sjtu.edu.cn/hpolabeler/",
    "lastUpdate": "2021-03-18T09:07:53Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://compbio.charite.de/jenkins/job/hpo.annotations/1236/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://compbio.charite.de/jenkins/job/hpo.annotations/1252/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://compbio.charite.de/jenkins/job/hpo.annotations/1259/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://compbio.charite.de/jenkins/job/hpo.annotations/1263/"
        }
    ],
    "name": "HPOLabeler",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA284",
            "metadata": {
                "abstract": "© The Author(s) 2020.Motivation: Annotating human proteins by abnormal phenotypes has become an important topic. Human Phenotype Ontology (HPO) is a standardized vocabulary of phenotypic abnormalities encountered in human diseases. As of November 2019, only <4000 proteins have been annotated with HPO. Thus, a computational approach for accurately predicting protein-HPO associations would be important, whereas no methods have outperformed a simple Naive approach in the second Critical Assessment of Functional Annotation, 2013-2014 (CAFA2). Results: We present HPOLabeler, which is able to use a wide variety of evidence, such as protein-protein interaction (PPI) networks, Gene Ontology, InterPro, trigram frequency and HPO term frequency, in the framework of learning to rank (LTR). LTR has been proved to be powerful for solving large-scale, multi-label ranking problems in bioinformatics. Given an input protein, LTR outputs the ranked list of HPO terms from a series of input scores given to the candidate HPO terms by component learning models (logistic regression, nearest neighbor and a Naive method), which are trained from given multiple evidence. We empirically evaluate HPOLabeler extensively through mainly two experiments of cross validation and temporal validation, for which HPOLabeler significantly outperformed all component models and competing methods including the current state-of-the-art method. We further found that (i) PPI is most informative for prediction among diverse data sources and (ii) low prediction performance of temporal validation might be caused by incomplete annotation of new proteins.",
                "authors": [
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Mamitsuka H."
                    },
                    {
                        "name": "Zhu S."
                    }
                ],
                "date": "2020-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HPOLabeler: Improving prediction of human protein-phenotype associations by learning to rank"
            },
            "pmid": "32379868"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
