{
    "additionDate": "2021-01-18T09:34:47Z",
    "biotoolsCURIE": "biotools:exobcd",
    "biotoolsID": "exobcd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liumingwei@cqmu.edu.cn",
            "name": "Lixin Xia",
            "typeEntity": "Person"
        },
        {
            "email": "xialixin@126.com",
            "name": "Mingwei Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "ExoBCD is a comprehensive database for exosomal biomarker discovery in breast cancer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://exobcd.liumwei.org",
    "lastUpdate": "2021-03-08T10:21:15Z",
    "name": "ExoBCD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA088",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Effective and safe implementation of precision oncology for breast cancer is a vital strategy to improve patient outcomes, which relies on the application of reliable biomarkers. As 'liquid biopsy' and novel resource for biomarkers, exosomes provide a promising avenue for the diagnosis and treatment of breast cancer. Although several exosome-related databases have been developed, there is still lacking of an integrated database for exosome-based biomarker discovery. To this end, a comprehensive database ExoBCD (https://exobcd.liumwei.org) was constructed with the combination of robust analysis of four high-throughput datasets, transcriptome validation of 1191 TCGA cases and manual mining of 950 studies. In ExoBCD, approximately 20 900 annotation entries were integrated from 25 external sources and 306 exosomal molecules (49 potential biomarkers and 257 biologically interesting molecules). The latter could be divided into 3 molecule types, including 121 mRNAs, 172 miRNAs and 13 lncRNAs. Thus, the well-linked information about molecular characters, experimental biology, gene expression patterns, overall survival, functional evidence, tumour stage and clinical use were fully integrated. As a data-driven and literature-based paradigm proposed of biomarker discovery, this study also demonstrated the corroborative analysis and identified 36 promising molecules, as well as the most promising prognostic biomarkers, IGF1R and FRS2. Taken together, ExoBCD is the first well-corroborated knowledge base for exosomal studies of breast cancer. It not only lays a foundation for subsequent studies but also strengthens the studies of probing molecular mechanisms, discovering biomarkers and developing meaningful clinical use.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Chai Z."
                    },
                    {
                        "name": "Pan G."
                    },
                    {
                        "name": "Hao Y."
                    },
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Ye T."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Long F."
                    },
                    {
                        "name": "Xia L."
                    },
                    {
                        "name": "Liu M."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "ExoBCD: a comprehensive database for exosomal biomarker discovery in breast cancer"
            },
            "pmid": "32591816"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}