{
    "additionDate": "2019-11-14T18:06:02Z",
    "biotoolsCURIE": "biotools:ClickGene",
    "biotoolsID": "ClickGene",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ksong@tju.edu.cn",
            "name": "Kai Song",
            "orcidid": "https://orcid.org/0000-0001-9195-6160",
            "typeEntity": "Person"
        }
    ],
    "description": "An open cloud-based platform for big pan-cancer data genome-wide association study, visualization and exploration | Click: Do GWAS analysis by yourself by Clicking | More than 30 cancer types, more than 10,000 samples | Including gene expression, copy number variation, methylation and mutation data categories | You are accessing a non-profit web site which is based on GDC data portal hosted by National Cancer Institute, USA. All data was downloaded from GDC public database. Please make sure you are aware of and obey the policy of GDC data portal. Please go to User`s Guide for more information | Beeswarm plot, Manhattan plot, Volcano plot, Mountain plot, Deflection plot, Linear regression analysis, significance test and",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.clickgenome.org/guide/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.clickgenome.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-16T14:01:19Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.clickgenome.org/welcome/"
        }
    ],
    "name": "ClickGene",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13040-019-0202-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Tremendous amount of whole-genome sequencing data have been provided by large consortium projects such as TCGA (The Cancer Genome Atlas), COSMIC and so on, which creates incredible opportunities for functional gene research and cancer associated mechanism uncovering. While the existing web servers are valuable and widely used, many whole genome analysis functions urgently needed by experimental biologists are still not adequately addressed. A cloud-based platform, named CG (ClickGene), therefore, was developed for DIY analyzing of user's private in-house data or public genome data without any requirement of software installation or system configuration. CG platform provides key interactive and customized functions including Bee-swarm plot, linear regression analyses, Mountain plot, Directional Manhattan plot, Deflection plot and Volcano plot. Using these tools, global profiling or individual gene distributions for expression and copy number variation (CNV) analyses can be generated by only mouse button clicking. The easy accessibility of such comprehensive pan-cancer genome analysis greatly facilitates data mining in wide research areas, such as therapeutic discovery process. Therefore, it fills in the gaps between big cancer genomics data and the delivery of integrated knowledge to end-users, thus helping unleash the value of the current data resources. More importantly, unlike other R-based web platforms, Dubbo, a cloud distributed service governance framework for 'big data' stream global transferring, was used to develop CG platform. After being developed, CG is run on an independent cloud-server, which ensures its steady global accessibility. More than 2 years running history of CG proved that advanced plots for hundreds of whole-genome data can be created through it within seconds by end-users anytime and anywhere.",
                "authors": [
                    {
                        "name": "Bi J.-H."
                    },
                    {
                        "name": "Tong Y.-F."
                    },
                    {
                        "name": "Qiu Z.-W."
                    },
                    {
                        "name": "Yang X.-F."
                    },
                    {
                        "name": "Minna J."
                    },
                    {
                        "name": "Gazdar A.F."
                    },
                    {
                        "name": "Song K."
                    }
                ],
                "citationCount": 7,
                "date": "2019-06-26T00:00:00Z",
                "journal": "BioData Mining",
                "title": "ClickGene: An open cloud-based platform for big pan-cancer data genome-wide association study, visualization and exploration"
            },
            "pmcid": "PMC6595587",
            "pmid": "31391866"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}