{
    "accessibility": "Open access",
    "additionDate": "2024-01-03T22:34:23.755591Z",
    "biotoolsCURIE": "biotools:spindlestracker",
    "biotoolsID": "spindlestracker",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Zhongzhong Li",
            "orcidid": "https://orcid.org/0000-0003-0570-3197"
        }
    ],
    "description": "An automatic and low-cost labeled workflow for spindle analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lizhogn/SpindlesTracker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-03T22:34:23.758219Z",
    "name": "SpindlesTracker",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/JBHI.2023.3281454",
            "metadata": {
                "abstract": "Quantitative analysis of spindle dynamics in mitosis through fluorescence microscopy requires tracking spindle elongation in noisy image sequences. Deterministic methods, which use typical microtubule detection and tracking methods, perform poorly in the sophisticated background of spindles. In addition, the expensive data labeling cost also limits the application of machine learning in this field. Here we present a fully automatic and low-cost labeled workflow that efficiently analyzes the dynamic spindle mechanism of time-lapse images, called SpindlesTracker. In this workflow, we design a network named YOLOX-SP which can accurately detect the location and endpoint of each spindle under box-level data supervision. We then optimize the algorithm SORT and MCP for spindle's tracking and skeletonization. As there was no publicly available dataset, we annotated a S.pombe dataset that was entirely acquired from the real world for both training and evaluation. Extensive experiments demonstrate that SpindlesTracker achieves excellent performance in all aspects, while reducing label costs by 60%. Specifically, it achieves 84.1% mAP in spindle detection and over 90% accuracy in endpoint detection. Furthermore, the improved algorithm enhances tracking accuracy by 1.3% and tracking precision by 6.5%. Statistical results also indicate that the mean error of spindle length is within 1 μm. In summary, SpindlesTracker holds significant implications for the study of mitotic dynamic mechanisms and can be readily extended to the analysis of other filamentous objects. The code and the dataset are both released on GitHub.",
                "authors": [
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Jian Y."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Meng X."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "SpindlesTracker: An Automatic and Low-Cost Labeled Workflow for Spindle Analysis"
            },
            "pmid": "37252866",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
