{
    "additionDate": "2021-03-19T09:10:01Z",
    "biotoolsCURIE": "biotools:elihksir",
    "biotoolsID": "elihksir",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "faruckm@utdallas.edu",
            "name": "Faruck Morcos",
            "orcidid": "https://orcid.org/0000-0001-6208-1561",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The ELIHKSIR (Evolutionary Links Inferred for Histidine Kinase Sensors Interacting with Response Regulators) web application offers insights about the probability of protein interaction specificity in two-component systems. The knowledge reported on this website is gained through statistical inference from genomic data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://elihksir.org",
    "lastUpdate": "2021-05-05T10:51:32Z",
    "name": "ELIHKSIR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/E23020170",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Two-component systems (TCS) are signaling machinery that consist of a histidine kinases (HK) and response regulator (RR). When an environmental change is detected, the HK phosphory-lates its cognate response regulator (RR). While cognate interactions were considered orthogonal, experimental evidence shows the prevalence of crosstalk interactions between non-cognate HK–RR pairs. Currently, crosstalk interactions have been demonstrated for TCS proteins in a limited number of organisms. By providing specificity predictions across entire TCS networks for a large variety of organisms, the ELIHKSIR web server assists users in identifying interactions for TCS proteins and their mutants. To generate specificity scores, a global probabilistic model was used to identify interfacial couplings and local fields from sequence information. These couplings and local fields were then used to construct Hamiltonian scores for positions with encoded specificity, resulting in the specificity score. These methods were applied to 6676 organisms available on the ELIHKSIR web server. Due to the ability to mutate proteins and display the resulting network changes, there are nearly endless combinations of TCS networks to analyze using ELIHKSIR. The functionality of ELIHKSIR allows users to perform a variety of TCS network analyses and visualizations to support TCS research efforts.",
                "authors": [
                    {
                        "name": "Jiang X."
                    },
                    {
                        "name": "Jung Y.H."
                    },
                    {
                        "name": "Morcos F."
                    },
                    {
                        "name": "Sinner C."
                    },
                    {
                        "name": "Ziegler C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Entropy",
                "title": "Elihksir web server: Evolutionary links inferred for histidine kinase sensors interacting with response regulators"
            },
            "pmcid": "PMC7911359",
            "pmid": "33573110"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
