{
    "additionDate": "2017-08-03T18:51:36Z",
    "biotoolsCURIE": "biotools:mixgf",
    "biotoolsID": "mixgf",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "jiw006@ucsd.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://proteomics.ucsd.edu/"
        }
    ],
    "description": "Computes the statistical significance of peptide identifications for mixture spectra and show that this approach improves the sensitivity of current mixture spectra database search tools by a ≈30-390%.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://proteomics.ucsd.edu/Software/MixGF/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://proteomics.ucsd.edu/software-tools/mixgf/",
    "lastUpdate": "2019-03-26T08:24:27Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mixgf-1-0r-computing-statistical-significance-of-peptide-spectrum-matches-for-multiplexed-msms-spectra.html"
        }
    ],
    "name": "MixGF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 by The American Society for Biochemistry and Molecular Biology, Inc.In large-scale proteomic experiments, multiple peptide precursors are often cofragmented simultaneously in the same mixture tandem mass (MS/MS) spectrum. These spectra tend to elude current computational tools because of the ubiquitous assumption that each spectrum is generated from only one peptide. Therefore, tools that consider multiple peptide matches to each MS/MS spectrum can potentially improve the relatively low spectrum identification rate often observed in proteomics experiments. More importantly, data independent acquisition protocols promoting the cofragmentation of multiple precursors are emerging as alternative methods that can greatly improve the throughput of peptide identifications but their success also depends on the availability of algorithms to identify multiple peptides from each MS/MS spectrum. Here we address a fundamental question in the identification of mixture MS/MS spectra: determining the statistical significance of multiple peptides matched to a given MS/MS spectrum. We propose the MixGF generating function model to rigorously compute the statistical significance of peptide identifications for mixture spectra and show that this approach improves the sensitivity of current mixture spectra database search tools by a ≈30-390%. Analysis of multiple data sets with MixGF reveals that in complex biological samples the number of identified mixture spectra can be as high as 20% of all the identified spectra and the number of unique peptides identified only in mixture spectra can be up to 35.4% of those identified in single-peptide spectra.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Bourne P.E."
                    },
                    {
                        "name": "Bandeira N."
                    }
                ],
                "citationCount": 15,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "MixGF: Spectral probabilities for mixture spectra from more than one peptide"
            },
            "pmid": "25225354"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}