{"credit":[{"email":"ywang@cs.hku.hk","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://i.cs.hku.hk/~alse/hkubrg/index.html"}],"documentation":[{"type":"GENERAL","url":"http://i.cs.hku.hk/~alse/MetaCluster/index.html"}],"function":[{"operation":[{"term":"Sequence annotation","uri":"http://edamontology.org/operation_0361"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"},{"term":"Sequence composition, complexity and repeats","uri":"http://edamontology.org/topic_0157"},{"term":"Metagenomics","uri":"http://edamontology.org/topic_3174"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/metacluster-5-0-beta2-binning-annotation-tool-metagenomic-sequences.html"}],"publication":[{"abstract":"© 2014 Wang et al.Background: Taxonomic annotation of reads is an important problem in metagenomic analysis. Existing annotation tools, which rely on the approach of aligning each read to the taxonomic structure, are unable to annotate many reads efficiently and accurately as reads (~100 bp) are short and most of them come from unknown genomes. Previous work has suggested assembling the reads to make longer contigs before annotation. More reads/contigs can be annotated as a longer contig (in Kbp) can be aligned to a taxon even if it is from an unknown species as long as it contains a conserved region of that taxon. Unfortunately existing metagenomic assembly tools are not mature enough to produce long enough contigs. Binning tries to group reads/contigs of similar species together. Intuitively, reads in the same group (cluster) should be annotated to the same taxon and these reads altogether should cover a significant portion of the genome alleviating the problem of short contigs if the quality of binning is high. However, no existing work has tried to use binning results to help solve the annotation problem. This work explores this direction. Results: In this paper, we describe MetaCluster-TA, an assembly-assisted binning-based annotation tool which relies on an innovative idea of annotating binned reads instead of aligning each read or contig to the taxonomic structure separately. We propose the novel concept of the 'virtual contig' (which can be up to 10 Kb in length) to represent a set of reads and then represent each cluster as a set of 'virtual contigs' (which together can be total up to 1 Mb in length) for annotation. MetaCluster-TA can outperform widely-used MEGAN4 and can annotate (1) more reads since the virtual contigs are much longer; (2) more accurately since each cluster of long virtual contigs contains global information of the sampled genome which tends to be more accurate than short reads or assembled contigs which contain only local information of the genome; and (3) more efficiently since there are much fewer long virtual contigs to align than short reads. MetaCluster-TA outperforms MetaCluster 5.0 as a binning tool since binning itself can be more sensitive and precise given long virtual contigs and the binning results can be improved using the reference taxonomic database. Conclusions: MetaCluster-TA can outperform widely-used MEGAN4 and can annotate more reads with higher accuracy and higher efficiency. It also outperforms MetaCluster 5.0 as a binning tool.","authors":["Wang Y.","Leung H.C.M.","Yiu S.M.","Chin F.Y.L."],"cit_count":25,"journal":"BMC Genomics","pmid":"24564377","title":"MetaCluster-TA: Taxonomic annotation for metagenomic data based on assembly-assisted binning","year":"2014-01-24"}],"summary":{"biotoolsCURIE":"biotools:metacluster","biotoolsID":"metacluster","description":"Unsupervised binning method for metagenomic sequences. Existing binning methods based on sequence similarity and sequence composition markers rely heavily on the reference genomes of known microorganisms and phylogenetic markers.","homepage":"http://i.cs.hku.hk/~alse/MetaCluster/index.html","name":"MetaCluster"}}