{
    "additionDate": "2020-01-14T09:32:40Z",
    "biotoolsCURIE": "biotools:Zr-MOFs",
    "biotoolsID": "Zr-MOFs",
    "confidence_flag": "tool",
    "description": "Large-Scale Structural Refinement and Screening of Zirconium Metal-Organic Frameworks for H2S/CH4 Separation.\n\nYou can find more than 182 experimentally synthesized guest-free and disorder-free Zirconium-based metal-organic frameworks (Zr-MOFs), which contain no less than 10 coordinated Zr6O8 inner cores. These structures are optimized by a combination of periodic density functional theory (DFT) and molecular mechanics method, and are given in cif format",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://mofs-genomics.github.io/Zr-MOFs-Database",
    "lastUpdate": "2021-01-07T18:42:30Z",
    "name": "Zr-MOFs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSAMI.9B17885",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Zirconium-based metal-organic frameworks (Zr-MOFs) with Zr6 inner cores represent a subfamily of nanoporous materials with good physicochemical stabilities, showing significant prospect for practical applications in various fields. Although computational characterization can play an important role that is complementary to experimental efforts, the availability of chemically realistic Zr-MOF structures is one of the prerequisites to accurately evaluate their performance as well as provide valuable insights for guiding material design. In this work, periodic density functional theory (DFT) calculations combined with a molecular mechanics method were performed to optimize the crystalline structures of over 182 experimentally synthesized Zr-MOFs that contain no less than 10-coordinated Zr6O8 nodes, leading to a database consisting of the structures having a diversity of topologies, pore sizes, and functionalities. Apart from determination of favorable configurations of organic linkers, rational proton topologies of the 11- and 10-coordinated Zr6O8 nodes were also clarified. Computational screening was further conducted to examine the H2S/CH4 separation properties of each material in the database. Significant difference were observed by comparing the separation properties of Zr-MOFs with optimized and nonoptimized structures. Some promising candidates with high H2S adsorption capacity and separation selectivity were identified on the basis of some evaluation metrics, and favorable organic linkers for designing new high-performance Zr-MOFs were also proposed.",
                "authors": [
                    {
                        "name": "Zhou F."
                    },
                    {
                        "name": "Zheng B."
                    },
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Yang Q."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-18T00:00:00Z",
                "journal": "ACS Applied Materials and Interfaces",
                "title": "Large-Scale Structural Refinement and Screening of Zirconium Metal-Organic Frameworks for H2S/CH4 Separation"
            },
            "pmid": "31738502"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1
}