{
    "name": "SVmine", 
    "description": "mining of SV predictions from multiple tools to improve the performance of SV detection. It refines SV predictions by performing local realignment and assess quality of SV predictions based on likelihoods of the realignments.", 
    "homepage": "https://github.com/xyc0813/SVmine", 
    "biotoolsID": "svmine", 
    "biotoolsCURIE": "biotools:svmine", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3228", 
                    "term": "Structural variation detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3175", 
            "term": "DNA structural variation"
        }, 
        {
            "uri": "http://edamontology.org/topic_2815", 
            "term": "Human biology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/xyc0813/SVmine", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx455", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "SVmine improves structural variation detection by integrative mining of predictions from multiple algorithms", 
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com Motivation: Structural variation (SV) is an important class of genomic variations in human genomes. A number of SV detection algorithms based on high-throughput sequencing data have been developed, but they have various and often limited level of sensitivity, specificity and breakpoint resolution. Furthermore, since overlaps between predictions of algorithms are low, SV detection based on multiple algorithms, an often-used strategy in real applications, has little effect in improving the performance of SV detection. Results: We develop a computational tool called SVmine for further mining of SV predictions from multiple tools to improve the performance of SV detection. SVmine refines SV predictions by performing local realignment and assess quality of SV predictions based on likelihoods of the realignments. The local realignment is performed against a set of sequences constructed from the reference sequence near the candidate SV by incorporating nearby single nucleotide variations, insertions and deletions. A sandwich alignment algorithm is further used to improve the accuracy of breakpoint positions. We evaluate SVmine on a set of simulated data and real data and find that SVmine has superior sensitivity, specificity and breakpoint estimation accuracy. We also find that SVmine can significantly improve overlaps of SV predictions from other algorithms. Availability and implementation: SVmine is available at https://github.com/xyc0813/SVmine. Contact: ruibinxi@math.pku.edu.cn. Supplementary information: Supplementary data are available at Bioinformatics online.", 
                "date": "2017-11-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Xia Y."
                    }, 
                    {
                        "name": "Liu Y."
                    }, 
                    {
                        "name": "Deng M."
                    }, 
                    {
                        "name": "Xi R."
                    }
                ], 
                "journal": "Bioinformatics (Oxford, England)"
            }
        }
    ], 
    "credit": [
        {
            "name": "Ruibin Xi", 
            "email": "ruibinxi@math.pku.edu.cn", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-06-16T09:59:31Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}