{
    "accessibility": "Open access",
    "additionDate": "2022-03-16T09:41:59.016111Z",
    "biotoolsCURIE": "biotools:cafe5",
    "biotoolsID": "cafe5",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "danvand@indiana.edu",
            "name": "Dan Vanderpool",
            "orcidid": "https://orcid.org/0000-0002-6856-5636"
        },
        {
            "name": "Ben Fulton"
        },
        {
            "name": "Fábio K Mendes"
        },
        {
            "name": "Matthew W Hahn"
        }
    ],
    "description": "The purpose of CAFE is to analyze changes in gene family size in a way that accounts for phylogenetic history and provides a statistical foundation for evolutionary inferences. The program uses a birth and death process to model gene gain and loss across a user-specified phylogenetic tree. The distribution of family sizes generated under this model can provide a basis for assessing the significance of the observed family size differences among taxa.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/hahnlab/CAFE5/releases/tag/v5.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hahnlab/CAFE5",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2022-03-16T09:41:59.018727Z",
    "license": "ECL-2.0",
    "name": "cafe5",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1101/gr.3567505",
            "metadata": {
                "abstract": "Comparison of whole genomes has revealed that changes in the size of gene families among organisms is quite common. However, there are as yet no models of gene family evolution that make it possible to estimate ancestral states or to infer upon which lineages gene families have contracted or expanded. In addition, large differences in family size have generally been attributed to the effects of natural selection, without a strong statistical basis for these conclusions. Here we use a model of stochastic birth and death for gene family evolution and show that it can be efficiently applied to multispecies genome comparisons. This model takes into account the lengths of branches on phylogenetic trees, as well as duplication and deletion rates, and hence provides expectations for divergence in gene family size among lineages. The model offers both the opportunity to identify large-scale patterns in genome evolution and the ability to make stronger inferences regarding the role of natural selection in gene family expansion or contraction. We apply our method to data from the genomes of five yeast species to show its applicability. ©2005 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Cristianini N."
                    },
                    {
                        "name": "De Bie T."
                    },
                    {
                        "name": "Hahn M.W."
                    },
                    {
                        "name": "Nguyen C."
                    },
                    {
                        "name": "Stajich J.E."
                    }
                ],
                "citationCount": 184,
                "date": "2005-08-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Estimating the tempo and mode of gene family evolution from comparative genomic data"
            },
            "pmcid": "PMC1182228",
            "pmid": "16077014"
        },
        {
            "doi": "10.1093/bioinformatics/btaa1022",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Genome sequencing projects have revealed frequent gains and losses of genes between species. Previous versions of our software, Computational Analysis of gene Family Evolution (CAFE), have allowed researchers to estimate parameters of gene gain and loss across a phylogenetic tree. However, the underlying model assumed that all gene families had the same rate of evolution, despite evidence suggesting a large amount of variation in rates among families. Results: Here, we present CAFE 5, a completely re-written software package with numerous performance and user-interface enhancements over previous versions. These include improved support for multithreading, the explicit modeling of rate variation among families using gamma-distributed rate categories, and command-line arguments that preclude the use of accessory scripts.",
                "authors": [
                    {
                        "name": "Fulton B."
                    },
                    {
                        "name": "Hahn M.W."
                    },
                    {
                        "name": "Mendes F.K."
                    },
                    {
                        "name": "Vanderpool D."
                    }
                ],
                "citationCount": 10,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CAFE 5 models variation in evolutionary rates among gene families"
            },
            "pmid": "33325502"
        },
        {
            "doi": "10.1093/bioinformatics/btl097",
            "metadata": {
                "abstract": "Summary: We present CAFE (Computational Analysis of gene Family Evolution), a tool for the statistical analysis of the evolution of the size of gene families. It uses a stochastic birth and death process to model the evolution of gene family sizes over a phylogeny. For a specified phylogenetic tree, and given the gene family sizes in the extant species, CAFE can estimate the global birth and death rate of gene families, infer the most likely gene family size at all internal nodes, identify gene families that have accelerated rates of gain and loss (quantified by a p -value) and identify which branches cause the p-value to be small for significant families. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Cristianini N."
                    },
                    {
                        "name": "De Bie T."
                    },
                    {
                        "name": "Demuth J.P."
                    },
                    {
                        "name": "Hahn M.W."
                    }
                ],
                "citationCount": 631,
                "date": "2006-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CAFE: A computational tool for the study of gene family evolution"
            },
            "pmid": "16543274"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}
