
{
    "credit": [
        {
            "email": "kds@kaist.ac.kr",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bcbl.kaist.ac.kr/KRDS/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Drug development",
                "uri": "http://edamontology.org/topic_3373"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Enzymes",
                "uri": "http://edamontology.org/topic_0821"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018, The Author(s). Kinases are major targets of anti-cancer therapies owing to their importance in signaling processes that regulate cell growth and proliferation. However, drug resistance has emerged as a major obstacle to cancer therapy. Resistance to drugs has various underlying mechanisms, including the acquisition of mutations at drug binding sites and the resulting reduction in drug binding affinity. Therefore, the identification of mutations that are relevant to drug resistance may be useful to overcome this issue. We hypothesized that these mutations can be identified by combining recent advances in computational methods for protein structure modeling and ligand docking simulation. Hence, we developed a web-based tool named the Kinase Resistance Docking System (KRDS) that enables the assessment of the effects of mutations on kinase-ligand interactions. KRDS receives a list of mutations in kinases, generates structural models of the mutants, performs docking simulations, and reports the results to users. The changes in docking scores and docking conformations can be analyzed to infer the effects of mutations on drug binding and drug resistance. We expect our tool to improve our understanding of drug binding mechanisms and facilitate the development of effective new drugs to overcome resistance related to kinases; it may be particularly useful for biomedical researchers who are not familiar with computational environments. Our tool is available at http://bcbl.kaist.ac.kr/KRDS/.",
            "authors": [
                "Lee A.",
                "Hong S.",
                "Kim D."
            ],
            "cit_count": 0,
            "doi": "10.1186/s13321-018-0274-y",
            "journal": "Journal of Cheminformatics",
            "title": "KRDS: a web server for evaluating drug resistance mutations in kinases by molecular docking",
            "year": "2018-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:krds",
        "biotoolsID": "krds",
        "description": "Evaluating drug resistance mutations in kinases by molecular docking.",
        "homepage": "http://bcbl.kaist.ac.kr/KRDS/",
        "name": "KRDS"
    }
}