{
    "additionDate": "2020-01-14T09:20:38Z",
    "biotoolsCURIE": "biotools:CompNet",
    "biotoolsID": "CompNet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sharmila.mande@tcs.com",
            "name": "Sharmila S. Mande",
            "typeEntity": "Person"
        }
    ],
    "description": "A GUI based tool for comparison of multiple biological interaction networks.\n\nInteraction networks are a convenient way of representing the complex nature of multi-component systems. Examples of such complex systems include biological pathways, social interactions, financial markets, management systems, multiple modules in a programming language, etc. Recognizing the similarities and differences between multiple interaction networks becomes easier when aided by proper visualization tools. we present a GUI based network comparison tool CompNet, which allows to visually compare multiple networks based on node and edge similarities. Additionally, the tool can compare individual networks on the basis of general network properties, node neighborhoods and community similarities. CompNet is expected to be a valuable addition in the field of visual data mining especially for users aiming to visually compare more than two interaction networks at the same time",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://web.rniapps.net/compnet/",
    "lastUpdate": "2020-12-16T17:18:48Z",
    "name": "CompNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3168-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Following publication of the original article [1], the authors requested to update a link in the article. There was a server update and the hosted applications needed to move to a new web location. The link of CompNet above published paper has changed and therefore needs to be updated in the BMC site. The links that needs to be updated can be find at the Conclusions section of Abstract and other under Project home page at the bottom. Old link (s): http://metagenomics.atc.tcs.com/compnet/ or http://121.241.184.233/compnet/ Updated new link: https://web.rniapps.net/compnet/.",
                "authors": [
                    {
                        "name": "Dutta A."
                    },
                    {
                        "name": "Kuntal B.K."
                    },
                    {
                        "name": "Mande S.S."
                    }
                ],
                "date": "2019-11-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Correction to: CompNet: A GUI based tool for comparison of multiple biological interaction networks (BMC Bioinformatics (2016) 17 (185) DOI: 10.1186/s12859-016-1013-x)"
            },
            "note": "Correction of URL as web location was changed.",
            "pmcid": "PMC6869179",
            "pmid": "31747901"
        },
        {
            "doi": "10.1186/s12859-016-1013-x",
            "metadata": {
                "abstract": "© 2016 Kuntal et al.Background: Network visualization and analysis tools aid in better understanding of complex biological systems. Furthermore, to understand the differences in behaviour of system(s) under various environmental conditions (e.g. stress, infection), comparing multiple networks becomes necessary. Such comparisons between multiple networks may help in asserting causation and in identifying key components of the studied biological system(s). Although many available network comparison methods exist, which employ techniques like network alignment and querying to compute pair-wise similarity between selected networks, most of them have limited features with respect to interactive visual comparison of multiple networks. Results: In this paper, we present CompNet - a graphical user interface based network comparison tool, which allows visual comparison of multiple networks based on various network metrics. CompNet allows interactive visualization of the union, intersection and/or complement regions of a selected set of networks. Different visualization features (e.g. pie-nodes, edge-pie matrix, etc.) aid in easy identification of the key nodes/interactions and their significance across the compared networks. The tool also allows one to perform network comparisons on the basis of neighbourhood architecture of constituent nodes and community compositions, a feature particularly useful while analyzing biological networks. To demonstrate the utility of CompNet, we have compared a (time-series) human gene-expression dataset, post-infection by two strains of Mycobacterium tuberculosis, overlaid on the human protein-protein interaction network. Using various functionalities of CompNet not only allowed us to comprehend changes in interaction patterns over the course of infection, but also helped in inferring the probable fates of the host cells upon infection by the two strains. Conclusions: CompNet is expected to be a valuable visual data mining tool and is freely available for academic use from http://metagenomics.atc.tcs.com/compnet/or http://121.241.184.233/compnet/",
                "authors": [
                    {
                        "name": "Dutta A."
                    },
                    {
                        "name": "Kuntal B.K."
                    },
                    {
                        "name": "Mande S.S."
                    }
                ],
                "citationCount": 17,
                "date": "2016-04-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CompNet: A GUI based tool for comparison of multiple biological interaction networks"
            },
            "pmcid": "PMC4845442",
            "pmid": "27112575"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}
