{
    "additionDate": "2019-11-14T19:57:59Z",
    "biotoolsCURIE": "biotools:FEV1",
    "biotoolsID": "FEV1",
    "confidence_flag": "tool",
    "description": "An Individualized Prediction Model for Long-term Lung Function Trajectory and Risk of COPD in the General Population",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://ipress.resp.med.ubc.ca/FraminghamFEV1/disclaimer.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://resp.core.ubc.ca/ipress/FraminghamFEV1",
    "lastUpdate": "2020-12-28T19:24:15Z",
    "name": "FEV1",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CHEST.2019.09.003",
            "metadata": {
                "abstract": "© 2019 American College of Chest PhysiciansBackground: Prediction of future lung function will enable the identification of individuals at high risk of developing COPD, but the trajectory of lung function decline varies greatly among individuals. This study involved the development and validation of an individualized prediction model of lung function trajectory and risk of airflow limitation in the general population. Methods: Data were obtained from the Framingham Offspring Cohort, which included 4,167 participants ≥ 20 years of age and who had ≥ 2 valid spirometry assessments. The primary outcome was prebronchodilator FEV1; the secondary outcome was the risk of airflow limitation (defined as FEV1/FVC less than the lower limit of normal). Mixed effects regression models were developed for individualized prediction, and a machine learning algorithm was used to determine essential predictors. The model was validated in two large, independent multicenter cohorts (N = 2,075 and 12,913, respectively). Results: With 20 common predictors, the model explained 79% of the variation in FEV1 decline in the derivation cohort. In two validation datasets, the model had low error in predicting FEV1 decline (root mean square error range, 0.18-0.22 L) and high discriminative power in predicting risk of airflow limitation (C-statistic range, 0.86-0.87). This model was implemented in a freely accessible website-based application, which allows prediction based on flexible sets of predictors (http://resp.core.ubc.ca/ipress/FraminghamFEV1). Conclusions: The individualized predictor is an accurate tool to predict long-term lung function trajectories and risk of airflow limitation in the general population. This model enables identifying individuals at higher risk of COPD, who can then be targeted for preventive therapies.",
                "authors": [
                    {
                        "name": "Adibi A."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "FitzGerald J.M."
                    },
                    {
                        "name": "Sadatsafavi M."
                    },
                    {
                        "name": "Safari A."
                    },
                    {
                        "name": "Sin D.D."
                    }
                ],
                "citationCount": 6,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Chest",
                "title": "An Individualized Prediction Model for Long-term Lung Function Trajectory and Risk of COPD in the General Population"
            },
            "pmid": "31542453"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
