{
    "additionDate": "2021-01-18T10:49:59Z",
    "biotoolsCURIE": "biotools:hiscf",
    "biotoolsID": "hiscf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hulun@ms.xjb.ac.cn",
            "typeEntity": "Person"
        }
    ],
    "description": "leveraging higher-order structures for clustering analysis in biological networks.\n\nMOTIVATION:Clustering analysis in a biological network is to group biological entities into functional modules, thus providing valuable insight into the understanding of complex biological systems. Existing clustering techniques make use of lower-order connectivity patterns at the level of individual biological entities and their connections, but few of them can take into account of higher-order connectivity patterns at the level of small network motifs. RESULTS:Here, we present a novel clustering framework, namely HiSCF, to identify functional modules based on the higher-order structure information available in a biological network. Taking advantage of higher-order Markov stochastic process, HiSCF is able to perform the clustering analysis by exploiting a variety of network motifs",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Structure clustering",
                    "uri": "http://edamontology.org/operation_2844"
                }
            ]
        }
    ],
    "homepage": "https://github.com/allenv5/HiSCF",
    "language": [
        "Java",
        "Julia",
        "Python"
    ],
    "lastUpdate": "2021-01-30T11:16:15Z",
    "name": "HiSCF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA775",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: Clustering analysis in a biological network is to group biological entities into functional modules, thus providing valuable insight into the understanding of complex biological systems. Existing clustering techniques make use of lower-order connectivity patterns at the level of individual biological entities and their connections, but few of them can take into account of higher-order connectivity patterns at the level of small network motifs. Results: Here, we present a novel clustering framework, namely HiSCF, to identify functional modules based on the higher-order structure information available in a biological network. Taking advantage of higher-order Markov stochastic process, HiSCF is able to perform the clustering analysis by exploiting a variety of network motifs. When compared with several state-of-the-art clustering models, HiSCF yields the best performance for two practical clustering applications, i.e. protein complex identification and gene co-expression module detection, in terms of accuracy. The promising performance of HiSCF demonstrates that the consideration of higher-order network motifs gains new insight into the analysis of biological networks, such as the identification of overlapping protein complexes and the inference of new signaling pathways, and also reveals the rich higher-order organizational structures presented in biological networks.",
                "authors": [
                    {
                        "name": "Hu L."
                    },
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Yan H."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HiSCF: Leveraging higher-order structures for clustering analysis in biological networks"
            },
            "pmid": "32931549"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
