{
    "accessibility": "Open access",
    "additionDate": "2022-02-15T08:47:57.369468Z",
    "biotoolsCURIE": "biotools:molup",
    "biotoolsID": "molup",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Maria J. Ramos"
        },
        {
            "name": "Nuno M. F. S. A. Cerqueira"
        },
        {
            "name": "Henrique S. Fernandes",
            "orcidid": "https://orcid.org/0000-0002-9280-1838"
        }
    ],
    "description": "molUP is a free VMD extension that allows you to open and save Gaussian files. This tool can be used to analyze results from Gaussian output files and prepare Gaussian input files.\n\nmolUP provides also a set of tools to adjust bond lengths, rotate angles and dihedral angles directly on VMD. With molUP, it is possible to add and remove atoms or molecules using VMD.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://biosim.pt/2019/02/08/molup-tutorial-1-start-a-qmmm-study/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://biosim.pt/molup/",
    "lastUpdate": "2023-05-05T08:47:17.387967Z",
    "name": "molUP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "henriquesfernandes",
    "publication": [
        {
            "doi": "10.1002/jcc.25189",
            "metadata": {
                "abstract": "The notable advances obtained by computational (bio)chemistry provided its widespread use in many areas of science, in particular, in the study of reaction mechanisms. These studies involve a huge number of complex calculations, which are often carried out using the Gaussian suite of programs. The preparation of input files and the analysis of the output files are not easy tasks and often involve laborious and complex steps. Taking this into account, we developed molUP: a VMD plugin that offers a complete set of tools that enhance the preparation of QM and ONIOM (QM/MM, QM/QM, and QM/QM/MM) calculations. The starting structures for these calculations can be imported from different chemical formats. A set of tools is available to help the user to examine or modify any geometry parameter. This includes the definition of layers in ONIOM calculations, choosing fixed atoms during geometry optimizations, the recalculation or adjustment of the atomic charges, performing SCANs or IRC calculations, etc. molUP also extracts the geometries from the output files as well as the energies of each of them. All of these tasks are performed in an interactive GUI that is extremely helpful for the user. MolUP was developed to be easy to handle by inexperienced users, but simultaneously to be a fast and flexible graphical interface to allow the advanced users to take full advantage of this plugin. The program is available, free of charges, for macOS, Linux, and Windows at the PortoBioComp page https://www.fc.up.pt/PortoBioComp/database/doku.php?id=molup. © 2018 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "M. F. S. A. Cerqueira N."
                    },
                    {
                        "name": "Ramos M.J."
                    },
                    {
                        "name": "S. Fernandes H."
                    }
                ],
                "citationCount": 24,
                "date": "2018-07-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "molUP: A VMD plugin to handle QM and ONIOM calculations using the gaussian software"
            },
            "pmid": "29464735"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "version": [
        "1.7.0"
    ]
}
