{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T13:20:26.291422Z",
    "biotoolsCURIE": "biotools:prolfqua",
    "biotoolsID": "prolfqua",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wew@fgcz.ethz.ch",
            "name": "Witold E. Wolski",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive R-package for proteomics differential expression analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Differential protein expression profiling",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fgcz/prolfqua",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:54:24.558845Z",
    "license": "MIT",
    "name": "prolfqua",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.2c00441",
            "metadata": {
                "abstract": "Mass spectrometry is widely used for quantitative proteomics studies, relative protein quantification, and differential expression analysis of proteins. There is a large variety of quantification software and analysis tools. Nevertheless, there is a need for a modular, easy-to-use application programming interface in R that transparently supports a variety of well principled statistical procedures to make applying them to proteomics data, comparing and understanding their differences easy. The prolfqua package integrates essential steps of the mass spectrometry-based differential expression analysis workflow: quality control, data normalization, protein aggregation, statistical modeling, hypothesis testing, and sample size estimation. The package makes integrating new data formats easy. It can be used to model simple experimental designs with a single explanatory variable and complex experiments with multiple factors and hypothesis testing. The implemented methods allow sensitive and specific differential expression analysis. Furthermore, the package implements benchmark functionality that can help to compare data acquisition, data preprocessing, or data modeling methods using a gold standard data set. The application programmer interface of prolfqua strives to be clear, predictable, discoverable, and consistent to make proteomics data analysis application development easy and exciting. Finally, the prolfqua R-package is available on GitHub https://github.com/fgcz/prolfqua, distributed under the MIT license. It runs on all platforms supported by the R free software environment for statistical computing and graphics.",
                "authors": [
                    {
                        "name": "Grossmann J."
                    },
                    {
                        "name": "Nanni P."
                    },
                    {
                        "name": "Panse C."
                    },
                    {
                        "name": "Schlapbach R."
                    },
                    {
                        "name": "Wolski W.E."
                    },
                    {
                        "name": "d'Errico M."
                    }
                ],
                "citationCount": 12,
                "date": "2023-04-07T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "prolfqua: A Comprehensive R-Package for Proteomics Differential Expression Analysis"
            },
            "pmcid": "PMC10088014",
            "pmid": "36939687"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
