{
    "additionDate": "2021-01-18T10:49:51Z",
    "biotoolsCURIE": "biotools:handle-on-qol",
    "biotoolsID": "handle-on-qol",
    "confidence_flag": "tool",
    "description": "A dedicated quality of life resource following the diagnosis and treatment of head and neck cancer.\n\nA unique online database of papers published on quality of life in head and neck cancer.\n\nHANDLE-ON-QOL is a unique online searchable database of all papers published from 1982 to present on quality of life in head and neck cancer that have used questionnaires.\n\nThis website uses cookies. By continuing to browse the site you are agreeing to our use of cookies. Accept More info.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.handle-on-qol.com",
    "lastUpdate": "2021-01-30T10:48:13Z",
    "name": "Handle-On-QOL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.BJOMS.2020.05.013",
            "metadata": {
                "abstract": "© 2020 The British Association of Oral and Maxillofacial SurgeonsMeasuring quality of life (QOL) after head and neck cancer (HNC), is rapidly becoming the standard of care. The Head and Neck Database Listing Evidence on QOL (Handle-On-QOL) is a dedicated QOL resource that includes articles published from 1982 onwards. The aim of this study was to assess the completeness of Handle-On-QOL, when compared with other non-specific search engines. Six years were selected at random; 1982, 1990, 1998, 2003, 2006, 2016. Four search engines were used (Medline, EMBASE, CINAHL, PsycINFO). Reporting followed PRISMA methodology. A total of 595 papers were assessed, of which 200 met the inclusion criteria. 186 papers were present on Handle-On-QOL, 243 were found on Handle-On-QOL for these six years, but not identified in the other searches, and 14 were missing from Handle-On-QOL. A search using standard engines generated a large number of irrelevant papers. Handle-On-QOL provides a comprehensive and accurate reflection of articles published using questionnaires to report QOL following HNC. This web-based repository (http://www.handle-on-qol.com) acts as a quick reference point for clinicians and researchers.",
                "authors": [
                    {
                        "name": "Kanatas A."
                    },
                    {
                        "name": "Rogers S.N."
                    },
                    {
                        "name": "Smith M."
                    },
                    {
                        "name": "Walshaw E.G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "British Journal of Oral and Maxillofacial Surgery",
                "title": "Handle-On-QOL: a dedicated quality of life resource following the diagnosis and treatment of head and neck cancer"
            },
            "pmid": "32891434"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Ear, nose and throat medicine",
            "uri": "http://edamontology.org/topic_3406"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
