{
    "additionDate": "2022-10-10T11:08:49.180048Z",
    "biotoolsCURIE": "biotools:prrdb",
    "biotoolsID": "prrdb",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/prrdb/info.html"
        }
    ],
    "description": "PRRDB is a database of pattern recognition receptors and their ligands.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/prrdb/info.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/prrdb/info.html",
    "lastUpdate": "2022-10-10T11:08:55.229285Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/prrdb/info.html"
        }
    ],
    "name": "Prrdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/1471-2164-9-180",
            "metadata": {
                "abstract": "Background: Recently in a number of studies, it has been demonstrated that the innate immune system doesn't merely acts as the first line of defense but provides critical signals for the development of specific adaptive immune response. Innate immune system employs a set of receptors called pattern recognition receptors (PRRs) that recognize evolutionarily conserved patterns from pathogens called pathogen associated molecular patterns (PAMPs). In order to assist scientific community, a database PRRDB has been developed that provides extensive information about pattern recognition receptors and their ligands. Results: The current version of database contains around 500 patterns recognizing receptors from 77 distinct organisms ranging from insects to human. This includes 177 Toll-like receptors, 124 are Scavenger receptors and 67 are Nucleotide Binding Site-Leucine repeats rich receptors. The database also provides information about 266 ligands that includes carbohydrates, proteins, nucleic acids, glycolipids, glycoproteins, lipopeptides. A number of web tools have been integrated in PRRDB in order to provide following services: i) searching on any field; ii) database browsing; and iii) BLAST search against the pattern-recognition receptors. PRRDB also provides external links to standard databases like Swiss-Prot and Pubmed. Conclusion: PRRDB is a unique database of its kind, which provides comprehensive information about innate immunity. This database will be very useful in designing effective adjuvant for subunit vaccine and in understanding role of innate immunity. The database is available from the URL's in the Availabiltiy and requirements section. © 2008 Lata and Raghava; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lata S."
                    },
                    {
                        "name": "Raghava G."
                    }
                ],
                "citationCount": 26,
                "date": "2008-04-18T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "PRRDB: A comprehensive database of pattern-recognition receptors and their ligands"
            },
            "pmcid": "PMC2346480",
            "pmid": "18423032"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
