{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T10:43:12.559914Z",
    "biotoolsCURIE": "biotools:pseu-st",
    "biotoolsID": "pseu-st",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhuyuh@jlu.edu.cn",
            "name": "Yuhui Zhu",
            "typeEntity": "Person"
        },
        {
            "name": "Lina Xie"
        },
        {
            "name": "Shutao Wang"
        },
        {
            "name": "Xinru Zhang"
        }
    ],
    "description": "A new stacked ensemble-learning method for identifying RNA pseudouridine sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jluzhangxinrubio/PseU-ST",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-18T10:43:12.564951Z",
    "license": "Not licensed",
    "name": "PseU-ST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2023.1121694",
            "metadata": {
                "abstract": "Background: Pseudouridine (Ψ) is one of the most abundant RNA modifications found in a variety of RNA types, and it plays a significant role in many biological processes. The key to studying the various biochemical functions and mechanisms of Ψ is to identify the Ψ sites. However, identifying Ψ sites using experimental methods is time-consuming and expensive. Therefore, it is necessary to develop computational methods that can accurately predict Ψ sites based on RNA sequence information. Methods: In this study, we proposed a new model called PseU-ST to identify Ψ sites in Homo sapiens (H. sapiens), Saccharomyces cerevisiae (S. cerevisiae), and Mus musculus (M. musculus). We selected the best six encoding schemes and four machine learning algorithms based on a comprehensive test of almost all of the RNA sequence encoding schemes available in the iLearnPlus software package, and selected the optimal features for each encoding scheme using chi-square and incremental feature selection algorithms. Then, we selected the optimal feature combination and the best base-classifier combination for each species through an extensive performance comparison and employed a stacking strategy to build the predictive model. Results: The results demonstrated that PseU-ST achieved better prediction performance compared with other existing models. The PseU-ST accuracy scores were 93.64%, 87.74%, and 89.64% on H_990, S_628, and M_944, respectively, representing increments of 13.94%, 6.05%, and 0.26%, respectively, higher than the best existing methods on the same benchmark training datasets. Conclusion: The data indicate that PseU-ST is a very competitive prediction model for identifying RNA Ψ sites in H. sapiens, M. musculus, and S. cerevisiae. In addition, we found that the Position-specific trinucleotide propensity based on single strand (PSTNPss) and Position-specific of three nucleotides (PS3) features play an important role in Ψ site identification. The source code for PseU-ST and the data are obtainable in our GitHub repository (https://github.com/jluzhangxinrubio/PseU-ST).",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "date": "2023-01-19T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "PseU-ST: A new stacked ensemble-learning method for identifying RNA pseudouridine sites"
            },
            "pmcid": "PMC9892456",
            "pmid": "36741328"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
