{"credit":[],"labels":{"topic":[{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Anatomy","uri":"http://edamontology.org/topic_3067"}]},"publication":[{"abstract":"© 2019The pelvis is consistently regarded as the most sexually dimorphic region of the human skeleton, and methods for sex estimation with the pelvic bones are usually very accurate. In this investigation, population-specific osteometric models for the assessment of sex with the pelvis were designed using a dataset provided by J.A. Serra (1938) that included 256 individuals (131 females and 125 males) from the Coimbra Identified Skeletal Collection and 38 metric variables. The models for sex estimation were operationalized through an online application and decision support system, CADOES. Different classification algorithms generated high accuracy models, ranging from 85% to 92%, with only three variables; and from 85.33% to 97.33%, with all 38 variables. CADOES conveys a probabilistic prediction of skeletal sex, as well as a suite of attributes with educational applicability in the fields of human skeletal anatomy and statistics. This study upholds the value of the pelvis for the estimation of skeletal sex and provides models for that can be applied with high accuracy and low bias.","authors":["d'Oliveira Coelho J.","Curate F."],"cit_count":1,"doi":"10.1016/J.FORSCIINT.2019.109873","journal":"Forensic Science International","pmid":"31382223","title":"CADOES: An interactive machine-learning approach for sex estimation with the pelvis","year":"2019-09-01"}],"summary":{"biotoolsCURIE":"biotools:CADOES","biotoolsID":"CADOES","description":"> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'pelvis', 'skeletal', 'sex' | An interactive machine-learning approach for sex estimation with the pelvis | The pelvis is consistently regarded as the most sexually dimorphic region of the human skeleton, and methods for sex estimation with the pelvic bones are usually very accurate. In this investigation, population-specific osteometric models for the assessment of sex with the pelvis were designed using a dataset provided by J. A. Serra (1938) that included 256 individuals (131 females and 125 males) from the Coimbra Identified Skeletal Collection and 38 metric variables. The models for sex estimation were operationalized through an online application and decision support system, CADOES. Different classification algorithms generated high accuracy models, ranging from 85% to 92%, with only three variables; and from 85.33% to 97.33%, with all 38 variables","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31382223","name":"CADOES"}}