
{
    "credit": [
        {
            "name": "Matteo Pellegrini Lab",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.pellegrini.mcdb.ucla.edu/Lab/Home.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://pellegrini-legacy.mcdb.ucla.edu/bs_seeker/USAGE.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Script"
        ],
        "topic": [
            {
                "term": "Epigenomics",
                "uri": "http://edamontology.org/topic_3173"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Bisulfite sequencing using next generation sequencers yields genome-wide measurements of DNA methylation at single nucleotide resolution. Traditional aligners are not designed for mapping bisulfite-treated reads, where the unmethylated Cs are converted to Ts. We have developed BS Seeker, an approach that converts the genome to a three-letter alphabet and uses Bowtie to align bisulfite-treated reads to a reference genome. It uses sequence tags to reduce mapping ambiguity. Post-processing of the alignments removes non-unique and low-quality mappings.Results: We tested our aligner on synthetic data, a bisulfite-converted Arabidopsis library, and human libraries generated from two different experimental protocols. We evaluated the performance of our approach and compared it to other bisulfite aligners. The results demonstrate that among the aligners tested, BS Seeker is more versatile and faster. When mapping to the human genome, BS Seeker generates alignments significantly faster than RMAP and BSMAP. Furthermore, BS Seeker is the only alignment tool that can explicitly account for tags which are generated by certain library construction protocols.Conclusions: BS Seeker provides fast and accurate mapping of bisulfite-converted reads. It can work with BS reads generated from the two different experimental protocols, and is able to efficiently map reads to large mammalian genomes. The Python program is freely available at http://pellegrini.mcdb.ucla.edu/BS_Seeker/BS_Seeker.html. © 2010 Chen et al; licensee BioMed Central Ltd.",
            "authors": [
                "Chen P.-Y.",
                "Cokus S.J.",
                "Pellegrini M."
            ],
            "cit_count": 150,
            "journal": "BMC Bioinformatics",
            "pmid": "20416082",
            "title": "BS Seeker: Precise mapping for bisulfite sequencing",
            "year": "2010-04-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bs_seeker",
        "biotoolsID": "bs_seeker",
        "description": "Mapping tool for bisulfite treated reads.",
        "homepage": "http://pellegrini.mcdb.ucla.edu/BS_Seeker/BS_Seeker.html",
        "name": "BS Seeker"
    }
}