{
    "additionDate": "2015-12-06T15:18:13Z",
    "biotoolsCURIE": "biotools:dotter",
    "biotoolsID": "dotter",
    "credit": [
        {
            "email": "seqtools@sanger.ac.uk",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A dot-matrix program with interactive greyscale rendering for genomic DNA and Protein sequence analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sonnhammer.sbc.su.se/Dotter.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence similarity plot",
                        "uri": "http://edamontology.org/data_2161"
                    }
                }
            ]
        }
    ],
    "homepage": "http://sonnhammer.sbc.su.se/Dotter.html",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Dotter",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1016/0378-1119(95)00714-8",
            "metadata": {
                "abstract": "Graphical dot-matrix plots can provide the most complete and detailed comparison of two sequences. Presented here is DOTTER2, a dot-plot program for X-windows which can compare DNA or protein sequences, and also DNA versus protein. The main novel feature of DOTTER is that the user can vary the stringency cutoff interactively, so that the dot-matrix only needs to be calculated once. This is possible thanks to a 'Greyramp tool' that was developed to change the displayed stringency of the matrix by dynamically changing the greyscale rendering of the dots. The Greyramp tool allows the user to interactively change the lower and upper score limit for the greyscale rendering. This allows exploration of the separation between signal and noise, and fine-grained visualization of different score levels in the dot-matrix. Other useful feature are dot-matrix compression, mouse-controlled zooming, sequence alignment display and saving/loading of dot-matrices. Since the matrix only has to be calculated once and since the algorightm is fast and linear in space, DOTTER is practical to use even for sequences as long as cosmids. DOTTER was integrated in the gene-modelling module of the genomic database system ACEDB. This was done via the homology viewer BLIXEM in a way that also allows segments from the BLAST suite of searching programs to be superimposed on top of the full dot-matrix. This feature can also be used for very quick finding of the strongest matches. As examples, we analyse a Caenorhabditis elegans cosmid with several tandem repeat families, and illustrate how DOTTER can improve gene modelling. © 1995.",
                "authors": [
                    {
                        "name": "Durbin R."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    }
                ],
                "citationCount": 636,
                "date": "1995-12-29T00:00:00Z",
                "journal": "Gene",
                "title": "A dot-matrix program with dynamic threshold control suited for genomic DNA and protein sequence analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
