
{
    "credit": [
        {
            "email": "adbecker@princeton.edu",
            "name": "Alexander D. Becker",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "Other",
            "url": "https://github.com/adbecker/tsiR/blob/master/DESCRIPTION"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Infectious disease",
                "uri": "http://edamontology.org/topic_3324"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "publication": [
        {
            "abstract": "tsiR is an open source software package implemented in the R programming language designed to analyze infectious disease time-series data. The software extends a well-studied and widely-applied algorithm, the time-series Susceptible-Infected-Recovered (TSIR) model, to infer parameters from incidence data, such as contact seasonality, and to forward simulate the underlying mechanistic model. The tsiR package aggregates a number of different fitting features previously described in the literature in a user-friendly way, providing support for their broader adoption in infectious disease research. Also included in tsiR are a number of diagnostic tools to assess the fit of the TSIR model. This package should be useful for researchers analyzing incidence data for fully-immunizing infectious diseases.",
            "authors": [
                "Becker A.D.",
                "Grenfell B.T."
            ],
            "cit_count": 0,
            "doi": "10.1371/journal.pone.0185528",
            "journal": "PloS one",
            "title": "tsiR: An R package for time-series Susceptible-Infected-Recovered models of epidemics",
            "type": "Primary",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tsir",
        "biotoolsID": "tsir",
        "description": "Open source software package designed to analyze infectious disease time-series data. The software extends a well-studied and widely-applied algorithm, the time-series Susceptible-Infected-Recovered (TSIR) model, to infer parameters from incidence data, such as contact seasonality, and to forward simulate the underlying mechanistic model.",
        "homepage": "https://github.com/adbecker/tsiR",
        "name": "tsiR"
    }
}