{
    "additionDate": "2018-06-02T06:45:41Z",
    "biotoolsCURIE": "biotools:tsir",
    "biotoolsID": "tsir",
    "credit": [
        {
            "email": "adbecker@princeton.edu",
            "name": "Alexander D. Becker",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open source software package designed to analyze infectious disease time-series data. The software extends a well-studied and widely-applied algorithm, the time-series Susceptible-Infected-Recovered (TSIR) model, to infer parameters from incidence data, such as contact seasonality, and to forward simulate the underlying mechanistic model.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "https://github.com/adbecker/tsiR/blob/master/DESCRIPTION"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/adbecker/tsiR",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "tsiR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0185528",
            "metadata": {
                "abstract": "© 2017 Becker, Grenfell. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.tsiR is an open source software package implemented in the R programming language designed to analyze infectious disease time-series data. The software extends a well-studied and widely-applied algorithm, the time-series Susceptible-Infected-Recovered (TSIR) model, to infer parameters from incidence data, such as contact seasonality, and to forward simulate the underlying mechanistic model. The tsiR package aggregates a number of different fitting features previously described in the literature in a user-friendly way, providing support for their broader adoption in infectious disease research. Also included in tsiR are a number of diagnostic tools to assess the fit of the TSIR model. This package should be useful for researchers analyzing incidence data for fully-immunizing infectious diseases.",
                "authors": [
                    {
                        "name": "Becker A.D."
                    },
                    {
                        "name": "Grenfell B.T."
                    }
                ],
                "citationCount": 15,
                "date": "2017-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TSIR: An R package for time-series susceptible-infected-recovered models of epidemics"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}