{"collectionID": [], "accessibility": [], "topic": [{"term": "Sequence analysis", "uri": "http://edamontology.org/topic_0080"}], "owner": "ELIXIR-ITA-PADOVA", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1109/TCBB.2014.2306830", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Beyond fixed-resolution alignment-free measures for mammalian enhancers sequence comparison", "abstract": "The cell-type diversity is to a large degree driven by transcription regulation, i.e., enhancers. It has been recently shown that in high-level eukaryotes enhancers rarely work alone, instead they collaborate by forming clusters of cis-regulatory modules (CRMs). Even if the binding of transcription factors is sequence-specific, the identification of functionally similar enhancers is very difficult. A similarity measure to detect related regulatory sequences is crucial to understand functional correlation between two enhancers. This will allow large-scale analyses, clustering and genome-wide classifications. In this paper we present Under<inf>2</inf>, a parameter-free alignment-free statistic based on variable-length words. As opposed to traditional alignment-free methods, which are based on fixed-length patterns or, in other words, tied to a fixed resolution, our statistic is built upon variable-length words, and thus multiple resolutions are allowed. This will capture the great variability of lengths of CRMs. We evaluate several alignment-free statistics on simulated data and real ChIP-seq sequences. The new statistic is highly successful in discriminating functionally related enhancers and, in almost all experiments, it outperforms fixed-resolution methods. Finally, experiments on mouse enhancers show that Under<inf>2</inf> can separate enhancers active in different tissues. Availability: http://www.dei.unipd.it/ ~ciompin/main/UnderIICRMS.html © 2004-2012 IEEE.", "citationCount": 12, "authors": [{"name": "Comin M."}, {"name": "Verzotto D."}], "date": "2014-01-01T00:00:00Z", "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics"}}, {"doi": "10.1186/1471-2105-15-S9-S1", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Assembly-free genome comparison based on next-generation sequencing reads and variable length patterns", "abstract": "© 2014 Comin and Schimd; licensee BioMed Central Ltd.Background: With the advent of Next-Generation Sequencing technologies (NGS), a large amount of short read data has been generated. If a reference genome is not available, the assembly of a template sequence is usually challenging because of repeats and the short length of reads. When NGS reads cannot be mapped onto a reference genome alignment-based methods are not applicable. However it is still possible to study the evolutionary relationship of unassembled genomes based on NGS data. Results: We present a parameter-free alignment-free method, called Under2, based on variable-length patterns, for the direct comparison of sets of NGS reads. We define a similarity measure using variable-length patterns, as well as reverses and reverse-complements, along with their statistical and syntactical properties. We evaluate several alignment-free statistics on the comparison of NGS reads coming from simulated and real genomes. In almost all simulations our method Under 2outperforms all other statistics. The performance gain becomes more evident when real genomes are used. Conclusion: The new alignment-free statistic is highly successful in discriminating related genomes based on NGS reads data. In almost all experiments, it outperforms traditional alignment-free statistics that are based on fixed length patterns.", "citationCount": 12, "authors": [{"name": "Comin M."}, {"name": "Schimd M."}], "date": "2014-09-10T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Provider"], "name": "ELIXIR-ITA-PADOVA", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Institute", "email": null}, {"typeRole": ["Primary contact"], "name": "Matteo Comin", "url": "http://www.dei.unipd.it/~ciompin/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "comin@dei.unipd.it"}], "biotoolsCURIE": "biotools:underiicrms", "elixirPlatform": [], "elixirNode": [], "version": ["1"], "elixir_badge": 0, "homepage": "http://www.dei.unipd.it/~ciompin/main/UnderIICRMS.html", "function": [{"note": "ChIP-Seq Data analysis", "input": [], "operation": [{"term": "Sequence analysis", "uri": "http://edamontology.org/operation_2403"}, {"term": "Nucleic acid sequence analysis", "uri": "http://edamontology.org/operation_2478"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:56Z", "otherID": [], "description": "Parameter-free Alignment-free comparison of regulatory sequences (cis-regulatory modules).  Assembly-free Genome Comparison based on Next-Generation Sequencing Reads and Variable Length Patterns.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [{"url": "http://www.dei.unipd.it/~ciompin/main/UnderIIREADS.html", "note": null, "type": "Other"}], "biotoolsID": "underiicrms", "additionDate": "2015-01-22T11:40:43Z", "name": "UnderIICRMS", "license": "Other", "documentation": [{"url": "http://www.dei.unipd.it/~ciompin/main/UnderIICRMS.html", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}