{
    "additionDate": "2021-01-18T10:04:51Z",
    "biotoolsCURIE": "biotools:rt-net",
    "biotoolsID": "rt-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Dante Mantini",
            "typeEntity": "Person"
        }
    ],
    "description": "real-time reconstruction of neural activity using high-density electroencephalography.\n\nRT-NET (real-time non-invasive electrophysiology toolbox), is a new software which can be used for online neural activity reconstruction from hdEEG. The goal is to allow researchers and neuroscientists to easily make use of the analysis steps for real-time brain reconstruction using hdEEG. Our toolbox will contribute to source-based neurofeedback experiments and to development of novel BCI applications based on hdEEG. Through RT-NET, it is possible to enable source-based neurofeedback experiments in one or two brain areas, and to visualize in 2D and 3D (on a 3D cortical model) the online brain activity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.nitrc.org/projects/rtnet",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-02-08T13:51:45Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/robertoguarnieri/rtnet"
        }
    ],
    "name": "RT-NET",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/S12021-020-09479-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).High-density electroencephalography (hdEEG) has been successfully used for large-scale investigations of neural activity in the healthy and diseased human brain. Because of their high computational demand, analyses of source-projected hdEEG data are typically performed offline. Here, we present a real-time noninvasive electrophysiology toolbox, RT-NET, which has been specifically developed for online reconstruction of neural activity using hdEEG. RT-NET relies on the Lab Streaming Layer for acquiring raw data from a large number of EEG amplifiers and for streaming the processed data to external applications. RT-NET estimates a spatial filter for artifact removal and source activity reconstruction using a calibration dataset. This spatial filter is then applied to the hdEEG data as they are acquired, thereby ensuring low latencies and computation times. Overall, our analyses show that RT-NET can estimate real-time neural activity with performance comparable to offline analysis methods. It may therefore enable the development of novel brain–computer interface applications such as source-based neurofeedback.",
                "authors": [
                    {
                        "name": "Guarnieri R."
                    },
                    {
                        "name": "Zhao M."
                    },
                    {
                        "name": "Taberna G.A."
                    },
                    {
                        "name": "Ganzetti M."
                    },
                    {
                        "name": "Swinnen S.P."
                    },
                    {
                        "name": "Mantini D."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "RT-NET: real-time reconstruction of neural activity using high-density electroencephalography"
            },
            "pmid": "32720212"
        }
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}