{
    "additionDate": "2021-03-19T09:09:01Z",
    "biotoolsCURIE": "biotools:stmf",
    "biotoolsID": "stmf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tomaz.curk@fri.uni-lj.si",
            "name": "Tomaž Curk",
            "typeEntity": "Person"
        }
    ],
    "description": "Sparse Tropical Matrix Factorization (STMF): Sparse data embedding and prediction by tropical matrix factorization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Ejmric/STMF",
    "lastUpdate": "2021-04-10T09:13:38Z",
    "name": "STMF",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04023-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Matrix factorization methods are linear models, with limited capability to model complex relations. In our work, we use tropical semiring to introduce non-linearity into matrix factorization models. We propose a method called Sparse Tropical Matrix Factorization (STMF) for the estimation of missing (unknown) values in sparse data. Results: We evaluate the efficiency of the STMF method on both synthetic data and biological data in the form of gene expression measurements downloaded from The Cancer Genome Atlas (TCGA) database. Tests on unique synthetic data showed that STMF approximation achieves a higher correlation than non-negative matrix factorization (NMF), which is unable to recover patterns effectively. On real data, STMF outperforms NMF on six out of nine gene expression datasets. While NMF assumes normal distribution and tends toward the mean value, STMF can better fit to extreme values and distributions. Conclusion: STMF is the first work that uses tropical semiring on sparse data. We show that in certain cases semirings are useful because they consider the structure, which is different and simpler to understand than it is with standard linear algebra.",
                "authors": [
                    {
                        "name": "Omanovic A."
                    },
                    {
                        "name": "Kazan H."
                    },
                    {
                        "name": "Oblak P."
                    },
                    {
                        "name": "Curk T."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Sparse data embedding and prediction by tropical matrix factorization"
            },
            "pmcid": "PMC7908717",
            "pmid": "33632116"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Pure mathematics",
            "uri": "http://edamontology.org/topic_3570"
        },
        {
            "term": "Tropical medicine",
            "uri": "http://edamontology.org/topic_3575"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}