{
    "additionDate": "2021-01-18T11:22:11Z",
    "biotoolsCURIE": "biotools:bigo",
    "biotoolsID": "bigo",
    "confidence_flag": "tool",
    "description": "A public health decision support system for measuring obesogenic behaviors of children in relation to their local environment. Inferring the Spatial Distribution of Physical Activity in Children Population from Characteristics of the Environment. Children and adolescents with obesity have a higher risk of developing various diseases later on, compared to children without obesity. The reasons why some children become obese are complex, and behaviour, the living environment, and public health policies all play a role. BigO collects and analyses anonymous data on children's behavioural patterns and their living environment. With advanced analytics BigO extracts data-driven evidence on which local factors are involved, and how these factors influence childhood obesity in Europe.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "homepage": "http://bigoprogram.eu",
    "lastUpdate": "2021-02-03T19:51:06Z",
    "name": "BigO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/EMBC44109.2020.9175361",
            "metadata": {
                "abstract": "© 2020 IEEE.Obesity is a complex disease and its prevalence depends on multiple factors related to the local socioeconomic, cultural and urban context of individuals. Many obesity prevention strategies and policies, however, are horizontal measures that do not depend on context-specific evidence. In this paper we present an overview of BigO (http://bigoprogram.eu), a system designed to collect objective behavioral data from children and adolescent populations as well as their environment in order to support public health authorities in formulating effective, context-specific policies and interventions addressing childhood obesity. We present an overview of the data acquisition, indicator extraction, data exploration and analysis components of the BigO system, as well as an account of its preliminary pilot application in 33 schools and 2 clinics in four European countries, involving over 4,200 participants.",
                "authors": [
                    {
                        "name": "Alagialoglou L."
                    },
                    {
                        "name": "Browne S."
                    },
                    {
                        "name": "Charmandari E."
                    },
                    {
                        "name": "DIou C."
                    },
                    {
                        "name": "Delopoulos A."
                    },
                    {
                        "name": "Doyle G."
                    },
                    {
                        "name": "Ferri D."
                    },
                    {
                        "name": "Filis K."
                    },
                    {
                        "name": "Filos D."
                    },
                    {
                        "name": "Hassapidou M."
                    },
                    {
                        "name": "Heimeier R."
                    },
                    {
                        "name": "Ioakimidis I."
                    },
                    {
                        "name": "Karavidopoulou Y."
                    },
                    {
                        "name": "Kassari P."
                    },
                    {
                        "name": "Kechadi T."
                    },
                    {
                        "name": "Kilintzis V."
                    },
                    {
                        "name": "Koukoula E."
                    },
                    {
                        "name": "Lekka I."
                    },
                    {
                        "name": "Maglaveras N."
                    },
                    {
                        "name": "Maramis C."
                    },
                    {
                        "name": "Mars M."
                    },
                    {
                        "name": "Ngoc Nguyen T.-A."
                    },
                    {
                        "name": "O'Donnell S."
                    },
                    {
                        "name": "O'Malley G."
                    },
                    {
                        "name": "Pagkalos I."
                    },
                    {
                        "name": "Papapanagiotou V."
                    },
                    {
                        "name": "Perez I."
                    },
                    {
                        "name": "Riviou K."
                    },
                    {
                        "name": "Sarafis I."
                    },
                    {
                        "name": "Stefanopoulos L."
                    },
                    {
                        "name": "Tragomalou A."
                    }
                ],
                "citationCount": 3,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS",
                "title": "BigO: A public health decision support system for measuring obesogenic behaviors of children in relation to their local environment"
            },
            "pmid": "33019308"
        },
        {
            "doi": "10.1109/EMBC44109.2020.9176246",
            "metadata": {
                "abstract": "© 2020 IEEE.Obesity affects a rising percentage of the children and adolescent population, contributing to decreased quality of life and increased risk for comorbidities. Although the major causes of obesity are known, the obesogenic behaviors manifest as a result of complex interactions of the individual with the living environment. For this reason, addressing childhood obesity remains a challenging problem for public health authorities. The BigO project (https://bigoprogram.eu) relies on large-scale behavioral and environmental data collection to create tools that support policy making and intervention design. In this work, we propose a novel analysis approach for modeling the expected population behavior as a function of the local environment. We experimentally evaluate this approach in predicting the expected physical activity level in small geographic regions using urban environment characteristics. Experiments on data collected from 156 children and adolescents verify the potential of the proposed approach. Specifically, we train models that predict the physical activity level in a region, achieving 81% leave-one-out accuracy. In addition, we exploit the model predictions to automatically visualize heatmaps of the expected population behavior in areas of interest, from which we draw useful insights. Overall, the predictive models and the automatic heatmaps are promising tools in gaining direct perception for the spatial distribution of the population's behavior, with potential uses by public health authorities.",
                "authors": [
                    {
                        "name": "Alagialoglou L."
                    },
                    {
                        "name": "Delopoulos A."
                    },
                    {
                        "name": "Diou C."
                    },
                    {
                        "name": "Papapanagiotou V."
                    },
                    {
                        "name": "Sarafis I."
                    }
                ],
                "citationCount": 2,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS",
                "title": "Inferring the Spatial Distribution of Physical Activity in Children Population from Characteristics of the Environment"
            },
            "pmid": "33019311"
        }
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
