{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T20:55:51.379111Z",
    "biotoolsCURIE": "biotools:myotube_analyzer",
    "biotoolsID": "myotube_analyzer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "simon.noe@student.kuleuven.be",
            "name": "Simon Noë",
            "typeEntity": "Person"
        },
        {
            "name": "Anja Van Campenhout"
        },
        {
            "name": "Jean-Marie Aerts"
        },
        {
            "name": "Kaat Desloovere"
        }
    ],
    "description": "The Myotube Analyzer is an open source app made specifically for the analysis of microscopic images taken of muscle stem cell cultures.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/SimonNoe/myotube-analyzer-app/blob/main/Manual.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SimonNoe/myotube-analyzer-app",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-09-05T20:55:51.382086Z",
    "license": "Not licensed",
    "name": "Myotube Analyzer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13395-022-00297-6",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: The analysis of in vitro cultures of human adult muscle stem cells obtained from biopsies delineates the potential of skeletal muscles and may help to understand altered muscle morphology in patients. In these analyses, the fusion index is a commonly used quantitative metric to assess the myogenic potency of the muscle stem cells. Since the fusion index only partly describes myogenic potency, we developed the Myotube Analyzer tool, which combines the definition of the fusion index with extra features of myonuclei and myotubes obtained from satellite cell cultures. Results: The software contains image adjustment and mask editing functions for preprocessing and semi-automatic segmentation, while other functions can be used to determine the features of nuclei and myotubes. The fusion index and a set of five novel parameters were tested for reliability and validity in a comparison between satellite cell cultures from children with cerebral palsy and typically developing children. These novel parameters quantified extra nucleus and myotube properties and can be used to describe nucleus clustering and myotube shape. Two analyzers who were trained in cell culture defined all parameters using the Myotube Analyzer app. Out of the six parameters, five had good reliability reflected by good intra-class correlation coefficients (> 0.75). Children with cerebral palsy were significantly different from the typically developing children (p < 0.05) for five parameters, and for three of the six parameters, these differences exceeded the minimal detectable differences. Conclusions: The Myotube Analyzer can be used for the analysis of fixed differentiated myoblast cultures with nuclear and MyHC staining. The app can calculate the fusion index, an already existing parameter, but also provides multiple new parameters to comprehensively describe myogenic potential in its output. The raw data used to determine these parameters are also available in the output. The parameters calculated by the tool can be used to detect differences between cultures from children with cerebral palsy and typically developing children. Since the program is open source, users can customize it to fit their own analysis requirements.",
                "authors": [
                    {
                        "name": "Aerts J.-M."
                    },
                    {
                        "name": "Corvelyn M."
                    },
                    {
                        "name": "Costamagna D."
                    },
                    {
                        "name": "Desloovere K."
                    },
                    {
                        "name": "Noe S."
                    },
                    {
                        "name": "Van Campenhout A."
                    },
                    {
                        "name": "Willems S."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Skeletal Muscle",
                "title": "The Myotube Analyzer: how to assess myogenic features in muscle stem cells"
            },
            "pmcid": "PMC9185954",
            "pmid": "35689270"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cell culture collection",
            "uri": "http://edamontology.org/topic_3340"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
