{
    "additionDate": "2024-01-02T02:33:37.131406Z",
    "biotoolsCURIE": "biotools:babelbrain",
    "biotoolsID": "babelbrain",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "An open-source application for prospective modeling of transcranial focused ultrasound for neuromodulation applications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://proteusmrighifu.github.io/BabelBrain",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:25:16.579708Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/ProteusMRIgHIFU/BabelBrain"
        }
    ],
    "name": "BabelBrain",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/tuffc.2023.3274046",
            "metadata": {
                "abstract": "BabelBrain is an open-source standalone graphic-user-interface application designed for studies of neuromodulation using transcranial-focused ultrasound (FUS). It calculates the transmitted acoustic field in the brain tissue, taking into account the distortion effects caused by the skull barrier. The simulation is prepared using scans from magnetic resonance imaging (MRI) and, if available, computed tomography (CT) and zero-echo time MRI scans. It also calculates the thermal effects based on a given ultrasound regime, such as the total duration of exposure, the duty cycle, and acoustic intensity. The tool is designed to work in tandem with neuronavigation and visualization software, such as 3-DSlicer. It uses image processing to prepare domains for ultrasound simulation and uses the BabelViscoFDTD library for transcranial modeling calculations. BabelBrain supports multiple GPU backends, including Metal, OpenCL, and CUDA, and works on all major operating systems including Linux, macOS, and Windows. This tool is particularly optimized for Apple ARM64 systems, which are common in brain imaging research. The article presents the modeling pipeline used in BabelBrain and a numerical study where different methods of acoustic properties mapping were tested to select the best method that can reproduce the transcranial pressure transmission efficiency reported in the literature.",
                "authors": [
                    {
                        "name": "Pichardo S."
                    }
                ],
                "citationCount": 5,
                "date": "2023-07-01T00:00:00Z",
                "journal": "IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control",
                "title": "BabelBrain: An Open-Source Application for Prospective Modeling of Transcranial Focused Ultrasound for Neuromodulation Applications"
            },
            "pmid": "37155375"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
