{
    "additionDate": "2018-05-07T17:48:02Z",
    "biotoolsCURIE": "biotools:cerena",
    "biotoolsID": "cerena",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/CERENADevelopers"
        }
    ],
    "description": "ChEmical REaction Network Analyzer—A Toolbox for the Simulation and Analysis of Stochastic Chemical Kinetics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cerenadevelopers.github.io/CERENA/wiki.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://cerenadevelopers.github.io/CERENA/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "CERENA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0146732",
            "metadata": {
                "abstract": "© 2016 Kazeroonian et al.Gene expression, signal transduction and many other cellular processes are subject to stochastic fluctuations. The analysis of these stochastic chemical kinetics is important for understanding cell-to-cell variability and its functional implications, but it is also challenging. A multitude of exact and approximate descriptions of stochastic chemical kinetics have been developed, however, tools to automatically generate the descriptions and compare their accuracy and computational efficiency are missing. In this manuscript we introduced CERENA, a toolbox for the analysis of stochastic chemical kinetics using Approximations of the Chemical Master Equation solution statistics. CERENA implements stochastic simulation algorithms and the finite state projection for microscopic descriptions of processes, the system size expansion and moment equations for meso- and macroscopic descriptions, as well as the novel conditional moment equations for a hybrid description. This unique collection of descriptions in a single toolbox facilitates the selection of appropriate modeling approaches. Unlike other software packages, the implementation of CERENA is completely general and allows, e.g., for time-dependent propensities and non-mass action kinetics. By providing SBML import, symbolic model generation and simulation using MEX-files, CERENA is user-friendly and computationally efficient. The availability of forward and adjoint sensitivity analyses allows for further studies such as parameter estimation and uncertainty analysis. The MATLAB code implementing CERENA is freely available from http://cerenadevelopers.github.io/CERENA/.",
                "authors": [
                    {
                        "name": "Kazeroonian A."
                    },
                    {
                        "name": "Frohlich F."
                    },
                    {
                        "name": "Raue A."
                    },
                    {
                        "name": "Theis F.J."
                    },
                    {
                        "name": "Hasenauer J."
                    }
                ],
                "citationCount": 21,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CERENA: ChEmical REaction network analyzer-a toolbox for the simulation and analysis of stochastic chemical kinetics"
            },
            "pmcid": "PMC4726759",
            "pmid": "26807911"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}