{
    "additionDate": "2018-05-06T15:18:57Z",
    "biotoolsCURIE": "biotools:algaepath",
    "biotoolsID": "algaepath",
    "credit": [
        {
            "email": "sarah321@mail.ncku.edu.tw",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive analysis of metabolic pathways using transcript abundance data from next-generation sequencing in green algae.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://algaepath.itps.ncku.edu.tw/algae_path/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://algaepath.itps.ncku.edu.tw/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "AlgaePath",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-196",
            "metadata": {
                "abstract": "Background: Algae are important non-vascular plants that have many research applications, including high species diversity, biofuel sources, and adsorption of heavy metals and, following processing, are used as ingredients in health supplements. The increasing availability of next-generation sequencing (NGS) data for algae genomes and transcriptomes has made the development of an integrated resource for retrieving gene expression data and metabolic pathway essential for functional analysis and systems biology. In a currently available resource, gene expression profiles and biological pathways are displayed separately, making it impossible to easily search current databases to identify the cellular response mechanisms. Therefore, in this work the novel AlgaePath database was developed to retrieve transcript abundance profiles efficiently under various conditions in numerous metabolic pathways.Description: AlgaePath is a web-based database that integrates gene information, biological pathways, and NGS datasets for the green algae Chlamydomonas reinhardtii and Neodesmus sp. UTEX 2219-4. Users can search this database to identify transcript abundance profiles and pathway information using five query pages (Gene Search, Pathway Search, Differentially Expressed Genes (DEGs) Search, Gene Group Analysis, and Co-expression Analysis). The transcript abundance data of 45 and four samples from C. reinhardtii and Neodesmus sp. UTEX 2219-4, respectively, can be obtained directly on pathway maps. Genes that are differentially expressed between two conditions can be identified using Folds Search. The Gene Group Analysis page includes a pathway enrichment analysis, and can be used to easily compare the transcript abundance profiles of functionally related genes on a map. Finally, the Co-expression Analysis page can be used to search for co-expressed transcripts of a target gene. The results of the searches will provide a valuable reference for designing further experiments and for elucidating critical mechanisms from high-throughput data.Conclusions: AlgaePath is an effective interface that can be used to clarify the transcript response mechanisms in different metabolic pathways under various conditions. Importantly, AlgaePath can be mined to identify critical mechanisms based on high-throughput sequencing. To our knowledge, AlgaePath is the most comprehensive resource for integrating numerous databases and analysis tools in algae. The system can be accessed freely online at http://algaepath.itps.ncku.edu.tw. © 2014 Zheng et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Zheng H.-Q."
                    },
                    {
                        "name": "Chiang-Hsieh Y.-F."
                    },
                    {
                        "name": "Chien C.-H."
                    },
                    {
                        "name": "Hsu B.-K.J."
                    },
                    {
                        "name": "Liu T.-L."
                    },
                    {
                        "name": "Chen C.-N.N."
                    },
                    {
                        "name": "Chang W.-C."
                    }
                ],
                "citationCount": 23,
                "date": "2014-03-14T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "AlgaePath: Comprehensive analysis of metabolic pathways using transcript abundance data from next-generation sequencing in green algae"
            },
            "pmcid": "PMC4028061",
            "pmid": "24628857"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}