
{
    "credit": [
        {
            "name": "SING Research Group",
            "typeRoles": [
                "Developer"
            ],
            "url": "http://www.sing-group.org"
        },
        {
            "name": "Bioscope Research Group",
            "typeRoles": [
                "Contributor"
            ],
            "url": "http://www.bioscopegroup.org"
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.sing-group.org/MLibrary/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.sing-group.org/MLibrary/index.php?option=com_content&view=article&id=83&Itemid=66"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "http://www.sing-group.org/MLibrary/index.php?option=com_content&view=section&layout=blog&id=8&Itemid=58"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry spectra",
                        "uri": "http://edamontology.org/data_0943"
                    }
                },
                {
                    "data": {
                        "term": "Peptide mass fingerprint",
                        "uri": "http://edamontology.org/data_0944"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Peptide identification",
                        "uri": "http://edamontology.org/data_0945"
                    }
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "Java"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "This work presents a novel database search engine - MLibrary - designed to assist the user in the detection and identification of androgenic anabolic steroids (AAS) and its metabolites by matrix assisted laser desorption/ ionization (MALDI) and mass spectrometry-based strategies. The detection of the AAS in the samples was accomplished by searching (i) the mass spectrometric (MS) spectra against the library developed to identify possible positives and (ii) by comparison of the tandem mass spectrometric (MS/MS) spectra produced after fragmentation of the possible positives with a complete set of spectra that have previously been assigned to the software. The urinary screening for anabolic agents plays a major role in anti-doping laboratories as they represent the most abused drug class in sports. With the help of the MLibrary software application, the use of MALDI techniques for doping control is simplified and the time for evaluation and interpretation of the results is reduced. To do so, the search engine takes as input several MALDI-TOF-MS and MALDI-TOF-MS/MS spectra. It aids the researcher in an automatic mode by identifying possible positives in a single MS analysis and then confirming their presence in tandem MS analysis by comparing the experimental tandem mass spectrometric data with the database. Furthermore, the search engine can, potentially, be further expanded to other compounds in addition to AASs. The applicability of the MLibrary tool is shown through the analysis of spiked urine samples. © 2013 Elsevier Inc. All rights reserved.",
            "authors": [
                "Galesio M.",
                "Lopez-Fdez H.",
                "Reboiro-Jato M.",
                "Gomez-Meire S.",
                "Glez-Pena D.",
                "Fdez-Riverola F.",
                "Lodeiro C.",
                "Diniz M.E.",
                "Capelo J.L."
            ],
            "cit_count": 6,
            "doi": "10.1016/j.steroids.2013.08.014",
            "journal": "Steroids",
            "pmid": "24036418",
            "title": "Speeding up the screening of steroids in urine: Development of a user-friendly library",
            "type": "Primary",
            "year": "2013-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mlibrary",
        "biotoolsID": "mlibrary",
        "description": "Database search engine developed to assist the user in the detection and identification of small compounds, such as anabolic androgenic steroids, using the soft ionisation technique Matrix Assisted Laser Desorption/Ionisation (MALDI) coupled with mass spectrometry. It compares the results of the experimental data with theoretic values included in the database. It simplifies the interpretation of the mass spectrometry data and reduces the amount of time required to analyze the results manually.",
        "homepage": "http://www.sing-group.org/MLibrary/",
        "name": "MLibrary",
        "version": [
            "1.0.0"
        ]
    }
}