{"credit":[{"email":"wessonwu@mail.ncku.edu.tw","name":"Wei-Sheng Wu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://databasecommons.org/database.jsp?db_id=652"}],"function":[{"operation":[{"term":"DNA transcription","uri":"http://edamontology.org/operation_0372"},{"term":"Transcription factor binding site prediction","uri":"http://edamontology.org/operation_0445"},{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"},{"term":"Promoter prediction","uri":"http://edamontology.org/operation_0440"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"DNA binding sites","uri":"http://edamontology.org/topic_3125"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"}]},"publication":[{"abstract":"This study presents the Yeast Promoter Atlas (YPA, http://ypa.ee.ncku.edu. tw/ or http://ypa.csbb.ntu.edu.tw/) database, which aims to collect comprehensive promoter features in Saccharomyces cerevisiae. YPA integrates nine kinds of promoter features including promoter sequences, genes' transcription boundaries-transcription start sites (TSSs), five prime untranslated regions (50-UTRs) and three prime untranslated regions (30UTRs), TATA boxes, transcription factor binding sites (TFBSs), nucleosome occupancy, DNA bendability, transcription factor (TF) binding, TF knockout expression and TF-TF physical interaction. YPA is designed to present data in a unified manner as many important observations are revealed only when these promoter features are considered altogether. For example, DNA rigidity can prevent nucleosome packaging, thereby making TFBSs in the rigid DNA regions more accessible to TFs. Integrating nucleosome occupancy, DNA bendability, TF binding, TF knockout expression and TFBS data helps to identify which TFBS is actually functional. In YPA, various promoter features can be accessed in a centralized and organized platform. Researchers can easily view if the TFBSs in an interested promoter are occupied by nucleosomes or located in a rigid DNA segment and know if the expression of the downstream gene responds to the knockout of the corresponding TFs. Compared to other established yeast promoter databases, YPA collects not only TFBSs but also many other promoter features to help biologists study transcriptional regulation. © The Author(s) 2010.","authors":["Chang D.T.-H.","Huang C.-Y.","Wu C.-Y.","Wu W.-S."],"cit_count":26,"journal":"Nucleic Acids Research","pmid":"21045055","title":"YPA: An integrated repository of promoter features in Saccharomyces cerevisiae","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:ypa","biotoolsID":"ypa","description":"Database that collects promoter features in Saccharomyces cerevisiae. It integrates nine kinds of promoter features including promoter sequences, genes transcription boundaries-transcription start sites (TSSs), five prime untranslated regions (5’-UTRs) and three prime untranslated regions (3’-UTRs), TATA boxes, transcription factor binding sites (TFBSs), nucleosome occupancy, DNA bendability, transcription factor (TF) binding, TF knockout expression and TF-TF physical interaction.","homepage":"http://ypa.ee.ncku.edu.tw/","name":"YPA"}}