{
    "additionDate": "2017-02-10T11:35:16Z",
    "biotoolsCURIE": "biotools:myhits",
    "biotoolsID": "myhits",
    "credit": [
        {
            "name": "Marco Pagni",
            "orcidid": "http://orcid.org/0000-0001-9292-9463",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute"
        }
    ],
    "description": "The MyHits server integrates several tools with a focus on protein annotation and the analysis of protein domains.  Guest users have access to tools such as ClustalW and T-Coffee and databases like Swiss-Prot, Prosite and Interpro.  Registration allows users to store their results in private databases, and is free for academic users.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://myhits.sib.swiss/cgi-bin/help"
        }
    ],
    "editPermission": {
        "authors": [
            "smoretti"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Switzerland"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein domain recognition",
                    "uri": "http://edamontology.org/operation_0246"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://myhits.sib.swiss",
    "lastUpdate": "2021-12-21T13:11:08.775438Z",
    "name": "MyHits",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "sduvaud",
    "publication": [
        {
            "metadata": {
                "abstract": "The MyHits web server (http://myhits.isb-sib.ch) is a new integrated service dedicated to the annotation of protein sequences and to the analysis of their domains and signatures. Guest users can use the system anonymously, with full access to (i) standard bioinformatics programs (e.g. PSI-BLAST, ClustalW, T-Coffee, Jalview); (ii) a large number of protein sequence databases, including standard (Swiss-Prot, TrEMBL) and locally developed databases (splice variants); (iii) databases of protein motifs (Prosite, Interpro); (iv) a precomputed list of matches ('hits') between the sequence and motif databases. All databases are updated on a weekly basis and the hit list is kept up to date incrementally. The MyHits server also includes a new collection of tools to generate graphical representations of pairwise and multiple sequence alignments including their annotated features. Free registration enables users to upload their own sequences and motifs to private databases. These are then made available through the same web interface and the same set of analytical tools. Registered users can manage their own sequences and annotations using only web tools and freeze their data in their private database for publication purposes. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Cerutti L."
                    },
                    {
                        "name": "Falquet L."
                    },
                    {
                        "name": "Ioannidis V."
                    },
                    {
                        "name": "Jongeneel C.V."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Zahn-Zabal M."
                    }
                ],
                "citationCount": 78,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MyHits: A new interactive resource for protein annotation and domain identification"
            },
            "pmid": "15215405"
        },
        {
            "metadata": {
                "abstract": "The MyHits web site (http://myhits.isb-sib.ch) is an integrated service dedicated to the analysis of protein sequences. Since its first description in 2004, both the user interface and the back end of the server were improved. A number of tools (e.g. MAFFT, Jacop, Dotlet, Jalview, ESTScan) were added or updated to improve the usability of the service. The MySQL schema and its associated API were revamped and the database engine (HitKeeper) was separated from the web interface. This paper summarizes the current status of the server, with an emphasis on the new services. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Cerutti L."
                    },
                    {
                        "name": "Falquet L."
                    },
                    {
                        "name": "Hau J."
                    },
                    {
                        "name": "Ioannidis V."
                    },
                    {
                        "name": "Jongeneel C.V."
                    },
                    {
                        "name": "Kuznetsov D."
                    },
                    {
                        "name": "Martin O."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Zahn-Zabal M."
                    }
                ],
                "citationCount": 146,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MyHits: Improvements to an interactive resource for analyzing protein sequences"
            },
            "pmid": "17545200"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
