{
    "additionDate": "2021-01-18T10:55:30Z",
    "biotoolsCURIE": "biotools:stonemod",
    "biotoolsID": "stonemod",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thongboonkerd@dr.com",
            "name": "Visith Thongboonkerd",
            "orcidid": "https://orcid.org/0000-0001-7865-0765",
            "typeEntity": "Person"
        }
    ],
    "description": "a database for kidney stone modulatory proteins with experimental evidence.\n\nStoneMod is the database of kidney stone (nephrolithiasis or urolithiasis) modulators, which provides the information of calcium oxalate crystal promoter and inhibitor proteins. These protein modulators play key roles in kidney stone formation processes involving crystallization, crystal growth, crystal aggregation, and crystal adhesion to renal tubular cells. Authors: Medical proteomics unit.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://www.stonemod.org",
    "lastUpdate": "2021-02-24T10:05:52Z",
    "name": "StoneMod",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-71730-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Better understanding of molecular mechanisms for kidney stone formation is required to improve management of kidney stone disease with better therapeutic outcome. Recent kidney stone research has indicated critical roles of a group of proteins, namely ‘stone modulators’, in promotion or inhibition of the stone formation. Nevertheless, such information is currently dispersed and difficult to obtain. Herein, we present the kidney stone modulator database (StoneMod), which is a curated resource by obtaining necessary information of such stone modulatory proteins, which can act as stone promoters or inhibitors, with experimental evidence from previously published studies. Currently, the StoneMod database contains 10, 16, 13, 8 modulatory proteins that affect calcium oxalate crystallization, crystal growth, crystal aggregation, and crystal adhesion on renal tubular cells, respectively. Informative details of each modulatory protein and PubMed links to the published articles are provided. Additionally, hyperlinks to other protein/gene databases (e.g., UniProtKB, Swiss-Prot, Human Protein Atlas, PeptideAtlas, and Ensembl) are made available for the users to obtain additional in-depth information of each protein. Moreover, this database provides a user-friendly web interface, in which the users can freely access to the information and/or submit their data to deposit or update. Database URL:https://www.stonemod.org.",
                "authors": [
                    {
                        "name": "Peerapen P."
                    },
                    {
                        "name": "Sassanarakkit S."
                    },
                    {
                        "name": "Thongboonkerd V."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "StoneMod: a database for kidney stone modulatory proteins with experimental evidence"
            },
            "pmcid": "PMC7493926",
            "pmid": "32934277"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ]
}
