{
    "accessibility": "Open access",
    "additionDate": "2018-06-26T06:52:51Z",
    "biotoolsCURIE": "biotools:sourcer",
    "biotoolsID": "sourcer",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "p.miller@lancaster.ac.uk",
            "name": "Poppy Miller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An R package for identifying important sources of infection. It implements a non-parametric source attribution model to attribute cases of disease to sources in Bayesian framework with source and type effects.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/sourceR/sourceR.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://cran.r-project.org/web/packages/sourceR/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Experiment report",
                        "uri": "http://edamontology.org/data_2531"
                    },
                    "format": [
                        {
                            "term": "Matrix format",
                            "uri": "http://edamontology.org/format_3033"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Heat map",
                        "uri": "http://edamontology.org/data_1636"
                    },
                    "format": [
                        {
                            "term": "Map format",
                            "uri": "http://edamontology.org/format_2060"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/sourceR/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:20Z",
    "license": "GPL-3.0",
    "maturity": "Emerging",
    "name": "SourceR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005564",
            "metadata": {
                "abstract": "© 2017 Miller et al.Zoonotic diseases are a major cause of morbidity, and productivity losses in both human and animal populations. Identifying the source of food-borne zoonoses (e.g. an animal reservoir or food product) is crucial for the identification and prioritisation of food safety interventions. For many zoonotic diseases it is difficult to attribute human cases to sources of infection because there is little epidemiological information on the cases. However, microbial strain typing allows zoonotic pathogens to be categorised, and the relative frequencies of the strain types among the sources and in human cases allows inference on the likely source of each infection. We introduce sourceR, an R package for quantitative source attribution, aimed at food-borne diseases. It implements a Bayesian model using strain-typed surveillance data from both human cases and source samples, capable of identifying important sources of infection. The model measures the force of infection from each source, allowing for varying survivability, pathogenicity and virulence of pathogen strains, and varying abilities of the sources to act as vehicles of infection. A Bayesian non-parametric (Dirichlet process) approach is used to cluster pathogen strain types by epidemiological behaviour, avoiding model overfitting and allowing detection of strain types associated with potentially high “virulence”. sourceR is demonstrated using Campylobacter jejuni isolate data collected in New Zealand between 2005 and 2008. Chicken from a particular poultry supplier was identified as the major source of campylobacteriosis, which is qualitatively similar to results of previous studies using the same dataset. Additionally, the software identifies a cluster of 9 multilocus sequence types with abnormally high ‘virulence’ in humans. sourceR enables straightforward attribution of cases of zoonotic infection to putative sources of infection. As sourceR develops, we intend it to become an important and flexible resource for food-borne disease attribution studies.",
                "authors": [
                    {
                        "name": "Miller P."
                    },
                    {
                        "name": "Marshall J."
                    },
                    {
                        "name": "French N."
                    },
                    {
                        "name": "Jewell C."
                    }
                ],
                "citationCount": 2,
                "date": "2017-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "sourceR: Classification and source attribution of infectious agents among heterogeneous populations"
            }
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}