{
    "additionDate": "2019-11-14T19:45:34Z",
    "biotoolsCURIE": "biotools:midb",
    "biotoolsID": "midb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Rahul.kanadia@uconn.edu",
            "name": "Rahul N. Kanadia",
            "orcidid": "https://orcid.org/0000-0001-7197-912X",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of new minor intron-containing genes and tissue-dependent retention and alternative splicing of minor introns | Welcome to the minor intron database (MIDB)! | Minor introns, or U12-type introns, were initially identified based on their divergent terminal dinucleotide sequences (Jackson, 1991) | MIDB contains the most recent information on minor introns and the genes they are found in, also called MIGs (minor intron-containing genes) | Species: Mus musculus Homo sapiens All",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                },
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "https://midb.pnb.uconn.edu",
    "lastUpdate": "2021-01-11T09:18:46Z",
    "name": "MIDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6046-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Mutations in minor spliceosome components such as U12 snRNA (cerebellar ataxia) and U4atac snRNA (microcephalic osteodysplastic primordial dwarfism type 1 (MOPD1)) result in tissue-specific symptoms. Given that the minor spliceosome is ubiquitously expressed, we hypothesized that these restricted phenotypes might be caused by the tissue-specific regulation of the minor spliceosome targets, i.e. minor intron-containing genes (MIGs). The current model of inefficient splicing is thought to apply to the regulation of the ~ 500 MIGs identified in the U12DB. However this database was created more than 10 years ago. Therefore, we first wanted to revisit the classification of minor introns in light of the most recent reference genome. We then sought to address specificity of MIG expression, minor intron retention, and alternative splicing (AS) across mouse and human tissues. Results: We employed position-weight matrices to obtain a comprehensive updated list of minor introns, consisting of 722 mouse and 770 human minor introns. These can be found in the Minor Intron DataBase (MIDB). Besides identification of 99% of the minor introns found in the U12DB, we also discovered ~ 150 new MIGs. We then analyzed the RNAseq data from eleven different mouse tissues, which revealed tissue-specific MIG expression and minor intron retention. Additionally, many minor introns were efficiently spliced compared to their flanking major introns. Finally, we identified several novel AS events across minor introns in both mouse and human, which were also tissue-dependent. Bioinformatics analysis revealed that several of the AS events could result in the production of novel tissue-specific proteins. Moreover, like the major introns, we found that these AS events were more prevalent in long minor introns, while retention was favoured in shorter introns. Conclusion: Here we show that minor intron splicing and AS across minor introns is a highly organised process that might be regulated in coordination with the major spliceosome in a tissue-specific manner. We have provided a framework to further study the impact of the minor spliceosome and the regulation of MIG expression. These findings may shed light on the mechanism underlying tissue-specific phenotypes in diseases associated with minor spliceosome inactivation. MIDB can be accessed at https://midb.pnb.uconn.edu.",
                "authors": [
                    {
                        "name": "Hyatt K.C."
                    },
                    {
                        "name": "Kanadia R.N."
                    },
                    {
                        "name": "Olthof A.M."
                    }
                ],
                "citationCount": 15,
                "date": "2019-08-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Minor intron splicing revisited: Identification of new minor intron-containing genes and tissue-dependent retention and alternative splicing of minor introns"
            },
            "pmcid": "PMC6717393",
            "pmid": "31470809"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}
