{
    "additionDate": "2019-11-14T18:38:08Z",
    "biotoolsCURIE": "biotools:SPDRank",
    "biotoolsID": "SPDRank",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'learning-to-rank', 'meaningless', 'BioAssay', 'ligand-based' | Learning-to-rank technique based on ignoring meaningless ranking orders between compounds | SPDRank is stochastic pairwise descent RankSVM method with ignoring meaningless ranking orders that used on Learning-to-Rank Technique based on Ignoring Meaningless Ranking Orders between Compounds",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/akiyamalab/SPDRank",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:38:08Z",
    "license": "MIT",
    "name": "SPDRank",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMGM.2019.07.009",
            "metadata": {
                "abstract": "© 2019 The AuthorsLearning-to-rank, which is a machine-learning technique for information retrieval, was recently introduced to ligand-based virtual screening to reduce the costs of developing a new drug. The quality of a rank prediction model depends on experimental data such as the compound activity values used for learning. However, activity values that contain a large error could lead to the observation of meaningless order relations at a certain rate. This motivated us to develop a novel learning-to-rank method that ignores two meaningless types of order ranking: those between compounds with similar activity and those between inactive compounds. We evaluated the proposed method using five high-throughput screening assay datasets from the PubChem BioAssay database. The results demonstrated that the proposed method could improve the accuracy of the prediction results by ignoring meaningless ranking orders to overcome the virtual screening problem. We confirmed that, although the proposed method is based on a simple idea, it facilitates accurate virtual screening. The source code is publicly available at https://github.com/akiyamalab/SPDRank.",
                "authors": [
                    {
                        "name": "Ohue M."
                    },
                    {
                        "name": "Suzuki S.D."
                    },
                    {
                        "name": "Akiyama Y."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Molecular Graphics and Modelling",
                "title": "Learning-to-rank technique based on ignoring meaningless ranking orders between compounds"
            },
            "pmid": "31377536"
        }
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ]
}